[
{
 "name": "Adams",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/55C985A6-1DD8-B71C-0E66552DB039164D.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nFrom the sweet little farm at the foot of Penn’s Hill to the gentleman’s country estate at Peace field, Adams National Historical Park is the story of “heroes, statesman, philosophers … and learned women” whose ideas and actions helped to transform thirteen disparate colonies into one united nation.\n"
 ]
},{
 "name": "Appalachian",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/AA071FC6-1DD8-B71C-07550F35390CBB43.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe Appalachian Trail is a 2,180+ mile long public footpath that traverses the scenic, wooded, pastoral, wild, and culturally resonant lands of the Appalachian Mountains. Conceived in 1921, built by private citizens, and completed in 1937, today the trail is managed by the National Park Service, US Forest Service, Appalachian Trail Conservancy, numerous state agencies and thousands of volunteers.\n"
 ]
},{
 "name": "Blackstone River Valley",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/FA505F83-155D-451F-6740E60BA73208CF.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe Blackstone River powered America's entry into the Age of Industry. The success of Samuel Slater's cotton spinning mill in Pawtucket, RI touched off a chain reaction that changed how people worked and where they lived, and continues to reverberate across the nation to this day. Come visit and see how this revolution transformed the landscape of the Blackstone Valley and then the United States.\n"
 ]
},{
 "name": "Boston",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/E8DD3F09-1DD8-B71C-0ED035D1C236E36C.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nDiscover how one city could be the Cradle of Liberty, site of the first major battle of American Revolution, and home to many who espoused that freedom can be extended to all.\n"
 ]
},{
 "name": "Boston African American",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/53DCD867-155D-451F-675763AE1D395F6E.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nCentered on the north slope of Beacon Hill, the African American community of 19th century Boston led the city and the nation in the fight against slavery and injustice. These remarkable men and women, together with their allies, were leaders in Abolition Movement, the Underground Railroad, the Civil War, and the early struggle for equal rights and education.\n"
 ]
},{
 "name": "Boston Harbor Islands",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/5CB34307-155D-451F-67938E455F4D03A9.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic",
  "walk",
  "hike"
 ],
 "source": "NPS",
 "reviews": [
  "\n. . . where you can walk a Civil War-era fort, visit historic lighthouses, explore tide pools, hike lush trails, camp under the stars, or relax while fishing, picnicking or swimming-all within reach of downtown Boston. Youth programs, visitor services, research, wildlife management, and more are coordinated on the park's 34 islands and peninsulas by the Boston Harbor Islands Partnership.\n"
 ]
},{
 "name": "Cape Cod",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/7A8EFB82-155D-451F-67BBA23B243F11CC.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe great Outer Beach described by Thoreau in the 1800s is protected within the national seashore. Forty miles of pristine sandy beach, marshes, ponds, and uplands support diverse species. Lighthouses, cultural landscapes, and wild cranberry bogs offer a glimpse of Cape Cod's past and continuing ways of life. Swimming beaches and walking and biking trails beckon today's visitors.\n"
 ]
},{
 "name": "Essex",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/86C6409E-155D-451F-6736A0AAAD55DC22.jpg",
 "tags": [
  "adventurous",
  "parks",
  "history"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe Essex National Heritage Area begins just 10 miles north of Boston and covers 500 square miles of eastern Massachusetts to the New Hampshire border. The Area includes hundreds of historical sites, miles of intact landscapes, glistening coastal regions and lifetimes of rich experiences that chronicle the history of our region and of our nation.\n"
 ]
},{
 "name": "Frederick Law Olmsted",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/E46D5ACA-1DD8-B71C-0E2702316DB4CE33.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nFrederick Law Olmsted (1822-1903) is recognized as the founder of American landscape architecture and the nation's foremost parkmaker. Olmsted moved his home to suburban Boston in 1883 and established the world's first full-scale professional office for the practice of landscape design. During the next century, his sons and successors perpetuated Olmsted's design ideals, philosophy, and influence.\n"
 ]
},{
 "name": "John Fitzgerald Kennedy",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/3E48B4E4-155D-451F-67517E6367E21C55.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nAs a boy, JFK’s parents never expected he would grow up to be president. Yet in his birthplace home he learned values that inspired a life in public service. His mother, Rose Kennedy, recreated her family’s first home to share her memories of those early years with visitors. We commemorate not only his early life, but the ideas and principles he left behind.\n"
 ]
},{
 "name": "John H. Chafee Blackstone River Valley",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/194A9801-1DD8-B71C-0E5BB5797FD4B92C.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic",
  "creative"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe Blackstone River runs from Worcester, MA to Providence, RI. Its waters powered the Slater Mill in Pawtucket, RI, America's first successful cotton spinning mill. This creative spark began the nation's transformation from Farm to Factory. Today, the Blackstone River Valley is a special type of National Park - a living landscape containing thousands of natural and historic treasures.\n"
 ]
},{
 "name": "Longfellow House Washington's Headquarters",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/48FDFA3F-1DD8-B71C-0ED85324E99EDE12.jpg",
 "tags": [
  "adventurous",
  "parks",
  "history",
  "unique"
 ],
 "source": "NPS",
 "reviews": [
  "\nLongfellow House-Washington's Headquarters National Historic Site preserves the home of Henry W. Longfellow, one of the world’s foremost 19th century poets. The house also served as headquarters for General George Washington during the Siege of Boston, July 1775 - April 1776. In addition to its rich history, the site offers unique opportunities to explore 19th century literature and arts.\n"
 ]
},{
 "name": "Lowell",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/BD265A6A-1DD8-B71B-0B1D233A0EB8B936.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nDiscover the Continuing Revolution. Lowell’s water-powered textile mills catapulted the nation – including immigrant families and early female factory workers – into an uncertain new industrial era. Nearly 200 years later, the changes that began here still reverberate in our shifting global economy. Explore Lowell, a living monument to the dynamic human story of the Industrial Revolution.\n"
 ]
},{
 "name": "Minute Man",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/50F8BB9D-1DD8-B71C-0EEF9D254FF85446.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nAt Minute Man National Historical Park the opening battle of the Revolution is brought to life as visitors explore the battlefields and structures associated with April 19, 1775, and witness the American revolutionary spirit through the writings of the Concord authors.\n"
 ]
},{
 "name": "New Bedford Whaling",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/4803CA62-155D-451F-67EF9F7CC4CFDBBC.jpg",
 "tags": [
  "adventurous",
  "parks",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\n\"The town itself is perhaps the dearest place to live in, in all New England..nowhere in all America will you find more patrician-like houses, parks and gardens more opulent, than in New Bedford…all these brave houses and flowery gardens came from the Atlantic, Pacific, and Indian oceans. One and all, they were harpooned and dragged up hither from the bottom of the sea.\"\nH. Melville, \"Moby-Dick\"\n"
 ]
},{
 "name": "New England",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/AD354005-155D-451F-673F2DA0E8F7A946.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic"
 ],
 "source": "NPS",
 "reviews": [
  "\nFrom the Sound to the Summits: the New England Trail covers 215 miles from Long Island Sound across long ridges to scenic mountain summits in Connecticut and Massachusetts. The trail offers panoramic vistas and close-ups of New England’s natural and cultural landscape: traprock ridges, historic village centers, farmlands, unfragmented forests, quiet streams, steep river valleys and waterfalls.\n"
 ]
},{
 "name": "Salem Maritime",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/8911DBF3-1DD8-B71C-0E7A3AD0330802D2.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic",
  "history"
 ],
 "source": "NPS",
 "reviews": [
  "\nEstablished on March 17, 1938 as the first National Historic Site in the United States, Salem Maritime National Historic Site consists of nine acres of land and twelve historic structures along the Salem waterfront, as well as a downtown visitor center. Located in the urban setting of Salem, the park preserves and interprets over 600 years of New England's maritime history and global connections.\n"
 ]
},{
 "name": "Saugus Iron Works",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/7D3B416C-155D-451F-675E3E1232F7D585.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic"
 ],
 "source": "NPS",
 "reviews": [
  "\nIn the 1600's, on the banks of the Saugus River, something extraordinary happened.  Explore the place where European iron makers brought their special skills to a young Massachusetts colony. This nine-acre National Park includes working waterwheels, forges, mills, an historic 17th century home, and a lush river basin.\n"
 ]
},{
 "name": "Springfield Armory",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/BF40F69E-1DD8-B71C-0EB94CBA1BD8022F.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic"
 ],
 "source": "NPS",
 "reviews": [
  "\nFor nearly two centuries, the US Armed Forces and American industry looked to Springfield Armory for innovative engineering and superior firearms. Springfield Armory National Historic Site commemorates the critical role of the nation’s first armory by preserving and interpreting the world's largest historic US military small arms collection, along with historic archives, buildings, and landscapes.\n"
 ]
},{
 "name": "The Last Green Valley",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/E6B0C836-1DD8-B71C-0E709DA31A036B5D.jpg",
 "tags": [
  "adventurous",
  "parks",
  "historic"
 ],
 "source": "NPS",
 "reviews": [
  "\nDiscover the beauty of The Last Green Valley National Heritage Corridor!  Spanning 35 towns in northeastern Connecticut and south-central Massachusetts, The Last Green Valley is surprisingly rural and uniquely historic. With 1,100 square miles that are still 77% forests and farms, the pastoral landscape is interspersed with powerful rivers, mill villages, and vibrant town centers.\n"
 ]
},{
 "name": "Washington-Rochambeau Revolutionary Route",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/DBB87F90-155D-451F-6726CA2D6A3E1BDA.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nIn 1781, General Rochambeau’s French Army joined forces with General Washington’s Continental Army to fight the British Army in Yorktown, Virginia. With the French Navy in support, the allied armies moved hundreds of miles to become the largest troop movement of the American Revolution. The effort and cooperation between the two sides led to a victory at Yorktown and secured American independence.\n"
 ]
}]
