[
{
 "name": "Big Cypress",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/4DFA4F06-1DD8-B71C-0E41469F27C7802F.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe freshwaters of the Big Cypress Swamp, essential to the health of the neighboring Everglades, support the rich marine estuaries along Florida's southwest coast. Protecting over 729,000 acres of this vast swamp, Big Cypress National Preserve contains a mixture of tropical and temperate plant communities that are home to a diversity of wildlife, including the elusive Florida panther.\n"
 ]
},{
 "name": "Biscayne",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/872482C2-1DD8-B71C-0E2E432FA165042C.jpg",
 "tags": [
  "adventurous",
  "parks",
  "history"
 ],
 "source": "NPS",
 "reviews": [
  "\nWithin sight of downtown Miami, yet worlds away, Biscayne protects a rare combination of aquamarine waters, emerald islands, and fish-bejeweled coral reefs. Here too is evidence of 10,000 years of human history, from pirates and shipwrecks to pineapple farmers and presidents. Outdoors enthusiasts can boat, snorkel, camp, watch wildlife…or simply relax in a rocking chair gazing out over the bay.\n"
 ]
},{
 "name": "Canaveral",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/16EDC421-1DD8-B71C-0E71AEABF86D0476.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nSince ancient times, this barrier island has provided sanctuary to both people and wildlife. Many threatened and endangered species find refuge here, including sea turtles who nest on its shores. Like first natives and early settlers, you too can find tranquility. Stroll down a wooded trail. Reflect on a pristine undeveloped shoreline - the way things used to be.\n"
 ]
},{
 "name": "Castillo de San Marcos",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/E5390BF0-1DD8-B71C-0E495C279485FCE6.jpg",
 "tags": [
  "adventurous",
  "parks",
  "history"
 ],
 "source": "NPS",
 "reviews": [
  "\nA monument not only of stone and mortar but of human determination and endurance, the Castillo de San Marcos symbolizes the clash between cultures which ultimately resulted in our uniquely unified nation.  Still resonant with the struggles of an earlier time, these original walls provide tangible evidence of America’s grim but remarkable history.\n"
 ]
},{
 "name": "De Soto",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/B4D12907-1DD8-B71C-0E39172EACE32027.jpg",
 "tags": [
  "adventurous",
  "parks",
  "history"
 ],
 "source": "NPS",
 "reviews": [
  "\nIn May 1539, Conquistador Hernando de Soto’s army of soldiers, hired mercenaries, craftsmen, and clergy made landfall in Tampa Bay. They were met with fierce resistance of indigenous people protecting their homelands. De Soto’s quest for glory and gold would be a four year, four thousand mile odyssey of intrigue, warfare, disease, and discovery that would form the history of the United States.\n"
 ]
},{
 "name": "Dry Tortugas",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/5D852AC0-1DD8-B71C-0758C05F0FAC6B3B.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nAlmost 70 miles (113 km) west of Key West lies the remote Dry Tortugas National Park. This 100-square mile park is mostly open water with seven small islands.  Accessible only by boat or seaplane, the park is known the world over as the home of magnificent Fort Jefferson, picturesque blue waters, superlative coral reefs and marine life, and the vast assortment of bird life that frequents the area.\n"
 ]
},{
 "name": "Everglades",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/CDE502D6-1DD8-B71C-07932322F48B6873.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nEverglades National Park protects an unparalleled landscape that provides important habitat for numerous rare and endangered species like the manatee,  American crocodile, and the elusive Florida panther.\nAn international treasure as well -  a World Heritage Site, International Biosphere Reserve, a Wetland of International Importance, and a specially protected area under the Cartagena Treaty.\n"
 ]
},{
 "name": "Fort Caroline",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/TIMU_hi1_beautyberry.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  null
 ]
},{
 "name": "Fort Matanzas",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/C03EEF4E-1DD8-B71C-0E3228DD6B14CD7A.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nThe ferry boat to Fort Matanzas is again operating after the completion of repairs to the park's dock.  Effective 2/27/20 ferry service will resume normal operating hours.  Boat trips depart every hour at half past; first trip departs at 9:30 am, final trip of the day departs at 4:30 pm.  All trips depart weather permitting.\n"
 ]
},{
 "name": "Gulf Islands",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/BC36CD87-1DD8-B71C-0EE70C81AED4F51A.jpg",
 "tags": [
  "adventurous",
  "parks"
 ],
 "source": "NPS",
 "reviews": [
  "\nWhat is it that entices people to the sea?  Poet John Masefield wrote, “I must go down to the seas again, for the call of the running tide is a wild call and a clear call that may not be denied.”  Millions of visitors are drawn to the islands in the northern Gulf of Mexico for the white sandy beaches, the aquamarine waters, a boat ride, a camping spot, a tour of an old fort, or a place to fish.\n"
 ]
},{
 "name": "Gullah/Geechee",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/4D10FA54-1DD8-B71C-0E2A24BAAECCBBC3.jpg",
 "tags": [
  "adventurous",
  "parks",
  "unique"
 ],
 "source": "NPS",
 "reviews": [
  "\nDesignated by Congress in 2006, the Gullah Geechee Cultural Heritage Corridor extends from Wilmington, North Carolina in the north to Jacksonville, Florida in the south. It is home to one of America's most unique cultures, a tradition first shaped by captive Africans brought to the southern United States from West Africa and continued in later generations by their descendents.\n"
 ]
},{
 "name": "Timucuan",
 "address": "",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": "https://www.nps.gov//customcf/apps/CMS_HandF/ParkSearchPics/825B390B-1DD8-B71C-0767CC9DF221C2B8.jpg",
 "tags": [
  "adventurous",
  "parks",
  "experience",
  "history"
 ],
 "source": "NPS",
 "reviews": [
  "\nVisit one of the last unspoiled coastal wetlands on the Atlantic Coast. Discover 6,000 years of human history and experience the beauty of salt marshes, coastal dunes, and hardwood hammocks.\nThe Timucuan Preserve includes Fort Caroline and Kingsley Plantation.\n"
 ]
}]
