[
{
 "name": "New York State Museum",
 "address": "Empire State Plaza",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/96/14/18/outside-of-the-museum.jpg",
 "tags": [
  "walking",
  "family",
  "free",
  "family",
  "free",
  "history",
  "library",
  "nature",
  "free",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282091-Reviews-New_York_State_Museum-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "We always enjoy visiting the NY State Museum, from the vast selection of exhibits, children’s play/ learning room, cafe & the top floor carousel, there is always more than enough to see & do to capture the interest & attention of my young son & his mom too! We highly recommend visiting here!",
  "I visited with my grandsons ages 2 and3. They enjoyed every minute. The loved the carousel.\nThey enjoyed the antique fire engines, sesame Street, subway train and Adirondack hall.thete is a hands-on play area with casts of animal tracks and various other play stations which are all hand on.\nThe 9/11 exhibit was not a good idea. They could not understand why no one would fix the broken fire engine. ",
  "Stopping at the visitors desk made the New York State Museum visit, and indeed our Albany visit, a special endeavor. Our greeter gave wonderful advice regarding must-see and must-do venues of the museum given the limited time. Walking through the boroughs of New York City, visiting hunters and trappers abodes, and riding an authentic merry-go-round were just a few of the experiences visitors will enjoy. This is a must see.",
  "This museum is sure to please the family.  There are hands on exhibits for children and interesting presentations for the older set.  For the value...Free admission...you can't go wrong.  Don't miss the carousel on the upper floor, but check for its operating times. There is even convenient parking next to it.",
  ".I have lived in Albany for 30 years and have visited the \"State Museum\" many times, most recently today to view several traveling photo exhibits. I realized that I have never written a review of it before, and it definitely merits a review of the highest excellence. In a state which is known for its political dysfunction (especially of late), they sure did this one right ! This is a very interesting, entertaining and worthwhile museum. It is free ( there is a receptacle for voluntary donations of no more than $5 a family, but no pressure is asserted to contribute). The permanent exhibits on the first floor are very interesting--New York City Metropolis and Adirondack Wilderness; an upper floor has smaller exhibits known as \"Windows on New York\" , along with a carousel. for which an admission is charged. While you can spend considerable time there, you don't have to commit a large chunk of time, in that you can get an appreciation of the exhibits through a leisurely stroll. It doesn’t overpower you or overwhelm you, but is certainly filled with much to see, very well presented.   They also have periodic, traveling exhibits of interest. They have an adjacent parking lot for which there may be a fee, at least on weekdays, not sure about weekends. There is also metered street parking, which can be tough to get on week days, but is pretty available on weekends. If in town for a few days, or if looking for a worthwhile stop while passing through, this museum is definitely suitbal for persons of all ages.",
  "The New York State Museum features a comprehensive display of minerals, along with a extensive exhibit on the World Trade Center Terror Attacks on 9/11, along with many interesting exhibits on birds, nature, the Adirondacks, and very complete exhibits on New York City, including an old 8th Avenue Subway Train.\n\nIt is not too overwhelming, and can be seen in 90 minutes to 2 hours.  Do not miss the 4th floor carousel, which is an architectural masterpiece and can be boarded for a ride as well.  Also, the New York State Library is very fascinating with much on local and state history as well.\n\nHas a very nice gift shop and many good restaurants are nearby.  All of this free or charge!\n\nWell worth the visit, especially on a rainy day!  Closed on Mondays.",
  "My wife's ancestors were some of the first European settlers to settle in North America. These people, from Holland came here to Fort Orange, they settled right here between this museum and the Hudson River. The museum had a special on the excavation of this early 1600's settlement. It was so well done! The museum is vast, it's free! We parked on the road out in front. I have to say these four UGLY gigantic buildings across the street - What city planner wanted \"The Empire\" in Star Wars for a motif!? This is maybe the ugliest city I have ever seen. Anyway, the museum is great!",
  "Fantastic museum with a huge variety of exhibits. Top notch. We went in expecting to get through in an hour or so, but ended up spending 4 hours. Very informative. ",
  "Based on previous low rated reviews I wasn’t sure what to expect but was pleasantly surprised.  My husband and I enjoyed our visit.  The museum was not dark and dreary as some stated.  It is small, which I liked.  We spent about an hour there.  We found many exhibits interesting. Growing up in the suburbs of NYC, we found the old subway train nostalgic and the 9/11 exhibit emotional. Many families were there since there was a special fossil activity for children.  I recommend visiting this museum.\n",
  "We always enjoy visiting the NY State Museum, from the vast selection of exhibits, children’s play/ learning room, cafe & the top floor carousel, there is always more than enough to see & do to capture the interest & attention of my young son & his mom too! We highly recommend visiting here!",
  "I love museums and this one is definately worth the visit. It's pretty large, so even though we have been there 3 times in 2 years, there's always a reason to go back and more to see. It's definately not as modern as some of the other state museums I've been to, but it does a good job with everything specific to New York. It has a very moving tribute to 9/11 and the first time we visited we spent quite a bit of time at that exhibit. On our 2nd visit we noticed a 9/11 construction site trailer that had become a memorial, but it was located on the opposite side of the museum (maybe for purposes of space). Be sure not to miss that as it's very moving. My daughter was looking for dinosaur exhibits and there isn't much in that catagory, but some interesting and educational extinct wildife exhibits including a reconstructed Mastodon.\nThe train car that you can walk through on it's platform really brings you back in time, and the history of immigrants and life in New York back at the turn of the last Century is my favorite part, complete with examples of old buildings & tenement housing, and store fronts and restaurants that are set up as if you are peering into a window through time. \nThe gift shop is top notch, but we always seem to miss the upstairs cafe since it has limited hours.\nWe love this museum and if you visit in summer there is a beautiful memorial fountain to all New Yorkers who served in WWII outside that is very large and spectacular.\nMy only wish is that there could be restaurants nearby."
 ]
},{
 "name": "USS Slater DE-766",
 "address": "Broadway and Quay Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/29/97/3d/uss-slater.jpg",
 "tags": [
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "family",
  "history",
  "history",
  "history",
  "tour",
  "kids",
  "knowledgeable",
  "kids",
  "tour",
  "tour",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d534392-Reviews-USS_Slater_DE_766-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "I would just like to praise the people at the USS Slater and all of the hard work they have done on the ship.  We have been here three times, and today was our fourth.  I go to school at nearby Rensselaer Polytechnic Institute and always look forward to seeing the Slater again year after year.  Our tour guide Tom was the best anyone could ask for, knowledgeable and entertaining and makes you really interested in the history of the ship, and we thoroughly enjoyed exchanging Navy stories with him from people we knew.  The tour began with a video introducing the Slater and why she was built.  After the regular tour was over, he then went ahead and gave us a tour of the engine rooms, which was a real thrill -- something I had not seen on any of my previous visits.  It's a testament to everyone there that even though this ship is now 75 years old, it still looks exactly like it did in 1945 -- what a tough little ship!\nOverall, I cannot recommend the USS Slater or Tom highly enough!",
  "DThis afternoon, August 9, 2019,  our 10-member family group visited the USS Slater. We ranged in age from 77 to 6.  We had been there about 10 years ago and the experience is much improved.  The tour lasted a little over an hour and the engine room tour about 45 minutes.\n\nThis is a restored Destroyer Escort which gives a very realistic picture of the conditions in which our sailors lived and fought carrying out their role in defending shipping of supplies to Britain during World War II. The ship is in excellent condition and there was ample time for hands on activity.  \n\nOur guide, Priscilla, was a wonderful narrator.   In particular, she was easy to understand.  She spoke clearly and slowly enough that I, who am hearing impaired, had no trouble understanding her.  She offered the opportunity to handle objects.   She solicited and answered questions thoroughly.  She was very pleasant and patient with us as we navigated the ship.  \n\nSome members of our group also toured the engine room and enjoyed that visit, as well..  Charles, the guide for that tour, was happy to answer questions and gave detailed explanations that interested our family members.  He, also was friendly and outgoing and clearly enjoyed his subject matter.  \n\nI would recommend this trip for any people who are interested in WW II history and, especially, the War in the Atlantic.",
  "So satisfied with touring this icon. The history told by our guide Evan was interesting and I don’t doubt for one minute his accuracy with all the fascinating facts he knew by heart. The ship is in terrific condition thanks to hundreds of volunteers that must be very passionate in keeping this important piece of Naval History alive. \nI agree this is the number on attraction in Albany. \nErnie and friend from AP",
  "Took my Grandchildren ages 6 to 25 any they learned alot. Really opened they eyes to the naval part of WWII.  Some of them had many questions about this huge part of history, which is barely taught in school today.",
  "The tour guide was very knowledgeable and very enthusiastic about his topic.  He was able to answer all questions that were asked.  He was also very patient with my kids.",
  "Like one TA reporter below, I have been on many boat/ship tours like this before, and this was probably the best experience of all.  Even though we did not get the best of guides, somehow the scale of the ship in particular put the whole Atlantic/Pacific German/Japanese WW11 into full perspective;  200 men cooped up in this small tub, the sea furiously trying to capsize them at tmes; being possibly torpedoed at any moment, or being the subject of a kamakazie attack from the air  -  life could be short!   \nOr perhaps it was the excellent state of preservation of the ship, or the little minor details you do not seem to get on the bigger ships, like the mess arrangements,  or the large variety of armamaents you can sit on/manouver/play with the guns, including the shells - again, unusual on such ship tours.   Must be good for kids too.\nWELL worth $8, and putting aside 1-2 hours if you are in/passing through, or near the town.",
  "All ages will love this tour. Very engaging volunteers & a fun trip. You don’t need to be into military things to enjoy this tour, but is a bonus if you are.\nVery hands on for kiddos as well. 4 & 6 year old had a blast.",
  "We decided to visit the USS Slater and see what it was like for the men out at sea during World War II. It ended up being a great experience filled with so much that we had never thought of. Our tour guide Greg, ended up adding to the experience for being such an enjoyable guide and person to talk to. He was very knowledgeable about everything in the boat and was very professional and friendly. it shocked us even more we we learned it was his first day there. Overall loved it and was so happy we went."
 ]
},{
 "name": "New York State Capitol",
 "address": "State St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/ae/8c/6d/new-york-state-capitol.jpg",
 "tags": [
  "tour",
  "free",
  "art",
  "tour",
  "art",
  "historic",
  "free",
  "tour",
  "tour",
  "structure",
  "historic",
  "tour",
  "tour",
  "learn",
  "tour",
  "eat",
  "walking",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282090-Reviews-New_York_State_Capitol-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Recently, I visited for the third time the NY State Capitol and it is just a wonderful place that can be revisited every few years.  Also, I have visited the Nation's Capitol as well as several State Capitols and I can attest that this one is even more impressive than our Nation's Capitol.  The free, one-hour guided tour is highly informative and, depending on the tour guide, you can get different historical information and information relating to the decorative elements of this unusual, tasteful and  ornate Capitol.  My recommendation is to make reservations if you visit   during the weekends, but  you may be able to get on a tour if there are \"no show\" reservations.  Regarding Albany, it is simply a shame that there is no plan to rescue entire neighborhoods built after the Civil War to accommodate the number of craftsmen that moved into the area to build the Capitol.  There is exquisite residential architecture that is just simply wasted!",
  "This is an absolutely beautiful building to tour featuring magnificent architecture and sculpture and art. There lots and lots of stairs to several floors, so wear appropriate footwear, but we'll worth the climb!",
  "The New York State Capitol tour offered free four times each day from the Visitor Services store on the main Concourse of the Empire State Plaza provides the very best historic tour of  unsurpassed art, stone carvings and 19th century architectural design in the Western Hemisphere.",
  "Went on the Ghost Tour of the Capitol around Halloween 2019.  The building has hand carved animals and people throughout.  The marble floors and great halls are elaborate and covered with depictions of historic events and times. The Ghost stories were an added benefit.  Learning about the spirits that are rumored to travel freely around, greatly enhanced the lure of the stately structure.",
  "Plan ahead because the building is not open on weekends, but if you sign up in advance, you can have a tour anyway. The building is amazing and a feat of architecture. Really a must see! ",
  "You can sign up for guided tours but I walked in for the DIY tour. Plenty to see and learn from self guided placards & no need to wait for the group! Good short stop on the way to NYS Museum & NYS Plaza.",
  "We took the self-guided tour and, had we scheduled a guided tour, would likely have a 5 star review -unfortunately, we did not have access to the chambers.  The building is outstanding and is one of the most important state capitols given the legacy of law and leaders who have passed through it's halls.  Just walking through the portrait gallery in the upper hall tells a tale of Presidential history.  Easy street parking and good spots to eat in the vicinity.  If it's cold, take the underground mall passage to the New York State History museum which is OUTSTANDING!",
  "We visited this place on October 8. There is visitor parking under the plaza. After the security check we went to the lobby were you can sign up for a guided tour.\nYou can do a self guided tour but you will not see the senate."
 ]
},{
 "name": "Washington Park",
 "address": "Madison Ave and Willet St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/51/ee/c1/washington-park.jpg",
 "tags": [
  "walk",
  "walking",
  "free",
  "walk",
  "walking",
  "walk",
  "historic",
  "walking",
  "parks",
  "sightseeing"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d277177-Reviews-Washington_Park-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "We came here for a quick walk to get some fresh air, and while it was maybe the wrong season (too cold for nice weather or flowers, and without the pretty fuss of the Christmas season), the park was still spacious and well-maintained.  There were still other people going for walks or runs, and there are bridges over the bodies of water, plus benches for people to sit and enjoy the scenery.  In warmer weather, it looks like it would be a lovely place for a picnic.",
  "Capital Winterlights display starts promptly with the 12 days of Christmas, but no one tells you so you don't realize it until you see the 3 French hens & 4 calling birds! Good variety of holiday displays and worth doing. Enjoyed walking the route in the daytime and driving at night. Cost $20. They need to tell people to turn off their headlights! Washington Park is smallish, so not as nice as Bright Nights at Forest Park in Springfield, MA.",
  "I really am so lucky to be able to have a park that has so many events to go and walk to for free. Between the free park musicals in the summer, tulip festivals, and farmers markets, it really is a gem. Even just taking a walk around the park and ping to the dog park that is there is cool.",
  "I walk through the park on a regular basis. It is always different. In the Spring there is the Tulip Festival, which is spectacular. During the summer there are several different festivals, ethnic and otherwise. Also, during July and August, in the park we have Park Playhouse with musical comedies which are very professionally done. Now, arrangements are being made for the holiday Festival of Lights, which is quite beautiful. Finally, at various times during the year, there are running and walking races. What a wonderful way to enjoy the park!  Washington Park is an asset to Albany and the surrounding community.",
  "Washington Park is a beautiful urban park that resembles parks designed by Frederick Law Olmsted; however, he didn't design this one.  Designers of this park copied Olmsted's ideas.  And, they did such a good job that many people mistake it for an Olmsted-designed park.\n\nThe park is located in Albany’s Washington Park Historic District and is surrounded by many historic buildings designed by famous architects. \n\nWashington Park Lake is one of the main features.  There are paths that lead to it. During my visit, there was a man fishing on the bank opposite the Lake House.  \n\nWashington Park Lake House is the primary landmark in the park.  It had features from the Spanish architectural style – terracotta and terrazzo composite.\n\nThe park had many memorials.  I visited several of them.  \n\nThe park is good for walking on streets that allow vehicles as well as footpaths.  Crossing over to the other side via a footbridge was popular with several walkers I saw.    \n\nOne can also drive on several roadways in the park.  \n\nDuring my visit, I did a combination of walking and driving.  \n\nThis park was a very relaxing place to be.\n\nThis was my final bit of sightseeing before heading home from vacation.\n\nI rate Washington Park at 4.50 and recommend a visit.\n\nIf you found this review helpful, please click THANK below."
 ]
},{
 "name": "Schuyler Mansion",
 "address": "32 Catherine St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/55/11/26/schuyler-mansion.jpg",
 "tags": [
  "tour",
  "knowledgeable",
  "learn",
  "history",
  "knowledgeable",
  "tour",
  "unique",
  "family",
  "free",
  "music",
  "food",
  "tour",
  "knowledgeable",
  "family",
  "history",
  "historic",
  "tour",
  "family",
  "walking",
  "tour",
  "knowledgeable",
  "tour",
  "art",
  "family",
  "history",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d263721-Reviews-Schuyler_Mansion-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wonderful tour with an emphasis on Alexander Hamilton - tour guide was very knowledgeable! I highly recommend this tour!",
  "This is a beautiful restored early American colonial home. Being an Albany resident I was fascinated to learn George Washington and Ben Franklin along with many others were once guests. Alexander Hamilton and Aaron Burr both have been through it’s doors and President Millard Fillmore even got married here! \nIt is a key piece of local and even National history that is truly worth exploring. Our guide was very knowledgeable and did a great job.",
  "I was caught off guard at the beautiful interior - the wall covering was unique, the spindles on the stairs and the authentic furniture pieces from the Schuyler family. Pictures were allowed - the rooms had wonderful light from the windows. You could ll but see a dance on the 2nd floor area. I appreciated the knowledge of the family shared by the tour guide until she began speculating on Schuyler's motivations regarding actions. I am so glad this mansion was preserved and with authentic pieces! There is a small free parking lot beside the mansion and restrooms within the visitor's center. The only way to enter the mansion is by taking the tour.",
  "Don't miss the twelfth night celebration (Saturday near Epiphany--January 6). Great way to round out the Christmas holidays--plenty of music, food, spirit and entertainment.",
  "I reserved space weeks in advance for our party of six for a focus tour of the Schuyler Mansion entitled \"When Alexander Hamilton Called Albany Home.\"  And the tour was spectacular!  We got a thorough tour of the Schuyler Mansion, but the in-depth narrative for this longer-than-usual guided tour was on Hamilton and his connection to the Schuyler family and the mansion.  It was in the home's beautiful front parlor that Hamilton was married to Eliza, daughter of the home's owner, Philip Schuyler.  And there is so much history -- Hamilton-related and otherwise -- imparted on this rich, interesting tour.  I don't know how many guides give this tour, but our guide -- Jessie  -- was special.  Informative, engaging and thoroughly knowledgeable of her subject matter, Jessie could not have been a better guide through this gorgeously curated, fascinating home.  The mansion is itself a great historic site and worth a visit.  If you can, reserve a space on the limited Hamilton focus tour; you will be treated to an extra layer of the home's fascinating history.",
  "We stopped by the mansion at 11am on a Sunday and found ourselves with a personal tour of the Schuyler mansion because there were no other visitors. Our tour guide was absolutely wonderful - I wish I had caught her name to thank her here. She spent about an hour with us in the mansion telling us all about Philip Schuyler and his very interesting family, walking through the rooms that most of the major Revolutionary war players would have also walked through.\n\nThe mansion is located in one of Albany's not-so-great neighborhoods; don't let that discourage you from visiting. There is a parking lot and it's very easy to find - I just wouldn't plan on wandering around the neighborhood after. There is a small exhibit in the visitor's center (it'll take you maybe 5-10 minutes), including a model of what they think the grounds looked like in Schuyler's day - definitely try to check that out before or after your tour.",
  "Wonderful tour with an emphasis on Alexander Hamilton - tour guide was very knowledgeable! I highly recommend this tour!",
  "Beautiful house and terrific, inexpensive tour. Would definitely drive here, good parking lot.  Tour guide answered lots of questions from the group.",
  "Despite their website saying they are open..... THEY'RE NOT, on a Sunday.\n\nWe went there this afternoon, and they are closed. They were setting up for a 2pm concert, and genuinely apologized that the website is not correct. They've only been aware of the mostly for several months, and can't seem able to correct and update. Pitiful!!!!",
  "We stopped here after visiting the Albany Institute of History and Art.  Ian was our guide and he knew everything about the house and family. Very interesting stories of how Albany and its residents took part in US history",
  "We recently toured the Schuyler Mansion and learned a great deal about the families that were influential in the development of Albany. Our guide shared information about the Schuyler and Van Rensselaer families as well as details about family life in the house. Our tour guide was excellent! The mansion has been restored with a combination of original furnishings and reproduction materials. This a hidden gem in Albany and does not get the attention it deserves!"
 ]
},{
 "name": "Albany Institute of History & Art",
 "address": "125 Washington Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/0c/a5/16/albany-institute-of-history.jpg",
 "tags": [
  "art",
  "free",
  "art",
  "art",
  "learn",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d207878-Reviews-Albany_Institute_of_History_Art-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "We found this museum on a miserable rainy day and were delighted to explore pieces from its diverse collection, an exhibit on a remarkable local artist and a phenomenal exhibit on the Hudson River School. There's a little cafe and a beautiful museum shop. It's been in downtown Albany for ages, and it's a wonderful way to spend a few hours. A real find.",
  "I was able to catch the exhibition on Vivtiorian Dresses.  It was well annotated. I enjoyed  reading about how these ornate dresses were constructed. Of course, the exhibition of Hudson River School of landscape paintings was  fantastic. ",
  "We went initially to view the costumes worn by the gentry in the 1800s which was excellent, but found so much more to visit. An Egyptian section complete with mummy, a large art collection, a section on commerce and trade in early Albany, statues and more, including a nice cafe and small museum book shop. Free parking when visiting the Museum.",
  "A great museum- not to big, not to small, but JUST right! Wonderful works of art representing the Hudson valley, beautiful sculptures, and a cafe with good coffee and macrons.  Nice way to spend a few hours in Albany.",
  "This museum is small but definitely worth the visit. It cost us $8 each as we had a AAA card discount. Loved the exhibits on the Schuyler sisters. We learned some interesting details like how one of the sisters was a spy during the Revolution. Also, it was interesting to learn more about the duel between Aaron Burr and Alexander Hamilton. There is even an ancient Egyptian exhibit with mummies. The Hudson River School art is a highlight with scenes from places we know like the Adirondacks and Lake George-simply lovely. Definitely plan a visit if you have a few hours to enjoy these treasures.",
  "After a hectic business trip it was a relief to find parking near the AIoH&A and enjoy a local immersion for two hours. World class exhibit on the Schuyler Sisters with Alex Hamilton relics; an unknown folk artist; local painter; children's book diorama artist; sculpture; ancient world; gift shop & cafe, I bookmarked this place for return visits when next in Albany. Lots of school programming going on all around us.",
  "The museum has an interesting exhibit but is small and unsensational.  Maybe worth an hour and a half on a rainy day.",
  "Have been here several times over the years for the special exhibitions.  We tend to get the passes at the library."
 ]
},{
 "name": "Crossgates",
 "address": "1 Crossgates Mall Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/47/27/b2/le-loin-couloir.jpg",
 "tags": [
  "family",
  "food",
  "walk",
  "food",
  "kids",
  "food",
  "eat",
  "drink",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d1161070-Reviews-Crossgates-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "On vacation in the Greater Albany area for several days, I had a Shop ‘til You Drop day.\n\nAfter checking out of a hotel on Wolf Road, I went to the Northway Shopping Center first.  I’d shopped Colonie Center in October and wanted to shop somewhere different on this trip, so I went to the Crossgates Mall.  It had been several years since I’d shopped there.\n\nSome of the anchor stores have changed since my last visit.  The larger stores now include Lord & Taylor, Macy's, and JC Penney.  Other well-known stores include Forever 21, Old Navy, the Apple Store, J Jill, Burlington, Aeropostale, Famous Footwear, DSW, Gap, Pandora, Dick's Sporting Goods, Wilson’s Leather, H & M, Oakley, Hollister, Zara, American Eagle Outfitter, Vans, Best Buy, and a Disney Store to name a few. \n\nThere were over 35 restaurants ~ everything from Wendy’s, Johnny Rocket’s, China Max, Dunkin’, and Starbucks to Nathan’s Family Deli, Uno Pizzeria & Grill, and Texas de Brazil.  \n\nCrossgates Mall also has an 18-screen IMAX Regal Cinema theater as well as two Hilton hotels.\n\nDuring my visit, I concentrated on Lord & Taylor because the closest one to me is in the Prudential Center in Boston and is difficult to get to.\n\nThe first item I liked was an Adidas Track Jacket.  It had features I really liked: classic styling with a geometric cut, comfortable raglan sleeves, side zip pockets, baseball collar, and rib-knit neck, cuffs and hem.  Originally $75.00, it was on sale at $56.25.  That was only 25% off.  It was not marked down enough for my liking.\n\nThere was a roomy drawstring-closure tote bag in a subdued grayish willow green at $30.00.\n\nNearby, I was drawn to the attractive display of Chanel’s Chance fragrances.  All four seemed to be floral-based. \n\nAt the Jewelry counters, I saw a pair of amethyst earrings; but, at $650.00, they were somewhat pricey.\n\nIn the Shoe Dept., I saw some pretty strappy shoes.\n\nThen, I went to other parts of the mall.\n\nOld Navy was having good sale with a lot of items marked down 50%.  \n\nRue 21 had a 25% off sale.\n\nI really enjoyed shopping at Lord & Taylor and browsing at several other stores.\n\nI rate Crossgates Mall at 5.0 and recommend adding it to one's Albany itinerary.\n\nIf you found this review helpful, please click THANK below.",
  "Whenever I am in the Albany area, I always include a stop at Crossgates.  First, as a large mall, I get a nice walk in simply wandering around.  Easy on/off from thruway and plenty of parking.  A good variety of options: movie theater, food, and stores.",
  "Visited Crossgates last week whilst on a trip from the UK to watch our son graduate from Siena College.\n\nGreat variety of shops on offer, and reasonably priced.",
  "A classic mall on the outskirts of Albany, NY between the town of Guilderland and the City. Nearby SUNY Albany. A varied mall that still keeps a good amount of activity and a lot of decent, well-run store. A decently sized movie theater and tasty food court as well. ",
  "We went there today because we were looking for after Christmas specials. We enjoy Crossgates, but do not go often because of the distance. Lots of stores...I enjoy looking at things before buying. Our kids love the Lego store and the 5 Below store. We also love the escape room!",
  "I'm in my early 30's, been going here my whole life and it's a great mall, don't get me wrong, BUT... it's just not the same and it lacks the variety of stores that used to be there. For example, other than Williams Sonoma there's no kitchen/food store when there was Gourmet Chef before, no toy store anymore (other than the Lego store), and no book store. There also used to be kid friendly, hands-on science related discovery type stores that were fun to go into and good places to find different and fun gifts. But on the positive side there are at least 6 \"anchor\" stores, a solid food court plus a variety of other actual restaurants, and a lot of quality businesses. There are also things to do like escape rooms, a huge movie theater, and arcades so it can be a full day or a great place for a date night. Bottom line, I'll be back and I'll continue to hope there will be a bit more variety next time because things do change.",
  "This is a very nice shopping mall. They have plenty of stores to suite everyone's needs. Also have excellent places to eat and drink.",
  "This is a great mall to shop at. I do windowshopping here and also get things from starbucks. I also eat dinner here occasionally."
 ]
},{
 "name": "Erastus Corning II Tower",
 "address": "5 Empire State Plz",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/37/c1/18/corning-tower.jpg",
 "tags": [
  "free",
  "free",
  "free",
  "free",
  "free",
  "walking",
  "art",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282274-Reviews-Erastus_Corning_II_Tower-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Corning Tower opened in 1973 and is the tallest building in upstate New York. Take the special elevator to the 42nd Floor Observation Deck for spectacular views of Downtown Albany.  On a clear day, you can see 3 states!  There's no charge for admission.  This is a must!!!",
  "The Corning Tower has a free observation deck that allows visitors to take in gorgeous views of the Helderberg Escarpment, Hudson River, and the Capitol District.  Access the elevators from the Plaza Level and head on up!",
  "This building is located in the Empire State Plaza a must stop when visiting Albany.It is next to the State Museum You can miles from the enclosed observation deck. The best thing its free.",
  "We missed going here the first day as they close at 4pm.  So we went up the next day.  Beautiful panoramic view of the city.  We also liked that it was free.",
  "This is quick and free and a must if in the area.  \n\nWith a little assistance from a nice guy managing the area, I hopped on the elevator that was sitting there ready to take people up to the Observation Deck.  It was Thursday afternoon and I was the only one taking the elevator up.  It's a quick ride.\n\nOnce at the top, besides the security officer, there were only three of us.  It was all indoors behind glass.  The views are terrific.  You can see the buildings below, and the mountains off in the distance.\n\nAs I walked up to the elevators they opened to take me back down.  Motion sensored?  And the ride down was quick.\n\nA great experience that was free and line-less and quick.",
  "Located in the heart of the Empire State Plaza, the 44-story Corning Tower is the tallest building in Albany, and the observation deck on the 42nd floor offers expansive views of the Hudson River Valley, Corning and its environs, and the plaza itself.  The tower is named after Erastus Corning, a former mayor.  A fast (16 mph) elevator, free of charge, whisks you to the observation level. You will not get a 360 degree view, as the west side has no windows. Other attractions within walking distance fro the tower, adjacent to the plaza are the New York State Museum, the very gothic Cathedral of the Immaculate Conception, and the Egg, a performing arts venue at the northeastern corner of the Plaza. Many buildings on the edge of the Plaza, as well as in the Tower, are offices for New York State government. Numerous pools and fountains are located in the Plaza.  Make a day of it if you have the time.",
  "This is the tallest building around and when the observation deck is open on the 42 floor, you get great views of the surrounding area.  There is interesting art work on both the Plaza and Concourse level of this building and it is part of the Empire State Plaza complex.",
  "It's just a thing to check off on your Albany trip or to kill to e if you're early for the capital tour. In a world where buildings are routinely taller than 40 floors, the Corning tower is not a novelty. The view was beautiful, we looked, and that was all. Extra star for the fast ride up- moderately entertaining"
 ]
},{
 "name": "Times Union Center",
 "address": "51 S Pearl St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/60/81/16/siena-college-graduation.jpg",
 "tags": [
  "music",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d207877-Reviews-Times_Union_Center-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great sight lines, easy to get to, just off the interstate and easy parking in two parking garages within a block. Great place for a concert or ice hockey!",
  "Great night out with Veterans at the TU enjoying the our favorite monster trucks and team. Redesign of the facility allows customers to now enjoy a huge enclosed front entrance with plenty of extras. Great seats, fun and venue! Thanks VetTix!",
  "What a wonderful show. The light show and the music is outstanding. The Christmas theme was great. Wonderful musical talent plus the Orchestra uses some local musicians in the program.",
  "Many of us were kicked out into snow while waiting for Uber or other rides. Show ended at 11PM & wanna be cops working for Times Union Center kicked us out at 11:21 into the snow & stating they wanted to go home. It’s a shame after spending $200 on tickets plus drinks at $13/beer they couldn’t let us safely wait inside for our rides. Very disappointing that they can’t treat other humans w/ respect. Kane Brown put on a wonderful show too bad it ended on a negative note.",
  "Noah's show was fresh and thoughtful.  His command of multiple languages and accents was absolutely hysterical! His ability to find humor at the edges of cultural differences and his ability to find the common human threads of funny was tear inducing.",
  "Went to see cirq de solei which was a \n is so poorly designed, i wont be back for anything. Really! I cant believe someone over the age of 6 designed this, and how did any adult sign off on this?",
  "I went with a dear friend to see Celine Dion here.  While she put on a great performance and the seats were good and comfortable, it is the facility and parking that caused an issue.  Being from out of town and limited knowledge of the area the parking while close really isn't marked very well.  There were police that didn't really help the traffic congestion. Once inside there was a funnel into three or four metal detectors, followed by the actual entrance.  It all seemed unorganized.  Now I am not sure if this happens for every event as this is the only one that I had been to. Like I said the arena was nice, it was just the parking and entrance that was an issue.",
  "We saw Celine Dion there and she was incredible. The venue was ok as getting in was a little crazy with the long lines for security. The floor seating was comfortable although it did seem like a smaller arena. "
 ]
},{
 "name": "Palace Theatre",
 "address": "19 Clinton Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/e6/ea/fb/palace-theatre.jpg",
 "tags": [
  "theatre",
  "theatre",
  "free",
  "theatre",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d2314777-Reviews-Palace_Theatre-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "My earlier review of April 10, 2019, was 5 star.  Not this time around.  I was denied entry to a concert because I brought along a compact camera that is considered \"professional\" and therefore forbidden.  It did not have a zoom lens or a large sensor.  It was slightly larger than pocket size, but the lens can detach from the body.  Evidently, this makes it a \"professional\" camera.  \n\nI have brought this same exact camera and lens to several prior concerts at the Palace Theatre.  I have always been careful to dim the LED display to not interfere with those seated nearby and to limit the photos.   \n\nOf course, I missed the usual sea of camera phones held high recording stills and video continually throughout the concert, many boasting image resolution higher than my camera.  (And, this is before photo \"stacking\" that can boast resolution further.) Maybe it's time to revisit the policy for all camera devices.  \n\nIt's a small consolation that the Palace is way behind Albany Times Union and NYC Beacon Theatre (among other venues) in booking name concert talent.  And I did not have to sit in those soiled-looking, thread-bare seats.  \n",
  "The Palace is nothing short of a gem from Albany's glory days. It speaks beautifully of a bygone era of big theaters hosting big name stars. The acoustics are very good, even in the highest seats, the staff is helpful and polite and even local parking is pretty good. Performers may disappoint, but The Palace never does.",
  "This is a very nice theatre, but not for a rock concert! Saw several people being thrown out because they wouldn’t stay near seats. Lighting on stage was nice. I would have loved to know you can’t get near stage before we purchased tickets because we would have traveled to another city. The staff was nice though.",
  "Drove down to Albany to see Jerry Seinfeld perform... After all this time it seems he is still in his prime nonstop laughs.. the palace is really nice with a broadway look and feel to it with all the blinking lights and posters.. seating was really good and offered a nice selection of beers.. offered free parking as well.. definitely recommend seeing a show here.. ",
  "Unlike most arenas (e.g. Times Union) and modern theatres, the space between seat rows, or \"pitch\", in the orchestra section is quite generous.  This leaves plenty of room for dancing in place to the music.  Beginning around Row K, the rows of seating are fairly banked, making it easier to see over those with big hair or headgear.  $4 soda, water, and candy is a refreshing change to Times Union high prices.  This theatre is the upstate equivalent to the NYC Beacon Theatre, in terms of fine acoustics, music acts and professional staff.  "
 ]
},{
 "name": "The Egg",
 "address": "Empire State Plaza Concourse Level",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/11/51/bd/the-egg.jpg",
 "tags": [
  "music",
  "walk",
  "affordable",
  "drink",
  "tour",
  "kids",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d207876-Reviews-The_Egg-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Not knowing what to expect, we decided to catch a show at the Egg. What a pleasant surprise. We were in the smaller of the two theaters - maybe about 500 seats. Great acoustics and not a bad seat in the house. Very intimate concert setting. A bonus is the on site parking which is only $5.00. It’s in the same building as the concert halls and the elevator from the garage takes you right to the lobby of the theater. (Take the exit for the concert venue and the “visitors garage” is right there) Overall great experience. ",
  "The Hart Auditorium is an awesome place for concerts. We got to enjoy Harry Connick Jr. and it was like being in a club. He and his band said they enjoyed playing at smaller venues and seemed to be having fun.",
  "After seeing over 50 shows, I can safely say The Egg is a wonderful venue to see live music. Having the option of two separate venues is also a plus for those lesser known and/or acoustic leaning acts that work better in a smaller more intimate setting. ",
  "The Egg hosts an interesting variety of shows and events.  It's worth a visit just for its unusual architecture and as a part of the Empire State Plaza.  There's a great view from any seat in either of the two theaters, and no problems with hearing. Parking is easy and reasonable in the lower parking decks, but only during nonworking hours of the State, such as nights and weekends.",
  "I've attended many performances in the confines of either the Hart or Swyer theaters, and are so happy with them.  Unless you are seated on the very edges of either theaters' seating, there isn't a bad seat to be had.  Parking is convenient with an underground location in the form of the Empire State Plaza's V lot.  Being sheltered from the weather, you can easily leave your coats in the car for the short walk to the elevators to the Concourse level.  The only criticism of the venue I can think of is you can only ride elevators up to the theaters.  Crowds can overwhelm the capacity of the elevators for awhile, especially when the shows let out, but it's a minor inconvenience at most.",
  "Really nice venue to see a band.  Seating was excellent and sound was great.  Affordable to all.  There is plenty of street parking after 6PM as well as the underground parking garage. ",
  "Very Very small venue. If you want a beer you will wait in line over 30 minutes, if you have to go to bathroom you will wait over 20 minutes . You also can't drink the beer in the venue. Way not worth it",
  "Not knowing what to expect, we decided to catch a show at the Egg. What a pleasant surprise. We were in the smaller of the two theaters - maybe about 500 seats. Great acoustics and not a bad seat in the house. Very intimate concert setting. A bonus is the on site parking which is only $5.00. It’s in the same building as the concert halls and the elevator from the garage takes you right to the lobby of the theater. (Take the exit for the concert venue and the “visitors garage” is right there) Overall great experience. ",
  "We wanted to like this building but the tour was boring.not for kids. The shape of the building is interesting and thats all. also not happy that I didn't know where to take a photo in front of the building. TBH, maybe they disclosed on the tour but my kids wanted to die from boredom so we had to exit early.",
  "The Hart Auditorium is an awesome place for concerts. We got to enjoy Harry Connick Jr. and it was like being in a club. He and his band said they enjoyed playing at smaller venues and seemed to be having fun.",
  "After seeing over 50 shows, I can safely say The Egg is a wonderful venue to see live music. Having the option of two separate venues is also a plus for those lesser known and/or acoustic leaning acts that work better in a smaller more intimate setting. "
 ]
},{
 "name": "Governor Nelson A. Rockefeller Empire State Plaza",
 "address": "100 S Mall Arterial",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/d5/12/8a/20160702-092022-largejpg.jpg",
 "tags": [
  "art",
  "walk",
  "art",
  "unique",
  "kids",
  "food",
  "walking",
  "wander",
  "art",
  "walk",
  "unique",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d277175-Reviews-Governor_Nelson_A_Rockefeller_Empire_State_Plaza-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "this is right across from the state museum which I think is the highlight of Albany\nif you want to walk up to the Carousel floor you have to do it form this plaza\ninteresting modern art\nwe liked the yellow one the most\nducks swimming in the pool\na solid 20 minute walk",
  "The layout is breathtaking and yet every little nook is functional. A great playground for kids, beautiful memorials for both fallen veterans and another for fallen police and corrections officers, a unique and wonderful civic center, the majestic Corning Tower with the Agency buildings and the incredibly long Swan Street building, plus an ice staking rink, wonderful sculptures, and room for two stages: it's all done in breathtaking marble. But the real treasures are all underground: the Concourse is lined with simply unbelievably great works of art, including but certainly not limited to an original Jackson Pollack oil from his yellow phase.",
  "This plaza has something for everyone.  First, architecturally, it is absolutely beautiful.  Lined with interesting agency buildings, the cultural education center and the egg, it sports a very large fountain/reflecting pool and plenty of walkways. The corning tower has an observation tower on the 42 floor.  Food trucks, vendors, farmers market booth provide food and collectibles.  There was even a CPR demonstration going on the day we were there.  Pick out something for lunch and sit on one of the many benches available and enjoy. ",
  "I researched and planned this visit for weeks but, when I got there, I found the access to elevators was blocked... on a saturday! The undergroud concourse had great artwork on display but I was very disappointed to miss the Plaza... it was a beautiful day too! Walking around the place, I got a feeling of \"Life After People\"...almost deserted...",
  "The plaza, which dates from the era of the Rockefeller governorship (1960s), is an example of mid-century futuristic design, with The Egg, a concert venue, dominating the eastern side of the plaza.  The State Museum is at the south end, a somewhat nondescript building given the magnificence of the Egg.  Below the plaza level is a mall with shops that are frequented by government workers and tourists alike.  It's very quiet on weekends, and most of the shops are closed, but the upper level is blissfully uncrowded and a great place to wander around and enjoy the beauty of the surroundings.",
  "this is right across from the state museum which I think is the highlight of Albany\nif you want to walk up to the Carousel floor you have to do it form this plaza\ninteresting modern art\nwe liked the yellow one the most\nducks swimming in the pool\na solid 20 minute walk",
  "Breathtaking. Rockerfeller obviously did not want to be outdone by his contemporaries from the Soviet era.",
  "Empire State Plaza was conceived by Gov. Nelson A Rockefeller after a visit by Princess Julianna of the Netherlands. He was embarrassed by the dilapidated buildings around the State Capitol and wanted to build something more reflective of the state's wealth and importance. Construction lasted from 1965 to 1976 at a total cost of almost $2 billion. ESP consists of 11 state office buildings with more than 11,000 employees. The tallest building is the Corning Tower (44 floors) with a great observation deck.  The most unique is The Egg (performing arts center).  All of the buildings are connected by a series of underground tunnels and concourses. At street level, the buildings surround a huge reflecting pool.  There is a Visitors Center on the concourse level (with a gift shop) offering free guided tours seasonally or you can explore on your own.  There is plenty of parking nearby and several restaurants.  Definitely worth a visit -- especially the Corning Tower Observation Deck."
 ]
},{
 "name": "Albany Pine Bush Preserve",
 "address": "New Karner Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/b8/be/b7/albany-pine-bush-preserve.jpg",
 "tags": [
  "learn",
  "parks",
  "history",
  "hike",
  "nature",
  "history",
  "nature",
  "hike",
  "learn",
  "kids",
  "learn",
  "parks",
  "history",
  "kids",
  "hike",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282167-Reviews-Albany_Pine_Bush_Preserve-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "My visit to the Albany Pine Bush Preserve started at the Visitor Center soon after its 9:00 AM opening.\n\nA plaque near the entrance shows that the Albany Pine Bush Preserve was declared a National Natural Landmark in 2014 by the U.S. Department of the Interior’s National Park Service.\n\nInside, there is a cancellation station for those who participate in the Passport to Your National Parks program.  There are two stamps to attach in the Passport.  The first is the conventional page stamp for site.  The second is a local sticker for the preserve with a drawings of blue lupine and the Karner Blue Butterfly.  The cancellation stamp reads:\nHudson River Valley NHA – the day’s date – Albany Pine Bush Preserve\nThe NHA stands for National Heritage Area.  The Hudson River Valley NHA extends from Saratoga Springs down to the New York City area.\n\nThe Visitor Center had a lot of exhibits.  I walked around to all the exhibits.  They included facts about the rarity of an inland pine barren and topics of protection of habitat, human history, restoration, geology, and ecology.  Many were interactive.  I noticed that youngsters in other parties really enjoyed those.\n\nI enjoyed the excellent, informative video titled “By Prescription” that explained how they maintain the habitat there.  I learned what a controlled burn was, how they set up for one, and how they conducted one.  And, with all that preparation needed, conditions would be right for such a burn only a few days a year.\n\nI learned that the preserve encompassed over 3,300 acres and is one of the largest of the 20 inland pine barrens in the world.  It was formed about 10,500 years ago when Glacial Lake Albany drained. \n\nThe preserve is home to the amazing amount of 1,500 species of plants and animals, including the endangered Karner Blue Butterfly whose life cycle depends on the wild blue lupine.  I learned where the name came from.  The butterfly was first identified and described by novelist Vladimir Nabokov.  It was enlightening to learn that he was also an entomologist, a scientist who studies insects.  Karner is a hamlet within the Town of Colonie and located half-way between Albany and Schenectady.  It was there that Nabokov first spotted the butterfly.\n\nThe Karner Classroom, down the hall from the main exhibits in the atrium, had a number of hands-on exhibits and activities to turn visitors into scientists.  There were samples of soils, seeds, snake skin, and more.  There was a microscope for an up-close look at things.  There was activity booklets to test one’s knowledge of what one learned and a machine to help one check the answers given.  I participated almost every activity there.  I enjoyed learning about the different types of soil there, the bark on trees, and what a snake skin looked like when magnified.\n\nThe gift shop, although relatively small, had a lot of things for sale that included T-shirts, sports caps, postcards, pins, coffee mugs, prints, refrigerator magnets, puzzles, small toys, some jewelry, crafts by regional artisans, and lots of books on nature-related subjects.  Prices were reasonable.  \n\nJust as I finished buying a few things in the gift shop, the very strong T-storms in the day’s forecast arrived and turned the lovely mostly-sunny day into its direct opposite.  The sky opened up with a couple of very heavy deluges over a half-hour period.   Several other visitors and I were trapped for awhile.  The rain altered my plans to trek at least one of the trails that day.  I returned for a brief trek the next day after a full daytrip to Schoharie attractions.  \n\nIn short, the exhibits and activities there are topnotch, and the preserve is one of the earth’s rarest habitats.\n\nI rate the Albany Pine Bush Preserve at 5.0 and highly recommend a visit for some easy trekking and to learn a few things.  \n\nI also recommend setting aside about 3 hours for this attraction, splitting time between the Visitor Center and the trails.\n\nIf you found this review helpful, please click THANK below.",
  "While Visiting our Daughter and Future Son In Law this past weekend, I made a reservation for us to go on a Snow Shoeing hike at Albany Pine Bush. The Preserve is located just outside of Albany and encompasses over 3000 acres of a Nationally recognized Landmark; specifically the Sand Dunes. The Discovery Center is extremely informative with many exhibits showing the diversity of this State Park.  Additionally they have many miles of Nature Trails that go through the park in many different sections. One of the trails incorporates an area that has the Karner Blue Butterfly which is listed as an endangered species. They also offer many programs for young children, families and adults alike. Which is what brought us here; a Snow Shoeing hike led by Sarah. The experience was amazing and we have already made plans to return for other events in the future.      ",
  "An interesting nature preserve of sand that is host to the endangered species of butterfly known as the Karner Blue butterfly. The preserve, itself, is one of the largest inland pine barrens in the world. There are a lot of great hiking trails through the area, and an interesting center that educates you about the history of how the preserve was formed, and of the wildlife that benefits from living there. A must if you are interested in ecology, preservation and a rare inland sandy pine barren. ",
  "Easy paths, a few routes, and a nice opportunity to get out in the woods close to the City.  And postings with information for those interested in what they’re seeing , both fauna and flora.",
  "Went to the discovery center to learn about pine bush preserve and then went for a hike around the trial. Interesting terrain in the middle of Albany. Fun day with kids",
  "My visit to the Albany Pine Bush Preserve started at the Visitor Center soon after its 9:00 AM opening.\n\nA plaque near the entrance shows that the Albany Pine Bush Preserve was declared a National Natural Landmark in 2014 by the U.S. Department of the Interior’s National Park Service.\n\nInside, there is a cancellation station for those who participate in the Passport to Your National Parks program.  There are two stamps to attach in the Passport.  The first is the conventional page stamp for site.  The second is a local sticker for the preserve with a drawings of blue lupine and the Karner Blue Butterfly.  The cancellation stamp reads:\nHudson River Valley NHA – the day’s date – Albany Pine Bush Preserve\nThe NHA stands for National Heritage Area.  The Hudson River Valley NHA extends from Saratoga Springs down to the New York City area.\n\nThe Visitor Center had a lot of exhibits.  I walked around to all the exhibits.  They included facts about the rarity of an inland pine barren and topics of protection of habitat, human history, restoration, geology, and ecology.  Many were interactive.  I noticed that youngsters in other parties really enjoyed those.\n\nI enjoyed the excellent, informative video titled “By Prescription” that explained how they maintain the habitat there.  I learned what a controlled burn was, how they set up for one, and how they conducted one.  And, with all that preparation needed, conditions would be right for such a burn only a few days a year.\n\nI learned that the preserve encompassed over 3,300 acres and is one of the largest of the 20 inland pine barrens in the world.  It was formed about 10,500 years ago when Glacial Lake Albany drained. \n\nThe preserve is home to the amazing amount of 1,500 species of plants and animals, including the endangered Karner Blue Butterfly whose life cycle depends on the wild blue lupine.  I learned where the name came from.  The butterfly was first identified and described by novelist Vladimir Nabokov.  It was enlightening to learn that he was also an entomologist, a scientist who studies insects.  Karner is a hamlet within the Town of Colonie and located half-way between Albany and Schenectady.  It was there that Nabokov first spotted the butterfly.\n\nThe Karner Classroom, down the hall from the main exhibits in the atrium, had a number of hands-on exhibits and activities to turn visitors into scientists.  There were samples of soils, seeds, snake skin, and more.  There was a microscope for an up-close look at things.  There was activity booklets to test one’s knowledge of what one learned and a machine to help one check the answers given.  I participated almost every activity there.  I enjoyed learning about the different types of soil there, the bark on trees, and what a snake skin looked like when magnified.\n\nThe gift shop, although relatively small, had a lot of things for sale that included T-shirts, sports caps, postcards, pins, coffee mugs, prints, refrigerator magnets, puzzles, small toys, some jewelry, crafts by regional artisans, and lots of books on nature-related subjects.  Prices were reasonable.  \n\nJust as I finished buying a few things in the gift shop, the very strong T-storms in the day’s forecast arrived and turned the lovely mostly-sunny day into its direct opposite.  The sky opened up with a couple of very heavy deluges over a half-hour period.   Several other visitors and I were trapped for awhile.  The rain altered my plans to trek at least one of the trails that day.  I returned for a brief trek the next day after a full daytrip to Schoharie attractions.  \n\nIn short, the exhibits and activities there are topnotch, and the preserve is one of the earth’s rarest habitats.\n\nI rate the Albany Pine Bush Preserve at 5.0 and highly recommend a visit for some easy trekking and to learn a few things.  \n\nI also recommend setting aside about 3 hours for this attraction, splitting time between the Visitor Center and the trails.\n\nIf you found this review helpful, please click THANK below.",
  "The visitors center was amazing.   You can rent a backpack with a laminated map and scavenger hunt pictures.   There is also a set of binoculars and a magnifying glass to get the true experience.   There are many trail options for shorter or longer hikes.  My kids had many questions that were answered by the interactive visitor center.  It was really a wonderful stop.  ",
  "Easy hiking some sloping hills but overall pleasant and easy hike, fun for kids lots of placards and a small museum. Sandy soil so no mud. Definitely use DEET because there are ticks unfortunately, which is basically the only down side. Highly reccomend "
 ]
},{
 "name": "The Stephen and Harriet Myers Residence",
 "address": "194 Livingston Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/7e/ce/54/the-myers-residence-front.jpg",
 "tags": [
  "historic",
  "history",
  "historic",
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "historic",
  "history",
  "family",
  "history",
  "historic",
  "history",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d11659110-Reviews-The_Stephen_and_Harriet_Myers_Residence-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have been very involved with the Stephen and Harriet Myers Residence and the Underground Railroad History Project. It is an historic site that is growing from the ground up. The story of the Residence and of Stephen and Harriet Myers is inspiring and amazing. It is a story that surprises as it is not well known. In addition to that the many involvements of young and old in the development of the project is remarkable. It is a treasure in the community and promises to get even better as time moves on!",
  "Its a diamond in the rough. An insight on the brave and courageous couple whose life-saving work was accomplished here.",
  "This site (that serves as a museum, historic site, and community-based heritage center) provides a wonderful introduction to the activities of individuals like Stephen and Harriet Myers, who contributed to the Underground Railroad in the Albany area and beyond. The information shared helps visitors build a more comprehensive understanding of the contributions of many men and women who supported people seeking freedom from enslavement and who contributed to the abolitionist movement. Learning about programs at the site (community gardens, teen programs, tours) is inspiring as well!",
  "A top history location to visit while in Albany.  The best part of the tour is the docent giving a verbal description of life for people in the Underground world.  They answered questions that made clear the life of a slave traveling; slaves did not necessarily travel at night with a lantern.  This museum is open after other Albany museums close; so visit other museums during the day, then visit this museum from 5PM to 8PM, then go have dinner.",
  "This small \"museum\" is located in a home that is currently in an unfinished state of rehab.  It is dedicated to understanding the role of Albany is helping freedom seekers on their way through the underground railroad.  Once finished, it will be a gem.  Be aware that there is not much parking and this a a 3 story home with no elevator.",
  "The Myers Residence was wonderful!  It's a small building and does not take long to complete a tour of (about an hour total) but is filled with neat bits of history.  The volunteers do a wonderful job telling a general story of the underground railroad efforts and the Myers' role in it.  Actively being restored to present the house more as it was.  You must stop in if you're in Albany and want to do something meaningful!",
  "Great historical tour, I forgot the lady's name that conducted the the tour but I left with greater knowledge about the underground railroad. I also ended up debunking misconceptions I had about the underground railroad previously given to me by sugarcoated history lessons. ",
  "We were welcomed into this historic home and given a personal introduction into the museum by the curators. The  introduction included a description of the museum as a community enterprise as well as the history of the house and a view into Stephen and Harriet Myers lives as they lived in this house.  The museum is small, not taking more that an hour to view but well worth taking into your itinerary . ",
  "We were in Albany for a long weekend and found this site. It is a work in progress, but the owners were kind and gracious. We arrived near closing time but the owner welcomed us in and sat with us in the living room to tell us the history of the house. He and his wife have done a lot of research into the Underground Railroad and linked this location to publicized meetings of vigilance committees. Very interesting history! The nonprofit also does a significant amount of outreach and educational programs with youth in the area. This is worth a visit. (Especially if you’ve gone to see the other famous house in the area, the Schuyler residence, which family kept enslaved persons.) ",
  "Me and my classmates visited the Stephen Myers house this past Saturday and it was amazing, the preservation of such a historic relic is a beautiful sight to see as well as the feeling of the history surrounding you is amazing.",
  "My wife and I made a visit to the Stephen and Harriet Myers home a must see during our trip to Albany for the holiday weekend. We enjoy learning about the local African American history wherever we travel.  The home is a time capsule full of rich architectural detail and is very impressive when you remember the time period.  Our tour guide was Mary Liz and she was friendly and very knowledgeable about the Myers and other local African American abolitionists in the Albany area. \n\nThe home has undergone and continues to go through extensive restoration  to preserve its rich history.  During the tour all I could think about are the conversations that took place within the walls to help escaped slaves and fight for basic human rights. As gentrification continues we are losing valuable monuments that celebrate the lesser known freedom fighters and the work and sacrifice they made at the risk of losing everything including their lives. \n\nIf you visit Albany, NY stop by to take in the history of the Myers!"
 ]
},{
 "name": "Chester A. Arthur Memorial Tomb",
 "address": "Albany Rural Cemetery Cemetery Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/38/12/77/the-tomb-and-accoutrement.jpg",
 "tags": [
  "pets",
  "history",
  "learn",
  "walk",
  "family",
  "history",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d4283464-Reviews-Chester_A_Arthur_Memorial_Tomb-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Albany Rural Cemetery is a fantastic place to take a walk on a sunny afternoon. There are many paved pathways, and the cemetery allows pets on leashes. There is so much history as the cemetery was planned in 1840 and opened in 1841. It is interesting to learn how they carved and moved some of the massive obeliisks that are throughout the cemetery. It is definitely worth visiting if you are interested in Albany's history.",
  "I was prompted to give a review so I couldn't resist the laugh of sharing that  it has been a year since I was last in the cemetery and I'm reasonably certain that it no different then any other of the multiple times I've seen it in my life and would bet it is the same as it looked when it was new and the President was first laid to rest. Don't expect much, it isn't like Kennedy's tomb in Arlington.",
  "Finding Arthur's grave is easier if you have a map of the cemetery.  It is on the corner of one section and is noticeable because of the flagpole beside it and the huge angel.  Other family members are buried in this same section.  ",
  "Nice stature of the 21st President in the United States of America. It’s well constructed and recommended ",
  "We really wanted to see this gravesite and searched for about 30 minutes before we found it.  It was worth the time.",
  "Visiting the Albany Rural Cemetery is worth it to see the history of Albany. I'll admit, Arthur's grave was an afterthought because we came to see Peggy Schuyler's grave and that of her father, Gen. Philip Schuyler. When we found out Arthur was here, we made a point of seeking him out too. Maps are provided at both entrances and it is easy to locate the graves. The cemetery is beautiful and the gates are open until 7 p.m.",
  "Small Albany rural cemetery. Grave is very easy to find. It's not a large tomb like a lot of the late 18th century presidents.",
  "Love to walk in cemeteries.  So much history.  Albany Rural has many dignitaries buried there, besides Chester Arthur. John boyd Thatcher, Mayor Corning and many more. Tombstone carvings done by stone masons many moons ago, unbelievable!!!! Also the veterans burial ground a must for our fallen soldiers. Much history, great walk, also tours offered occassionally. Call office for dates and times. "
 ]
},{
 "name": "Huck Finn's Playland",
 "address": "25 Erie Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/3d/26/13/huck-finn-s-playland.jpg",
 "tags": [
  "food",
  "kids",
  "kids",
  "family",
  "drink",
  "eat",
  "walk",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d8389741-Reviews-Huck_Finn_s_Playland-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Heck Finns playland was originally known when I was a child as Hoffman’s playland. It was a vital memory of my childhood living in the capital district. It was closed down and reopened in a different location as an adult. This place is beautiful for kids. It’s like a small fair for kids up to age 12 or so. Rides fair food and of course you cannot miss the fried dough. Oh and I didn’t mention that the adults can go shopping for furniture next door at Huck Finns warehouse ",
  "Small amusement park with ‘classic’ rides well-suited for the under-10-years-of-age-crowd.  All of the basics are there, including a small roller coaster perfect for toddlers.  The most remarkable thing about the park is the terrific staff.  All of the ride operators (and ticket agents) are warm, friendly, and sensitive to the little kids.  Great services and support.  Truly worth a couple of hours.",
  "Ok so I’m dating myself, here, but I first remember this Playland from the 1950’s when it was on Rt 9 in Latham and owned by the Hoffman family. It was pretty much the only fun thing to do in the Capital Region when I was a kid. Fast forward to its current\nReincarnation as Huck Finn’s Playland, this place is amazing. It is exactly the same as it was when I was a kid. It is immaculate,  and the rides are operated by clean cut adorable and polite young adults. My granddaughter and great nieces and nephews had a blast. One very cool thing is that it’s also close to Druthers and all the restaurants in that area, so after an hour or two of riding, you can practically walk to any number of great places to eat and drink. \nKudos to Huck Finns for preserving this important part of our community and doing it in such a classy way.",
  "Just very nice place. Clean and tidy. People who operated the rides were all polite and cared about you having fun. Small local peace of capital district history. Honestly they can barely be breaking even. Almost too good to be true. Reminds me of Catskills Game Farm that should of been helped to stay open. That too was a treasure. My kids and now one of my grandchildren have been here. Nice job to whom had an eye to make this happen. Thank you HuckFinn owner ...nice place!",
  "This is the best place to have fun with your children or grandchildren.  I took my children to Hoffman's Playland for years, and I was so happy when the rides were moved over to Huck Finn's Warehouse.  It's a great place to laugh and have some fun.  I plan to revisit this summer as soon as it opens.  "
 ]
},{
 "name": "Nine Pin Cider Works",
 "address": "929 Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/06/1b/ef/cute-place.jpg",
 "tags": [
  "walk",
  "free",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d6412410-Reviews-Nine_Pin_Cider_Works-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "There is a decent amount of parking on the side road and across the street of the cidery. There is a great deck/porch area for the summer. Huge variety of ciders and not overwhelmingly sweet. I didn't try all of them, but the earl grey tea was my favorite. It was not overly tea-like. There is a slight hint of tea, but there is a clear apple taste to it. I have had other tea ciders and they were too heavy on the tea. My favorite by far!",
  "I have high cider standards, so always walk into a new cider spot with a little trepidation. The staff here is fantastic and super friendly. They offer 4 and 9-cider flights, and have 11 of their offerings currently on tap. We opted to share a 9-flight and set out on figuring out which of the 2 to not try, with staff help. We ultimately settled on our 9, only to be surprised to have a mini-taster of the other two when we got our batch. Super nice! The ciders themselves were great. The base was flavorful and fresh - one of the better base ciders I've had around. We got into their flavored ones next, and while all were pretty good, there were definitely some stand-outs. The ginger was packed with ginger flavor and some heat, really fantastic. The cranberry was nice and sharp and very flavorful, and the spiced cranberry was even better - balanced with some chai and mulling spices. The peach was solidly good too. Nice assortment of bottles, cans, and other merch. Definitely seemed a popular spot, and I can see why. Check it out!",
  "my wife had a sampler of four different ciders, while I went straight to a glass of their ginger cider. Everything we tried was good (she let me take a sip of each of her ciders) but the ginger was definitely the best. We ended up buying some to take home.\n\nBe sure to note the rose mural on the building next door.  It was painted by the owner's father years before the cidery opened.",
  "Went to their event to carve a pumpkin and get a pint of cider with my daughter after work and we had a great time. The choice of pumpkins was great, they had newspaper down on the tables and all the cutting tool you could ever want to just sit and cut and carve your masterpiece. The original cider is my favorite so I had that, love this place and their product",
  "Our family of 3 spent a bit of our afternoon at Nine Pin. We each ordered a flight of 4 types of hard cider and shared a cheese & meat board and chicken basil pot pies. In my opinion the ciders all tasted about the same, except for the ginger cider. I was happy that the food was gluten free! There are board games to play and the atmosphere is carefree and casual.  "
 ]
},{
 "name": "Discover Albany Visitors Center",
 "address": "25 Quackenbush Sq",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/bd/ad/a7/albany-visitors-center.jpg",
 "tags": [
  "art",
  "history",
  "walking",
  "tour",
  "walking",
  "history",
  "free",
  "history",
  "art",
  "history",
  "tour",
  "free",
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282163-Reviews-Discover_Albany_Visitors_Center-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whether you know Albany well or not, this place should be your 1st stop to get info on city attractions & happenings.  The woman who helped us had a wealth of knowledge on what to do, where to park at different attractions, & some history of the city.  If you're a fan of the Hamilton musical, the Schulyers are a big part of this city with a special exhibit running at the Albany Institute of History & Art.  Also their mansion is where Alexander married Elizabeth.  Albany has colorful murals & dog sculptures at various spots around the city so the staffer gave us maps pertaining to them if we wanted to seek them out.  The dog sculptures are now indoors for the winter so we only saw 2 but it would be fun to see these whimsical creations around the city in the spring.  The visitor center itself has artwork displayed & a historical exhibit.",
  "We were walking to a restaurant and happened by the Heritage Visitors Center.  At first it seemed like a typical welcome center with booklets etc.  Then we noticed a room off the hall near the bathrooms.  WOW! What a cool museum.  This is a real gem, a wonderful place!  I highly recommend visiting.  To my surprise, such a great museum had no charge.  They also have a cute gift shop.",
  "Stop in at the Albany Visitors Center which has all the information one might want when visiting the capital of NY. The staff is well-versed and helpful. They have many brochures and handouts as well as a terrific self-guided walking tour. Also there are exhibits on early life in Albany and a comfortable theater where we watched short movie on the history of Albany.",
  "I wandered through the visitor center's displays.  They have a historical view of the history of Albany and the neighboring Quackenbush house.  It's free and gives good background info for the city.",
  "Whether you know Albany well or not, this place should be your 1st stop to get info on city attractions & happenings.  The woman who helped us had a wealth of knowledge on what to do, where to park at different attractions, & some history of the city.  If you're a fan of the Hamilton musical, the Schulyers are a big part of this city with a special exhibit running at the Albany Institute of History & Art.  Also their mansion is where Alexander married Elizabeth.  Albany has colorful murals & dog sculptures at various spots around the city so the staffer gave us maps pertaining to them if we wanted to seek them out.  The dog sculptures are now indoors for the winter so we only saw 2 but it would be fun to see these whimsical creations around the city in the spring.  The visitor center itself has artwork displayed & a historical exhibit.",
  "As probably for about all of these visitors Centers it is the place to find infos about what to be seen. THe clerk was friendly and provided lots of infos that actually made a difference in our tour of Albany. A good ressource...",
  "Finding this place is challenging and kind of like a well kept secret.  We thought we knew what we were looking for, and we were wrong.  But once we were there, we realized we had not allotted nearly enough time for our visit.  They not only have basic visitor center information and a small gift shop, but they have a very interesting museum on the history of the area.  We could have easily spent an hour or more here.  Note: when going through, start to the left.\n\nParking is a difficult and expensive all over town, and this area is no exception.  Do yourself a a favor - go down Spencer Street, and take a right on Montgomery to the end.  There is free parking under the highway ramp for the Visitors Center, and it is very convenient.",
  "We were walking to a restaurant and happened by the Heritage Visitors Center.  At first it seemed like a typical welcome center with booklets etc.  Then we noticed a room off the hall near the bathrooms.  WOW! What a cool museum.  This is a real gem, a wonderful place!  I highly recommend visiting.  To my surprise, such a great museum had no charge.  They also have a cute gift shop."
 ]
},{
 "name": "Empire State Plaza Convention Center",
 "address": "Empire State Plaza",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/46/8f/fc/architecture-and-the.jpg",
 "tags": [
  "performance",
  "family",
  "kids",
  "free",
  "walk",
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d1418734-Reviews-Empire_State_Plaza_Convention_Center-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lack of signs can get you lost at the convention center and occasionally parking can be a problem as well.",
  "It's a huge office complex housing the NYS Museum, the Plaza (open air with seating, fountains; the Egg performance auditorium (check for pricing).  Call NYS information number for events scheduled, which are almost always family friendly.  The Concourse houses McDonald's as well as an upscale restaurant;, drugstore and a gift shop (I think?); artwork all along the way.  Leads to NYS Capitol Bldg., which is also interesting.  Kids can run all along the way!",
  "We've had occasion to attend numerous events at the EPSCC in downtown Albany and also have attended events in several other cities.  The concourse seems to be lacking compared to what is offered in numerous other areas and parking can be a challenge if your event is during business hours. ",
  "I don’t travel much so I had no idea what to expect. I was impressed with the cleanliness and enjoyed my time there.",
  "Great place for a walk on a sunny day. And when the weather is not as lovely, you can head underground. In winter, ice skating on the plaza is one of the most romantic things to do in the Capital Region. While in summer, the Capital Concert Series, which includes a spectacular fireworks display on the 4th of July, draws huge crowds.\n\nFree street parking after business hours.",
  "what a great venue.. cold, windy, snow and sleet.. everything you could want for an outdoor concert...lol but well set-up, managed and a gorgeous venue in a killer town.. kudos!!",
  "Come here for beautiful views of the city, looking east over the Hudson River Valley. Locally there are state buildings, the Egg, and a museum.",
  "Love this place for the walking we can get in during inclement weather. Food area held many treats for us to enjoy.  Home co op Friday for lunch at 130pm\nAlthough we spent too much time at the museum we arrived underground and found this place for lunch.\nHealthy food we were in heaven! Due to the lateness of the day we were able to get two chicken wraps and a bag of chips along with hot drinks.\nWould go here again as the clerks were friendly and had fresh healthy food there.\n\nLoved jewelry vendors during the holiday season lining the center aisles of the walking areas. \nWill travel here again next year.."
 ]
},{
 "name": "Lark Street",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/9a/e6/72/lark-street.jpg",
 "tags": [
  "walk",
  "eat",
  "kids",
  "eat",
  "food",
  "food",
  "eat",
  "drink",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282173-Reviews-Lark_Street-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lark street has a lot of cool little shops and eateries that are fun. Parking isn't always the easiest as something to be aware of.",
  "A walk down Lark Street used to be a visit to Greenwich Village of old. But many of the restaurants and shops have closed, and the feeling isn't there anymore. There are some treasures so don't totally avoid a visit, but you need to walk the street from Washington to Madison to find what you want. You can get coffee, burritos, ice cream, etc, and you can also pop into the shops on the way. But I miss many of the shops of the past. ",
  "There are some nice places to eat here and very nice wine restaurant, however, eat and go.  Parking is atrocious and the kids are interspersed, between locals and vagrants.  At night, it turns into a giant street party with drunks everywhere.",
  "Lark Street is the place to get coffee, shop for cool accessories, and had decent food. Come here during Lark Fest in September and all the stores and restuarant will have a stand up for you to check them out or eat their best food.",
  "This a cool oasis in the heart of New York's Capitol!! Great little spot to stroll, see the shops and grab some food. Their are neat blocks of old houses on every street. Fun to do.",
  "Visit Dominic’s Caramello Candy and Coffee.  You won’t be disappointed.  Very clean and great selection.",
  "Not many choices in the commuter city of Albany, this is one of the few, lotsa places to eat and drink, but a little crusty around the edges.",
  "Old buildings, parking poor, question whether it is safe to walk around in the evening, not a highlight of any city"
 ]
},{
 "name": "C.H. Evans Brewing Co.",
 "address": "19 Quackenbush Sq",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/5f/4b/4c/ch-evans-brewing-co.jpg",
 "tags": [
  "brewery",
  "family",
  "tour",
  "history",
  "food",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d613983-Reviews-C_H_Evans_Brewing_Co-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of choices of their own draft beer at the bar in the restaurant,  plus a few others.  Haven't had a loser yet.  Menu is good, too:  better than standard bar sandwiches/wraps/burgers plus entrees that go above and beyond.  They offer tours of the brewery, growler purchases/refills. They handle special events nicely.  Can get very noisy when the place is full - beware if you have hearing problems.",
  "Love love love the varying beer choices here. It is a must stop when we travel to the capitol region. The beer menu has a few staples that are always available and it also has seasonal offerings. If you are a beer lover it is a must !! Enjoy!",
  "Love love love the varying beer choices here. It is a must stop when we travel to the capitol region. The beer menu has a few staples that are always available and it also has seasonal offerings. If you are a beer lover it is a must !! Enjoy!",
  "An out of the way place to relax and unwind. The wait staff is friendly and friendly.The beers were pretty good and you can get a sampler so you can see what you enjoy the most.",
  "For twenty years Evans Brewing Co has been my go-to place for out of town visitors, gatherings of friends, receptions, and solo or family dining.  Always enjoyable, as staff is professional and attentive, seating is comfortable and not crowded, something is available for all (vegetarian and meat-eater; adults and child; alcohol or not).",
  "Wait staff was very good but my Spouse meal was under cooked and terrible. Nothing Fancy,just Burgers and pasta. Only average across the board,plus beer was actually luke warm!",
  "This history of the building is told by its working parts still visible above the bar and restaurant. Very interesting to my engineer husband. Visited on a food tour and sampled a few beers and cider. A busy place.",
  "This place has a really good brewery atmosphere. The burgers and sandwiches are also amazing. Obviously the beer was really good. Highly recommended."
 ]
},{
 "name": "Albany Indoor Rockgym",
 "address": "4 Vatrano Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/be/34/31/albany-indoor-rockgym.jpg",
 "tags": [
  "eat",
  "kids",
  "eat",
  "kids",
  "free",
  "walking",
  "unique",
  "adventurous",
  "kids",
  "unique",
  "food",
  "cheap",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d3546177-Reviews-Albany_Indoor_Rockgym-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Its not so expensive either but bring cash or your Amex card. This place is fun for adults and kids alike. They have 2 rooms for wall climbing a indoor caving system and a zipline. The cave is like a maze its quite fun they have built rooms and obstacles in the cave for exploring.  My friend and I will go there just for the cave sometimes and just explore it for a few hours its pretty good exercise.  If you want to climb and are new to it the guys there are really helpful.  They have shoes and gear you can rent they will help you with it and belay you and take you through different exercises if you want to do them.   If you want to do the cave wear comfortable clothes but form fitting if you have loose hanging clothing it might bug you and below knee pants or longer many be more comfortable because you are crawling around a bit. They will also let you leave for lunch and comeback without paying extra just let them know. Theres also a pizza place next door so you can get take out and eat at the gym they have tables inside. No lockers rooms but they have one big bathroom is you want to change there.",
  "Its not so expensive either but bring cash or your Amex card. This place is fun for adults and kids alike. They have 2 rooms for wall climbing a indoor caving system and a zipline. The cave is like a maze its quite fun they have built rooms and obstacles in the cave for exploring.  My friend and I will go there just for the cave sometimes and just explore it for a few hours its pretty good exercise.  If you want to climb and are new to it the guys there are really helpful.  They have shoes and gear you can rent they will help you with it and belay you and take you through different exercises if you want to do them.   If you want to do the cave wear comfortable clothes but form fitting if you have loose hanging clothing it might bug you and below knee pants or longer many be more comfortable because you are crawling around a bit. They will also let you leave for lunch and comeback without paying extra just let them know. Theres also a pizza place next door so you can get take out and eat at the gym they have tables inside. No lockers rooms but they have one big bathroom is you want to change there.",
  "This place looks like nothing from the outside but offers quite a bit on the inside!  The two rooms full of rock climbing walls offer varying degrees of difficulty and also interesting things to look at (paintings, \"rocks\" sculpted into interesting shapes).  We're relative beginners, but have noticed many advanced,experienced climbers return again and again.  They offer spots to climb harnessed to a rope (for which you need a partner), and spots to climb without a rope.  The floor is rubbery and soft, for safety's sake.  Also for safety's sake, beginners get a thorough free lesson, with a trainer who will stay with you as long as you feel you need it.\n\nThe reason why we have repeatedly returned to this place rather than the other nearby rock-climbing place is its unique (at least, in this area) extensive labyrinth of pathways through the indoor \"caves.\"  My teenage daughter, who had completed a demanding course in outdoor caving, was worried it would not be interesting or a challenge, but found it to be challenging and a lot of fun in very different ways from outdoor caving.  From several different entrances, cavers make their way through intersecting passageways that are often pitch-black to get to several spots of interest:  slides, a room of lights and mirrors, a hammock, and most notably, a zip line.  Because the passageways are actually behind and inside of the rock walls, they stretch from floor to ceiling and around three walls, so you can actually get a moderate muscular and aerobic workout (although not as strenuous as with the rock climbing) from walking or pulling yourself up hill and through spaces of varying sizes.  (The caves are NOT for those who are uncomfortable with the dark or with small enclosed spaces. On the other hand, I have seen kids afraid of both, prompted by the rewards of the interesting spots within, to gradually overcome both fears here.  Adults who are significantly overweight or who have very broad shoulders may not fit through all spaces and are not even allowed in the caves; every person who desires to enter them must pass a brief test where they have to get themselves through a roughly three-foot-long tunnel of the size of the smallest area they would encounter inside the caves.  [That is what we were told; those who actually went into the caves and believe they explored every single pathway never found anything that tight.]  Also, because of the potential for using the zip line [which goes out of one cave, across a large open space, and into another cave, just below high-ceiling height], all cavers are instructed as to how to properly get into and adjust a harness.)\n\nI and the dozen or so people I've spoken with who go or have gone there once or regularly believe that Albany Indoor Rockgym is a fantastic place to visit on a cold or rainy day.  For roughly $8 to $15 - depending on your chosen activities and the hour - you get to spend from one to several hours (There is seldom a time limit) challenging the rocks, exploring the caves, and almost certainly making a few friends.  The only negative we've all found is that certain staff members can be extremely moody and not very understanding.  (This was the only thing keeping this place from a five-star rating.)  Others are wonderful, and even the moody ones will be more pleasant as they get to know you better, and are still wonderful instructors.\n\nA couple of little rules and comments you should know about before going with children:  Unlike some other places which don't allow climbers to go without a parent until age 13, this place allows children as young as 10 to rock climb and cave without a parent as partner.  Children younger than 10 MUST have someone with them 18 or older who is actually accompanying them as belayer (holding the rope) or through the caves.   Anyone under the age of 18 must have a parent sign an insurance waiver, either in person or printed from the gym's web site, signed off site, and brought in by the child.  Although it is not necessary for the person accompanying young children to be a parent, the person signing the form MUST be the parent, as I learned when I tried to bring children of friends.  I would strongly recommend both the rock climbing and caving to adventurous, energetic kids age 7 and up, as well as to teens and young adults.",
  "Just passing through Albany and thought we’d try something different. This place was tons of fun and both Matt and Steve were super helpful “showing us the ropes!”  Can’t wait to do this again. Would recommend for couples, families, or a group of friends. Thanks again Matt and Steve! ",
  "Love the indoor rock cave and climbing! Kind and helpful staff. Excellent place to visit on a day that is too hot or rainy.",
  "We came for the well maintained rock climbing.  However, upon discovering the intricate and unique cave system, we spent all of our time exploring.  This facility is designed and maintained by professionals who are familiar with climbing and caving.",
  "We just had a \"lock in\" overnight with Troop 26 from Fort Drum, NY.  I honestly thought the boys would tire after a few hours, but we literally had to pull them out of the caves and off of the walls!  The caving system was a BLAST (even though I got a little \"stuck\")!  It was pitch black in most places and tight, but I was laughing all of the way through it.  The Scouts had a great time on and in the walls and ceilings!  We will definitely come back!",
  "Spent the afternoon here caving with my daughter who's 11, husband and friends. This was our first time here. The owner was very friendly, helpful and awesome with the kids. The kids spend four hours exploring the caves while the adults tired after two hours. The great part about this place is that you can bring in your own food, stay all day or leave and come back later in the same day. Cheap all day family fun indoors. That's something that's hard to find these days. Would absolutely go back and recommend this place to friends. "
 ]
},{
 "name": "Albany City Hall",
 "address": "24 Eagle St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/ce/74/75/albany-city-hall.jpg",
 "tags": [
  "historic",
  "tour",
  "free",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d282162-Reviews-Albany_City_Hall-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Albany City Hall opened in 1883.  Romanesque style architecture with a 202 foot tower.  Only municipal carillon in the country.  Added to National Register of Historic Places in 1972. One of the most notable occupants was Erastus Corning 2nd who was mayor for 41 years (1942-83). Corning Tower in the Empire State Plaza is named for him.",
  "Another beautiful style of architecture that contrast with the French Renaissance style  State Capital and modern style Rockefeller plaza",
  "I came across this building as I was taking a \"self-guided\" tour of downtown Albany. The City Hall is a really neat place...old-style architecture in a grand way. The security guard welcomed me inside, where I took a quick tour of foyer and the exhibits up front. Very impressive! This is a free stop, and worth your time.",
  "Loved viewing this beautiful building from the outside during my 2 days in Albany. I walked by it on my way to my meetings and on my way back to my hotel.",
  "While driving we found the Albany City Hall. It was a massive building with a clock at the top of the tower. It was beautiful!\n\nThe inside was attractive as well. There were two kinds of stairs, one at the left and the other on the right.\n\nThere was an exposition on that day.\n\nI enjoyed admiring this structure.\n\nIt was worthwhile to see!"
 ]
},{
 "name": "US Route 20",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/18/90/52/antiquing-alont-us-rt.jpg",
 "tags": [
  "tour",
  "art",
  "performance",
  "historic",
  "kids",
  "sightseeing"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d1149550-Reviews-US_Route_20-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "As others have said, Rt. 20 is one of the oldest highways running across the country east-west.  Most of it is now bypassed by highways.  Starting in Boston, super-highway Route 90 runs parallel - tolls, heavy truck traffic, etc., but much faster route.  \n\nWe live in an historic mansions on Rt. 20.  This 2.5 mile stretch running through downtown Albany is a local 4-lane road with a 30MPH limit, lots of lights and a good place to get a speeding ticket.  Starting from the east at the Hudson River and coming up out of the Hudson Valley, you will travel between rows of brownstone buildings from the 19th century (some earlier), some very good restaurants and then views of the New York State Empire State Plaza with \"The Egg\" performance center and dramatic administrative buildings.\n\nIf you have some time, a visit to the Plaza is highly recommended.  Look for signs for public parking under the plaza.  In good weather, above ground is this half mile long plaza with the wonderful State Capital bilding at one end, The NYS Museum at the other, several marble-covered administrative buildings plus the Corning Tower (tallest building between NYC and Montreal) and the mushroom-like performance center \"The Egg\".  Running parallel below ground is a very long corridor flanked by the giant paintings of Governor Rockefeller's collection, some of the 1960's greatest modern art. The Museum is a favorite for kids.  Finally, if you can schedule a tour of the State Capitol building, you will view one of America's greatest pieces of architecture.  Near the Capitol is the NYS Education building with its massive colonnade and many other historic buildings.\n\nContinuing up Madison Avenue, you cross Lark Street, an area with some fine bars and eateries.  Now, out of the valley, Washington Park, designed by Frederick Law Olmsted, will be on your right.  You then pass by many historic mansions followed by the College of Saint Rose.  Finally, there are some decent eateries and bars on the left before Rt. 20 becomes Western Avenue.  There is another mile or so of city homes with worthy architecture before things become more commercial.  You will also pass by the State University of Albany before you get to the connections with superhighways Route 90 (east-west Boston to Buffalo) and Route 87 (south-north New York City to Montreal).\n\nAfter several more miles of suburbs, then out into rural Upstate New York.  If you continue on this four lane 55 MPH road westward, recommended stops are the tree farm in Esperance (summer), Sharon Springs (the 19th century summer retreat for NYC Jews not welcome in Saratoga Springs), historic Cherry Valley, and then on into the Finger Lakes region with its many delights.",
  "Cool, we get to review a road :)\n\nActually this one is worth talking about. In Albany as Western Ave it leads from several suburbs from I-88 on one end to the Route 155, the Thruway and Northway all the way downtown to old Albany. There are many restaurants, malls and daily necessity  shopping along the way. There are less traffic lights than you would think for this type of road but you will have to stop often enough.\n\nThe aforementioned  Rte. 155 is a great connector to Central Ave, a similar road in town  and the convenient Washington Ave extension\n\nRoute 20 is a great way to cross the entire state west/east if you prefer going through towns. Not sure where is heads westward, but it does continue into Massachusetts all the way to or near Boston   \n\nFor what it is, you have to give to the five star rating here.",
  "Rt 20 runs from Mass to the west coast, but the drive from Albany to Cooperstown is especially nice. Not too nice in the winter as the snow can blow across the road and pile up. The views from Duanesburg west to Rt 80 are terrific. On a clear day around Cherry Valley you can see well into the Adirondacks.",
  "One of the country's oldest and longest interstate highways, US20 in Albany is within one of the oldest cities in the US, founded in 1609. From there it goes west through the suburbs to rolling hillsides, farmlands, past lakes and villages. Because it travels into parts that have grown along with the population, traffic too has grown. It changes from cityscape with heavy traffic to suburbs, where the traffic thins, to the more rural areas where you can drive more leisurely. Traffic changes at various hours and the road changes too as it gets farther out from the city. Enjoy the scenery and the beauty of Route 20.",
  "On a summer road trip, we chose to take US 20 from I-81 into downtown Albany rather than use I-90 and pay its tolls. We had the sun behind us since we were driving in the late afternoon. Summer weekday traffic wasn’t all that bad until we actually got into Albany. We enjoyed viewing the rolling hills in the countryside. Far to the east, we glimpsed the Empire State Plaza of downtown Albany, the Hudson River Valley, and the Berkshire Hills beyond. The grand vistas were unexpected. If we ever pass this way again, we’ll be sure to take the same route.",
  "great sightseeing road so much better than using an interstate and you get to meet interesting people along the way and discover amazing local eateries",
  "We made a point of driving from Albany to Cooperstown along this scenic drive, based on TripAdvisor recommendations and mentions in other travel materials. But it's just a country road and not especially scenic at that. There was the occasional church or ice cream stand, but it doesn't wow.",
  "Rt 20 runs from Mass to the west coast, but the drive from Albany to Cooperstown is especially nice. Not too nice in the winter as the snow can blow across the road and pile up. The views from Duanesburg west to Rt 80 are terrific. On a clear day around Cherry Valley you can see well into the Adirondacks."
 ]
},{
 "name": "Shaker Heritage Society",
 "address": "25 Meeting House Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/c1/b5/c5/herb-garden-gate.jpg",
 "tags": [
  "historic",
  "walking",
  "nature",
  "free",
  "history",
  "historic",
  "walking",
  "nature",
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d534391-Reviews-Shaker_Heritage_Society-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Historic farm, settlement, nature trail, graveyard tells the story of the birth of Shakerism in the New World. Small museum, tours, walking, trails, and special events. Easy to get to, hard to forget.",
  "We enjoyed the film and the very helpful docent. She encouraged questions and shared interesting information. The meeting house was very large and there are many buildings on the grounds. We also visited the cemetery.  Parking and admission are free!",
  "The Shaker Heritage Society is a gem located near the Albany Airport.  The history of the Shakers is very interesting, and the grounds are lovely.  A visit to the summer and fall craft fairs is a must for me, as is a visit for holiday shopping in the Meeting House.",
  "Historic farm, settlement, nature trail, graveyard tells the story of the birth of Shakerism in the New World. Small museum, tours, walking, trails, and special events. Easy to get to, hard to forget.",
  "We enjoyed the film and the very helpful docent. She encouraged questions and shared interesting information. The meeting house was very large and there are many buildings on the grounds. We also visited the cemetery.  Parking and admission are free!",
  "Not a large village or building left as land has been sold off to the airport. Most buildings in a decayed condition and not able to enter. Some information via video at the startand some animals to see outside.",
  "I  have been to 2 other shaker villages one in kentucky and one in\n Pitsfield Massachuttes\nthis one needs a lot of capital to restore the old existing structures\nit is a shame since this movement started here.   Worth noting their inventions includes the circular saw, prepacked seeds and furniture. oh by way it is free but they ask for a donation    what I did was to buy a souvenir to help them out   it is a gem in the rough",
  "This was the first Shaker village in the US. The main building has been restored and open to the public. Besides the building they have a 20 minute video and a gift shop. The rest of the village is standing, but in disrepair waiting for restoration.      "
 ]
},{
 "name": "Cathedral of the Immaculate Conception",
 "address": "125 Eagle St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/e1/0a/a9/candelabra-inside-cathedral.jpg",
 "tags": [
  "art",
  "history",
  "free",
  "free",
  "historic",
  "walking",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d12756579-Reviews-Cathedral_of_the_Immaculate_Conception-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Best to Google the Cathedral website and go when they have guided tours for all the info about the history and art.  Park in the State lot behind the Cathedral, free after 2pm M-F, free on weekends.",
  "This cathedral was built in the mid ninetieth  century by Irish immigrants. It survived the construction of the Empire State Plaza, when some 40 blocks of downtown were razed.  The building is lined with stone, has two very large steeples and a beautiful interior. Parking is free on the weekends and late afternoon during the week.  Gorgeous walnut pews and stained glass windows, origin to the church.  Definitely work a stroll through and a place to quiet meditation and prayer.",
  "Beautiful old classic Cathedral.  Attended some beautiful weddings there.   Park there on the weekend and also visit the NYS Museum without moving car.  Also State plaza and memorial monuments outside.",
  "When we arrived at the cathedral we thought it looked closed but on going round the front the door was open. It was empty so we had it to ourselves. It is a beautiful, spiritual place. The stations of the cross are expertly carved. The whole building has an impressive feel.",
  "Well preserved inside and out. Easy parking. Handicapped accessible. Wonderful architecture . Every religion should visit (not only Catholics)",
  "I had a day in Albany unexpectedly, so I took Uber downtown from my hotel, and really enjoyed walking around experiencing this very cool historic city. The Cathedral was the capstone of my visit, such a pretty and serene church! I really enjoyed taking photos of the statues and beautiful ceilings, highlighted by the ornate stained glass. A very special prayerful experience! Highly recommended!",
  "Attended a beautiful wedding here and loved the 19th century architecture! Gorgeous building and stained glass windows!",
  "We did a self-guided tour of the cathedral on Saturday, May 25, 2019.  The interior of the church is very striking and the height of the vaulted ceilings reminds us of the European cathedrals (Koln, Cologne, Strausbourg) that we have visited in the past.  The carvings that serve as capitals for the columns are very detailed.  During the time we were inside the church, a local family was celebrating a baptism.  The outside of the church is beginning to show wearing away of its brown stone walls.  Some of the exterior is draped in protective cloth to prevent pieces of the blocks from breaking away."
 ]
},{
 "name": "Park Playhouse",
 "address": "Madison Ave. cor. New Scotland Ave.",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "theatre",
  "performance",
  "music",
  "theatre",
  "theatre",
  "family",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d8545290-Reviews-Park_Playhouse-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great show! Open air summer theatre. Outstanding, talented student actors and professional performances. Highly recommend and will go again next year!",
  "We've been attending Park Playhouse performance for many years since living in Albany. It is a wonderfully professional organization providing excellent performance in Washington Park.  Recently we attended the play Chicago and it was fantastic.  The acting, music, dancing, singing, orchestra, was all excellent.  We enjoy being entertained in the Park on a warm summer night.  A wonderful atmosphere in an open air environment.",
  "Great show! Open air summer theatre. Outstanding, talented student actors and professional performances. Highly recommend and will go again next year!",
  "Once again the Park Playhouse put on a magnificent production.  The play was cast perfectly and the choreography was great.  Everything about the production was first class and the audience loved it.  The next show is \"How to Succeed in Business Without Really Trying\".  I wish I were going to be here to see it.",
  "Many a year, our family has attended the Washington Park Playhouse. The outdoor theatre is by far one of our favorite things to do each summer. Being able to bring a picnic, sit and relax before the show, people watch as the sun sets, is truly a favorite.Our only complaint is we wish the Park Playhouse would do more family friendly musicals. \nThanks for the shows!",
  "Very nice production of the Damn Yankees in a very lovely park. We were taken aback by both. The only flaw if any is not to stray too far away from the amphitheater for there are some skunks lurking. Very well done all.  ",
  "Fantastic professional organization bring adult and children musicals to Albany in fresh air seating. Seats available for purchase but they are just plastic lawn chairs so frankly you'll find it more comfortable to just arrive at least an hour early and do lawn seats that are graduated so there's no bad seat in the house. Awesome that you can bring a bottle of wine and picnic with you. Long lines at intermission for bathrooms so plan accordingly. Those handicap they offer close parking or others pay just $5. ( free parking avail on street). Absolutely something you should enjoy every summer as a home town treasure."
 ]
},{
 "name": "Fort Orange Brewery",
 "address": "450 N Pearl St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/3f/89/02/inside-bar.jpg",
 "tags": [
  "unique",
  "family",
  "free",
  "brewery",
  "food",
  "brewery",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d13089619-Reviews-Fort_Orange_Brewery-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Came today with our family and friends. The beer is good, especially the stouts. They have a good, unique deal called The Gauntlet...10 samples for $22. However when we went to order, the bartender was very snippy, rolling her eyes that she had to make another Gauntlet that day (they had been open for 30 minutes). Very rude. So many great beer places in the area to come here and put up with rude service for ordering beer on their menu.",
  "Cool vibe and set up and staff awesome. Just nothing jumped out. Not their fault as everyone has their own choice. Will try again if in area!",
  "Great little brewery, note, not a restaurant so do not expect a meal minus some snacks.  The beers were nice, in that it was not 101 IPA versions.  Had a really nice brown ale along with other styles (see picture).  We were there on a night with trivia which was pretty fun, free flight for winners of first half and $25 prize for winning (dominated and got both).  Great stop if you are in the area!",
  "Quaint and fun brewery with a good selection of beer - all tasty. They are pet and kid friendly. There is normally a food truck parked out front and snacks at the bar. All and all a fun place to have a few rounds.",
  "A typical small brewery with quite a few beers. Not the best that I have tried, but a friendly and cheerful place to have a few."
 ]
},{
 "name": "The Irish American Heritage Museum",
 "address": "370 Broadway",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/71/ea/5e/the-irish-american-heritage.jpg",
 "tags": [
  "library",
  "library",
  "knowledgeable",
  "art",
  "library",
  "historic",
  "music",
  "walking",
  "history",
  "library",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d3494028-Reviews-The_Irish_American_Heritage_Museum-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were out and about and had 30 minutes until closing so decided to drop in and check it out.  There are a few displays but the best part of this museum to me was the library in the back room! One could spend a couple of hours back there doing some serious research. If you plan a visit, half an hour will do for the exhibits, but plan two hours+ and bring your research list if you plan to work in the library.",
  "I stopped in here because I had some spare time after lunch one day. It is an interesting place, although it really only warrants about 10-15 minutes of time. (I did not look at the library, which others have said is very impressive.) The volunteers there are very friendly and knowledgeable, and fun to talk to. I wold recommend this place if you are right in the area, or if you are Irish. Otherwise, I would probably skip it.",
  "The Irish American Heritage Museum is especially appealing the week before St. Patrick's Day when I visited.  They have a very interesting art collection of Michael Augustine Power O\"Malley through March 2nd, along with a very fascinating research library with some great picture books of Ireland.  Will attend a lecture tonight on Irish Genealogy 101 which should be very enlightening and educational.  This week, they have many interesting lectures. Museum is walkable near the Holiday Inn Express Hotel in Downtown Albany, NY on Broadway.  The staff was very welcoming.\n\nIf you are Irish or have any interest in Irish heritage, please make the trip to come here; it is a fascinating museum.",
  "This is a very small museum in the historic downtown area but they have a lot of interesting Irish artifacts that you're unlikely to see elsewhere.  Very pleasant staff!  Have dinner or lunch at the nearby Olde English Pub on Broadway and you may hear some Irish music too - call Olde English for information.  No parking - use a taxi or Uber.",
  "Totally enjoyed walking through this path of immigration history! If you’re in the area, definitely stop in! ",
  "Great museum for anyone Irish or who has an interest in the Irish. Right now they have a great exhibit about Fr. Patrick Peyton and his Hollywood ministry.",
  "This is a very small place with a limited variety of artifacts, however it was fun to visit and the staff was great.",
  "I stopped in here because I had some spare time after lunch one day. It is an interesting place, although it really only warrants about 10-15 minutes of time. (I did not look at the library, which others have said is very impressive.) The volunteers there are very friendly and knowledgeable, and fun to talk to. I wold recommend this place if you are right in the area, or if you are Irish. Otherwise, I would probably skip it."
 ]
},{
 "name": "American Italian Heritage Museum",
 "address": "1227 Central Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/30/90/3b/a-photo-of-our-building.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "affordable",
  "learn",
  "history",
  "unique",
  "learn",
  "history",
  "affordable",
  "learn",
  "history",
  "tour",
  "tour",
  "history",
  "art",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29786-d7935830-Reviews-American_Italian_Heritage_Museum-Albany_New_York.html",
 "source": "TripAdvisor",
 "reviews": [
  "Stopped here with my Italian wife on our way through Albany. We got to the door only to realize it wasn't open on the day we came, rang the doorbell anyway and were surprised to be welcomed in for a tour. Received great personal attention and spent a quiet few hours making our way through the stories and collections in the various themed rooms. I'd be surprised if there's anyone of Italian descent who isn't moved, educated, and/or inspired by a visit.",
  "We got a history lesson and tour from the Professor who was the founder of the museum. He was friendly, helpful, and knew everything! The parking was easy, museum was clean, full of so much information and so many items to view.  Small place packed with so much.. Loved it all!",
  "We visited this small, but jam packed museum early in the afternoon on Saturday May 25, 2019.  The museum presents an intricate look into the emigration of the Italian people.  The building is a converted church with the museum taking up the main floor.  The second floor has office space used by museum staff.  The museum was originally located in Utica, New York.  the display area is broken into then major rooms with each room having a different central theme.  The docent on duty at the time of our visit was very cordial and readily engaged us in dialog.  We spent almost two hours viewing the displays.  Our opinion is that this museum is a hidden gem.",
  "I came across this museum purely by accident when searching Google for fun and interesting things to do in the Albany, NY area with my folks, who were in town for the day. This little gem is a completely independently funded museum, operated purely by donations from members and donors, as I understand it. It is a museum devoted to the history of the Italian peoples in America, and the journeys they took to get here. It is, supposedly, according to the gentleman we spoke with, either the largest or the most comprehensive museum devoted to American Italians in the country. It appears to be kind of cobbled together in some aspects, but don't be fooled. There are a TON of artifacts and historical pieces crammed into 5 or 6 small galleries. It take perhaps an hour or a little more to go through, and admission is 5 bucks. Beware... the proprieters do not get many visitors on weekdays, they like to talk, and it is open odd hours, but if you can catch them when they are open, this is a nice little trip to make, not just for people of Italian descent, but also for people who want to learn more about this ethnic group. As an Italian American, I approve! Also, a little gift shop in the back offers some affordable memorabilia as well! Great day trip! :)",
  "This museum is not only unique for its collection on Italian history, artifacts, and culture but offers special classes and programs for those who wish to learn more about the immigrant experience, the Italian language, etc.  We have brought friends who are not of Italian heritage, and they were delighted to experience this unusual venue.  One of my Irish-American friends found many items that related to her grandmother's coming to this country that she had not seen before.  And the museum is located in a lovely, former church which adds to the whole experience!",
  "I came across this museum purely by accident when searching Google for fun and interesting things to do in the Albany, NY area with my folks, who were in town for the day. This little gem is a completely independently funded museum, operated purely by donations from members and donors, as I understand it. It is a museum devoted to the history of the Italian peoples in America, and the journeys they took to get here. It is, supposedly, according to the gentleman we spoke with, either the largest or the most comprehensive museum devoted to American Italians in the country. It appears to be kind of cobbled together in some aspects, but don't be fooled. There are a TON of artifacts and historical pieces crammed into 5 or 6 small galleries. It take perhaps an hour or a little more to go through, and admission is 5 bucks. Beware... the proprieters do not get many visitors on weekdays, they like to talk, and it is open odd hours, but if you can catch them when they are open, this is a nice little trip to make, not just for people of Italian descent, but also for people who want to learn more about this ethnic group. As an Italian American, I approve! Also, a little gift shop in the back offers some affordable memorabilia as well! Great day trip! :)",
  "Stopped here with my Italian wife on our way through Albany. We got to the door only to realize it wasn't open on the day we came, rang the doorbell anyway and were surprised to be welcomed in for a tour. Received great personal attention and spent a quiet few hours making our way through the stories and collections in the various themed rooms. I'd be surprised if there's anyone of Italian descent who isn't moved, educated, and/or inspired by a visit.",
  "We got a history lesson and tour from the Professor who was the founder of the museum. He was friendly, helpful, and knew everything! The parking was easy, museum was clean, full of so much information and so many items to view.  Small place packed with so much.. Loved it all!",
  "We visited this small, but jam packed museum early in the afternoon on Saturday May 25, 2019.  The museum presents an intricate look into the emigration of the Italian people.  The building is a converted church with the museum taking up the main floor.  The second floor has office space used by museum staff.  The museum was originally located in Utica, New York.  the display area is broken into then major rooms with each room having a different central theme.  The docent on duty at the time of our visit was very cordial and readily engaged us in dialog.  We spent almost two hours viewing the displays.  Our opinion is that this museum is a hidden gem.",
  "We visited this museum while looking for things to do in Albany.  What a find!  The museum is small, but it's packed with memorabilia of the history of Italians in America.  And there are some very knowledgeable organization members to guide you through the well stuffed rooms.  Lots of pictures, lots of documents, lots of art work, and lots of conversation with the very friendly volunteer staff at the museum.  We would have stayed longer, but the museum hours are fairly short and we had already kept everyone there past closing time with our barrage of questions.  It was time to let them go home.",
  "We had some friends visiting on a rainy weekend and since my wife had wanted to go to this museum for some time, decided to go.  This is because she knows a woman who has two sculptures in the museum.  All the items in the museum are donated and all the people who work there are volunteers, who like telling you about the museum and exhibits, and encourage you to join.The museum honors the Italian immigrants who came to the US and seeks to preserve their memory.  Since we are descendants of immigrants, although not of Italian heritage, we found this an interesting and welcoming museum."
 ]
}]
