[
{
 "name": "U.S. Naval Academy",
 "address": "121 Blake Rd Armel - Leftwich Visitor Center",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/11/f0/a1/annapolis.jpg",
 "tags": [
  "history",
  "tour",
  "food",
  "eat",
  "history",
  "drink",
  "tour",
  "historic",
  "food",
  "walk",
  "eat",
  "academic",
  "field",
  "tour",
  "history",
  "wander",
  "free",
  "walking",
  "food",
  "history",
  "walk",
  "tour",
  "walking",
  "kids",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d258251-Reviews-U_S_Naval_Academy-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "The US Naval Academy is the epitome of the service academies (sorry West Point, CG and MA) The campus is steeped in history, the openness and availability to stroll its park-like environs, make it an amazing visit, something you need to incorporate if you're ever in the Annapolis area. Oh and the Midshipmen are the most polite, articulate focused yond men and women you'll ever have a chance to meet. Go Navy!",
  "This was our first visit and we are so glad that we took a guided tour of this impressive academy - and Chip was the best possible guide (knowledgable, amusing and definitely a great ambassador!). We were lucky to see the noon formation and felt very proud of these young people.",
  "Best decision we made was going to see the Academy! Parking was fairly easy in the street! We found a spot a block away from gate 3 ! To have access to the beautiful grounds you need to show ID, and go through security ! Got there in time to see Formation Ceremony which is held at 12 pm on the dot! Beautiful sight to see all of those young men and women in their uniforms all at once! There's a lot of history here, the buildings are gorgeous , we decided to go to where they have a place to grab some food, and it was exactly what we needed, I had a chicken cheese steak n fries that was so good, and I don't usually eat this way but I'm glad I did this time ! Upstairs from here there was a ceremony going on I think a group was getting promoted to mid shipman ! When they began and played the national anthem it felt very moving and the acoustic sound was just breathtaking ! When in Annapolis don't miss the Naval Academy!",
  "Don't forget your ID - it is required for entrance.  Once you enter, turn to the right and head to the Visitor's Center.  You can book a tour here or just check out the gift shop, use the restroom, grab a drink from the vending machine and then head out on your own.  Very beautiful, historic campus!",
  "Spent almost a day here with US friends drove around the  academy for a while and then had lunch in Drydock restaurant - fast food but cooked to order- very good and reasonable price. We then walked around the public areas of Bancroft Hall, amazing pictures on the walls and good representations of the cabins the midshipmen live in and items of uniform worn over the years.\nWe then walked across to the chapel which is beautiful, and in the crypt is John Paul Jones sarcophagus which is very ornate. There are amazing stained glass windows too.\nWe finished off driving through the the cemetery seeing many graves of famous graduates such Admiral Halsey from Pearl Harbor fame.\nThere is a very large gift shop in the visitors' centre but it is a bit pricey, although as profits go toward the upkeep of the academy it's not too much of a problem.\nThere are plenty of guided tours, many escorted by ex-naval officers whose knowledge is immense.\nWell worth a visit, parking a bit scarce so get there early and make sure you have photo ID or else you may not be allowed on board.",
  "I was in Annapolis for business, and had a free morning before a business lunch at noon. My son (who is now out of college and married) had expressed interest in attending the Naval Academy, but ultimately decided upon a different academic path. I was curious about the academy so I decided to take the walking tour. \n\nTours in April begin at 10:00 AM, and are planned to last about 75 minutes. Our tour guide was great about answering questions and allowed our group to determine the pace, so our tour lasted an hour and 55 minutes. Start times for tours differ throughout the year, so check the schedule. The cost is very reasonable. I paid $10.50 for an adult tour. Lower prices were offered for seniors, students, and children. \n\nYou begin by entering through the visitor's entrance, which requires government issued photo ID (not sure why, but if you're from certain states you need two forms of ID, so call the info line before visiting to make sure you have what you need.) You will also pass through a metal detector. Once cleared (time varies depending on the crowd) follow the signs to the Armel-Leftwich Visitor's Center, where you can purchase your ticket for the tour. This is also the gift shop where you can buy apparel and various other souvenirs. There is a brief video that runs every 15 minutes, so give yourself time to watch it before your tour starts.  The vistor center is a section of the Halsey Field House.  As you walk through the halls you can look into the fields and see midshipmen (a non gender-specific term) practicing their sport or participating in a PE class.\n\nTo be clear, once through security the campus is open access so you can wander on your own. Just pay attention to observe signs for areas that are limited or restricted access. \n\nI arrived at 9:15am, and the first tour of the day was at 10:00am. I'm glad I did because our group was only about 10 people. Groups that began later were much larger, and at the end of my visit, I noticed a line extending well outside of the door of the security screening area. Plan ahead and give yourself time. \n\nAlso, if you or your child are considering attending the USNA you should plan to attend the daily briefing, which is free and open access. This will give you an idea of the application and admission process, as well as a very high level summary of life as a Midshipman. It is on the second floor of the Visitor's Center, just above the gift shop (ask at the cash register and they'll direct you to the stairs/elevator).  The day of my visit there were only two available times for the daily briefing: 10am and 2pm. I would have loved to hear the briefing, but couldn't fit it into my limited schedule. \n\nThe walking tour began at the Visitor's Center. Our first stop was Lejeune Hall, which is an indoor athletic/PE complex. We saw the Wall of Fame, with stops at photos of David Robinson and Roger Staubach. We also saw a swimming class and wrestling class as they were underway. We learned a bit about the requirement that all Midshipmen must participate in a sport at some level between intramural and intercollegiate.\n\nThe next stop was Dahlgren Hall, with a rich history of various purposes.  \n\nMy favorite stop was Bancroft Hall, the largest dormitory in the United States.  This is where life as a cadet becomes very real.  Visitors are very rarely allowed on the housing floors, and walking tours do not go there.  However there are many places on the main floor where visitors can see an example of a living space, view photos and brief biographies of famous graduates of the academy.\n\nThe final stop is the chapel.  A beautiful building with a rich history.  The bottom floor has the tomb of John Paul Jones, one of the most famous early naval heroes.\n\nOnce the tour is complete, visitors are allowed to continue walking around the campus, and during certain hours visitors are welcome to eat in the officers club, or other restaurants on the campus.\n\nIf you time your visit just right, you can watch the noon formation in the courtyard outside Bancroft Hall.  This is the pre-lunch formation where you gain a sense of understanding for the attention to detail and discipline of the midshipmen.\n\nThe Naval Academy walking tour is not to be missed.",
  "Our preferred location to stay in Annapolis has always been on the grounds of the Naval Academy - it's so conveniently located, & beautiful. It cannot be beat.",
  "This is a great place to visit. Lots of history and in a beautiful setting. The food at the Alley is excellent and very reasonably priced for the Annapolis area.",
  "We did a self guided walking tour. The stained glass in the chapel is breathtaking. Visiting the crypt is a must, as is the museum!  The models of so many ships were incredible. The grounds of the Naval Academy are a great place to walk and sightsee.",
  "I thought it would be more like a military base, but it's more like most university campuses, but with more history and famous alumni. My sister and I stopped a young man who was in full dress uniform because we jsut had to get a picture with a sailor.lol. The young man was very accomodating and so polite. Overall we had a nice visit even though it WAS a little chilly that day. The town of Anapolis is VERY interesting. There are historical markers EVERYWHERE telling about the different architectural periods of the buildings. some of the streets are still cobblestones, we went on halloween in the afternoon and saw kids trick or treating at the governors mansion. then we went to the wharf and had an amazing crabcake dinner. The whole town is so quaint and oozing history and the locals were so friendly. We quite enjoyed the whole experience",
  "Very nice place to visit when in Annapolis.  Take a walk around the beautiful campus and enjoy a view of the water.  We Visited the museum with a wonderful exhibit of ship models and many other interesting displays."
 ]
},{
 "name": "Annapolis Historic District",
 "address": "Main Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/8a/ea/d6/historic-annapolis.jpg",
 "tags": [
  "historic",
  "walking",
  "historic",
  "unique",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d4546220-Reviews-Annapolis_Historic_District-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "I can't imagine a visit to Annapolis without stopping here. Whether you're visiting one of the various restaurants for brunch or dinner, or just snagging memorable photos from the dock or along the main street, this little spot of heaven is not to be missed.",
  "The historic district is full of interesting shops and eateries. Very clean and safe area, including the public  restrooms. Plenty of paid parking.  Many items are overpriced but that is to be expected in a tourist zone.",
  "thoroughly enjoyed walking the streets of the historic district. Even though walking some of the streets is a little tricky due to the uneven pavement and cobblestone streets.But overall it was fascinating reading all the historical plaques and learning about the different time periods and architectural styles. we wandered around for hours. The people were very friendly too.",
  "The ideal first stop here is the main Visitors Center (with the Gotts Court parking garage next door) to gather a map and info. This is just a block from the beautiful capitol building which is a MUST to visit (self-guided tour and photography allowed) and surrounded by gorgeous vintage buildings. Radiating like spokes from the street circling around the capitol are streets lined with unique shops, galleries, a pottery studio, restaurants... This is a delightful area and so easy to explore on foot while your car is tucked away in the parking garage.",
  "Lots of history (don't pass up the museum at the US Naval Academy or the tomb of John Paul Jones) all within a few blocks. "
 ]
},{
 "name": "Quiet Waters Park",
 "address": "600 Quiet Waters Park Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/65/cc/3b/quiet-waters-park.jpg",
 "tags": [
  "free",
  "walking",
  "art",
  "family",
  "art",
  "nature",
  "music",
  "hike",
  "walking",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d116671-Reviews-Quiet_Waters_Park-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Really nice park away from the hustle and bustle of downtown Annapolis.  We've been here a couple times in the past but now that they have re-opened their Dog Beach we'll definitely be visiting more as our golden retriever loves to swim.  There are lots of different trails for all skill levels, I prefer hiking besides bodies of water and the South River is beautiful so it's a good fit for us.  They even have a gazebo with a little bridge over a small pond which is great for photo opps and last weekend they had vendors to celebrate Earth Day, plus admission was free to celebrate.  The dog beach is a bit smaller than Downs Park and not fenced in but it wasn't at all that busy on Sunday so our dog was able to get a lot of exercise in.  The restrooms are clean and usually have water bowls for dogs outside plus they even have a handheld shower so you can wash your dog off after swimming.",
  "This is a nice, quiet get away with beautiful walking trails, duck boxes, waterfront views and arboretum.  It's a great place to have a picnic.",
  "This park has more than most with hiking/ biking trails (paved and unpaved), good prices on kayak and bike rentals (you can kayak in a secluded area and/or the bay), a deli/grill, outside shaded eating/seating areas, huge fountain surrounded by gardens, art gallery, and summer concerts. Well maintained and beautiful wherever you are in the park.",
  "Our family has visited  and enjoyed Quiet Waters Park dozens of times over the past 20 years. We have had family  picnics there. Our grandkids have enjoyed the playground. We've enjoyed the art exhibits and concerts there. We all love to ride our bikes on the paved paths through the woods. And the water views are peaceful and relaxing. QWP is a special place for a nice afternoon.",
  "Visited on a winter's day in the late afternoon. Skaters were laughing and enjoying the rink, after renting ice skates. Made an impression on me that, far from closing early in winter, they turn on the lights and music and encourage people to have even more fun. I  wanted to go walking and found several short, paved trails (some up and down as the terrain changed but no climbing over roots or rocks) leading to different vantage points where you could see the (yes) quiet waters of the bay.  There were many people out walking dogs (and there's a dog park) but there was almost no barking, as if the dogs also respected the calm surroundings. Out on the water, various waterfowl paddled around. I was charmed by the little buffleheads, suddenly diving for dinner and then coming up to placidly hang out with their buddies. In a short period of time, I traversed three of the trails, emerging by the water in different inlets. The third took me down to the boathouse and docks, to greet all the kayaks waiting for warmer weather. Kayaking must be perfect on those waters! My only gripe is that the trails are each rather short. In total, they amount to six miles, but you really don't feel deep into nature anywhere except gazing out upon the quiet waters.  Not a place for a big hike, but a super spot for a relaxing stroll. Seems as if you are always close to developed facilities. But it is a superb spot that seems to spread happiness and friendliness, because everyone is sharing this natural beauty together.",
  "Quiet Waters Park has a great walking path. It is a circle around the entire park with spots to branch off and see the water. It is paved the entire way. Plenty of wildlife to see too.",
  "Drove down from DC to this beautiful place and enjoyed scenery.Even with a wedding going on we had enough space to ourselves on the waterfront. Well maintained road & walk ways. Great place to spend from couple of hours to whole day",
  "This is such a beautiful park, hidden gem. Beautiful scenic views if the Chesapeake Bay. There is even a dog beach. You can fish off the pier and search for fresh MD crabs. $6 per car entry fee"
 ]
},{
 "name": "Maryland State House",
 "address": "91 State Cir",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/1f/28/38/rodeandola.jpg",
 "tags": [
  "history",
  "history",
  "unique",
  "tour",
  "active",
  "tour",
  "wander",
  "walk",
  "structure",
  "history",
  "unique",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d142550-Reviews-Maryland_State_House-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Learned the history of the first US capital.  See life size bronze figure of George Washington retiring his commission as general of the US Revolutionary War Army and truly spectacular statehouse and gardens.",
  "The state house is a nice stop while in Annapolis. The most important thing about it is the room in the Old House Chamber where General George Washington resigned his commission as Commander in Chief of the Army and retired to private life giving power back to the citizens of the newly established country. Definitely check it out while in Annapolis. ",
  "Not only does Maryland have the oldest U.S. state capital building in continuous use since colonial days, but it has maintained the building beautifully, offering visitors the opportunity to see not only the rooms currently used by the Maryland State Senate and House of Representatives, along with the many Tiffany windows installed during the addition of the Annex in the early 1900's, but also the restored Senate Chamber where G. Washington resigned his commission as Commander-in-Chief of the Continental Army in 1783, his hand-written resignation speech, and many portraits of individuals from Maryland's history. The State House should not be missed on a visit to Annapoilis.",
  "State Capitols are always unique.\nThere is always an amazing  story to the dedication of the citizens and integration of the architecture to make a statement of  the power of statehood. \nMaryland is maybe the most unique...\nIt is the oldest continuous used state Capitol  building. It was partiality designed by Ben Franklin. It was also where the British signed the peace treaty with the USA and where Washington resigned after two terms as president. \nWOW!!!\nNo wonder visiting these special buildings  across America is exciting. \nLast year was with Opryland buddy and just as cold ....but cold wind travel makes taking wine/snack breaks even better...\nMaybe another next year....\nColonial Annapolis  is just a few streets away with all the crab cakes and Navy Cadets that Maryland has to offer.\nOnly 40 minutes from Baltimore \nSo fun!!\n\n",
  "We went to Annapolis for a weekend and decided to tour the Capitol State House. Pretty interesting! Learned a few things about George Washington that I did not know .Also, very informative about Harriet Tubman and Frederick Douglas. Its good to know it is their active chambers for the State House and Senate!",
  "This is a must to see! It has been beautifully restored and it is delightful to be able to wander freely (self-guided tour) and to be able to take photos anywhere.",
  "The Maryland State House was on our list to at least walk by, but when we walked around the building and saw a visitor entrance, we thought we'd stop in. There are a handful of exhibits documenting the local history, most notably Washington's resignation. You can take your time here, but also simply walk through at a quicker pace. The structure sits stop a hill, making it a key point of interest in town. We also got a view of the open Senate Chambers while they weren't in session. Recommend a stop in even if you're not a history buff.",
  "This is a rather unique combination of the colonial origin and modern annex where Washington resigned from his public service and became a private citizen again. Therefore it has defining significance in the republic nature of the nation. A must to see."
 ]
},{
 "name": "Ego Alley",
 "address": "Annapolis City Dock",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/23/20/8a/view-from-dock-into-adjacent.jpg",
 "tags": [
  "family",
  "free",
  "historic",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d196116-Reviews-Ego_Alley-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Ego Alley is located in the heart of downtown Annapolis. It's a very peaceful area to visit and just enjoy your day especially when the weather is nice.  parking can be a little tight on the weekends so be prepared to park in the end or Lots located further down the street. You will find plenty of restaurants throughout the street and of course chick and Ruth's Diner which is the best place in my opinion. You could be a little windy so bring a jacket and obviously that's because you located right off the pier. ",
  "Ego Alley is located in the heart of downtown Annapolis. It's a very peaceful area to visit and just enjoy your day especially when the weather is nice.  parking can be a little tight on the weekends so be prepared to park in the end or Lots located further down the street. You will find plenty of restaurants throughout the street and of course chick and Ruth's Diner which is the best place in my opinion. You could be a little windy so bring a jacket and obviously that's because you located right off the pier. ",
  "For whatever you think about ego alley it is the main walkway outside of main street.you can't avoid it when going to the city dock. I have kayaked a number of timed through here in the summer. Nothing like docking a kayak and shopping on main street afterwards.\n",
  "There seems to be a great deal of activity in this area all day and into the night.  There are a few restaurants where you can get a good meal along with interesting sights.  I am sure you will enjoy this experience.",
  "This is a fun spot to hang out and watch the boats and people. Lots of restaurants nearby and a multitude of activity.",
  "If you like to see yachts and the yacht club this is right up your alley.  It was very scenic and calming.",
  "Ego Alley which is really a walkway is in a great area for relaxing, pictures, watching the boats, having a meal, or shopping. It is a narrow waterway that is Spa Creek. Located in the heart of Annapolis. We came here to sightsee, watch the boats, relax, and have a date night. We went to one of the restaurants and then walked to the docks and on Main Street to checkout some stores. There are several local restaurants nearby since you are in historic downtown Annapolis. Several shopping as well nearby. The alley/dock itself has benches to sit on. There are newspaper machines too. Cobblestone walkway creates part of the historic feel but beware you can trip easily since it is not flat/even and some of them are coming up.  There are bathrooms and showers for boaters. They have parking near the walkway but it can be a bit tight – some of it is free while others are metered. It is very beautiful at the docks. We hung out a while just looking at the water. Great area for people watching if you are into that. The Naval Academy is nearby as well if you want to visit that but check the times. I would definitely recommend going to Ego Alley. We did not partake in getting the famous ice cream nearby (Storm Brothers) since we were still full from dinner but it is a popular place. This area is great if you are by yourself, with friends or family, or a date night.",
  "This is the place to go when you’re in Annapolis. It has it all: great sights, restaurants, shopping, beautiful art, tours, etc. You’ll eventually end up here if in town so enjoy. "
 ]
},{
 "name": "Pennsylvania Dutch Farmer's Market",
 "address": "2472 Solomons Island Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6f/f1/d2/pennsylvania-dutch-farmer.jpg",
 "tags": [
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d2257852-Reviews-Pennsylvania_Dutch_Farmer_s_Market-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have been visiting the market for many years. The sell some of the best homemade bread, pastries, fresh vegetables and baking supplies in the area. They also have a restaurant that's open for breakfast & lunch serving products available for sale in the market. The staff are always friendly and courteous but, a little distant. The employees are not all authentic so, don't be surprised to see make-up and cell phones. The place is always crowded, so arrive early to bet the rush. We've visited many other markets like this one and none compare.",
  "We go here every month. Their bakery is awesome, the donuts are fresh and warm, and the pretzel hot dogs are delicious. They have lots of produce and avast butcher shop. Highly recommend shopping here. Parking can be busy and tight on Saturdays, but things move pretty quickly. ",
  "We have been visiting the market for many years. The sell some of the best homemade bread, pastries, fresh vegetables and baking supplies in the area. They also have a restaurant that's open for breakfast & lunch serving products available for sale in the market. The staff are always friendly and courteous but, a little distant. The employees are not all authentic so, don't be surprised to see make-up and cell phones. The place is always crowded, so arrive early to bet the rush. We've visited many other markets like this one and none compare.",
  "Individual stalls with various products, running heavy on candies, pies, cakes, donuts, etc. There also is a good selection of herbs and various types of flours. A small cafe is inside with reasonable prices.",
  "Have always loved shopping Amish markets, but this is huge and indoor.  The bakery, meat counter and cheese case all looked amazing.  Had to sample fresh donuts and pretzel dog.  Yum! They even had a place to grab sit-down breakfast.  Market is only open Thursday to Saturday.  Will make a trip back just for the meats and get some more peach butter!",
  "I went 2 different days. The foods presented were fresh and top quality. The restaurant is exceptional. Be aware, there are several separate businesses here, and one pays each vendor separately, and sometimes where one pays for what is unclear. There are definitely products here that are NOT Amish, or even hand made, but if one looks they are obvious. Unsure of the sect of Amish here, as there were a mix of dress colors, and English is spoken amongst themselves.",
  "I initially convinced my wife to go here because I usually associate a place like this (especially with Pennsylvania Dutch on it) with quality products and home-made items, or at least, home farmed. We were really surprised when we asked around at some of the counters to find that many of the things sold there are not actually produced by the community! For example, the beef that we purchased was not farm raised by the people selling it. Same with most of the vegetables and also the cheeses. Did I miss something here? It really seemed to me as though most of the items were not locally produced. It's not a true farmer's market because it's a permanent edifice, and it also seems to me like the farmers are not the ones presenting their goods.",
  "Great selection of fresh products, prepared foods to take home, snacks, pies, meat items, sandwich, candies, and numerous other items. Well worth the time to visit. "
 ]
},{
 "name": "The Kunta Kinte - Alex Haley Memorial",
 "address": "Sidewalk At City Dock",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/18/9b/60/kunta-kinte-in-annapolis.jpg",
 "tags": [
  "learn",
  "history",
  "history",
  "learn",
  "food",
  "eat",
  "walk",
  "historic",
  "food",
  "tasting",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d552395-Reviews-The_Kunta_Kinte_Alex_Haley_Memorial-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a must do activity for all ages. Takes about 10 minutes but please read each comment in bronze. Learn about love, diversity, forgiveness and other virtues. Remember how horrible some people were treated in slavery. Learn so we do not repeat it. This memorial is easy to miss--please look for it at the waters edge. Let us all forgive and love and respect diversity.",
  "Alex Haley became famous in the 1970's for writing a story about an early relative of his named Kunta Kinte. The ancestor was brought to America, specifically Annapolis, Maryland in 1767 on a Slave Ship. Thousands were ultimately brought to the Mid Atlantic area and either 'sold' into slavery in Annapolis or shipped off to Alexandria, Virginia, as well as some other sites no doubt, to be sold. This has become a very dark part of America's history, yet nonetheless true. The statue is located in the Harbor of Annapolis, a specific part known as 'Ego Alley' and it is a restive spot, but also one that attracts a lot of attention for picture taking. The statue is of Mr. Haley reading to a few children who are resting at his feet. There is no cost to stop by and the natural beauty of the harbor blends in nicely with the statue.",
  "It is worthwhile to read all the brass plaques around the statues, which cannot be missed. A leisurely stroll is all it takes. So get an ice cream cone and learn some history in a very enjoyable setting.",
  "This is just a few statues along the water front to look at and read about, but it's a great place to eat after you grabbed some food from across the street at the market. lots of people hang out hear in the evening and day to eat and chat along the water. Just sit and relax and watch the boats and people moving around the harbor area.",
  "The sculpture was nice and you can sit by the water which is always pleasant in the summer. There are also a lot of nice restaurants and shops nearby since it is located in the historic district.  Just a nice place to walk around.",
  "Nice memorial/sculptures located right by Main Street and the city docks of Annapolis. The location of the memorial is beautiful. Located in the heart of Annapolis.",
  "First time going to the festival and it was very exciting and knowledgeable. Great tasting food, entertaining main stage and demonstration tent was very knowledgeable",
  "Always struggle with rating a statue. This one is particularly good though. It shows Haley reading to children, which I find very touching. It’s located in the heart of the downtown area right at the head of the docks, so if you’re a tourist, you’re bound to see it. "
 ]
},{
 "name": "Sandy Point State Park",
 "address": "1100 E College Pkwy",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/1f/68/03/beautiful-sunrise-at.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d2281496-Reviews-Sandy_Point_State_Park-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Sandy Point is the closest beach to my home...only a 35 minute drive. The beach is clean and there were plenty picnic tables with grilling areas. The water was clean and the view of the Bay bridge was nice.",
  "Real nice Christmas light show. One of the best car drive throughs I have seen. It took us awhile to figure out how to get out of the display,",
  "was a nice place to swim and picnic. Teens had fun.  Parking was easy. Water in August was warm. Enjoyable.",
  "My grandson loved the beach and water.  The park was clean and provided a beach feel!   Looking at the Chesapeake Bridge while cooking off provided a pleasant, awe inspiring feeling.  Will definitely visit again when I am in the DC and Silver Spring area as the traffic is doable as well.",
  "This is my second year going to the Maryland Seafood festival and I LOVE IT. when you go with good people and friends you just have an amazing time.  Several vendors to choose from to sample and taste all the best seafood."
 ]
},{
 "name": "William Paca Garden",
 "address": "186 Prince George St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/6c/28/95/view-of-garden-from-the.jpg",
 "tags": [
  "walking",
  "tour",
  "historic",
  "tour",
  "history",
  "wander",
  "tour",
  "knowledgeable",
  "tour",
  "history",
  "historic",
  "tour",
  "kids",
  "family",
  "tour",
  "walking",
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d116665-Reviews-William_Paca_Garden-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had a wonderful tour of the William Paca House and Garden recently.  Furnishings and decorative touches, as well as architectural details are amazing.  Just wished we could have taken photographs while there.  The gardens were lovely, even in early April.  Location is close to the center of historic Annapolis, and is easy walking distance from several other interesting sights to see.",
  "The Paca House and Gardens are a historical and architectural gem in Annapolis.  The house is an excellent example of the Georgian Colonial style and has been beautifully restored.  The tour lasts an hour and was informative about the house and the history of William Paca, a Maryland Governor and signer of the Declaration of Independence who also pushed for ratification of the Constitution.  The gardens are lovely and available to wander on your own before your tour starts.  There is an excellent exhibit on the history of the house and some early Annapolis history.",
  "The garden is gorgeous with so many hidden lily ponds, bridges, archways and tufts of beautiful plants.  There is so much to explore.  The house tour is also very interesting with very animated, knowledgeable guides that stay in character the whole time. (I love how when a child asked a question our guide would say, \"Yes, good sir?\")  When exploring Annapolis it is important to work this into your itinerary because William Paca is a part of many other residents intertwining stories. Many of the old homes are only within 5 minutes of each other.  If you pair this house with at least 1-2 others in the nearby area you will truly feel like you just spent the day in a Colonial neighborhood. ",
  "We visited on a weekday and found street parking immediately in front of the house, but it isn't far from a public parking garage. The staff is very nice. Mr. Paca (apparently pronounced pehka) signed the Declaration of Independence (look under John Hancock's signature). The tour is about an hour, but visitors should spend at least half an hour in their waiting room watching their videos and reading the displays.\nThe colonial kitchen display was quite educational for my granddaughter. However, as with most of these historic sites, I didn't find either an outhouse, well/pump, or bath. Life without electricity, running water, refrigeration, central heating and air conditioning is significantly different than what we expect today, not to mention no phone, TV, Internet, etc.\nThe site is very close to the State House, with a great Irish pub in between. If you visit Annapolis and have an interest in history, you should visit the Paca house and gardens. Good for all ages. They did a great job restoring the site.",
  "The William Paca Garden was nice.  While it's over two acres of structured gardens, it's a quick tour stop.  ",
  "If you haven't done a lot of colonial house tours and haven't read much about the time, this works for you.  \n\nAlthough the actually house, the rooms are not reproductions of the house as it was in the 1770s, with a few exceptions.  It is set up as an interpretation of typical life for this class of family at the time.  This was illuminated near the outset of the tour.  The guide asked what we could interpret form Paca's interests based on the wall decorations.  There were a bunch of maps.  After the answer was called out, one tourer asked how close this room was set to the 1765 version.  The guide admitted that not only were the wall decorations not authentic, the room wasn't even the accurate room for the purpose depicted.  It had been moved from across the hall.  This came after the guide highlighted that this \"wasn't Williamsburg where they rebuilt the structures, this was the original building.\" Then she went on to say in the tour that for the authenticity of fabrics and furniture, they consulted Williamsburg on everything.  \n\nThe gardens were not particularly well kept either.  Maybe that was a function of late April.  Giant canopies directly in back of the house, while functional, I guess, to provide shade for visitors, ruins the ambiance and visuals of the Georgian house and gardens.  \n\nThe most fascinating part of the visit was learning of the hotel that used to be behind the house.  While downplayed during the visit as some kind of nuisance, subsequent research I did proved the hotel was actually the most coveted stay in Annapolis from about 1910 to 1960.  Down the street from the USNA, why wouldn't it be.  Having a video or some reproductions somewhere in the tour might augment the only truly difference between this house and all the other colonials open for visits throughout the original colonies.\n\nAgain, if you're not into this stuff and are just walking you and your kids through, it's a nice 60 minutes.",
  "Well worth the visit.  The furnishings in the home were elegant and the tour guide showing us around gave background on the history of the house and its owners.  William Paca was a signer of the Declaration of Independence which was a fact I did not know.  The guide took us to different rooms in the house. \n My favorite was the kitchen which had the original pots they cooked in and the fireplace where they cooked.  It was a great tour.  The gardens are nice in the back too.  They have flowers, hedges, and garden plants. These were the kind of plants they grew in those times. ",
  "The gardens of the Paca House are amazing.  The gardens and the house have been all remarkably well preserved. Well worth a visit. ",
  "Was a real disappointment.  Not much blooming, and most flowers looked in real need of watering.  The kitchen garden was the exception.  That looked well cared for, with squash, asparagus, pear trees, tomatoes.  The little house is a nice focal point. ",
  "We toured the gardens of the Paca House, skimping the house tour.   Cost was $5 for garden only.  Definitely worth while.  As an added bonus, the head gardener spent about 10 minutes with us sharing history on the property as well as details about the gardens.",
  "On a recent visit to Annapolis, my husband and I took a guided tour of the William Paca House. Although the opening hours of the house are posted online, the time of every guided tour is not. I suspect they may augment these based on crowds and demand. On the Saturday we visited, we arrived around 1:15pm and were informed the next tour was leaving at 1:30pm, which was perfect. Our tickets entitled us access to the gardens so we explored those first. The gardens were pretty, but small and honestly not the highlight of our visit. The house was great though! Our tour lasted just over an hour and our group of about 10 people was led by a decent. We visited the various rooms of the house and learned about the architecture, the house's history since its original owner, and about the history of Annapolis. This is a nice stop while in Annapolis!"
 ]
},{
 "name": "Banneker-Douglass Museum",
 "address": "84 Franklin St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/83/07/0a/photo8jpg.jpg",
 "tags": [
  "free",
  "history",
  "historic",
  "history",
  "walk",
  "tour",
  "learn",
  "history",
  "free",
  "unique",
  "kids",
  "history",
  "history",
  "history",
  "free",
  "art",
  "free",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d218830-Reviews-Banneker_Douglass_Museum-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Banneker-Douglass Museum is the State of Maryland's official museum of African-American heritage. The museum, which is located in downtown Annapolis, was built in the historic Mt. Moriah African Methodist Episcopal Church and chronicles the history of African Americans in Annapolis from slavery though the Civil Rights era. \n\nThe museum is imitate in size and FREE to visit. When you visit, make sure you speak with Mr. Theodore Hyman, Jr., also known as \"Mr. Ted\". Mr. Ted is the security guard at the museum and can provide you a living record of Annapolis and fun facts about growing up there. \n\nIf your visiting Annapolis, the Banneker-Douglass Museum is well worth the 1-2 hours it'll take to explore the museum.",
  "My husband and I literally just walked by this museum and decided to stop in. It is rich in African American history and definitely worth a stop. Very well done.",
  "Ventured out to Annapolis specifically to ck this place out. And despite being from the south, and having stepped in just about every slavery museum in Dixie, AND the African-American Smithsonian museum (twice!!). I always find out that I have yet to learn all there is to know about the history of slavery. \n\nThere's street/meter parking around the corner (?fee) and apt/weekend parking for $3/hr across the street (only about 10 slots: we got lucky and didn't have to drive around looking for street space). \n\nVery small museum: easily done in an hour -maybe 90minutes if you listen to each and every video or audio available -and it's free.   There was a sign that you could pay for tours, but the young girl at the front desk didn't seem too aware of much. We walked in, looked at her, she looked at us, and silence. Then she said sign in, which we did, and then more stares. I finally asked \"uh, so, where do we start?\"\n\nWe leaned from the security guy that the church had been an AME church many years  ago, but the age of the building led to costly upkeep so the congregation sold it to the city and moved.  City was to tear it down to make it a parking garage but enough folk gathered together, formed a society and fought to make it a Md landmark. \n  The guard was full of great bits of info, and though he didnt follow us around he popped up from time to time w even MORE INTERESTING history nuggets: wish Ida got his name\n    \n\nBasically 3 sections:  walk in and to the left is a small reading room: tv w a rolling story, and various seating options if you care to pick up a book or look through photos. The theme, like many museums exhibits, changes periodically (or so the volunteer -security gentleman told us)\n  Straight ahead are stairs to the second floor, or an elevator.  (Restrooms are to the left of the Elevator) Per his guidance we took the elevator to the third floor and worked our way down \n\nThird floor on one side is office area (workers only) and the other leads to the balcony of the old church. Much like the reading room the exhibit here changes periodically.  This outing celebrated the 35th anniversary of the museum by showing 50yrs of personal work by Laurence Hurst-Baltimore native artist, and others \n\nOne lap around the balcony doesn't take long and you can take the stairs to the main church floor, or ride the elevator to the 2nd floor.  Continued exhibit of what was on the balcony: again, one lap around doesn't take long. \n\nThe other side of the second floor is the history of some slavery specific to Maryland and of course info on Banneker and Douglas and Harriet Tubman.  \n\nPlus a few others you may/may not have heard of.   Like Herbert Frisby: 2nd African American to the North Pole.  We all hear about Matthew Henson (the first), but it was Frisby who actually left a plaque at the North Pole commemorating Henson. (I like his quote about adventure: he visited the polar regions over 22 times, simply because \"a negro isn't supposed to be interested in such things\"! A man after my own heart!)\n\nNot only slavery, but the history of blacks in MD in general is presented:  photos of high society, private black beaches with concerts featuring Sara Vaughn, and more. \n\nThere appeared to be a class of ?4th graders w a tour guide listening and actively participating - a delight to watch them engage and learn. \n\nI'd def recommend stopping in and spending an hour or so: you might learn something you never knew!\n\nOh yeah. The security guard also shared with us the story of Stage Coach Mary, and Bass Reeves - look them up: thumbs up\n\nYou can leave a monetary donation. \n\nAcross the street and to the right is 1747: self proclaimed oldest pub in Md.  read my review of it, if you care too",
  "The staff was immediately  welcoming to my three kids and me.  They commenced with giving us a brief history lesson about the bldg. and some of its unique past, little-known details.  The upstairs is where most of the museum seemed to be, and it was nicely laid out.  I would like it to be quite a bit bigger, and perhaps have a few more audio exhibits.  Otherwise, it was well worth our time and made for a nice visit.  Thank you.",
  "This small museum does an excellent job of presenting African American history from the earliest slave trading days through the civil rights movement and to more contemporary events.  There is an informative and interesting film about Frederick Douglass.  The exhibits are well presented.  I learned a lot.  The gentleman at the front desk was also very interesting, explaining the museum and history.  If you continue to Richmond, make sure you see the Maggie L Walker home! She is mentioned at this museum and is an amazing woman. ",
  "This small museum has an outstanding array of African-American history from the early slave trade to contemporary issues and events. We hightly recommend the film dramatization about Frederick Douglass. Photos are permitted of the displays.",
  "A fairly new museum, 1984, it records and honors Benjamin Banneker (born free in Maryland) and Frederick Douglass (born a slave in Maryland) and their contributions to our nation. Both opposed slavery, both fought for equality.  Bannekker was a methematician and scientist (who I learned about in school but likely wouldn't have had he not been a Marylander); Douglass escaped slavery and became a great orator and writer. There is a video presentation well worth watching. The museum is small and going through it can be completed in just a few hours, but is very information. I also enjoyed the art galleries there. While very attractive for African Americans eager to embrace their heritage, it was just as meaningful to me and I encourage anyone to check it out, ",
  "The size & approach taken in this museum was perfect. Rather than overwhelming the visitor with too much information, they made history very meaningful. The little theater had short films on the life of several community activists. The exhibits were enhanced with audio recordings. The preserved church had art works on display at the time of our visit. Overall a very clean, well maintained, welcoming educational experience. Free Admission but we left a well deserved donation."
 ]
},{
 "name": "Chesapeake Bay Bridge",
 "address": "850 Revell Hwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/1c/b9/dc/closer-look-from-restaurant.jpg",
 "tags": [
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d12516172-Reviews-Chesapeake_Bay_Bridge-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have read that some people fear driving over this bridge. I thnk it is quite safe if one stays in lane and maintains a steady speed. They have done a good job of managing traffic during construction after there were initially long delays. Miraculously, the work will be finished a year ahead of schedule. ",
  "I have fear of heights, especially on bridges. I drove on the bridge today and it was not too bad -- my fear did not kick in -- I was shaking when I was on Chesapeake bridge connecting the peninsula and Delmarva.",
  "Drove over the bridge in the morning of Thanksgiving day so no waiting to get on the bridge! As other reviewers have mentioned, the bridge is very high and 4.5 miles long with open span. That day there were high wind gusts and had to hold the steering really tight but it was worth it! The thrill of going so high and appreciating the engineering marvel all throughout- simply priceless!  I",
  "I really hate driving over the bay bridge. It is so high up and so long. I white knuckle it the whole way. I wish it felt more secure. ",
  "I love this bridge. It's a little scary coming back from Eastern Shore as there is no dividing line between oncoming traffic, but generally speaking I enjoyed the ride across. Such a lovely place and so filled with history!"
 ]
},{
 "name": "Navy-Marine Corps Memorial Stadium",
 "address": "550 Taylor Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/93/35/8c/midshipmen-entrance-on.jpg",
 "tags": [
  "tour",
  "food",
  "drink",
  "walking",
  "historic",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d11797033-Reviews-Navy_Marine_Corps_Memorial_Stadium-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Superb- The tour is highly recommended and the entire experience is memorable- I wish I had more time- 5 hours or so is a suggestion",
  "This is a nice place to catch a football game and in particular the Military Bowl.  This was our first visit and we saw the parade before the game and they had a “tailgate” area selling food and drinks (along with other activities) in addition to all of the traditional tailgates going on the parking lot.  It was easy getting to the stadium with the only backup within a mile or so of the stadium.   We parked at the stadium in the blue lot which was very convenient and close.  We were in the lower level just under the overhang close to the 50 yard line on the home side which were great seats.  In walking around the stadium I really did not see anyplace that I would describe as a bad seat.  This is probably the only football fame we have attended that my wife said she did not have to wait in line for the bathrooms.  There were plenty of food and drink vendors and the stadium\nwas very clean.  We also enjoyed participating in the USO event of packing items to send out to overseas troops.  \n\nOverall a great experience and we even got to see some old classmates.  It was also easy leaving the stadium heading into the historic downtown.  ",
  "A really nice place to see a game. This is what I would call a small/medium venue college football stadium. Very clean and well maintained. Lots of parking near the stadium as there are two public schools that make their parking lots pay lots which in turn benefits the schools. Lots of concession stands and bathrooms. Did not have to wait for either. I was in the first row of the upper deck and what I thought were ideal seats. Great views of the field. The large screen TV's at both end zones are nice to see replays and check the down and distance.\n\nI arrived 2 hours before game time not knowing the parking situation or the traffic. For you first timers, 1 hour before game time should be plenty.",
  "This stadium was very impressive and well maintained.  It was closed the day we went there.  One great thing we learned is that there is $5.00 all-day parking there (if there is not a game, of course), and a shuttle bus will take you into the middle of Annapolis for about $2.00.  What a deal since parking in Annapolis can be pricey and not having to drive your car in the city is a plus!",
  "One of the best college stadiums you will visit.  Clean, well kept and full of energy, this is the type place you wish you could see more football games."
 ]
},{
 "name": "B&A Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/b9/77/8a/bike-trail.jpg",
 "tags": [
  "family",
  "walk",
  "walking",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d116669-Reviews-B_A_Trail-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Hey Severna Park people - you have treasure with your B&O walking/hiking/biking trail!  What a gem of a park path!  The intermittent park benches, some dedicated to loved ones (two and four legged) offered a bit of spiritual repose.  The cute coffee shops along the way clearly serve as a local gathering place. Very fun!",
  "Took the family to this trail and we had a wonderful time. There's a bike shop for rentals right along side the beginning of the trail. Great trail. We will go back for sure...",
  "My wife and I have been biking along this trail quite a bit over the last six months.  We have grown to appreciate it has one of the nicest trails in the Wash/Balt area.  We have biked many of the trails in the area (Mt. Vernon, Martha Custis, W&OD, Rock Creek, etc.) and this one doesn't have the tall high voltage poles, it's very suburban, it's well maintained, the people you encounter are friendly, it is hard surfaced for road bikes, and there is a ranger station with bathrooms and water midway.  It connects with the BWI trail which affords you a 40 mile round trip ride.",
  "This shared bike, walking and dog trail is a great trail to explore and walk.  It is easy and simple to pass the time.",
  "One of the best trails in the area. Well maintained paved trail. Mostly tree lined and provides a nice amount is shade for those hot days. Well used by bikers, bladders, joggers and walkers.",
  "Hey Severna Park people - you have treasure with your B&O walking/hiking/biking trail!  What a gem of a park path!  The intermittent park benches, some dedicated to loved ones (two and four legged) offered a bit of spiritual repose.  The cute coffee shops along the way clearly serve as a local gathering place. Very fun!",
  "Very good for an easy ride.  Some stopping for streets, however.  While we have electric bikes, they are not needed.  Best trail I have been on that requires minimum effort.",
  "Took the family to this trail and we had a wonderful time. There's a bike shop for rentals right along side the beginning of the trail. Great trail. We will go back for sure..."
 ]
},{
 "name": "Great Frogs Winery",
 "address": "3218 Harness Creek Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/4e/0b/e1/walk-among-the-vines.jpg",
 "tags": [
  "tour",
  "tasting",
  "tour",
  "tasting",
  "tasting",
  "delicious",
  "tasting",
  "tasting",
  "winery",
  "walk",
  "winery",
  "unique",
  "food",
  "tasting",
  "winery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d8838886-Reviews-Great_Frogs_Winery-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have been to this vineyard/winery twice recently.  Both times were private parties.  It has a beautiful tasting room in an old, rustic tobacco barn and grounds with picnic tables.  The wines were very good.  They have a nice selection of white, red, rose, port-type and dessert wines.  If you would like to have a cheese basket to accompany your tasting that can be provided if you order ahead of time.  The only negative is they have limited times that they are open.  They are open Friday and Saturday 1-5 by appointment only so make sure to call before you go.  Also, the barn is drafty so wear warm clothing if it is a cold day.  The wine maker gave us a great tour of the wine making operation and the server gave us a great informative tasting. They also host private events like ours.  Both experiences were excellent!",
  "I have been to this vineyard/winery twice recently.  Both times were private parties.  It has a beautiful tasting room in an old, rustic tobacco barn and grounds with picnic tables.  The wines were very good.  They have a nice selection of white, red, rose, port-type and dessert wines.  If you would like to have a cheese basket to accompany your tasting that can be provided if you order ahead of time.  The only negative is they have limited times that they are open.  They are open Friday and Saturday 1-5 by appointment only so make sure to call before you go.  Also, the barn is drafty so wear warm clothing if it is a cold day.  The wine maker gave us a great tour of the wine making operation and the server gave us a great informative tasting. They also host private events like ours.  Both experiences were excellent!",
  "Great frogs continues to grow from a tadpole to a true hoppin' place to be. The new tasting room is airy and nice (we still prefer the old barn)...wines also improve as the property builds. Hop on over on Fridays and Saturdays as they now offer public tastings. ",
  "Great ambiance. Friendly service. Delicious snacks. I enjoyed 5 of the 6 wines- maybe the white was good too, but not my thing. It was a very good way to spend some relaxing weekend time. I will definitely go back. ",
  "We did the celebration experience and had a blast! Best wine tasting I’ve done! They give you a flight and you get to go at your pace. The wine was great and snack plate paired perfectly. And the gift did not disappoint! ",
  "What an amazing find! We recently visited Great Frogs Winery and enjoyed a 6 wine tasting. It was amazing. Great wines. Great service. Amazing venue. Must visit!",
  "This was such a fun winery! I loved everything about it! My girlfriends and I drove from Baltimore to visit and it was such a great experience. We went in and ordered a glass of red wine and got to walk around exploring. We enjoyed a live guitarist and overall such great ambiance there! ",
  "My wife and I were up from Florida celebrating our 13th wedding anniversary and one of our stops was Great Frogs Winery for a wine tasting.  When you first drive up to the winery you're greeted with actual vineyards, which may sound obvious but we've been to wine tastings with no vineyards in sight.  The setting was quaint and romantic, a place where the locals seem to hang out and enjoy some great wine.  As we were seated, we are served a mini palette cleansing charcuterie board and a basket with 6 different wines for the tasting.  Ben (the brother of the owner of Great Frogs) then came over and started us on our adventure in wine tasting.  His unique descriptions of each of the wines, food pairing, and the overall conversation were the most memorable.  Since we were celebrating our wedding anniversary they sent us off with a special gift!  Thank you for the great memory, we hope to be back one day."
 ]
},{
 "name": "Maryland World War II Memorial",
 "address": "Ritchie Highway MD Rte 450",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/93/3a/36/maryland-world-war-ii.jpg",
 "tags": [
  "kids",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d2401153-Reviews-Maryland_World_War_II_Memorial-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "This memorial is beautiful. Even with snow on the ground, it doesn't distract from the beauty of the memorial. \n\nOverlooking the memorial brings a sense of calmness and gratitude. This is definitely recommended for all ages.\n\nIt is easy to find and parking is available which makes it great for larger groups of visitors.",
  "Worth a small side trip, the Maryland WW2 Memorial will remind you of the many veterans who sacrificed for our freedom. Of course, Annapolis is a Navy town, so the reminders of ALL the services who participated is a good thing. This is a 10-20 minute visit - worth the stop. ",
  "This is a beautiful memorial overlooking the river. It is well worth seeking out and stopping to spend a half hour or more. The view over the river is beautiful. I have been three times and each time a feel a certain peace coming over me. A wonderful spot to reflect on life and what really matters.",
  "Very nicely done WW2 memorial, good teaching moment with the maps for younger kids.  It's worth a stop for a few minutes if you are in the neighborhood.",
  "This is a lovely tribute to those who served in WWII. \n\nThere are a lot of hidden monuments or tributes so take time to explore. One of our favorite features is to far left of the monument is a map garden showing the Pacific campaign and to the far right there is a map garden showing the Atlantic campaign. ",
  "Arrived by bicycle to encounter a historically informative, detailed, attractive and moving memorial to the battles fought during the second world war in both Pacific and European Thearters, It also provides a beautifual view of the Severn River and Naval Academy.",
  "Just a 5-minute drive from Historic Annapolis, the Maryland World War II Memorial, is a MUST-DO, for anyone visiting this part of Maryland.  The view over the river is stunning.  Very touching to see all of the names of those lost in World War II from the state of Maryland.  A beautifully designed monument in the most lovely setting...",
  "Abeautiful tribute to our fallen heroes.  A 5 minute ride from downtown.  Nicley laid out with plaques giving timeline of the war.  "
 ]
},{
 "name": "St. Mary's Church",
 "address": "109 Duke of Gloucester St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/31/8f/16/beautiful-interior-of.jpg",
 "tags": [
  "family",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d4660215-Reviews-St_Mary_s_Church-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We attended the 5pm Saturday Vigil Mass. It was all good, especially the gorgeous, traditional interior and choir. Father Dau said a reverent Mass; however, the alter servers needed a bit more instruction on the importance of their function :-)",
  "Sometimes you just want to experience Mass in a beautiful church with stained glass windows, statues and old tradition.  My parents would drive every Sunday 30 minutes to attend mass in this church and did so for 30 years and they lived next door to their own parish church.  In my mother's words, \"It feels like you've been to Mass\".",
  "We really enjoyed the opportunity to see this old church during a Sunday morning mass with the locals. Very warm and welcoming",
  "It seemed that the priest was retiring so he gave the most inspiring sermon. This Catholic church is located what was once the property of Charles Carroll Carrollton, the only Catholic signer of the Declaration of Independence. ",
  "I am in the Annapolis area several times monthly so on January 1,2019 I decided to start my year at St. Mary's where I attended morning Mass to Pray for family members and several friends who are ill and not enjoying a fullness of life. While there I am always in awe of the Historic Church's Beauty and Architecture. On this visit the Church was still decorated in it's Christmas Scene that brought out the beauty even more so. It was definitely an awesome way to begin my New Year!"
 ]
},{
 "name": "Hammond-Harwood House",
 "address": "19 Maryland Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/13/2f/89/back-of-house.jpg",
 "tags": [
  "tour",
  "history",
  "walk",
  "structure",
  "historic",
  "tour",
  "history",
  "history",
  "tour",
  "history",
  "walk",
  "structure",
  "historic",
  "tour",
  "history",
  "hike",
  "tour",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d218829-Reviews-Hammond_Harwood_House-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "The docent led tour was excellent. The gentleman guide was well informed about the history and architecture of the house including a beautiful collection of John Shaw furniture.",
  "We had a wonderful tour of the Hammond-Harwood House, by a docent who obviously loved history, and was eager to share what she knew about this historic structure.  The interior of the house is full of the most exquisite furnishings.  The architectural details were impressive.  Just wish we could have used our cameras, as we are\navid photographers.  The Hammond-Harwood House is an easy walk from the harbor, and there are several other\nhistoric sights nearby.  Highly recommend that you visit the Hammond-Harwood House when visiting Annapolis.",
  "The docents are wonderfully informed about all aspects of the history of this wonderful place. Don't miss it!",
  "The docent led tour was excellent. The gentleman guide was well informed about the history and architecture of the house including a beautiful collection of John Shaw furniture.",
  "We had a wonderful tour of the Hammond-Harwood House, by a docent who obviously loved history, and was eager to share what she knew about this historic structure.  The interior of the house is full of the most exquisite furnishings.  The architectural details were impressive.  Just wish we could have used our cameras, as we are\navid photographers.  The Hammond-Harwood House is an easy walk from the harbor, and there are several other\nhistoric sights nearby.  Highly recommend that you visit the Hammond-Harwood House when visiting Annapolis.",
  "We checked the website for times of opening and it indicated it was open.  Arrived to find a sign “closed for season.”  HELLO out there - update your website if you close for a prolonged period of time!!!  Not an easy hike for the elderly.",
  "Taking the in depth guided tour which spoke about the house, origins and each individual room. The guide was very knowledgeable and took her time talking with us.  To schedule this tour you need to call ahead, but you will gain much more knowledge then a self guided tour!!"
 ]
},{
 "name": "Thomas Point Shoal Lighthouse",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/fd/47/7a/thomas-point-shoal-lighthouse.jpg",
 "tags": [
  "unique",
  "walk",
  "tour",
  "tour",
  "walk",
  "history",
  "active",
  "tour",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d7154335-Reviews-Thomas_Point_Shoal_Lighthouse-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We enjoyed sailing in Chesapeake Bay for a day and decided we would try to sail south to circle Thomas Point Shoal Lighthouse on before sailing under the Bay Bridge going north. This lighthouse is one of a kind and very much unique in it’s construction. \n\nSeeing the TPSL up close is a worthwhile goal. ",
  "A wonderful voyage.  We took the 90 minute Watermark trip.  It leaves from the end of the City Dock - Walk on the Mission BBQ side.  The captain (Master) and a crew of four, three hands and a person tending the snacks and drinks bar.  These people are very helpful and extremely nice. The ride back and forth was very relaxing with some spray due to choppy seas.  But all in a days fun.  The vessel comes up onto the lighthouse that looks beautiful with the rocks protecting lighthouse and the horns to keep the birds from pooping on the red roof. ",
  "Visited  around the lighthouse that was included on our boat tour of the Chesapeake Bay.\nFantastic day; sun shining and calm seas. Our cruise lasted 3 hours.",
  "Need to get your license early in the morning as they only let 27 in at a time. Nice park like setting with picnic tables and port o johns.Didnt like all the rocks!",
  "Thomas Point Shoal Lighthouse is a screwpile lighthouse in the Chesapeake Bay.  A few days a year, The US Lighthouse society takes tours out to see the lighthouse.  I am a lighthouse fan and love to go inside them so I could not miss this opportunity.  This was a manned lighthouse from 1875-1986 when automation took over.  The society is restoring it to its early history in all the rooms. \n\nYou need to reserve the tour in advance and it costs $70 per person.  No one under 12 is permitted.  This is not physically demanding but you have to climb ladders, navigate through the supports and climb through a hatch. There are no bathroom facilities available for the 2-1/2 hour tour. The remaining tour dates for 2014 are October 4 and 11.  Each tour takes 18 people. \n\nThe tour departs from the dock at the Annapolis Maritime Museum in Eastport.  The docents and Captain give you a safety briefing and you board a Vietnam era navy river patrol boat for the  30 minute ride out to the lighthouse. This is a small boat and not everyone can fit under the covered area or out on the front.  But it was a smooth ride out and the Captain made a point of navigating wakes to avoid too much rolling.  \n\nYou dock at the small dock and after everyone boards the lighthouse, the boat leaves.  You gather on the lower deck where supplies were stored when it was manned and then climb through the hatch to the main floor.  The hatch gets shut so you can walk around the whole deck.  The lighthouse has a 4 room main floor with parlor, kitchen, office and a room the was just tool and supply storage this day but should be a bunkroom.  The second floor had some historical objects as well as active NOAA equipment and electronics to run the light and foghorn.  You can't go all the way up into the top light area but you can stick your head into this fairly small space. \n\nThere is plenty of time for pictures and the docents were very good.  They were 4 docents on the tour also to make sure there is always help navigating the difficult areas.  The Captain does a nice slow circle around the light as he leaves so you can get plenty of good pictures.  \n\nI have lived my whole life in Maryland and just found out about this tour last year.  It is pricey but to me it was well worth it and  I highly recommend it to lighthouse fans.",
  "Whilst only accessible by water it is worth a trip to see it on it's rock pile.  I have sailed by it for years and also like seeing it as these are phasing out",
  "I have sailed by this many times and everyone always mentions it, but that's about it. it's a standing lighthouse in the Chesapeake Bay that you sail by - everyone knows, but not much to see. Maybe there are tours that take you out to it so you can see but nothing special here.",
  "Took a uslhs.org sponsored boat tour.  It was amazing!!!   It is a must for lighthouse junkies like me.  Highly recommend!!",
  "The Thomas Point Lighthouse is classic Chesapeake Bay and an amazing sight! The lighthouse is best seen by water but can also be seen by the park near by. Worth a visit. ",
  "We enjoyed sailing in Chesapeake Bay for a day and decided we would try to sail south to circle Thomas Point Shoal Lighthouse on before sailing under the Bay Bridge going north. This lighthouse is one of a kind and very much unique in it’s construction. \n\nSeeing the TPSL up close is a worthwhile goal. ",
  "Really stunning at Sunset or Sunrise, a really lovely old school lighthouse photo opportunity, especially by boat if possible... the best way to see it!"
 ]
},{
 "name": "St. Anne's Church",
 "address": "Church Circle",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/1b/c2/8e/st-anne-s-church.jpg",
 "tags": [
  "history",
  "learn",
  "history",
  "tour",
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d207425-Reviews-St_Anne_s_Church-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "The current church building is not the original one built on the spot, but if you have a guide you can learn about the history of the congregation.",
  "Stopped in for a quick visit on the recommendation of someone at the state house.  Beautiful church.  Wonderful feature were the kneelers in each pew.  Each one is individually made.  Very special.  No one around to ask questions, but it was just a quick, worthwhile visit.\n",
  "This is the church in the “Church Circle”. It is small and takes only as long as you want to stay to visit. There was only one other person in here when I visited late afternoon. I’ve certainly seen grander places of worship but you may as well stop in on your way through the downtown. ",
  "Visit, and contemplate in a beautiful church with such history. The door is always open and welcoming.",
  "There are two Tiffany stained glass windows in this church.  It is a place of history, even though this is the third church on the site (the first two burned down).  Francis Scott Key and others worshipped in the churches at this site.  There is no tour as such, but it is well-worth stopping and poking your head in while you are walking in the area."
 ]
},{
 "name": "Jonas Green State Park",
 "address": "1990 Governor Ritchie Highway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/82/56/ec/jonas-green-state-park.jpg",
 "tags": [
  "kids",
  "walk",
  "kids",
  "walk",
  "walking",
  "walk",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d3486412-Reviews-Jonas_Green_State_Park-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a tiny park with barely enough pathway for a short stroll but it is easy to access by bicycle and car. It is right at the base of the bridge across from the Naval Academy with a lovely vista of Annapolis. All the kids fishing there say it's a great location. On weekends there may be a great deal of boat traffic.",
  "So this park is kind of hidden. It is rarely busy. It is located on the Severn River, almost below the Naval Academy bridge. It has ample parking, restrooms and a park ranger station, as well as a 24 hour a day fishing pier. My favorite thing to do is come and just go for a walk or sitting on a bench or the rocks and watch the water. Very relaxing, great for thinking.",
  "This is a tiny park with barely enough pathway for a short stroll but it is easy to access by bicycle and car. It is right at the base of the bridge across from the Naval Academy with a lovely vista of Annapolis. All the kids fishing there say it's a great location. On weekends there may be a great deal of boat traffic.",
  "No longer 24/7 fishing . Drove from Jessup,Md to Annapolis just to see this sign. Fishermen don't waste your time at night",
  "While on the hunt to find a local area to walk (a long the water) we explored Jonas Green. This is a nice little area, clean, but fairly small walking area. There are large rocks, and also a walking trail, but no actual beach area to walk. When we visited it was mostly populated by people who were fishing. Our search continues. ",
  "So this park is kind of hidden. It is rarely busy. It is located on the Severn River, almost below the Naval Academy bridge. It has ample parking, restrooms and a park ranger station, as well as a 24 hour a day fishing pier. My favorite thing to do is come and just go for a walk or sitting on a bench or the rocks and watch the water. Very relaxing, great for thinking.",
  "Terrific place to watch boats and fish.  Clean public bathrooms. Easy to park. Beautiful scenery.  Worth the trip!\n",
  "A unique little park at the end of the Naval Academy bridge.  Fantastic for access to the Severn River.  My favorite place for launching a kayak.  Waves and chop from fetch and powerboats can occasionally be challenging."
 ]
},{
 "name": "Westfield Annapolis Mall",
 "address": "2002 Annapolis Mall",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "walk",
  "food",
  "kids",
  "food",
  "kids",
  "food",
  "walk",
  "food",
  "walking",
  "food",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d6965527-Reviews-Westfield_Annapolis_Mall-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very clean and bright.  Good mix of high-end and mid-range stores with lots of choices.  There were a lot of seats throughout as you walk along the mall, which is great for the older shoppers who need to stop for a quick rest in between shopping.  Parking seems to always be full, so it is sometimes hard to find a close place to enter the mall.",
  "There are a few things about this mall that stand out to me, and the major thing to me is that they have a lot for children. The play area isn't large, but there is an option for childcare which is great if you're really on a shopping mission as children are typically difficult to shop with. The Playseum is wonderful. I also really enjoy the dining cafe to get away from the craziness of the massive food court, which can be hectic with children as well, and also has a little area with bouncy type things for little kids to play on and expend some energy. Aside from the things that cater to children. it is a beautiful mall with tons of natural light, which I love. I've rated it 4 stars rather than 5 because the layout can be a bit confusing, and as another reviewer mentioned, can make you feel trapped. I've never encountered issues with parking, I think it's great and not overcrowded. Overall, a good mall to be with plenty of options, including high end, and a great place to bring children as well.",
  "There are a few things about this mall that stand out to me, and the major thing to me is that they have a lot for children. The play area isn't large, but there is an option for childcare which is great if you're really on a shopping mission as children are typically difficult to shop with. The Playseum is wonderful. I also really enjoy the dining cafe to get away from the craziness of the massive food court, which can be hectic with children as well, and also has a little area with bouncy type things for little kids to play on and expend some energy. Aside from the things that cater to children. it is a beautiful mall with tons of natural light, which I love. I've rated it 4 stars rather than 5 because the layout can be a bit confusing, and as another reviewer mentioned, can make you feel trapped. I've never encountered issues with parking, I think it's great and not overcrowded. Overall, a good mall to be with plenty of options, including high end, and a great place to bring children as well.",
  "I remember when this mall first opened in the early 80's.  I believe at one point it was the largest mall on the east coast.  Just today it was announced that Sears will be closing.  This comes a couple of years after Lord and Taylor closed.  There are also rumors that the Macy's also will close in the next year or so.",
  "My daughter has loved this mall for years. She is grown now, but regardless of occasion when I visit we have to go to this mall. The stores change a lot but we love it. The food court offers variety and the stores are good. Its a good size mall so  you can walk for hours and have a good time. There is a movie theater inside as well so you could easily spend the entire day here.",
  "It is a nice mall but things are spread out so wear comfy walking shoes. Plenty of food. Went on a weekday so the crowds were minimal.",
  "Although, like all malls these days, there are quite a few closed stores there is still plenty of stores with a lot of variety. The mall itself has plenty of parking and it is very clean. Lots of food choices and small shops in the common walk areas which provide a nice variety.",
  "This is a good place to spend some time indoors shopping and eating. The train ride for kids (for a small fee) is a great way for the little ones to get a thrill.  There's a small play area for toddlers but it's usually crowded on weekends and busy times. Overall, the place is clean."
 ]
},{
 "name": "Annapolis Maritime Museum & Park",
 "address": "723 Second St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/97/b9/69/img-20160314-105659-largejpg.jpg",
 "tags": [
  "food",
  "delicious",
  "art",
  "tour",
  "music",
  "free",
  "walk",
  "history",
  "kids",
  "history",
  "food",
  "delicious",
  "art",
  "tour",
  "music",
  "learn",
  "free",
  "history",
  "food",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d584631-Reviews-Annapolis_Maritime_Museum_Park-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whilst staying with friends in Annapolis we came to a live music event here and it was absolutely wonderful. I don't remember the band name but it was Aug 16th 2018. A balmy evening with a cooling breeze from off the water. A food van 'Food For Thought' served delicious food and there was a bar too. We arrived early and had a tour of the art gallery. \nThere are lectures, tours, art gallery. A great community resource and well worth the visit if passing. Especially the music night.",
  "This is a great place to spend an hour exploring the fine exhibits about the crabbing and oyster harvesting on the Chesapeake.  It's free to enter, though donations are appreciated.  The folks there are very friendly and willing to answer your questions.  The building is a former oyster business.  Parking is best on the street as limited in their parking lot.",
  "I  have  been  to  many  maritime  museums.  Since  I  was  in  Annapolis  for  the  day  and  needed  to  kill  some  time,  I  made  my  way  to  this  museum.  It  is  no  where  near  the  size  of  other  maritime  museums,  but  it  is  still  a  great  place  to  see.  The  lady  on  duty  was  very  friendly.  It  is  housed  in  an  old  oyster  house,  and  it  tells  you  about  the  oyster  industry.  There  are  also  a  few  boats  outside.  There  is  even  a  tiny  beach.  It  is  just  a  few  minutes  drive  from  the  bustle  of  downtown,  or  you  can  walk  it.  Parking  is  limited,  but  it  is  worth  the  visit.",
  "This place has beautiful views of the Bay and the Bridge, Plus it is a slice of real-life on the bay & history of the economy of the area. Worth stopping in.",
  "This a small but effective museum of Annapolis maritime history.  Great for kids and families.  Will be renovated Dec 2019 to January 2020 for improvements.",
  "Whilst staying with friends in Annapolis we came to a live music event here and it was absolutely wonderful. I don't remember the band name but it was Aug 16th 2018. A balmy evening with a cooling breeze from off the water. A food van 'Food For Thought' served delicious food and there was a bar too. We arrived early and had a tour of the art gallery. \nThere are lectures, tours, art gallery. A great community resource and well worth the visit if passing. Especially the music night.",
  "Stopped by this former oyster shucking company to learn more about the history of the area.  One side had exhibits about the ecology and economics of the oyster industry and the other had boats and implements used in the trade.  Probably took all of 20 - 30 minutes to read all the info and look at the exhibits but we also walked around the piers and looked at additional info posted there.  I won't feel compelled to visit there again, but it was educational as well as free!",
  "Unfortunately, web-based info stated the museum was open on this cold Tuesday. But.. it was not. What we did experience walking about on a cold January day was quite nice. There are docks with educational material, and quite a few mallards, that extend out into the water. The view is quite stunning. There are additional displays shoreside that provide a progressive timeline of developments on the bay. As one might surmise much of the info is about the once massive oyster production of the bay. There are a number of displays about the working boats, and several boats on display.\nParking can be a bit challenging, with multiple spots on gravel behind the main building and the always daunting street parking of Eastport. MAke sure to go on a day other than Monday or Tuesday (closed), then head over to Davis' Pub for food and refreshments!"
 ]
},{
 "name": "St. John's College",
 "address": "60 College Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/38/0f/3b/st-john-s-college.jpg",
 "tags": [
  "kids",
  "walk",
  "library",
  "walking",
  "history",
  "historic",
  "free",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d219067-Reviews-St_John_s_College-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "St. John's College traces its origins to King William's School, founded in 1696. In 1784, Maryland chartered St. John's College, which absorbed King William's School when it opened 1785. The third-oldest college in the nation, the Annapolis campus of St. John’s College is one of two campuses dedicated to a traditional liberal arts education. Francis Key Scott, a lawyer and writer of the star spangled banner, is an alumni of the college.",
  "Very interesting college but I’m glad we went in.  Wandered around on a Saturday night at around 11/11:30. Kids were all going to a dance and drinking outside on tables. There are apparently a lot of ghost activity around that area. Wonder if the college kids actually see it. ",
  "Once known as The King William’s School, it was founded in the Maryland colony’s “free” school in 1696, making ith the 3rd oldest college in the US.  It became St. John’s College in 1794.  Interstingly, four of St. John's founders were signers of the Declaration of Independence.  \n\nThe college's grounds are beautiful and beyond description.  You just need to walk along College Ave. and King George Street to Appreciate them.  Its focus is the liberal arts.  Students, as I understand it, study classic texts and debate them. Interstingly, College's faculty members are termed “tutors,” not professors or teachers.  Maybe, that is because they lead classes, rather than teach.  Apparently, the tutors serve as what the school considers content experts, who \"guide discussion and act as model learners.\"\n\nThe College's buildings and architecture are breathtaking.  The main library is filled with classic European texts.",
  "What a beautiful history college right downtown. Spend some time walking the grounds and relax under the trees. Right in the historic downtown area with lots of parking.",
  "Some of  the oldest buildings in Annapolis. The Great Hall has\nwelcomed Washington, Lafayette, and President Eisenhow. The\nMitchell Art Gallery is free, with great Exhibits."
 ]
},{
 "name": "Hogshead",
 "address": "43 Pinkney St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/2a/4e/75/47-pickney.jpg",
 "tags": [
  "history",
  "knowledgeable",
  "tour",
  "walking",
  "kids",
  "walk",
  "walking",
  "tour",
  "history",
  "kids",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d6739884-Reviews-Hogshead-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "This little house is so cool! It's only open on the weekends, but you can go inside and see how a typical Annapolis house looked like in the colonial era. Whenever I've gone, there was a reenactor dressed up as a fur trader. He was very knowledgeable about history and what it was like to live back in the day. You can touch and handle all of the historical items (cups, dishes, furs, tools, etc.). What a neat place!",
  "Due to my own stupidity, we missed out on the walking tour of Annapolis that we had planned. In walking around, we stumbled on Hogshead. The two guides inside were amazing. They told us fascinating pieces of information about life for the common folk at that time. They explained the origins of some of the expressions we use to this day like \"short end of the stick\". Only open on weekends, this is a must for any visitor to Annapolis.",
  "This is definitely a super cute, quaint road to walk down. Beware that cars do drive down the road, so be sure to stay on the sidewalks. The little museum is very minimal and best for folks with younger kids or for those who have little knowledge of colonial times. If you're walking around, it's worth walking down this street.",
  "If you're not fully into history then it can sometimes be a very dry subject that is difficult to warm to. You won't have any such problems with this tour as you become a spectator as two local actors in period costume tell you about how life was back in the 18th century with a bit of humour and good old audience participation thrown in for good measure!",
  "Pre-Revolutionary War? Give or take a few years.... Quaint, old part of town , a good photo op, near all the downtown touristy places and can take in a bit of history.  Great for kids.",
  "What a great place to walk and take photos right downtown. The buildings take one back in time. Easy to find and lots of parking close by. Some fascinating history here.",
  "You have to go to see one. You may be surprised! The docent staff is well trained and entertaining. The place is simple and stoic. As it should be. This is a Revolutionary war era (give or take a few years either way) home in Annapolis, the one time Capital of the early USA. The home (limited tourist hours) portrays the working class life style and demonstrates some of the craftsmen's and ladies tools and techniques. Hands-on for children.  Max 1 hour visit will do it. No fee. Donations welcome. Then move on to State House or Paca House to elevate to the gentry lifestyle and a bit of George Washington.\n L.Shubnell",
  "This is so amazing to see - just feels like you are set back in a different place in time.  Love the colors and the upkeep of the buildings."
 ]
},{
 "name": "Thomas Point Park",
 "address": "3890 Thomas Point Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/4d/0e/c4/the-park.jpg",
 "tags": [
  "walk",
  "walking",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d7810866-Reviews-Thomas_Point_Park-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went for a visit to Annapolis and thought of visiting this Park.\nYou need to get a day pass for $6 to enter the park from the Quiet Water Park. \nThis park is not very big but provides great views. You can drive to the end point of the park and park there and enjoy the views. With a fishing permit from the Quiet Waters Park you also do fishing here.\nThere are only portable toilets available and no shops or anything.\nThe views were really great and we enjoyed our time here.",
  "You need a parking pass if you want to take your car.  If not, you can park one block away and the round-trip walk is about 2.5 miles.  The park is small, but gives great views of the Bay Bridge and Thomas Point Lighthouse.  You can see locals fishing and Ospreys hurting for fish.  A great place to blow away the cobwebs!!",
  "Thomas Point Park is a true hidden gem. It has wonder views and a nice walking trail. Warning - the parking can be very difficult during peak times. ",
  "A rare quiet beach open to public if you can stand the wind. Open and beautiful bay view. Thank you for keeping at least a tiny little corner of the coast accessible to the public!",
  "Thomas Point Park is a true hidden gem. It has wonder views and a nice walking trail. Warning - the parking can be very difficult during peak times. ",
  "somewhat  unknown local park in the Annapolis area. from which you can have scenic view of Hillsmere Shores Community Beach, Arundel on the Bay, Kents islands Chesapeake Bay Bridge, and Annapolis City. The place is famous for the fishing and one can spent a good day out, provided the place is the open. The park is not open for the public for most of the time, but we were lucky enough to see this beautiful point. You may need to permit to enter the park. From the shore, you're able to view the Thomas Point Lighthouse but not very clearly. The surrounding area is full of different magnificent mansions. \n",
  "My wife and I, along with our two toddler daughters traversed here via SUV. Once we arrived, we discovered that you have to get a special permit at some other location just to park near an old cabin next to the 2nd gate. There is NO Parking anywhere. There are signs that indicates that it is permit parking only and that it’s regularly patrolled in big red letters and threaten to tow your vehicle. Very small place, with a plethora of picky directions at the first entrance gate stating to close the the gate after entry and exiting. Just a total WASTE OF TIME! \n\nWe just turned around and left. Don’t waste your precious time with the hassle of this small uneventful little wanna be park! ",
  "We've been going to this park for years (it's a short walk from my in-laws).  This is great park for a walk, job or maybe fishing.  There are areas for picnics but the grills are a bit nasty and there is just one porta potty so I wouldn't recommend any big events."
 ]
},{
 "name": "Thurgood Marshall Memorial",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/13/30/5f/nice-tribute-beautiful.jpg",
 "tags": [
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d219069-Reviews-Thurgood_Marshall_Memorial-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were in Annapolis over thanksgiving 2019 and the statute has moved ti the court of appeals which you will need to drive too! Street work through the first of the year.",
  "As a lawyer and professor of law, spending time at the Thurgood Marshall Memorial is important. I like the fact that our elected officials must walk by the statute on their way to the a State House.",
  "Right off the state house. Interesting reading on Thurgood Marshall. Well kept area; Enjoyed the surrounding statues with his memorial also.",
  "This is located in front of the Maryland State House. Its a bit out of the way from most foot traffic unless you are visiting the State House. The memorial includes additional statues of children who Thurgood is supposed to be speaking at or teaching. This is a very good memorial and should not be missed. ",
  "This is larger than life and in an area near the government buildings.  Since,we were their on a weekend we had this almost all to ourself.  There are other sculptures that you cannot see in this picture.  I sat down next to two children sculptures at a bench for a photo opt."
 ]
},{
 "name": "Alumni Hall",
 "address": "675 Decatur Rd U.S. Naval Academy",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/ab/8a/54/alumni-hall-on-the-campus.jpg",
 "tags": [
  "food",
  "kids",
  "history",
  "history",
  "history",
  "kids",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d8821976-Reviews-Alumni_Hall-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Patriot League is very competitive. Season tickets are very reasonable ($5) and can provide first-rate seats. Army/Navy games are always a sell out. Parking is limited at Academy. You also need  a pass to drive into yard. Navy season ticket holders can get pass. Food limited to hot dogs and pizza.",
  "What a great venue. Not inly is the history of the place cool but watching a sporting event here is fun.  Top notch sports and great site lines.  Navy always does a great job of making it fun for fans and the kids.    ",
  "Alumni Hall is an intimate basketball arena that's great tho watch a game in. My wife and I traveled here to watch Marquette and Vanderbilt in the Veteran's Classic. We were in the upper deck, but it was no problem as Alumni Hall has great seats up to the rafters. Plentiful concession stands and options, tons of exhibits and history, Alumni Hall has it all. Superb arena.",
  "Walked in before a Patriot League game later in the afternoon.  Saw the Navy team practicing.  Super sight lines all around.  Interesting history all around.  Wonderful views of the court from each side and above.  I will most definitely come back for a game.  Small, intimate venue offering a fun atmosphere.  Highly recommend!",
  "Went for closing ceremonies for Summer Seminar and was very impressed with the facility! Clean, modern and huge!",
  "Did a great job hosting Parents Weekends event.  Key to hosting a successful event is keeping up with the mobs.  Bathrooms stayed clean, trash did not overflow, A/C worked.  Thanks",
  "What a great venue. Not inly is the history of the place cool but watching a sporting event here is fun.  Top notch sports and great site lines.  Navy always does a great job of making it fun for fans and the kids.    ",
  "This is the public sports facility for the Naval Academy.  Like many things at the Academy, no tax dollars were used in it's design or construction.  All funding came from past graduates of that institution, which is even more amazing when one considers that, until about 10 years ago, the place only graduated about 900 people a year!"
 ]
},{
 "name": "The Colonial Players",
 "address": "108 East St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/a0/0f/82/the-colonial-players.jpg",
 "tags": [
  "walk",
  "free",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d3703462-Reviews-The_Colonial_Players-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wonderful local theater in Annapolis.  Non-profit, mostly volunteer, who produce plays that you don't see in the larger theaters.  Intimate in-the-round seating.  Acting and direction has always been high quality.  Don't always love the plays, but don't want to miss any - some are real gems.",
  "We Attended an presentation of Shakespeare’s Merry Wives of Windsor in this “theater in the round” where you’re only, at most, 3 rows from the action on stage.\n\nThe 3 rows of audience seating meant everyone had an exceptional view of the action. And the seats were staggered so it was easy to see even if there was someone tall in front. Although called “theater in the round” or was actually rectangular as you can tell by the very good seating diagram on their web site.\n\nThis interpretation was interesting - Shakespearean speech from the mouths of people in modern dress. It was a bit disconcerting at first, but was less distracting after about 10-15 minutes. The acting was very good, the use of minimal props made the play viewable from all directions and the cast made excellent use of floor space, to include the aisle in the the audience. It was a jolly good show!!\n\nNice lobby, friendly front of house, a small very reasonably priced snack bar. Street parking if you can find, else several,public (paid or free depending on location and day/time of week) within 5-15 minutes walk. Lots of walkable restaurants for drinks or a pre/post bite.",
  "We really enjoyed Saturday's performance of \"The Merry Wives of Windsor\"  What a great community theater with intimate seating.",
  "We recently enjoyed the play Lucky Stiff.  It was well done and very funny with twists and turns throughout the play.",
  "Colonial Players is a wonderful theater. Great productions and I love the design of the theater. I recommend it.\n"
 ]
},{
 "name": "Annapolis Shakespeare Company - The Classical Theatre of Maryland",
 "address": "1804 West St Suite 200",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/d9/5c/c1/annapolis-shakespeare.jpg",
 "tags": [
  "performance",
  "theatre",
  "theatre",
  "free",
  "drink",
  "performance",
  "music",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d9858108-Reviews-Annapolis_Shakespeare_Company_The_Classical_Theatre_of_Maryland-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have never been disappointed by the productions at this theatre.  Our daughter, her husband and their two teenage children accompanied us to a production of Christmas Carol.  They thoroughly enjoyed the production which was in the small theatre.  We sat on the front row, only a few feet away from the actors.  It was a meticulous performance with use of audio visual effects to help set the scenes.  Highly recommended for a night of good entertainment.  Typical prices are $50 each.",
  "My husband and I went to the showing of Oliver last night and what an enjoyable show!  Broadway quality on a much more intimate scale.  It's a shame they don't have a larger advertising campaign, because I think there are a lot of folks in the area that have no idea this theater is here.  I haven't been to any other shows there, but I highly recommend this one.",
  "We watched a pre-Christmas production of A Christmas Carol.  The auditorium has a small stage with the seating close in on 3 of the 4 sides.  It was very personal for the audience to be so close to the actors.  The production was very good. It kept my two young sons captivated throughout.  \n\nThe break included a lovely hot chocolate from the bar. \n\nThe theatre is easy to get to, being just off the main highway and had ample free parking.  \n\nOverall a great start to the Christmas holiday season.  ",
  "   My husband and I went here on our daughter’s recommendation, we were not disappointed.  We went to the indoor West St. location (summertime offers outdoor locations elsewhere downtown).  They have a cocktail lounge setting while you wait for the show, you can take your drink in with you.  When it’s showtime, you are escorted into the theater.  The venue is small so no bad seats!  \n    The actors, costumes, set were all top notch!  Very impressed!  Check out the Period Cabaret shows as well as holiday productions.",
  "Always enjoyable. Annapolis Shakespeare Company is a beautiful little blackbox venue, is the only contemporary (and comfortable) performance theater in town, and they have a full bar with piano and cabaret seating that is open before productions. They also offer Cabaret music in addition to their drama productions. During warm weather they will often host productions outside on historic sites.  They are a paid professional theater. If you are in town, try to get a ticket to whatever is showing."
 ]
},{
 "name": "Port Annapolis Marina",
 "address": "7074 Bembe Beach Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/7e/57/60/photo0jpg.jpg",
 "tags": [
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29494-d10754391-Reviews-Port_Annapolis_Marina-Annapolis_Maryland.html",
 "source": "TripAdvisor",
 "reviews": [
  "Recommend seafood delicacies. Crab is cooked to perfection. Naval Academy annual air show is a site to see.",
  "This is a great place for boat lovers. I love to watch the boats and all the activities going on in the marina. Power boats and beautiful sailboats everywhere. One of the boating capitols of the east coast.",
  "What a serene place. We lucked out. The day was beautiful, the water was calm, and all was peaceful. \n\nWonderful visit. ",
  "I worked on two different boats over the course of a winter here. The staff was always friendly and courteous, not to mention professional. As the weather warmed up it was nice to use their picnic area for lunch breaks. From all the other people that we saw working there and storing their boats, this seemed to be the general consensus. For winter haul out work I would recommend these guys or Jabins.",
  "This is a wonderful marina for a quick weekend getaway.  The pool is very nice and offers several umbrella tables, along with 2 canvas cabanas for shade.  There is a cafe onsite which offers breakfast, lunch and dinner, along with drinks and snacks.  This is very convenient if you didn't bring food on the boat and/or don't want to go into town.  They advertise a shuttle service, but that was not available either time we went.  It is too far to walk and biking along the route into town is dangerous since the sidewalks are very narrow.  If the shuttle was available, I would have rated this with 5 stars.  Boaters would really appreciate this convenience!!!    NOTE: The water taxi does run here but is very expensive.  $15 per trip if only 2 people (each way), or $5,50 per person if more then 3 people ride."
 ]
}]
