[
{
 "name": "Atlanta Botanical Garden",
 "address": "1345 Piedmont Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/73/8b/d6/photo0jpg.jpg",
 "tags": [
  "kids",
  "family",
  "walking",
  "nature",
  "walk",
  "walk",
  "walking",
  "walk",
  "free",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d104713-Reviews-Atlanta_Botanical_Garden-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is my favorite place in Atlanta. We go at least once a month spending a few hours there each time. With rotating exhibits and the constant change of the plants the place is magical, all year long. The many features/shows of the garden just enhance the gardens themselves;  concerts in the green, the Garden holiday lights, the scarecrows, spring in all of its glory and wonderful sculptures (botanical, glass, stone). Oh yes and one of the most amazing collections of orchids you will ever see, as well as unbelievable indoor and out door gardens.   \nMary Pat Matheson has made this garden into one of the top botanical gardens in the country and it never stops growing (small pun). \nMy wife and I have maintained our family membership for over 15 years. It is our escape our joy and one of the best things we do together. \nThe garden is expansive, great for kids (and grand kids) and wonderful for adults of all ages. Romantic, educational, beautiful and full of warmth. The staff is attentive and maintain a perfect environment. The paths through the garden give incredible views that change constantly. \nThe gardens sit in the middle of midtown with great views of the city and of Piedmont Park, it has ample parking and easy access. You will not regret a moment you spend here.\nDid I mention, you have to see this place, visitors and residents alike, it is a must see.",
  "Spectacular variety of plants and trees, beautiful walking trails including a tree-canopy walk and waterscapes, incredible topiary-like creations of mythical creatures. A great way to spend a leisurely half-day in nature.",
  "In the heart of Atlanta a peaceful oasis exists with winding trails and a treetop vista. Easy parking, great restaurant and something to see for everyone - Orchids, rain forest, children's garden, pond with \"living\" statue, edible garden, blooms and flowing trees - Magnificent!",
  "Visit the ABG  while the Orchid exhibit is going on.  There are hundreds of blooming orchids - all sizes and colors.  A wonderful introduction to the Easter and Spring season.  Go early in the day as crowds on the weekend can be rather large.",
  "It is a popular attraction over the holidays so make certain that you plan early.  The holiday lights at the Botanical garden are magical.",
  "Wow. Best botanical garden I have ever visited. Volunteer docents were helpful and obviously love what they do. There were few people in the gardens due to earlier rain and the docents walked with us and explained about the various plants.  Great variety with a canopy walk over parts of the park, large topiaries, Japanese garden, orchid garden, high altitude garden, tropical garden, edible garden etc etc. it was all fascinating and well displayed. They also have interesting frog display. Time it to watch the feelings if you can. Don't miss the gift shop with great and unusual items. Only disappointment was that we were a few days too early for the huge Munro light exhibit which starts this weekend ",
  "After seeing all the pictures and reviews, I was super excited to visit. Obviously, no one has gone in the dead of winter after it's been below freezing in January! They were tearing down the Holiday exhibits, the orchid exhibit was being set up, and there was little greenery other than in the greenhouses. \nThe famous lady in all the pics was brown and black. Not quite what we expected. \nBut, I learned how broccoli is grown, and my friend and I still enjoyed walking around the grounds and talking. But after paying full admission prices, it was a little  disappointing. Best part was the gift shop with all the 50% discounts on holiday gifts.",
  "I live in Dallas and love going to the Dallas Arboretum. I think the Atlanta Botanical Gardens are similar, but slightly smaller. What stands above the crowd for me are the formed statues filled with dirt. There are the mermaid, phoenix and Alice-in-wonderland statues. They plant color coordinated grass, flowers and plants to bring them to life. Unfortunately, we were there in the first weeks of March when they were planting everything. In a month and through the summer and fall, they will be gorgeous.\n\nMost of the place was not in bloom, so it was a quick walk. The orchid facility was outstanding and worth a visit all by itself. Don't miss it. The suspended bridge over the forest canopy is a cool walk. Don't forget to find the three resident Chihuly glass sculptures.\n\nWe spent about 1 1/2 hours here and saw all there was to see. It might have taken 3-4 hours if everything was in bloom. Put this on your list of places to visit.",
  "There is always something popping out to see here. We saw the Orchids and they were stunning. Always worth a trip.",
  "I am a member of the botanical garden where I live--that allowed me to get into this space for free! I loved my time. My favorite part was the Orchid display. Parking was easy and I went on the perfect sunny spring day! My only complaint is that there isn't really a clear path through the garden or through the greenhouse--so you have to be strategic when looking at a map and planning your trip. I also ate lunch at the restaurant there which was really tasty! Good service too!",
  "Spend some time in this place , quiet , close to nature , in the middle of the city, thier collection and the way is designed , make you relax and enjoy evrey minute of it. People very friend can help you in all areas."
 ]
},{
 "name": "Georgia Aquarium",
 "address": "225 Baker St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/57/27/19/20180422-140256-largejpg.jpg",
 "tags": [
  "kids",
  "family",
  "tour",
  "free",
  "learn",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d588792-Reviews-Georgia_Aquarium-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Ok, so first off you should know, if you come here you are gonna spend some money. Tickets are expensive, food/drinks are expensive, and then if you got the kids with you, stuffed animals are gonna cost you. BUT...\n\nIt's totally worth it. We had a blast. We spent probably around 4 hours and I have almost exclusively positive things to say about this place.\n\nSome of the highlights for my family: we all loved the big tank with the whale shark and manta rays, the dolphin show was INCREDIBLE (definitely spring for the reserved seats!), beluga whales were awesome, and there were just enough interactive exhibits to keep our 2yo and 5yo happy and excited during the stay.\n\nThe only drawback for us really was the growing crowd. It was hard to get around at times with the stroller and with a hyper 2yo who wants to run around it got a bit difficult. Finding a table during lunch was a little hard, but I mean, it's busy because it's awesome. It's worth the hassle.\n\nThe place is brightly lit, it's easy to find everything, and all the employees when interacted with were friendly and helpful. Highly recommend!",
  "OK, it costs a little more than I was expecting (about $70 for two), but it was so worth it!!! We spent about 4 hours there. Saw dolphin and sea lion shows, and spent time in all the galleries. Favourites were the fantastic tropical coral reef (Huge and 30 feet deep!) and the ocean tank, the largest in the building and with an amazing assortment of sea life including whale sharks, various types of rays, GIANT groupers, and so much more! And the coral reef was so beautiful! Reminded me of some of the wall dives I've made -- so many multicoloured fish and types of coral.Love that we got to actually \"pet\" an anemone and star fish and sea urchins. Loved the special jellies exhibit (they're not fish! related to anemonies and corals -- not fish!). It was all SUPER!!! Also loved the small kelp forrest tank, with its tall kelp and bright orange garibaldies. Enjoyed watching the beluga whales where a randy male was after the females. Not so different from the human world after all....",
  "We wanted to give our son an awesome 21st birthday experience and since we couldn't leave the country because of the total solar eclipse on his birthday, I thought this would be a cool compromise for the day before.  From his reactions to the dive, I don't think we could have done better taking him anywhere else.  The Whale Shark Dive is about $350, however, it does include one's entrance into the aquarium, a tour of the behind the scenes at the tank/aquarium, a free t-shirt, and an absolutely amazing experience.  Additionally, if you are a member of their party and relegated to the land, you will be taken on a limited behind the scenes tour too!  If one in your party is doing this and you need to find a way to save money elsewhere, reduced general admission tickets can be purchased at AAA that allow you to arrive any time on any day in, I believe, a 6-month period from purchase.  If your diver is interested, there is also the opportunity to purchase a PADI specialty dive card of either a Whale Shark Dive or a Manta Ray Dive for an additional fee of about $70.  Before booking the dive, I received some information from another TripAdvisor member, however, I'd like to relay more to any one else considering doing this.  First of all, you need to be at the desk under the giant Whale Shark (you'll know exactly where this is when you get there/hard to miss) 30 minutes before your scheduled time and 45 minutes earlier if getting a PADI specialty dive card (more paperwork to fill out).  Although each SCUBA diver (yes, each diver must be certified of at least open water) is assigned a buddy, there are also at least 2 Dive Masters with the group and the videographer.  My son's a tech diver, ie:  sidemount twin steel tanks, DIN, and no weights; and I was concerned he'd have problems going to a back-mount aluminum tank, a regular BCD, Yoke valves, and weights since he had only dove this way once many years ago.  The staff, however, was very helpful and had his equipment sized and set up to go for him--true concierge diving!  Additionally, there is a weight limit for this experience, 310 pounds, just for one's information.  Since you're bringing a bag with your swimsuit and possibly your dive mask--this can be left at the nearby information desk to be put in a locker hours prior to your dive time for no fee--just tell them you're doing the shark dive.  After the diver checks in, the landlubbers will be asked to return in about 45 minutes to see the divers.  When we did, we were taken to the glass tube running the width of this aquarium for seeing and taking pictures of the divers.  We got some awesome shots of our son and then we were taken to the large viewing room to take even more pictures!  It was almost as much fun for us as it was for them!  When the divers were to head out, we were again taken to the tube for more goodbyes and pictures.  Afterwards, we were taken on an abbreviated behind-the-scenes tour of the whale shark tank as we waited for our divers to shower and change clothes.  We were then invited into the briefing room to see the video taken which is offered for sale at $50--a real nicely produced film for the price!  Over the years our son has done a lot of behind the scenes activities, including the Shark Dive at Sea World, swimming with the Dolphins at Discovery Cove, and the Sunrise Safari at Animal Kingdom Park just to name a few, however, he said he enjoyed this event the best.  Diving with the four Whale Sharks (the largest is 23 feet long!), the many Manta Rays, and all the other fish was a great experience!",
  "We had been to many aquariums before but heard this one is a “must do”., and we were not disappointed.  So much to see exploring the museum! The sea lion show was entertaining and informative. ",
  "We really enjoyed coming here. We went to sea lion show, which was put together very well. We enjoyed exploring the different parts of the aquarium. ",
  "The Atlanta Aquarium, probably one of the largest in the world, is well worth your visit.  Take your time, though, and allocate some four hours or more to walk through.  There is much to see, and much to learn, but a leisurely pace is best.",
  "We visited in the afternoon, after 4pm when the tickets are $26.95 [as of early 2020] which is $6 cheaper per person than standard ticket price. Although it was quite late the aquarium was still full of people and there was a bit of a queue just to get past security! I had heard that the attraction is one of the largest aquariums in the world however I think that this knowledge meant my expectations were too high as I did not think it was that big. It wasn't difficult to cover most the areas inside the attraction in a relatively short time. Nevertheless, the exhibits were good, the tanks all appeared to be clean and well maintained, and the supplementary information was good; not too much but not too little. I liked how the areas were themed by habitat as this made the layout easier to understand and thus navigate. We watched both the sea lion show and the dolphin show, again, despite both shows being rammed, they were still good. I was quite amazed that they could provide a proper dolphin show inside the venue as I have only ever witnessed these types of shows in outdoor settings. Certainly, this is a fantastic place to bring children, but even older generations would enjoy it, the fact that there is a cafeteria means you could spend all day here if you wished, however, for myself and my partner, we covered everything in about 3 hours and left towards closing time.",
  "Great place to visit. We had wonderful experience. Definetly take part in Behind the Seas tour. Its worth the 5 dollars."
 ]
},{
 "name": "Martin Luther King Jr. National Historic Site",
 "address": "450 Auburn Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/b8/c0/fe/mlk-birth-home.jpg",
 "tags": [
  "tour",
  "historic",
  "free",
  "walking",
  "learn",
  "historic",
  "walk",
  "free",
  "practical",
  "history",
  "tour",
  "free",
  "walk",
  "walking",
  "tour",
  "tour",
  "free",
  "walk",
  "history",
  "tour",
  "historic",
  "walk",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d103496-Reviews-Martin_Luther_King_Jr_National_Historic_Site-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Extremely well done and all free!  Including parking and guided tour of the original Dr King's childhood home.  Most of the sites are self-lead, but the park rangers are around to help answer any questions you have.  It's all well done, inspiring and challenging.  Bring your children!!  The sites include a visitor center, international peace rose garden, the historic Ebenezer Baptist Church that Dr King was pastor at, an eternal flame and the resting place of Dr King and his wife Corretta King, AFD #6 fire station, and his original childhood home.  There really is no excuse to not visit!  It's a must see!",
  "The historic site spans several points within close walking distance to each other ( visitor centre, BEHOLD monument, \" I Have A Dream\" World Peace Rose Garden, Birth Home, Fires Station No. 6, Historic Ebenezer Baptist Church, and The King Centre).\n\nIt will take a few hours to walk and read through all the signs and watch the videos across the sites. It is worthwhile to spend those few hours though since it is a great reflective space to learn about Dr King, Mrs King and the legacies they leave.",
  "I am not sure why the Martin Luther King Jr. National Site is not listed higher on the Trip Advisor things to do in Atlanta because not only is it extremely well presented and informative it is also free. it includes a small museum, entrance to the Baptist church, the reflecting pool and grave of Martin Luther and his wife an old fire station in which a 1920's fire truck is located and Martin Luther kings birthplace. Parking is plentiful and free as well. I spent three hours at a relaxed pace there.",
  "Awe inspiring - to see his tomb and gear/read his story is so powerful. \nOn a practical Note, there are no cafe or toilet facilities so bring your own water if it's hot when you visit ",
  "Martin Luther King Jr. is perhaps one of the most influential characters in American history and plays a role that significantly shapes modern American society, so I think it's tough to ignore this pivotal site that is dedicated to the man when you are in Atlanta! Now a National Park, this area includes not only where MLK was raised but also where he first preached and ultimately laid to rest.\n\nBefore you pay your respect to the tomb of the civil rights leader, go to the Visitor Center first and make an on-site reservation to tour MLK's birth home. Whenever you like, take a look at the well-documented one-room exhibit that organizes into important stages of MLK's life and his fight for freedom. Take a short walk, you will find Ebenezer Church - where MLK and his father preached, the tomb of Mr. and Mrs. MLK in the midst of the reflecting pool, Fire Station No. 6 where it was the only volunteer opportunity for local African Americans then, and finally the rows of restored houses - one of which is where MLK was born and raised.\n\nEverything here can easily take more than an hour, if not a half day. Even if you are not interested in civil rights movement or history, I still think this is a must-go destination from a tourist prospective because it's hard to miss the opportunity to behold such a historically significant figure at where he resided. Go early though especially if you go on a weekend and intend to see MLK birth home, because this place is extremely popular - and it's free!\n\nI believe through this, you will be able to appreciate even more the freedom that we now enjoy thanks to this man's sacrifice.",
  "First of all, try to arrive early to get parking because this place is popular, especially on Sundays when church is in session.  There are a lot more visitors to this site than I would have ever expected.  Also, bring walking shoes and umbrella (if rain is in the forecast) because this site is located over a few blocks.  There's the visitor center, the Ebenezer Baptist church, the memorial wall and fountain and eternal flame, the fire station and the birthplace house.  Also, get there early to get tickets to tour the house.  When we arrived around 10am on Easter Sunday, the next available tour times weren't until 4:30pm.  It's busy! ",
  "There is plenty to see within the MLK Jr. National Site area. Other than the birthplace which is well maintained and fascinating to visit, there was also the Ebenezer Baptist Church which is right by the Visitor Center, the Visitor Center of course, and the International Civil Rights Walk of Fame along with a Gandhi Statue, among other places. All of the aforementioned are free to observe, and you can enter the birthplace I understand, but only on a tour. The Visitor Center provided loads of information and even has a film that plays repeatedly throughout the day. All locations were clean and safe and it was easy to move from one to another. If you're in Atlanta then I would definitely suggest a visit.",
  "To follow the path of the Social Liberties in the US you must visit this site. History, memorabilia, recordings of Dr. Kings speaches and all what compromises the civil rights are here. Visitor's Center, Ebenezer Church, Hall of Freedom, The eternal flame, Dr. King's and Correta's Scott King's tombs, the Auburn Firehouse and Dr. King's birthplace house are a mus in your visit. ",
  "Our visit included the Ebenezer Baptist Church (across the street from the Visitor Center), the Visitor Center, the burial place, and the birthplace.  You are unable to enter the birthplace without a scheduled tour, so if you want to do that, book ahead.  The Visitor Center was full of interesting information and takes some time to go through it all and absorb the information.  The Ebenezer Baptist Church was moving.  There is information downstairs in the church, and you can visit the sanctuary.   I got emotional just standing outside the church itself.   Definitely worth a visit when you are in Atlanta.  (As a side note, you can walk to the Jackson Street bridge from this location to take in that view before or after you tour the facilities associated with the National Historic Site.)",
  "The entire Auburn Street historical area has an aura of intense history and gravity. We enjoyed visiting and being immersed in Reverend Martin Luther King’s memory. ",
  "This is such a must-see in Atlanta. First of all, there is no entrance fee and it is open everyday except for Thanksgiving and Christmas. It is a self-guided tour that you can do at your own pace. We started out at the visiting center. One of my favorite exhibits was Coretta Scott King’s granddaughter describing her grandma. So endearing and loving. Beautiful artifacts and of course the amazing speeches of Dr. Martin Luther King. From there, we went to the Ebenezer Baptist Church, and then to Freedom Hall, and walked to the King Birth Home. We were only able to look at the house from the outside, because the home tour was sold out. You probably can get tickets online, prior to your visit. "
 ]
},{
 "name": "National Center for Civil and Human Rights",
 "address": "100 Ivan Allen Jr Blvd NW",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/5f/da/b7/the-center-just-after.jpg",
 "tags": [
  "library",
  "historic",
  "free",
  "history",
  "history",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d6781793-Reviews-National_Center_for_Civil_and_Human_Rights-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our visit to the National Center for Human and Civil rights near Centennial Olympic Park completed our trifecta of civil rights themed museum visits during our one full day visit to Atlanta. (This was our second visit to Atlanta and our first without our children.) It proved a valuble complement to what we learned and experienced at the Jimmy Carter Presidential Library and Museum, and the Martin Luther King Jr. Historic Site.\n\nAdmission to the center was more than the free for the MLK Jr. Historic site and the $8/adult for  the presidential library. Nonetheless, it provides a powerful experience and the lunch counter simulation itself was worth more than the price of admission. Caution, this latter is not for the very young as cautioned by the posted signage. The simulation includes a reproduction of a lunch counter at which protesters would sit. The participant takes a stool and puts on a headset, places hands palms down on the counter, and closes their eyes. The sounds and jolting movement of the stool over about a minute and a half provide the merest taste of what young protesters must have endured. I emerged deeply affected, both marveling at the courage of the protesters and angry at the need.\n\nMost of the museum exhibits are well executed and interactive. Right from first exhibit hall is \"Rolls Down Like Water\", it houses the lunch counter but starts with Atlanta of the 50's, with interactive features such as the sign board upon which users choose the jurisdiction from which to display Jim Crow laws. The exhibit moves forward through time with displays covering the bus boycott, the freedom riders, notorious figures such as Bull Connor, and continuing through the assassination of Martin Luther King Jr.\n\nThe museum isn't exclusively about the American Civil Rights movement. The \"Spark of Conviction\" on the 3rd floor houses a series of interactive mirrors that users can approach and select from a number of real individuals from around the world to hear their story. The objective is to allow an individual to choose someone that is like them in some way. Other exhibits work similarly and provide multi-sensory ways to interact and convey more than just facts about the struggle for civil and human rights. \n\nWe spent more than two hours going through the museum. I feel better educated but also with a desire to return after doing more personal research and being better prepared to comprehend the material.",
  "Beautiful museum in downtown Atlanta, near the Aquarium and World of Coke.  The museum's main focus is the American Civil Rights Movement from the mid-1950s to the late 1960s, mostly in the South.  It uses films, artifacts, and multimedia displays to tell the stories of school desegregation, lunch counter sit-ins, Freedom Riders and integration of interstate transportation, the marches from Selma to Montgomery for voting rights, the Alabama church bombing, the March on Washington, Dr. King's assassination, and several other events.  It was hard not to have a heavy heart making it through the museum.  Overall, the visit was somber but educational.  My feelings in going through the exhibit were similar to my feelings while at the US Holocaust Memorial Museum and the Hiroshima Peace Memorial Museum -- all three are moving experiences.     \n\nA simulation of a lunch counter sit-in uses headphones while you sit at a lunch counter and the counter and stool feel like they are shaking.  Even knowing that nothing real will happen, sitting for just two minutes is terrifying.  Days after visiting the museum, the experience is still haunting.\n\nThe museum is modest in size but packs both considerable information and an emotional punch.  The focus stays mainly on the 1950s and 1960s.  The museum does not have much information on what preceded this era -- e.g., the promise but failure of the post-Civil War Constitutional Amendments to bring about equal protection under the law.  Nor does it have much on the success (or lack thereof) of subsequent legislation at addressing inequities in civil rights.  Also, the focus is almost entirely on the southern states (mainly events in Georgia, Alabama, and Mississippi) without the broader context of other regions of the country.  Of course, no single museum can have every aspect of history and curatorial choices must be made.  I found the exhibits to be impressively well done on a part of US history that is critical to understanding the country.\n\nIn addition, the museum has a floor on international human rights issues -- both historical and contemporary.  While interesting and informative, I found this exhibit less  powerful than the American Civil Rights Movement exhibit.",
  "This was a worthwhile museum which examined America's checkered history of race relations, Jim Crow, the life of MLK, and a vivid reminder of human rights in our everyday lives. The must do exhibit which will leave an indelible impression is the Woolworth counter. ",
  "LOVED my visit to this museum. I have been to many different tourist locations in ATL over the years and the National Center for Civil & Human Rights is by far the most impactful. I am thankful I was able to stop by while on a work trip last month. This might not be the best for children who cannot read--there is a lot of reading. But, I attended on a day when many school children were also there, and I saw firsthand that it was important for them to be there and for them to learn about these issues.",
  "This is intense I would not end a day with this because it’s a heavy hitter. The museum is pretty intense and very informative. The beginning and middle is hard to get through and not get emotional. The end tho has a few parts that are cool but there are some things I don’t exactly agree with some of the thoughts they had towards policies and things like that. I don’t want to make this political but yea. Regardless 3/4ths of this museum was incredible and I walked away from this with a greater appreciation of how far we have come from 50 years ago up to now.  And how important that we as people must consider to fight for reconciliation amongst different people! Great experience! ",
  "This place was amazing. Although  I was familiar with a lot of the events that went on during the Civil Rights Movement, I was not too familiar with some of the Human and Women Rights events. I saw all races of people in this museum. I would recommend you sit at the lunch counter. You will really feel like you were there protesting, it was so real. This place was amazing and I'm happy it's there.",
  "Nice place with a lot of history!  Very informative building with information about civil rights.  Original tv coverage of all things to do with the civil rights.",
  "There are so many and moving exhibits in this museum that I haven't seen anywhere else.  Don't miss the lunch counter experience.  You may have to wait in line.  I felt like my limited knowledge of the Civil Rights Movement was elevated by this museum.  Really appreciated the updated exhibits of current threats to civil rights across the globe.  There is no partinsanship here, just very moving information"
 ]
},{
 "name": "Piedmont Park",
 "address": "1320 Monroe Dr NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/d0/08/30/piedmont-park.jpg",
 "tags": [
  "walking",
  "parks",
  "walking",
  "walking",
  "kids",
  "field",
  "walk",
  "field",
  "parks",
  "active"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d126944-Reviews-Piedmont_Park-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Piedmont Park has something for everyone: great bike paths, walking trails, swimming pools, the Botanical Gardens, dogs parks, restaurants (Park Tavern), and if you're around longer than three days there's sure to be a festival or some other special event.  It's the best!",
  "What a great place to spend a Saturday. Ball fields are full of life, farmers market at the entrance, kites flying, dogs everywhere. Best dog park I’ve ever seen. We loved the walking trail that extends south from the east side of the park. Again, full of life. Walkers, joggers, bikers, skateboarders and rollerbladers. The city revitalized the areas along this trail. You’ll find restaurants, bars, eclectic shops... all dog friendly, of course. ",
  "Very large park with everything from a large dog park, sports fields and swimming, restaurant/bar, lots of green space, and many special events to include outdoor movies.",
  "A nice park space next to the Botanical gardens. Parking around that area can be tricky, just read the signs. The park seems well groomed and maintained. Great for kids, adults, dog walking, bike riding, roller skating. Play areas specifically for kids. Swimming pool for summer. Large areas for frisbee, volleyball, football...etc",
  "Had my engagement photos taken here and there were some amazing shots. Go when it is a bit overcast for the best light. There are great water shots with the city in the background and many places around the part that provides a great photo opp. ",
  "It was amazing how the park went on and on with so many different venues: walking/running paths, large field perfect for flying kites, basketball courts, bocce courts, dog park, soccer and softball fields, sand volleyball, tennis, and if your not into sports or exercise there are lovely areas for quiet moments on a bench or throw down a blanket and just relax in the sun or shade, visit the ducks and geese on the lake or even bring your fishing pole. Come early on Saturday and shop at the farmers market. I can't imagine anyone not finding something about the park to enjoy. ",
  "We've been there during the Coronavirus days... felt sooooo good! Multi shades of Green, variation of the trees, especially huge trees worth seeing.",
  "It was a Caribbean festival being held at the park so it was kind of crowded. I’m interested to see what it looks like on a normal day. ",
  "I was REALLY happy to get out and walk in Piedmont Park.  Except, it was SO CROWDED that we had to really work at staying 6 feet away from anybody!  We couldn't enjoy ourselves with the volume of walkers and runners, so we stayed to the edges of the Park and made it a relatively short visit.  We had so many people to avoid, most without any kind of face covering, that I could not take many photos.  People are so disappointing.",
  "We walked here from near downtown which took a fair while but it wasn't too strenuous. Unfortunately it was winter so the markets weren't operating and the ground wasn't really suitable for lots of sports or activities alike so it felt a bit empty. However, overall the park was certainly one of the nicer city parks we have visited, and it was very picturesque; we sat by the pond for a while and also walked around the large open field near the center (the Active Oval). It was welcome to have such a large green space so close to the city.",
  "This was a really nice park! Has a very Central Park feel! In mid town. It’s also right there connected to the belt line and Ponce city market. My only thing about this park is that it had trash in the open fields everywhere looked kinda bad. "
 ]
},{
 "name": "LEGOLAND Discovery Center",
 "address": "3500 Peachtree Rd NE Ste G1",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/fa/f8/b0/legoland-discovery-center.jpg",
 "tags": [
  "kids",
  "kids",
  "food",
  "kids",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d2433042-Reviews-LEGOLAND_Discovery_Center-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Came here with my two oldest boys, ages 9 and 6. They go crazy for lego stuff and being in a place full of lego activities almost blew their minds. Saw 2 different and excellent 4-D Lego movies, built and raced cars, played in the playground, floated boats down the river, rode the Merlin ride AND took a Master Builder Class with Prof. Rod. Best way to occupy kids for 3 or 4 hours. Worth the ride for sure.",
  "Our children (ages 4 and 8) had so much fun!! My son (4) loved the kingdom quest ride and my daughter (8) loved the LEGO ninjago laser mission! We had so much fun and it was so worth the money! Would recommend!",
  "If your traveling true Atlanta ether North bound or South Bound on  I85 & GA400 and are looking for some entertainment for kids, stop by the LEGO Land Discovery Center at 3500 Peachtree Rd NE G-1. Your Kids will enjoy it if teenagers are in your group they will enjoy a stroll true the mall. Lego land is located on the Malls 3rd floor, there is plenty of activities and great selection in the food court.\n\nStop by and enjoy your kids will love it.",
  "This place is absolutely amazing! We loved going through and seeing all the lifesize lego replicas throughout the building! And the hands on activities with the kids are so much fun! ",
  "Not worth the price as currently maintained. Some attractions do not work, many work partly, some miss parts, etc. If it would be better maintained, then it should be worth to go. This is not quality experience expected from Lego. Sad.",
  "Disappointing that many things weren’t working. At the beginning with so many places saying tap here to start and nothing happens, the laser guns on the ride not functioning, buttons in the LEGO display mostly not working, the water table bone dry with nothing to offer, and no 4D movie. The movie was extremely loud and the only effects were wind blowing and what looked like a few bubbles. All of that being said a toddler didn’t notice and had fun building towers, racing cars, and riding the Merlin ride.  ",
  "I agree with done of the letdown reviews here. This place was good size but overpriced for the condition. The Ninjago area was pretty beat up and things were either partially broken or not functioning. Difficult to build cars in the race track area with not many wheel pieces to choose from. The ride was ok but the laser tag gun wasn't functioning too well. ",
  "Being a Lego fan I was really looking forward to visiting this location with my 6 year old son.  Unfortunately, it was a huge let down.  We purchased the standard ticket and out of the few activities they have a couple were not even working properly.  The build a car and race section was my sons favorite.  However, there were hardly any wheels to use.  The last issue I had was with the retail store.  The \"Pick a Brick\" wall was barren!!  When I asked the lady at the desk why there were no Lego on the wall she said \"I am embarrassed to say that has been like that for a while\"!!!  Really!  Lego retail store with no lego!!!  I can't tell if this place is underfunded, mismanaged, or both.  Here are some helpful tips.  I am all about supporting Lego so it pains me to say this.\n1.  Do not buy a season pass unless this place gets an overhaul.  It says the pass will pay for itself after two visits.  You will be one and done.  No need for round two.\n2.  If you are a fan of Lego then go in with low expectations until this place is running properly.\nHelpful tip for this location:  \n1.  Either remove the \"Pick a Brick Wall\" or fill it up with Lego.  \n2.  Put some more wheels out.  Most kids use four at a time.  If they build unicycles then \n     you have enough out there.  \n3.  Try surveying the parents walking out of this retail location and ask them if the kids \n      and parents had a fun experience?  You will probably get some helpful insight on \n      what is working and what is not."
 ]
},{
 "name": "Atlanta History Center",
 "address": "130 W Paces Ferry Rd NW 10 St Nw",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/9f/6c/fd/photo9jpg.jpg",
 "tags": [
  "history",
  "walking",
  "tour",
  "history",
  "family",
  "nature",
  "history",
  "learn",
  "nature",
  "walking",
  "free",
  "walking",
  "tour",
  "walk",
  "eat",
  "tour",
  "history",
  "walking",
  "kids",
  "family",
  "learn",
  "free",
  "art",
  "learn",
  "family",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d103493-Reviews-Atlanta_History_Center-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "AHC goes way beyond the history of Atlanta, although it covers many aspects of the cities history very well.  Beyond that there is an excellent Civil War exhibit that features a large selection of weapons, uniforms, and personal memorabilia, tastefully displayed and woven in to a running story of the progression of the war and its aftermath, told via displays, vignettes and videos.   There is an exhibit on WW I and a great section on Georgia handcrafts.  The Swann House mansion tour and a Georgia farmstead complete the tour.  Allow at least four or five hours to tour the museum galleries and out buildings.  Also wear comfortable shoes because a lot of walking is required.  A restraunt and grill are located on the premises.",
  "Wow! Atlanta History Center does it right! This was my first time visiting and my visit left a lasting impression on me. The entire experience was memorable from the drive in down Tuxedo Row in Buckhead to the laid back ticketing and beautiful grounds. Who knew you could be so close to the City, yet feel like you were transported to the country and even a different era? I love the hands-on nature of the exhibits, Blacksmiths making iron works at the Smith Farm, the maid planning dinner in the 1920's era Swan House kitchen, the Wood Family Cabin and even the museum exhibits. I have been to many museums, but the Atlanta History Center got it right! Such a cool experience! They are even in the process of moving the Cyclorama over from Grant Park.",
  "Southern MAGIC! That's what this is! Go during the week when it's quiet and fairly empty, and enjoy a peaceful glimpse back in time as you explore the homestead, learn the rich history of Georgia, and soak up the elegance of Swan House. Enjoy the beauty and wonder of nature as you stroll through the woods and gardens, and discover a bit of the past on the secret trails behind the mansion. It's the best $17 you will spend in Atlanta and this ticket will also get you into the Margaret Mitchell House for a bit of history on Gone with the Wind. You'll need half a day to see everything, and the houses close earlier than the museum so explore them first. There is a Souper Jenny on site if you get hungry and vending machines close to the garden entrance.  Enjoy!",
  "You'd need about 4 hours to see the whole museum and all the outside houses and grounds, if you stop to read most of the placards. I was surprised at how much information they had on the native Indian tribes as a lot of museums seem to skimp on that. Adults pay $16 however it is free for military (only the cardholder). Also free for Bank of America card holders but only first weekend of the month. If you go to the outside portion they are dirt trails so wear good walking shoes you don't mind getting a little dirty. ",
  "This was a great place. The museum was excellent. The grounds are expansive and include period houses, farms and accompanying buildings. Be sure to allow lots of time and wear good walking shoes, as the walk between the outside exhibits is long and there are some steep hills, you could easily spend 5 or more hours seeing everything. My only complaint is that some of the exhibits had poor lighting making it difficult to read some of the accompanying plaques. The admission includes access to everything including a guided tour of the Swan house.",
  "Went to eat one of the best hot dogs in Atlanta at the Metro City Hot Dog stand located at the History Center on April 11.  Spent the day walking the grounds and enjoyed the Swan House tour and the historical exhibits on display.  Make sure you wear walking shoes to enjoy this 20+ acres location.  The exhibits are educational to include a hands-on petting of animals for kids.\n\nLook for the Metro City Hot Dog stand for the best hot dogs in Atlanta.",
  "The highlight was certainly the gentleman portraying the architect of the home who stayed in character the entire time he share his knowledge of the home and the family who lived there. ",
  "Terrific venue for large gatherings. Great and small spaces. And, the world famous “Cyclorama “ is now housed there, a far better place than Grant Park’s creaky old building.",
  "If you are looking for a place where to learn about the Civil War of the United States, this is the place! Excellent videos and exhibitions with relevant material. I suggest to hire the audio guide, it was very useful.",
  "Must see if you are a civil war buff.  This circular painting of the battle of Atlanta is over 150 years old and has been saved from destruction 3 times,  well narrated.  Wished i'd had more time to enjoy the test of the museum.  Includes a free pass to nearby Margaret Mitchell's home.  as we entered the museum we were greeted by a period farmer with a very friendly sheep!",
  "Prepare to experience something very special at the newly updated Atlanta History Center. Not only can you learn all about Atlanta history, the Bobby Jones Story, Folk Art in a Changing South, and maybe details about your own ancestors. The Cyclorama features The Battle of Atlanta, a 132-year-old painting 49 feet tall and weights 10,000 pounds.  Explore too the Smith Family Farm, the Goizueta Gardens on 22 acres, and the Swan House with antiques and classic cars."
 ]
},{
 "name": "World of Coca-Cola",
 "address": "121 Baker St NW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/47/7b/64/welcome-to-world-of-coca.jpg",
 "tags": [
  "history",
  "drink",
  "sampling",
  "drink",
  "tasting",
  "tour",
  "history",
  "theatre",
  "history",
  "drink",
  "tasting",
  "tour",
  "drink",
  "free",
  "tasting",
  "drink",
  "tour",
  "history",
  "tasting",
  "tour",
  "free",
  "free",
  "tasting",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d102626-Reviews-World_of_Coca_Cola-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  " I gave up drinking soda awhile ago for health reasons but Coke was my favorite when I was still able to drink it. The museum is excellent and attraction's and displays are great they go into the entire history of Coca - Cola and how it came about, You get to sample the different type of Coke Products, There's a neat three D film you also see as well. There's a cool gift shop there as well.",
  "LOCATION : \nPemberton Place, 121 Baker Street NW, Atlanta, Georgia 30313\nLevels One and Two\nAdjacent to Georgia Aquarium and Center for Civil and Human Rights\nNear Centennial Olympic Park\nATTRACTIONS :\nLEVEL ONE : Lobby, The Loft, Coca-Cola theatre, Vault of the Secret Formula, Milestones of Refreshment, Bottle Works, Coca-Cola Polar Bear\nLEVEL TWO : 4-D Theatre, Coca-Cola Portrait Wall, Pop Culture Gallery, Perfect Pauses Theatre, Taste It ( Drink Dispensers ), Coca-Cola Store\nHISTORY :\nPemberton Place, a 20-acre site, is named after John Pemberton, creator of the original Coca-Cola formula. The address is similar to another famous one belonging to the legendary, though fictional master detective, Sherlock Holmes, who shared rooms with his friend and biographer Dr. Watson at 221B, Baker Street in London, England. The original World of Coca Cola ( WOCC ) opened on August 3, 1990 at Underground Atlanta, and moved to its present location on May 24, 2007. Dr. John S. Pemberton was a pharmacist of Atlanta who  created in 1886 a flavoured syrup to which bubbles got added accidently.  His partner and bookkeeper, Frank M. Robinson,  named the beverage “Coca Cola” and also designed the trademarked, distinct script, still used today.\nLEGEND\nThe Secret Formula is kept in a vault. Only two people in the world know one-half each of the formula. These two persons never travel together. \nBUILDING OF THE BRAND “COCA-COLA”\n“Coca-Cola”, fondly aka as ‘Coke’, was introduced as a distinct tasting soft drink which could be sold at soda fountains. It has become the second most popular drink after mother’s milk. Indeed, milk has been re-named “The UDDER cola” ! The USPs of the most recognized brand in the world are “Refreshing Taste”, “Universal Availability” and “Sustainability”. Variations include Diet Coke, Coca-Cola Zero, Fanta, Sprite, Dasani, Vitaminwater, Powerade, Minute Maid, Simply, Del Valle, Georgia and Gold Peak. There are now more than 500 different beverages being marketed by the company. Several artists, personalities and characters have been associated with the drink to increase its popularity. Perhaps the most beloved character is the Polar Bear. A plethora of Merchandise and Collectibles have been created and distributed by the company to expand its popularity further and farther. A tour of the WOCC is a once-in-a-lifetime experience for most visitors, though an annual pass with unlimited visits allowed is also available.\nTHE TOUR OF WOCC\nThe ticket price of USD 17 seems high, but it includes three film shows with one in the 4-D Theatre, photo-ops and sampling of drinks marketed by the Coca-Cola company worldwide. The special 4-D viewing “glasses” may be carried home as a souvenir. The Perfect Pauses Theatre showcases advertisements for Coca-Cola on TV ‘through the years and across the globe’. The Coca-Cola Theatre exhibits “Moments of Happiness’ in a celebration of life. A visit to the Vault of the Secret Formula is one of the highlights of the tour. The bottling process can be witnessed, works of artists can be viewed, benefits imparted by the Coca-Cola system to people and communities all over the world can be ‘discovered’, and taste buds can be tickled. Dispensers are classified continent-wise, with ginger beer from Tanzania to root beer from the US on offer along with more than 100 varieties.    \nSPECIAL MENTION : The place is equipped with aids and facilities for differently abled persons and those with particular needs. Assistive Listening Devices, designated parking for Baby Strollers, multiple language versions of Guide Maps and also in Braille, and Wheelchairs are provided without charge.\nCAUTIONARY NOTE : Unlimited quantities of samples of cold drinks are available. However, excessive consumption may be harmful, which is generally true for almost anything. It has also been reported that Coca-Cola may be corrosive and can dissolve articles soaked in it for a prolonged period, but there is no confirmation about this phenomenon. It is not advisable to permit infants and children below five or six years to drink the beverage in substantial quantities, if at all.",
  "Being honest here, neither my wife or I are Coca-Cola people.   We don’t drink soda and just wanted to fill 2 hours before our flight.   \n\nI now wish we would have given this attraction more time because it was fun, the staff was bright and cheery and the history of the product was presented in digestible and fun methods.  \n\nFrom the various films to all the history exhibits to the polar bear meet and greet and even the gift shop—what a cool place with happy sociable people to assist you at every turn!    They even have stations to charge phones for those who need it!!   \n\nWe will definitely come back for a longer experience in the future.  \n",
  "Got there pretty early in the day to avoid traffic in Atlanta (drove from Chattanooga).  Everyone was so friendly.  At the beginning of the tour, you are told information about Coca Cola and what you will see in the building.  Make sure to get your picture taken with the Polar Bear.  The polar bear is really funny!  The vault is interesting.  Loved the 4D movie, the chairs move.  The highlight of the trip was the around the world tasting room.  Some of the drinks were so good and some were so bad.  Really liked the blue raspberry fanta and the peach fuze tea.  The Beverly drink was just horrible.  If you are going to try it, start with a little taste.  Don't forget to get your free bottle of Coke at the end of your tour.  The gift shop has lots of great Coca Cola products.  Easy to find your way there, great parking, close to olympic park and other Atlanta attractions.  Go early in the day to avoid really big crowds.",
  "The World of Coca-Cola is a very fun place, especially since there are a few interactive experiences. I hadn't drank a Coke in a long time (I don't usually drink soda), but I still found this amazingly fun. The movies and exhibits make you feel happy. I know their whole point is to make you feel great about the soda, but I still approve of something that gives you the warm, fuzzy feeling. The 4D movie was an interesting experience, but don't do it if you don't like a lot of motion or if you have trouble with headaches; the movie bothered my eyes a bit. Remember to bring a camera, because there are so many displays that are picture worthy. And definitely try everything in the tasting room! I had no idea that soda was so different around the world. The little glass bottle of Coke they give you as you go into the gift shop is a nice touch. I would go back if I was back on Atlanta.",
  "By far the best tour in Atlanta (did CNN and this was way better!)\n\nWe went there around noon and were suprised by how much we could see and enjoy.  They have a timeliness to it that lets you enjoy every stop.  At the end you pick up a coke and enjoy all the flavor of Coke.  Take Sneakers because the drinks spill and the floor is super sticky!  They have two different movies...a quick 6 minute on happiness which is amazing and a 3D one which is cute.  A great place for all!\n\nJust in case...there are plenty of bathrooms across the park...suggest you go there after leaving the tour as there aren't alot of bathroom location elsewhere",
  "It’s ok. I went with some friends. It’s better if you have children with you. The staff was friendly. ",
  "Coca-Cola never lets you down; this experience is another positive reflection of the brand. We bought tickets on the door and they were well priced, we then entered the experience upon which you immediately receive a free coke and we were onto the introductory tour within a few minutes. The host for the introduction tour was upbeat and entertaining, and after a short movie (which was very good), we could go off to explore all the the attractions inside the venue. There were about 4 or 5 separate rooms centered around aspects of the brand like history, marketing etc. My favorite place inside the 'museum' was the tasting room where you can try loads of different flavors of coke based on a global theme, and have as much coke as you want! We probably spent about half a day here and it is great for all age ranges, its location in terms of downtown Atlanta is also perfect and I would thoroughly recommend visiting!",
  "World of Coca Cola is actually a good place to see in Atlanta. It starts with a show of the various Coke advertisements over the years, and some of their CSR's (Corporate Social Responsibilities).\n\nThen you get to go around various exhibits that are there, including a safe which holds a part of the coke formula.\n\nThere are some very interesting facts about the company which will surprise one & all. They have a 4D show as well. Finally, towards the exit, there is a huge room full of drinks that the company makes. Some already being sold, some for trials. Be careful, you could just get a horrible one as well.\n\nThe exit, like always in the US, is from the Gift Shop, which has some really cool stuff.\n\nAnd yes, there's free coke all the way till the exit.",
  "We went the day before they shut down due to COVID. Not busy at all. Good variety of activities to amuse everyone, young and old, with the highlight being the tasting room for sure.\n\nIn one of the exhibit halls, several of the interactive displays were broken. But still interesting.\n\nNot more than a 2 hour trip. ",
  "This Place is outstanding. The History collected on the foundation of Coke is Astonishing. The employees are exceptional, so kind and helpful. I love interactive apps in the rooms."
 ]
},{
 "name": "Mercedes Benz Stadium",
 "address": "1 Amb Dr NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/72/e9/1a/mercedes-benz-stadium.jpg",
 "tags": [
  "food",
  "tour",
  "walk",
  "food",
  "field",
  "tour",
  "food",
  "eat",
  "music",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d12874343-Reviews-Mercedes_Benz_Stadium-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Arthur Blank deserves a medal for how he structured the concessions for MBS.  I've been to several events in there (all football), and I have not been disappointed.  If you don't have a parking permit close by, take MARTA.  I've used MARTA twice, and it's been pleasant.  Crowded, but pleasant.  I have yet to attend an Atlanta United game, however.  I hope to do that soon!",
  "The Mercedes-Benz Stadium is a really nice stadium.  The design, especially the outside is beautiful.  If staying downtown, it's a fairly easy walk to the stadium, but there is also parking, if needed.  The staff were friendly and it was a nice visit.  The tour was decent, but not very exciting.  For the price (almost $30), I was hoping for more.  Still a great place to visit, but the tour could be improved.  Also, depending on the time of your visit there might be limited food options, but the CNN Center has several options just down the street.",
  "My husband and I attended Monster Jam at the stadium. While parking and getting into the facility is insane and the information for handicap patrons is lacking; once inside the facility it is fabulous. Clean, directions and signage is fairly clear. I really must brag on the staff - all were friendly , helpful willing to answer questions,willing to go find out if they didn't know courteous; concerned and eager to improve the guest experience. Each one we encountered was willing to serve. They even told us how to exchange our nosebleed section seats(300 level) for handicapped seats on that level. ( as handicapped people we would never have made it up to where our seats were!) The concession seemed reasonably price and the bathrooms were the cleanest I had seen in any facility ever. \nMy only gripe is that there is very little information on handicap parking and facilities on their website so that you could plan ahead. The staff on site was the best!!",
  "This is a great place to see an event and is very well put together.  Great food, wonderful site lines and just a very good place for a game.  I have not been to a big show there yet, but I am sure it is just as good!",
  "Had a long layover at ATL Airport, so decided to take MARTA train into Downtown Atlanta to kill some time.  Enjoyed my guided tour of Mercedes Benz Stadium -- the impressive home the the NFL Falcons and MLS Atlanta United. Tour lasts about 90 minutes and was $22 for seniors. Advance reservations for the tours can be made online.  Tour covers both Falcons and United Locker Rooms, some of the luxury suites and lounges, and you get to go onto the field. Check out the massive Falcon and Soccer Ball statues. If you're a sports fan, it's definitely worth a visit.  As a bonus, you get to keep your VIP tour badge as a souvenir.",
  "Thanks to Arthur Blank's (Home Depot Co-founder; see my review on ATL Aquarium) contribution to the cost of this magnificant stadium, ATL got a new stadium and did i mention he owns the ATL Falcons and United FC. Attended a Cowboy game in new Dallas stadium and later a NCAA game in ATL stadium.  Preferred the ATL stadium.  Did not like Dallas' scoreboard nor the accoustics. ATL stadium can be reached by nearby Metro subway stations and also is close to downtown so if you enjoy exercise or UBER/LYFT can get to Olympic Park, College Football Hall of Fame, Coca-Cola Museum, Aquarium, Children's Museum and lots of other stuff.  The King (MLK) Center and President Jimmy Carter Museum are short car rides.  Can also get to the MB stadium on Metro from the Hartsfield-Jackson International airport.",
  "Very good sight lines. House of Atlanta football and soccer teams, alleged to be professional. Oh, and the food is very good at the various concession stands.",
  "LOVE IT! We have tailgated here several times and it is worth it. Live music, games, prizes, and clean bathrooms. Very open space to play games and eat with family and friends."
 ]
},{
 "name": "Zoo Atlanta",
 "address": "800 Cherokee Ave SE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/5d/d5/f0/giant-panda-xi-lun-born.jpg",
 "tags": [
  "kids",
  "unique",
  "walking",
  "organized",
  "food",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d102784-Reviews-Zoo_Atlanta-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Zoo Atlanta will take you across the world through its animal exhibits. African elephants, gorillas, lions, and savannah animals, Asian giant pandas, reptiles from around the world, many others—they’re all here for you.\n\nThe exhibits replicate as closely as possible the animals’ natural habitat, and they are constructed to give the animals as much freedom and variety as possible. They also allow the animals some privacy from time to time.\n\nSignage provides information about the species and about the individual animals on view. Docents and other volunteers are stationed at major exhibits to help visitors spot the animals and to answer questions.\n\nThe lower level of the zoo includes a petting zoo and the children’s playground. Save this for last, or you may never get to the other animals.\n\nZoo Atlanta is well landscaped to provide shelter and beauty for both animals and visitors. The terrain is stroller and handicapped accessible, but it is also hilly. While the paths are smooth, the steep grades will provide a workout. It’s worth it!",
  "Excellent zoo. We enjoyed seeing all the animals. My husband and I took our two grandsons this past weekend and they loved it. I'm glad there is the Tree Top Adventure obstacle course, the train ride, the rock climbing wall, carousel and playground for kids also. I like how there are many restrooms so you don't have to look far to find one too :) All the staff members we encountered were very nice and helpful. It was a wonderful visit.",
  "This is a great zoo.  There is a wonderful bird show and a fun way to feed the giraffes as well.  There are some unique animals there, especially  the red panda, and also some regular pandas as well, that are adorable.  The elephant and gorilla exhibits are terrific.  Well worth a full day.  There are places to sit and take a break as well as bathrooms and snack bars. Very manageable for walking or using a stroller if necessary for small children. Parking lots get crowded so get there early. ",
  "The Zoo Atlanta is well organized, and offers us humans a glimpse of the different species of animals, which we would not normally be able to see in our day-to-day routine.  Take your time;  it is not a short visit.",
  "My young ones walked me to death.  We had a wonderful time.  Conservation were stressed.  Great zoo. Animals looked well and happy.  ",
  "This was a great zoo visit. Lots of animals with fun facts in addition to plenty of friendly and informational zookeepers. I really liked that many of the animal habitats had multiple vantage points to view the animals which helped thin crowds and let you see animals that may have been hiding from a different positions view. There were some nice areas for the children to play and a fun petting zoo with goats and sheep. The zoo overall was well sized, not too big, nor too small. Very enjoyable and pleasant visit.",
  "Great family day out. I have never likedZoos, but with zoo Atlanta’s conservation policy it is a must see. Food isn’t too pricy which is good. Only issue was that there are not any breastfeeding stations which is a shame. My sister in law had to walk a considerable way to feed my nephew. Other than that. ce for a day out",
  "The Atlanta Zoo is working hard to use the land they have acquired, and modernize exhibits.  They have a few great exhibits:  the Giant Pandas, the space for the baboons, the Sun bear overlook.  The new elephant center was fantastic even though we never saw an elephant there.  \n\nThis was first week of March and for some reason the giraffes and elephants were not out.  No orangutans out.  No rhinos.  But the baboons, lions, tigers,red panda and giant panda were all visible.  \n\nThe Zoo has a good selection to see beyond what I mentioned.  Reptile house, monkeys, and play areas for example.   \n\n"
 ]
},{
 "name": "College Football Hall of Fame",
 "address": "250 Marietta St NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/16/96/fb/celebrate-any-event-and.jpg",
 "tags": [
  "history",
  "field",
  "family",
  "kids",
  "field",
  "history",
  "field",
  "knowledgeable",
  "tour",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d7092286-Reviews-College_Football_Hall_of_Fame-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Make the pilgrimage to this Mecca of college football history if you are the least bit of a fan. You will not be disappointed.\n\nFrom interactive exhibits featuring your personal favorite college team to seeing a treasure trove of historical artifacts and awards, it is an absorbing couple of hours. I was particularly interested in seeing all the uniform and equipment changes through the years.\n\nPerhaps the cherry topping of this sweet experience was making a video during which I belted out my college fight song. Karaoke was never so much fun!",
  "Our family had a great time visiting.  We loved all the interactive exhibits at the HOF!  Everything from calling a thrilling play from the past, to being a guest on College Game Day, to singing your favorite team's fight song.  The highlight of the day was the Chick-fil-A fan experience area! Our boys had a great time trying to catch passes, throwing to targets, and trying to a kick field goal.  \n\nIf you love college football, you will love stopping by and visiting! The staff was very friendly and helpful.  Would definitely come back if we had the opportunity! ",
  "my wife and kids took me to the CFHoF for Father's Day, which was a great surprise.  it's very cool that you can customize your visit to highlight you favorite team and the players that are in the hall.. some very interesting facts and great displays.. even my kids (4 & 8) enjoyed their time there. worth the time to check out",
  "Must see if you enjoy college football and are a fan.  Very well done interactive exhibits that with use of your admission badge link you to your favorite team.  Plan on at least two hours to fully enjoy all this fin place has to offer.  Regardless of age, try at least one field goal attempt on the indoor field!",
  "We had a great time visiting the CFHoF. The staff does a great job checking you in and explaining how to explore. If you are a college football fan you will be amazed at all the interactive information. Allow at least two hours to get through it all. As with any big city attractions you need to plan on being there right when it opens. ",
  "I am a huge college football fan, even travelled across the country by myself to watch a game where I had no rooting interest. This place is expensive, and the value from visiting does not justify the high price. It's cool, don't get me wrong, but it certainly worth what the admission charge is. Spend an hour inside, but I wouldn't recommend staying much longer.",
  "Several interactive exhibits make this a must see place to visit in Atlanta. You can kick field goals, throw touchdown passes and visit all the history of college football",
  "The people who worked here were knowledgeable and so very willing to answer questions or just chat. It was fun to hear interviews with famous players. You can limit your primary interest to a particular college. There were a lot of interactive opportunities for all ages. \nIt’s multilevel and there is an elevator. \nThey must have closed for this Coronavirus just days after we went through. With so many touch screens, probably a wise decision,",
  "We had planned to do the CFHF in the morning, have a leisure pizza nearby and then do the tour of the Mercedes-Benz Stadium (home of  ATL Falcons & United FC and various Chic-fil-a Bowls: pre-season, Peach Bowl, as well as annual SEC Championship, occasional National Championship of both NCAA and NFL).  We had so many things to do in the CFHF that we made it a short lunch and went back until closing.  We did the M-Benz Stadium tour another day and attended a NCAA football game later.",
  "I am NOT a sports fan, but went with my husband, who very much IS.  I have to say I was pleasantly surprised.   If you are a sports fan, this is a must do.  If you're not,  you will likely be wowed by the excellent exhibits, anyway.  It would be great fun with kids, as well.  Lots of interactive exhibits.  It's high praise indeed for someone like me to give it an excellent rating.",
  "For a football enthusiast like my teenage son, it was a “must-see” place with interactive exhibits and memorabilia from various college football programs and coaches. It can be included as part of the Atlanta CityPass along with the other attractions which will allow visitors to save some money."
 ]
},{
 "name": "SunTrust Park",
 "address": "755 Battery Ave SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/8b/05/bb/photo1jpg.jpg",
 "tags": [
  "unique",
  "field",
  "walk",
  "food",
  "kids",
  "unique",
  "free",
  "parks",
  "art",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d12285023-Reviews-SunTrust_Park-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Let's get it out of the way.  Parking.  But it in advance through the Braves app.  Period.  Don't show up and expect to pay with cash, they don't take it.  Pre-plan.  That out of the way, there is so much to like about this new park and the property around it.  Inside the stadium there are lots of good options for food with Fox Brothers BBQ to Chick-fil-A to healthier options in the Market (in left field).  The new Chop House looks interesting as well.  Plenty of interesting event spaces.  The Home Depot space offers a unique view and the cool responsibility of hanging K's after every opposing batter strikeout.  Below the Chop, with only a fence separating you from right field.  Hank Aaron Terrace is an excellent corporate space and is the spiritual heir to the 755 club at Turner.   Fun for the kids abounds in the Children's Healthcare area behind the outfield that offers games and even a zip line.  Monument grove behind home plate is an interesting walk down memory lane.  \n\nThe Battery is positioning itself to be a fun place to congregate before and after the game.  The return of the The Roxy highlights the property offering.  Antico, the YardHouse, Punchbowl Social and PBR are other restaurant/event spaces that have been announced.  Come early and stay late to enhance your Braves experience.  ",
  "The park itself is beautiful, clean and there are a lot of kid friendly activities inside the gate. Quite impressed! There are also many great restaurants, bars and stores just outside the park, making it easy to grab a bite before the game (but arrive early as it gets crowded). ",
  "The fact that the nearest MARTA station is 15-20 min away is Ridiculous and it is clear that the stadium was built to serve other interests. The stadium is scenic and had a lot of things for children ( speed pitch, base-running) . The Mizuno globe rental was unique and the band that plays before the game was fun. There are 7-8 huge bars outside the stadium to hang out before the game. The clubhouse shop is gigantic and their are escalators everywhere. Make sure to arrive early to attend batting practice at least once! WiFi is free. \n\nAfter the game the uber designated  Point is outside the stadium but gets very crowded when 500 people are requesting an Uber. Be careful not to get hit by the erratic drivers. ",
  "We were by there last week - signs have been changed from SunTrust Part to Truist Park.  Please update your records to reflect the new name of  this stadium",
  "One of the better major league parks. Many good concession stands, and outfield spaces to mingle, if that’s why you go to games. Adjacent Battery is a major draw itself— bars, restaurants and shopping. Now called “Truist Park.”",
  "Home of the Atlanta Braves, one of the best teams in MLB. State of art in every way. Not a bad seat in the house and prices are reasonable. Low priced tickets available for every home game. Great food, best in the majors. ",
  "A friend and I traveled from East Tennessee to our first game at the new SunTrust Park to watch the Braves vs. Pirates. The stadium was easily accessible. Parking was close but expensive. The stadium offered a wide variety of food and drinks. Seating was comfortable and the view was clear. The stadium has many classic qualities with modern conveniences. The Braves won which was a bonus.  ",
  "I was so against this project when I first heard about it.  I live nearby and thought the traffic situation was ALREADY bad.  I have to say I am so impressed with the brilliance of the completed plan.  The stadium is wonderful, interesting, efficiently laid out, and creates an super fun environment. And, what's gone up around the stadium makes it a full day or evening experience.  Parking is completely do-able."
 ]
},{
 "name": "Fox Theatre",
 "address": "660 Peachtree St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/44/ea/2e/fox-theatre.jpg",
 "tags": [
  "theatre",
  "tour",
  "family",
  "performance",
  "eat",
  "theatre",
  "drink",
  "walk",
  "walk",
  "eat",
  "food",
  "family",
  "walking",
  "tour",
  "theatre",
  "unique",
  "historic",
  "theatre",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d105199-Reviews-Fox_Theatre-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I grew up in the metro Atlanta area, and have been going to the Fox Theatre all of my life. When I was a kid, it was a movie theatre. I’ve seen a lot of movies here. As a teen, I took dates to concerts at the Fox. Now that I’m married, and have 5 grandkids, my wife and I love to see plays and concerts here from time to time. I’m still impressed with the place even now. Love the Egyptian themed interior, the huge bathrooms, and the twinkling stars and clouds in the beautiful, simulated night sky that you see when you look up from your seat. The acoustics are incredible. There’s probably not a bad seat in the place.",
  "The Fox Theater, started as the Atlanta Shriner’s group Yaarab Shrine Temple, is now a performance venue and is a gem. It was narrowly saved from the wrecker’s ball and continues now as a site for a varied and vibrant selection of entertainment: Broadway musicals, rock and roll, movies, dance and all manner of wonderful performances. The 1929 building still features carefully-preserved architecture that is a mash-up (if I am using the term correctly) of Egyptian and Islamic/Arabian elements. Look up at the ceiling in the theater area; it is as if you are looking at a starry sky, complete with twinkling stars and wispy evening clouds, from a desert tent. The past performances here have been legendary: what I remember includes everyone from the Rolling Stones, Aretha Franklin and Prince to Alvin Ailey, the Atlanta Ballet and the State Ballet of Russia, to the Atlanta Opera, Metropolitan Opera, and Broadway musicals Mama Mia, Les Miserables, Phantom of the Opera and The Book of Mormon, plays 12 Angry men and Madea's Happy Family and new and classic films. Fans are looking forward to performances of Hamilton this year. The pipe organ – Mighty Mo – is played before some performances.  You can tour the Fox Theater and even rent areas of the Fox for a private event. I have enjoyed many, many concerts and musicals and speakers at the Fox, and been on the tour. All in all, the Fox Theater is an Atlanta treasure. ",
  "This \"classic theater\" reminds me of places I would visit as a kiddo.  The ceiling is designed to look like stars twinkling as the show happens, and the Mighty Mo is a beautiful theater organ!",
  "I have seen many shows (concerts, musicals, plays, movies, ballet) at the Fox Theatre and have never had a bad experience.  Bear in mind, there are close to 5,000 seats here so there are some that don't afford as spectacular a view as you might like, so bring your small binoculars and enjoy the architecture and grandeur of the space.  In the summer, they show movies and the sound isn't what you'd get in a modern movie theater, but the experience of seeing some great films at the Fox is worth it.  Otherwise, plan on arriving early, expect a line to get through security and have your bags opened and checked.  The line for the bathrooms can be long, but tends to move quickly and the lounge area outside the ladies room is lovely.  Concessions are limited and pricey, but there are plenty of restaurants in the area so eat before or after.  Parking can be problematic so plan on paying at least $10 for a lot with an attendant. You will find that street parking is VERY limited.  If you have a small child, ask for a booster for their seat.",
  "Buy your parking ticket with your theater ticket!!! Best decision we made. There is a bit of a walk so leave your heels at home. The theater is absolutely amazing. Old fashioned, well restored and gorgeous. Drink prices are outrageous and you cannot bring any liquids in with you so come prepared. Also, the heating/ac is antique so bring a sweater and a hand fan. ",
  "Tons or renovations in recent years in the surrounding blocks has made a nice place even better. There are plenty of reviews on how nice the building is, they are correct. Our family has seen concerts and Broadway type shows here, the venue is great for it. \n\nSmoothing your way in and out will enhance the overall experience:\n\n1. Approach for out of towners: GPS services will likely tell you to get off on North Avenue. Depending on time and day, don't be afraid to use the next exit in either direction. This is perhaps the only part of Atlanta where the street grids are very block like. The reason I suggest this is because the North Avenue exit is often congested, even on weekends. \n2. Parking: if you follow the previous advice on the exit, you'll see plenty of parking options within walking distance of the Fox. This will help you avoid some of the traffic congestion as well.\n3. Food: there are restaurant options within walking distance of the Fox. And, there are more options a very short drive away. If you want to hit 2 Atlanta landmarks it would be, eat at The Varsity and then walk over to the Fox. \n\nI would err on the early side of planning, whether you eat or not. Atlanta traffic is famous for a reason. But, it is certainly manageable and in this case certainly worth it.",
  "Just passed by while riding across Fox theatre @ Atlanta\nLooks great and massive place.\nNext time will love to take a tour at Fox",
  "Many grand international cities have historic theatres unique for something - accoustics, architecture on inside or outside, multiple uses other than as theatres during their lives, historical performances, etc.  The Fox is one of these theatres.  The Fox is sometimes confused as the theatre hosting the premier of Gone with the Wind (it was actually premiered in globally in Atlanta in the now torn-down Loew's theatre).  However, the Fox has hosted many stage shows, live theatre, Broadway productions, and concerts over its many years.  It was opened only 2 months after the 1929 stock market crash and closed 125 weeks later, but eventually re-opened and refurbished.  Great place to attend any event on the calendar. ",
  "My husband won free tickets to Joe Bonamasa concert this past February. It was really great. Couldn't have asked for a better concert. The price was good also, Free",
  "What a lovely, historical building....excited to see the always mesmerizing Alvin Ailey Dance Group there on a recent excursion to Atlanta. Thrilled to actually see one of Atlanta’s “Tiny Doors” located around the base of the original ticket booth. We purchased orchestra seating but had difficulty in seeing the show. Several tall people were in front of us and the physical incline of the orchestra seating was minimal. We were constantly moving our heads from side to side to try and see the stage but without success. Luckily, the people to the right of me left the show at intermission so everyone moved over a few seats. Unless there is a physical renovation of the building, I would not recommend seating in this area.....unless you are extremely tall and don’t care about your fellow attendees. The concession staff was friendly and helpful but one of the ushers was very rude. I will opt for mezzanine seating the next time I travel to this lovely venue for a show. ",
  "The auditorium represents a moorish skyline including an arched bridge across the front of the ceiling and a starry night. The lounges are decorated in an Egyptian motif and it is all maintained in an immaculate state. An Atlanta icon."
 ]
},{
 "name": "Jimmy Carter Library & Museum",
 "address": "441 Freedom Pkwy NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/fa/5a/74/carter-presidential-center.jpg",
 "tags": [
  "library",
  "theatre",
  "walk",
  "library",
  "tour",
  "historic",
  "history",
  "learn",
  "kids",
  "free",
  "library",
  "tour",
  "free",
  "organized",
  "library",
  "history",
  "history",
  "library",
  "history",
  "tour",
  "library",
  "comforting",
  "historic",
  "family",
  "active"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d126907-Reviews-Jimmy_Carter_Library_Museum-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent 3 hours there well worth the price. I did not remember about the baseball bat wielding former racist Governor that Carter best. Georgia never look back.  \nThe section on negotiations with Sadat and Begin with behind the scene stories. \nIf you don’t know where the medical caduceus symbol came from you should go here.  What a great post presidency this very good man has had \nFun to see his early submarine life and the typical gifts presidents get (they can’t keep them unlike the Clintons tried to do) the gifts are the property of the USA  many on display here ",
  "Visited our first presidential library.  \nThere is an $8 admission.  \nHe was in office as I was growing up. \nThere is a heavily shaded entrance and there was a farmer’s market on one end of the parking lot when we drove up. \n\nPresident Carter is involved with Habitat for Humanity and many other organizations helping change the world.    There were relics— Grammy and Noble Peace Prize, photos, and gifts from his childhood, other nations, and a theatre with movie of his life, \n a vast research library, and large display of existing presidential libraries.  \n\nThere is a cafeteria on site which we didn’t visit.   You can also walk along a beautifully winding path that runs alongside a manmade lake.   \n\nIt was an enjoyable visit. ",
  "Jimmy Carter has become a great man in the eyes of the world, not so much because of his turbulent tour of duty as the 39th President of the United States but because of his outstanding worldwide humanitarian work after he left office. So it is appropriate and fitting and respectful that Americans should visit the Jimmy Carter Library and Museum in Atlanta, Georgia. What a beautiful complex. Dedicated in 1986, on Carter's 62nd birthday, it houses Carter's papers and other material relating to the Carter administration and the Carter family's life. The building housing the library and museum makes up 69,750 square feet with 15,269 square feet of space for exhibits and 19,818 square feet of archive and storage space. The library stacks house 27 million pages of documents, 500,000 photographs and 40,000 objects, along with films, videos and audiotapes. The library also hosts special exhibits, such as Carter's Nobel Peace Prize and a full-scale replica of the Oval Office, including a copy of the Resolute Desk. On top of that, there is a wonderful view of downtown Atlanta across I-75. The Martin Sheen-narrated video provides a thorough introduction to the facility. My wife and I visited the library and museum in the late 1980s, after it opened, then again last summer, after the $10 million renovation in 2009, which celebrated Carter's 85th birthday. I didn't vote for Carter but my respect for the man has grown enormously over the years. In hindsight, he was a better President than given credit for--and an even better man for his humanitarian accomplishments. His library and museum are testimony to a life serving others.",
  "This museum is quite informative and does a great job of capturing the Carter campaign and time period in which Jimmy Carter was president during the late 1970s. If you are a history buff this will be an enjoyable and worthwhile trip. Make a day of it by also visiting the nearby Martin Luther King Jr National Historic Site. They are probably a less than five minute drive away from each other. If you are a fan of American history and politics, this will be something you want to see. Honesty, little kids would be bored likely. This isn't the kind of museum that caters towards kids, but one that wants to give you a in-depth history into the life and presidency of Jimmy Carter. There is even an exact life-size replica of the Oval Office on display, which was a highlight for me. This museum is a nice treasure near the heart of Atlanta where you can learn more about one of our underrated one-term presidents. Jimmy and former 1st Lady Rosalyn Carter are still going strong in their senior years, but as is a bit of a rarity now days will not be buried here upon their deaths. Parking is free, allow yourself about 2 hours to see the entire thing.",
  "Wow!  What a nice museum.  We have been to several Presidential libraries and I think this was our favorite.   We spent three hours and could have used more time.  There is so much to see!\n\nThe self-guided tour  begins with  a short movie and then the displays progress from President Carter’s birth till present.  Admission is $8 for adults, $6 for seniors and military, and children under 16 are free.  About half-way through, we took a break for lunch and ate at the on-site café, Kitchen at Copenhill, then returned to the library.\n\nThe grounds are beautiful.  It is hard to imagine you are in the heart of Atlanta with all of the trees and beautiful landscaping.  Parking is free.\n\nDon’t miss this museum if you are in Atlanta!",
  "I found the presentation of artifacts and information at the Jimmy Carter library to be very interesting. The displays were well organized and provided a thorough history of the president's life and work. This attraction can easily be visited within a 2 hour timeframe. Take the time to listen to the video presentations as they are worthwhile. ",
  "I went to the museum after arriving early on a flight to Atlanta. It was a rainy day, but the museum staff were helpful. The introductory film helped to put the museum in context. I'm old enough to have remembered the Carter administration as a youngster, and as a college professor teaching US history I often focus on the disfunction of the late 1970s, I came to have a better appreciation of the genuine decency of Jimmy Carter, especially after his presidency. The museum helped me rethink my lecture on the Carter administration, but also to bring up the role of past presidents in the 21st century.",
  "Carter left the office of President, but never left the people. While other former presidents take the lecture circuit, he took a hammer and built homes. He definitely earned his Nobel Peace Prize, which is displayed here.  His wife of 70+ years was his constant companion. His life from his humble beginnings to his life today is well chronicled in this well designed museum",
  "Even though this is a presendential library, it is a tribute to both President Jimmy Carter and First Lady Rosalynn Carter.  This is the epitome of what a team is suppose to be about.  How often does one get to visit a presidential museum?  So tae advantage of how close this is to downtown ATL.  It has been recently updated, so enjoy yourself.",
  "By pure luck we were driving by and saw this place. I've been to a couple other presidential libraries before so I couldn't pass up going into this one.\n\nThis library is co-located with the Carter Center. So there is plenty of parking. There's a small fee to enter and from what I could tell, I believe the facility is ADA compliant.\n\nThere is lots of history and information about President Carter from his humble beginnings thru his later years. Unfortunately, part of the library was closed on the day we were visiting...for remodeling I think. There's a short video to begin your self guided tour. There are also several other video monitors throughout the library. Bring your glasses as there are numerous documents and displays throughout the library.\n\nNow I think the other two libraries (Kennedy & Reagan) that I visited were better...but that's just my opinion. You might find this one better. If you're looking to kill some time or love this kind of history, this would be a good choice for you.",
  "This is my third Presidential museum.  I was impressed by the level of detail in the exhibits: numerous examples of handwritten notes and speech mark-ups in Carter's own handwriting. Lots of family and personal artifacts and effects from his early life. The campaign of '76 was particularly fulsome in displaying items and video that helped convey the awesome task of coming from essentially nowhere to win the Primary. \n\nThe museum has a great emphasis on the ideas promulgated by Carter and consequently this is an intellectually engaging experience even if one doesn't always agree with the underlying philosophies espoused. The most moving part for me was the Camp David accords - an inspiring accomplishment. I appreciated the large scale photo blow ups throughout. \n\nSome disappointments: the lack of a presidential limousine, the noise level of competing videos in the area around the Oval Office (I strained to focus on Carter's monologue about his experiences working there), comparatively limited information about the Iran hostages (this essentially occupied Carter's final year and many believe contributed to his failure to be re-elected), a lack of info about Billy Carter and Miss Lillian (both larger than life figures during Carter's Presidency and thus deserving of their own small exhibits) and a total oversight of the far-reaching effects of Carter's decision to deregulate trucking and air fares - thus allowing today's boom in discount airlines and the rise of Walmart and, more recently, Amazon. Was also surprised to see a lack of emphasis on the Carters' signature post-Presidential accomplishment: the eradication of the guinea worm in sub-Saharran Africa. The museum is not a place to locate much criticism of Carter - but then, neither are the other Presidential museums. \n\nThe grounds are quite nice and the museum is beautifully designed. The historic Inman Park neighbourhood, while a contrast to the modern architecture of the Museum, was great for touring on foot afterwards - very quiet and relaxing and ideal for contemplating the many ideas presented in the museum. The adjoining Carter Center was active during my visit with a speaker and audience and that made for the comforting thought that this wasn't just a sterile shrine but rather a continuation of Carter's principles of service. \n\nThis museum is suitable for all ages. Those who want to relive the uniquely tumultuous times of the late 1970s and early 1980s will be very much at home here regardless of political affiliation."
 ]
},{
 "name": "Ponce City Market",
 "address": "675 Ponce de Leon Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/99/6a/66/ponce-city-market.jpg",
 "tags": [
  "history",
  "food",
  "eat",
  "food",
  "food",
  "food",
  "food",
  "structure",
  "eat",
  "drink",
  "kids",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d7826970-Reviews-Ponce_City_Market-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "They have done a wonderful job with the old Sears building on Ponce de Leon by renovating and adding shops, restaurants, and apartments. It is on the Beltline. Parking is the only downside- you do have to pay to park and the area underneath you park in is hard to navigate. The restaurants are good and everyone in your party could get their food at a different location and meet in the middle to eat. There is a lot of history left to see in the building.",
  "Ponce City Market is one of best developments in Atlanta - or anywhere. The old Sears warehouse and southeast distribution center has been turned into a fabulous live-work-play envionment in Atlanta's biggest adaptive re-use project. Adjacent to Atlanta's other \"hit,\" the Beltline, and across the street from Old Fourth Ward Park, PCL has become both a mecca and a magnet for neighbors and destination travelers alike. The food court is amazing! All the bars and restaurants are local or nationally know chef owned and managed. No chains or fast food outposts here! We like Minero's (Mexican) from supertsar chef Sean Brock (Husk in Charleston and Nashville), H&F Burger from famed Atlanta chef and James Beard Award Winner Linton Hopkins (Retaurant Eugene, Holeman + Finch) and Bellina Alimentari (Italian). A English friend stated that Bellina served the best Italian that she's had in her 20 years in the US! Beware - the crowds and parking. There's a charge for parking, and on weekends, the valet can back up for 20-30 minutes. In warm weather, walkers, joggers and bikers on the adjacent Beltline flood the food court. But, don't let this discourage you. If you live in or are visiting Atlanta go- Go- GO!",
  "This is another one of those \"nice for Atlanta\" places. This isn't really a market insomuch as it's a mall in an old building with an overpriced food court, which mostly under delivers in terms of quality. Parking is a nightmare and the place is not easily accessible by Marta, which is about a mile away. As it connects to the Beltline, it can be a nice place to pop in and use the bathroom.",
  "First of all, I almost didn't come to this market because of the bad reviews that I saw about parking. I did go on a weekday when it was not busy, BUT I had zero issue parking. There is parking surrounding the market and an option to pay via an app or at some little machines throughout the lots. \nThe market has a lot of great food choices--you can easily share a meal there or have a nice snack too! Great stores to look through--even if you are just looking to window shop! Many cute & postable photo ops! Must visit!",
  "I like when old buildings with character are renovated and repurposed as this one was. While Ponce City Market is like a shopping mall without the sleekness, it does have a lot of character. Unlike a traditional shopping mall, Ponce City Market has more emphasis on dining and food shops, which might be it's strength. \n\nI've enjoyed several of the eateries in here since it opened. Botiwalla with it's Indian street food, Bellina Alimentari, a gourmet Italian market and Saint Germain with it's french pastries are a few favorites. There's a nice range of flavors here from around the globe.\n\nPonce has well know shops such as West Elm, J Crew and Williams-Sonoma, but it also has many lesser know shops that you won't find at the average shopping mall. Archer paper goods, Binders and Citizen Supply are a few that appeal to me.\n\nOne down side to this shopping center, is you have to pay for parking upon arrival.\n\nFor me, Ponce City Market is a more interesting dining destination, than shopping.",
  "Awesome place. The atmosphere is simply happy and joyful. Went for a lunch and decided to have some craft hot dogs that were BOMB. Really really good place. If I stayed longer in Atlanta would definitely try the hops chicken because it looked like chick fil a on steroids. Overall very neat place. ",
  "This is definitely worth a visit, the shops are plentiful, mainly touristy but some unusual ones.  There is an abundance of places to eat and drink and relax and they have made the most of such an interesting internal structure and the walkway.",
  "What a great venue in Atlanta for kids of all ages. Great food, shopping and a variety of entertainment, When it comes to food, cuisine from all over the word is available and based on what I tasted iwas all good. The Skyline Park is a very interesting place featuring old carnival style games. All in all Ponce Market is a must visit when in Atlanta."
 ]
},{
 "name": "Centennial Olympic Park",
 "address": "265 Park Avenue West NW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/9e/3a/b9/centennial-olympic-park.jpg",
 "tags": [
  "kids",
  "music",
  "walking",
  "kids",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d103492-Reviews-Centennial_Olympic_Park-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We walked and drove past this park. It's in the middle of downtown Atlanta.  It's gorgeous with great views all around.  Lots of things to do in the park, lots of open fields to lay and relax in, playground equipment on one end with a water fountain on the other that \"dances\" to music (kids are allowed to splash in it, it's great).  Made for a great evening activity while staying at a hotel nearby.",
  "What an absolutely beautiful area right in the middle of town...to have such an open green space with the city skyline in the backdrop is breathtaking! perfect place for a stroll or picnic!!!",
  "Centennial Olympic Park is truly a crown jewel.  It is a must see attraction while visiting Atlanta.  The park is centrally located and within walking distance to several tourist attractions, such as the CNN Center and Studio, College Football Hall of Fame, Georgia Aquarium, World of Coca Cola, and SkyView Ferris Wheel.  It is a great place to spend a day for a picnic, playground for kids, various monuments and artwork, and a grand fountain to cool off with in the summer.",
  "If you happen to be downtown Atlanta, do not hesitate to spend a while walking the Centennial Park.  The fountains are great, the monuments too.  It is enlightening, as we remember the happenings during those Olympic Games.",
  "This is a well maintained park in the center of Atlanta right by all the main attractions like the Aquarium, Coca-Cola World and State Farm Arena. We liked the features of the area like the fountains and the sculptures; I imagine it would be lovely, but busy, during the summer on a warm and sunny day.",
  "Nice stroll through the park, wide open spaces. Very convenient to other tourist attractions. We'll maintained. ",
  "It is a nice Green space in the middle of Atlanta.  Always reminds me of my time spent working on the 1996 Olympics!",
  "The park was used for a finish line and gathering place for the Hot Chocolate 5k/15k run. There is plenty of room for everyone to spread out and  enjoy the clean air. Great views of the Atlanta skyline and this park is close to everything in downtown Atlanta."
 ]
},{
 "name": "High Museum of Art",
 "address": "1280 Peachtree St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/ea/9d/7e/high-museum-of-art.jpg",
 "tags": [
  "unique",
  "music",
  "walk",
  "structure",
  "tour",
  "family",
  "art",
  "art",
  "art",
  "walking",
  "family",
  "art",
  "art",
  "field",
  "free",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d144319-Reviews-High_Museum_of_Art-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "The High Museum of Art (HMOA) is a corner site , at the junction of Peachtree and Sixteenth Street , about 2 miles from downtown and set in Midtown Atlanta, the arts and business district. You'll find a bit of everything at the HMOA: photography, decorative art, Classic European and American works as well as contemporary art...anything goes.\nA 15000 piece art collection with a schedule of special visiting exhibitions from Rembrandt to Picasso, the HMOA gets the masters as they tour the globe. With its extensive permanent collection, innovative educational and family programs, there is something to tickle everyone's fancy. But what sets the HMOA (the High as locals call it) apart is it's unique attention to folk art as indicated by it's incubation lab for self-taught works....an innovative instrument for developing up-and-coming artists.\n\nThe High , designed by renowned artist Richard Meier and Renzo Piano is a work of art in its own right and the museum goes to great lengths to treat it so.The building itself is a masterpiece with a stark white, uber-modern, porcelain-enamel exterior. The building structure is circular quadrant in form with a missing front quarter that houses a monumental atrium, lobby and epicentre of the museum. An excessively elongated ramp (raised the eyebrows of some visitors ...not me) runs from the street to the entrance and parked on the greenery, near the front of the building, is a sculpture by Rodin titled 'The Shade'  which was donated by the French government in memory of the many museum patrons who were killed in a 1962 plane crash in Paris. With all respect, and as an interpretation of this sculpture I say it looks like a giant Olympian sprinter bent over in the starting position waiting for the gun to fire. Perched on a plaza, near the entrance was a collection of man-sized fruits ( yes...apples, oranges, etc)....I failed to reveal the author, but the work could have been a commercial prop for 'Fruit Of The Loom' underwear.\n\nUpon entry, I was whacked by the magnificence of the 4 storey glass atrium. The natural light filling the atrium is significantly magnified by the atrium walls which are also windowed, providing not only illumination for the galleries but cityscape vistas looking out....neat engineering. I found however, that the most functional architectural feat of this building was the interior ramp (just an extension of the exterior ramp) that formed the museums circulatory element.This central space encompasses the entire museum with galleries on either side and walk arounds in some spots. This design alleviates the 'where do I go next' and 'what did I miss' questions. It's like you are on High 'autopilot'...more neat engineering...the museum has an architectural gem on its hands.\n\nSome of the artwork I took a shine to were:\n\nANDY WORHOL: multi-coloured Marilyn Monroe...a far cry from the soup can,\nPAUL GRAHAM: A Shimmer of Possibility...a man cutting the grass with a hand mower...I'm amazed how some people take nothing and make something out of it,\nCLAUDE MONET: Autumn on the Seine.. in the usual Monet muted colours..it is said that one of the boats in this scene was his studio, \nHOWARD FISTER: George Washington...more of a comedic work...I can't understand the straight 'Leaning Towers of Pisa' encircling George's portrait,\nWINNIE THE POOH: was there too.\n\nI did drop in to a visiting exhibition, by Virgil Abloh, titled 'Figures Of Speech'. Virgil is relatively unknown, but not lacking in cultural influence and fashion where-with-all. His career started in engineering and architecture and transitioned into noteworthy high retail brands (Louis Vuittons), music (Kanye West) and design furniture houses. The first display I encountered in this installation was a neon, displaying 'You're obviously in the wrong place' which got me wondering, 'Am I in the wrong place'. My real favourite was a picture taken in a locker room with 6 team members standing on a bench facing the wall with the caption: 'A team with no sport'. I must admit 'Figures of Speech' was a voluminous, entertaining installation...figuratively speaking that is.\n\nSo, if you appreciate serious museum architecture housing artwork in a wide array of cultural genres with exciting and experimental visiting installations ....then try the .......\n.....The High.......Permanent, Visiting & Incubator Collections.",
  "Atlanta's premier museum space has a broad range of collections for a variety of interests and included rotating collections as well as traveling exhibits.  And a super cool location with great dinning near by makes this place a must-see.",
  "We're members and familiar with the outstanding special exhibitions the High museum makes available to the culture loving public. This current exhibition is excellent. The Phillips collection is a regular smorgasbord of 19th and 20th century Impressionist, Post-Impressionist, Expressionist, and Cubist art. On display are works from familiar names such as Degas, van Gogh, Monet, Manet, Braque, Cezanne (my favorite painter), Picasso, Ingres, Klee, Kandinsky, Kokoschka and many others including some out of the mainstream. It's really unbelievable to see so many paintings from so many established and famous artists in one place. \n\nIn addition to the European Masters exhibition, there's also a wonderful display of the \"photography of Clarence John Laughlin, \"Strange Light\". \n\nBesides these changing exhibitions there is a permanent art collection of 75.000 artworks across 7 collecting areas:African Art, American Art, decorative arts and design, European art, folk and self-taught art, modern and contemporary art, and photography.\n\nGo visit one of the leading art museums in the southeastern US.",
  "The museum collection itself isn't that impressive. Not many pieces of art for a museum in a city as large as Atlanta. The admissions desk seemed to only consist of teenagers and all of them had rotten attitudes. One was on her cell phone as people were in her line. Another did not look up from his screen and asked \"what is it?\" before I started to approach the ticket counter. When I told him how many tickets I wanted he stretched his hand out and said, \"let's go, pay it.\" I really don't appreciate being rushed and the attitude, when I told this kid that I didn't like his tone, he began swearing- in front of my children. Spoke to a manager and she dismissed the problem, claimed no misbehavior occurred on the part of her staff, unfortunately she appeared younger than the kid behind the desk. She seemed irritated that a paying guest brought up a complaint, told my family \"if we don't like the customer service\" we should \"apply to work there\" followed by her laughing and walking away. Made the experience worse when we toured the museum and saw how small the collection really is. When the workers at the museum are disrespectful towards you, email Kristie Benson Swink at \nKristie.Benson@high.org. When she ignores your email, bring the matter to the Georgia Attorney General's Office and make them aware. It's safe to say that customer service is not their forte.",
  "Very nice collection, including worthy European and American art, and exceptional travelling exhibits, like the recent Yayoi Kusama exhibit. A copy of Rodin's The Shade is displayed outside--a gift from the French government to memorialize those who lost their lives in the Orly plane crash. The main building architect won the Pritzker Architecture Prize, and the addition was designed by Renzo Piano, who also designed Paris' Pompidou Center and Whitney Museum.",
  "After running up the cards traveling far away, I had to stay near home for awhile.  So I purchased a membership to, \"The High\".  It is one of my favorite places in the city to kill a few hours.  I must say that some of the art in this place, does not move me in any way.  But when they have special presentations and exhibits, it is a nice place to be.  \n\nWas there recently trying out a new lens on my camera (they don't mind you photographing the art, as long as you don't use a flash or impede traffic with a tripod).  In fact, they encourage photographs.  I only had a little time to spend so, I mainly stayed in the area with the statues, so I could check out the depth of field of my new lens.  See some photographs attached of what I saw.\n\nThe HIGH is in mid-town Atlanta  on Peachtree Street.  There is parking in the garage in back (although I prefer the street parking) on Peachtree St.  Note, though that the agency Atlanta uses for passing out tickets is notorious and they will come out of 'thin air' to get you, even if you are just a minute late.  One exception!  There is a church next to the museum.  On Sunday after the church service, parking is free in front of that church.  Other than that, set your timer before getting lost in time, in the museum.  \n\nAgain I was testing out shallow depth of field and the statues with background worked best for my little project.",
  "After finding the entrance to the museum, which was a bit difficult, we spent the afternoon in the modern, clean and well-kept museum. The staff was friendly and although the complex consists of multiple buildings, the facility was wheelchair friendly. I pushed my mother in a wheelchair and we had no real issues seeing the art and traveling through the different galleries. A combination of ramps and elevators enabled us to see everything. I was not personally overwhelmed by any of the permanent art or special exhibits but enjoyed the day. There is a lovely gift shop near the entrance and a basic cafe located on the lower level. ",
  "After visiting numerous art museums, we were anxious to see what Atlanta had to offer.  Frankly, we were disappointed.  The building is beautiful but hard to navigate.  The entrance is a bit difficult to find, and the museum has multiple, joined buildings which do not allow access from building to building on every floor.  One has to really use the map and plan your visit in order to see everything.  That said, the quality of the art was OK, but not stellar; lesser works of known artists and collections that were not that compelling."
 ]
},{
 "name": "Delta Flight Museum",
 "address": "1060 Delta Blvd Bldg. B, Dept. 914",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/c3/7d/7c/img-20180922-162840006.jpg",
 "tags": [
  "history",
  "history",
  "walking",
  "cheap",
  "history",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d6781080-Reviews-Delta_Flight_Museum-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Had a day layover in ATL and as an aviation worker i thought it would be fit to visit the DL museum. I was blown away by the displays and history the building contained. If you have time during any visit  to ATL, I would highly recommend you stop by.",
  "19 of of us from our churches Adult Ministries made the trip to the museum today. We all enjoyed the visit. It was very interesting, great history. Lot's of walking so be prepared . If you have never been in  747 now is your chance. So much to see ",
  "It was a great experience to fly B737-200 at the Flight Simulator at this museum.\nThe instructor gave me 5 different approaches into ATL, HNL, DCA, LGA, and JFK and the hardest landing was DCA for me. It isn't cheap to fly for this simulator but if you are aviator or you are interested in aviation, I highly recommend you to try to fly a jet and land on the runway safely!\nBoeing 747-400 display is a must to visit while you are at the museum. You will be amazed to see how big this plane is and the technology that used to make our air travel safe, comfortable, and possible!",
  "My son and I love planes. My father worked 25 years for Eastern Airlines before they went bankrupt. I worked for them for a shirt while. I grew my love for planes and learned about airlines and their history. My son loves his daddy and is as enamored as his dad. We have traveled with him by air since he was 6 weeks old. We trace mainly on narrow body planes and have yet to travel on a wide body. He was able to see the 747-400 on display and it was amazing to him. We both had a great time looking at the ✈️ s. Was a little disappointed with the $25 to get in $15 and $10. If my wife and sister in law had gone it would have been another $30. But everything inATL cost money. If you have a large family, you may consider another activity.",
  "The museum is excellent.  The Exhibits are well displayed and laid out.  Learned a lot and had fun doing it."
 ]
},{
 "name": "Center for Puppetry Arts",
 "address": "1404 Spring St NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/4d/98/15/garthim-jim-henson-s.jpg",
 "tags": [
  "learn",
  "history",
  "kids",
  "learn",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d116441-Reviews-Center_for_Puppetry_Arts-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Aside from the traveling productions, it is wonderful to see Kermit and learn how Big Bird works...after nearly 50 years, these friends are truly a part of our lives!",
  "This place brought me back to my childhood! The Him Henson exhibit is AMAZING!!! Whether you are a fan of Sesame street, The Muppets, The Dark Crystal, or Labyrinth, this museum has it all! Very informative, highly detailed, and interactive. This is one of the best museums that I have been to!",
  "I'd known about this museum for years but never visited.  Recently it was expanded and became the official home for Jim Henson's legacy and I finally visited.  Although we received a discount due to our DragonCon badges -- any attendee of that event qualifies -- we felt that even at full price, it would be worth it.  \nI've been a casual fan of Jim Henson's work for years, so the Henson \"wing\" was a pure delight, tastefully presented.  I was especially happy to see the \"Dark Crystal\" Skeksis on display, and it's pretty cool to see the actual Sesame Street muppets in person; after all, I grew up with them!  \nThe History of Worldwide Puppetry wing is also interesting, showing the evolution of puppetry over time and across the globe.  \nThen it was time for the Labyrinth exhibit.  One of Henson's crowning achievements, the movie has become legendary -- with good reason -- and this special display didn't disappoint.  I don't know when it will be taken down, but it would be hard to top it.  \nMy only complaint -- and not worth any reduction in the rating -- is that sometimes the glass displays made it tricky to get a good photograph without getting reflections from the glass.  This is probably something that can't be helped.  Otherwise, it was a great visit.\nParents, if you bring your kids to this museum, you might want to have them watch some of Henson's classics, like Labyrinth, The Dark Crystal, Fraggle Rock or some Muppets or Sesame Street material beforehand, as it will probably enhance their experience...and maybe yours.",
  "What a wonderful place to take children of all ages! The Center for Puppetry Arts puts on fabulous puppet shows that delight all; even adults. The staff of puppeteers are amazing. Saw “Stella Luna” today with my 3 young grandchildren and they loved it. So did I!  Afterwards we attended a workshop where they were able to make their own Stella Luna puppet out of cardboard. Upon leaving we were able to purchase puppets at the gift shop. \nA membership to this Atlanta city gem is well worth the fee!",
  "I had mentioned this museum to my boyfriend on our trip to Atlanta. Although it was not a priority, it ended up being one of my favorite sights. However, be warned - this museum is definitely catered to children but is great for any curious adult wanting to learn more or relieve some childhood nostalgia. \n\nThey even have a special exhibit right now on the dark crystal. Definitely an underrated amenity in Atlanta!",
  "What a fun museum. The Jim Henson exhibit was great. Brought back a lot of childhood memories.  Also saw a puppet show which was really well done.  ",
  "As a fan of the Muppets and The Dark Crystal, I enjoyed my every moment in the Center for Puppetry Arts. (Well, I didn't spend much time in the \"International Puppets\" section.)\n\nIf you grew up with the Muppets and Sesame Street, you'll enjoy meeting your friends again. And if you remember The Dark Crystal (now being remade for Netflix), you'll enjoy its side exhibit, too.\n\nI only had an hour before closing time and it wasn't enough time for me to appreciate everything on offer.",
  "I had seen others talk about this place and wanted to check it out for myself. Driving up, please note that there is def. limited parking. This is especially the case if there are any school groups visit. The neighbor I was not quite sure about and driving by the building looked a little small. HOWEVER, when one gets inside there is a pleasant surprise. Though I personally only visited the museum proper (where is there is also puppet making and theatre productions), it is worth the cost at the door. I love that the international side covering everything Comedy d'Arte to shadow puppets from the East. They also have prototypes of The Lion King Puppets from the Broadway show and representations from Punch and Judy shows. The other side though was my favorite--the Jim Henson collection. It was so wonderful to see (and have children around me react) to Big Bird, Pigs in Space, Doozers, Dog from Storytime, and so much more. Take note that Jim Henson's daughter worked with the Center to get his collection just right. I could seen more, and maybe one day they will rotate or add, but overall the Center for Puppetry Arts is a great visit and asset to the community. "
 ]
},{
 "name": "Buckhead",
 "address": "3060 Peachtree Rd NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/cf/22/83/buckhead.jpg",
 "tags": [
  "food",
  "history",
  "food",
  "walking",
  "food",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d126945-Reviews-Buckhead-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful area to live & fantastic shopping stores including indoor & outdoor malls, look for restaurants you will find some of the best food you ever have eaten.",
  "Great area north of Atlanta, Lenox Mall and Phipps Plaza are two great shopping destinations. Great restaurants for any occasion, we love Houston's.",
  "I like Buckhead.  I go there to shop and dine fairly often.  I drive through every Spring just to see the beautiful flowers.  Plus I just like driving through that area.  It has something for everyone.  Traffic is traffic.  Don't let it stop you.  Having worked in that area of Atlanta, I am quite fond of it.  Some highlights of Buckhead are Phipps Plaza (great movie theater there!), great lunch and dinner spots, fine dining featuring locally sourced foods, pretty flowers!",
  "Buckhead is an affluent, actually the most affluent, area in Atlanta - it isn't exactly small, spanning the northern fifth of the city more or less, and encompassing over 40 distinct neighborhoods with their own individual personalities. There is plenty of high-end shopping here, including two big malls, Lenox Square and Phipps Plaza (the latter housing a Legoland amusement center with 4D films and a variety of Lego related stuff), plus many smaller shopping centers and standalone stores - combined some 1500 individual retail establishments in all. There are also restaurants by the score - again running the gambit from fast food to the breathtakingly expensive. Frankly one of our essential stops is Henri's bakery and deli - great for danish and especially flaky cheese bennies in the morning.\n\nIf shopping and eating aren't enough, there is the fantastic Atlanta History Center which will fill in the visitor on the history of not just Atlanta, but also Georgia and the South in general. This is truly a must see for anyone remotely interested in the Civil War, particularly with the recent addition of the Battle of Atlanta cyclorama. If military history isn't appealing, then maybe the history of the south's favorite food barbecue, Southern arts and crafts, golfing legend Bobby Jones, or various other topics covered will. If nothing else, one can escape the rampant consumerism for a while and just have a rest in the formal gardens. The History Center is located on West Paces Ferry Road - this street happens to have some of the most impressive mansions in the city, even the governor's house is here (but is by no means the biggest), so just driving down the road can be eye opening.\n\nTraffic and parking particularly in the area the major shopping areas can be a problem, particularly in the evenings and on weekends, as it seems most of Atlanta comes here to partake of the various activities here.",
  "Lots of restaurants, shops, close to transit. Many areas for walking, very safe, day or night. It all seems to be on, or close to Peachtree. very quiet on the weekends, as this is the business district. ",
  "First, Buckhead is great.  All the shops and restaurants you would ever want.  However, it is very expensive, so be prepared to spend some money.  The mall is one of the best anywhere and there are all the luxury hotels you would expect.  We enjoy the Westin in Buckhead and its convenient location.  Definitely a great part of town to stay with everything nearby.",
  "Chock full of bars, restaurants and shopping opportunities. Better environs than downtown, though at times--often weekends- it's invaded by the urban crowd and amateur partiers. Oh-and, it has some of the most expensive real estate in the South.",
  "Buckhead is one of Atlanta's commercial hot spots. Here you'll find the city's most upscale shopping, along with a mix of dining options. I come to this ever changing area a lot. There's always something new going up or opening.\n\nIn terms of shopping, the main draws for me are Lenox Square, Phipps Plaza, Whole Foods and Trader Joe's. Lenox and Phipps are Atlanta's best upscape shopping centers. There's quite a number of good restaurants and bars in the area.  Season's 52, Tuk Tuk and True Food Kitchen I enjoyed.\n\nBuckhead also has many fine hotels. \n\nMuch to see and do in this upscale Atlanta neighborhood.",
  "First time eating at Vinny's the ingredents were very fresh, most toppings i have seen on a pizza. A great go to if you are in the mood for some pizza!",
  "Want shop and dine come on over. \n\nPlenty of shops and dining places to come enjoy.\n\nTraffic and parking are an issue but once settled in. \nTake your time. \n\nShop, eat, and repeat. \n\nPlenty of actractions for the young and old.",
  "Luxury mall, Phipps, has many options for shopping and Lenox Mall is large enough to accommodate any shopper...including tasty retaurants and plenty of parking!\nSeveral hotels are in the area as well as restaurants and bars. The traffic can be heavy during the week and weekend and it dies down on Sunday!"
 ]
},{
 "name": "Little Five Points",
 "address": "299 Moreland Ave NE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/35/3f/15/little-five-points.jpg",
 "tags": [
  "cheap",
  "eat",
  "food",
  "drink",
  "walking",
  "walking",
  "walk",
  "art",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d105200-Reviews-Little_Five_Points-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "You like people watching? Strange little shops? You ever been to Fremont Street in Vegas? Well this is what I think would be the equivalent in the south. Just without the gambling.\n\nPlenty of different walks of life. A few shops, bars, and restaurants. All in about a five square block area. The Variety Playhouse is here, which was the Euclid Theater back in the 40's, and it hosts some of the best musicians and bands to come to the Atlanta area. Prices are reasonably cheap too. Check out their calendar when you come down. ",
  "Plenty of eclectic shops, restaurants and people just enjoying themselves. There is also a US Postal office located here. The parking can be a little cramped at times. ",
  "L5P is an Atlanta neighborhood I've both lived in and owned/operated a business in. So first let me reassure the people who get scared of its rep: it's never scary when the sun is shining. Middle of the night, it's a place where too many people drink too much and that can always be a rough combo. It's always hopping with students from the nearby schools and neighbors who eat at places like Corner Tavern and Yacht Club. Well worth checking out if you're trying to get a sense of Atlanta. It pairs super well with Inman Park, it's more gentrified neighboring neighborhood. Suggest parking in Inman Park at that central garage across from Savi, a food market, and walking into L5P for the sheer people watching. Grab a beer at Porter and enjoy the show.",
  "Really overrated area with overpriced second hand and thrift shops (think $35 for an old faded and worn out floral dress from the 80s I can’t picture anyone wearing). Felt uncomfortable and out of place walking around in regular jeans and sweater - streets are filled with homeless people, drunks and drug addicts. I felt bad for the poor dogs on the streets with them. I really couldn’t get out of here quick enough and back into one of the many much nicer neighborhoods in Atlanta. Loved other areas like Buckhead, Downtown, Old Fourth Ward, Highland Walk and Inman Park but Little Five Points not so much. Don’t waste your time!",
  "This is about as hipster as it gets in Atlanta! There are tons of great shops and all the cool and hipster things to do. Lots of small businesses to support, fun concerts at Variety Playhouse, and the Vortex burgers are amazing. ",
  "Wow, lot’s of art, lots of cute shops, felt like I was at woodstock, great memories provoked of times past. Would go again",
  "You like people watching? Strange little shops? You ever been to Fremont Street in Vegas? Well this is what I think would be the equivalent in the south. Just without the gambling.\n\nPlenty of different walks of life. A few shops, bars, and restaurants. All in about a five square block area. The Variety Playhouse is here, which was the Euclid Theater back in the 40's, and it hosts some of the best musicians and bands to come to the Atlanta area. Prices are reasonably cheap too. Check out their calendar when you come down. ",
  "Eclectic little place with one of a kind shops and boutiques. Great variety of restaurants and entertainment. A true must see when in Atlanta"
 ]
},{
 "name": "The King Center",
 "address": "449 Auburn Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/c8/88/9e/mlk-jr-and-wife-s-burial.jpg",
 "tags": [
  "walk",
  "tour",
  "free",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d778964-Reviews-The_King_Center-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I enjoyed my visit and it was very inspirational. I learned a lot  from the museum,loved the garden with quotes from school aged children, the memorial, Dr. King's home and the church where he preached. Everything is set in a somewhat of residential area. I walked from Peachtree Center (it seemed close on the map) , you are much better off taking the modern streetcar for $1.00 each way. It is a bit of a walk, I was visiting and did not have a car since we were \"in the city\", I relied on waking and public transportation. I learned about the streetcar from  a museum employee. It is diagonally across from the church. Don't miss  the memorial, it is definitely worth the visit !",
  "Did a lot in the three days we where her so let’s begin, can’t believe this is a free tour but donations are accepted lots of people come and go in this center, like to say thanks to all the employees that keeps up the center for our educational experience. Parking is also free,it was a emotional and spiritual moment for me to see the wagon that carried what looks to be the second greatest man that walked this earth in my opinion,Great experience.",
  "This is very close to the Museum and Ebenezer church so it is definitely worth a visit. This is where Martin Luther King Jr and his wife are buried.",
  "We were I overwhelmed by the feelings of peace and hope that this place communicates through the fountain, gardens, wall wisdom and chapel. And the staff is upbeat and friendly. ",
  "It's worth a visit when in Atlanta.  Very humbling experience, informative and educational. Bring good walking shoes and an umbrella in case of rain. Memorial and other sightings are outdoor attractions.",
  "Great memorials and messages of MLKs life and Atlanta neighborhood.  A nice combination of federal and private facilities, including The Ebenezer Baptist Church he pastored and the house in which he was born and raised.  The mausoleum, reflecting pool and eternal flame with his recorded messages playing in the Plaza are touching and emotional.  A must see if you are interested in civil rights.  See pictures.",
  "Reminded of two (2) people divinely coming together as one, who did life together. As I inhaled and exhaled, I am reminded of the many sacrifices made so I can enjoy many rights I now experience.  I too must do my part.",
  "The history and importance of the life and death of Martin Luther King was emotionally very powerful. He was a true American hero. I implore all young people to visit. It will give them proper perspective of what real racism and degradation is and was."
 ]
},{
 "name": "Atlanta BeltLine Eastside Trail",
 "address": "10th Street and Monroe Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/9c/4d/69/photo0jpg.jpg",
 "tags": [
  "music",
  "walk",
  "food",
  "art",
  "walking",
  "art",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d5577449-Reviews-Atlanta_BeltLine_Eastside_Trail-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you're in Atlanta and want a taste of art, culture, diversity, and food, walk the belt line. This place was vibrant this past Saturday with music under the connector bridge and dancing skaters. Down the line were other musicians. There were people walking dogs, riding bikes, skating, and running. You can also grab food, beverages, and people watch. This line connects you to the city.",
  "Nice concept, somewhat flawed by the presence presence of scary looking people and lack of grooming . ",
  "We had not long arrived in Atlanta from Tampa for a long weekend. Needed to get out from our AirBnB apartment and start enjoying our stay. The GPS took us to the car park next to the  New Realm Brewing Company. It was about 5.30ish. This pathway is clearly laid out and well used, dog walkers, after work walkers and joggers as well as cyclist cross each other’s paths. \nWe walked for an hour or so stopping to take in the many sights,  sounds, green havens and art work under the flyover also dodging the cyclist who gave no consideration for those on foot. Who come first  pedestrians or the cyclist ? \nAn excellent location for a leisurely walk or something more challenging. As dusk fell the neon lights of Atlanta appeared giving us some beautiful photos of the skyline.",
  "What a nice place to enjoy the outdoors.\n\nThe beltline is a great idea and there were plenty of people enjoying it. \n\nThere are nice views and even some flying wildlife. \nThere were some hawks on the trees next to the beltline. \n\nAwesome. ",
  "We took a walk along the beltline on a visit in December and had a great time seeing all it has to offer in the way of convenience to locals and visitors alike. Easy to follow and go on and off - great services attached."
 ]
},{
 "name": "Swan House",
 "address": "130 W Paces Ferry Rd NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/94/94/7a/swan-house-is-beautiful.jpg",
 "tags": [
  "walk",
  "history",
  "tour",
  "historic",
  "art",
  "food",
  "walk",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d257375-Reviews-Swan_House-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our group recently hosted a 4-hour private event for about 40 ladies, downstairs in the Bellenita Room. We had the Swan's Favorite luncheon. The classic chicken salad, frozen fruit salad, and cheese straws were enjoyed by all, as was the French silk meringue swan. The wait staff was pleasant, helpful, and efficient. We used their sound system for our speaker. The most popular part of the entire day was the delightful gift shop on the main floor! The majority of ladies left carrying shopping bags! \n",
  "We are local and have enjoyed touring the Swan House with guided tours as well as opportunities to wonder through this beautiful mansion on our own.  This has been a real treat for our out-of-town guests who enjoy the opportunity to view an incredible mansion from the early 1900's that has been well maintained.  Plan to spend some additional time wondering the grounds of the property with great picture opportunities.  Plan ahead and have lunch early at the nearby Coach House Restaurant, just a short walk, and the original coach house for the property. (The Coach House fills-up quickly).",
  "After visiting dozens of antebellum plantation houses throughout the South, a tour of Swan House quickly brings you to the realization that the landed gentry lived very high on the hog in the 1930s, too. Swan House, located at 130 West Paces Ferry Northwest in Atlanta, Georgia, was built in 1928 for Edward and Emily Inman, who had built a sizable fortune from cotton brokerage and investments in transportation, banking and real estate. It was constructed on a 28-acre parcel of land in Buckhead, a north suburb that has emerged as Atlanta's Wall Street and Beverly Hills in the last 20 years. The Inmans commissioned noted architects and designers to build their Renaissance Revival mansion with a Classical approach on the main facade, terraced gardens, a fountain cascading down the hillside and sculpted or painted swans throughout the house and grounds. The house and grounds were acquired by the Atlanta Historical Society in 1966 and is maintained as part of the Atlanta History Center as a 1920s and 1930s historic house museum with many of the Inmans' original furnishings and artifacts, including an extensive porcelain collection. A $5.4 million restoration was completed in 2004.",
  "Beautiful site, Incredible service, spectacular food ... wheelchair accessible ... nice art museum and local product store on site as well ... nice walk around the gardens",
  "Wev stopped for lunch with friends and found a real gem of a place at the Atlanta History Center. Great service, wonderful food, and old Southern elegance and charm. Don't miss their specialty: chicken curry salad. The best!",
  "The grounds are really special.\nMay events go on in this area.\nThe mansion is well done, and the guides re full of information.\nLove the old cars.\nA must see while in Atlanta.",
  "The Swan House is an excellent example of the Second Renaissance Revival style and represents the architectural and decorative tastes of affluent citizens in the late 1920s. Built by Edward and Emily Inman, heirs to a cotton brokerage fortune, the house was designed by well-known Atlanta architect Philip Trammell Schutze in 1928 and decorated by Ruby Ross Woods of New York. Swan House and its gardens are together considered Shutze's finest residential work, in which he adapted Italian and English classical styles to accommodate 20th-century living.\n",
  "This is the place they filmed the Hunger Games. The grounds are amazing. I had a fantasic time and it's amazing how it is hidden in the city. I highly recommend."
 ]
},{
 "name": "Oakland Cemetery",
 "address": "248 Oakland Ave SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/1c/10/b3/plants-and-moselem-this.jpg",
 "tags": [
  "history",
  "tour",
  "history",
  "tour",
  "free",
  "history",
  "walking",
  "tour",
  "walking",
  "family",
  "history",
  "tour",
  "history",
  "history",
  "walking",
  "tour",
  "walk",
  "history",
  "history",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d144318-Reviews-Oakland_Cemetery-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I like old cemeteries, bc I love history and I'm a geek, but this one is pretty cool even for regular people.. Margaret Mitchell is buried here and a whole lot of other people..and it's very South. Graves of known and unknown confederate soldiers (no matter what you believe, it's still a part of history) and graves of African American slaves and the Jewish section shows you exactly how far we've come. So much to see!",
  "No matter what your interest, you will find a story among the architectural grandeur of headstones.  From Bobby Jones, Margaret Mitchell, to the graves of unknown Confederate soldiers, train crewmen from the Great Locomotive Chase, into present day Atlanta with Maynard Jackson’s impressive memorial, this is hallowed ground!   This is a beautifully kept and managed facility.  There are special events year round...check the schedule for a tour or just explore on your on!   You will not be disappointed!!",
  "This is not only a terrific cemetery but also has the bonus of an awesome view of downtown Atlanta.  The setting for the thousands of souls buried here is amazingly beautiful and peaceful with dozens of gigantic magnolia and oak trees throughout the grounds. \nMany Georgian notables' final resting places such Bobby Jones and Margaret Mitchell are found here along with a sizeable confederate section. \nWell worth a visit!",
  "Interesting \"living\" cemetery.  Paved walkways, beautiful trees and flowers.  free parking is convenient just outside the cemetery.  It is possible to drive through the cemetery's narrow roads but parking can be limited.  Many walkers and photographers, a segway tour. Keep in mind this is a quiet and respectful place. Margaret Mitchell is buried here as well as other well known to Atlanta's history.  Many sitting areas along the way.",
  "Through my travels I've learned to love local history in all of its forms, but I'm particularly drawn to the stories and beauty of cemeteries; Oakland is another favorite chapter in my travel-story and I'm so glad I stopped by during a weekend in Atlanta.\n\nThe grounds are fairly large and easily accessible; I walked from the MLK birth home, about 20 minutes, and grabbed lunch at a coffee shop / bakery across the street (a newly gentrified neighborhood--it seemed--with some fun little spots for lunch / dinner).  I took the 90 minute overview tour, and my only regret is that I wasn't there for the specialty tours, too (check out the schedule online, there are some fun themes!).   Hans kept a good pace on the tour, which ended around 2 hours rather than 90 minutes, and he did a nice job of mixing Atlanta history with symbolisms, stories, and personal details.\n\nWe covered a lot of ground in two hours, but of course there was so much more to see while I wandered around myself after the tour ended.  Wear good walking shoes and sunscreen, and bring your camera.\n\nHighly recommend.",
  "We visited Oakland Cemetery with family to find the gravesite of a great-great-grandfather that fought in the Civil War.  It was very interesting searching for the gravesite and while doing so finding so many other gravesites of important people that are buried there -- Margaret Mitchell, Ivan Allen, Bobby Jones.  The Visitor Center was very helpful and provided a map of the cemetery, so it was easier to locate the sites.  There is a lot of walking entailed, so be sure to wear comfortable shoes when visiting.",
  "We walked here from downtown although there is the King Memorial Transit station located right by. The Cemetery was peaceful and clean and was very interesting to explore. We weren't on any sort of tour so we just wondered around, perhaps it would've been more rewarding had we been on a tour. Some of the graves are spectacular and the location is full of history. It wasn't my first choice of attraction in Atlanta but I would suggest visiting if you enjoy historical places, or just simply if you want somewhere peaceful to stroll around.",
  "Read up on this cemetary to understand its history and to recognize many of the important historical figures buried there.  Some very ornate statues and vaults can be seen on the meandering roads through the cemetery located close to downtown Atlanta.",
  "As a middle-aged, native Atlantan, it's surprising that I was past 50 before I ever actually visited this cemetery, despite driving past it endless times.\nYou can look at photos online, but what I found intriguing was, of course, the history and weathering of the place... but also the small-scale architectures, the flora, and the urbanized layout of the \"streets' of the cemetery.\nWould recommend booking a walking tour.\nLots of dining opportunities just across the street and an easy walk from MARTA.",
  "I like old cemeteries, bc I love history and I'm a geek, but this one is pretty cool even for regular people.. Margaret Mitchell is buried here and a whole lot of other people..and it's very South. Graves of known and unknown confederate soldiers (no matter what you believe, it's still a part of history) and graves of African American slaves and the Jewish section shows you exactly how far we've come. So much to see!",
  "Sounds a bit weird, but they have artsy pop-up events here, a ghost tour, and other attractions that one would ask \"really? in a grave yard?\"\n\nBut oh is it worth it. Even when they have nothing planned there. Just to take a walk through it and see some of the most unbelievable vaults, mausoleums, and head stones. Some pretty famous folks are laid to rest here too so all you history buffs will dig it.\n\nAnd although the general neighborhood that it's in is going through some major changes (all for the good) I'd steer clear of it after sundown unless you're taking the Ghost Tour."
 ]
},{
 "name": "Fernbank",
 "address": "767 Clifton Rd NE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/2f/77/b2/the-dinosaur-plaza-at.jpg",
 "tags": [
  "kids",
  "walk",
  "educate",
  "structure",
  "active",
  "history",
  "theatre",
  "history",
  "history",
  "kids",
  "kids",
  "walk",
  "family",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d103499-Reviews-Fernbank-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was a great combination of indoor activities with the exhibits and imax movie options and the Fernbank Forest as an amazing outdoor outing with plenty of activities for kids. ",
  "Fernbank Natural Science Museum satisfies visitors in all seasons and weathers. The central structure is almost worth the visit in itself. The three-story atrium houses two enormous dinosaur skeleton replicas plus several overhead flyers. A third of its wall is open to a view of Fernbank Forest. The floors and stairs display embedded fossils. The expansive space lifts the spirit and opens the mind to the wonders of natural history.\n\nThe bottom floor houses a café, the current special exhibit, and an exquisite shell collection. It also opens onto a deck and entrance to the new Fernbank Forest walkway and outdoor experiential exhibits.\n\nThe middle floor showcases the gift shop and the Georgia Walk through Time exhibit. The Imax Theatre, which takes up all three floors, has an entrance here.\n\nThird floor hosts the science exploratory center (how big a bubble can you create), an exhibit correlating dress and adornment with culture, and the children’s adventure area.\n\nThe outdoor area is newly expanded with wheelchair-friendly walkways, active exploratory stations, and artisticly interesting structures.\n\nIf you are new to Fernbank, you’ll have plenty to entertain and educate you whenever you go. If you are a frequent visitor (good membership value), call to check the status of the current exhibit to make sure you’re not between exhibits",
  "I am a big ol' dinosaur nerd and love natural history museums so I had a FABULOUS time here! This was a last minute, unplanned stop when it appeared on Trip Advisor as something near us and boy am I glad we stopped! I was disappointed the dinosaur displays weren't real bones but it's still fantastic fun to look at and the museum is impressive in its collection and history.",
  "Fernbank is a great natural history museum. The collection covers three floors and a good amount of square footage. The top floor os largely inactive things for kids. The second has the natural history part. The first floor has a special rotating collection (the senses during our vist). Vast walkways outside with great play area for the kids. Awesome spot.",
  "Very interesting museum with friendly staff and reasonable admission prices. Had a lot of fun and would definitely return!",
  "If you have kids this is an awesome place to visit.  The dinosaurs on display are amazing at the size/scale of the T-Rex and Brontosaurus.  Nice science walk platform around the outside with plenty of things to keep your kids interested.",
  "The Fernbank is interesting and informative. The exhibits are well designed.  The exhibits are very life like.\n20 Seniors found it interesting and enjoyed the realism of the exhibits",
  "Good activity for the entire family. I recommend being there when it opens if you want to get parking nearby. Two adults and one child will set you back $83.00 for the museum and a 3D movie. I would plan three to four hours as you can go at your own pace. There are many exhibits and you can also do a half mile nature walk.  Make sure to do the top floor if you have children under 8. I can recommend this activity and will return again."
 ]
},{
 "name": "Ebenezer Baptist Church of Atlanta",
 "address": "407 Auburn Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/38/aa/b8/ebenezer-baptist-church.jpg",
 "tags": [
  "history",
  "historic",
  "free",
  "walk",
  "historic",
  "family",
  "walking",
  "historic",
  "history",
  "walk",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d102789-Reviews-Ebenezer_Baptist_Church_of_Atlanta-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "An easy Atlanta streetcar ride from the Peachtree area to the King Historic District stop.  Free admission (donations appreciated) and you do have to take the stairs to move around. Pause to hear Dr. King Jr.'s sermon(s) and head down the basement for more details about the family's history with the church. I stayed a bit longer but a 15-minute visit is ok if you're in a rush.   \n\nThe Sweet Auburn neighborhood has seen better days but time in half a day if you can. Walk the length of Auburn Ave. from MLK Jr.'s birthplace, Fire Station #6, King Center, Ebenezer Church, Royal Peacock Club, S.C.L.C. building, Apex Museum, ++ and soak in an unforgettable trip.",
  "We went to both the historical Ebenezer Baptist Church and the new one that has the sails roof. The historic one fills you with such awe...Martin Luther King followed his father's and maternal grandfather's footsteps in preaching in this beautiful brick church. The sanctuary is filled with light through the stained glass windows, and the feelingof momentous events overcomes you in this place.",
  "Ebenezer Baptist Church is the location where the Reverend Dr. Martin Luther King's father and grandfather presided over the congregation since the late 1800's. \nThe US National Park Service has done a great job in restoring this house of worship to its original feel when the King Family held mass and delivered sermons from the pulpit. ",
  "Walking in during an audio broadcast of one of Reverend King’s  sermons, we instantly were immersed in the moment. We sat in a pew, head bowed and ears and soul open. Tears welled up at the feeling of his words and it was as if we were there at the time. Thank you for continuing to share his profound wisdom and humanness with visitors. ",
  "Visiting this church will change your life! To see the actual pulpit where Dr. King preached from, to kneel in the pews that his congregation knelt in was the highlight of my trip to Atlanta. They have historic sermons playing inside the church which made it even more memorable. \nThe staff were very helpful. Clean bathrooms! \nI took the subway train and walked to the area. I made an afternoon of visiting area by going to the MLK National Historic Park and visitors center, visited the church, and then went to the cemetery by the train station. Signs everywhere ask tourists to not give money to the panhandlers, and there were quite a few. I tried to stop in a bodega for a soda, big mistake, very scary. \nVisiting Ebenezer is absolutely worth the time and will make a trip to Atlanta more memorable!",
  "We attended a Sunday church service as a group. It was a very moving experience. The people were very warm and welcoming. We then walked across the street to the original church where Martin Luther Kings father and grandfather preached. Coretta & Martin Luther King are also laid to rest here. It’s a very peaceful memorial. This is a very moving site. ",
  "Connecting and being at a designated place of worship that has stood the test of time for over a century. My reverence for the Most High - The Only True and Living God was heightened as I participated in the personal walk.  I certainly appreciation the hands and hearts of the people used to make history. I am still grateful and teary eyed.",
  "Worth a visit for anyone visiting ATL who is interested in browsing the city's historic gems. This is the church where MLK Jr and his father preached. "
 ]
},{
 "name": "SKYVIEW Atlanta",
 "address": "168 Luckie St NW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/f2/6a/61/skyview-atlanta-at-twilight.jpg",
 "tags": [
  "family",
  "art",
  "music",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d4588818-Reviews-SKYVIEW_Atlanta-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Even though I live in the Atlanta area, I go ride Skyview every chance I get. Located in downtown, it give you a perfect view of the skyline, Centennial park and even far off Kennesaw mountain. I always go at sundown and that view doesn't disappoint.They always have specials on Groupon that make this activity budget friendly. The compartments are air conditioned and feel secure enough even for the most timid rider. A fun family friendly activity.",
  "Came here my wife,then girl friend, and our best friend for a simple little date night. Dark as sin outside and the lines were short. Took a nice photo and enjoyed just the simplicity of it all. Watched horse drawn carriages and street vendors do live art as we laughed and listened to music on this very large, yet smooth Ferris wheel. Tickets were reasonably priced and despite my fear of heights we had a blast. Will do again.",
  "We ride the Skyview to get a look at downtown. It was an amazing view and a fun ride. We had a great view of the park, aquarium and world of coke.",
  "Definitely go during the day and night.  Look for some specials onilne.  Parking nearby can be kind of pricey depending what else is going on nearby.  We paid $20 but it was steps away and we didn't have to walk through all the madness going on around.  View are fun, staff is great, and you will have a chance to take your picture.  They came out great and sometimes offer props, too.",
  "The Atlanta SkyView Ferris Wheel is the latest addition to Olympic Park. It’s great to see the city adding to its collection of attractions, making the ATL a prime destination for vacationers.\n\nThis sky-scraping landmark is most attractive at nighttime, lighting up the cityscape with a sea of colors.  It’s about half the size of London’s Eye in the United Kingdom, but still makes for great photos.\n\nI recommend going on a weeknight as lines are shorter and your group can most likely get its own gondola. On slower nights you may also get some bonus trips around the wheel. Each carrier features an air-con/heating system, which was really nice this past March as it was 32 degrees the night we went.  \n\nThis activity is definitely best suited for families, but could be a nice place to check out for an after-dinner activity. Glad we went, but probably something we will only do once.",
  "Look for the deal on Groupon, as it's always on there. Saves you at least $10. You go around 3 times in 15 minutes. Views are ok, but the high-rise buildings surrounding you obstruct you from the greatest of views. Uber there, take MARTA to Philips Arena Station, or go after 10pm so you can park on the street for free. More crowded on weekends.",
  "Located adjacent to Centennial Olympic Park near all of the downtown attractions.  The Skyview is a large ferris wheel offering great views of the area. I went during the day -- no lines for boarding.  It was $12.50 for seniors for about 4 rotations.  Much cheaper than London Eye!!!",
  "We enjoyed our visit to Skyview.  The views are good, but there are many other ways to get a good view of Atlanta.  If you have plenty of time, I would add it to your trip.  If you're short on time, it's not a \"must do.\"  There was no crowd when we were there, so it was worth our investment of time.",
  "A bit pricey for such a short activity, but I’m still happy I did it. The views of the city are so great. My 5 and 7 year old loved it.",
  "This was the most unexciting Ferris wheel I have ever been on. The view was boring. The speed was extremely slow. I felt like it was a waste of time. ",
  "Really enjoyed my ride on the SKYVIEW, I paid full price for a ticket at the box office and found it to be good value. Excellent views and a smooth ride. "
 ]
},{
 "name": "Lenox Square",
 "address": "3393 Peachtree Rd NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/81/e6/fc/lenox-square.jpg",
 "tags": [
  "food",
  "free",
  "structure",
  "food",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d126918-Reviews-Lenox_Square-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great mall, selection and varied types of stores i will be returning on a regular basis. Great restaurants and additional shopping in the areas surrounding the mall.",
  "This my favorite upscale mall every time I come to Atlanta. This mall is a must for first time visitors visiting Buckhead.",
  "I truly enjoyed Lenox Square, it has variety of stores from middle to high end stores as well as restaurants. Really beautiful place to visit if you are not from Atlanta. ",
  "Go early as there is much to see & absolute upscale shopping. The Metro goes out to it & it has its own station. Great dining on the premises too. ",
  "This is one of the premier malls in the country....BUT you pay because of crowds, parking hassles, traffic etc. Go anyway but leave time. VERY safe. Upscale but not snooty. Microsoft and Apple both have huge gorgeous stores for techies.Check out Tesla here. Have lunch or dinner at the new True Food Kitchens in the front of the mall (ask but make a reservation because it can be busy). Very cool. Great food. Food court on lower level is also totally fine. I agree that husbands should stay behind if you plan to make it a four hour event. You easily can. MARTA is right next door - really simple - so take it if you want to come from a downtown hotel and avoid traffic.  Otherwise, drive and just be patient. Westin, Ritz, W, Intercontinental, and Mandarin Oriental are short walks.",
  "If you want to find everything in one place in the NE area of Atlanta, this is the place to go.  There are over 250 shops under one roof (multiple floors) with a lot of variety. Macy's, Bloomingdales, J Crew, Ann Taylor, Apple, Anthropologie, Madewell, as well as well..... over 245 more.  Parking is normally convenient (and free).  Traffic at certain times (morning and afternoon in an extended rush hour period) can be heavy so allow extra time in and out.  As with any other major city mall area, be alert and wary going in and out of the mall (there are sometimes  some people hanging around the entrances.)  Macy's entrances are normally some of the less populated ones regarding people standing around, so park there if you can vs. the foodcourt entrance.  There are a lot of great restaurants very close nearby, so skip the foodcourt and catch one of those.",
  "Lenox square great shopping mall at Atlanta. Nice place to shop and hang around \nLot of fashion shops , shoes ....\n\nRestaurants as well...,",
  "Lenox Square, in busy Buckhead, has a great mix of mid-priced to high-end stores. Many of your favorite designer stores can be found here, along with department stores Bloomingdales's, Neiman Marcus and Macy's. With that said, I've never cared for the design of this mall or the confusing parking structure. Not the most user friendly. Also, the area is very congested. One nice thing about the mall is that it can be reached using MARTA. Hooray for public transportation.\n\nI'm not a regular Lenox shopper. I come here for certain stores, ones I can't find at other nearby malls. And mostly for clothing and shoes. I occasionally will eat at the mall, depending on the time I'm here. The California Pizza Kitchen and True Food Kitchen are a couple of favorites.\n\nA wonderful variety of fashionable shops.",
  "Conveniently located across the street from our hotel - opens at 11 am on Sundays. Kate Spade has left, and Bloomingdales does not have a Chanel department, but the Tory Burch has a better selection than the one at Phipps, and they’ve got an Amorino gelato!",
  "I have been a long time customer of Louis Vuitton. I could not begin to list ALL of the things I have purchased over the years . They refused to exchange a present from my husband until I made a fuss. They are pompous jerks. Manager told me he was doing me a favor by exchanging it that 1 and only time. Save time and don’t go in this store!!!!",
  "Stopped by to do some last minute winter shopping for the end of season. I was not disappointed. Footlocker and a few other stores seem to be competing on shoe sales."
 ]
},{
 "name": "Chastain Park Amphitheater",
 "address": "4469 Stella Drive Northwest",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/10/94/d9/stage.jpg",
 "tags": [
  "food",
  "eat",
  "music",
  "unique",
  "music",
  "food",
  "music",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60898-d490800-Reviews-Chastain_Park_Amphitheater-Atlanta_Georgia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Well operated venue in a terrific setting.\nA little short on bathrooms and concession lines were long but the sight lines of the stage and the sound were very good.\nIt's outdoors so be prepared for the humidity if you attend during July-September",
  "Chastain is beautiful outdoor venue.  You can bring you own food, drinks plus they have food there you can buy and pre-order to save time.\n\nIf you have never been to Chastain it is a must even if the performer(s) are not to your liken.  The venue alone is worth the experience.\n\nHere's what you need to remember:  \n\nThere is only one way in and one way out so that means there are 100's of cars and pedestrian's.  I live in the area so I know all the short cuts and it still takes us 45 mins just to 3 miles!\n\nYou can bring tables like the folding TV tables that you use to eat off of when you are watching tv.  People bring all types of decor to decorate there tables. It's a big my table is better than your table event.\n\nWhen we go we decorate our tables (we take 2 tables) with candles, table cloths, fresh fresh flowers, NO PAPER PLATE or people will laugh at you.  Everyone uses the plastic outdoor patio plates and glasses.  Just think Martha Stweart and you will be just fine.\n\nSince the theater is outside,  make sure you check the weather and pack an umbrella if needed.  The concert will go on rain or shine so unless you want to leave if it rain, pack what you need.",
  "  Bring a picnic dinner and enjoy the show.  Shows happen rain or shine, so if the weather is not cooperating - bring a rain poncho and umbrella to stay dry.   ",
  "I forgot how much I enjoyed going to the amphitheater. The outdoor setting, the cool breeze blowing and the music made for a great evening. Bring your coolers with drinks and snacks and enjoy..",
  "I have read numerous bad reviews of this place and they are all wrong. The restrooms are new and clean, the crowd was respectful of the performers, the seating has generous space, and the atmosphere is unique and charming.\nWe went to see Chciago, yes I am that old, and the place was full. Everyone had a great time. Only complaint was with Uber getting away.",
  "The venue itself is super nice, but the parking is terrible! It took us an hour and a half to get down to the parking areas to find out we were headed back out of the venue area. All of the parking attendants were moving us on to we are out back on the main street. I  would recommend the person in charge to do better job at the parking set up.",
  "Long time Atlanta residents know there is NOTHING to beat an evening of live music under the stars at Chastain.  Recent new management has changed things a bit - not so much the fine table settings and elaborate home-prepared picnic dinners - but the food and drinks available on site do cut down on the pre-Chastain prep and the venue, recently upgraded, is better than ever.  Chastain has hosted such amazing shows in the past and the wonderful shows continue.  I favor the oldies myself.  WHO could forget Paul Simon and BOB DYLAN on the SAME BILL!  OMG multi-generational entertainment at its best.  Honestly, this is the place to be.  Is ANYBODY on the bill there that you've considered seeing?  BUY THOSE TICKETS. this place is the bomb.,",
  "Such a great spot for concerts - especially when it starts to get cooler! But this is a popular park for playground, baseball games & this live music venue so parking can quickly become insane! Carpool or just Uber if at all possible. Bring the right shoes to walk up & down the hills depending on where you can find parking. "
 ]
}]
