[
{
 "name": "Maine State Museum",
 "address": "230 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/70/27/77/maine-state-museum.jpg",
 "tags": [
  "history",
  "library",
  "history",
  "walk",
  "history",
  "free",
  "family",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d104045-Reviews-Maine_State_Museum-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is about as comprehensive as a state history museum can get. Four floors of Maine, and very well done. Between this and the Maine Historical Society in Portland, you have it covered. Very interesting.",
  "We wanted something to do on this rainy day. The Maine State Museum did not disappoint. Well stocked museum full of Maine's artifacts. Taxidermy was pretty incredible to see. Price was so reasonable and we stayed a couple of hours just mesmerized by everything. Highly recommend on a rainy day!",
  "The museum is right in the same building as the state library and archives. My wife and I were going to take a quick peak and ended up staying a little over two hours!  Great exhibits on Maine!",
  "Lots of interesting Maine history. Came up on a rainy day from Boothbay Harbor last fall, and it was well worth the drive.",
  "We came to Augusta to see this museum. It was amazing. We enjoyed our walk through the museum. So many wonderful things to see and so much history. We really enjoyed our visit. The museum is $3 and worth more then that!!! We will definitely take visitors there when we have them visit us. Definitely should be on everyone's bucket list to visit. So many displays!!",
  "We visited this museum on October 16. There is a garage with free parking for visitors in Sewall Street. This is a classic state museum with information about the indigenous, early settlers, industry and how the Mainers lived.\nNo modern multimedia to consult information.",
  "This museum must rank highly on your \"bucket list\".   If your are a native and you have not taken the time to visit this facility then you can not refer to yourself as an authentic Mainiac.  Maybe a little over-stated but this museum is very much worth your time.  Take your family out on a Saturday when the weather out of doors is inclement.or cold and enjoy an educational experience learning a little about the wonderful state of your residence.  The displays have been around for decades and I/we have visited only twice in my seventy-one years and it never seems to get old.  A simply wonderful place to spend an afternoon with your young children or grand-children and give them an experience they will never forget and always be reminded of you years later when they reflect on the day of.their visit.  \n\nDon't forget,you may even learn something too! DIRIGO",
  "While we visited Augusta for Fort Western, the French and Indian site that also served Benedict Arnold and Aaron Burr during the Revolution.  Unfortunately, it was closed (restricted hours during off season).  At a local state office, someone suggested we try the Maine State Museum.  It was great, covering everything from rocks to women's sufferage.  My favorites were:  \n-- rocks and crystals from Oxford County\n-- (non-native) Irish Elk horns, compared to moose and elk\n-- taxidermied moose calf\n-- shell midden\n-- woman hand-packing sardine cans (she clipped heads and tails with scissors)\n-- many animal dioramas\nThis wonderful museum is suitable for both adults and children.  It is also inexpensive. As a senior, I paid $2 -- wow!"
 ]
},{
 "name": "State Capitol",
 "address": "State Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/fb/d9/99/state-capitol.jpg",
 "tags": [
  "historic",
  "art",
  "tour",
  "knowledgeable",
  "free",
  "free",
  "tour",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d290343-Reviews-State_Capitol-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "Oh, if this place could talk, the stories it could tell! Impressive architecture, hallowed halls, historic art, beautiful grounds! Take a self-guided tour with the help of a pamphlet at the front service kiosk, or arrange for a free guided tour with a knowledgeable guide. Time well spent!",
  "We visited this place on October 16. There is a garage with free parking for visitors in Sewall Street. There are guided tours on the hour. We had to go with a school group. The guide was very strict with the children and we had to follow the same rules. She was not very friendly when we asked questions. If you want to take pictures you need permission of the Secretary of the House. We already visited 26 State Houses but this was the first time we had to do this.\nYou can lunch in the cafe of the State House.",
  "Very informative and we learned a lot!\nCrystal did an awesome job and allowed us to ask questions.  It is a beautiful building with amazing architecture.  There are elevators if necessary. \nThe tour was free, you will need to go through security.\nWe had lunch there, after the tour.\n",
  "Very cute, but very small. We went after hours, so I don't know what traffic may be like during the day. Lovely grounds surrounding the building. ",
  "I'm fond of this building because my grandfather was the Maine state auditor for almost 30 years. His office was next to the governor's in the round rotunda on the rear."
 ]
},{
 "name": "Fort Western",
 "address": "16 Cony St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/94/a5/4f/old-fort-western.jpg",
 "tags": [
  "family",
  "tour",
  "history",
  "tour",
  "kids",
  "tour",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105315-Reviews-Fort_Western-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "We enjoyed learning about the fort and Maine history.  Our family of 5 had our own guide and tour.Guides were dressed as in the historical time period. We had a bonus: got to taste lemonade that an educational group of children made. Thought it was a little expensive for the tour however they did have a 'deal' for a family of 5 or more; so we saved a little $. Thanks for the experience :)",
  "A great place to visit for both adults and children. They have people dressed in the time period and they answer your questions as if they where in the time. ",
  "Worth a visit if you are in Augusta. Oldest fort in the country. Any repairs are done with historians and archaeologists that ensure period accuracy. Peter was an excellent tour guide and was engaging with interesting facts of what occurred during the French and Indian war. His passion came through.",
  "Looked around, school kids being toured.\nNo one spoke to us, looked around and left.  Not much to see...",
  "This fort was built in the 1700s next to the river and it looks now like it did back then. There are lots of folks here dressed up in period clothing, including soldiers, who help show what a soldier's life was like in the camp back in the day. They give guided tours, and our tour guide was very enthusiastic. I learned a lot of interesting history on the tour through the fort grounds and inside the building, though the tour did go on a little long. There is a gift shop here, and a parking lot next to it. The place also holds a variety of activities.",
  "Tour guide was extremely knowledgeable. The history of the activity at the fort was very interesting. The antique furnishings of the actual occupants were a nice segway into the period in the 18th century. Well worth the visit. ",
  "Great place to visit! Our tour guide was so informative and had so many interesting facts/stories to share! Loved it!",
  "This historic fort is very close to downtown Augusta. We weren’t able to take a tour but enjoyed seeing it from the outside. It was built in 1754, before the Declaration of Independence was written."
 ]
},{
 "name": "Viles Arboretum",
 "address": "153 Hospital St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/6f/f5/01/pine-tree-state-arboretum.jpg",
 "tags": [
  "walk",
  "learn",
  "field",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105323-Reviews-Viles_Arboretum-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is an interesting place to walk and learn more about trees and plants. There is no admission price, but they do accept donations. The staff was helpful. A brochure is available to learn more about the place. Children will like it.",
  "I grew up in windy acres and used to ride my bicycle thru wood trails to cara field to play baseball, love that area, I now 40+ years later work across the street from there",
  "Not very interesting, not very well maintained.  The hosta trail was nice, I guess.  And the price of admission was right: $0.00.",
  "A nice day spent on a relaxing walk.  We toured the trails of the arboretum and saw some wildlife, although we had hoped to see a bit more.  It was a hot hot day, that could have been a factor.  The front office area was just as interesting as the trails.  The tiny gift shop area was cute.  We will definitely go back to explore some more as we know we only saw a fraction of what the site has to offer.",
  "My husband and I took the short walk through the arboretum.  It was nice to take an afternoon walk in the woods in the middle of Augusta, but the trails were not clearly marked, the 1 mile walk was about half that long - if we actually followed it - the signage was very poor,  only the hosta area had much to look at, and there were a only a handful of antique apple trees.  Most arboretums cannot compete with the Arnold Arboretum in Boston, but that was my basis for comparison."
 ]
},{
 "name": "The Governor Hill Mansion",
 "address": "136 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/bd/ef/64/grand-facility.jpg",
 "tags": [
  "history",
  "unique",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105318-Reviews-The_Governor_Hill_Mansion-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Mansion is gorgeous. A lovely place for a conference. With very large groups and there was one meeting the second time I got there, parking was a problem. I had an appointment in an office on the third floor which are a bit dreary looking since a variety of people and agencies rent offices there. If though you are attending a function it is well worth looking around the first floor.Beautiful staircase and lovely spacious make this a lovely spot for a wedding. I don't know though whether the Mansion has a kitchen. I would have liked to know the history.   How the rich lived!",
  "If you are lucky enough to attend an event at this venue check out the original part of the building....elegance!  Great place for small the medium size gathering.",
  "A unique facility for meetings and special event. It is conveniently located in the downtown area. It offers a large parking area for guest.",
  "I attended a catered party, decor was beautiful, food spread was great as was the service. Plenty of parking and a variety of spaces.",
  "We held our annual review here for the 2nd year in a row and they did a fantastic job.  They are very easy to work with, provided us with light fare and bar.  The employees are friendly and the rooms are GORGEOUS!"
 ]
},{
 "name": "Capitol Park",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/4a/ab/f9/sun-and-shade-on-the.jpg",
 "tags": [
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105321-Reviews-Capitol_Park-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a beautiful park across the street from the Capitol. A nice place for a stroll in the middle of downtown Augusta with convenient parking.",
  "Really lovely park and well worth some time to have a look at to break up a road-trip. Easy parking. The colours of the leaves on the trees were beautiful.",
  "I went here for the purpose of getting a great view and photo of the capitol. But it is also a great park to explore around. Lots of eloquently lined benches. It is quiet, calm and very serene. You can explore different corners of the park to check out interesting monuments. Its worth a go if you're in the area.",
  "Even though it was below zero, still had to stop and take yet another photo.  If anyone goes there before it snows again, the lonely tracks in the snow across from the YMCA driveway are mine!  lol",
  "I generally walk in the park on the well groomed walking paths several times a week with my dog. The park is well maintained, not crowded even on the weekend. People can play soccer on the open lawns, read at the benches or picnic tables, there are tai chi classes that use this park. Just a lovely, under-appreciated gem across from the Capitol. Maine State Museum a short walk away, as well as the YMCA."
 ]
},{
 "name": "Augusta Civic Center",
 "address": "",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "food",
  "food",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105325-Reviews-Augusta_Civic_Center-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "Have been here several times for different events from food shows to gun shows.  Easy to get to, adequate parking, concessions and clean bathrooms.  ",
  "This is a full service Civic Center just off Interstate 95.  Serves as the home court for U-Maine Augusta basketball.  Also serves as class room space for the college.  Saw some great concerts there back in the day including Springsteen, Elvis and Chicago.  A good boat and sporting show each spring.  Also home for High School state basketball tournament",
  "We were stall holders at a two day event here. The space is huge and it was very well designed for booths and food.",
  "Every year it's one of the high school basket ball venues. Seats are comfortable, food is fine something for everything. Staff is nice. What more can you say",
  "I visited for a business convention. It has clean facilities and the food provided was decent. I've been there for concerts and basketball tournaments. They hold a decent number of people and seem to have enough parking for most events. It is close to the highway, several restaurants, stores and hotels."
 ]
},{
 "name": "State House",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/f1/a8/be/maine-state-capitol-building.jpg",
 "tags": [
  "kids",
  "free",
  "walk",
  "tour",
  "kids",
  "tour",
  "library",
  "knowledgeable",
  "food",
  "kids",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105316-Reviews-State_House-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "Spent a day watching our legislators hard at work. Fascinating to watch the dynamics of the goings on as our leadership helps to shape the lives of the citizens of our state. Very inspiring day for the kids.",
  "Originally by Bulfinch the Capitol has portraits of all Governors, Hall of Flags, House and Senate Chambers.  Free tours are very interesting and Legislators in Action (relative term) can be seen from January to June (odd numbered years) or March (even numbered years)",
  "The building was closed when we arrived so we were only able to view the building from the outside. It has a large dome, which may have been made of copper.",
  "Road trip!  Our 24th State Capitol. We arrived at 8:15 to walk around a few minutes before the first tour at 9:00. When got back to the tour desk a few minutes before 9:00 the tour person very rudely told us that she didn’t have room for us because she had a bunch of school children there and all of the tours were full. We asked if we could tag along with one of the school groups (as we have done in a few other Capitols) and again she very rudely told us no. Turns out other Capitol employees already knew that this woman is less than polite to Capitol visitors based on their comments to us and even apologized for her behavior. Be prepared!\nBe sure to visit the tunnel between the Capitol and their office building to see the wildlife exhibits.",
  "Spent a day watching our legislators hard at work. Fascinating to watch the dynamics of the goings on as our leadership helps to shape the lives of the citizens of our state. Very inspiring day for the kids.",
  "First a couple tips for your visit here: 1) the entrance is at the back of the Capitol building not up the front stairs\n2) tours are on the hour 9-12 but if you miss that you may be able to arrange a shorter tour if the on the hour tour didn't take place. We did this and the guide was sooo accommodating and informative, knowledgeable, personable and funny.\n\nVery interesting to hear about how the state government functions. Quite different from many other states. It's the only state that has always had Native American Tribal representatives. All committees have representatives from the Senate as well as the House. When a vote is cast in the Senate or House you cannot leave until you have voted. And when you vote you have two choices: yes or no. There is no abstaining!\n\nAfterwards went to the gift shop for a Christmas ornament souvenir of our visit. The woman who runs the gift shop was one of the nicest people at a cash register that we have ever met.\n\nLastly, at this my 20th capitol building visit, I learned that there is a souvenir passport book that gets stamped for each capitol you visit. The great news is that in the back of the book is an address where you can request  stamps for the capitols you have visited but didn't get stamps for. Unlike the National Park Service these passports are not displayed which is very similar to the Presidential library passport (as an FYI)\n\nWorth the visit just for how lovely everyone is👍\n\n",
  "As a constituent I've been in the State House numerous times. It's a fine building and for visitors, a remarkable opportunity to see this state's convening of constituents and neighbors taking on the really massive challenge of representation. The building complex is inviting as well as historic. The grounds leading down to the river are a manageable adventure especially in the summer. Exploring the halls filled with flags and offices of state leaders is a wonderful memory for kids as well as adults. Even the food service is welcoming and unpretentious. As much as media glimpses of government are discouraging, personal explorations of this State House has been inspiring."
 ]
},{
 "name": "Children's Discovery Museum",
 "address": "171 Capitol St Ste 2",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/ee/68/0f/inside.jpg",
 "tags": [
  "kids",
  "learn",
  "kids",
  "kids",
  "learn",
  "kids",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105326-Reviews-Children_s_Discovery_Museum-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent hours at hit small but activity packed \"museum\".  It is not so much a museum as a learning center for young children who get to shop, climb, slide, touch sea creatures, sit in skid-steer's, giant bird nests, huge chairs, crawl through a lighthouse, push buttons, hear animal sounds and much more. Our grandchildren ages 3 and 1 absolutely loved this place and on a rainy day it was great fun.",
  "My daughter and I had a great time at the Museum today. An excellent place for young children, and a great place to learn. It's not a very big space, but my understanding is that they want to grow it. Non the less they have a lot of displays that are all hands on for the kids. Thanks for having us!",
  "Worst place I've ever been too!\nThey have a rude teenager at the door no management on duty. Kids were left unsupervised with no adults because of the outrageous $6 per person fee!\nI don't mind paying for my children but to expect a full fee per parent and an 18 yr old sibling is a bit much. We drove 45 mins to spend a couple of hours with our 5 year old and had to leave with him in tears. It could have been an easy fix but like I mentioned before a rude teenager on duty and no management.\nDon't waste your time this is not a fun or professional environment.",
  "We spent hours at hit small but activity packed \"museum\".  It is not so much a museum as a learning center for young children who get to shop, climb, slide, touch sea creatures, sit in skid-steer's, giant bird nests, huge chairs, crawl through a lighthouse, push buttons, hear animal sounds and much more. Our grandchildren ages 3 and 1 absolutely loved this place and on a rainy day it was great fun.",
  "My daughter and I had a great time at the Museum today. An excellent place for young children, and a great place to learn. It's not a very big space, but my understanding is that they want to grow it. Non the less they have a lot of displays that are all hands on for the kids. Thanks for having us!",
  "So this is the second or third time we have been here with our now 4 year old girls. This place is not large, but they somehow remained entertained for almost 2.5 hours! We used our reciprocal museum membership which gave us 50% off admission. That made this a bargain! New exhibit of topographical sand map was really cool. Nice craft area for stickers, painting, stamps. Would suggest they add a sink in that area for cleanup. \nVerdict: great way to fill a chunk of afternoon in the winter. I am sure we will be back!",
  "I took my son here who was 12 at the time, even though this place is meant for children much younger my son presents himself much younger than he is, he did enjoy almost every aspect of the museum from the big bulldozer to the art station I would highly recommend this place to anyone with kids! We enjoyed ourselves!"
 ]
},{
 "name": "Sonny's Museum",
 "address": "228 Water St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/e6/fe/4b/photo0jpg.jpg",
 "tags": [
  "free",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d3443124-Reviews-Sonny_s_Museum-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "A lovely shop with pet birds. A realy good range of crystals at amazingly good prices. Very warm and welcoming owner.\n",
  "The owners are really nice. The prices are pretty fair and the pieces are hand made, so neat! I included a picture of my purchase for my wife and I they have many similar to it each piece is different in some way from each other. Many gems and rocks here",
  "visited place and Sonny himself gave a tour,was friendly and polite,gave my doughter a free gift and invited us back.",
  "Sonny was a great man that made this Rock shop amazing. He was full of so much information that he was always ready to dish out. We used to go once a week and he would give kids a free gem or rock he would tell them about the item they chose. He was a kind and humorous man. I hope that whoever takes over Sonny's Museum  has even half of sonny's welcoming, friendly personality.\n\nRIP",
  "You are welcomed by the 90 year old plus owner Sonny.   And it's an experience -- he makes you feel special and welcome the instant you come in and he's got tales that'll take you across space and time.   And of course, an amazing huge collection of rocks -- of all kinds -- in jewelry and out -- geodes and not, and on and on.   Well worth a visit and if you don't leave with a smile on your face and a warm feeling..."
 ]
},{
 "name": "Old Post Office",
 "address": "295 Water Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/9c/1e/b6/arches-and-pillars-closer.jpg",
 "tags": [
  "walking",
  "tour",
  "historic",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d12537865-Reviews-Old_Post_Office-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went downtown Augusta. Saw this building. Omgoodness, it is BEAUTIFUL!!!! Would love to go in side and see what it looks like. The Bartender at Cushnoc said this bldg is just a post office. What a gorgeous PO",
  "Stop by and take a picture of this beautiful architecture.  I hope they have a historical society so it can remain in tack",
  "This is a beautiful old building on historic Water Street in downtown Augusta. It is in a row of other historic buildings on the street, perfect for a walking tour.",
  "Even though I have been looking at this building for over 60 years, I still never get tired of it.  I no longer live in Augusta, but whenever I'm back, I still have to drive down Water Street (keep it one-way!!!) and look at the historic downtown, then circle back up the hill, go across the 'big bridge' and drive back down across the 'old bridge' just to look at the backs of the buildings.  It seems like just yesterday when logs were jamming the Kennebec and we actually used 'The Old Post Office' as our post office.",
  "The Old Post Office building is one of the beauties of Augusta. It has very remarkable features, including the white/grey stones used, the arches and the round tower on top."
 ]
},{
 "name": "Samantha Smith",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/c7/a3/03/the-bear-represents-both.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d105320-Reviews-Samantha_Smith-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went to the Maine State Museum. Saw this statue of Samantha Smith. What a great tribute to an amazing little girl. Our first time seeing this statue and our first time seeing Samantha Smith.",
  "It is a life sized and therefore small statue of the 10 year old.  I was literally 20 metres away photographing the Capitol and did not notice her until someone pointed her out.  In front of a wall of the museum.  There is another photo op at the \"Welcome - State of Maine\" sign beside her.",
  "I walked around the Capitol grounds looking at all the statues and memorials. This one choked me up a little. I vaguely remember this girl (I was only 2 years older than her). The accompanying plaque brought it all back to me. Awesome tribute.",
  "This statue was very neat and well maintained. The story is inspirational. You definitely should go check it out!",
  "This one has more of a symbolic meaning.  It is a good reminder of the cold war time and one little girl who was asking herself a question that many people both in US and USSR asked themselves."
 ]
},{
 "name": "Holocaust Human Rights Center of Maine",
 "address": "46 University Dr University of Maine at Augusta",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "knowledgeable",
  "family",
  "free",
  "learn",
  "knowledgeable",
  "art",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d648849-Reviews-Holocaust_Human_Rights_Center_of_Maine-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited the Holocaust and Human Rights Center today. We were very impressed with the quality of the exhibits--current one is on artifacts from the Holocaust. There are informative descriptions with each that provide a lot of information in a compact space.\nThe staff are very friendly and knowledgeable and have a passion for teaching. The center is about all forms of discrimination--LGBTQ, immigrants, other genocides. Maine is lucky to have such a resource. Highly recommended.",
  "This gem may be small, but packs a lot of information and exhibits in all of its available space. Despite the name, it does not focus only on the Jewish holocaust, but on all genocides past and present, and on prevention of future genocides. It focuses on education/presentations/exhibits on multiple issues of civil rights and its staff, mainly volunteer, are thoroughly knowledgeable, friendly, and willing to stop and teach. Most of their programs are free, or for donations only.  Many are lunch and learn. Definitely a great place to take the family. (And leave a donation)",
  "The first time my husband and I drove through Augusta, we didn't stop because we didn't realize there was anything there that was of particular interest to us. After stopping at the Maine Jewish Museum and purchasing a book, we noticed the Holocaust Center mentioned on the cover. It was a great find! So a few days later we came back through Augusta, and this time we stopped. We're so glad we did! The exhibit is small, but very nicely done. Be sure to check out the 11 minute video and the rotating art exhibit. The gentleman on staff there is incredibly nice and knowledgeable, and you can tell that he's passionate about the information they're presenting. \n\nThis little center will take up less than an hour of your day (likely closer to 30 minutes), but might well be the best thing you see in Augusta."
 ]
},{
 "name": "Marketplace at Augusta",
 "address": "197 Civic Center Dr",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d15640152-Reviews-Marketplace_at_Augusta-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "This outside mall is broken up into 3 tiers, A lower, middle and top. For folks that have never shopped there before, it's a bit confusing to navigate or find the specific stores your looking for. You must drive to each tier. "
 ]
},{
 "name": "Bond Brook Trails",
 "address": "Tall Pines Way Off Bond Brook Road",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "hike",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d10285794-Reviews-Bond_Brook_Trails-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": [
  "I would have to say that I have mixed feelings about this set of trails.  We cross-country skied and were disappointed at the way that the trails were marked.  We have hiked as well and found the trail markings to be a bit confusing.  On a positive note, the trails were fairly easy to hike and some were wide. Most of the trails seemed to be tended.  If you want to geocache, there are a few of them on the trails.",
  "Nice for mountain biking, less for walking. I have tried to cross Country ski here in the Winter and find the trail poor. if you like a bike challenge try it otherwise save yourself a trip."
 ]
},{
 "name": "First Amendment Museum at the Gannett House",
 "address": "184 State Street",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d20841116-Reviews-First_Amendment_Museum_at_the_Gannett_House-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": []
},{
 "name": "Colburn House State Historic Site",
 "address": "Arnold Rd",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g29485-d13120767-Reviews-Colburn_House_State_Historic_Site-Augusta_Maine.html",
 "source": "TripAdvisor",
 "reviews": []
}]
