[
{
 "name": "Texas State Capitol",
 "address": "1100 S Congress Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/ae/41/4e/and-check-out-the-grounds.jpg",
 "tags": [
  "history",
  "tour",
  "history",
  "free",
  "family",
  "history",
  "tour",
  "free",
  "tour",
  "free",
  "history",
  "walk",
  "tour",
  "history",
  "tour",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d109316-Reviews-Texas_State_Capitol-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Texas State Capitol has a lovely interior, antique furnishings, paintings of past governors, and its beautiful grounds.Visiting the House and Senate chambers while in session is awesome. Highly recommend this place due to its historical importance to Texas.",
  "A beautiful pink granite facility with a wonderful history , links to the XIT Ranch in the late 1800’s and European investors who brought the large ranches of that era into being. Wood interiors are beautiful and new facilities have stayed true to that where possible. Great gift shop.",
  "This building is beautiful and filled with Texas pride -- from the chandelier light bulbs that spell \"Texas\" to the door hinges that say \"Texas Capitol\"!  The free tour lasts only 30 minutes and is definitely worth it, as you get interesting Texas history and a visit to both the House and Senate chambers.",
  "This is a must see historical landmark in Austin.  Located in downtown Austin, this is the home of the Texas Legislature and the office of our honorable Governor.  The Texas State was ranked 92nd in terms of favorite architecture in America and also the number 1 State Capital!   A granite monument of the Ten Commandments located on the ground of the Capitol was the topic of a 2005 US Supreme Court case, in which the display was challenged to be unconstitutional. The court ruled that the display is not.  \n\nDon't miss to explore the Grounds as it is the refuge of several statues and monuments. The Four oldest are the Heroes of the Alamo, a Volunteer Fireman, a Confederate Soldier and Terry's Texas Rangers.  Importantly in 2013 ground was broken for the Texas Capitol Vietnam Veterans Monument! \n\nA great place for a history review of the State of Texas.  A lesson enjoyable for the entire family. Several tours are available but a lot of the monuments have some plaques rich in historical facts.  Also visit the site during the day and at night as it's splendor can be enjoyed throughout the day! \n\nHave fun!!!",
  "The free tour provided is very informative and you can take pictures! Park in the Capitol Visitor's Parking garage and the first two hours are free. It gave us plenty of time to take the tour and explore the grounds and gift shop without having to pay for parking.",
  "This wouldn't seem all that thrilling but it was a highlight of the trip to Austin.  Parking is free for two hours and abundant at the parking garage across the street.  The guided tour is also free and very good.  The tour lasts about an hour and covers the highlights.  There are stairs on the tour but it's also accessible by elevator.  This is a working government building and you'll have to go through security so keep that in mind for your visit.",
  "We wanted to see the Texas State Capitol. However, there was a lot of traffic. Someone told me that there is always traffic.\n\nThe sun was starting to go down as well.\n\nI found a place to get a picture of the Texas State Capitol. It was gorgeous! Wow!\n\nA must see!",
  "Had a very nice walk around the grounds.  Lots of statues, memorials and history to look at. Beautiful grounds, A nice visit.",
  "When my S/O and I visited Austin, I had to make a stop. We opted to do the self guided tour as the guided tours were pretty packed. A lot of great history and fun architecture to enjoy and the gift shop was a nice stop too.\n\nWe also enjoyed that as Texans do, there are stars and Texas plastered EVERYWHERE.",
  "Very informative tour that we all enjoyed. My only quibble would be the sometimes lack of sensitivity in regards to Texas history. It didn’t take away from the tour as the guide was still really nice, just a bit insensitive to the plight of the Native-Americans during the formation of the state of Texas. It was nice to show the kids the Senate & House chambers. My daughter took away a good bit of info from the tour so that was a huge plus. ",
  "Lovely grounds and lots of memorials and statuary but really - the place operates a few days a years - not much gets done and it is an overwrought classic design. It will take you 5 minutes to “get it”. Waste of tax payers money. "
 ]
},{
 "name": "Lady Bird Lake Hike-and-Bike Trail",
 "address": "Lady Bird Lake First Street Bridge at Lady Bird Lake",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/dc/2f/93/skyline-from-auditorium.jpg",
 "tags": [
  "walk",
  "family",
  "walk",
  "free",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d184131-Reviews-Lady_Bird_Lake_Hike_and_Bike_Trail-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Though it feels like you're walking/cycling/jogging along a northern river, this trail actually hugs Austin's central 'Lady Bird Lake'. \nIt's a great spot to visit for a cool morning or a shady afternoon workout, and you'll get great views of the city and fringe sites (e.g. Stevie Ray Vaughn statue, Austin Power plant, etc.)\nPlus the trail leads to the notable South Congress bridge where a colony of bats lift off from each dusk.",
  "We took our bikes to Austin for the weekend and it was worth it!  Austin is a very bike-friendly city with dedicated bike lanes on most streets.  We biked the Lady Bird and the Town Lake trails...a combination of dirt, paved, elevated bike/hike trails and bridges...the elevated trail was over the water and paved with large flat stone (very cool!)  We took some awesome pics and got in some great fitness & fun!  Note to bikers:  Austin can be quite hilly in sections...terrific workouts!!  Love the biker-friendly streets.  :)",
  "Having visited Austin many times, I always make sure to take a brisk walk along the trails of Lady Bird Lake. It's a wonderful hiking, biking, running trail for families, dog walkers, solos, groups etc. It's truly a jewel in the heart of Austin. Don't miss it.",
  "This is one of my favorite places to walk my dog or bring visiting family for a stroll. If you get there early, during the week, it's such a beautiful & calming atmosphere. I usually do a 3 or 4 mile loop according to \"map my walk\" app but there are official mile markers on the path. There are also very nice & clean public restrooms. The path is dog friendly with water available and an area where your dog can be off the leash. Do keep in mind that the path can be quite crowded on the weekends but it's still enjoyable just not as calm. ",
  "Lady Bird Lake is probably the highlight of downtown Austin's landscape. It's serene and pretty. The trail is quite easy. A walk-through of it may take about an hour or so, if I remember right. Surrounded by urban buildings, the trail provides a quiet getaway for the mind.\n\nCome at early dusk, and the trail is particularly quiet. When the setting-down sunlight adds a warm hue to the buildings, which reflect on the lake surface, it's quite beautiful to behold.\n\nIf you like bats, you can gather by the bat observatory below the bridge and there are plenty of bats to observe. I'd rather avoid that spot. \n\nWatch out though, as there are still plenty of people, and some of them are on bikes or scooters and pass through quite fast.",
  "If it's a nice day, don't miss this. Plenty of free parking on the south side of the river, plenty of water and facilities. Don't miss the bats under the Congress Bridge if you are here from April till October. ",
  "A beautiful trail, some on land some over water, around a beautiful lake.\nEasy excess from most parts of the city.\nSome in a shade some out in the sun.\nLots of sea turtles .\nCan get crowded ...",
  "Its a beautiful lake with a gorgeous backdrop the city skyline.  Well maintained wifh many stops a long the way to sit, relax and enjoy the surroundings.  Many people out with their friends, loved ones, families walking or running their dogs.  It's a great place to be.  It's urban life personified.",
  "Had a downtown apartment for a week and walked this trail on 3 different days great trail with lots of jogger's and biker's did approximate 4 mile loop in 1 hour+.",
  "Coming to Austin from the frozen tundra of Western New York, I absolutely loved how much outdoor activity is going on there.  Bikers, hikers, dog walkers, kayaks, canoes, and everything in between.   Lady Bird Lake is centrally located near the downtown area, and it has a wonderful 10-mile bike trail encircling it.  I rented a bike from Barton Springs Bike Rental (really nice folks), and I spent a wonderful 72 degree afternoon riding on the bike path, and taking it all in.  It's a great way to see a different view of Austin, and to work off some calories from all the incredible restaurants.",
  "Best place in town to go for a walk. Beautiful waterside scenery, lots of shade, wide crushed granite pathways, and good for people-watching. Just need to listen for bicycles and make room when you hear them approaching."
 ]
},{
 "name": "Barton Springs Pool",
 "address": "2201 Barton Springs Rd Zilker Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/7a/85/e0/20180422-123110-largejpg.jpg",
 "tags": [
  "unique",
  "adventurous",
  "family",
  "food",
  "food",
  "family",
  "kids",
  "drink",
  "free",
  "learn",
  "walking",
  "walk",
  "walk",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d116421-Reviews-Barton_Springs_Pool-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is the perfect place to be on a hot day! We rode bikes around the lake to get to the springs so we were good and hot, perfect for enjoying the cold water! Wear water shoes if possible because it's very slippery. There are plenty of places to leave your things on the ground while you venture in. There's a diving board and life guards. Many families enjoying the cooling waters. Quite a view of downtown too! We thoroughly enjoyed this unique and cooling experience in Austin.",
  "An almost natural pool in the middle of Zilker park, went there with my gf before going to ACL, best thing to do in a hot day, the water is cold and refreshing and very clean, go early to avoid crowds,",
  "With triple digit weather streaks and sunny, summer skies, we all need cooling off. Located in Austin's Zilker Park, this literal oasis offers a reprieve from the Texas heat. Cold natural spring water, cover from tall shade trees, and a carpeted grassy hill blanketed with family groups, packs of adventurous teens, couples in love, and Austinites and world travelers alike, this is the perfect recipe for a typical Austin adventure. Please note *no food allow*! One of my favorite places to go. Parking is limited on weekend and holidays, filling up fast and early. Non-residents pay a higher fee of $8 for adults",
  "The water here is quite cold year round. In the height of summer my family had trouble staying in for long periods of time. (I was fine with it though.) The pool is extremely crowded in summer though, and frankly there is a strong smell of urine in certain areas. (Usually near the steps, as though everyone urinates when entering the pool!) It's definitely something to be aware of if you plan to go. If you stay in the area where the water come up from the underwater spring (which feeds the pool), then you have beautiful, clean, crystal clear water for swimming. If you take your snorkel, you can even snorkel a bit. There's not much to see, other than a very few fish and some seaweed, but it's still rather magical to have the feeling of flying in the clear water. \n\nFlotation devices are only allowed in the far ends of the pool, where the water is shallowest. Consequently, these areas are also the area with the most children, and the most crowded areas of the pool. It's also the area where the water is shallowest and dirtiest since it's pushed outward from the spring in the middle of the pool, before draining to riverbeds on both ends of the pool. It's nowhere near as dirty as most rivers though, so don’t worry. \n\nThere's also a diving board. There's always a line but it moves very quickly. People are friendly, at times, the whole pool will cheer on young divers who become frightened, in order to encourage them.\n\nThe lifeguards are excellent. Last summer we saw two rescues within a matter of minutes. One fellow slipped and fell into the water. He had time to go under once before the lifeguard had pulled him out. Just afterward a man collapsed in the grass and, once again, the lifeguards reached him within moments. They began chest compressions on him immediately and, shortly after, an ambulance team arrived. By the time they arrived, the man was conscious and talking. I was quite impressed with the professionalism of the lifeguards. Can't say enough good things about these hardworking men and women. I sincerely feel that my family and I are well protected when we swim at this location.\n\nIt's a bit of a hassle to find a shady spot for lounging, so come very early in the morning or very late in the afternoon if you hope to find one. If you come at midday, you'll probably be stuck in the sun. Also, they won't let you bring much of anything inside. I think we’re only allowed one drink per person, in a plastic bottle. (If I remember correctly – it’s been a while since we went.) The snack bar is just outside of the pool entrance. The food was very typical snack bar food. They do NOT allow coolers in the pool area. We got around this by finding a spot as close to the entrance as possible and then putting a cooler in the car, which we stocked with snacks and drinks. That way, we had easy refills and, when we were ready for lunch, we ate at the picnic tables just outside the pool entrance. \n\nThere's a small train, just outside the pool entrance, which you can ride with or without kids. We didn't try it, so I can't rate it. But it seemed quite popular.\n\nBring LOTS AND LOTS of sunscreen because there are virtually no shaded areas in the pool, and don't forget your sunglasses because the sun is blinding in the summertime! The lack of shade is my number one complaint about the location. I did see that they are doing some renovations right now though. So perhaps this summer (2014) there will be more. \n\nParking in a major pain in the rump. If you hope to park near the entrance you could spend a considerable amount of time circling the lot. We always do so, since we like to access our cooler throughout the day, but it can really be annoying. People will definitely steal your parking spot. One fellow tried to go around my husband, as he was pulling our car into a slot, in order to steal our slot. Seriously.\nWe always spend the whole day when we go, but that might be a bit much for some families with very small kids. (We have no kids, but we usually take our niece and nephew and they LOVE it. They are school age though.)",
  "Barton Springs is definitely a special feature in the heart of Austin.  If you're new to this experience, the water is a constant cool temp (68-70F) year round - refreshing in the hot summers and therapeutic at all other times (if you have the tolerance!)\n\nVisit their website to learn about the early morning and late night FREE swims, and expect to pay a few dollars entry at other times.  It's also closed daytime each Thursday for cleaning. To my knowledge they still do not take credit cards.\n\nWeekends in the summer season can get really crowded, so consider going early to beat the crowds.",
  "Had an amazing time at Barton Springs.  The water was nice and refreshing.  Some folks may want to wear water shoes as there can be lots of rocks, but just jump in and find a shady place along the banks to wade in the water.  Great vibes, good people, good fun.",
  "A gem in the city!  At a constant 68 degrees, there are people that swim here every day it’s open. I prefer the summertime, when it gets ridiculously hot and the pool is great to cool off in.",
  "The pool was closed for maintenance. However, we did get to walk around the area and enjoy the walking experience and beginnings of Spring. ",
  "An invigorating walk with a total immersion in natural beauty.  Plus, interesting people watching.  Refreshing!",
  "As a former swimmer, this place really spoke my language. Although it was very cold water, it was beautiful and such a unique \"pool\" unlike anything I have ever seen. A must visit for the water lover!",
  "Had a great time at Barton Springs Pool, which happens to be open all year around. The water was a little too cold for me in Feb, even during a heatwave of 80 degrees for me to get in, but there were many folks swimming about. The floors are slippery as it is a natural spring and the floor is lined with plant life. It is also recommended not to dive into the pool as the live algae floats in the water."
 ]
},{
 "name": "Mount Bonnell",
 "address": "3800 Bonnell Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/c5/a1/d6/mount-bonnell.jpg",
 "tags": [
  "free",
  "hike",
  "walk",
  "hike",
  "kids",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d144295-Reviews-Mount_Bonnell-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Mount Bonnell\nAddress:3800 Mt Bonnell Rd\nAustin, TX 78731\nParking: Free parking along Mt. Bonnell Rd.\nDifficulty: Easy\nDistance: 0.5 Miles\nDogs: Yes, dogs are allowed\n\nShort and easy hike and great place to watch the sunset over the city of Austin.  There are two ways to reach the overlook, you can walk up the stairs or take the trail. It’s a total of 106 steps to the overlook. I recommend taking the trail because you get better views of the beautiful homes and  the Colorado river.\n\nBring bug spray because there are a lot of bugs, or there was when I did this hike in September. My original plan was to setup a picnic but the bugs made it unbearable",
  "Perfect place to get an overview of Austin and catch a breathtaking sunset. Easy and short hike to the top or stairs in the middle to take you straight up, pavilion and picnic tables around, and lots of beautiful photo ops. Very busy so not as quiet and romantic as hoped. Definitely worth a visit.",
  "Worth the climb up the stone steps to see the view of downtown and the river below.  River was pretty low, but nice to see the overall landscape of Austin.",
  "At Houston, we felt so sick being home all day long, because of the coronavirus outbreak. So we packed and went to Austin, where there are mountains. We went to Mount Bonnell, and it was excellent! We went to the viewpoints, and there was not one person there. We had Covert Park all to ourselves, and the trail was easy and relaxing. I highly recommend this place!",
  "I came here with my 3 kids to get out of the house during \"social distancing\" and was only out of the car maybe 20 minutes only to come back and find that my window was smashed and my purse, money, wallet, and a USPS package had been stolen out of my car.  Within minutes the thieves were using every credit card from my wallet.  This seems like a nice area and having only recently moved to Austin I had no idea this is a common occurrence at this park.  The view was not worth the hassle of dealing with the theft.  My advice if you do go is park right by the stairs and leave NOTHING in your car.  Sad that people can be so terrible.",
  "Certainly one of the best views of Lake Austin and the mansions along the shore nearby, and a nice view of the city as well. Romantic after dark (true confession: I took the woman who ultimately became my wife of 38 years now here on our first date). Most people take the stairs to the top, but I suggest that you park about 300 yds to the north of the stairs where there's a gate and a dirt road/trail that offers a more scenic route to the summit, if you don't mind slightly rougher terrain.",
  "I ran here from the Grove area, which is about 2 miles. As many reviews note, there is a big staircase to the top, but at the end of the parking area, there is also access via a more gradual incline. There are great views of the river, but the area is fairly small and was somewhat crowded (this was around 11 am on Saturday). There are a couple of picnic tables and spots to sit down.  It was worthwhile, but I wouldn't plan on spending more than 30-45 minutes here.",
  "This was a quick hike with beautiful views. Our children were able to do it with us.  We parked on the road and there were MANY steps to climb to the top, something to consider.  Not sure if there was another access point.  We went to Mayfield Park when we were done to see the peacocks. 5 min drive down the road  Very nice afternoon."
 ]
},{
 "name": "LBJ Presidential Library",
 "address": "2313 Red River St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/aa/6e/8a/lbj-presidential-library.jpg",
 "tags": [
  "learn",
  "walk",
  "free",
  "history",
  "organized",
  "library",
  "learn",
  "library",
  "history",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d145840-Reviews-LBJ_Presidential_Library-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Second visit since April 2018 yesterday \nIt seriously is such a wonderful tribute to \nPresident Johnson and President Kennedy \nGreat gift store and wonderful informative staff working there and The perfect ending to a spectacular visit to Austin",
  "This is an outstanding museum that is not too overwhelming, but gives you a lot of bang for your $10.  You need at least 1 hour (ideally 1.5 - 2 hours) if you want to walk through all of the rooms, see the short videos, and read most of the information.  First floor has local Texas exhibit, second floor has the gorgeous grand staircase (LBJ mural, extensive exhibit and videos, Sesame Street characters (NPR) and sculpture patio), and the top floor has a replica of the Oval Office with great window views.  Cute gift shop with presidential and Texas gifts. \n\nRecommended for those with any interest in politics/history, families with older children and teenagers, people who like to actively learn at museums, and travelers looking to see more of UT Austin.  ",
  "We spent about 2 and a half hours.\n\nThe museum covers Johnson's presidency in detail with focus on the Great Society and the Vietnam War but it also covers his earlier history in the Senate, the Kennedy assassination, and many other cultural touch points off the 60s (tie died T shirts, the Beatles, the Stones, the Byrds...), TV shows (Mr Ed, Bewitched, Marlboro commercials).\n\nThe museum also has a copy of the Oval Office as it existed at the time LBJ was in the White House. \n\nThe technology is a bit older than that used in the George W Bush and Reagan Libraries, and if you are conservative/Republican, you may disagree with the way the Great Society is presented.\n\nParking is free.\n\nIf you are a history or political buff, do not miss it.\nIf you don't care about history, you maybe bored.\n\n(We loved it)",
  "This turned out to be way more interesting than I expected. All the bills he passed that benefitted middle class and poor. He was more of a character than I learned in school too. Highly recommend this place.",
  "While visiting Austin we decided to visit the LBJ Library located there.  I wasn't sure what to expect, this being my first presidential library visit, and approached tentatively.  I was pleasantly surprised.  The library is full of interesting, historical information that is presented in a pleasantly organized manner.  There is a lot to learn here about our country, the time and the man.  We are already planning trips to visit other presidential libraries on other adventures.  Recommended.",
  "The exhibits at this library address the two great challenges that LBJ inherited: domestic inequity and Viet Nam.  The failures of the latter tend to overshadow the monumental successes of the Great Society.  It's good to be reminded of both.",
  "Really interesting museum, provided insights on LBJ that I did not know.  It was a great history lesson !",
  "Lyndon Johnson did so much for civil rights; his Great Society resulted in programs from which we all still benefit today. It is unfortunate that the Vietnam War and a short-sighted view of Communist \"containment\" eclipsed LBJ's achievements in domestic policy. The library tells it all, and does so well. We spent most of an entire day there. You must go!"
 ]
},{
 "name": "Bullock Texas State History Museum",
 "address": "1800 Congress Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/89/64/e5/bullock-texas-state-history.jpg",
 "tags": [
  "history",
  "history",
  "kids",
  "history",
  "history",
  "theatre",
  "history",
  "history",
  "walk",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d209385-Reviews-Bullock_Texas_State_History_Museum-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located between the Texas State Capitol and the University of Texas, the Bullock Museum is a treasure of Texas history, including the reassembled French ship that sank in Matagorda Bay 300 years ago.  Good IMAX theater.",
  "I admit, I love this museum because I am a native Texan and appreciate the fantastic overview of Texas history.  My husband, however, who is not from Texas, loved this museum too!  It provides a visual, interactive history of my great state, from the pre-republic era, the vital Mexican influence, the history of slavery, annexation to the United States  and onward.  Nice, kid friendly events like lego building and hands-on construction projects, a full cafe, an Imax theater and several hands-on, interactive exhibits  that my kids aged  9 and 12, really loved.   Wound recommend this to anyone with a real, cultural interest in Texas history",
  "Exhibits we saw included \n1) The Rise of the Nazi Rule\n2) American Flags\n3) Texas History including an Austin City Limits video retrospective\n4) The La Belle Shipwreck \n\nWe loved every minute and also found many treasures in the gift shop!\n\nIn depth and moving exhibits revealing history we wanted and needed to know more about.",
  "I appreciate a well-designed museum of any type, able to grab and hold the visitor's interest.  The Bullock is one such place.  Very well done.  Clean, well-lighted.  Three floors of displays from ancient to modern.  Learned alot of Texas/Mexican history.  Worth a visit, for sure.",
  "It's a fascinating place, three stories worth of how Texas came to be what it is and its import to the U.S. experience. There are exhibits and films and more. We really enjoyed the special civil rights exhibit, photographs taking during the 1964 Freedom Summer in the south by four famous photographers -- very moving. Go there!",
  "Great museum with three stories full of Texas History. Very interesting with several videos and an IMAX Theatre.",
  "We were visiting Austin from out of state and learned a lot about the history of Texas in a short period of time, very informative.  Also really enjoyed the LaSalle exhibit, amazing artifacts.  Also found it convenient to just leave our rental car in their garage ($10 all day) and walk to the Capitol building after we were done in the museum.",
  "Put this on your MUST see if you are in Austin!  Our family spent the day there!  So much to do and see!"
 ]
},{
 "name": "The Driskill",
 "address": "604 Brazos St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/d0/5c/e6/beautiful-dome-ceiling.jpg",
 "tags": [
  "historic",
  "history",
  "delicious",
  "delicious",
  "unique",
  "drink",
  "tour",
  "historic",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d519725-Reviews-The_Driskill-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We love this place for many reasons and seasons!  The tree lighting is an amazing and festive way to kick off your holiday season.  We have also enjoyed it in the summer as a romantic getaway for my husband and I.  The bar is rich in Texas decor and the drinks are delicious as well as the appetizers.  The rooms are quaint and well appointed. We had a surprise during our last stay, the lights and fan came on in the middle of the night of couple of times!  Not sure what that was about..Could've been old historic wiring or perhaps a visitor from beyond, letting us know whose room it really was.\nThe restaurant has choices to satisfy everyone.  We have even stopped by here just for dessert and ambiance with our youngest daughter (elementary school age).  If you love history and architecture, this is a wonderful destination.",
  "You have to stop by the Driskill bar for some of the best cocktails made with locally distilled spirits.  The Batini was delicious- Titos, St Germain, lemon.  And the house Texas Whiskey cocktail made with San Germain as well was very refreshing",
  "Absolutely beautiful hotel with great historical value and right near the vibrant downtown of Austin. Definitely recommend!",
  "We moseyed on down to 6th street for the evening.  Before dinner we decided to grab a drink in the Driskill bar.  I hadn't been there in around 20 years and it was just like I remembered it.  Classy joint.  Unique room.  Lousy slow service.  Some lounge act playing.  And that amazing ceiling.  And the amazing octagon wooden bar.  Worth stopping in for an overpriced cocktail and to think about what Austin was like 100 years ago.",
  "Hotels like The Driskill just aren't built anymore!  Beautiful decor, soaked in all things Texan and cowboy.  \nJust upstairs from the lobby was a beautiful bar, packed for Happy Hour.  The several appetizers we tried were excellent, especially the grilled brussels sprouts.   Unhappily, some of the cocktails tasted watery, a conclusion shared by several of us. ",
  "Perfect place for our wedding weekend. Great location,  amazing staff, fair prices. Will be returning! ",
  "After the Capital tipster tour , we enjoyed a wonderful brunch at the historic Driskill. Fabulous soups and salads",
  "If you appreciate historic architecture, don’t miss the Driskill. The bar is warm and welcoming with comfortable chairs. A nice place for small bites."
 ]
},{
 "name": "Congress Avenue Bridge / Austin Bats",
 "address": "100 Congress Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/dd/aa/a6/congress-avenue-at-dusk.jpg",
 "tags": [
  "tour",
  "unique",
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d106309-Reviews-Congress_Avenue_Bridge_Austin_Bats-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "The coolest thing ever to see, to anyone that doesn’t know Austin is home to the largest urban bat colony in North America and the bats are absolutely amazing at dust! Please go see them and their beautiful flight for nightly dinner.... ",
  "Watching the bats as the sun goes down is very exciting and educational if you take a ride on one of the tour boats. ",
  "Every year nearly 1 Million Mexican free-tailed bats call Austin home, typically arriving as the warm weather sets back in the Spring. They stay in Austin until early fall, and are the largest urban bat colony in North America. When in Austin, they camp out on downtown's Congress Avenue Bridge. Every summer night, hundreds of people gather to see the world's largest urban bat colony emerge from under the Congress Avenue Bridge in downtown Austin, Texas. These 1.5 million bats are fun to watch, but they're also making our world a better place to live. You can stand on the bridge at dusk and watch the bats emerge as a black cloud against the sunset as they seek out their dinner. Be sure to ask the locals what time the bats are coming out, because our recent drought has them coming out earlier than usual!",
  "If it is your first visit to Austin, watching the bats leave the bridge at sunset is a must and make sure you fit it into the itinerary. You can view them from kayaks and do various tours, but if you are on a budget and time limit, you can still view the site for free.\nFew tips: make sure you find out which side of the bridge is the best to view them and if you want to secure a good spot, you need to get there at least 1,5-2hrs before they generally set off. It gets packed full of people very quickly. Remember, they are still wild animals and do not conform to times, so it varies when they set off, not to mention it would likely be weather dependant. \n\nRegardless, to watch over a million bats setting off (not to mention the noise) is so unique to Austin.",
  "Wanted to see the fling event but the fires were on vacation!  Will go again once we can travel to Texas. ",
  "NANANANANANA BATMAN!!!\nSAME BAT TIME, SAME BAT CHANNEL!!!\n\nThousands and thousands of bats flying out of Congress bridge at sunset.  Holy Jeepers Batman!  \nTouristy?  Probably.  \n /\\                    /\\\n/  \\'._   (\\_/)   _.'/ \\\n|.''._'--(o.o)--'_.''.|\n\\_ / `;=/ \" \\=;` \\ _/\n  `\\__| \\___/ |__/`\njgs     \\(_|_)/\n        \" ` \"\nWeird? Oh yes!  \n\n  /\\                 /\\\n / \\'._   (\\_/)   _.'/ \\\n/_.''._'--('.')--'_.''._\\\n| \\_ / `;=/ \" \\=;` \\ _/ |\n \\/ `\\__|`\\___/`|__/`  \\/\njgs`      \\(/|\\)/       `\nWorth it? As an animal lover, I say so.\n_________                   _________\n~-.              \\  |\\___/|  /              .-~\n    ~-.           \\ / o o \\ /           .-~\n       /           \\\\  W  //           \\\n      /             /~---~\\             \\\n     /_            |       |            _\\\n        ~-.        |       |        .-~\n           ;        \\     /        i\n          /___      /\\   /\\      ___\\\n               ~-. /  \\_/  \\ .-~\n                  V         V\nIs it free? YES, FREE!!!\n\nGo see some bats!!!",
  "Saw reviews on here so decided to stop & saw nothing, when we went to San Jac Saloon the next day was told the bats don't come before April due to colder weather & are gone after Sept, wish someone would of stated this in their review",
  "Watch the bats at dusk. One of nature’s great gifts. Really beautiful. Best place us to stand 2/3 of he way over bridge away from Line Hotel. Or go to Line Hotel’s P6 bar (which was closed this time). "
 ]
},{
 "name": "Lady Bird Johnson Wildflower Center",
 "address": "4801 La Crosse Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/eb/09/8e/part-of-the-central-complex.jpg",
 "tags": [
  "family",
  "walking",
  "wander",
  "library",
  "family",
  "family",
  "kids",
  "learn",
  "nature",
  "walking",
  "organized",
  "learn",
  "walking",
  "walking",
  "free",
  "field",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d106076-Reviews-Lady_Bird_Johnson_Wildflower_Center-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a nice day to spend a morning. Saying hello to a nesting Great Horned Owl, walking among native plants, seeing the delight of children in the family area, climbing the sandstone tower and overlooking the vast wildflower area, and ending in a gift shop with an amazing exhibit from a Texas artist. If this is something you can fit in your Austin Itinerary, I would highly recommend. ",
  "As with most places in TX the signage for finding this place was abominable. Not all of us have GPS. We happened upon the visitor's entrance and parking quite by chance after following a veritable rabbit warren of roads. Would have been lost had we not found a volunteer just arriving for her shift who showed us the way in around construction debris. Once inside, however, we found a lovely courtyard, beautiful buildings, and an expanse of trails that enabled us to wander through meadows, woods, and somewhat formal gardens filled with native plants and trees that were relatively well-marked and curated with signs for those who like to know what they are looking at. The volunteers were very friendly and graciously answered all of our questions. The gift shop and cafe were surprising gems. We also enjoyed meeting the resident owl. Well worth the trip! ",
  "We had gone to the LBJ presidential library and thought this would be a good balancing act for that and we were very pleasantly surprised.  The children of today do not realize the lasting effect of Mrs. Johnson on our nation's landscape, from the reduction of sign pollution to the proliferation of wildflowers along our nation's highways.  We visited n November and it was excellent so I can only imagine what it must be like with the blue bonnets in bloom.  A great activity. ",
  "We took our 6 year old granddaughter there and we all had a great time.  The family garden amused her for almost an hour and allowed me to sit down for a bit.  She also enjoyed the swings which were located in the area with the paths and went up to the roof of the building near the courtyard.  Parking, however, was difficult as it was during a school holiday.  Come early if you visit on a nice weekend or a school break.  Wear closed toe shoes and bring along sunblock.",
  "Good day trip with the family, younger kids will love it. Bring a camera cause you'll want lots of pictures of the scenery ",
  "There are interior areas where you can learn about the local wild flowers and Ladybird Johnson. Staff are available for questions. There is cute pricey gift shop. Enjoyed having a snack at the center's cafe. The butterfly garden was captivating. Great photo opportunity. If you're into ecology, nature, hiking, learning etc. this is the place to visit. Bring a hat if you are there on a sunny day.",
  "Not a lot blooming when we were there but good walking paths.  This would be a great place spring through fall. ",
  "One can come to this center any time of the year and learn something.  If the flowers are in bloom, it is exquisite!  Well thought out and organized.  A great side trip.  Also near other side trips.",
  "We enjoyed walking all around the gardens. There are so many flower gardens to enjoy. Even though it is early Spring the time spent here was well worth it.  ",
  "Spent a couple of hours walking around the park.  It was February so nothing was blooming.  The sculptures were lovely and the look out tower was fun to climb and view the park.  We spent quite a while sitting in the tree swings relaxing.  My favorite sculpture was the ‘fairy house’. The gift shop is quite large and worth visiting.  There’s a cafe with indoor and outdoor seating.  ",
  "Honestly, this place is not worth going to unless anything is blooming. You're just looking at a field of weeds. We went on the cave festival day, which was free but apparently only if you mentioned it at the ticket booth even though it was advertised as just being free. I'm super glad we did not pay for it.\n\nThis would be better if you had kids but it was just my husband and I staring out at fields of weeds. They had some kid playgrounds and activities. Parking was tough but free. \n\nNot worth going without kids if nothing is in bloom. I knew it since it was February that it wouldn't be super colorful but I was hoping for at least a few flowers or plants blooming.\n\nNot worth your time IMO."
 ]
},{
 "name": "South Congress Avenue",
 "address": "South Congress Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/f3/ff/d7/south-congress.jpg",
 "tags": [
  "unique",
  "walking",
  "food",
  "walk",
  "art",
  "family",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d184129-Reviews-South_Congress_Avenue-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "South Congress comes complete with some famous eateries, such as Home Slice Pizza and Hopdoddy Burgers, unique shops like Lucy in Desguise (where you can find a costume for most any occasion), and a great walking area.  There is a lot to do in this area and you should include it on your visit to Austin.",
  "Perfect example of what makes Austin \"weird\" - lovely boutiques, Tom's Shoes, restaurants, food trucks, Amy's Ice Cream, street musicians, wax museum...great people watching and shops with that perfect souvenir of your visit.Easy one-mile walk from your downtown hotel - just across the Congress St. bridge.",
  "Great peopl watching , great coffee shops, restaurants, costumes at Lucy in disguise, Allen boots for authentic cowboy boots for the family. Resale shoes, jewelry, art galleries, and hotels.",
  "Terrific brunch menu - not your normal brunch items (carrot cake French toast, eggs Benedict with crab cakes, etc). Attentive and efficient service. Call an hour ahead for reservation. Wonderful experience. ",
  "I liked this area before it became hip. There's always some fun, unusual shops to explore. Good eating on every block. Interesting people to ponder. ",
  "Great,  interesting and some unique shops and restaurants. Definitely visit Allen boots and Lucy in disguise. ",
  "If checking this out I’d go in the day as there are shops. Wasn’t my kind of shopping. Lots of restaurants for foodies. Reservations would probably be smart. Not much available mid afternoon as some offer small plates or snacks at that time.",
  "This is right over the bridge from down Town Austin. You follow the road directly from the capitol building. Here you find some small shops and cafes. Austin Motell is also located here."
 ]
},{
 "name": "Austin Aquarium",
 "address": "13530 N Highway 183 Suite #101",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/6f/ee/60/austin-aquarium.jpg",
 "tags": [
  "kids",
  "kids",
  "free",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d5932721-Reviews-Austin_Aquarium-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "There is so  much to do here.There is a system where you buy tokens to feed animals birds,fish,stingrays,sharks.The giant  squid is amazing.I would reccomend this",
  "Stopped for a break and what a treasure! The week day rate is a little cheaper than the weekend and your visit is as short as long as you make it.  Much more than just fish.  Enjoy the visit immensely!!!  Will come back when in the area and hopefully Cody will lead us on the Lemur experience again.  Added plus, your admission will. Allow you to leave and return.",
  "Most insane good time for kids!   Every part of this interactive adventure is a fresh way to enjoy animal life and appreciate the wild diversity of the earth.  From mammals to birds to lizards to sea creatures like sting rays, sharks and anemones, everyone gets a chance to watch and touch and feed the animals.\n\nEven better than the fascinating exhibits and creatures of all shapes and sizes are the wonderfully, informative, friendly and helpful staff, specially Philip and Devin, the lemur master, Heather, Kate and also the coatimundi wrangler, Will.  You can tell everyone here loves animals and helping visitors have a blast and immerse themselves.  \n\nHighly recommended!",
  "Very disappointing.... not worth the money... actually felt sorry for the animals being exposed to all the people poking and touching them.",
  "This is a must-see destination for Austin animal lovers.  For my money, the interactive mammal exhibits are the star of the show.  It was fun watching ring-tailed lemurs crawl all over my kids.  :-)",
  "My grandchildren LIVE visiting the Austin Aquarium! We go as often as we can. Taryn is an amazing manager who makes sure we all have the best time every time!!",
  "We came to Austin in February for a lantern festival for my daughters 18th birthday.  We had time to kill, so we went to this aquarium. It was pretty cool.  They had all sorts of fish and other marine life.  Birds and reptiles, all in touch tanks. Everything you could reach you could touch.  We walked through and pet some sting rays and really big fish.  They had a bird room where you could go in and the birds would come land on you. It was really neat, there were about 90 birds in there and they just sat on your head, arm, or leg. \n\nWe bought some tokens to do a lemur encounter. This would have let us in and play with the lemurs for a bit.  Unfortunately the lemurs were sleeping and they don't get woken up for playtime.  As we tried to figure out what to do, an employee saw us and offered us to go into the kinkajua cage.  We had no idea what they were.  They are in the raccoon family and so very cute.  They climbed all over us and one even stuck his tongue in my ear.  It was a pretty good trade.\n\nThe admission was reasonable at 17 each. The tokens were $3 each which I thought was a little expensive.  But there was so much to do for free.  The tokens were for feeding or personal encounters.\n\nThe only suggestion I'd make was to have a few more hand washing stations around. They had one near the sting rays where you stick your hands in the water, but one near the birds and the kinkajou would have been nice too.\n\nI'd go again if I came back to Austin.",
  "Spent a whole afternoon here. Enjoyed the interactions. The staff was amazingly friendly and helpful. They shared facts and stories about the animals."
 ]
},{
 "name": "Zilker Metropolitan Park",
 "address": "2100 Barton Springs Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/38/e8/c6/photo2jpg.jpg",
 "tags": [
  "hike",
  "music",
  "family",
  "history",
  "food",
  "hike",
  "music",
  "family",
  "walk",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d109315-Reviews-Zilker_Metropolitan_Park-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of fun things to do here - Barton Springs Pool is within the park, areas for playing volleyball, big fields to throw frisbees, the kite festival usually takes place here in the spring, and you can rent a canoe/kayak and go out on the river.",
  "I was born and Raised here, 5th Generation Austinite, We call it the great lawn. Some History for you, This park was one of the biggest Indian Camps 10 thousand years ago in the state. The park is huge, Zilker Botanical Gardens, Barton Springs Pool, Hike and BIke, paddle boards and canoes, multi sport use, on grass, beach volleyball courts, playscape, miniature train that rides around part of the park. Music Festivals, Food Trucks. Dog Friendly, scoop the poop Please, plenty of trash containers around. Summer afternoon is hot! go jump into barton creek or the pool. Work your way down to the congress bridge at dusk, for the bats. Photo Ops for you and your family with ATX as background, especially at night. Enjoy folks, and welcome to ATX.",
  "The park has very large areas for kite flying, natural rock formations for climbing, sand volleyball, disc golf, swimming, plenty of large pecan shade trees and access points via car/bike and many picnic tables.  \n\nThe coolest feature is that it is adjacent to the Town Lake Hike and Bike Trail and Barton Creek Green Belt.  \n\nLastly, it is home to the Austin City Limits Music Festival where 8 stages are setup for constant live music from 11am to 11pm for two straight weekends every fall. ",
  "Cannot believe how much natural (and tranquil)  beauty there is right next to the city!\n\nZilker Park is absolutely beautiful and a fantastic place to relax by yourself or with a friend or family.\n\nThe quiet refreshing sound of nearby water, friendly faces as you walk along the endless hiking trails and numerous photogenic locations make this a must-see when visiting (or taking a break) from Austin.\n\nHighly recommend.",
  "If you love dogs, I highly recommend this park. We went on Sunday before coming back home. We could've stayed all day playing with all the dogs in the park. As dog lovers, it was the highlight of the trip. They didn't have leashes so they would run from picnic blanket to picnic blanket playing with one another. It was so much fun! We didn't have a dog with us but they would just come up to you wanting to be pet. The park itself is beautiful and open. The restaurants are walking distance to the park so we had lunch at one and walked to the park. It was so much fun! I highly recommend Zilker. ",
  "one of my favorite spots in Austin. easy to get and a good place to have some rest solo or with friends",
  "Zilker Park is centrally located and offers hikers, bike riders and frisbee players walking paths, green open spaces and parking. There are festivals and events all year long.",
  "Great place to enjoying a sunny day. Lots of places for play, parking, nice picnic locations. Perfect!"
 ]
},{
 "name": "McKinney Falls State Park",
 "address": "5808 McKinney Falls Pkwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/cb/78/2c/mckinney-falls-state.jpg",
 "tags": [
  "nature",
  "free",
  "hike",
  "music",
  "food",
  "pets",
  "kids",
  "family",
  "hike",
  "pets",
  "parks",
  "kids",
  "food",
  "nature",
  "walking",
  "family",
  "hike",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d109512-Reviews-McKinney_Falls_State_Park-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our first time staying at a Texas State Park and would highly recommend it.  This is the perfect location to go into Austin but still be out in nature.  Our site has 50 amp power, was spacious and very quiet.  No sewer at the sites and there can be a line for the dump station, so plan extra time for departing for this.",
  "My husband and I have been to McKinney Falls State Park many times. The park has 2 beautiful waterfalls (upper and lower). The falls are always flowing but the flow could be fast or slow. Swimming is allowed. There are lots of picnic tables in several places in the park. The park has many miles of hiking trails. There is a paved 2.8-mile Onion Creek Hike and Bike Trail near the campground. The 0.6 mile Rock Shelter Trail has a little cave and it is cool there during the summer. The Onion Creek and Homestead Trail Loop is easy and about 3 miles long but there are several short cut trails. What is left of old 1852 Gristmill is located on that trail near the trail head. What is left of the old McKinney home is located a quarter mile from the trail head. We had to cross Onion Creek to access the Homestead Trail Loop. During our last trip (Mid-week Jan 2020), the creek was low enough that we could step on rocks to cross the creek. Other times, we had to wade or the creek was impassable. I have not hiked the Williamson Creek Overlook and Flint Rock loop trails. Those trails are about 6.5 miles around trip from the parking lot. No food, alcohol, glass, coolers, ice chests, thermal bags, pets in the water, music, frisbees, footballs, soccer balls, other hard balls are allowed near the Upper and Lower Falls areas. The campground sites are clean and roomy. Most sites have plenty of shade and there are many pull throughs. There are several nice cabins available for rent as well. The park is busy during the spring, summer and fall, especially on weekends, and parking can be limited. Our last trip was mid-week in January, on a beautiful day, and there was lots of parking available. The front gate is open 8 am to 10 pm for non-campers. The entrance fee is $6 or free for kids under 13. My recent annual state park pass cost $70. That allows everyone in my vehicle to get in for free. The park is only 15 miles southeast of downtown Austin.",
  "great place hike. easy to travel trails with lots of water areas. pets are welcome here, but keep them on a leash. nice half day trip with couples, family and friends. a favorite with locals and tourists. just a nice place to go on a weekend.",
  "What a beautiful park right outside of downtown Austin!  Very easy to find.  We arrived about 10:30 on a Saturday and there were only about 3 cars in front of us to get in.  You will need to get a park permit which is $6 per person not car!  I was a little surprised by the cost - most parks go by vehicle not person.  But it was well worth the money.  The park is very clean and well kept.  Also, the bathrooms are very clean except there was no soap. Bathrooms are all throughout the trails.  They give you a map of the trails and where the falls are.  The trails are also very well kept and easy to navigate.  The water was low the day we went but I would love to go back in the summer and swim in the beautiful green water.  There were kids swimming in the deep parts but we were there in February and the water was too cold for us.  There is a little park store if you need ice or supplies.  There are picnic tables throughout the park.  Also there are really nice cabins that are spread pretty far apart so you will not be camping right on top of other people.  There is a separate part for campers and trailers.  Park is dog friendly too.  Wear good shoes and bring your water enjoy the beauty!",
  "So close to the city and nature at the same time.  Beautiful scenery, especially after the rain, and good camp sites which fill up early.  Nice trails.  Easy to challenging.  Bring food and water.  Small visitors center.  Can be a long line to enter after mid morning.  Gets pretty hot during the summer but lovely from autumn to spring. Bring your bathing suit but watch out for snakes and other critters.",
  "We love to go camping in our RV.  We visited McKinney Falls June of 2012.  We camped in the Big Cedar camping area and found most of the sites shaded on that side of the park. The upper falls were a disappointment due to the on-going drought we are experiencing in Texas.  The swimming in the upper falls area required a pretty good jump off the falls into the water below (see pics) and the climb back up was not all that fun, the lower falls were non-existent.  I am sure that the swimming would be much more fun if we were not in a drought. The thing that was the most fun about this park was the paved hiking/biking trails. There are two, one that runs around the outside of the park and one on the inside of the park.  We only rode our bikes on the one inside of the park, its best to start out on the trail by the falls and work your way back around to the campsites. Following this route you will encounter more down-hill grades than up-hill. There are some pretty good hills along this trail that may require the less fit to get off your bike and push it up the hill. Take some water with you as you will need to take a rest break along the way.  The scenery along the trails is really beautiful, lots of flowers, huge oak trees, some wildlife and it runs along-side onion creek. You must watch out for the poison ivy, as it is VERY plentiful in the park and even in the campsites. I understand you are in the wild outdoors, however it seems like they could control it around the campsites a bit better. There is a Wal-Mart not far from the park up, 71 the other side of I-H 35 and a convenience store on 183 close to the McKinney Falls PKWY turn off.  Overall we had a good time, Pros: getting away from it all, beautiful scenery and the biking trails. Cons: waterfalls, swimming, poison ivy and some sites were set up with the RV door facing the opposite of your camping area.",
  "We camped here in a fifth wheel trailer while we spent time seeing the sights of Austin, TX.  Nice hiking trails, well-spaced camp sites, wildlife and waterfalls.  ",
  "One of the most beautiful places I've been in Texas yet.\n\nFilled with natural beauty, adventure and tranquility.\n\nBe sure to explore the areas surrounding both the upper and lower falls.\n\nThe areas themselves will likely be a bit busy but the areas around are incredible and less populated.\n\nEnjoy!",
  "We enjoyed our overnight camping stay. The park had so many walking trails, the falls   were nice but the creek was not carrying much water due to it being so dry recently. The park was clean and our campsite was shaded and",
  "Even in February, this local park was just beautiful. The Falls area is heavily touristed, but there is plenty of space to move around. Loads of picnic sites. Nice trail.",
  "Hidden away just minutes from downtown Austin is this very walkable State Park with a gentle flowing creek complete with two very accessible water falls. There's plenty of hiking trails, picnic spots, fishing and parking. Restrooms are clean and although we didn't get to it, there's even some history of the property with remnants of the homestead and gristmill  of the settling McKinney family. Makes for a fun quick hike or a leisure afternoon picnic spot. "
 ]
},{
 "name": "SoCo District",
 "address": "1600 S Congress Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/53/cd/97/neon-galore-soco-district.jpg",
 "tags": [
  "music",
  "food",
  "drink",
  "art",
  "eat",
  "drink",
  "music",
  "food",
  "drink",
  "unique",
  "walking",
  "music",
  "food",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d304817-Reviews-SoCo_District-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This stretch of South Congress Avenue will keep you occupied and happy for days.  You can divide it up into categories: food and drink; music; shops; and, of course, people watching.  The Continental Club and C-boys are two of the great music venues I visited.  Stop at Amy's Ice Cream for amazing flavors and add-ins.  The food -- pretty much anything you like is there.  Try Guero's for Tex-Mex.  Just strolling around, you'll find shops that sell everything from cowboy boots to musical instruments to hip clothing.",
  "New or old, trendy, quirky, international, name it and you can find it here in this multi-block area along South Congress Street.  From books to more different kinds of candy than you ever saw to attractive restaurants, this is a place where you could easily spend half a day without being aware of the time passing.  Well worth a visit as it provides a pleasant contrast to the modern steel, concrete, and glass of the new Austin",
  "I ended up going over to SoCo a few times and each time was a lot of fun and well worth it.  Try the breakfast tacos and a iced coffee from Jo's, and do not leave without trying Torchy's chile con queso.  There is a lot of art, fashion stores and quality souvenier options, aswell and the best people watching in Austin.",
  "This is a fun place to go when you're a tourist.  This used to be where locals went before Austin became such a huge destination.  There are great restaurants!  Go on First Thursday if you really want a crowd.  Enjoy!",
  "Funky shops; great, unassuming places to eat and drink; if you can't have fun here, check your pulse!",
  "This is an area of Austin that has trendy shops, artisan crafts,art galleries and good restaurants.   Add to your Austin itinerary you won't be disappointed.  Hotel  San Jose is a great place to stay as well as South Congress Hotel \nWill I Go Back?  Yes.  So much more to see and do.  Don't forget to go into western stores for boots and the costume shop",
  "This stretch of South Congress Avenue will keep you occupied and happy for days.  You can divide it up into categories: food and drink; music; shops; and, of course, people watching.  The Continental Club and C-boys are two of the great music venues I visited.  Stop at Amy's Ice Cream for amazing flavors and add-ins.  The food -- pretty much anything you like is there.  Try Guero's for Tex-Mex.  Just strolling around, you'll find shops that sell everything from cowboy boots to musical instruments to hip clothing.",
  "Each time we visit Austin, we try to come here to spend some time, walking up & down the street & visiting the unique shops & restaurants.\nThis visit we spent a 2 hours cruising up one side & down the other of this street.\nWe stopped in a bunch of shops to see their unique items. \n@ negatives - I don't like the prking on SoCo where you have to back in.\nThe other thing is the amount of new construction here. They are building large buildings & taking away some of the cool vibe this area has. Growth is not always good.",
  "We were looking at finding something WEIRD to take home from Austin.  Had nice time.  The orginal Torchy Tacos' is near by.  Wish we would have seen that before we had to leave.",
  " love SoCo! Great food, music, and shopping. What more do you need? As an Austinite, this is where I love to hangout. Parking may be a bit tricky depending on what time you go but you can always Uber. A tourist must-do!",
  "It's fun to walk up and down to visit the shops and get some food. I usually like to park on a side street rather than navigate parking on Congress itself."
 ]
},{
 "name": "Thinkery",
 "address": "1830 Simond Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/f6/7a/14/main-playroom.jpg",
 "tags": [
  "kids",
  "learn",
  "free",
  "family",
  "walking",
  "kids",
  "creative",
  "kids",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d5826856-Reviews-Thinkery-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great children’s museum! We visited on a Saturday morning with our ten month old for their “baby bloomers” activities and it was wonderful! It was so nice to be able to explore the museum a bit without older kids around and our son loved the story time. We stayed after the museum opened to all and played in the toddler space for a bit before heading out for nap time. Overall, a great morning and I wish all children’s museums had dedicated time for their youngest guests like this. ",
  "We visited with our three children aged 8, 4 and 2 and they had an amazing time. Coming from the UK where children's museums aren't that common (the Science Museum in London is the only comparable example I can think of), they couldn't believe that such a fun place existed. Even I didn't know that such fun places existed! They spent hours going from room to room exploring and going back to their favourite activities. I was myself very impressed with the quality of the activities, how clever they were and what a fabulous opportunity to learn they were for children of all ages. I only wish this concept was brought to Europe!",
  "Visiting Austin for a few days from Houston, we have a multiple-museum pass from the Children's Museum in Houston....so it's great that our family of four got free admission.\n\nWeekend was crowded, but the kids really enjoyed 3 hours there.\n\nGuy at the desk said something about parking validation, but it was not easily marked.  We ended up parking on the other side of the lake and walking.  Oh well....not sure there is free parking or not.",
  "Superb entertainment center with creative, educational, engaging activities for children between 3 to 10 years of age or so.  My6 year old spent about ten hours at The Thinkery today. Not too many places can retain a child’s interest for that long. ",
  "We werein Austin visiting relatives & wantd to take our grandkids to a fun place.\nWe were here before last visitin October & the grandkids were happy to go here again.\nThere is a great variety of fun things to do for kids of all ages. We stayed until closing & the kids could have stayed longer.\nThis place is fun, entertaining, & has things for kids of all ages to enjoy.",
  "Thinkery is a special place that each of our grandkids really enjoy. There is a wide variety so that each child can find the experiences they most connect with.",
  "A good place for younger kids to explore new things and a place for kids to show there creativity. It is really nice to see kids exploring and enjoying every bit of it.",
  "It was an absolute delight to be here with my 2 young kids. Lots to do for them, so keeps them heavily occupied. Tickets are pricey but worth it."
 ]
},{
 "name": "I Love You So Much Mural",
 "address": "1300 S Congress Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/61/8e/dc/amusing-mural-october.jpg",
 "tags": [
  "family",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d8011919-Reviews-I_Love_You_So_Much_Mural-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "While visiting Austin we stopped by this landmark to snap a family photo. Parking can be interesting in the vicinity so plan accordingly. But, it's a fun place to capture a memory while visiting the city. ",
  "You have to go visit the I Love You Mural if you are in Austin, it is a must visit, so see it and take a picture of it, to remember it",
  "Don't drive to South Congress for this, but while you're enjoying the day shopping there, why not pose for the picture.",
  "Less than 1/2 block from Austin Motel on side of Joe's Coffee.  There was sometimes a long line for pictures. ",
  "Alashmi customer care number 8515037960//8515037960 help refund ke liye call kare thank you so muchh",
  "Ok murul that we visited as part of a tour booked through viator with tour austin. Would thoroughly recommend this tour. ",
  "There was a line to take photos with the mural. instead of people taking it from different angles they all wanted to be right up on the wall. it was super annoying. and i wasnt about to wait 15 mins just to take a picture.",
  "Great coffee next door !  Try the espresso and watch the visitors shopping along south Congress. Great for photos!"
 ]
},{
 "name": "The Domain",
 "address": "11410 Century Oaks Ter",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/86/21/27/the-domain.jpg",
 "tags": [
  "walk",
  "food",
  "kids",
  "free",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d1487717-Reviews-The_Domain-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I really loved this mall very nice stores, great atmosphere, nice restaurants plenty of parking love everything",
  "Outdoor mall with a load of great restaurants, shops and things to do. \nNice in the evening for either a lovely dinner or a quick nosh. ",
  "Great shopping with both large brand retailers such as Macy’s, cute little boutiques as well as designer brands like Burberry and Prada.\n\nNice restaurants and cafes. It’s a mix of chains and locally owned stores and restaurants.\n\nPlenty of parking, both lots and covered.",
  "There are lots of shops in this mall, from H&M to Louis Vuitton. And the restaurant selection is wide. You can have California Pizza, Kona Grill or Blackfinn Ameripub as well as many others. Parking is not a problem with valet in front of some of the restaurants. If you are really lucky you can live there too!",
  "After visiting Austin and making weekend trips for many years, we were so impressed with our visit to the Domain this past weekend.  Park in the garage parking folks... don't sit in the traffic, park conveniently and get out and walk!",
  "watch out if you are here with teenage girls who like to shop.  Nice stores, plenty of dining options, easy access parking; but street winds through the center of the mall.  There are residences on site.",
  "a basically outdoor mall.  every year it seems to be expanding. lots of big name stores and food. plenty of parking just remember where you left the vehicle.",
  "THE place to be right now, day or night, with kids or without.  All the beautiful people, cars, restaurants, stores and bars.  All the people watching, even if it is only the people who think they are interesting.  Yes it it just a collection of very high end chains and its time will pass but this is where the action is today.  ",
  "The Domain is literally like Downtown Austin except for it has free parking and is not around the lake. If you can do away with these 2 things, then it has everything to offer for each age group. Yes, there are a tad bit pricey places here there are too many options so everyone could enjoy. It has almost 200 shops and eating places so getting bored in the Domain is quite a task. Highly recommend!",
  "I love to stay within the area every time I come to Austin. This area has everything; shopping, places to eat, and places to stay. I would recommend anyone coming from out of town to see the Domain and what it has to offer.",
  "The place is known for eating, shopping and roaming around. There are many shops and restaurants in the area. People enjoy their weekend and festive time. "
 ]
},{
 "name": "The Moody Theater",
 "address": "310 W 2nd St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/eb/b5/4e/the-moody-theater.jpg",
 "tags": [
  "theatre",
  "music",
  "performance",
  "music",
  "tour",
  "free",
  "learn",
  "history",
  "unique",
  "free",
  "history",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d2477886-Reviews-The_Moody_Theater-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great smaller venue of 2,750 seating capacity. Saw Bill Burr Live (very funny comedian). Good air conditioning and decent seats with good lighting. You will have a good view anywhere in the theater but you know, you get what you pay for so I choose to pay more for up close and personal. They have 2 small bars with limited drinks inside the venue. More concessions outside. Parking is not easy so get there early to find street parking or there are metered/parking garages close by. There are bars and restaurants nearby if you are looking to make a night out with your event. ",
  "If you love music, you have to make the pilgrimage to the Moody Theatre at some point in your life (similar to having to experience the Ryman Auditorium in Nashville, even if you aren't a country music fan).  The Moody Theatre is known as the home of Austin City Limits (ACL) -which you've probably seen or at least heard of through PBS.  As a music venue this is a perfect place to see a concert as there isn't a bad seat in the house.  This was our second experience at the theatre.  We were there to see the Texas Songwriters Hall of Fame Induction ceremony in February 2016.  We had orchestra seats, for this show, but had balcony seats for our first experience two years ago. Seats were awesome on both occasions with good acoustics and easy visibility.  The stage extends out from the theatre walls and is open all around and above which makes for easy viewing from anyplace.  The theatre has concession stands at the rear of the theatre and they do serve alcohol if you're so inclined, but the concession choices were pretty limited.  Don't look for Tee Shirts or souvenirs as they do not sell them (this is all about the music).  I will go again to see anything at this theatre next time I'm in town.",
  "First time visit and really enjoyed the place. It feels so intimate yet it can hold a number of people. Prices for drinks were very reasonable and there is plenty of things to do, eat/drink, around before and after the performance. Parking can be a bit tedious at the City Hall across the street but there are other options. Nice views too. The place hosts a number of performers from comedian to music, etc. Worth visiting!",
  "Had a great first experience here over Valentine's weekend.  We were in the top balcony on the first row and it was legit.  There is a bar on that level and restrooms too, so if those are the best seats you can get for an event don't hesitate to buy.  I would have loved to have been on the floor, but wasn't a possibility for this show.  BTW  Kenny Wayne Sheppard and DB II tore it up along with SRV's Double Trouble drummer Chris Layton.  They did a blistering SRV set that was worth the price of admission!  Would love to come back for a taping of Austin City Limits.",
  "We were in town to visit our son and decided if we're in Austin we have to go to ACL.  So we bought tickets for Ozomatli & Los Lobos.  Took the tour the morning of the concert, partially to get the lay of the land when it wasn't crowded.  Concert was great to learn the history of ACL and the theater and all the unique features that were built into it.  Lots of free swag at the concert and a great show.",
  "Worth going to because of its iconic status and history which is on display but not overkill. Lots of free swag, or at least a little bit, in the foyer area. Five star review is because the sound was exceptional and the seating is good too. Nothing not to like. ",
  "Not a bad seat in the house and the sound is great. However, since Ticketmaster took over for Ticketfly, it has been nothing short of horrific to get seats online. You get the 'its not you, it's us\" for hours. Hopefully, they get it fixed soon because I am giving up on shows simply because they can't deliver a ticket.",
  "Went to a concert there-saw Seal- in balcony and an awesome seat! Sound was amazing and venue is on the smaller size and intimate. While in third floor lobby, saw some awesome photos they you were not allowed to take pics of. Some guy last named Marshall took them😏!\nNext day I went back to take a tour and Incubus was setting up for a two night run. Highly recommend taking a tour. Super informative and well worth the price of admission for the slightly over an hour walk through the building. Austin City Limits is actually filmed there! "
 ]
},{
 "name": "Barton Creek Greenbelt",
 "address": "200 S Lamar Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/32/28/c1/barton-creek-greenbelt.jpg",
 "tags": [
  "nature",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d558711-Reviews-Barton_Creek_Greenbelt-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a definite asset in Austin, but we were confused by the different accounts of how to find the trail heads and where to park. Once on the trail, it was quite lovely.",
  "If you need a little bit of nature in your day, and want some solitude amongst busy Austin, this is a great place to walking or hiking. You can go for a long or short walk, either way you'll be refreshed.",
  "This is a pleasant green space with good trails. Be aware that it gets very crowded on weekends and that the parking is limited.",
  "One of my favorite urban trails, the BCG has a miles of trails and limestone walls. Climbers, mountain-bikers, hikers, dog-walkers, and creek swimmers (when the water is up) compete for space on this popular trail. That said, get on it early and the beauty will be difficult to ignore so close to an impressive downtown.",
  "We read about this being one of the top runs in Austin. Holy ankle breaker! I was cool and a definite challenge but be very careful.  Lots and lots of rock dancing.  Don't come with a pace in mind and plan to stop and explore.  We enjoyed it but it wasn't as we thought"
 ]
},{
 "name": "University of Texas at Austin",
 "address": "Guadalupe and I-35 Martin Luther King Jr. Blvd. and 26th St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/fc/b6/5d/ut-tower.jpg",
 "tags": [
  "free",
  "walk",
  "eat",
  "library",
  "walk",
  "tour",
  "art",
  "tour",
  "walking",
  "tour",
  "unique",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d144288-Reviews-University_of_Texas_at_Austin-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "The campus is beautiful to walk around, the tower offers tours up to the top, behind it is a turtle pond where dozens of turtles are always sunbathing. The newly constructed path commonly refered to as the \"yellow brick road\" which runs through campus is convenint and (car) traffic free. New buildings and renovations add a nice modern flare to the historical architecture and statues. ",
  "After visiting the LBJ Library and Museum, we walked across the campus to the campus bookstore, which is called the Co-op. We were impressed with how polite people were who we came in contact with, and how happy they were to help with directions.We enjoyed the walk (less than a mile each way), with friendly squirrels to watch, and beautiful buildings to admire. Near the Co-Op, there are stores and places to eat aplenty. A great place to visit while in Austin.",
  "Toured the beautiful campus. Love how close everything seems for such a large campus.  Tour buses drove right through the center of campus during the day and doesn't bother the flow of campus. ",
  "We enjoyed a Women's Basketball game on a Sunday morning. It was a great venue to watch a game and witness some great DI women's basketball in Austin. ",
  "A HUGE campus that is very well maintained and beautiful. The architecture was beautiful. The growth of Austin is mind boggling. Definitely worth the visit.",
  "Between the seven museums and galleries and the public art and the architecture it is very easy to fill your time up here. And there is also all sorts of high calibre sports going on, not just football. If you go to their events site and you filter out the every day repeating events, which tend to be wanting students to take part in research, there are constantly guest speakers and other educational programs that are geared to the public.",
  "Walking through the UT campus is relaxing. There are trees and fountains, and a lot of 1930's Spanish style buildings. The new buildings are also attractive.  \n\nHint #1: Take the UT Tower tour \n\nHint #2: Stop by the Student Union for coffee, adult beverages and some bowling (in the basement).",
  "The University of Texas at Austin campus has classic charm as well as modern buildings. The original 40 acres is a wonderful place to stroll and soak up the setting. Tour the Tower for a unique view of the campus from high above and see the bullet hole scars from one of the darkest days in UT history. "
 ]
},{
 "name": "The Blanton Museum of Art",
 "address": "200 E Martin Luther King Jr Blvd at Congress Ave University of Texas at Austin",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/af/05/93/how-to-build-cathedrals.jpg",
 "tags": [
  "art",
  "art",
  "art",
  "food",
  "kids",
  "free",
  "free",
  "walk",
  "free",
  "walk",
  "art",
  "art",
  "music",
  "art",
  "art",
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d139504-Reviews-The_Blanton_Museum_of_Art-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fantastic art museum located in the heart of Austin! The museum is detailed, well arranged and overall had a very beautiful vibe. When I visited, there were two special exhibitions going on hosted on the first floor - Arte Sin Fronteras and Medieval Monsters. The former highlights some of the works of Chicanx paintmakers produced at the Self Help Graphics Studio in Los Angeles and the latter dealt with how monsters, in the form of giants, demons, dragons etc were depicted in medieval times' art and literature. Both these sets of exhibits are on display from 10/27/2019 till 01/12/2020.\n\nThe second floor of the museum is divided into multiple sections, which can be navigated with a helpful map they hand to you at the front desk. I was particularly fascinated by some of the displays in Contemporary Latin American Art, Spanish Americas section and the Paper Vault. There was also a display of the works of Charles White, which will be on till December 1, 2019. There are a number of other sections as well, like Modern Art, Art of the American West, Ancient Americas, European Art etc to name a few. Their collection is quite huge and magnificent.\n\nThere is a cafe opposite to the museum entrance and besides the cafe, they have a gift shop as well. The entry fee is $12 for adults, and the price is discounted for  college students, youth etc. I ended up spending over 4 hours in this place, if you are a connoisseur or art, plan on spending quite a lot of time at The Blanton Museum!",
  "We went to discover the peaceful and emotive  Ellsworth Kelly chapel and loved the museum, it's Fernandez' walls, the current exhibit wordMatters is very well curated, the staff stopped to give us further information, a really recommend it",
  "Very nice museum for UT to have on it’s campus. Includes a good selection of European paintings- mostly Italian and Spanish, and  American Modern Art. There was one gallery with a selection of Western American paintings, too.  They also typically have 1-2 temporary exhibits on display.  I was surprised .  They had a broader and more impressive collection then I had anticipated.  There is also a small, chapel type building called Ellsworth Kelly’s Austin,  just outside the main building. It was opened just a yr or so ago and is worth a stop. Enjoy!",
  "We went to the Blanton for the first time during an exhibit that features a collection of art from alumni of the University.  We took our kids (5 and 7) with us, and this was their first trip to an art museum.  \n\nThe art on display was diverse, ranging from Monet and Picasso to traditional European art and contemporary art.  \n\nAs someone who knows little about art, it would have been nice to have a guide or booklet that tells you about the art, its significance, and so on.  There were staff readily available to answer brief questions and to make sure that no one got too close to the paintings.  I did see a sign that they offer guided tours on a certain day of the week (can't remember which one). \n\nThere is a cafe too, with better than expected food.  Although the menu is somewhat limited (flatbread pizzas, sandwiches, and salads), the food was reasonable priced and tasty.\n\nTIPS: \n1.  College students (any college) and seniors get in for a discounted rate.  \n2.  UT students and faculty (any UT system site, not just Austin) get in free.\n3.  Kids less than age 12 were free.  They also had clipboards for the kids with activities and worksheets.\n4.  If you park in the UT parking garage next to the Blanton (follow the signs), bring your parking card in and it is $3 parking for the whole day.  MUCH cheaper than paying the regular garage price.\n5.  Don't bother bringing bags or large purses in with you, as you will need to lock them up.  They have lockers for this purpose that are free of charge.\n\nCheck the website because I also think that they have certain days where admission for everyone is free.",
  "3rd Thursday is FREE!  The building interior is beautifully designed.  Great exhibitions especially the contemporary gallery.  This is at the edge of the UT campus, so don't miss a walk around using the landmark map.",
  "Located on the UT campus, this place is for the most part easy to get to. There is a parking garage nearby for your car and the walk to the museum is only a few minutes. This two story building features several styles of artwork. There are sections which focus on religion, late 1700's to 1800's, Greek statues, and rotating featured exhibits. Thursdays are the best time to go since you can get in for free. The museum also features special events on those nights and other nights throughout the week. Make sure to check out the cafe right across from the museum for a slice of pizza and cup of wine before you head into the museum. ",
  "This is a nice-sized art museum with a variety of art - something to appeal to anyone.  We're not what you would call \"art-enthusiasts\" but we enjoyed the museum.\n\nSide-bar - We are older and had walked quite a bit the day we were there.  We asked if we could get a cab (yes - cab, not Uber) back to our car.  Not only was the answer \"yes\" but they called for the cab and GEORGE WEST actually walked out with us and chatted and waited until we got in our cab.  Now - we're not ancient, we were just tired.  It was an incredibly kind and hospitalble thing to do.  THANK YOU, George!",
  "We enjoyed the art collection very much. We also enjoyed the live music while we were visiting.  They possess some great art and sculptures in this museum. ",
  "Even though we are members, it had been several years since my wife and I visited the Blanton Museum of Art.  Looking for a weekend getaway to Austin, one of the activities we had on our list was a visit to the Blanton.  We wanted to see the special exhibit - The Avant-Garde Networks of Amauta: Argentina, Mexico, and Peru in the 1920s - as well as become reacquainted with the rest of the museum.  We also visited the Ellsworth Kelly building, completed in 2018.  This was a thoroughly enjoyable visit.  The Blanton is an excellent art museum.",
  "This was a nice addition to our stop in Austin.  It had a nice mixture of modern as well as traditional art pieces.  The entrance was free for Veterans, which was a very nice gesture as well.",
  "Beautiful museum - We went when the Avant-Garde Networks of Amauta -Argentina, Mexico and Peru in the 1920's installation was there. Only there till May 17 2020.  Worth going to see.  I would have loved to go back on a sunny day and experienced the Ellsworth Kelly building with the sun pouring through the windows.  The day we went it was cloudy and rainy.  Lucky for us one of the guides had pictures on her phone and she shared them with us.  Wow - I think this would be so worth going back to see on a sunny day.  And by accident we went on a Thursday (due to the weather) and it turned out to be free.  Parking is very close by as well."
 ]
},{
 "name": "Austin Zoo",
 "address": "10808 Rawhide Trl",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/02/d8/69/austin-zoo.jpg",
 "tags": [
  "food",
  "eat",
  "walking",
  "kids",
  "tour",
  "pets",
  "kids",
  "kids",
  "kids",
  "kids",
  "walking",
  "food",
  "walk",
  "free",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d108229-Reviews-Austin_Zoo-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Being located so close to my home I regularly visit this place and have a membership.  This is not an AZA-accredited zoo but a rescue animal facility.  It is situated in a hill country setting and nested under live oak trees. It is small, but has a lot of animals to see and close up. Most animals have names.\n\nIt does have the setting like the big zoos where you will finds varieties of monkeys, big cats, reptiles, birds and bears. There is a small train which is always fun to ride. You can feed animals like goats, llamas, sheep and deer. If hungry then there a concession stand that sells small food items like hot dogs and snacks.  On some days a food trailer is present.  Many people with kids bring there own food and snacks.  When you enter the zoo you will find some souvenirs and drinks to purchase. \n\nYou may see some animals sleeping away but if you are here for morning or evening feeding times then the animals are awake and ready to eat.  The staff also gives some animals presentations and look out for the signs with times.  \n\nThey also do special events like Boo at the Zoo during Halloween.  In general, you will get your walking here while seeing the animals, and kids here will have a great time.",
  "We were lucky enough to get a private tour thanks to a GHA/Omni Local Experience and really enjoyed meeting its Director, Patti Clark.The Zoo has the admirable mission of not existing at all - specifically, without the need to rescue abused, injured and abandoned animals, since they don't breed animals in captivity here. \n\nPatti could relay every story of each animal on our tour, and although many of its inhabitants were transfers from closed pet stores and zoos, the majority were exotic pets from owners who never considered what happens when a bear, panther or alligator grow up. This zoo is the final destination for these animals where they get to live out the rest of their days without transfer.\n\nWhile there are no giraffes, polar bears or theme park rides, there's an enthusiastic and friendly staff caring for several hundred animals that otherwise most likely would have been euthanized. This non-profit is continuously building new enclosures and facilities and hosts daily programs and talks for kids and adults alike, in its effort to house animals from the 40-50 calls they get every month.\n\nAustin Zoo is not a flashy place and doesn't have multi-million dollar enclosures and exhibits. You can see your entrance fee and donations in action, and the focus is on providing the best possible support for rescued animals. I'd strongly recommend visiting - kids will always love a trip to the zoo - but for adults the ethical mission is the real draw.",
  "Visited the zoo with my husband. This is a small zoo but it's a non profit place where they dedicate their work to rescued animals. It's a great cause. This is a really nice place to go with small kids, they will enjoy the short train ride. You can make donations and sponsor animals if you like. ",
  "Many reviewers seem disappointed in the look of the zoo and the fact that it just sits on dirt. Well, it is a rescue zoo that I assume runs off of donations. I doubt paving paths is a high priority when you are in the business of rescuing animals. It was a bit dusty when we were there, but not unbearable. I do think the name is misleading. It should just be called Austin Animal Rescue and Sanctuary. The \"zoo\" part does not really fit. We went with a 5 and an 8 year old. This was a good place for that age group. My kids enjoyed the lion, as he was very vocal. The goat petting zoo was fun for them. Their is a trainride for an additional fee ($2, i think). The kids liked it. This is not a fancy place by any means, but it is an enjoyable place for kids to see wildlife. Check ahead of time to see if there are any special events. We tried to go one time earlier last year, with our cash in hand, only to find that a special event was going on that required a lot more money. We had to leave as the front desk people would make no exceptions to let kids in at the normal price. But, we will go back, as the kids like it. We'll just be aware of when their special \"we're raising money\" days are happening.",
  "This is the third time we have been here; loved it everytime. Wonderful rescued animals in natural environments and great staff. Go during the middle of the week while the kids are in school if you can to avoid crowds.",
  "The Austin Zoo is more than a zoo, it is an animal sanctuary. Think of the movie We Bought A Zoo and it will give you an idea of what kind of zoo this is. In addition to the exotic animals in enclosures, there are chickens, peacocks and other fowl freely roaming the grounds. The Austin Zoo provides a leisurely couple of hours strollling thru the crushed granite pathways and visiting the many animals that live here and being rewarded with the occassional ROAR of a tiger or lion. Primates, big cats, reptiles, goats, pigs, a bear - oh my! -, wolves, lemures, and more. Volunteers are usually on hand to share the story of the animals and answer your questions. Wear good walking shoes, bring some bottled water (especially during warmer days) and cash for snacks.",
  "I rated this place a 5 because it met my REALISTIC expectations. And how did i get my expectations, I read other reviews.  from which I learned that is place is an animal rescue sanctuary.  Almost all of the animals were either seized by law enforcement, given up by private owners who realized the error of owning an exotic animal, or were transferred there after other zoos suffered damage from hurricanes, etc. most likely, most of the animals would have been euthanized if there was no place for them to go. this place allows them to live out their lives with an acceptable quality of life. if you go to this place expecting it to be on the level of the Bronx or San Diego zoos, you will be very disappointed.  you will be disappointed if you compare it to Waco's cameron park zoo [which i visited the next day]. this zoo's priority is function over form, which is why the wood used in many of the enclosures is unpainted. I saw a variety of animals for less than $10 with a groupon. think of this zoo as a community college with little to no endowment, and the bronx and san diego zoos are the Yale and Harvards with endowments in the billions. if they could get some corporate sponsors. that would make the animal's lives that much better. for comparison, almost every exhibit at Waco's  cameron park zoo, had one or several sponsor plaques at each exhibit. \n\nfinally, i'm always amused at zoo reviews by whiners, who complain of animals not being out in the open or being lethargic. here's a newsflash, most wild animals are lethargic and don't like the hot sun. when whether they live or die is determined if they have enough energy to catch and kill their next meal, of course they will lay around all day until they have to hunt. apparently people think that zoo animals will be more energetic because they don't have to hunt for their next meal.",
  "Calling this place a zoo is really a misnomer.  The animals each have their own story and have been rescued.  This gives rise to a huge variety of animals. They have a variety of animal talks at set times. The small train that goes around sections of the area is a hit with the young ones. You can bring your own food and picnic at the tables located where you first enter.   ",
  "This was a really fun little walk through! Not your typical concrete jungle kind of zoo! It was cute that they did a birthday cake celebration for the bears! Overall we really enjoyed it! The price was very reasonable ",
  "This is a cute little zoo. It  was nice to see how well taken care of the animals are. My son and I really enjoyed seeing all the animals. The weather was great. \nThey have peacocks roaming free and it was fun feeding the goats, sheep and llamas. \nIf you are looking for the San Diego type zoo you won’t like it.  \nAll the money the zoo makes goes back into the zoo. ",
  "Gravel trails, good variety of animals, nice little train to ride around (especially if you bring kids). I had heard that it wasn't great, but it turned out to be a very nice way to get out with the family."
 ]
},{
 "name": "Mayfield Park",
 "address": "3505 W 35th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/1d/88/11/mayfield-park-cottage.jpg",
 "tags": [
  "organized",
  "walking",
  "walking",
  "free",
  "walking",
  "wander",
  "free",
  "approachable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d560368-Reviews-Mayfield_Park-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Peacocks abound o the property, but the park is hard-to-find,  We came early in the morning just before opening hours.  We were walking thru the info grounds as their is no apparent organized tours or guides.  It is a pleasant, quiet, shady space with some uneven walkways throughout the grounds.  There is plenty of parking,  Try and discern the hours and any special events being hosted.  We checked the hours but about 50 minutes after arriving Special Event signs were posted, the gates closed, and we were asked to leave immediately, without explanation,",
  "Mayfield Park is a quick 10 minutes from downtown, and has walking/hiking paths and peacocks on the grounds. It's a nice and quiet getaway from the hustle and bustle of the city. Most (if not all) of the peacocks were around the Mayfield House on our visit, which is to the left upon entry. If you're just there to see the peacocks (which we were), knowing that will save you a good 20+ minutes of walking the trails looking for them. If you do go on the paths, you'll find a couple lookout areas over the Colorado River inlet, but watch when walking, the paths are bumpy. (This would have been 3 stars, as I'm not real impressed with Texas \"hiking\" areas, but the peacocks pushed it up to 4).",
  "This is a fun place to visit. You can see over a dozen peacocks roaming the grounds, flying into the trees and roosting on the pergola beside the house.  One guy fanned out his tail as a female strolled by, but she didn’t seem as impressed as we were by his display. Paths wind through ornamental garden plots which are planted and taken care of by nearby residents, so you get a variety of garden looks.  If you need to use a restroom, you will have to use the portable toilet near the parking lot. Like many of the outdoor attractions in the Austin area, the paths are uneven.",
  "My son's girlfriend took me here on my last day in Austin. What a surprise. She didn't tell me where we were going or what to expect. I walked into a beautiful, serene area with lots of peacocks, great gardens and a few ponds. \n\nThe cottage was lovely. It was obvious that this property was a labor of love over the years. I had a wonderful time and would go back if I'm ever in Austin.\n\nI wish the visiting parents and children had been more respectful of the serenity and the birds, though. They were loud, running and jumping. I tried to understand that they had probably been \"social distancing\" and needed to exert energy, but a more appropriate place could have been found.",
  "Free park with limited parking, but street parking is available.  Peacocks preserve is located here and it is nice tO see free range peacocks.  They are so pretty and there are nice grounds to enjoy with ponds and koi.  Very peaceful even with a crowd of people.  \n\nThere are nice way walking trails to see greenery and part of the lake.\n\nBudget 35 minutes for trail walking and seeing peacocks.  \n\nCovert Park is up the street, go there  first or next for adventures in this area.",
  "We had a lovely, romantic visit to Mayfield Park. We explored the hiking trails, sat on a bench in the garden to people-watch, and took photos of the peacocks. The peacocks are fairly fearless of visitors, but mind their own business. There are males and females and they wander around on the grounds of the garden, on building roofs, and sometimes in trees. Normally we prefer to go to places where we can take our dog, but it was nice to have a break from dogs and just enjoy ourselves, the surroundings, and the other visitors. The porta potties were gross, but maybe they're better on weekdays or earlier in the week. Bring your own hand sanitizer.",
  "This place is really great. They have live peacocks just roaming around. We love coming here when in town!! ",
  "Don’t think it’s on a tourists list, but the quiet serene park is filled with beautiful plants and lots of peacocks. Ponds with koi fish as well. We all in Texas can’t get to Shinjuku national park in Tokyo on a daily basis so this is an approachable destination in its leiu, and free :)"
 ]
},{
 "name": "Circuit of The Americas",
 "address": "9201 Circuit of the Americas Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/6d/71/33/home-of-the-world-championship.jpg",
 "tags": [
  "food",
  "food",
  "food",
  "drink",
  "drink",
  "food",
  "walk",
  "walking",
  "food",
  "active",
  "walking",
  "free",
  "food",
  "family",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d3645477-Reviews-Circuit_of_The_Americas-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great track excellent facilities, good food, drinks and souvenir outlets. All were busy but service was quick so no problem.\n\nThe only downside was as a result of poor weather which meant car park  (lotF) on the Friday was turned into a mud bath. The signage told us to park with drive wheels on the hard surface. This message clearly had not been passed to staff in the parking lot who ordered us to park behind another car on the grass. Result we and others were stuck in mud for over an hour!,",
  "I’ve been to a number of tracks around the country and in Europe, but COTA has become my favorite !  The arrangement of the track and amenities seems to have been designed not only with the drivers in mind, but also with the fans in mind.  Food venues are plentiful and easily accessible and there are plenty of great viewing areas that are available even with general admission tickets.  There are also a number of club venues available for those willing to spend the money.",
  "what a circuit ! very impressed.\ntried most of the grandstands out and the best seating for me was grandstand 1 and grandstand 15, i also had a ticket for the main grandstand as well which got me into the lounge area on the 2nd floor which was well worth it. (full air con and food and drink)\nif going to main grandstand try to avoid east and west sides as they are overpriced and very noisy if on the front row",
  "The place is a sprawling race complex. You can easily walk 3 miles checking out all of the vendors and watching the race from different corners. Make sure to bring your wallet as the food and drink options can break the bank!",
  "This is simply an amazing track.  There is no track in the world that can rival this track for its layout, seating, and spectator areas.  You can see just about every corner, and the Turn 1 and Turn 15 grandstands let you see multiple.  Our tickets were in the Turn 1 grandstand, and we could see the start, turns 1 and 2, and the back portion of the track.  We walked around the track, and just about every corner can be seen from a grandstand or from a general admission hillside.  Since this was a MotoGP weekend, there were plenty of vendors, and the variety of motorcycle gear was really good.  There are plenty of hotels in the Austin area, and the track is 5 minutes from a major airport.  In short, I have never seen a venue in the US like this one that rivals the best tracks in Europe, and in some ways, is far better.  The staff were courteous and friendly, and in many cases, went out of there way to be helpful.  The day of the race, Red Bull had a stunt plane doing aerobatics, stunt riders in front of the grandstands, and parachutists to entertain the crowd.  There were also plenty of TV screens that covered the race, and they were active all weekend.  As far as facilities, the bathrooms were clean, and there were plenty of food options.  \n\nHad this review been just about the track and the MotoGP race I attended, it would have been 5 stars.  However, there were first issues with parking and transportation.  Parking on the first day was simply awful.  Parking passes sold out long before the event, so we had to find a cash lot.  However, the cash lots were not marked.  Some lots were closed, so we drove around in a traffic jam until we found the correct lot on the far side of the track.  Even the parking staff had no idea what was going on.  Shuttles were provided to grandstands early in the day, but late in the, none were to be found.  The cash lots cost $30 each day, so I expected better preparation.  Again, the staff tried to be helpful, but they knew little more than we did.  Ultimately, there was too much evidence that track management woefully underestimated the demand for parking and failed to prepare for the attendance.  Demand for food and merchandise was also terribly under-estimated.  We waited in line for 40 minutes for lunch on Sunday before giving up and going back to our seats.  There is also little transportation within the track, so if you want to go to the far side of the track, or to another turn, you are walking, so bring good shoes (the grassy areas are more rocky than grassy).  I have to expect that next year track management will be better prepared for the crowds.\n\nIn all, once we figured out where to park, and how to get around, we enjoyed ourselves immensely.",
  "This is a fantastic venue for racing and a fun time.  If you're into racing at all you should attend an event here. Make sure you have good shoes because you'll do a lot of walking",
  "The circuit of America features so many different races it's hard to list them all. These are photos from the recent LeMans which is a 6-hour race of the WEC championship. They also have the MotoGP motorcycle races and the Formula 1. They have many concerts and so many other events it's hard to list them all, but it is a must go to destination and it is the only purpose-built race track in the United States of America",
  "Just visited for the first time for the Lone Star Le Mans Race.  What a blast.\n\nThe staff as you enter the property were all friendly and helpful.  We thoroughly enjoyed the go kart racing where it was very well organised, great value for money and run by more great and friendly staff..   The zip line is more exhilarating than I thought it would be and again - the staff - awesome.  We went up the tower where we got to enjoy some of the race, see all of the track, see downtown, watch planes take of from the airport and surprisingly the staff on the ground and even in the elevator were super friendly.  We had food from several venues in the grounds all of which were really good.   Will definitely be back.\nPS  they even supply you earplugs for free.",
  "COTA is one of the newest and nicest racing facilities in the world. It is so much fun to meet people from Europe, Asia, Mexico, and South America who have traveled to COTA for the F1 race weekend events. You should join us next year. ",
  "Tested out going to my first F1 event by going to this one the full 3 day weekend since Austin is not far from Albuquerque and dropping a boatload of cash.  If this is how other F1 events that are allegedly extravagant multi, multi million $ events, I am one and done-just so poorly project managed (coming from a certified PMI PM here).  Where to start?  Well, the shuttles from the parking lots-an unmitigated disaster overall.  No clarity on the run times and misinfo from your low cost at the margin staff.  On Friday night after the practices trying to get back to your sad parking lot there were NO SHUTTLES running at around 6:30/7.  What?  Thanks-I had to walk about 1 mile or so after a long day walking around the site.  The worst was on Sunday right after the race.  Again NO SHUTTLES-your less than bright staff said that they were not running because attendees were walking on the road.  What-that makes no sense whatsoever-and they were typical Texas rude about it?  We had no issue getting a shuttle in the morning on both Sat./Sun. but this was a complete and utter joke-it made no sense.  And your location?  I have to imagine it is probably the worst out of the about 20 out there but really-two lane roads IN AND OUT.  At 4 pm on Sunday it took 2 HOURS to move 200 yards from our parking spot.  The system?  Of course, there was none-no staff directing traffic.  Just a completely pathetic experience and in general hired staff really didn't care on average. And the sound system?  Almost Third World like when I go to visit my wife's family in Cartagena Colombia to see a soccer match-really hard to understand what the announcer is saying on the PA system.  But again, based on previous experiences visiting Austin and other spots in the lone star state, it doesn't surprise me.  Everything is just worse in Texas and this was no different-there is just a completely difference level of laziness that dominates how things are run on average there compared to other sporting events I have attended in the US.  I will never be back.",
  "I get that stadium-type venues will necessarily be spread out... but I think we walked 2 miles from my car to the venue to see Mumford and Sons.  Concessions are crazy expensive but expected for a captive audience.  Good vantage point to the band with our standing room only tickets in front of the stage."
 ]
},{
 "name": "Stevie Ray Vaughan Statue",
 "address": "Riverside Drive & South First Street Adjacent to Auditorium Shores",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/f7/62/c9/me-and-srv.jpg",
 "tags": [
  "tour",
  "history",
  "hike",
  "music",
  "walk",
  "tour",
  "walking",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d144291-Reviews-Stevie_Ray_Vaughan_Statue-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was a stop on a musical history Austin tour we took with a work group. It’s situated right on the banks of Lady Bird Lake, and is in an amazingly relaxing spot-according to our guide, it was Stevie Ray’s favorite place to perform, so pretty neat. ",
  "Had to stop by and pay tribute to Stevie Ray Vaughn\nRight on the river in downtown Austin\nWent home and listened to Texas Flood\nRIP Stevie",
  "Located on the south side of the Colorado River on the Ann and Roy Butler Hike and Bike Trail in Auditorium Shores at Town Lake (between the 1st Street Bridge and the Lamar Street Bridge) the larger than life bronze sculpture of blues guitar legend Stevie Ray Vaughan, an adopted son of Austin who was killed in a helicopter crash in 1990 is a tribute to an outstanding musical personality. It is hard to say who is more popular in Austin Stevie Ray Vaughan or Willie Nelson. I have been to the statue several times and there seems to be something sacred about the statue, almost as if he was a saint. In my book, he was a saint in the world of blues music.  ",
  "Who doesn't like Stevie Ray Vaughan? Glad to see a statue on the river walk associated with such a great musician.",
  "Interesting story. We saw from boat tour. Beautiful area. Off leash dog park close (dogs can get in river). ",
  "Located alongside the Colorado River as it meanders through downtown Austin, the very well-done statue is a nice tribute to one the all-time great blues guitarists and vocalists. Located in a nice, large park that is great for jogging and dog walking. Ample parking.",
  "I enjoyed seeing the Stevie Ray Vaughn statue while strolling on a trail alongside the river. Beautiful view of downtown is behind the attraction as well.",
  "Walk with my wife and the dogs on this portion of the hike and bike trail earlier today. Pass the statue of Stevie Ray Vaughan. Unfortunately, there were a bunch of electric scooter scattered around. But, it’s a nice statue and tribute to this fellow. There was a haze over the lake based on the temperature, and there was a nice view of downtown from behind and around the statue."
 ]
},{
 "name": "Texas Military Forces Museum",
 "address": "2200 W 35th St Building 6 Camp Mabry",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/2c/37/58/texas-military-forces.jpg",
 "tags": [
  "history",
  "kids",
  "free",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d1853373-Reviews-Texas_Military_Forces_Museum-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We saw tanks, trucks, and equipment from all different years and wars.  VERY interesting.  We had a greeter who filled us in on a lot of the history surrounding us.  MANY exhibits to see and humble you as you see what all these brave men and women did and continue to do serving our country!  There was a little gift shop area we got the kids some things to bring home from our trip.  Lots to see outside , plenty of photo opportunities also.",
  "The museum is located in Camp Mabry and you must go through a check point to enter the camp. The only entrance that was open when I visited (2/9/20) was from 35th Street due to construction closing the 45th Street entrance. From 35th Street it is a long drive through the camp to the museum. There are signs to assist you in finding the museum. Admission is free (there is a donation box, if you would like to do so). There are many weapons and vehicles on display inside and outside of the museum. There is a good history of Texas' involvement in military activity from their revolution from Mexico to modern times. There is a gift shop near the entrance/exit.",
  "Camp Mabry, a living museum in itself, hosts the museum in Building 6.  The museum provides an excellent overview of the military history of Texas from the Spanish colonization to Afghanistan.  Every visitor should watch the video of \"lost battalion\" about the POW who spent years in Japanese prison camps. I liked the tanks, big guns, Piper Cubs, and sitting in the F-16 cockpit.  Don't forget to drive down Armor Row to see more tanks, big guns, and Armored Personnel Carriers.",
  "Very worth while visit.  Museum located on Camp Mabry national guard base.  Just show your ID at the gate and sign in.",
  "I am not sure how more folks don't know about this museum.  It's that good.  There are all sorts of military hardware to look at.  There's old stuff and more modern stuff.  There's WW1 and WW2 stuff.  The WW2 portion of the museum is incredibly detailed.  If you read everything in there alone it would take you three hours to get through.  There are all sorts of interesting narratives all over the place."
 ]
},{
 "name": "Austin City Limits Live",
 "address": "310 W 2nd St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5f/ec/72/day-3-the-dead-weather.jpg",
 "tags": [
  "music",
  "organized",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d527369-Reviews-Austin_City_Limits_Live-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Hall of fame \nShawn covlin , buddy guy  ,   Lyle Lovett\n100 percent 🎩  show , Robert earl keen xc\n#porkmafia inda house ",
  "Unless you want a really large venue, I think this is the best place to see a concert, hands down. Great acoustics. I usually try to get one of the first few rows of the balcony, which I think is better value than the mezzanine or (often times) standing on the floor. Security is thorough but the line moves fast. Parking at the garage underneath City Hall is $10 and is relatively easy to get in, and out of when the concert is over. There is an inside stair exit that is a straight shot down to the street, and gets you out after the concert without having to move slowly in a line of hundreds of people.\n\nOnly criticism would be there is but a single men’s room on the balcony level floor on one end, which can get crowded.",
  "The seating patterns and sound quality make this the perfect setting for great live music.  Seats were average but comfortable enough.  There are bars inside to get a variety of drinks.  The stage and sound system were great too.",
  "Attended an ABBAmania concert there last week and had an amazing and fun time. The venue is very nice, acoustically designed and the staff were organized and friendly. I can’t wait to attend another live music event there.",
  "We were recently in Austin for a few days.  Having watched a lot of Austin City Limits on television over the years, catching a show at ACL Live at the Moody was a priority.  We were fortunate enough to land tickets to see Big Head Todd and the Monsters.  The show was very good ... but, moreover the venue is awesome.  We were seated center stage, but in the very last row in the balcony.  The sound was great.  We had an unobstructed, good view of the entire stage.  I would sit in the back row again!  Kind of like the Ryman Auditorium ... ACL Live at the Moody is a “bucket list” sort of venue! ",
  "Saw Weezer there - was a private gig with around 2000 people and was an excellent night. Different levels with bars everywhere.",
  "The venue is gorgeous. The furthest seat is only 165’ from the stage and still a great view. The sound system is second to nowhere.",
  "Hall of fame \nShawn covlin , buddy guy  ,   Lyle Lovett\n100 percent 🎩  show , Robert earl keen xc\n#porkmafia inda house "
 ]
},{
 "name": "HOPE Outdoor Gallery",
 "address": "1008 Baylor St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/58/2d/ec/you-can-stand-at-the.jpg",
 "tags": [
  "art",
  "art",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d3974258-Reviews-HOPE_Outdoor_Gallery-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Probably once was a cool site, but now it is guarded by a chain link fence.   Unfortunately, some paintings (of what appears to be the original work painted by truly talented artists), have been painted over by amateur graffiti artists.  If it is a nice day and you don't have anything else to do, you might want to stop by but I wouldn't go out of my way to see it.",
  "The art was so neat to see. Bummed they closed it down, so we had to see it through a fence. But excited to see what the new place will look like. Though it takes away from the rusty feel of street art when it will be a museum :(",
  "We loved the art!  ..the colors, individuality, yet the overarching theme of Hope always resides just above our lowest or highest intentions.  This gallery represents our collective thoughts and ideas, while also calling us forth!",
  "...but it was an amazing array of wall art...absolutely incredible talent. There were plenty of people peering through the chain link fence admiring the paintings.  We were in an Uber car and the driver asked permission if he could go a block out of our way to view the \"Urban Art\".  ",
  "I must say there is some really cool art throughout the area.  I have some of the pictures I liked. This does remind me of alot of the art I say in NYC and Brooklyn.  "
 ]
},{
 "name": "Austin Central Library, Austin Public Library",
 "address": "701 W. Cesar Chavez Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f9/fa/06/photo0jpg.jpg",
 "tags": [
  "wander",
  "library",
  "free",
  "tour",
  "free",
  "library",
  "art",
  "family",
  "unique",
  "creative",
  "library",
  "kids",
  "walk",
  "library",
  "unique",
  "walking",
  "library",
  "art",
  "library",
  "library",
  "tour",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d13187126-Reviews-Austin_Central_Library_Austin_Public_Library-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Go to the roof top level for city views and a small lovely garden, then explore the outside reading decks, and stop in the 4th floor reading room to view a cool metal piece featuring famous quotes on books and learning.  This library features numerous small gathering areas, laptops for loan by the hour, along with numerous free work workstations.  Tours are available on select days otherwise the volunteer docent will provide a map and highlight areas to see. The outdoor garden areas are also lovely as you wander up Shoul creek.  PS: Parking under the library can be a challenge during the work week - we had to use a public garage.",
  "After taking a group van tour of the city of Austin (from the Austin Visitor Center)\nmy husband and I decided to go back and visit the Austin City Public Library.\nExceptional architecture, natural light, unique designs (rooftop garden) and creative spaces for all users makes this a welcoming place for visitors of all ages.\nSix stories (stairs and elevators available) with wonderful art and a cafe (indoor and outdoor seating) that will please everyone.  Free parking for one hour is available in the parking garage next door.  A must place to visit, a great place to read, research and study, a delightful place to bring the young ones for their own family story time and a place to hang out and meet friends.  Free one hour parking is available next door to the library.  Don't leave Austin without seeing this one-of-a-kind Public Library!",
  "Who said libraries are a thing of the past?  This new library downtown is worth a trip even if you are not looking to do research.  Try the restaurant on the first floor.  Walk the stairs and look at all that has been well laid out.  Check out the kids' section.  Sit in any great seat and read.  But don't forget to walk out to the patio with amazing views.  Go Austin!",
  "Great little restaurant on back side of building had great french toast and coffee there.  Walked through library and it was a quite morning at the start of the Virus scare.",
  "We walked through the library with some locals and were really impressed.  The interior has unique architecture, the outside areas offer very nice views of the downtown area and even the inside areas offer nice views as well.  We’d suggest walking all of the way up and down and outside to explore all floors.  It’s a very inviting space that would be hard to leave with a good book or if we were staying to study.  The meeting rooms are a nice bonus and the technology petting zoo is interesting for all visitors.  There seem to be quite a few events going on.  Kudos to the person who thought to advertise a CD from a local group and also point out where they can be seen/heard live in town.",
  "I am going to give just about any library a five out of five. But this new library is truly a work of art and there seems to be a ton of things happening there so even as a visitor you might want to check there with that schedule to see what would work for you and having a nontraditional tourist experience. We popped in to sit and read for a while and do some printing on the computer and everyone was friendly and helpful and we enjoyed just the beauty.",
  "Huge library! Beautiful through out. Spent hours here just looking through books. This place will fulfill ones thrust for knowledge.",
  "The Austin Library was recommended to us on our city tour and it did not disappoint. The library is beautiful with an interesting staircase inside. The rooftop garden looks like it would be a great place to hang out if it was warmer. The library even as a coffee shop/bar and a gift shop. Yes, I bought a T-shirt. :)"
 ]
},{
 "name": "Zilker Botanical Garden",
 "address": "2220 Barton Springs Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/fa/36/58/filename-100-5154-jpg.jpg",
 "tags": [
  "family",
  "family",
  "walk",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30196-d519727-Reviews-Zilker_Botanical_Garden-Austin_Texas.html",
 "source": "TripAdvisor",
 "reviews": [
  "A tranquil oasis where paths and footbridges meander among streams, ponds, a preserved pioneer village, Japanese garden, tropical plants, butterfly gardens, rose gardens and cacti. This area provides a natural habitat for turtles,  butterflies, bees and other insects. We lived the experience and a great value for minimal entrance fee.",
  "Zilker Botanical Garden is a very beautiful little spot in the city of Austin, TX with it's different garden styles that blend together along with the water features and Koi ponds that give you a wonderful afternoon or whole day if you want of viewing pleasure and that includes some beautiful views of Austin from different parts of the gardens. We had a great time wandering this little gem enjoying every bit of it even though we were between some the blooming times there were plenty of flowers to see and the small donation to get in which was under 5 dollars was amazing I would have been fine with twice that which we did by leaving a little extra in the gift shop. 😊 You should stop if your in Austin and enjoy this precious place.",
  "We went to enjoy family time for my  grown son's birthday.\nWe enjoyed the Japanese Gardens, the various structures, ponds, Rose Garden, Herb Garden, Butterfly Garden, Vegetable Garden, The Native Garden, Cacti and Succulent Gardens and the views",
  "what a magical space with various nooks and crannies to explore. an entrance fee of about $15. there’s a beautiful waterfall, as well as a section about the jurassic period. the zen garden was my favorite. ",
  "Beautiful Floral Gardens. Great place for a family portrait or just to have a nice walk around the gardens. The scenery is spectacular and the aroma is just out of this world. ",
  "Even in early spring this is a great place for a walk through rolling hills.  There was an orchid show to add some color—just fabulous!",
  "There are so many different exhibits available here.  You feel like you are walking through foreign countries as you move from section to section.  The Oriental Gardens are my personal favorite!",
  "Granted I came in winter which not the idea time so it looked a little barren. Saw some carp in the ponds, a couple of butterflies. The pathways were uneven and you must pay attention or risk falling. It was a pleasant stroll but nothing more."
 ]
}]
