[
{
 "name": "Mike the Tiger's Habitat",
 "address": "16 N Stadium Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/46/c1/cc/mike-the-tiger-habitat.jpg",
 "tags": [
  "active",
  "active",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d4886564-Reviews-Mike_the_Tiger_s_Habitat-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of viewing area and Mike likes to play outside.  He also likes his wading pool which is right next to the glass.  He seems to like children.  Don't choose this as a meeting place on days when there is something going on at the stadium or P-Mac. Everybody does.",
  "This is definitely a place to stop before a game. If Mike is out he is very impressive. Don't go just before the game but early before they move  him.",
  "It is always fun to go visit Mike.  Early in the morning is better if you want to see him more active.  When it is hot and humid he tends to stay in one area and not move around as much.",
  "Mike the Tiger's world is a piece of the world designed especially for tiger.  It is a paradise with a running stream with natural bridges that ends in a pool for him to swim in.  He lounges in the stream in the summer and uses the wood tree stumps to sharpen his claws.  He is very active and is mesmerizing to watch.",
  "Mike the Tiger’s Habitat is a fun place to go, especially for LSU fans and the Tiger is well taken care of in his $3,000,000 habitat made possible by generous alumni donations.  See a live celebrity in his well appointed digs!",
  "Caught him at a good time, my wife and I loved interacting with him and got lots of excellent pictures. ",
  "There walk to here is not so bad from the lot. It is a little time consuming to wait and let others take their pictures. Well worth it to go even with small kids. ",
  "Mike the Tiger has an awesome house and has a lot of visitors. I was extremely impressed with his tiger enclosure! Very cool that LSU has an awesome mascot!"
 ]
},{
 "name": "LSU Tiger Stadium",
 "address": "Nicholson Drive & North Stadium Road",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/21/95/98/lsu-tiger-stadium.jpg",
 "tags": [
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d1145226-Reviews-LSU_Tiger_Stadium-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "For my Birthday my daughters gave me a trip to see the Tigers play against Arkansas. This was the Tigers perfect season and I was proud to have been there to see one game! Tiger Stadium is a magnificent place for all to see!!!",
  "There is no place like Tiger Stadium on a game night.  Atmosphere is electric.  Often you can't hear yourself cheering because the noise level is so high.  It is definitely a must do, bucket list type event for football fans.  Actually everyone with a heartbeat would enjoy the experience\n1",
  "We took the kids to see Mike the Tiger who was out and about. Loved seeing all the plaques with past and present tiger info. The stores was open to purchase gear.",
  "LSU is the best. Their stadium is the best in the country, but the fans are better. If you are on the fence about coming to a game. Get off of it and go to it. IT  IS. THE. BEST. ATMOSPHERE",
  "What a wonderful atmosphere!!! Vibrant and great place to watch a football game. It is an experience that must be in your bucket list to visit at least once."
 ]
},{
 "name": "USS Kidd",
 "address": "305 River Rd S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/b1/82/f6/uss-kidd-is-a-fletcher.jpg",
 "tags": [
  "wander",
  "historic",
  "unique",
  "historic",
  "learn",
  "knowledgeable",
  "history",
  "free",
  "history",
  "kids",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d282339-Reviews-USS_Kidd-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wonder what service in WWII was like, come aboard.  Tight quarters and a tight fast ship in the war. Get in gun position and let your mind wander. ",
  "USS KIdd, a Fletcher-class destroyer, was the first ship of the U.S. Navy to be named after Rear Admiral Issac C. Kidd, who died on the bridge of his flagship USS Arizona during the 1941 Japanese attack on Pearl Harbor. Admiral Kidd was the first U.S. flag officer to die during World War II and the first American admiral ever to be killed in action. The USS Kidd, which was added to the National Register of Historic Places in 1983 and designated a National Historic Landmark in 1986, is now a museum ship, berthed at 305 South River Road on the Mississippi River in Baton Rouge, Louisiana. The ship was commissioned on April 23, 1943 and decommissioned on June 19, 1964 after earning 12 battle stars. During WW II, USS KIdd fought at Rabaul, the Gilbert Islands, the Marshall Islands and the Marianas and participated in the invasion of the Philippines and Leyte Gulf and the invasion of Okinawa. Recalled for duty in the Korean War, the USS Kidd patrolled off the Korean coast and bombarded targets of opportunity. The ship was never modernized and is the only destroyer to retain its WW II appearance. It was one of three Fletcher-class ships set aside for use as memorials. The USS Kidd was towed from Philadelphia to Baton Rouge in 1982. She is now on public view as a museum vessel. Its special mooring in the Mississippi River is designed to cope with the annual change in river depth. For half the year the ship floats in the river; the other half of the year she is dry-docked out of the water. She is the best preserved WW II destroyer of her class.",
  "USS Kidd (DD-661), a Fletcher-class destroyer, was the first ship of the United States Navy to be named after Rear Admiral Isaac C. Kidd, who died on the bridge of his flagship USS Arizona during the 1941 Japanese attack on Pearl Harbor\nHours are: Mon-Fri 9:30-3:30pm  Sat-Sun 10am-4pm\n\nToday, USS KIDD is moored in the Mississippi River in Baton Rouge, Louisiana, the centerpiece of the Louisiana Naval War Memorial. She rests in a unique docking system designed for the near forty foot rise and fall of the river each season. Half of the year, she rides the currents of the Mississippi; the other half, she sits dry-docked in a cradle where visitors can see her full dimensions. Restored to her August, 1945 configuration, KIDD is one of the most authentic and accurate restorations in the Historic Fleet. Of the three preserved Fletcher-class destroyers, she is the only destroyer remaining in her World War II appearance and is now on exhibit in her wartime camouflage paint, \"Measure 22.\"",
  "You will not be disappointed. You get to learn how they live on the ship and what they do. Tight quarters but even with a disability we were able to see it all",
  "It always amazes me to see how our men lived and fought on these old WW II era vessels.  Volunteer staff was knowledgeable and eager to share. Definitely worth a visit.",
  "Passing thru Baton Rogue but made it a point to  visit the USS KIDD. I’m a US Navy history buff. My father served as an officer on the same Fletcher-class destroyer in WWII, so it was great to finally see where he spent a part of his life as a tin can sailor. \nHighly recommend to everyone to visit to understand and appreciate the sacrifices made and the conditions they were made under. \nIt’s an easy self-tour but with some steep ladders if you visit all areas. \nParking is free right in front of memorial visitor center where you by tickets. You can see whole ship in under an hour.",
  "I highly recommend seeing the USS Kidd when visiting Baton Rouge. They have a very interesting collection of military history in their museum as well visiting this USS destroyer which is a veteran of WWII, Korea and the Cold War.  There is also a statue of General Lejeune the 13th Commandant of the USMC.",
  "My kids loved this field trip.  It was so nice and fun.  They had so many questions to ask and they were all answered where they understood.The staff really work well and interact well with the kids."
 ]
},{
 "name": "Louisiana's Old State Capitol",
 "address": "100 North Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/7d/3f/40/photo0jpg.jpg",
 "tags": [
  "history",
  "walking",
  "history",
  "free",
  "historic",
  "unique",
  "tour",
  "history",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d107647-Reviews-Louisiana_s_Old_State_Capitol-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The interior of this building is absolutely breathtaking: stunning woodwork, a majestic spiral staircase in the center that is surmounted by a stained glass dome, interesting displays about Baton Rouge's and Louisiana's history.  In addition the Louisiana car from the \"Merci Train,\" that was sent by French citizens to the United States in gratitude for relief supplies that the US had sent to France after WW II, is on display on the grounds.  This facility also has a great gift shop with many tasteful items, books, toys, etc.",
  "The Old Louisiana State Capitol, also known as the State House, the Louisiana Castle, the Castle of Baton Rouge, the Castle on the River, the Museum of Political History or simply the Old Capitol Building, is a historic government building that housed the Louisiana State Legislature from the mid-19th century until the current capitol tower building was constructed in 1929-1932. Located at 100 North Boulevard in Baton Rouge, it was built to both look like and function like a castle. It was added to the National Register of Historic Places in 1973 and designated a National Historic Landmark in 1974. Today, it is a museum. Restored in the 1990s, the Old State Capitol is now the Museum of Political History, within walking distance of the current capitol tower and many culturally significant buildings in downtown Baton Rouge, including the Old Louisiana Governor's Mansion, the Louisiana Arts and Science Museum, St. Joseph Cathedral and the Shaw Center. The Museum of Political History features attractions and exhibits showcasing the building as an architectural treasure and highlighting historic artifacts. One of the most interesting features is an interactive gallery that focuses on past state governors, including infamous Huey P. Long. Admission to the museum is free and the building is wheelchair accessible.",
  "The Old State Capital located in Baton Rouge, Louisiana, is a must-see for visitors. From it's arguably gaudy castle-like exterior, described by the late author Mark Twain as hideous to its beautiful cast iron central stairway, to its beautiful stained-glass interior dome, the capital is full of surprises and curiosities.",
  "While in town for a meeting our group took a tour of the Old State Capital. The interior of this building is gorgeous, the stained glass and detail to the building itself are very unique. Definitely worth checking out and learning the history of Baton Rouge. ",
  "The old state capital is absolutely beautiful! This is a great attraction for anyone who would love to see how buildings were designed & made years ago and to also brush up on your Louisiana history. Take your camera - there are many beautiful pictures to take! ",
  "This free attraction is worth the time to see it. The architecture is stunning, with a beautiful stained glass domed ceiling above a grand circular staircase. ",
  "The Old State Capitol building is worth a visit just to see the grand staircase and stained glass windows.\n\nHow can you not visit a building Mark Twain once described as a Gothic monstrosity...",
  "The original state capitol building from 1849. It looks like a castle. The dome is extraordinary from the inside. Many interesting exhibits. The staff is very friendly."
 ]
},{
 "name": "Louisiana State Capitol",
 "address": "State Capitol Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/4b/70/67/vue-d-ensemble.jpg",
 "tags": [
  "tour",
  "history",
  "art",
  "art",
  "tour",
  "knowledgeable",
  "history",
  "learn",
  "history",
  "free",
  "unique",
  "walk",
  "art",
  "tour",
  "tour",
  "history",
  "knowledgeable",
  "history",
  "history",
  "knowledgeable",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d107645-Reviews-Louisiana_State_Capitol-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Having been very disappointed by the Florida capitol “skyscraper” I had few expectations for the tallest of the capitol buildings: Louisiana.\n\nI was pleasantly surprised by the gorgeous art deco rotunda, House and Senate. We were lucky to arrive at the start time of a tour. Without our tour guide Bernard we would have missed out on the history, creation and stories of the current capitol building and the governor who created the building and was also shot there, Huey Long.\n\nWe spent more than an hour touring the first floor, marveling at the incredible beauty of the marble, depiction of Louisiana’s history in bas relief just below the ceiling circling the rotunda, and in the solid bronze doors leading to the chambers. Not to mention the statuary, ceiling patterns and pencil like wood shard imbedded in the ceiling of the senate, a reminder of the dynamite bomb that had been planted and detonated in 1970. We also heard a number of conspiracy theories regarding the shooting of Governor Long plus got to see the two unfilled bullet holes left from the shooting.\n\n",
  "Building offers wonderful observation deck with outstanding views of Baton Rouge, the plants and the West Bank of the river. Art Deco design is beautiful and there is ample street parking. Must do in BR. ",
  "The first floor of the Louisiana Capitol building is absolutely stunning. The many different kinds of marble (26, I think) make this building a real gem. Built in the 30’s, this unorthodox Capitol building, one of the very few that were built in the “skyscraper” fashion, makes it even more interesting to visit. Be sure to tour with one of their extremely knowledgeable guides to make your visit more enjoyable than doing a self guided tour. We were fortunate to join a school group with Bernard as our guide and he was entertaining as well as informative. Be sure to visit the observation deck on the 27th floor, especially if it is a clear day for beautiful views of the Capitol grounds and the Mississippi River!",
  "One of the tallest state capitols in the U.S., and rich in history, the Louisiana State Capitol is worth the time for visitors to Baton Rouge.  The opulence of its public areas is evident upon entry, and the legislative chambers are ominously serene when not in session.  Don't miss the observation deck on the top floor which allows a panoramic view of the city and the mighty Mississippi River.",
  "We arranged to take the 11am building tour. We called regarding parking options nearby and Audrey was most sweet and helpful, but with the large construction projects on-going it is a headache, especially if you are in a wheelchair or using an assistive device. We could find only metered street parking a 5 minute walk away.\n\nWhen you enter the building you'll be immediately confronted by several belligerent security guards subjecting you to airport-style security screening (only the body scanner is missing and you should be able to keep your shoes on, but still). Apparently the Department of Homeland Security views this building (because of its height) as a high terrorism target risk and recommended this type of security only a few years ago and also the changes coming to the parking areas around the building. \n\nOnce you run their gauntlet (take everything out of your pockets, belts off, watches and jewelry off, bags examined) you are inside and can then explore the building after you get dressed and put back together again.\n\nGo see the ladies (Audrey and Nathalie) at Visitor Services for a guide to the building and the park. Audrey led our tour (of the first floor only) providing interesting history on Huey Long and the building's history, pointing out all the unique architectural styles and features: marbles and granites, cornices, murals, bronze doors, chandeliers, and also giving us information on Louisiana's history. The acoustics in the main hall make it rather noisy so if it's crowded or busy know it may be difficult to hear.\n\nWe enjoyed visiting the Senate and House chambers and learning about state politics. It was fascinating to see the spot where Huey Long was shot and hear the mystery surrounding \"who\" shot him. You can see bullet holes in the building, especially in a column near the display case.\n\nWe took the elevator up to the 4th floor to see the Governor's Press Room (friendly receptionist/secretary) and then continued up to the 27th floor observation deck. Panoramic views of the area: Mississippi River and petroleum industry, as well as downtown. Gift shop at the top.\n\nDon't miss the murals in the Capitol Annex lobby across the street. Also free.\n\nThe cafeteria is open to the public and offers daily specials. Elevators and bathrooms available.\n\nIf you plan to visit both the Old and New capitols, I suggest hip the Old one first: learn about the state's history and about state politics before coming to admire this Art Deco gem built in just over a year during the Great Depression. The craftsmanship that went into building and decorating this public building are unmatched. It is still the tallest state capitol building in the USA!",
  "To avoid the heavy weekday traffic, I visited on a Sunday and there were no guided tours. However, there is a knowledgeable person at the information desk to ask questions. This area also contains brochures and a history of the capital building. You are able to tour the first floor which contain the legislative chambers and the open observation deck at the top of the building. --  Don't forget to ask to see the bullet holes in the walls near where Huey Long was shot in the mid 1930's.",
  "The exterior of this building is imposing, opening up to an ornate entranceway flanked on either side by the house and senate chambers, which are impressive and elaborate. There are several statues and busts of historical figures throughout the entrance with plaques explaining their significance to the history of the state. These are interesting and worth the time to browse.\n\nThe views from the 27 floor observation deck, on a clear day is impressive and worth the visit.",
  "I remember doing this as a kid, Take pictures on the steps leading up to the capital and head up to the tower to see the views. It was a perfect day, my 9 year old twins really enjoyed. I love the manicured grounds, so so pretty. So happy it worked out for us :) ",
  "Beautiful building and grounds full of history. The staff is very knowledgeable and friendly. Well worth your time.",
  "The exterior of this Empire State type building is forbidding with its great statues but the interior is an Art Deco gem. The guides are most helpful and the views from observation deck on the 27th floor superb. Don’t miss it.",
  "I really enjoyed my visit to the state capitol. The grounds are well maintained. There is a large statue of former Governor Huey P. Long in the gardens. The staff in the capitol building were very friendly and helpful. There are a lot of historical things to see on the main floor including the Senate Chambers where there are still a few wood remnants from a bombing embedded in the ceiling. This is the tallest state capitol in the US, and there are great views of Baton Rouge from the observation deck near the top of the building."
 ]
},{
 "name": "LSU Rural Life Museum",
 "address": "4600 Essen Ln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/4b/5b/0b/maison-de-contremaitre.jpg",
 "tags": [
  "tour",
  "walk",
  "walking",
  "cheap",
  "family",
  "kids",
  "wander",
  "walking",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d282338-Reviews-LSU_Rural_Life_Museum-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "LSU's Rural Life Museum is a hidden gem.  Take a step back in time to when life was so very different.  There are gardens, houses, animals, blacksmith shop and a church among others.  It is very inexpensive.",
  "I've visited this museum many times.  You'll see 19th century buildings from a working plantation -- a kitchen, school house, church, slave quarters, and others.  The gardens are beautiful.  The barn holds artifacts that represent the culture of Louisiana up until the beginning of the 20th century.  My grandchildren love to visit.  There are special events from time to time such as a fall event including hayrides and a bonfire and a Rural Life Christmas with costumes and open-hearth cooking.  Not to be missed!",
  "Visiting the LSU Rural Life Museum was taking a trip to the past...to the 1800's and how the southern way of life existed as a farmer and a planter, and with slavery.\nThe park is laid out and designed as a running plantation in the south in the 1800's.\nUse the docents for a tour as the docent will give you a walk thru the grounds and the buildings, both service, school, and slave quarters.Their knowledge will bring it sll together for you as you walk thru the grounds. Wear comfortable shoes.",
  "My husband and I live in Baton Rouge and have been to\nthe Rural Life Museum many times.  Each time we go we\nsee something new that we haven't seen before.  The grounds\nare beautiful with the interesting Louisiana houses on them.\nThe dog trot house is my favorite along with the rural church.\n\nThe museum is great.  If you like to shop, the gift shop is great too.  They have some fantastic floral tin plates for sale there as well as great hard to find books. Great cookbooks too. \nIf I were visiting Baton Rouge and only had a day or two to\nsee something I would go to the Rural Life Museum.\n\nBring a comfortable pair of shoes as you'll be walking but it isn't too strenuous. Great way to spend a Sunday afternoon.",
  "Extensive collection of items and buildings. Cheap price relative to all of the items on display. Impressed by the fact that many artifacts were accessible & not kept behind glass. A lot of the attractions are actually buildings that were moved to this site and therefore, much of what is to see is outdoors - keep that in mind with weather. ",
  "This Museum has evolved into a really wonderful day or half day\nplace to visit.. Bring a picnic and plan on seeing structures from the Plantation days of Louisiana.  The interpretations are family friendly. From old slave quarter houses, to the corn barn on the plantation.  then the small church where many gospel hymns were sung.  Do try to attend on a Not-rain day and most is accessed outside.  Beautiful grounds. \nDon't miss the gift shop.  ",
  "This was just a wonderful find!  I wish we had more time, but drove in just one hour before closing, strictly by accident.  I walked through the acreage and my husband toured the museum and we compared notes.  We were both enthusiastic!  There are 42 structures outdoors which exhibit what rural life was like in Louisiana.  The admission is ten dollars and very worth it.  But make sure to leave yourself enough time to wander the outdoors and indoors--at least 2 hours.  Kids would like it too.",
  "This is a first-rate museum spread over twenty-five acres. The indoor museum has an amazing display of hundreds of artifacts from the 18th and 19th centuries. The outdoor section of the museum gives a nicely laid out grouping of buildings, making up the workings of a functional plantation.",
  "Wonderful exhibits of rural Louisiana life. Inside, large museum collection of cultural artifacts from 18th and 19th centuries. Outside there are some 32 buildings that represent a typical 19th century plantation. Many buildings moved to site but are original.  A lot of walking over uneven ground but places to sit, rest scattered around. Worth the trip, we learned a lot. Plan to spend several hours there,",
  "This is a big musuem with much of it outside. Many old buildings brought in to demonstrate rural life of the past. Inside exhibit includes much about slavery that can be distrubing. Allow a good 2 to 4 hours for your visit. Staff was friendly.",
  "from the great collection from farm tools wagons and other items to the plants and crops you will learn how other citizens lived off the land."
 ]
},{
 "name": "Capitol Park Museum",
 "address": "660 N 4th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/d2/db/ee/shrimp-boat-and-music.jpg",
 "tags": [
  "tour",
  "history",
  "family",
  "learn",
  "walking",
  "history",
  "history",
  "history",
  "free",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d2480971-Reviews-Capitol_Park_Museum-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "You know the saying, Be a tourist in your own hometown.  It's true.  Right after the Capitol Park Museum opened I would take visiting friends and family for a tour and we always enjoyed ourselves, where else do you get to see a real shrimp boat inside a building! Then work took me to New Orleans and my visitors wanted to see where I worked rather than where I lived.  That's all changed and now I'm home again.  My visitors come to Baton Rouge and we always visit the museum when touring downtown. It's a great introduction to the history and culture of Louisiana. Great for all ages.",
  "Devoted to everything pertaining to Louisiana. Louis Armstrong, Huey Long. From the beginning with first settlers and the Louisiana purchase to Mardi Gras celebrations. Won't be bored here.",
  "We took our grandchildren here while they were staying at our our house and knew they would love it. They are 10, 7 and 4. They had a ball as they went from one scene to another with the oldest child writing all of the info in her notebook. Learn about Baton Rouge, the Capital of our great state, New Orleans and the catastrophic hurricanes or its rich Mardi Gras traditions, acadians of southwest Louisiana, etc. you could spend hours here and really should.  We highly recommend!",
  "Do not miss this museum!  We easily spent several hours here.  While we're very familiar with LA, we still discovered new info.  We thoroughly enjoyed the presentations of the various cultures and history of the state. Finding this museum was a little confusing as they also refer to it as the Louisiana Museum.  Street parking is a little tricky and the roads are pretty beat-up so be careful not to twist an ankle when walking.  There's another excellent museum nearby too, The Atchafalaya National Heritage Area, America’s Foreign Country, but not sure if you could do both in one day.  There are restaurants within walking distance too.",
  "The museum of LA history (state museum) was something I liked as well, as it gives you a perspective into the state history. The 2nd floor exhibit provides an angle to undertstand better various parts of the state as it is quite diverse. At least an hour should be allocated for this place. ",
  "Liked the information and history.  It did not have any information about hurricane Katrina yet.  It was free so a great stop to spend 1-2 hours at.  Do not miss the third floor as that was as enjoyable as the first.",
  "WOW!!  Really big 2 story museum. Give yourself lots of time. Up to 1/2 day if u really want to read and study. Sections dealing with different times in the life and history of Lousiana, to present. Big colorful section  about Mardi Gras.",
  "So much to see, read, watch and enjoy! Loved the exhibits and so many interactive ones to enhance the whole experience. Be sure to punch all the buttons so you don’t miss the stories and information. Take your time on both floors. Loved it! ",
  "Took my young grandsons to the Knock Knock Children's Museum to pass the time and give them something to do two years in a row. They loved it. If fact, the oldest still ask to go there every time I talk to him.",
  "We first visited this museum in August, 2019 when we were cruising the Mississippi from NOLA to Red Wing, Minn.  We were there on a Sunday, it was closed but they opened it for the people from out boat.  We were only there for an hour and had only experienced half of the first floor.  That was enough of a taste to ensure that we came back.  In fact, it was our destination after visiting our son and his wife in Austin, Tx.  It took us 2 1/2 hours to see the rest of the museum.  What a great experience.  I would definitely recommend this museum to everyone who visits Baton Rouge.",
  "This is 2 floors full of Louisiana history. We went on a weekend and parking was easy. I was told parking can be challenging on a weekday but there is metered parking and parking garages nearby. The building is just south of the Capitol building across the gardens. You enter through the first floor lobby. The cost was $5.74/person for senior admission. The first floor has a really fascinating history of the entire state and challenges that it has overcome to get to the present day. The displays are very well done and fascinating. The other floor (third floor) is a cross section of the different areas of the state and what they boast. We found that the TABASCO factory was in Louisiana from one of the displays and decided to go visit it before we had to leave the state on our trip. The museum is well worth the price and is a great display of the state’s history, personalities and stories and is on the top 10 of things to see in the area."
 ]
},{
 "name": "Magnolia Mound Plantation",
 "address": "2161 Nicholson Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/58/19/31/one-of-the-several-buildings.jpg",
 "tags": [
  "tour",
  "food",
  "tour",
  "history",
  "family",
  "historic",
  "history",
  "tour",
  "historic",
  "tour",
  "history",
  "tour",
  "history",
  "walking",
  "tour",
  "tour",
  "free",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d281600-Reviews-Magnolia_Mound_Plantation-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Magnolia Mound Plantation is located just north of the LSU campus on Nicholson Drive.  I have driven past it on a few occasions without realizing that it is a historical site.  When i finally stopped, I was very impressed.  A self-guided tour is $3, while the guided tour is $10 - pay the extra $7 and take the guided tour.  It provides you with access to the main house, which was built in the late-1700s and is decorated in antiques from the same period.  The grounds surrounding the main house include other buildings and areas necessary for a plantation to function - a pigeonnier (where pigeons were raised for food), an outdoor kitchen (complete with cooking utensils from the era), gardens for raising food, slave quarters, an overseer's house, and, of course, an outhouse.\n\nI thoroughly enjoyed the tour and the grounds.  It is a credit to the great people of Baton Rouge that they had the foresight to save these buildings for everyone to enjoy!",
  "So much fun!  Learned so much about plantation history and the culture in the late 1700s early 1800s.  Our tour guide was so informative and loved when we asked questions about the plantation and the family who lived there.  Definitely recommend.",
  "Magnolia Mound Plantation is a wonderful example of French Creole architecture, the vernacular influences of early settlers from France and the West Indies who wrote the history of the Deep South. Located at 2161 Nicholson Drive near the Mississippi River, one mile south of downtown Baton Rouge, Magnolia Mound was constructed in 1791. The plantation house, one of the earliest buildings in the present-day city of Baton Rouge, was listed on the National Register of Historic Places in 1972. Originally a four-room cottage, with side-by-side room arrangement, it was expanded in 1812 to a seven or eight-room house, including an extension for a formal dining room and two service rooms. During the late 19th century, owners added rooms under the gallery on the north and south sides. In 1966, after the property fell into disrepair, the City of Baton Rouge purchased the house and 16 acres in order to preserve the house and its dependencies for their historic and architectural value. Additional outbuildings, some original to the plantation, include an open-hearth kitchen, overseer's house, crop garden, pigeonnier and carriage house, which contains a collection of vintage tools as well as a weaver's workshop depicting plantation crafts from 1800 to 1820.",
  "My husband and I toured the Magnolia Mound recently and enjoyed it.  It is not as elegant as some of our other plantation homes in this area but it is worth a visit if you're coming to Baton Rouge.  The Plantation has a French Creole House built in 1791 and listed on the National Register of Historic Places.  You can tour the historic house museum on the property, open hearth kitchen, overseer’s house, 1830’s slave cabin, pigeonnier and 1800’s carriage house.\n",
  "Magnolia Mound Plantation is a must see for visitors to Baton Rouge.  The plantation house is beautifully restored and furnished with period pieces.  The grounds are lovely.  There is an outdoor working kitchen and kitchen garden both worth a visit.",
  "This is a must visit for a piece of Baton Rouge French influenced history.  Inexpensive tour is filled with historical statistics which made the tour enjoyable.",
  "Definitely go through with the tour guide.  She had a lot of info about the Louisiana area, the plantation and so much more.  There were only 2 of us that went through with the guide so we were able to ask questions and see everything we wanted.  Lots of interesting facts about how the plantation was run and how people lived at that time in history.",
  "Large area, many buildings, good descriptions, learned a great deal about sugar cane plantations and the painfully hard life.  It is a tribute to the mission and vision of BREC to serve the people of Baton Rouge and visitors like us.",
  "I visited this plantation and did the self guided tour. I think the guided tour would have been worth it and I would have learned a lot more. There is an entry fee but only a few bucks. I have never visited a plantation before so it was interesting to me to understand the dynamics of the time. There are still a few structures that still stand from that time including 200 year old trees! Some buildings were renovated in the early 1900s and 1940s. But still really neat. There is walking involved but the buildings are not as far apart as they actually would have been so it’s really not bad. It didn’t take long at all doing the self guided tour.",
  "By choosing the self guided tour I was able to view the plantation all by myself. The solitude allowed me to reflect upon what life would have been like during its working years. If I had more time I then would have wanted a tour of the house itself. I was told to feel free to look in all the windows but it was not quite enough. Depending on your knowledge of the time period make your decision. Having taught Social Studies I was fine on my own.",
  "Well maintained, very historical plantation. Tour was excellent with a great tour guide.  She gave lots of historical and detailed information.  We were also allowed to visit the grounds around the plantation.  Beautiful area and setting.  Huge old trees all over."
 ]
},{
 "name": "Louisiana State University",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/60/e9/bf/louisiana-state-university.jpg",
 "tags": [
  "learn",
  "walking",
  "walk",
  "history",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d106432-Reviews-Louisiana_State_University-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The LSU campus is a huge campus filled with beautiful buildings and many large Oak Trees. The center of the campus is a large parade ground. The Tiger Stadium is one of the large football stadiums in the country.",
  "My daughter and I were attending our first LSU home game and were excited to check out the campus. We could not find any parking 7 hours before game time, so drove back to the hotel and took an Uber. The campus was beautiful. We walked around for a couple hours to see Mike the Tiger Habitat, campus bookstore, lots of tailgaters, the stadium and all the wonderful scenery. It was fantastic. If you are in the area for vacation or for a game it is definitely worth a stroll through campus. The architecture really did justice to old and new Louisiana.",
  "This is one of the prettiest Universities with many Live Oak trees over 200 years old and beautiful lakes.The building are all designed beautiful and a great place of higher education for young adults and older ones to learn.",
  "If you like ice cream, make sure you visit the ice cream store. It's made right there on campus and features Geaux Tigers-themed flavors. Like all campuses, take your parking seriously, unless you're in somebody else's car. The center of campus around the student union has plenty of trees and shade, and is quite beautiful. Near the stadium, you'll find Mike The Tiger's habitat, and make sure you stop by and say \"Hi!\" to this very popular mascot.",
  "I was visiting LSU for a football game and on game day walked the whole  campus.Lots of interesting buildings especially Tiger Stadium. You might even recognize some of them from various movies. If you in the area make sure to visit the campus, just make sure to have a pair of comfortable walking shoes as i found out lol. ",
  "Very nice campus to walk around and explore. The visitor center has metered parking and is rather central so a good place to start if you are a tourist.  If you go by the stadium,  be sure to visit Mike the Tiger in his enclosure.",
  "This is worth checking out, very impressive building and grounds. Recommend making this a stop when in the area. ",
  "Worth a trip if you are in the area. The awe is endless, from Tiger Stadium, the Quad, Clocktower, to Mike’s Habitat and the expansive oak tree setting. Lots of history and cultural. The campus is one is the best in the country!",
  "The oak trees make a picturesque background for a simply beautiful campus. The football stadium is amazing. The buildings are beautiful. There is so much history at the campus. It’s well worth a visit. There are several good eateries on campus to try. Bookstores are nice too. Two thumbs up",
  "What a busy college campus on a Tuesday afternoon. The streets are treelined and look so serene. What a huge campus, but it stills looks inviting for students. So glad that we took the time to get off the Interstate and drive by the famous university. Go Tigers!!!",
  "This is a cool little museum on campus that has been there for many years. They have a lot of great exhibits of local wildlife in Louisiana. Also is the original Mike the Tiger. It is free and worth a visit. "
 ]
},{
 "name": "Alex Box Stadium/Skip Bertman Field",
 "address": "Gourrier Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/f2/f8/07/full-stadium-view.jpg",
 "tags": [
  "field",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d2707376-Reviews-Alex_Box_Stadium_Skip_Bertman_Field-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was a little surprised Alex Box Stadium/Skip Bertman Field was the #1 attraction in Baton Rouge until we went here.  The stadium is fantastic in purple and yellow.  One of the best college baseball stadiums I have ever seen.\n\nThe Head Coach Skip Bertman deserves credit.  He came to LSU after 8 seasons with the University of Miami as Associate Coach where he won a National Championship..  LSU won 5 National Championships under Skip Bertman (6 in total).  \n\nThe National Championship Plaza is truly amazing.  LSU really knows how to highlight their accomplishments.\n\nLSU has produced a lot of great players like Todd Walker, Ben McDonald, Aaron Nola and Alex Bregman.  \n\nI came on a day when the players were practicing.  It was neat to go onto the field afterwards.  \n\nI just wished the LSU Baseball Hall of Fame was open.  I would come back to see it.\nOne day, I'd love to come watch a game here.",
  "The Box is easy access to ger there. All seats have a great view. Lots of refreshment stands nearby. If you like LSU baseball it's a lot of fun to watch baseball there.",
  "I love this baseball ⚾️ field. I love the stadium. LSU has a great baseball team . The stadium has a great layout. I would highly recommend this anyone that is visiting or likes LSU.",
  "If you want family-oriented fun, excitement, and to see the best in college baseball, go to Alex Box Stadium!!!",
  "The “Box” is a relatively new baseball stadium which seats a max of approximately 12,000 baseball fans.  All seats are reserved with chair back seats in the covered grandstand.  Plenty of refreshment stands but the restrooms are spartan.  Traffic to and from the stadium is a challenge due to limited roads.  Parking is an issue after rainy weather since a majority of it is not paved."
 ]
},{
 "name": "Downtown",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/f4/ca/24/downtown.jpg",
 "tags": [
  "walk",
  "walking",
  "history",
  "learn",
  "educate",
  "walk",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d281596-Reviews-Downtown-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We arrived in town late, but it was an interesting walk by the river. I wanted to see the Sing the River sculpture, and the USS Kidd was a cool scene for a lightly misty foggy night with the lit bridge as a backdrop. Glad we stopped. ",
  "Everything is within walking distance and the city is SO alive! The second line from my daughter's wedding was hands down THE funnest thing I've ever done!\nThe city is SUPER clean and safe.",
  "Have visited before, the building has a lot of historical feeling to it.The climb to the top is worth the view, you can see the ship US Kidd, the Casino and this is of course on the Mississippi. There are pelicans to see too. A very grand Capitol Building",
  "If you’re from Louisiana you should visit downtown Baton Rouge and Learn about our state’s history and culture!",
  "If you are looking to educate yourself on Baton Rouge, this is the place to go.  Very educational and well worth the walk around Downtown.",
  "We parked at the waterfront and walked along the trail for awhile.  Although we did not go in any of the attractions this time, there is a lot to do around this area.  The USS Kidd is there (a real winner); there are also several museums and the old capital building.  Also not far is the current capital building.  There are of course other things to do here as well, both inside and outside.  It can be nice place to spend an afternoon with the family.  To see al the sites, it certainly takes longer.",
  "We arrived in town late, but it was an interesting walk by the river. I wanted to see the Sing the River sculpture, and the USS Kidd was a cool scene for a lightly misty foggy night with the lit bridge as a backdrop. Glad we stopped. ",
  "We arrive here just before 5pm on a Monday and the place was desserted, couldn't even get a coffee, much less find a toilet that was open. As state capitals go, this is way down the list of places to see. The old and new Capitol's are interesting to see, but overall sadly Baton Rouge is just not worth the visit for a tourist"
 ]
},{
 "name": "Knock Knock Children's Museum",
 "address": "1900 Dalrymple Dr Baton Rouge, LA",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/0d/3e/7e/photo2jpg.jpg",
 "tags": [
  "kids",
  "family",
  "cheap",
  "family",
  "unique",
  "creative",
  "adventurous",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d12968366-Reviews-Knock_Knock_Children_s_Museum-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took our grandson here last Saturday. We had a blast. So many different areas for the kids to interact. We had to nudge our grandson to go to the next area. He was having so much fun he didn’t want to move on. Go early and plan on staying at least 3 hours. We will be back soon. ",
  "My 4 year old loves this museum. It’s very clean and there’s plenty to do. It’s the best children’s museum in Louisiana. It can be pricey, but we have a family membership, which is reasonable. ",
  "Our eight and three years olds loves this place.  We got the family membership. 150/year is cheap based on the amount of fun they had on just the first visit.   Bright, airy and ready to play. ",
  "This children's museum is unique with indoor and outdoor activities. It is well staffed and they work with the children in the various activities set up for the children to do.  They conduct special projects for the creative and the adventurous.  ",
  "Visited with a 4 year old and a 2 1/2 year old. They loved it and did not want to leave. Spent almost 3 hours there and would have stayed longer if they had  a snack bar.",
  "Our three year old had a blast here. Stayed for 3+ hours and he still wasn't ready to leave. Facilities were clean and all the activities were engaging and well produced. Would highly recommend for people with children ages 2-10. Great activity for those scorching hot summer days when it's just too hot to be outside.",
  "Plenty of easy parking 👍 reasonable fees👌clean with friendly courteous staff \n2 floors of great children exhibits .  Plan for at least 2 hours of entertainment.  The River boat is totally spectacular.  💥😍⭐️\nProvides the sensation of riding the river and seeing the great Mississippi River- outstanding treat 👏💥💥💥⭐️\nDefinitely recommend 5⭐️⭐️⭐️⭐️⭐️",
  "We are from near Lafayette, and this children's museum is off the charts compared to our local one. We would gladly make the drive to return here! There is SO much to do and see! We went after lunch time on a Thursday and it wasn't very crowded till 4:30 rolled around. Several areas of play for all age groups. The front desk offers clean/dry clothes for kids that have potty accidents and there is a private nursing area which is SO good to see offered to mothers. SUPREMELY clean and maintained. Well worth the money."
 ]
},{
 "name": "Baton Rouge Zoo",
 "address": "3601 Thomas Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0c/07/17/elephent.jpg",
 "tags": [
  "eat",
  "family",
  "food",
  "kids",
  "walk",
  "kids",
  "free",
  "walk",
  "food",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d281598-Reviews-Baton_Rouge_Zoo-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Baton Rouge Zoo is a great little city owned and operated Zoo although it was extremely hot and most of the animals were in the shade or inside their enclosures to escape the heat it still was a great layout, very much a park-like setting definitely enjoy the zoo and will be back.",
  "Love the BR Zoo. It's the perfect size for families with small children. Reasonably priced. We always take our wagon. Next time we will pack a lunch because the food lines are incredibly SLOW. They either need more food stands or more personnel. We were in line for 20 minutes and one family of four placed their order, received it and a mother and daughter placed an order but had not received their food. We were 6 families back so we decided to leave and eat on the way home. The train ride is fun, the petting zoo and playground are also nice. Great attraction. ",
  "Plenty animals, train ride, shaded areas, concession stand was reasonably priced. It is small zoo but has plenty of exhibits",
  "We came in town for couple of days then decided to do something fun before heading home. After looking around on trip advisor we decided on a walk through the zoo would be nice. We had a great time and really enjoyed the baby monkey, Tigers and rhinos. There are colorful birds all over and it took us a couple of hours to cover it all and I'm not sure we even saw it all. Bring a hat and sunblock for the kids because you will be out for awhile. There are outside cafes if you do get hungry or thirsty. Next time we will try the train ride but ran out of time on this trip. \nThe staff was very friendly as well. \nA+ zoo",
  "This description says 944 animals. 900 must be birds and fish. Many exhibits are empty at this zoo. The \"otter chat\" that is supposed to be done twice daily never happened. The zoo doesn't have one of the main zoo animals, elephants. Tigers look under feed. The animals at the petting zoo are not friendly. Beware with small children. Many exhibits are overgrown to the point where you only have one small opening to see what's in them. The employees aren't very friendly, & beware of the wicked witch of Louisiana running the ticket stand for the train/stroller rentals. Avoid on a really hot day because you'll have no where other than a bathroom to cool off. ",
  "Maybe the Baton Rouge Zoo is not much of a tourist attraction, but it is a God send for mothers.  I take my son to this zoo once a week and i really only ever see other mothers strolling around with their kids.  It's a great place to take a long walk and let the kids run free.  The scenery is beautiful and the employees are very pleasant and helpful.  I remember when my parents took me to the Baton Rouge Zoo and i am so happy to see all the improvements they have made.  There are always renovations going on at this zoo.  Right now they are putting in new bathrooms; Thank God!  They are also working on a new entrance and a new concession area.  It's a great place to visit if you are short on cash and the kids are driving you crazy.  Take them here and let them drive the animals crazy for a while.",
  "I had the greatest time.  All the animals were out and the staff was very pleasant and helpful.  This is a very large zoo but we saw it all in a day.",
  "The Baton Rouge zoo has had a lot of bad publicity over the years but now it certainly does not warrant it. Obviously not as big as the Auderbon zoo in New Orleans but good value especially for young children. Worth a visit with children. ",
  "Not many animals. The zoo is old and in a off the path location. The animal cages are hard to see through. No where close to New Orleans zoo. The food was good .",
  "Whenever I visited the zoo in Louisiana, I would just hop on down to NOLA for the Audubon Zoo. The New Orleans zoo had to be better than the Baton Rouge zoo, right? Wrong! The Baton Rouge Zoo is top notch! AND it's right in my backyard. This place is an absolute gem. The family events throughout the year are also a lot of fun :)",
  "This place is amazing but I just want to shout out to Mrs Sandie and Mrs Fran at the gift shop!! They treated us so kindly and made our experience very special! Also when my friend lost her cup in the gift shop after we left Mrs Sandie jumped to it and brought it back to us in the parking lot! Love them so much!"
 ]
},{
 "name": "Atchafalaya Basin Bridge",
 "address": "I-10 Between Mile Markers 121 And 135",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/38/39/45/photo0jpg.jpg",
 "tags": [
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d4456180-Reviews-Atchafalaya_Basin_Bridge-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is nature, folks.  The road slows from 70 to 60, trucks at a lower speed.  There is no place to stop.  It's a nice change in scenery on my trip from Houston to Baton Rouge.  It seems that recently the crossovers that the police used to use have been blocked off so I haven't seen any state police on my recent trips.",
  "When you drive the four hours from Houston, Texas to Baton Rouge, Louisiana, you can see the transition in topography every time you look out the window. From tall trees to more shrubby land and back to shorter more dense trees, to areas of increasingly larger patches of water. Finally, the road shifts into a low bridge running for a total length of 96,095 feet (29,290 m) or 18.2 miles as you cross a massive, shockingly beautiful and strange area of swampland called the Atchafalaya Basin. Clocking in at almost one million acres, this is the nation’s largest river swamp. People travel from all over the world to see these bottomland hardwoods, swamps, bayous, backwater lakes, and for good reason! This important ecosystem is the home for roughly 65 different species of reptiles and amphibians, more than 250 species of birds, and also nutria, fox, beaver, otters, and even the Louisiana black bear. The basin is also home to the largest concentration of bald eagles in the south-central United States. It’s a spectacular sight!",
  "This is an amazing feat that was built in the early 1970's and opened to the public in 1973. It is 18.2 miles long cover two interchanges along I-10. It's amazing to see as you travel over top of it but even more so from below in a boat right underneath it. It's a must see when in the area. Highly recommend taking it in.",
  "Very nice drive across the bayou and marsh land.  There is no stopping or pull offs on this bridge.  Trucks are restricted to the right lane only but occasionally do travel in the left land.  There is a lot to see along the way.  One can just imagine the problems of construction of this bridge.",
  "As you travel along Interstate 10, you have to marvel at how road construction was possible in the surrounding marshlands. The landscape is absolutely beautiful with the tree stumps out in the bayou. I think of many novels that I have read that use this ecosystem as a backdrop. Beautiful scenery along Interstate 10 in Louisiana. "
 ]
},{
 "name": "The Old Governor's Mansion",
 "address": "502 North Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/5f/1e/13/the-old-governor-s-mansion.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "structure",
  "tour",
  "history",
  "structure",
  "history",
  "tour",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d107646-Reviews-The_Old_Governor_s_Mansion-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This mansion is a “must see”- built to resemble the White House, it is full of interesting stories. The mansion itself is very well built with unbelievable details. 15 bathrooms- each one different colors and tiles!",
  "Beautiful building both  inside and out . Learned a lot about the Governor's of LA. we had a guided tour for $9 p/p well worth it.",
  "Plan on apendi g a coup,e of hours here to get the full run of the place.  The decor is so cool and the artwork pretty fascinating!  A favorite is the staircase and the old flag on display.  Even the r storms have architectural features!  A must see in BR.",
  "After hearing about how beautiful the mansion was for many years,I was extremely disappointed. We were there for a bridal show and could not believe the current state of things. There were very obvious cracks/ holes throughout (which someone at our table who inquired about renting the facility for their wedding told us that the crew of pitch perfect is responsible for). Upstairs kinda left like it was forgotten about entirely. It may be nice for a once in a lifetime visit but nothing compared to the capitols or even rural life if you are wanting to explore.\n\n**My review is based on wedding/event rentals**",
  "We loved touring Louisiana's old governor's mansion.  It's a beautiful structure, and our guide was great!  With great enthusiasm, he told story after story about the building and its former residents.  We thoroughly enjoyed our time at the mansion.\n  \nMy only word of advice is not to wait too late in the day to visit if you can go earlier.  Knowing that the mansion closed at 4:00, we arrived at 2:00; it turned out that a wedding was to be held and tours were stopping early that day -- we almost didn't get our tour.  So lesson learned:  when a venue is only open Tues - Fri, 10:00 - 4:00, get there before 2:00 Friday afternoon.\n  \nIf you love history and architecture, the time spent at the Old Governor's Mansion is very worthwhile.",
  "We loved touring Louisiana's old governor's mansion.  It's a beautiful structure, and our guide was great!  With great enthusiasm, he told story after story about the building and its former residents.  We thoroughly enjoyed our time at the mansion.\n  \nMy only word of advice is not to wait too late in the day to visit if you can go earlier.  Knowing that the mansion closed at 4:00, we arrived at 2:00; it turned out that a wedding was to be held and tours were stopping early that day -- we almost didn't get our tour.  So lesson learned:  when a venue is only open Tues - Fri, 10:00 - 4:00, get there before 2:00 Friday afternoon.\n  \nIf you love history and architecture, the time spent at the Old Governor's Mansion is very worthwhile.",
  "This mansion is a “must see”- built to resemble the White House, it is full of interesting stories. The mansion itself is very well built with unbelievable details. 15 bathrooms- each one different colors and tiles!",
  "Worth checking out  , we were glad to have been able to make this stop. Interesting history behind this building. ",
  "Beautiful building both  inside and out . Learned a lot about the Governor's of LA. we had a guided tour for $9 p/p well worth it.",
  "A building that dominates the skyline, great example of art deco, inside and out.  Impressive lobby, two governmental chambers. You can take the lift to 24th floor, then to 27th, to get out on the viewing deck, affording 360 degrees views across the city. A must-see, must-do in Baton Rouge.",
  "I can remember spending time here as a child, but returning as an adult with my friends from Italy was a real treat!  They absolutely loved it.  The museum is informative, and the interior aesthetic is amazing.  If you are a backyard tourist, or an international traveler, this is a must in the Baton Rouge area.  "
 ]
},{
 "name": "Blue Bayou Water Park",
 "address": "18142 Perkins Rd E",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0b/65/95/blue-bayou-water-park.jpg",
 "tags": [
  "walking",
  "family",
  "walk",
  "food",
  "family",
  "kids",
  "affordable",
  "free",
  "kids",
  "kids",
  "food",
  "tasting",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d281602-Reviews-Blue_Bayou_Water_Park-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Had a great day spent with family at Blue Bayou and Dixie Landing. We went on a Wednesday and the park was not crowded at all! We never waited more than about 3 minutes for anything. Highly suggest going during the week if possible. Just a heads up that there are metal detectors upon entering the park so don't bring anything that won't pass if you have to walk a long way to your car to put something up. The park felt very safe, lots of lifeguards and other employees constantly walking around and monitoring all of the attractions. The water slides are great!! Definitely the best water park in the state of Louisiana! They sell drinks and food but of course you'll pay for it 😉. It wasn't too outrageous though. If you plan to go more than twice in a summer, it'd be worth your money to buy a season ticket. You also get a coupon book when  you buy a season ticket. Overall we love Blue Bayou and look forward to coming back. ",
  "This place provides incredible value by being able to enjoy both the waterpark and the amusement park.  Our family had a blast and they have some really cool slides.  They were a little understaffed the day we were there so the lines were longer then what they said was normal but it was a beautiful day so we really didn't care that much.  If you are in the New Orleans or baton Rouge area go check it out.",
  "I don't enjoy getting a tan, but m grandchildren loves this park I buy season tickets for them.  They can go as much as the like and it's fun for kids..",
  "We love going to Blue Bayou every time we visit Baton Rouge.  It's a nice, affordable water park and I love that you can have your ticket validated and come back for a second day for free.  I like the lazy river and wave pool the most, but the racer slides sure give you a rush!",
  "Blue Bayou is a place to stay cool in this hot weather.  There is a lot to do for kids of all ages. I like the way they look out for consumers well fare by not letting you in the water if the weather is bad.",
  "We took most of our kids and grandkids this summer and they all had a blast. For ones that don't like the big slides you can rent a tube and ride the lazy river or wave pool all day.",
  "We visited Blue Bayou recently with our two children, 5 & 2, and they had a blast.  There is a specific area for smaller children, two actually, and the lazy river to enjoy.  Only downside was food was not able to be brought into park.",
  "Not as good as last trip! Ate at the same restaurant (fast food) coke products were out so we got Fanta instead (flat and horrible tasting) went back for trade and told we’d have to repay.  Burger that was in the “loaded” section was plain when we got it - went back for vegetables to be added and told they were out of lettuce so we got pickles only.\n\nLines were extremely slow moving - rides are showing age and wear - to the point that we wondered if it was safe anymore. \n\nThis will be our last trip there! Daughter wishes we’d gone to Schillerbahn...."
 ]
},{
 "name": "Bluebonnet Swamp Nature Center",
 "address": "10503 N Oak Hills Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/87/5e/dd/20180403-120452-largejpg.jpg",
 "tags": [
  "nature",
  "knowledgeable",
  "drink",
  "kids",
  "affordable",
  "walk",
  "walking",
  "nature",
  "walk",
  "walking",
  "family",
  "nature",
  "walk",
  "nature",
  "walk",
  "art",
  "nature",
  "hike",
  "nature",
  "nature",
  "knowledgeable",
  "drink",
  "kids",
  "affordable",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d281599-Reviews-Bluebonnet_Swamp_Nature_Center-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We thoroughly enjoyed this walk through nature. We have a 7 and 4 year old who love all things nature and this place delivered. We were apprehensive that it may be too hot of a day, but we were wrong. Supremely shaded. You park next to a small pond filled with eager turtles looking for a quick snack, then take the most beautiful boardwalk to get the tp nature center where you pay a *super* small fee. The nature center blasts much appreciated A/C, has plenty of animals to look at in cages/terrariums, furs and snake skins to feel, kids nook/corner with books and kids chairs, and affordable souvenir corner with lots of nature-related things for both kids and adults. There are bathrooms, water fountains, snack and drink machines. The staff was supremely kind and knowledgeable about the area and were happy to chat with us. The walk itself was just relaxing as can be. Completely shaded and peaceful, away from the busy highways. It is a very well maintained place with several opportunities to sit along the way and just enjoy. The varieties of wild mushroom were incredible. We will be back!",
  "Relaxing walk with plenty of nature. Great place in the city to watch birds. Easy walking paths but you feel like you are in the middle of a forest. ",
  "Easy walking paths, welcoming staff, quiet, peaceful, shady and filled with flora and fauna. I hope you can visit when in Baton Rouge.  Great for the entire family or if you go solo.  ",
  "I enjoyed my walk through the swamp area, but I was disappointed that I hardly saw any wildlife.  The nature center was nothing special.",
  "Such a gem in the middle of the city.  We had a great walk through nature's wondereful enjoying birds, critters and different trees and plants.  The trail/boardwalk was well maintained.  The nature center had some beautiful art pieces and many critters to see up close.  A great place for young children.  The staff were delightful and quite helpful.  Be sure to take this in if you are in the area.",
  "The large crowd of turtles in the entry area was awesome, as was the butterfly meadow. Well maintained brief but  quality nature hike in the middle of the city. Thanks for being there! ",
  "We were told this was a Baton Rouge favorite so off we went to the swamp. . We were glad to see this natural spot maintained in the midst of major development. It was not just maintained it was promoted. There is a short trail (.5 mile) with an extension of another .3 mile. It is gravel and raised boardwalk surface. The swamp could benefit from some botanical signage. The Nature Center was well staffed, but the educational materials were well worn and need to be updated..It was nice to see the children's artwork posted. The parking lot is very small so we decided lots of neighborhood people biked or walked to the center. \n",
  "We thoroughly enjoyed this walk through nature. We have a 7 and 4 year old who love all things nature and this place delivered. We were apprehensive that it may be too hot of a day, but we were wrong. Supremely shaded. You park next to a small pond filled with eager turtles looking for a quick snack, then take the most beautiful boardwalk to get the tp nature center where you pay a *super* small fee. The nature center blasts much appreciated A/C, has plenty of animals to look at in cages/terrariums, furs and snake skins to feel, kids nook/corner with books and kids chairs, and affordable souvenir corner with lots of nature-related things for both kids and adults. There are bathrooms, water fountains, snack and drink machines. The staff was supremely kind and knowledgeable about the area and were happy to chat with us. The walk itself was just relaxing as can be. Completely shaded and peaceful, away from the busy highways. It is a very well maintained place with several opportunities to sit along the way and just enjoy. The varieties of wild mushroom were incredible. We will be back!"
 ]
},{
 "name": "Three Roll Estate",
 "address": "760 Saint Phillip St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/7f/d7/f5/cane-land-tasting-room.jpg",
 "tags": [
  "tour",
  "tour",
  "tasting",
  "history",
  "tour",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "free",
  "knowledgeable",
  "tour",
  "knowledgeable",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "drink",
  "tour",
  "tour",
  "tasting",
  "history",
  "tour",
  "tour",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d12377594-Reviews-Three_Roll_Estate-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is an interesting tour and our guide, Jean Paul, was both informative and entertaining  The atmosphere is informal and friendly.   We tasted six rums, a vodka and  a whisky.  All were good.",
  "You get a brief history of cane in the area, a tour of the distillery and a tasting at the end. Very interactive and informative. The staff were outstandingly helpful ang friendly. Very relaxed atmosphere ang the offerings are really good as well. Whole tour and tasting took about 90 minutes.",
  "My wife, brother in law, and myself attended a tour of the facility on Labor Day which included a tasting at the end. The tour guide was very knowledgeable on the process and thoroughly explained everything from the background of how the distillery came to be, to the process of creating the products. The bar area and outdoor areas are set up really uniquely and provide a comfortable atmosphere for some cocktails. The products have a great sugarcane flavor and go down smooth. We definitely enjoyed ourselves and plan to return many times!",
  "We went to the 4:00 pm Saturday tour of Cane Land Distilling Company and ended up having a really good time.  And it's a bargain outing since the tour itself is free.  Our tour guide was entertaining and knowledgeable (as long as you didn't press him on the science).  The facilities are very nice and clean.  \n\nJust don't go on a hot day if you don't do well with heat.  As you can imagine, it was rather hot and humid in the late afternoon on a July day in Louisiana.  There's plenty of AC in the bar area, but none in the production areas.  Still, since it was enclosed it wasn't miserable, just very warm and humid.  \n\nFor $6 you can participate in a tasting afterward where you get to taste their products.  They have eight to choose from, but you're only allowed five, so choose wisely.  Each taste is about 2 cc and, oddly, they're served in disposable communion cups.  \n\nBefore and after the activities you can have drinks from the bar which is stocked, of course, with their products.  One downside to the bar, IMO, was our bartender's attire.  I could deal with the bright orange/gold ombre hair and the tons of tattoos, but I wasn't such a fan of the tightly fitting tank top with no bra.  I'm not exactly expecting a bartender for a rum bar to be dressed in a suit, but that was a little too far to the opposite end of the spectrum.  As nice as the bar was, it really didn't fit.  \n\nAll in all, it was a nice, fun afternoon activity.",
  "My husband and I had a great time on this visit! The bartenders were friendly and knowledgeable about their products. Take their suggestions, and try one of their own concoctions. They definitely know what they’re doing here! The tour was fun and informative as well. Great to see behind the scenes, and watch this fantastic distillery grow. Don’t miss your opportunity, with products as good as these, they won’t stay in such a small location for long.",
  "Bartender (Ken, hope I have the name right!), was amazing! Very knowledgeable and excellent mixologist! All the rum spirits were good, however the Vodka OMG!! Don’t miss tasting the Vodka. Absolutely completely different then any other Vodka you will ever taste! Cane Land is a must stop while in Baton Rouge! ",
  "It was a windy day and Jean Paul and his team made our tour informative and fun. The drinks were amazing and the Cane Killer was the best frozen drink I’ve ever had. My husband and son enjoyed tasting the rum and Original Mississippi floating whiskey. I highly recommend this unexpected experience.",
  "This is an interesting tour and our guide, Jean Paul, was both informative and entertaining  The atmosphere is informal and friendly.   We tasted six rums, a vodka and  a whisky.  All were good.",
  "I highly recommend this tour.  Jean Paul was a top notch tour guide and made it a great experience.  We like learning about how certain thing are made and history and this did not disappoint.  The tasting at the end wasn't bad either. lol.  If you're looking for a nice time in a great looking setting, make this one of your stops.",
  "Jean Paul is an awesome tour guide. The Rhum selection is great. It’s hard to choose what to bring home at the end. The facility is very welcoming !!",
  "We had a great time with the tour and the tasting.  We also had a couple of drinks that were really good.  Fantastic Bar Tending!  Would highly recommend stopping if you are in the area."
 ]
},{
 "name": "Mall of Louisiana",
 "address": "6401 Bluebonnet Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/5b/cb/cf/mall-of-louisiana.jpg",
 "tags": [
  "family",
  "structure",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d3964204-Reviews-Mall_of_Louisiana-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Even though this mega mall’s structure is quite nice with multilevelled brand name stores, there are opportunities  ties for improvement.  There are  anchor stores and lots of perimeter parking. Unfortunately,  there are a number of off-brand stores that negatively impact the character and quality of .the shopping experience. Examples: a jewelry store advertising teeth “covers’” with inlaid diamonds  and several no name or off brand family clothing stores . \nAdditionally the closing hours for stores are conflicting and ambiguous, which is further complicated by inaccessible exit doors and a poor or absent  lighting In the parking lots. \nThe  recommended  time to visit is during the day light hours . Fortunately there are other shopping options nearby.",
  "Half of the stores are closing.  It’s pretty sad. Spent a few hours looking for a dress and never found one. All of the good clothing stores from the past were already closed.",
  "The Mall of Louisiana is a good place to visit some department stores and smaller shops. There are pretzel shops, which are great, and some other places to eat upstairs in the food court. There are also shops outside the main building in the strip. My only issue is that it’s always HOT inside the building and stores. ",
  "Definitely nice. I like the amount of stores in here. It’s not a huge difference from other malls that I’ve been to. But the extra stores and such are really nice. I loved Lush. It was great. Will definitely plan to come here again. \n",
  "This is a very large mall that is very vibrant around Christmas time. The mall has several anchors and is two stories. It is a classic mall that appears to be surviving well, and it is the only mall remaining in Baton Rouge. "
 ]
},{
 "name": "L'Auberge Casino & Hotel",
 "address": "14777 River Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/ef/9c/a1/l-auberge-casino-hotel.jpg",
 "tags": [
  "walk",
  "free",
  "walk",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d3513338-Reviews-L_Auberge_Casino_Hotel-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This casino is a favorite of mines. Parking is easy, and it's not too small or too large. The staff are friendly and it's a nice clean environment. I visited for Valentine's weekend and after visiting a bar in Baton Rouge I decided to visit the casino. I'd say check it out and try your luck. I'm not a gambler and still like this place. ",
  "Was a good time, but the slots are really tight. Blew through our alotted money real fast, which was disappointing. Nice place right on the Mississippi River. Parking is easy, kind of a walk to get to the casino.",
  "We planned a girl’s road trip to L’Auberge and really enjoyed the casino. The rooms were spacious and clean, and we all found the beds to be very comfortable. Coffee and water are provided in the room at no cost. We did order a “medical refrig” at no cost. A mini refrig will cost you $25.00. The drinks in the casino were free and the cocktail waitresses kept them coming. We did have the $16.00 burgers at Favorite’s and were pleased when my little sister was surprised with a complimentary cupcake for her birthday. I spent a few hours in the gym as well as in the women’s spa. There is no charge for the private hot tub, steam and sauna. I did take advantage of the relaxation room in the spa and enjoyed a few cups of hot tea. There are lots of cute shops to browse in. Be sure and take the trolley over to the new Golden Nugget for even more shopping. There is a boardwalk and sand volleyball pit outside L’Auberge  too. We had a good time regardless of how much money we left behind in the slot machines!",
  "Gambled here (slots) several times during our stay in Baton Rouge.  Parking convenient, though a bit of a walk to the gaming floor.  Nice, clean place with good selection of slots.   Lost money each time, but slowly.  Had fun.  I've been to better, but I've been to worse.",
  "Concert venue not the best but they tried to make up for the constraints of the room by having large screen tv’s if your view was obscured. Get there early to dine as it is very busy on special nights. Ate at the sports bar. Great hamburger and fries !",
  "Beautiful facility. Had breakfast at the cafe. Delicious, large servings and reasonably priced. Played some slots, not much luck but then again, that’s gambling! ",
  "This casino is very clean and modern. It is laid out quite well and is very beautiful. They have lots of tables and slots. The views of the river are awesome. ",
  "I stayed here one night prior to an LSU game with my wife and two children.  We got into the hotel fairly late at night and immediately ate dinner at one of the hotel/casino restaurants. When we got back to the room, we realized the room air conditioning was not working.  It was unseasonably warm, but my wife was unwilling to contact the front desk to possibly change rooms or have someone come up to check on the system as one of our children had fallen asleep.  \n\nAt checkout, the manager happened to be at the desk and was checking the people in line out of the hotel.  When I mentioned to him that the AC was not working in our room, there was no apology.  Rather, the manager responded that they were open and available 24/7 and we should have contacted him sooner.  I noted that the bathroom TV was inoperable and he mumbled something about a dispute with Cox Communications and we should not expect the bathroom TV to work.  We had friends also staying in the hotel and their TV worked, so I still don't understand the disconnect.  \n\nIt was disappointing for the manager to be so dismissive and unapologetic. We survived the night and my purpose in informing the manager was to fix the problems for the next inhabitant of the room."
 ]
},{
 "name": "Riverfront Plaza",
 "address": "300 River Rd S",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/b1/a7/f4/evening.jpg",
 "tags": [
  "eat",
  "art",
  "structure",
  "kids",
  "walk",
  "walking",
  "walk",
  "walk",
  "eat",
  "history",
  "walk",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d12230405-Reviews-Riverfront_Plaza-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "You can sit and watch the boats , the USS Kidd is there and they happened to be shooting a new Tom Hanks film while we were there so that was very cool. They have a steam boat that docks there and it is beautiful. ",
  "Sometimes when you go to attractions, you inadvertently discover a whole lot more.  The Riverfront Plaza is exactly that type of attraction.  It is a nicely kept park-like area along the east bank of the Mississippi River.  Besides the strange looking robot or alien statues in the grassy areas and on the benches, you'll find the U.S.S. Kidd that is easily accessible.  And, there is the U.S.S. Kidd Museum, as well as the Louisiana Art & Science Museum.  There is the Old Capitol building which is a fantastic looking example of French and medieval architecture - it looks like a castle.  Because it is along the riverfront, there is also a working set of train tracks, on which you may see a train slowly coming through - a great treat for those Thomas the Tank Engine fans.  If you go on a day that isn't sunny, you may see the fog rolling in and blanketing the U.S.S. Kidd, as well as the I-10 bridge over the Mississippi River.  There are places to eat nearby, and we had no problems finding parking spaces.",
  "Went to Hollywood Casino (a riverboat on the river) and happened upon the Riverfront Plaza when leaving. Parked on the street, crossing River Road up to an expansive walkway. There were concrete steps/seats, park benches, fountains, statues, and a great view of both downtown Baton Rouge and the Mighty Mississipp.  The USS Kidd is docked there too. I don't know how far the plaza extends, as we espied the Old Capitol Building and had to go check it out...a \"castle-like\" structure in downtown Baton Rouge a block (maybe 2 blks?) from the river. Don't know if the area is safe at night or not, but it was great and seemed plenty safe in the daytime.",
  "This is a nice park river along the Mississippi River in downtown Baton Rouge. There are nice (and numerous) public benches and anarondak chairs all along the park. The park is essentially on a levy along the river. We were able to sit an watch the sun set and watch the riverboats go by. It is a great view. Plenty of room for people to sit and spread out. The kids loved being able to walk all the way down to the river. There is pay parking close to the river but the parking gets much cheaper just a few blocks away. ",
  "A great area right on the river.  Walking and seating areas. there is a bit of parking, but mostly paid parking across the street.  It was clean and the area was safe.",
  "The downtown riverfront has some of the best sunsets in Baton Rouge, but it's also nice all throughout the day.  During the daylight hours you can watch the barges and tugboats on the Mississippi and at the nearby port, and once it's dark the Mississippi River bridge lights up and reflects beautifully on the water.  With chairs and benches to relax, this is a great spot (as long as it's not too hot out!).",
  "Took the grandkids for the day to walk around and have lunch. Beautiful place and great place to relax and take it all in.",
  "This area is very worthwhile checking out, lots to see, lots of interesting shops. Recommend this area. ",
  "Great place to walk along the river in Baton Rouge. Run, bike or walk and enjoy the sights on the river.",
  "Not a lot to do and very few places to eat. Nice views and the ship was nice to visit. Parking was quite convenient.",
  "The Mississippi River banks have been converted to a massive and modern center of tourism and history. There is a long paved walk along the river with benches available just watch this massive river. Along the banks you will find an entertainment center, a Veteran's museum, the Museum of Art and Science, and historical sites such as the original castle-like  Capitol building,plus many other interesting sites. Great engineering and planning, but needs a little bit of upkeep,"
 ]
},{
 "name": "LSU AgCenter Botanic Gardens",
 "address": "4560 Essen Ln 4560 Essen Lane",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/e9/a3/b4/burden-botanic-gardens.jpg",
 "tags": [
  "hike",
  "free",
  "walk",
  "nature",
  "walk",
  "tour",
  "family",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d10835097-Reviews-LSU_AgCenter_Botanic_Gardens-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Botanic Gardens are a must see for visitors to Baton Rouge.  Trees and Trails which is part of the gardens takes you on a hike through the woods and wetlands.  The rose gardens are spectacular and there is a delightful children's garden.",
  "Looked for a place to walk before continuing our road trip. The GPS landed us here. This is a great spot with excellent trails to walk.  The maps and trail signs are not the best but you still can't get lost.  Be sure to walk the boardwalk through the swamp. While on the trails, there are several resting spots with benches should you need them.  The visitor center has clean restrooms. Admission and parking are both free,",
  "Well its amazing! Really beautiful, but you cant lost so you better pickup one map at the information center for visitors and also some places look like abandoned , but its really wild , nice experience ",
  "We visited the gardens at the end of March.  The roses were in full bloom and were so colorful and scented.  Roses are plant in long rows.  Across from the garden is a Steele Burden Memorial Orangerie.  You can rent the building out for wedding and events.  Afterward we drove to the Mosaic Boardwalk at Black Swamp.  It is a mix of trail and boardwalk over a swamp.  There is a living heritage museum and sculpture garden that requires an admission.  We did not have a chance to visit because it was close to closing.",
  "We visited the gardens at the end of March.  The roses were in full bloom and were so colorful and scented.  Roses are plant in long rows.  Across from the garden is a Steele Burden Memorial Orangerie.  You can rent the building out for wedding and events.  Afterward we drove to the Mosaic Boardwalk at Black Swamp.  It is a mix of trail and boardwalk over a swamp.  There is a living heritage museum and sculpture garden that requires an admission.  We did not have a chance to visit because it was close to closing.",
  "In the heart of south Baton Rouge, you turn off busy Essen Lane to enter a quiet tranquil manicured expanse of lawn.  There is a children’s play area and many areas to walk through with species of plants and trees.    Definitely a great place to enjoy nature especially in the spring with the roses blooming.  ",
  "This was an interesting and educational tour.  It is family friendly and worth the visit.  I highly recommend this!",
  "The park was the site of an outdoor wedding I was attending. The spot seemed so nice I decided to come back. Well worth a visit just to view the artifacts associated with early farmers.",
  "The Botanic Gardens are a must see for visitors to Baton Rouge.  Trees and Trails which is part of the gardens takes you on a hike through the woods and wetlands.  The rose gardens are spectacular and there is a delightful children's garden.",
  "Friendly and helpful staff at the Welcome Center. The trails were not well kept at the time we were there - ruts and tire tracks. Maybe this had to do with the time of the year we were there - they had some rain. Much of the trail is close enough to the highway so that the peacefulness is punctuated with traffic noise. It was a nice stretch of the legs and there are educational plaques throughout with interesting information. My favorite part was the boardwalk over the swamp. Would like to return another time of the year. I am sure it will be a different experience.",
  "Well its amazing! Really beautiful, but you cant lost so you better pickup one map at the information center for visitors and also some places look like abandoned , but its really wild , nice experience "
 ]
},{
 "name": "Tin Roof Brewery",
 "address": "1624 Wyoming St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/34/48/74/tin-roof-brewing-co-baton.jpg",
 "tags": [
  "walk",
  "brewery",
  "brewery",
  "knowledgeable",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d10342655-Reviews-Tin_Roof_Brewery-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Super atmosphere.  Great indoor and outdoor area and the beer was really good.  We loved visiting will go back when in town!",
  "The brewery was just a 15 minute walk from our hotel, which was awesome given the heat. The beer was o.k., but could be better. I tried an IPA, Pale Ale, and a DIPA and, in my opinion, there was only a slight difference between them. None of them were clear, and had all of them had the same color (they looked like pineapple juice). The taco truck wasn’t open, and it was very quiet, although it was a week night, so that could be the reason. They had some cool merchandise, though. Great shirts, hats, and glasses.",
  "We had a great flight of local beer.  Bartender was friendly and the tacos at the truck were out of this world!",
  "Stopped here on a Tuesday evening for a beer and food.  Both were excellent and had a great inexpensive meal.  Sampled several beers before settling on their blonde ale - bartender was very helpful and knowledgeable about brewery beers.  Happy Hour pricing was a dollar off.  The taco food truck was outside and ordered 2 tacos that were outstanding - came with chips and mild salsa.  So for $11.00 - you just can't beat pricing.  Highly recommend a stop here.  Easy to find downtown.  ",
  "There’s a taco truck outside that is the best part. The bartenders are not attentive at all. When I approached I let them know it was my 1st experience there and was given no direction. She handed me a pen and paper and I initially didn’t know what to do with it. There were no napkins or paper towels. If you asked for one you were directed to the restroom for tissue. All in all , just buy a 6 pack from the store and stay home 😊"
 ]
},{
 "name": "East Baton Rouge Parish Library",
 "address": "7711 Goodwood Blvd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/b8/76/c4/east-baton-rouge-parish.jpg",
 "tags": [
  "library",
  "music",
  "library",
  "art",
  "library",
  "free",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d7906148-Reviews-East_Baton_Rouge_Parish_Library-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "1/27/2020 I visited this library for a work event and was very pleased with the facility, it was clean and well ventilated. I didn't have to ask for assistance but I'm sure the staff would be happy to assist.     ",
  "I attend meetings at this branch. It's always clean and appears to be well maintained. The people at the main check-out/info desk always seem preoccupied with their \"between customers\" tasks, but they are helpful when they decide to give you their attention. ",
  "This library is amazing. It is huge with a wonderful selection of books, dvds, and music cds for all ages. Great areas for children and teens. Always stuff going on here. Nice art exhibits, lots of computers and quiet study and reading areas, friendly and helpful employees. Superb place.",
  "This community is so very fortunate to have a library of this caliber! There's something for everybody. Particularly enjoyed the Baton Rouge Collection",
  "You can rent movies for free with your library card and they have an amazing app that allows you to rent ebooks and audio books for free! I cancelled my audible subscription because this is way better and did I mention it's free!"
 ]
},{
 "name": "Louisiana Art & Science Museum",
 "address": "100 River Rd S",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/64/28/fc/planetes.jpg",
 "tags": [
  "walking",
  "walk",
  "art",
  "history",
  "art",
  "walk",
  "art",
  "kids",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d282194-Reviews-Louisiana_Art_Science_Museum-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "I did not have much time for a visit and was tired so I thought I would visit the planetarium. What a nice surprise. The show was so interesting and informative , I came back for the next show (different topic)",
  "Mummies, fabulous art, childrens activity rooms, planetarium, special events, and exhibits.  You will find a world class museum in the old railroad depot, perched on the bank of the Mississippi River, with some of the best views in town.  It is within walking distance of the Old State Capitol, the USS KIDD, downtown Baton Rouge, River Center, Shaw Center, hotels, and, of course, a walk along the levee.  Check out their event calendar to register for classes or to find times for the planetarium shows.",
  "The Louisiana Art Museum was an eclectic presentation of Art, History and Science. I really enjoyed the planetarium presentation with the additional exhibits about our earth...\n    There's an exhibit about egyptology, a wonderful introduction for children to science, plus a special presentation about trees ...\n     Definitely something for everyone!",
  "We didn’t care for this one.  Maybe it was the particular exhibits, but for such a large museum, there wasn’t much to see.  The particular exhibits (sound and color) we saw we very poor quality.  There were a lot of hands on activities for children which we do not have.",
  "This is an excellent museum with lots of interesting exhibits. Well displayed in a very professional atmosphere. Courteous helpful staff. Worth checking out. Recommend taking the time to check this place out.",
  "This is a great place to visit, nice exhibits and educational. i would reccommend this to couples...",
  "Our day started with clouds and did turn to raindrops so when that happened we decided to stay on the Riverfront and visit the Irene Pennington Planetarium in the Art and Science Museum. We were there in time for the 2PM show about the Apollo. We had missed the official 50th anniversary activities so this was a good celebration of accomplishment for us. It was a big WOW to see the documentary, including the moon landing and subsequent walk on the moon,in the planetarium rather than on TV. There is also a small interactive exhibit area before you go up to the planetarium. Staff were very welcoming. We did not see the art exhibits, but you might want to save time for that depending on your interests.",
  "Some nice things in the museum and in general had fun. Really was disappointed in the actual planetarium. It was Dino weekend so very geared to young kids.  Wanted our older ones to learn things in the planetarium and felt it was a lost opportunity. Would have liked to learn things from Hubble for example. Lots of opportunity that I felt was missed. But the exhibits were interesting and enjoyed the hands on exhibits. "
 ]
},{
 "name": "Burden Museum & Gardens",
 "address": "4560 Essen Ln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/bc/67/aa/steele-burden-memorial.jpg",
 "tags": [
  "family",
  "hike",
  "walk",
  "hike",
  "history",
  "family",
  "kids",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d13137550-Reviews-Burden_Museum_Gardens-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "heart The Burden facility is a delightful experience from the beautiful plants and schrubs to the antiques to take you back to yesteryear and right in the heart of Bato Rouge",
  "Spent the day there @ a wedding -- lovely, lovely -- grounds are fantastic-- lots to see and do for for a family or couple -- brig a picnic lunch and enjoy the day ",
  "This is one of the best outdoor/indoor museums in the country.  It is a hidden gem.  The property contains and Overseers home, slave cabins, an outdoor kitchen, sugar cane processing, black smith's shop, and much more.  The indoor museum has artifacts from the early 18C to the Industrial Revolution.  This is a must see visit.",
  "We found this green space with such easy access to the interstate to be a welcomed respite from car travel. The trails are for the most part shaded in the early afternoon but prepare because this is Louisiana in July. Take your water and wear good shoes because the trail is gravel and sand not paved. We explored the native flora and fauna and easily spent 1 1/2 hours hiking. There are gardens, a visitor’s center and agricultural museum but alas we had no time to see them. No fees! Easy parking! Hike away!",
  "I love to go there and see the roses, and walk through the grounds behind the house.  The museum is interesting and has different activities at different times of the year.  Worth the trip to get outdoors and enjoy a peaceful walk and see the mature gardens that have been tended over the years.",
  "We found this green space with such easy access to the interstate to be a welcomed respite from car travel. The trails are for the most part shaded in the early afternoon but prepare because this is Louisiana in July. Take your water and wear good shoes because the trail is gravel and sand not paved. We explored the native flora and fauna and easily spent 1 1/2 hours hiking. There are gardens, a visitor’s center and agricultural museum but alas we had no time to see them. No fees! Easy parking! Hike away!",
  "Beloved yearly special events. Beautiful well kept grounds year round. A must see for lovers of south Louisiana history.",
  "heart The Burden facility is a delightful experience from the beautiful plants and schrubs to the antiques to take you back to yesteryear and right in the heart of Bato Rouge",
  "Spent the day there @ a wedding -- lovely, lovely -- grounds are fantastic-- lots to see and do for for a family or couple -- brig a picnic lunch and enjoy the day ",
  "The garden's have several distinct areas. The rose garden had been affected by the heat, but the tropical gardens were loving every humid degree. The New Guinea impatiens were beautiful, The children;s gardens included climbers for extra fun. There is a tree and woods hiking trail, but the warm humid day made us decide to put that off until another day, There is also a visitor's center. The LSU Rural Life Museum is in another section of the property so there is plenty to keep a visitor busy for a day.",
  "We were more interested in the nature trails and didn't visit the museum. The trails were hot due to mostly non-shaded paths compared to the Bluebonnet Nature Center (Which we adored - heavily shaded and well maintained paths). Our children much preferred the latter. The close proximity to the highway was also a disadvantage as the road noise was pretty loud. We did enjoy reading each sign identifying trees/plants and the flower/rose garden which were misting at the time. Our kids enjoyed the cool down (age 4 & 7). The children's play area up front was well kept with adorable playground equipment."
 ]
},{
 "name": "Red Stick Farmers Market",
 "address": "5th and Main Sts",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/75/1a/10/photo4jpg.jpg",
 "tags": [
  "kids",
  "walk",
  "kids",
  "walk",
  "delicious",
  "walk",
  "delicious",
  "walk",
  "delicious",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d589248-Reviews-Red_Stick_Farmers_Market-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a really decent Farmers Market that pops up in the middle of the business district on Saturday mornings. It's a very interactive experience with lots of new things to taste, smell, touch and see. Reasonably priced vendors, high quality offerings, easy to park and walk to. Good for when the weather is nice. Even if you don't want to buy, it's an enjoyable experience whether alone, with friends or kids. ",
  "This is a really decent Farmers Market that pops up in the middle of the business district on Saturday mornings. It's a very interactive experience with lots of new things to taste, smell, touch and see. Reasonably priced vendors, high quality offerings, easy to park and walk to. Good for when the weather is nice. Even if you don't want to buy, it's an enjoyable experience whether alone, with friends or kids. ",
  "We like to support local people.  Great for a nice morning walk and to get some fresh vegetables and produce. Bought some local sausage and soups that were delicious. You can spend a nice relaxing morning on the weekend. Great way to start the day. ",
  "Pleasantly surprised by the quality of vendors, the variety of offerings and the kindness of the people! We’ve been to a few markets, and this one is definitely one of the better ones!\nBe sure to check out the mushroom stand!",
  "Visited the Farmers Market Saturday morning.  An exceptional offering of fruits, vegetables, breads, pies, meats.  Something for everyone!",
  "A weekly exclamation of some of the best of Baton Rouge local produce, seafood, and plants in a lively community setting on Main Street downtown. The market is open year-round on Saturday mornings. A complement of nearby cafes and restaurants to enjoy.",
  "We like to support local people.  Great for a nice morning walk and to get some fresh vegetables and produce. Bought some local sausage and soups that were delicious. You can spend a nice relaxing morning on the weekend. Great way to start the day. ",
  "Plenty of offerings today--plants, nuts, veggies, dairy, eggs, lamb, homwmade sweets, local honey. Pleasant merchants. Strawberries are delicious!   Plus a walk around downtown Baton Rouge. Enjoyable. "
 ]
},{
 "name": "Theater Baton Rouge",
 "address": "7155 Florida Blvd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d282176-Reviews-Theater_Baton_Rouge-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This small theater in downtown Baton Rouge is a true gem. Great seating, beautiful decor and dynamite sound system make this theater a stellar venue for small concerts and plays.",
  "First time at this big little theatre.  Comfortable, spacious with a bar for libations before the show!  A well done production of Silent Sky a true story rendition of women in Astronomy.....the heady days of wonder, excitement and discovery! Play was well written, clever and well acted.  I highly recommend a show here.",
  "Excellent production. Superb cast and direction. Go see this musical. Voices are outstanding and orchestra and ensemble blend well together. Dana Todd Lux in supporting role is as good as it gets. ",
  "Just saw Cabaret.  It was fantastic.  The production is always on point.  Every seat is a good seat.  Small bar at the front.  Place is a little dated but it really adds to the atmosphere.  Been going to plays here for two years and after this last play, we have signed up for season tickets!!!  If you need a great date night idea, you can't go wrong.",
  "The production of \"Cabaret\" was first class, off the chart good. Thank you to TBR for this latest effort! I can only say \"Wow\" and congratulations to all involved!"
 ]
},{
 "name": "University Lake",
 "address": "W Lakeshore Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/d3/c6/e1/university-lake.jpg",
 "tags": [
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d9861419-Reviews-University_Lake-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place for daily walks/jogs/bike rides.  The scenery is breathtaking and the houses you pass by are stunning.  The trail is well maintained and marked.",
  "Algae has taken over this lake. Now it looks disgusting. I will not go kayaking here until they clean this area up.",
  "THE walk around the university LSU lakes is senic and always has others enjoying the views and exercise. You can also visit the campus and neighboring resturants.",
  "At different times of the year, the lakes are home to migrating white pelicans by the hundreds and 10 foot pink flamingos(silhouettes to celebrate Madrid Gras).",
  "University Lake is a wonderful place to walk, jog or bike, however, it is congested and sadly there are no bike or pedestrian paths.  The bikers tend to be very aggressive so if on foot be careful.  But is still is a great place to go exercise, enjoy indigenous Louisiana swamp life, beautiful architecture, LSU, the lake,  and simply enjoy outdoor life.  It really is a gem in our city.  The lake is fun for couples, families, friends and solo"
 ]
},{
 "name": "Arsenal Park",
 "address": "Capitol Lake Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/05/b3/01/spanish-town.jpg",
 "tags": [
  "walking",
  "learn",
  "walk",
  "walk",
  "walk",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g40024-d8342728-Reviews-Arsenal_Park-Baton_Rouge_Louisiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a wonderful walking park! There were lots of interesting things to read and learn about... many things to make you walk just a little further...\n",
  "This is a  old brick  fort  this part of the legislative grounds. You can have the opportunity to walk around and walk inside.",
  "This place is always fun to get out and walk around. You can even see the State Capital and take some great shots with your camera. I recommend this place.",
  "We had a very nice walk around the park and along the lake. Very nice views. You can also see the governor's mansion if you cross the bridge.",
  "Went on a Saturday and the museum was supposed to be open but it wasn't so don't know what was up with that.  Bicyclists and joggers were running around the park.  Nice view of Capitol Lakes from the Indian Mound.   No flowers, just green trees but nice to walk around."
 ]
}]
