[
{
 "name": "The Dakota Zoo",
 "address": "602 Riverside Park Rd Box 711",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/72/f9/77/dakota-zoo.jpg",
 "tags": [
  "kids",
  "active",
  "tour",
  "kids",
  "walking",
  "family",
  "eat",
  "active",
  "kids",
  "active",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d500848-Reviews-The_Dakota_Zoo-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Watching the animals this time of the year when it is cooler outside makes them more active and they tend to show off more to the public. A nice variety of cats, small and large animals and a train ride, has variety and very well kept! We are glad we have visited this zoo during our trip to North Dakota. Check it out, cuz it's all happening at this zoo! I would highly recommend stopping with kids! What a treasure for Bismarck! A must when visiting Bismarck!",
  "Great exhibits! For sure take the train tour! Sit and relax while the kids climb and play on the playground! Lots of animals: bears, tigers, monkeys, goats, and feed the prairie dogs too! Check out your wingspan! (See photo)",
  "This zoo has a large variety of animals to see.  I will take several hours to visit it all.  They have a miniature train that you can take around the zoo to see all the sights.  Snacks are offered here and there is a petting area were you can touch and feed the animals.  Really good Zoo.",
  "The Dakota Zoo has a great variety of animals and I love how many walking paths there are around the zoo. Can't wait til the penguins are there!",
  "Thank you Dakota Zoo for always providing family fun!   We really really love the Zoo breakfast when they have it!  Its great to see the animals active after we eat.",
  "Watching the animals this time of the year when it is cooler outside makes them more active and they tend to show off more to the public. A nice variety of cats, small and large animals and a train ride, has variety and very well kept! We are glad we have visited this zoo during our trip to North Dakota. Check it out, cuz it's all happening at this zoo! I would highly recommend stopping with kids! What a treasure for Bismarck! A must when visiting Bismarck!",
  "A fine, if not fancy, zoo.  A beautiful, natural setting with many interesting residents. Really well done and a great value. Highly recommend, especially for those with little folks.",
  "Nice zoo, lots of variety and well maintained. Great place to take the kids for an afternoon outing."
 ]
},{
 "name": "North Dakota State Capitol Building",
 "address": "600 E Boulevard Ave Dept 110",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/0f/d9/02/nd-state-capitol-the.jpg",
 "tags": [
  "art",
  "tour",
  "history",
  "knowledgeable",
  "unique",
  "free",
  "history",
  "tour",
  "tour",
  "unique",
  "history",
  "parks",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d280344-Reviews-North_Dakota_State_Capitol_Building-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Enjoyed a wonderful tour of the beautiful Art Deco style North Dakota state capitol building this morning, conducted by the terrifically knowledgeable (and North Dakota nice!) Cindy Selborg of the ND Office of Public Affairs.  Gorgeous interior of this building highlighted by marble walls and rich wood paneling, all with intricate detailing evocative of the plains and the cultural history of this beautiful state.  A “must see” when in Bismarck!",
  "Unique skyscraper building on the prairie! The tallest building in ND. Free tours , breathtaking view from the top floor, access to see the House and the Senate. Beautiful marbel and special wood used in the construction of this interesting building. Includes pictures and interesting facts of famous people from North Dakota who have been selected for the \"Rough Rider award. A must visit when in Bismarck!",
  "A fun stop in Bismarck! The building is a great example of 1930's architecture. The observation deck offers stunning views of the city as well as interesting historical photos, The main floor portrait gallery of notable North Dakotans makes for a fun stroll through history. Volunteers and staff are both friendly and helpful. The grounds are beautiful and feature a variety of statues and displays.",
  "Go to the top for an awesome 360 view of Bismarck. Take the tour and see the monkey room, House and Senate parlors. In case you get hungary there is a cafeteria.",
  "Tour guide was very informative. Building is well taken care of, clean and up to date. Unique building with an interesting story. Love the ND Hall if Fame.",
  "North and South Dakota are fabulous States. The history of our country and much of the outstanding geology of our country are in North and South Dakota.\nThe animals and wildlife on the Great plains are astounding. The national parks are not to be missed. \nIf you haven't been to North and South Dakota, you have a treat a waiting.",
  "After visiting the Heritage Museum, we walked over to the Capitol building.  The beautiful wood paneling in the Senate and House of Representatives rooms was magnificent.  We took the elevator to the 18th floor and were able to view the city.  This gave us a nice perspective on the area.  Returning to the first floor we looked at all of the paintings in the Rough Rider Hall of Fame, those from North Dakota who brought fame to the state.\nShort but great visit.",
  "The guide was friendly and knowledgeable! Incredible to see the architect of the building! There is a great out door area leading to the building. We walked to it from down town. "
 ]
},{
 "name": "Missouri River",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5b/e0/ae/old-pics-of-bismarck.jpg",
 "tags": [
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d1015749-Reviews-Missouri_River-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The river is partially iced over right now, making a pretty sight. There’s not a good place to pull over that I’ve seen, but I just got here yesterday.",
  "Very deceptive at this time of year as it meanders along. They have some nice vantage points to take in the vista.  What else can one say, it is a river! :-)",
  "There is a park near the river north of 94. With all the rain that had happened the flow was pretty good. It was interesting to see it where it entered the Mississippi and how large it was and how it shrank as we headed up stream.",
  "The water is very brown and murky and me and my kids went for a fishing trip and stopped after a bit and one of them decided to jump out and started to sink since he took off his life jacket. I immediately jumped into the river looking for him but couldn’t see 3 inches below me. After an hour of searching the surrounding area I still couldn’t find him. Would not recommend",
  "If you want to experience the best walleye fishing in the country, check out this river. If you time your trip just right, you'll catch a limit of beautiful eyes in no-time."
 ]
},{
 "name": "Laughing Sun Brewing Co.",
 "address": "1023 E Front Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/06/a4/73/or-on-our-facebook-under.jpg",
 "tags": [
  "music",
  "delicious",
  "food",
  "delicious",
  "music",
  "brewery",
  "music",
  "food",
  "food",
  "food",
  "tour",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d4071931-Reviews-Laughing_Sun_Brewing_Co-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "I frequent this place because they have amazing live music, delicious sour beer, and one of the best atmospheres in town. They also sometimes offer classes on Sundays, like a watercolor class I took on the patio. ",
  "Love the new place.  We always choose to sit at the bar, service is fantastic, beer is cold (and tasty) and the food has always been delicious.  Our favorite weekend spot.  If you like BBQ and Craft Beer - this is a MUST Stop.",
  "Found this brewery through Untappd and visited by myself.  Sat next to a regular and he spent at least an hour talking with me.  Very nice folks there and a great story behind the business.  Now for their beers.  Over two visits I sampled 6 of their beers.  I liked all of them.  I did not try their IPA because I'm not an IPA drinker and their two had IBU of 100+, so if you like that sort of beer, they have it for you.  On the second visit four of us ordered pizza from the pizza place next door and it was fantastic.  They have local music 5 or 6 nights a week if you are in to that.  Can be hard to find parking nearby.",
  "What a fabulous place!! Great food,  fantastic beer (oh that Sinister is delish) and magnificent music venue. I love that I can take my grandkids to see live music. Thank you Laughing Sun! We will see you again and again and again!",
  "Laughing Sun has an incredible selection of beers sure to please your palette regardless of your beer preference. I was impressed by the wide selection. The beers were also really good! They offered a flight that comes with a \"free-pint\" token, too. \n\nNot only were their beers great, the food was amazing. Tried the pulled pork nachos/sandwich, the chili. All good. And it's made in-house - so are their desserts (which were equally amazing). Maybe best of all, their to-go containers were cardboard. I was thrilled when they pulled these out.\n\nThe facility is super cool and trendy, but relaxing. Nice porch/patio for the summer. All-in-all a great visit. I've found a solid hang-out here in Bismarck.",
  "Lots of beer selection of course.  Nice ambience. Nice seating area outside as well as inside.  We enjoyed the board games !   BBQ food I’ve had at their original location and it’s excellent!  Can’t wait to go again!",
  "Twenty of us had a tour, pulled pork sandwich and sampled the beers. All had a great time, loved the pulled pork, the atmosphere, fabulous service. The \"Sinister\" and \"Cosmic Cranberry\" beers were the favorites. All will come back!",
  "I’m a huge sour beer fan and Laughing Sun has nailed it!! They currently have two available and both were amazing.  I also had the tacos which were delicious.  My friends enjoyed the brisket, wings, and pork, all of which looked great and were well received.  Make this a stop on your journey! "
 ]
},{
 "name": "General Sibley Park & Campground",
 "address": "5001 S Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/d2/da/17/next-morning-we-could.jpg",
 "tags": [
  "walking",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8409595-Reviews-General_Sibley_Park_Campground-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place for quiet in a well-maintained county park. Everything is kept up well. Nice paths for walking and river access if you want to put your boat in the water. Playground for children and a disc golf course for fun. ",
  "We liked the General Sibley Park. No one was making noise, even in the night. We slept so well.\n\nWe had a concrete path for our RV. And the restrooms and showers were a few feet away.\n\nWe had lots of trees.\n\nPeople played golf here.\n\nThere is a shelter with picnic tables.\n\nFor the children there is a playground.\n\nThe river was beautiful!\n\nWorthwhile to see!",
  "This is a very peaceful place Togo cross country skiing. The trails are not side by side which is a little limiting if going with people you want to visit with. It wasn’t cross you don’t feel pressured to rush. I would definitely go back ",
  "Roomy  spots. But was very hot when we were there and  our spot had NO  trees close enough to the camper. Be sure to ask for shade, if that's what you need. Nice, up to date, play ground. Clean restrooms. ",
  "THis is a great place to have a picnic after you visit the zoo. The shelters are great and they are clean. Some shelters are near the restrooms. I recommend being within walking to the restroom. Spacious eating area. Just bring a couple of tablecloths and you are good to go. You can also have a big group is many of the shelters. They are close to play areas for the kids."
 ]
},{
 "name": "McDowell Dam Nature Park",
 "address": "1951 93rd St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/35/6e/16/mcdowell-dam-nature-park.jpg",
 "tags": [
  "family",
  "family",
  "kids",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d3372172-Reviews-McDowell_Dam_Nature_Park-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whether you go there to fish or have a picnic or a family gathering or just a need for a quiet spot, the park is absolutely beautiful!",
  "I visited McDowell Dam Nature Park with my family when we stayed in Bismarck for a family vacation. It was a short drive from our hotel near downtown, and it was easy to find. The park is huge with plenty of picnic shelter space, and barbecue grills. And they have REAL bathrooms! \n\nThe kids enjoyed the large playground and paddle boat rentals. Unfortunately, we did not do any swimming that night, but the water looked clean and they have a HUGE beach with plenty of room to lay out towels and play in the sand. The park is beautifully maintained and there were very few mosquitos and other pests. \n\n",
  "This is an off the main road location that provides a nice get-away from the heat on a sunny summers day and a place to spend the afternoon.",
  "Love going out here for a fine time on the water. They alomost always have a paddle boat or canoe to rent. also a great little blace to fish",
  "It's quite a ways outside of the Bismarck city limits, but definitely worth a visit. Shelters for groups are available, there's a few toy structures for the younger set. Great place for running and workout sessions. Plenty of trees and shade. The beach is quite large. My only criticism would be the sand. It's more a sandy loam, which makes things quite dirty. Bring a large blanket and beach sandals."
 ]
},{
 "name": "Superslide Amusement Park",
 "address": "Riverside Park Rd, Bismarck, ND 58504 Next to Dakota Zoo",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/b6/c1/fb/teacups.jpg",
 "tags": [
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8311466-Reviews-Superslide_Amusement_Park-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great local amusement park located in the lovely Sertoma Park. \nRides for all ages, bank shot basketball, mini golf, superslide, bounce house,and some water games - great for those hot days! \nConcessions and restrooms available.\nTickets are reasonable priced and periodically offered at a discount on Seize the Deal so watch for those!",
  "Great time taking the kids here for a few hours to hang out and go on the rides. Staff is always friendly. Mini golf is a yearly favorite.",
  "works for a shorter car  break or a few hours entertainment\nsuper slide and put-put golf, climbing wall and get wet games or kiddie rides or a jumping room.",
  "We stopped here on a hot July afternoon so the kids could do something fun to burn some energy.  Our kids had a fun time, and it is not very expensive.  Our kids rode all the things they were interested in (my husband and I joined them for the Ferris wheel) for about $20.  They cooled off with the water balloon activity, and we they enjoyed their time.  Their favorite thing was driving the whisper cars and the super slide.  \n\nMy one negative bit: I would have given this a 4-circle review if I felt that the employees were friendly. Most of them were teens, and one of them actually swore to another employee in front of my small children. I get that it was hot and only the mini- golf was busy, but it's no excuse. There was only one employee that I felt any sort of friendliness from.  This didn't bother my kids but was noticeable to both my husband and me.",
  "We came to play mini golf and take our son on some rides. There is enough to do for someone his age (3). We had fun on the ferris wheel and slide!"
 ]
},{
 "name": "Gateway to Science",
 "address": "1810 Schafer St Ste 1",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/06/30/44/gateway-to-science-entrance.jpg",
 "tags": [
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d1488659-Reviews-Gateway_to_Science-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "WOW! impressive and well maintained!\n\nAll ages of science and mechanical areas to explore by reading and hands-on learning.  Take an hour or 3 but definitely worth a stop.",
  "We had to kill some time in Bismarck and were fortunate enough to come across this attraction.  The exhibits are well crafted and cover multiple aspects of science from simple machines, visual effects/optics, communication, electricity, and even some great brain teasers.  My daughters are going into 3rd and 5th grade and had a blast.  I enjoyed it as much as they did.  Reasonably priced and they have a helpful staff for help with the exhibits or clues for the brain teasers.  One of my favorite exhibits was the laproscopic surgery exhibit.",
  "Took my 8-year old daughter who likes hands on activities. She really liked it. There were some activities she spent a long time on, some she checked out and passed by but she did everything. We were there for 4 hours. There are just a few rooms with exhibits packed creatively in each space. The staff is readily available and offer information to help the kids understand the science behind the exhibits. Two days later, my daughter is asking to go back. They have plans to build a bigger facility and I truly hope it happens. This is a nice place, has great information for kids and adults alike.",
  "We went here while visiting our daughter and almost 2 year old grandson. The interactive activities are well planned out and put together. There is a room for ages 0 - 4 which the little one had a blast but he also liked being guided around the exhibits and shown how they work plus all the exhibits are designed for little hands and are sturdy enough to avoid breakages. Altogether we spent about 3 hours here. My husband even had fun with the brain teasers!",
  "This is a great place to take the kiddos. It is a bit lower key. It has a lot of fun stations situated around three rooms. Some deal with sound waves, others about magnets, some about the human brain, etc. \n\nWe have been here a couple of times over the years and they switch up the stations so it’s never exactly the same. All the kiddos love it. Be prepared for years when you ask everyone to leave, because no matter how long you stay, they will want to stay even longer.\n\nGreat fun, definitely will be coming again.",
  "Gateway to Science is a great part of this small community. It will be fantastic when they can move into a bigger facility. For now I really appreciate what they do with their space. Our 4 year old loves the Preschool Discovery Hour.",
  "WOW! impressive and well maintained!\n\nAll ages of science and mechanical areas to explore by reading and hands-on learning.  Take an hour or 3 but definitely worth a stop.",
  "Found this place on here , looking for something to keep kids occupied for a few hours. Took 6, 9, 10 year olds, they enjoyed it. They were done in about 1.5hours. Exhibits were fun and put together nicely. Staff was friendly.  Pricing for kids was perfect, should be the same for adults since the kids are the ones targeted. Would recommend if your looking for something interactive and educational. "
 ]
},{
 "name": "Former Governors' Mansion State Historic Site",
 "address": "320 E Avenue B",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d3/76/01/former-governor-s-mansion.jpg",
 "tags": [
  "history",
  "family",
  "history",
  "knowledgeable",
  "tour",
  "family",
  "free",
  "history",
  "free",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d279112-Reviews-Former_Governors_Mansion_State_Historic_Site-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "I like to visit olden homes. It shows a lot about history.\n\nThis Former Governor's Mansion was restored in 1884. The governors lived here from 1893 to 1960.\n\nThe house is attractive, after all governors would take care of their home.\nIn 1975, people wanted the Former Governor's Mansion to be open for the people.\n\nWorthwhile to see!",
  "This mansion is not the easiest to find, mainly because of the unusual numbering system for Bismarck's Avenues which even confused our GPS!   However it is well worth persevering in order to find this lovely historical house.\n\nThe mansion is large for its time but very much has the feel of a family home and the various periods during which various Governors and their families occupied the building are nicely captured through the furnishings and artefacts and by an archaeological examination of the layers of wallpaper and paint in various rooms.\n\nFor someone knowledgeable - or wishing to be - about the political history of North Dakota this is a must.   For someone with a more general interest its a real step into the past.   The member of staff on duty was very knowledgeable but never pushy and we thoroughly enjoyed our visit through all three floors.\n\nBe sure to allow time to go outside and visit the former stables/garage block which features an interesting DVD and all sorts of information about chauffeurs and their families who occupied the building.\n\nI hope one day that the apartment over the stables/garage could be restored for the public - that would be really fascinating.\n\nDon't miss this  gem if you are in or near Bismarck ND",
  "For those who enjoy seeing what it was like to live in a mansion in the early part of the last century this is the place to visit.  It has been lovingly kept up and restored and is a great way to spend a few hours in Bismarck.",
  "I visited the Former Governor's Mansion while in Bismarck on a family trip. We were on a tight budget and were excited to find another interesting site to visit for free. This site offers free admission, but no formal guided tours. There are a lot of interpretive panels on the walls, and the docents are very attentive, but I wish there was a formal tour of the house. \n\nI wouldn't say that it is a \"must see\" site, but if you're looking for things to do for free, it is worth the visit. ",
  "I like to visit olden homes. It shows a lot about history.\n\nThis Former Governor's Mansion was restored in 1884. The governors lived here from 1893 to 1960.\n\nThe house is attractive, after all governors would take care of their home.\nIn 1975, people wanted the Former Governor's Mansion to be open for the people.\n\nWorthwhile to see!",
  "The grounds are beautiful; sometimes I wish it was at buck stop junction just so more people could get a view.",
  "amazing old architecture. plenty of parking in the parking lot around back. great displays and historical information.  free water, but feel free to slip some money in the donations jar. staff was very knowledgeable and friendly. don't forget to check out the carriage house in back.",
  "Six different governors lived in this house over the years. There are lots of spots on the walls and doors showing former wallpaper and paint colors.  The furniture is from the early time period. The house was originally built by a businessman then sold to the state for $5,000. The separate carriage house shows how transportation needs changed over the years from horses to cars. "
 ]
},{
 "name": "Keelboat Park",
 "address": "River Road",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/32/72/b7/thunderbird-eagle-sculpture.jpg",
 "tags": [
  "family",
  "walking",
  "kids",
  "historic",
  "walking",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8671501-Reviews-Keelboat_Park-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a great view of the river! Very nice and well maintained walking paths. A nice place to take the family. Ample parking.",
  "A park along the Missouri River representing Lewis & Clark expedition with couple scultures. Boat ramp and parking lot. Not much here to see.",
  "Great little place to stop by with the kids. Always a great view of the river. great little spot to check out when you drive by.",
  "The walking path/trail (paved) along the Missouri is very pleasant, scenic and provides some interesting historic info sites. If your in to outdoor activity on a warm sunny day, it's a  really nice walk, bike ride or jog to take with beautiful trees and view of the Missouri river.",
  "Fort Mandan was the wintering sire for the expedition, so the area was a big part of their adventure. I never realized they had a keel boat for the first part of their expedition, so it filled in another piece of the story for me. The park is free and very well done."
 ]
},{
 "name": "Buffalo Statue",
 "address": "600 E Boulevard Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/f8/74/4d/buffalo.jpg",
 "tags": [
  "wander"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d12982765-Reviews-Buffalo_Statue-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don't miss this lovely statue right next to the Heritage Center and the Sakakawea statue.  3 fantastic highlights of Bismarck all in one place!",
  "Our intent was to get the best lighting for a photo of the Capitol building. We drove by this statue and just had to get a closer look. The detail is amazing. We arrived early in the morning, so the buildings weren't open yet. We wandered around the grounds because of this cool statue.",
  "A lot of creativity in captivity!! A spot to  for a picture with the tame full size figure of a ND buffalo. Then go into the Heritage Center to wander and enjoy on a rainy day or a place to stay cool",
  "We stumbled upon this great sculpture as we left the state museum and headed toward the capital- well worth seeking out for a photo ",
  "Near the entrance to the North Dakota State Museum and the statue of Sacakawea. Interesting, but difficult to photograph. "
 ]
},{
 "name": "Kirkwood Mall",
 "address": "706 Kirkwood Mall",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/49/cb/7a/kirkwood-mall.jpg",
 "tags": [
  "eat",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d4177812-Reviews-Kirkwood_Mall-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Hi, I quite liked this mall, but if you are coming from Saskatchewan I wouldn't bother driving the extra 1.5 hours from Minot. Minot is just as good!",
  "This is a mall that is on the small size. Lots of empty store fronts but there are still a number of shops to visit.\n\nIt is clean and feels newly remodeled.  Nice place to walk around out of the rain/heat/cold.\n\nThere isn't a food court but there are a few places sprinkled around to get something to eat.",
  "This is a very nice mall.  They have a good selection of stores.  I would have liked to have seen more of it, but I got stopped at one of the kiosks and didn't get any further.",
  "not a bad little mall- don't be scared if you come in th3e empty side if you keep going there is a lot still open.",
  "This is a good place to get away for a bit. They have really remodeled and added new stores since last year when we were here! Always stop in Scheels to get a new NDSU shirt! All the stores are good."
 ]
},{
 "name": "Sakakawea Statue",
 "address": "608 E Boulevard Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/e4/68/1d/photo0jpg.jpg",
 "tags": [
  "history",
  "art",
  "walking",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d12618225-Reviews-Sakakawea_Statue-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don't miss this lovely statue right next to the Heritage Center and the buffalo statue.  3 fantastic highlights of Bismarck all in one place!  Very important commemoration of the role of Native Americans, especially this remarkable woman who contributed so much.  ",
  "I have always had a fondness for her story and it is nice to see a tribute here with a good description of her life story. A cool buffalo statue is just a few steps from here",
  "Sacajawea’s bravery and fortitude throughout her hard life is inspiring and impressive. The statue and accompanying plaque are important reminders of her irreplaceable role in U.S. history. ",
  "Walking the capitol grounds gives you free view but not a stop spot otherwise.\nThe buffalo is not far away if you enjoy metal art.",
  "I firmly believe that this statue honors Sakakawea's (Sacagawea) role in Lewis and Clark expedition. It was at nearby Mandan Lodge she and her husband joined expedition. "
 ]
},{
 "name": "Bismarck Civic Center",
 "address": "315 S 5th St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/b9/c6/76/bismarck-civic-center.jpg",
 "tags": [
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d1488627-Reviews-Bismarck_Civic_Center-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Offers many events, musical and sporting event for the city the size of Bismarck. W Very clean and plenty of parking, We have attended a number of events and never had a problem,",
  "This place just never seems to keep sucking $$$$ from the city.  First of all, it is a taxpayer funded building, but yet the taxpayers are not allowed to use it for much, especially on the \"property\" outside on the right away of the sidewalk.  Again, another public funded facility, but not really public.  \n\nAlso they charge absurd prices for EVERYTHING!!!  If you hold an event there, get ready to pay for not just the room rent, but everything else down to an outlet, ARE YOU KIDDING ME!!!!  Even motels don't charge that way for their event venues.\n\nLet's not forget that if you go to a main event in the facility, get ready for Constitutional violations of your personal property.  Metal detectors, searches of your bags, even pat downs if deemed \"necessary\" by the rent a cops they hire.  Also don't exercise your 2nd Amendment rights and Constitutional Carry, they will flip out and kick you out.  \n\nYep, taxpayer funded building, that by the way loses money each year without the support of the City of Bismarck, charges absurd prices from rent to food/beverages, and acts more like a communist regime when entering rather than a taxpayer owned and funded facility for the so called \"public\". \n\nIt is time to sell this facility, quit building onto it after voters tell you NO!!!  U of Mary is interested in it, SELL IT, and let a private entity run it at a profit if they think they can do so and then refund the taxpayers what the budget is each year to keep this money pit operating.",
  "The sound system is always bad, people have complained about it for years.  The food and prices are terrible.  Football and basketball teams come and go because they get no support and gouged for everything.  They have spent tens of millions of taxpayer dollars on it over the last 30 years, even when taxpayers said no.  Don't bother to complain, because nothing is ever done to improve the situation.",
  "The Bismarck Civic Center is a great facility to house business conferences. The facility is very accommodating for large groups.",
  "These guys did a great job at the Lignite Energy Conference. The food and service was great.  No waiting required. "
 ]
},{
 "name": "Buckstop Junction",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/3e/75/0e/buckstop-junction.jpg",
 "tags": [
  "tour",
  "family",
  "family",
  "food",
  "walking",
  "kids",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d1382430-Reviews-Buckstop_Junction-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The town itself was very cool and historical. The tour guide on the other hand wasnt great. He was constantly coughing, he was hard to understand/hear, and he didn't really share anything historical about the buildings. I would reccomend coming here but tour it as a family, not with a guide.",
  "Great little \"town\" for a wedding venue. Went to one here last year and it felt like we were in our own little town for the night!",
  "the annual Applefest is a must do for the start of fall activities.\ncombining the apple fest activities with the old town atmosphere is next to none and visualize living back in the day",
  "We go as a family every September for Applefest. Its a lot of fun. We love walking through all the old buildings & houses. Applefest there is great food to choose from & many activities for the kids to do.",
  "We only go to Buckstop Junction during Applefest in September but always enjoy it. The buildings are so neat to look through. And the activities are nice. Keeps us busy for a couple hours. We will continue to go each year as a nice family day"
 ]
},{
 "name": "Bismarck Brewing",
 "address": "1100 Canada Ave Suite 1",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/f9/c1/7d/getlstd-property-photo.jpg",
 "tags": [
  "food",
  "food",
  "food",
  "food",
  "food",
  "brewery",
  "delicious",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d14978716-Reviews-Bismarck_Brewing-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The had the top sirloin burger and cheese curds and it was amazing. Not sure if Ale works cooked it or not but the food was great. Also had a great beer and the atmosphere was great as well!",
  "Liked this place so much we went back twice in the same trip. Bismarck Brewing is actually located upstairs in the Ale Works building and it's great to sit up there and relax. You can order from the Ale Works menu and they will bring the food upstairs for you. There is an excellent selection of craft beers on tap (downstairs in Ale Works you only get a few from BB and the rest from other breweries) but we especially loved the Dazy NEIPA. Dank, hazy, and very citrusy!",
  "A very good selection of house made beers. Brewer was behind the bar and offered lots of interesting insights into the industry. A must stop if you’re in the area. ",
  "Liked this place so much we went back twice in the same trip. Bismarck Brewing is actually located upstairs in the Ale Works building and it's great to sit up there and relax. You can order from the Ale Works menu and they will bring the food upstairs for you. There is an excellent selection of craft beers on tap (downstairs in Ale Works you only get a few from BB and the rest from other breweries) but we especially loved the Dazy NEIPA. Dank, hazy, and very citrusy!",
  "The had the top sirloin burger and cheese curds and it was amazing. Not sure if Ale works cooked it or not but the food was great. Also had a great beer and the atmosphere was great as well!",
  "Our group had a few beers and ate food at the brewery. The people were very nice and we could do things at our own pace. They had a variety of beer for everyone. The food was quality, but slightly overpriced. We’d give them 5/5 if they had more budget friendly and/or health conscious food options!",
  "I had the prime rib special with their famous fries and it was delicious. My husband had their port wine burger and French fries and he was very impressed. My husband tried one of their specialty light beers and was pleased. I had diet Coke. We will definitely be trying this restaurant again. the wait staff was very friendly, knowledgeable about the menu and beers. great service!"
 ]
},{
 "name": "Chief Lookings Village",
 "address": "Northwest Burnt Boat Drive, Bismarck, ND",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/4a/b8/95/chief-lookings-village.jpg",
 "tags": [
  "eat",
  "walk",
  "kids",
  "walk",
  "walking",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d10642829-Reviews-Chief_Lookings_Village-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Do note, during winter months you must walk into this area as the gate is closed.  \n\nIf you are looking at capturing a beautiful sunset photo, this is the place to go.  The way the river is oriented with the overlook, works perfect for sunset and water reflection photographs.   There are benches to sit on but not many.   There are mountain bike trails that you can get to from this location.  These trails are also for hiking but be careful hiking as there are many blind curves due to the trees, and the course is speedy for mountain bikers. Great place to eat lunch.   There is a small memorial park on the south end of the park.  Beautiful flowers during the summer.",
  "Great little place to take the kids for a fun walk or to just show them the view. Great view of the river and surrounding areas.",
  "Look out spot \ntrails but rough walking\nnot  a picnic site or covered seating \ntwo benches for seating otherwise your car, and that space is limited: 6 cars was crowed when I was there at noon",
  "A good spot to get the viewpoint that the Indians had for many centuries. Not too much there now but use your imagination.",
  "If you want a quick hike, completely in the sun, make sure and stop.  But, there are many other better villages in the area.  The garden was pretty though"
 ]
},{
 "name": "Nickle's Lounge & Casino",
 "address": "800 S 3rd St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8497720-Reviews-Nickle_s_Lounge_Casino-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Bar can either be very quiet and relaxed or noisy and boisterous depending on the hotel guests.. Liz is a super bartender who will keep your glass filled. casino is small with just blackjack and pulltabs",
  "We always have a good time at Nickels Lounge. They make a great Bloddy Mary plus the beer is cold!! If you like to gamble they have a nice set up for that.",
  "The girls  waitressing were so sweet and were right there when you were  in need  of an adult beverage...thumbs up to you...drinks were  good..😃",
  "Went for beers during state darts. Four of us sat there for 15 minutes never got waited on and the place wasn't busy at this time. We got up & left. They were too busy visiting to wait on us customers good-bye. ",
  "Great people, drinks, pull tabs, darts... What more could you ask for in a small bar? We will be back for sure!",
  "We always have a good time at Nickels Lounge. They make a great Bloddy Mary plus the beer is cold!! If you like to gamble they have a nice set up for that.",
  "I ate here twice this weekend during the state dart tournament, which was held at the hotel Nickle's is located in.  The first meal was a rueben sandwich, which was delicious!  The next meal was the ribeye steak and shrimp.  I was skeptical of the ribeye when I seen it because it was quite thin.  However, I was pleasantly surprised at how tender and flavorful it was.  Both the steak ans shrimp were cooked perfectly!",
  "I was here twice while is Bismarck as I was staying in the Ramkota. The cocktails were, and I loved the bartender. The casino was really quiet while I was there, but it looked like fun!"
 ]
},{
 "name": "Bismarck-Mandan Convention and Visitors Bureau",
 "address": "1600 Burnt Boat Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/b7/16/33/bismarck-mandan-convention.jpg",
 "tags": [
  "kids",
  "free",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8545262-Reviews-Bismarck_Mandan_Convention_and_Visitors_Bureau-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nice place to shop for ND Souvenirs, fun place for kids to visit and play in a replica of a steamboat. ",
  "We wanted to visit the Fort Mandan Experience and we took a shot at the visitor center for information and ideas.  It was small but efficient and gave us plenty of brochures traveling through the Bismarck area.  Fort Mandan is worth the trip if you are passing through.",
  "Extremely helpful  with information. Very friendly. There is more to do in NorthDakota than hunting and fishing",
  "This is a FREE miniature museum at this visitors center.  They have a lot of tourist information.  I like maps and they had maps.  The lady working there answered my questions.  Visitors here can learn about all the activities in North Dakota.",
  "the visitor bureau has a a nice gift shop featuring items from N.D. artists. you can pick up state maps along with maps and tourist information from surrounding states. it is located a block from the interstatem with motels and restuarants nearby."
 ]
},{
 "name": "Camp Hancock State Historic Site",
 "address": "612 E Boulevard Ave",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/2a/e1/ba/camp-hancock-state-historic.jpg",
 "tags": [
  "walking",
  "history",
  "free",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d1382660-Reviews-Camp_Hancock_State_Historic_Site-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a historical place with lots of information.\n\nWe see at first a locomotive.\n\nHowever, there is way more to see!\n\n1877-1894 Quartermasster's office and Signal station\n\n1872: Officers Quarters\n\n1881 Bread of Life Church\n\n1909 Northern Pacific Railway Locomotive\n\n1951 Camp Hamcock\n\n1965: The oldest church was moved.\n\nI learned a lot while I read all the ifnormation. It makes sense.\n\nWorthwhile to see!",
  "I stopped by while walking along the street.  I wasn't looking for it.  It you like trains, weather bureau history, old churches, or old military posts, its worth stopping if you are in the area.  I won't travel here to see it.  Nice piece of local history. Well maintained.",
  "We really enjoyed this small museum and collection.  It's free and you can spend as little or as much time as you like.  It doesn't take very long to view everything.",
  "Very interesting tours of Indian village, a house that Mustard lived, barracks that they used at the time. Both tours $7 great value!",
  "There really isn't much to review on this. Its a great little spot in the middle of town. If you are really into historic sites then stop by here!"
 ]
},{
 "name": "Bismarck Municipal Ballpark",
 "address": "400 E Front Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/01/a0/c6/home-of-the-bismarck.jpg",
 "tags": [
  "family",
  "family",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d14982157-Reviews-Bismarck_Municipal_Ballpark-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great ballpark for this level of baseball. The Larks have me hooked. Great family entertainment during the summer.",
  "Nice park with lots of history.  Bismarck Municipal Ballpark is home of the Bismarck Larks of the Northwoods League.  The Northwoods League is a summer collegiate wood bat league.  Great value for a family on  a budget."
 ]
},{
 "name": "St George's Episcopal Memorial Church",
 "address": "601 N 4th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/e7/93/32/st-george-s-episcopal.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d17593409-Reviews-St_George_s_Episcopal_Memorial_Church-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was fascinated with this church. it was truly beautiful!\n\nThey had two colors: white and dark.\n\nIt has a steeple with black and white.\n\nThe doors are massive wooden doors.\n\nServices are at 8:00 A.M. and 10 A.M.\n\nWorthwhile to see!"
 ]
},{
 "name": "Cornerstone Community Church",
 "address": "111 E Wachter Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/e7/7b/4b/nice-shrubs.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d17594232-Reviews-Cornerstone_Community_Church-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Cornerstone Community Church is painted in orange, even the roof. We cannot miss it!\n\nThere is a steeple with the cross on the top. It is completely in white. It stands out very well.\n\nChurch is at 10:30 A.M. on Sundays.\n\nWhen we were here they had a motto: \" Let all you be done with love.\""
 ]
},{
 "name": "The Church of the Bread of life",
 "address": "601 N 4th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/20/12/b0/the-church-of-the-bread.jpg",
 "tags": [
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d17593049-Reviews-The_Church_of_the_Bread_of_life-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Church of the Bread of life is quite unique. It has a steeple with the cross on the top.\n\nThe people in this church are really nice.\n\nThis is worthwhile to see!"
 ]
},{
 "name": "Bismarck Downtown Artist Cooperative",
 "address": "222 N 4th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/b2/bf/4b/getlstd-property-photo.jpg",
 "tags": [
  "unique",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d7138051-Reviews-Bismarck_Downtown_Artist_Cooperative-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "By chance we were walking around do Motown Bismark and came across an artist putting together a mosaic piece out in front. He told us there was more inside. There were two places opened inside. One was a very unique gift shop that was going out of business (not sure when) and we got some real good buys. The second stop was the actual artist cooperative where local artists can exhibit their paintings. There was every imaginable type of paintings you can think of.  Some prices were high but others were very reasonable depending on the artists celebratory statues. There was some other hand made items but mostly painting. Defiantly a good stop.if you are doing a walk around down town Bismarck. I have to add that after we found the place my daughter joined the cooperation and now has two paintings on display. ",
  "Awesome work, if you like supporting your local downtown artists this is the place to stop. Almost everything is for sale and you can find some really amazing pieces that you might not be able to live without. There is usually an artist on site and they are all super friendly and willing to answer any questions or tell you about their work. Shop small (: support your local artists!"
 ]
},{
 "name": "United Church of Christ",
 "address": "1200 E Highland Acres Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/fa/7c/1e/getlstd-property-photo.jpg",
 "tags": [
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8131914-Reviews-United_Church_of_Christ-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Their game nights are every other Monday and a blast for adults and kids! The game nights are non-denominational, so all are welcome."
 ]
},{
 "name": "Bismarck Marathon",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d1488871-Reviews-Bismarck_Marathon-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a well organized race with a nice flat course, best part is you can park right next to the starting line. Be sure to spend some time checking out the heritage center when you pick up your number. Appreciated the fact that packet pick-up was open later for out of town arrivals night before the race. Highly recommended for 50 staters."
 ]
},{
 "name": "Art Gallerie on Main",
 "address": "402 E Main Ave Suite 9",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d8283954-Reviews-Art_Gallerie_on_Main-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "I actually found this gallery when I decided to take some lessons there. Beautiful work, primarily by the owner/artist, and everything from jewelry to fabric art to paintings. It's fun to discover the entrance, then explore the art. "
 ]
},{
 "name": "The Capital Gallery",
 "address": "109 N 4th St",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d11983160-Reviews-The_Capital_Gallery-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The display is very well set up and the location is honorable.  Atmosphere is a little bare but comfortable."
 ]
},{
 "name": "North Dakota State Library",
 "address": "604 E Boulevard Ave",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49709-d15823594-Reviews-North_Dakota_State_Library-Bismarck_North_Dakota.html",
 "source": "TripAdvisor",
 "reviews": []
}]
