[
{
 "name": "Boise River Greenbelt",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/0d/57/36/boise-river-greenbelt.jpg",
 "tags": [
  "family",
  "parks",
  "nature",
  "tasting",
  "walking",
  "nature",
  "walk",
  "kids",
  "walking",
  "walking",
  "kids",
  "parks",
  "nature",
  "walk",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d144727-Reviews-Boise_River_Greenbelt-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wonderful path for a stroll or a bike ride through the heart of Boise and beyond!  Great way to see the city and the Boise River and meander through the city parks. Great family activity.",
  "Every time I go to Boise I love to go on the Boise River Green Belt!  Especially this last trip in June with my beautiful younger sister and amazing daughter we got on the green belt at It is a must!  Beautiful!  Tree lined path ways will take you to down town Boise including Ann Morrison park.  I am always inspired on the Boise River Green Belt!  Nature!  Happy people! Children from senior citizens enjoying the great out doors!  Beautiful birds, and the sound of the water flowing is a treat!  Floating the Boise river  is another experience to add to your bucket list!",
  "From southeast of Boise near Lucky Peak Dam clear northwest to Eagle, the Boise greenbelt has miles and miles of trails along the river, through Boise State University and through the extensive park system on both sides of the river. Breweries,  wine tasting  and restaurants abound.  Near Garden City and Eagles you will see great wild life, Eagles if course and deer. We are blessed to live a block or two away and the Greenbelt was a primary reason to move here.",
  "I like the Boise River Greenbelt for for fast-paced walking exercise with occasional stops to admire a flowering tree blooming now in spring or to follow a bird's song to find its source. There are waterfowl of various species drifting with the water or resting in slack water near shore. Taking a slight detour to walk the paths through the MK Nature Center may yield sightings of fish, mink, deer, and more birds. If you're a visitor at a hotel, ask if they have a Green belt map. Whatever part of Boise you're in from Eagle to Southeast Boise, ask which way to the river. A couple portions are closed currently (April 2018), so check with a reliable source.",
  "You can rent a raft or a tube at barber park depending on the size of your party.  We try to do this every summer with the kids. I recommend going during the week as the weekends can get kind of crazy.  They have a bus that can transport you back to your car, but we always take 2 cars and leave one at each end of the river.  I",
  "The Boise Greenbelt is one of the crown jewels of Boise!  It follows the Boise River for miles.  It's sometimes crowded with bikes, dogs, and walkers, so be aware.  There are bike repair stations  along the way as well as rest stops. Birdwatching is wonderful. ",
  "Very relaxing and a great park. Bucking, walking, sight seeing, photography and just being outdoors.\nThe river is awesome and offers other ways of relaxing like kayaking and tubing. ",
  "The Green Belt through Boise and surrounding cities is beautiful. It runs right along the Boise River, right through the middle of town. It is the bicycle freeway! Easy to get almost anywhere on the Green Belt without a car. Not just for bikes, walking running, roller blading, Skateboarding, it’s all allowed.",
  "The greenbelt adjoins the Boise River through Boise.   It is accessible from several locations.  My favorite area is near Boise Downtown and includes al nice parks, the Boise State University Campus, the Boise Zoo and a kids exploratorium (fee entry).    A great place to get some exercise and picnic next to the river.  Only negative is lots of geese which are messy.",
  "Great place to walk, run, bike or skate.  Lot's of beautiful scenery right in the heart of town.  Don't forget the side trip to the MK Nature Center, right off the Green Belt.",
  "Very scenic riverwalk with parks on both sides of the river.  The greenbelt seems to stretch for 21+ miles with numerous opportunities to cross over to the other side.  The greenbelt hots the northern edge of the BSU campus.  \n\nAbsolutely beautiful...."
 ]
},{
 "name": "World Center For Birds of Prey",
 "address": "5668 W Flying Hawk Ln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/37/9a/3b/world-center-for-birds.jpg",
 "tags": [
  "walking",
  "tour",
  "history",
  "family",
  "family",
  "nature",
  "kids",
  "family",
  "tour",
  "knowledgeable",
  "kids",
  "tour",
  "walking",
  "learn",
  "kids",
  "tour",
  "history",
  "knowledgeable",
  "walking",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d143832-Reviews-World_Center_For_Birds_of_Prey-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "We brought the grandkids to the World Center for Birds of Prey last month and had a grand time. We checked their website ahead of time to see when things were happening and had the choice of four different live bird shows and two walking tours to their archives to hear about the history of falconry. We chose the morning and were able to do a pair of bird shows (the grans loved both Bob and Winston) and the walking tour highlighting their archives and Arab falconry wing. Then we wandered right next to inside and outside bird exhibitions ... and the kiddos were so excited to see a bald eagle, an arctic Gyrfalcon, a gorgeous red-tailed hawk, Lucy the turkey vulture and two giant California Condors in the outdoor areas. The inside habitats featured an Applomado falcon, a very talkative Harris' Hawk, a peregrine falcon, a great horned owl and the find of the day, a huge and impressive harpy eagle! The staff was obviously very dedicated and informed and we look forward to coming back in the fall for their outdoor flight program. Highly recommended by the entire party .. grandparents, parents and bird-crazy grandchildren!",
  "I recently took members of my extended family from out of town to see the World Center for Birds of Prey.  The ages ranched from 6 to 82.  All of them were awed by what they saw. This Center has brought several endangered bird species from all over the world back from extinction. We had a wonderful volunteer docent that told us about the various caged birds, talked about a tiny little screech owl and let us get close up photos of her.  She then took us over to the archives building to see among other thinks the falconry exhibit.  Only a few miles south of Boise, worth your time no matter your age.  .",
  "We thoroughly enjoyed our visit here! The center offers a close look at their work of preserving several species of birds of prey, live presentations of the birds, and loads of background information on why and how the birds do what they do. Go early and you'll be able to see the videos and other demonstrations, such as training their turkey vulture! The volunteers love what they do, and it comes through in how they discuss the birds and share.",
  "This really means, WORLD center, meaning there is only one of these in the world.  Everyone involved in this center is committed to the preservation of bird species that are increasingly vulnerable to extinction.  I send them money every year to keep up the good work. Everyone we have taken to this center has come home, changed in profound ways. This is a national treasure and must see and lifetime experience. Go soon and often, the birds need your help and support. Good job everyone!!!",
  "If you are into wildlife and nature, this is a must see for the entire family. Early spring and fall are excellent times to visit. Can be a little hot during July, but early morning visits can be enriching.",
  "My friends I love this center. I was recommended by several friends to come and visit this location. So I decided to put it on the test. Sure it was small but it was worth the price to see these amazing animals that live on our fascinating earth. I would recommend that you should bring kids because it is a family pleaser.  Any way we enjoyed the tours, the people that gave us the tours really knew what they talked about and that made our day. It built their credibility so I knew that me and my wife got our money's worth.",
  "We walked on the short trail overlooking Boise.  It was a cold, windy day, but the view was beautiful.  Then we joined a docent for a guided tour of the Archives of Falconry museum.  She was extremely knowledgeable about the artifacts, the people who founded the museum, and falconry in general.  After she led the group back to the visitor center, we toured the outdoor and indoor cages where live birds of prey of at least 10 different species were on display.  They even have some condors, although the one we caught a glimpse of went inside before we could get close.  Some of the birds were unfamiliar to us:  the gyrfalcon, Northern Aplomado Falcon, and Harpy Eagle.  The docent brought a live falcon out in the small theater and took questions from the audience.  There are also a few other exhibits to see.  Give yourself at least 2 hours to enjoy everything.",
  "Even if you don't consider yourself to be a \"bird person,\" the World Center For Birds of Prey is something to see.  Here, the focus is specifically on birds of prey, and there is much to learn and appreciate about them. \n\nThere are numerous indoor displays to view, and live presentations about selected birds, which are brought into the rooms by their handlers.  Very interesting and well done.  \n\nThe outdoor area provides a walking tour, with many birds to see in caged areas.  \n\nWe went to two presentations:  Marcia told our group all about Bob, an American Kestrel Falcon, and Steve introduced a second group to Schmidt, a Peregrine Falcon.  Excellent presentations, which involved the audience with lively Q & A sessions. Note: check in advance for presentation times.\n\nWe also enjoyed our conversation with Scot, who pointed out some fascinating birds which were in the outdoor area, and some of their histories, too.\n\nWe spent two hours here.  And the time really flew by!! (Sorry, I couldn't  help myself).\n\nIt was a great learning experience.  For all adults, young and old.  And all the kids, too!",
  "We spent a few hours here on our recent Boise trip.  You can tell all employees and even volunteers love their job and are so excited and knowledgeable.  The fella at the front desk starts you off with a nice back story and starts you off in the right direction!  We got to see a bald eagle from about 5 feet away, now that was cool!  This place does a lot for the raptor community, getting them repopulated to ward off extinction of species in some cases.  There is a bunch of live birds and also exhibits of bird history and other cool artifacts!  Jeff and I believe (Dick) did our main tour and they both did a great job explaining things.  Go here and if you have kids I think they’d definitely enjoy it too!!",
  "We brought the grandkids to the World Center for Birds of Prey last month and had a grand time. We checked their website ahead of time to see when things were happening and had the choice of four different live bird shows and two walking tours to their archives to hear about the history of falconry. We chose the morning and were able to do a pair of bird shows (the grans loved both Bob and Winston) and the walking tour highlighting their archives and Arab falconry wing. Then we wandered right next to inside and outside bird exhibitions ... and the kiddos were so excited to see a bald eagle, an arctic Gyrfalcon, a gorgeous red-tailed hawk, Lucy the turkey vulture and two giant California Condors in the outdoor areas. The inside habitats featured an Applomado falcon, a very talkative Harris' Hawk, a peregrine falcon, a great horned owl and the find of the day, a huge and impressive harpy eagle! The staff was obviously very dedicated and informed and we look forward to coming back in the fall for their outdoor flight program. Highly recommended by the entire party .. grandparents, parents and bird-crazy grandchildren!",
  "We were there on a cold, grey day but the birds were so fascinating we forgot the weather! The docents are highly knowledgeable and you can tell they like their jobs. This was one of the best animal displays and information I’ve seen. Highly recommend."
 ]
},{
 "name": "Old Idaho Penitentiary",
 "address": "2445 E Old Penitentiary Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/0c/87/1e/photo7jpg.jpg",
 "tags": [
  "walking",
  "tour",
  "tour",
  "nature",
  "walk",
  "kids",
  "tour",
  "tour",
  "history",
  "learn",
  "history",
  "tour",
  "family",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558607-Reviews-Old_Idaho_Penitentiary-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Interesting look at what prison life was in Idaho until 1973.  This old penitentiary dates back to the late 1800's and is very much intact.  Gave me a good sense of what it must have been like to serve time there.  There are posters of some of the more notorious prisoners who served at the pen, which gave some of their details and background stories.  Extremely creepy look at the gallows where a hanging took place as recently as the 1950s including the \"drop room\" (yikes!!!) - Go visit the botanical gardens next to the prison, in the far corner of the gardens you'll find an old graveyard where several of the prisoners who died in prison were buried.",
  "We went to the Friday the 13th story telling day. That was the catalyst that brought us to this historical place. The story telling was o.k and made it visit special, however walking around this venue was chilling and very interesting. There was a hidden perk, the weapons museum! A person in our party really enjoyed the weapons museum because they play a lot of video games and they could actually see the virtual weapons they use in games in real life!\n\nThis visit exceeded my expectations and was a very interesting self guided tour, with helpful staff and amazing photo opportunities. ",
  "My wife and I had a weekend to kill in the beautiful city of Boise.  We enjoyed quite a few adventures during our short visit, one of which was a two hour tour of the Old Idaho Penitentiary.\n\nThis 101 year old prison is nestled into the foothills of the Rockies just outside downtown Boise, a lovely setting to be sure.  In the cell block where the death row inmates were housed was a window looking out at a beautiful wooded area at the edge of the foothills.  The inmates could not see out the window from their cells, but I imagined that perhaps the guards would allow them one last glimpse of the natural world before their walk to the gallows.\n\nAlong with the death row cells and the gallows, you can also venture into the other cell blocks, read stories of the various inmates that occupied the prison at one time or another, and even be closed into one of the solitary confinement cells in a building known as Siberia... creepy!!!\n\nThere is a small woman's ward where the female prisoners were housed.  It is interesting to read the variable differences that the women received compared to the men.\n\nIf you like hiking you will find several nature trails requiring a moderate skill level just outside the walls of the prison.\n\nThere is a whole wing with fascinating displays of gun craft and the weapons of war through the ages, and beautiful gardens blooming amongst these decrepit buildings of a bygone era.\n\nMy wife and I opted for a self-guided tour, and spent a solid two hours wandering around at our own leisure, but guided tours are also available.  The entrance fee is minimal... $6 per adult... and the prison is open daily from noon to 5pm, with the last admittance shortly after 4pm... a small window to be sure, but while worth trying to squeeze through if you have the time and inclination.\n\nI guess the prison also offers midnight ghost tours on occasion, which would be spine tingling I am sure.\n\nJust outside the \n\nCheck the penitentiary out if you have the time... we are sure glad we did.",
  "We visited with our kids, ages 10 & 12.  We enjoyed the self guided tour and learned more than we expected. It took us just under 2 hours to see the whole penitentiary. ",
  "I loved looking at the old jail cells and reading about the history of the penitentiary. The jail is very well preserved and the information will be hold the attention of people of all ages. It seemed like a campus of different types of cells where different inmate would be held. I definitely suggest coming here for a brief yet engaging historical tour.",
  "The Old Idaho Penitentiary is a fascinating slice of life of Idaho (and America). The grounds have been kept in roughly the condition they were left in 50 years ago when the penitentiary was abandoned for the new state prison.\n\nBe sure to take one of the guided tours (no extra charge) to learn the \"behind the scenes\" stories of the men and and women who spent time there.",
  "A lot more than just a historical prison.  The Idaho transportation museum is there with lots of old wagons and other vehicles.  The prison contains a huge display of firearms from different eras and wars.  The State Geological Society museum is also located in the old prison.  Excellent use of an old prison facility for many different facets of Idaho history.  And don't forget the Botanical Gardens next door.",
  "The Old Idaho Penitentiary is an interesting historical site in Boise.   It is a good place for a  picnic and offers access to a trail that leads  to Table Rock overlook above the Boise Valley.   It is a good place for a family picnic.  If  a tour of the Penitentiary is on your agenda be sure to check when tours are scheduled.  I do not recommend the hike to Table Rock in wet weather.  The hike is a good workout."
 ]
},{
 "name": "Freak Alley Gallery",
 "address": "210 N 9th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/a9/00/fe/freak-alley-in-boise.jpg",
 "tags": [
  "wander",
  "art",
  "art",
  "walk",
  "art",
  "walk",
  "walking",
  "walk",
  "art",
  "active",
  "unique",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d8459033-Reviews-Freak_Alley_Gallery-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "A friend told me to check this out when I was down at the Capitol Public Market.\n\nIt's a great place to see a variety of paintings on several murals down an alley between 8th and 9th streets near Bannock St. in Boise. \n\nI highly recommend taking a stroll down here to check it out.",
  "Freak Alley Gallery is a very chill spot to meander through the downtown Boise alleys and take in some cool large-scale art. Starting at 8th Street in between Idaho and Bannock Streets, you can wander a few blocks on either side. The Gallery was once just one block in length, but has now expanded to three blocks and will most likely keep growing due to it's popularity! Probably the BEST photo opportunity in downtown Boise, ",
  "If you wanna see street art of the uber talented artists in Boise, you gotta see this!  Its only a few blocks but the art is amazing! Its a great place to take selfies, senior pics and everything in between!  I highly recommend this!",
  "It is always fun to walk by when going or leaving a restaurant and see if any new art projects has been painted. Visit with fairly good lighting to get the most out of it.",
  "The Freak Alley Gallery has some interesting perspectives from young artists. It won't cost you a penny to walk through it, and it is well worth the time to go. There's a lot of talent coming through there.",
  "Each painting has its own style.  I like the Jim Hendrix one. Many painting go during the day , doesn't look safe at night. It's kinda hard to take pictures if there are cars in the way just get a great angle. ",
  "My 2 daughters and I rented those Lime scooter and went all over in this area.  Freak Alley is a hidden gem that is never the same twice.  The artistry and the style really needs to be experience at least once.  Go see it.",
  "The first time I saw Freak Alley was over fourteen years ago. I appreciate Freak Alley then and now. Over the years the alley continues to inspire local artists and captivate locals and tourists alike. I cannot imagine Downtown Boise without Freak Alley, an authentic explosion of creativity and expression. \n\nThis post is going to serve as an inspiration for me to take picures next time I visit Freak Alley.",
  "If you are in the area walking, this makes a very fun walk. Artistry is very beautiful, but I do not think it is something to go out of your way for. It is an Alley. There are people smoking, and garbage along the walk....but disregard that and you do get some pure street art that has a lot of soul. I truly did enjoy. ",
  "I love a town that has a must see experience. Just like the gum wall in Seattle or Lombard Street in San Francisco . . . Boise's created it's own little must see attraction Freak Alley.\n\nFreak Alley has embraced an artists expression of art and transformed an otherwise dreary and sketchy alley with bright, interpretive displays of art. \n\nThe art does change occasionally, so if you've seen it before it's worth giving a look again.\n\nCentrally located in downtown Boise, it's a very easy addition to other sight seeing you may be doing in the area. Most commonly my hubby and I travel through while out on a lunch or dinner date. It's also a very common photo op spot. \n\nI'd recommend passing through before it gets dark, so that you can really get a glimpse of all the art. Still fun at night, but I think it's easy to miss some of the hidden pieces without good lighting.\n\nIt is possible to shut down the alley and rent it for a private event. This can be a unique and memorable experience. \n\nP.S. Yes, it is an active alley. So there are businesses with dumpsters and such. Bare that in mind and embrace what it is.  I mean if you can not get grossed out by people chewing gum and sticking it all over the walls, then this is a dream! :)",
  "If your downtown and going bar hopping, make sure you check out the funky art in the Alley. Daytime only to see the art."
 ]
},{
 "name": "Idaho State Capitol Building",
 "address": "700 W Jefferson St 8th Street, and State Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/fc/7c/1a/idaho-state-capitol-building.jpg",
 "tags": [
  "tour",
  "history",
  "kids",
  "walk",
  "tour",
  "walk",
  "tour",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558625-Reviews-Idaho_State_Capitol_Building-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Idaho State Capitol is history in action.  Be sure to book a tour so you see the important and interesting things.  It is a fascinating building with a story to tell.  Be certain to wear comfortable shoes, preferably ones with rubber soles.  The marble floors are hard.  Please enjoy, Idahoan are very proud of the Capitol.  Welcome!",
  "Unlike the nations capitol and most other public buildings - the Idaho State Capitol building is readily open to the public - no appointment, no crowds, just park on the street and walk in. The architecture is stately and beautiful, and well worth the stop.  There really isn't a lot to see/do for little kids, but anyone else would enjoy wandering around and seeing the senate and house chambers, offices, etc.  And there are nice historical artifacts in the nooks and corners that are definitely worth seeing.\nThe guards were very nice and helpful in finding things as well.",
  "This is a must if you bring visitors to Boise.  Still has no security and open. It is a treasure to be inside with lots to see and roam around in a public place without someone following you. It does have cameras as a idiot found out last year. He was going through drawers and personal items. They should have put him in jail! He will ruin the openness that we have here in Idaho. I never been in any other Capitol without strong security and you usually skip seeing because of the hassel.  Everyone should go while they have  a chance to see things undisturbed. Everyone is usually awed.",
  "Wow! This place is interesting! Who knew??? Or at least, I didn’t! My esteemed spouse and I took a small tour there and look forward to going back... there was just so much to see. Between the business of the government, the beautiful architecture, the informative displays and artwork this place is worth a gander! Head there for a fun afternoon!",
  "Ring the \"Liberty\" bell in front or walk around.  Absolutely beautiful building inside.  SE walkway makes an absolutely gorgeous setting to take a sunset pic amongst the roses and lavender",
  "Road trip! State Capitol #42 visited for us. We were there on a Sunday so we had to do the self tour. There is a great series of self started videos in the visitor center which are great to watch before you start the self guided tour. Plenty of street parkin available on a Sunday.",
  "So awesome to see the only State Capitol with geothermal heat. We enjoyed our visit. A volunteer showed us around and we appreciated the talk.",
  "The Idaho State Capitol reminds me very much of my own State Capitol in Madison, WI with one major distinction.  The city of Boise has allowed horrible over-the-street stop & go lights to block the amazing view of the Capitol with the mountains in the background.  (See picture attached.). I would go so far as to say that for city beautification, they should rethink that system!\n\nBut - really nice neighborhood.  Walking distance to a really great downtown area of shops, hotels & restaurants. "
 ]
},{
 "name": "Camel's Back Park",
 "address": "1200 Heron St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/37/55/4d/camel-s-back-park.jpg",
 "tags": [
  "eat",
  "kids",
  "hike",
  "kids",
  "family",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559301-Reviews-Camel_s_Back_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "You will want to see if you have what it takes to climb the first hill and then run down the second hill.  The park is popuar and includes a play ground, sand pit for volley ball, and open space to toss a frisby or football.  The park is small with limited number of areas to eat, so bring a pic nic blanket.  Also, if you like tennis there is a small tennis court.",
  "The front of the hill at the park is a steep and tough climb, but worth every step. otherwise the playground is perfect for kids and more than enough room to run around and play sports...plus ice cream and great tacos are a few blocks away in Hyde Park ",
  "This isn't a gorgeous park (it isn't full of flowers and with lots of trees) - but the hike up is strenuous and fun if you are near downtown.  And if you get to the top the view is great of Boise and the hills.",
  "This park is amazing! You can play with the kids or go hiking for beautiful views. Make it a stop on your visit. It is a must see.",
  "Enjoyed the trails and the amazing scenery. There are a variety of intensities and steepness to the hikes, making it a park with something for all. Trails are well maintained.",
  "As you see in this pic the trail to the top is very steep but there is also a switchback trail going up and coming down. Awesome view of downtown from the top. Lots of trails that stem out from here.  At the bottom is a beautiful city park. Large.  Worth checking out. Great picture opportunities",
  "We were trying to take in as much as we could with only a couple days stay in Boise.  The climb to the top of Camelback from the park is a bit steep and the dirt/gravel path at the start of the climb is difficult if you are not wearing the proper shoes and since this was summer time and we were doing other activities sandals made the climb even more challenging.  However, when we got to the top we had a great view of the area!  We then took another path down and relaxed at one of the tables in the shade.  There was a nice breeze that helped cool us down.  The is a \"play structure\" area and lots of grass for having a family outing.",
  "Hiking, biking, picnic, the options are endless.  This is a wonderful North End park suitable for all age groups.  "
 ]
},{
 "name": "Bogus Basin Mountain Recreation Area",
 "address": "2405 N Bogus Basin Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/e0/3f/8b/bogus-basin-mountain.jpg",
 "tags": [
  "family",
  "kids",
  "free",
  "free",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559288-Reviews-Bogus_Basin_Mountain_Recreation_Area-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Bogus used to be a great family place to visit, but in recent years the new management has ruined it.\nNow it's overpriced, undeserved and no more fun. If you complain you will get a threatening email from the general manager Brad Wilson. He is an example of how horrible the lack of customer service is, and how they only care about money.\nDon't waste your time or money, go to one of the less expensive and better resorts.",
  "Started taking my kids skiing last season and we've loved it.  Luckily we can go up during the week to avoid the busy weekends.  The staff are friendly.  Kids recently had their first lessons and loved them (Dave was a great instructor!).  The road is well-maintained.  Recently did our first night skiing and the kids are already begging to do that again.  The season pass sale that starts President's Day is a great value.  So happy to see all the work that's been put in the last few years to make this a great place that we look forward to going to often.  ",
  "Skiing at Bogus is simply a great value. The season passes have additional \"perks\", includiing free 1-day passes at a number of other ski resorts.  The summertime fun includes a gravity fed Mountain Coaster, Mountain Biking and hiking. Chair lift to top for viewing or tossing on your bike for the downhill fun.  Check out their website for info and weather.",
  "This is a great mountain to snowboard or ski.  I flew in for the weekend to spend it snowboarding with my son who attends BSU.  What a geat resort!  The ski lifts look new, they have several quad speed chairs that take you to the top of the mountain fast, the staff and crew are very friendly and helpful in getting the lines moving.  I was also able to get a free all day pass because I flew in on Alaska Airlines....brought my boarding pass and they gave me a fee ticket.  I'll be back for sure, next time I'll fly in on the early flight, get a free ticket that day and fly back out that night.",
  "Bogus Basin is a great place to learn to ski, just don't recommend it on the weekend as it is way to crowded.  I had private ski lessons with Glen and he was amazing.  I would recommend him to anyone.  The cost of the private lessons is quite reasonable and would do it again.  The views from the mountain are just amazing.  If it is your first time going up the mountain make sure you research about the drive up.  As it can be difficult at times and you will need to be prepared."
 ]
},{
 "name": "Idaho Botanical Garden",
 "address": "2355 Old Penitentiary Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7d/5c/bf/cacti-in-bloom.jpg",
 "tags": [
  "kids",
  "learn",
  "walk",
  "field",
  "wander",
  "music",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558667-Reviews-Idaho_Botanical_Garden-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "As an Easterner, avid gardener and photographer, I visited the Idaho Botanical Garden in June to learn about the wildflowers and other native plants I would be seeing in later hikes. The Lewis & Clark native plant garden, entered through a lovely circular pergola with a planted roof, was a delight, with penstemons and other wildflowers in bloom - beautiful and educational too. The garden accesses an adjacent Firewise demonstration garden managed by the BLM and the College of Western Idaho, an opportunity to gain a deeper understanding of the challenges of gardening in the dry, high desert. Native plants in full bloom, along with plants adapted to this harsh climate were highlighted throughout the entire IBG site.\nAlthough IBG is relatively small, there is so much to see, so many beautifully planted garden experiences packed into its hillside site, that the half day I had planned just wasn't enough time to take it all in, photograph and just sit and enjoy. Less serious gardeners could easily see everything in a half day - the compact layout is a definite plus - but I intend to schedule a full day on my next visit.\nRoses were everywhere and spectacular in May and June - no sign of the bugs and diseases we get back East.\nAs I took a break in the shade, I was fortunate to observe a lively demonstration to a group of young school kids, who responded enthusiastically to the animated and fun young woman educator. Lots of attention is paid to delighting kids in the Children's Garden and with special programs. Every single staff member I met was exceptionally pleasant, helpful and willing to engage with visitors and answer questions. This is a very special place.",
  "Once we found our way in--it's a little confusing to get past the entrance and into gardens--we were delighted with the layout and the variety of the gardens, which are augmented by clever outdoor sculptures.  The Lewis and Clark Garden, where we learned about the flora Lewis had collected on his voyage, was a highlght.  The variety was endless--a rose garden, formal gardens, a fruit and vegetable garden, and more.  The Children's Garden had lots of hands-on activities that even adults can enjoy.  We hadn't excpected such an extensive and educational botanic garden in this location and found it well well worth the visit.",
  "This is located on the old penatencuary lot.  It was so beautiful to walk around.  Price is so reasonable at $7.00 there's hiking by trails and children's garden.  Wonderful sculptures.  We talked with some of the gardeners.  Really nice way to spend a few hours",
  "Don't miss the Christmas Lights at the Botanical Garden, since they are amazing.  Dress warm, since it's cold out there, but there are tents with hot chocolate, spiced cider and cookies.  We've gone during the summer also, when all the flowers are blooming, and it's gorgeous then also.",
  "Don't miss the Christmas Lights at the Botanical Garden, since they are amazing.  Dress warm, since it's cold out there, but there are tents with hot chocolate, spiced cider and cookies.  We've gone during the summer also, when all the flowers are blooming, and it's gorgeous then also.",
  "I had lived across street for a year but never visited. It's very nice, enjoyed our time. They have great concerts and events. Parking is a bit crazy and it is very hot in summer. Lovely place and nice to have it",
  "This garden has many layers to it. There are different parts of the garden where children can play, a place you could meditate in and other areas. They were putting lights up on the trees for the holidays and I can only imagine how beautiful it looked. ",
  "Beautiful venue for this spectacular light show. Fun for children and adults alike. Paths journey through the many gardens, which are larger and more extensive than one would expect. Reasonably priced (great cause), easy parking and access. Go!",
  "Pleasantly surprised how big this place was.  Lots of different gardens to meander in.  I was there in Oct and still many nice flowers and the trees changing color.  Really enjoyed my time there.  I spent more time there than I thought I would. Good job and kudos to those that keep the gardens kept up!",
  "Although we were able to wander around a little of the garden, it was closed for a Foreigner concert on a nearby field. We were disappointed since not only was the Garden closed but the Penitentiary too. We saw some native plants and a couple of sculptures. Some of the plantings looked quite bedraggled but since we didn’t really know where exactly the Garden stopped or started it is difficult to make a judgment.",
  "On Friday night they had an adults only event where you could buy beer or wine and walk around the garden.  It was a lovely evening and such fun.  Music, some vendors, scarecrows -- a really lovely evening!"
 ]
},{
 "name": "Kathryn Albertson Park",
 "address": "1001 N Americana Boulevard",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/be/51/55/kathryn-albertson-park.jpg",
 "tags": [
  "walking",
  "family",
  "walk",
  "walk",
  "walk",
  "walk",
  "walk",
  "tasting",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558618-Reviews-Kathryn_Albertson_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park is one of the true \"gems\" of the Boise park system. A very generous gift of land and the cost of improvements made by the Albertson family turned a horse pasture into a beautiful park just a short walk from our  Boise River, our greenbelt and Julia Davis Park. The park has nice walking paths, \"gazebos\" arbors, ponds, benches, pick-nick tables and the like. It also serves as a great place for family photographs as there are backdrops that will suit everything from engagement pictures to multi-generation gatherings. It is also a popular place for weddings. In the spring it is a fun place to go to watch the baby ducks and goslings exploring and feeding. \n\nNote: If you want to bring a dog to the park check when it is allowed as the park is often off limits to them.\n\nAlso use common sense and pay attention to what is happening around you as the woods that shelter the wildlife that live there  can also shelter \"bad actors\" looking to prey on others.",
  "We have been to this park twice now and it has always been a pleasure to walk the paths around it. We have seen so much wildlife which includes deer, beaver and many species of birds including the American Bald Eagle! It's a great place to take your dog for a walk as well, but make sure they are on a leash :-)",
  "When you have some time or need some time efore a busy challenge take a walk around this Park it will allow you take a deep breath and count your blessings.",
  "This is a great place all year round, especially in the fall with all the fall colors.  Nice paths to walk around the lake and lots of birds to view.  Highly recommend for a nice romantic walk with a loved one!",
  "Very nice walk along the river, trees were beautiful and you can tell that it is well maintained.   Bike riders and joggers seem to be well aware of tourists.   Take time to walk over the bridge by the zoo to see the Boise State campus.",
  "There are a lot of trails to follow and explore within this beautiful downtown park!!!  You may even see a deer or other wildlife along the way, and it never feels crowded, because there are so many areas!",
  "Lots of water attractions, nice trails to walk on, great view of the river.  Close to wine tasting room and resturants.",
  "When I was running on the Greenbelt I took a bridge across the river and ended up here.  It was a lovely park.  Little kids would have a blast here."
 ]
},{
 "name": "Boise Train Depot",
 "address": "2603 W Eastover Ter",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/b2/48/1a/view-from-the-back.jpg",
 "tags": [
  "active",
  "library",
  "active",
  "walking",
  "tour",
  "history",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559295-Reviews-Boise_Train_Depot-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Boise Depot, an iconic Spanish styled train station, opened in 1925. It is no longer an active stop but don't be surprised to see and/or hear a train go by. The inside of the Depot is not open very often, usually on Monday & Sunday 11 am-5pm. I'm reviewing the grounds which you can visit year round. This is a popular place for weddings because the building, the grounds and the spectacular views make a great backdrop for any celebration. If you are visiting and need a break, there is lots of shade around the gardens and koi ponds. Just bring your own snacks and hit a restroom before you arrive. It is hot in the summer afternoon, but morning and evenings in high desert Boise make this a nice stop. The Depot is illuminated at night-sitting on a hill, it is quite striking.",
  "The Boise Depot, with its white sandstone exterior and Spanish tiled roof and trusses, is one of Boise's gems. \n\nThe building, which opened in 1925, was designed by Shreve & Lamb, the New York architects who designed the Empire State Building. At the time, the company was a division of Carrère and Hastings, a prestigious firm that designed the New York Public Library, the Standard Oil Building and the Russell Senate Office Building and the Arlington Memorial Amphitheater in Washington, D.C.\n\nThe entrance required 140,000 pounds of sandstone, which had to redone when the depot was refurbished between 1990 and 1993 by the Morrison-Knudsen Corp.\n\nFrom the depot, located on the south end of Capital Boulevard, you can see into downtown Boise and the Capitol.\n\nThe outside of the depot is always open. The interior is open Sundays and Mondays from 11 a.m. to 5 p.m.",
  "The Boise Depot, an iconic Spanish styled train station, opened in 1925. It is no longer an active stop but don't be surprised to see and/or hear a train go by. The inside of the Depot is not open very often, usually on Monday & Sunday 11 am-5pm. I'm reviewing the grounds which you can visit year round. This is a popular place for weddings because the building, the grounds and the spectacular views make a great backdrop for any celebration. If you are visiting and need a break, there is lots of shade around the gardens and koi ponds. Just bring your own snacks and hit a restroom before you arrive. It is hot in the summer afternoon, but morning and evenings in high desert Boise make this a nice stop. The Depot is illuminated at night-sitting on a hill, it is quite striking.",
  "We happened to drive down the road where the depot sits and just had to stop there.  It was twilight and no one was there so we did not see the inside.  We enjoyed looking at the large locomotive outside and walking around the small park (Platt Gardens) in front of the depot.  Looking out from the park, there is a wonderful view of downtown Boise looking down the street at the state capitol.",
  "I'm not a train person or anything so not exactly into train depots but this is a cool place to check out. The building is pretty neat and well preserved with interesting historical displays. The grounds out front are great for photos and the view looking towards the Capital with the foothills and Bogus in the background is top notch!",
  "This Depot is so interesting. So much information from the past that I could have stayed to listen to more. Won't be disappointed visiting here.",
  "My husband and I were looking for a way to start learning a little bit more about our new town.  This was a great way to enjoy a beautiful Fall day with each other and see a beautiful building, learn some history, and relax.  Although the grounds are not blooming with flowers, the gardens are still interesting with the water features and Koi fish in the pond.  Building history and architecture is interesting and amazing to see how building has been preserved.  Loved the old train outside and the view from the bell tower is amazing.  The bells themselves are great to get a peak at.  This was a hopping spot today with visitors of all ages.  Had a great time and especially enjoyed the tour guide and staff that were there to answer questions for us!",
  "We had a wonderful visit to this beautiful station. I believe that Sundays and Mondays you’re able to go up in the bell tower. We were able to see an even better view up there. Big Mike is on display for kids of all ages, and it was a fun place for photos. The koi pond is beautiful too. Great place for great views and to spend some time. "
 ]
},{
 "name": "Julia Davis Park",
 "address": "700 S. Capitol Boulevard",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/9a/bd/16/rose-garden.jpg",
 "tags": [
  "history",
  "art",
  "walk",
  "parks",
  "family",
  "history",
  "walking",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d555230-Reviews-Julia_Davis_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Chances are on your next visit to downtown Boise there will be some event going on in Julia Davis Park. Whether is is the staples of the Boise Art Museum, Idaho Historical Museum, Black History Museum, Boise Zoo or one of the many running races, Art in the Park, Walk Your Dog, Natural History Day, Concerts in the Park, sporting events including fishing or a walk through the Rose Garden. Julia Davis Parks offers something for everyone across the age spectrum. Take a picnic lunch because you are likely to spend some time wandering and taking in the the scenery. If that is not enough to attract your interest all you need to do is look across the Boise River and visit Boise State University.",
  "Really good place for the family or self.  Great location in the heart of the city.  Make sure to visit the zoo.  Well run and well kept. Big trees and lots of shade.  The amphitheater can host some really good events.  Check first to make sure it going to be your \"crowd\".",
  "We have been  to many downtown festivals here and its great- always plenty of room to park, watch out for the duck poop tho- there is a lot of it!  If your new to the area rent the paddle boats- they are great fun!",
  "Great place for a picnic with our 4 yr old granddaughter!  We met her BFF for a playdate!  Had a great time!",
  "Beautiful park, we came in October so the trees were changing colors. My boys even jumped in a pile of leaves",
  "I came here on a Sunday afternoon to enjoy the beauty and beautiful Boise weather.  The roses were gorgeous and smelled amazing.  The fountain waters were VERY blue.  The grass a lovely green.  The bronze statue of Abraham Lincoln across the street was inspiring.  The Black History Museum is not open on Sundays or Mondays so, I was disappointed to miss out on that.  The zoo is right next door.  This beautiful park has many benches to relax and sit and ponder life while enjoying the beauty of nature's bounty.",
  "We spent thirty minutes or so walking around. There is a pathway for walking and biking and lots of big trees. The rose garden was very nice.",
  "Roses in September were still in bloom.  Right next to the art museum; very well kept and clean, except for the geese poop.  Watch your step!"
 ]
},{
 "name": "Albertsons Stadium",
 "address": "1910 University Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/fe/73/b6/september-2015.jpg",
 "tags": [
  "family",
  "field",
  "walk",
  "food",
  "field",
  "cheap",
  "food",
  "unique",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559299-Reviews-Albertsons_Stadium-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I have been attending Boise State games since we were first married in 2000. Huge fans of collage football, we are proud of our hard working Broncos! The stadium has had a lot added to it over the years. Additional seating, nicer boxes and better athletic facilities. We have sat in several locations - student section,  upper bowl, lower level and end zone. We haven't exspirenced a bad seat yet! The blue iconic turf is beautiful! Our entire family enjoys going. Great activity for teenagers and families. Don't forget to visit the mini doughnut cart in the concession area and splurge on a dozen with an assortment of dips available! Yum!! ",
  "I'm a huge college football fan and I've seen this stadium on tv, well the tv does not do it justice. It's more impressive in person. The volunteers in the hall of fame center are very helpful and even took a few pictures for me.",
  "Our Boise friends are HUGE Boise Broncos fans. They graduated from Boise state and now have season tickets and an Alumni tailgating spot near the Alumni building near the stadium and so they invited us to the home game against Virginia. The game didn't turn out so good for the Broncos, they lost, but the experience was fun and the blue field is unlike any other we've ever seen. Didn't experience the stadium too much, as I didn't walk around it much but it had good food (my husband purchased) and I got in and out of the stadium safely. I'm so glad we gots to enjoy a game on the blue! ",
  "No one warned me before I traveled a long distance for the Potato Bowl, that Boise State's Albertsons Stadium was a dry stadium. During the pregame entertainments, the only place to get a beer was in the ESPN tent (WHICH WAS ENTERED BY INVITATION ONLY!). I felt cheated and will not be making the effort to travel there again.",
  "My husband and I attended the Famous Idaho Potato Bowl at Albertson’s Stadium.  It appeared that all of the usher-type folks were non-regular volunteers.  We didn’t get a single correct answer from anyone who worked there on where anything was located OR how to get anywhere.\n\nOddly, you cannot get around the entire stadium on the field level.  Our seats were in the Suite Level Boxes.  We parked in the main parking lot; went up stairs to level 1; up an elevator to level 2.  Walked 1/2 way around to the press box side.  But - the elevators don’t stop on level 2, so had to go back down stairs to level 1, OUTSIDE, back through security to get to the Suite Level elevator bank.  Craziest thing I’ve ever seen at any stadium anywhere!!!",
  "A bad facility to long-lines, terrible sight-lines, uncomfortable and small seats, Albertsons Stadium is a small college goofy assault on the senses. Everything is wrong about this place, from the gimmicky hurts your eyes blue turf, to the rinky-dink sound system, and long lines, and awful food. The stadium is an embarrassment to a great town and a decent university.  Why is it liked bv the locals?  Because the home-team usually wins.\n\nA plus, tickets are cheap compared to major Power Five college football.",
  "The BSU Broncos’ stadium has the blue turf and more. Stadium seating is excellent as the second level rises steeply. Bronco fans are loud and half the parking lot is filled with tailgating parties. College football 🏈  Go see a game and take some pictures for unique, lasting memories.",
  "The meeting we were attending arranged for us to go out on the field.  That was very cool.s  One of their past quarterbacks came out and threw passes to us.  What a treat."
 ]
},{
 "name": "Idaho Anne Frank Human Rights Memorial",
 "address": "777 S 8th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/d1/be/8f/idaho-anne-frank-human.jpg",
 "tags": [
  "library",
  "free",
  "library",
  "library",
  "nature",
  "history",
  "free",
  "walk",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d2249776-Reviews-Idaho_Anne_Frank_Human_Rights_Memorial-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is between the Boise Public Library and the Greenbelt.  It is not for small children as they usually want to play in the water, but for older children who can read, this is an excellent place in which to jump-start their awareness of the human condition and other cultures.  ",
  "Using the Greenbelt is requisite to any visit to Boise. The human rights memorial is along the greenbelt at the 9th street bridge. This is, in my opinion, downright impressive and provocative, I get chills whenever I read any of the many quotes. Definitely worth a visit, it's free, outdoors, by the river, next to the library and near the zoo. I love living in a town with big eyes and broad perspectives.",
  "The location of this place is pefect- next to the greenbelt, the library, BSU, Capitol st., and 8th st.  Check it out-- the quotes surrounding the memorial are very inspirational.",
  "There are better sites to visit.   It reflects an agenda that is out of place in the US.  Explore the beautiful nature of Idaho.",
  "This is a small park that has walls with quotes from Anne Frank’s diary mixed in with a large variety of quotations on the theme of human rights from different well-known people.  It is a peaceful spot.  There is a small parking lot next to it.  Allow at least 30 minutes, longer if you really want to read all the quotes.",
  "Amazing outdoor museum tucked away in Boise. The sculptures, and quotes and pictures were verey moving makes an impact and teaches us more about history",
  "This recently renovated memorial includes reminders of past atrocities and includes genocides from around the world. Also there is a stone carved list of human rights for all who walk the earth. I highly recommend this outdoor memorial which is free to all who would like to stop by.",
  "This was my second visit to the memorial and what a change from last year! The one section that was closed then was open this time, which included Anne Frank's attic room, an open area of the floor plan, including the staircase, in which she, family and friends, stayed for two years. An added bonus was being guided by a volunteer who presented historical information about Anne. One intriguing bit of info was about the tree that was outside Anne's window: Boise is one of nine places in the United States that received actual seeds of the original oak tree. Although the tree on display was not of that seed (the actual tree is being grown and becoming weather-hearty in a closed facility to be permanently planted at the memorial in the near future), it nonetheless gave me the impression of what Anne looked at from her attic window- th longing to ne a normal teenager and to run and play. The fall colors in the area added to nuance and the feeling of impact Anne's diary words left many of us in the world.\nA must-see!"
 ]
},{
 "name": "Lucky Peak State Park",
 "address": "74 Arrowrock Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/3f/f2/0e/water-level-at-it-s-lowest.jpg",
 "tags": [
  "kids",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559328-Reviews-Lucky_Peak_State_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a nice place to take kids for a day in the sun and water. Take an umbrella, there isn't any shade on the shoreline and it can get pretty hot here in the summer.",
  "City close but uncrowded experience awaits a fisherman or water ski enthusiast.  Weekends are not crowded and launches are easy during the season.  Love this place.",
  "This is a nice place to take kids for a day in the sun and water. Take an umbrella, there isn't any shade on the shoreline and it can get pretty hot here in the summer.",
  "So much to see and a variety of landscapes. Snow capped mountains, and deer. Many areas available to stop and take photos. Good roads. Picnic by the lake, with clean amenities.",
  "Lucky Peak has a fabulous swim park area that is a summer favorite for Boise locals. A huge fountain in one end below the dam brings joyous squeals of delight from children and is fun for young of heart of all ages on floaters. There are paddle boards for rental in summer and gratis life jackets to keep little ones safe. Park area is green and clean. Follow the road around above the dam and there is lots of water area for boating and fishing! We did that too!!! You may wish to bring plenty of snacks, as the marina store isn’t very big, but the owners are very nice.",
  "Beautiful drive on well maintained roads. Has many places to pull over for rest and views, water flows vary throughout the year.",
  "Water level was a lot lower than in previous years at this time, but great diving nonetheless. Visibility was ~10 feet. ",
  "Once in a lifetime opportunity to witness and participate in catch and release of songbirds and predatory birds along their migratory path. Free to those interested in the adventure."
 ]
},{
 "name": "Barber Park",
 "address": "4049 S Eckert Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/10/1c/6b/barber-park.jpg",
 "tags": [
  "free",
  "walk",
  "kids",
  "walking",
  "nature",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559282-Reviews-Barber_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "We can't even count how many times we have floated the Boise River. The starting point is always Barber Park. Usually we take vehicles that drop us off and then meet us at the pickup point in Ann Morrison Park. It takes several hours to float the River and it is very scenic and very refreshing on a hot summer day. Don't go to early or it is cold and the river is running to high. Wait until the water level drops and the temperatures get into the 90's and then you will have a great float. It is worth the time to do.",
  "This is the prime location to drop off your rafts, floats, paddleboards, or whatever else you want to enjoy on the Boise River. I wouldn't say it is really what most people would think of as a PARK moreso it serves its purpose for what it is intended for. It has bathrooms, plenty of rental equipment in case you forget something, usually a small shop that is open, and free air to inflate your toys. \n\nUnfortunately, this year has gone by the wayside a bit. With the massive influx of Californian parasites, it has become pretty overcrowded, and is almost unbearable on weekends. As a native Idahoan, I have never seen it this bad. They need to put in place a better system for parking so you don't pay $5 to go in to park only to discover there are no spots left. These days you'll have to park on the street at one of the nearby neighborhoods and walk. Not a poor reflection on the park by any means, definitely still five stars with what you get for free.",
  "Floating the river is a great Boise experience. No liquor allowed, but it's fun anyway. You can rent rafts here and there's a bus at the takeout point which will bring you back to Barber Park. Start about 10 and you'll be back at Barber Park by about 3pm.",
  "This is a great park if you like walking in nature and enjoying wildlife. There are open spaces for kids to run but no equipment to play on. Barber Park is much more about being outside and enjoying your surroundings than pushing the kids off to a playground. Lots of green belt and river access.",
  "On a very hot day, the 2-hour floating down the Boise River from Barber Park was the perfect thing to do.  Along with hundreds of other folks, including many partying students just back on campus.  The water was cold, but perfect for the hot day.  The shuttle back to Barber Park was easy and convenient.",
  "What a fun way to spend the afternoon meandering down the Boise River.  Rent the raft and you don't have to worry about doing anything but floating.  ",
  "Floated down the river for approximately 1 1/2 hours.  Brought drinks and snacks - don’t forget music.  Great scenery and ambiance. ",
  "I'm still new to the area and we were wondering when is the annual float the Boise River day.we are wanting to go."
 ]
},{
 "name": "Hyde Park",
 "address": "13th Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/a1/5d/7b/hyde-park.jpg",
 "tags": [
  "walking",
  "drink",
  "eat",
  "unique",
  "unique",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559323-Reviews-Hyde_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park hosts lots of events and very lovely as park. Easy access to camel back park. Parking is bit rough when events happen but worth it.",
  "This part of Boise is great for walking to restaurants and little shops. You see lots of people walking their dogs or pushing strollers. The places to eat or have a drink are nice, local places which is great.",
  "Spend an afteroon antique shopping and a few places around for lunch!",
  "Idaho still very much a developing Valley.  As many States has its uniqueness like the Potatoes farms and beautiful waterfalls worth visiting in the summer time.",
  "Quaint neighborhood with character. Homes are unique, many restored or in the process of being restored. Small ‘main street’ with an eclectic group of shops....coffee houses, gift shops, restaurants, toy shop, candy store. ",
  "The Hyde Park neighborhood is a unique a vibrant area of beautiful old homes and unique businesses and eateries. There is lots of atmosphere and plenty of sites to enjoy on a pleasant walk or bike ride around the area. ",
  "We really enjoyed walking and driving around the north end. Tree lined streets. Lots of people walking and riding bikes.  Great shops and restaurants as well.  I would love to live in this area if I could.",
  "Wouldn't have known this was here, except for the recommendation given by the host of our hotel accommodation!  Lots of little shops and restaurants and neat little neighborhood."
 ]
},{
 "name": "Idaho State Museum",
 "address": "610 Julia Davis Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/11/8b/9a/the-origins-gallery-in.jpg",
 "tags": [
  "kids",
  "history",
  "learn",
  "family",
  "free",
  "kids",
  "art",
  "kids",
  "history",
  "knowledgeable",
  "history",
  "learn",
  "family",
  "free",
  "kids",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d214899-Reviews-Idaho_State_Museum-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Well worth a stop. It is nicely upgraded. The kids section downstairs is also fun for \"big kids\". Exhibits are well done. ",
  "I attended an event at this venue.  I am so glad I had a chance to visit. It gave a great overview on the many elements of ID history - from the great fire of 1910 and resulting changes to Forest Management, to he Basque community, to the Native American community, to Potatoes to the important ski connection and more.  I found it fascinating and the docents very educated.  \nWe were lucky enough to experience traditional Basque dancers.  I would definitely recommend a visit!",
  "This is a wonderful place for both locals and visitors to venture in for a solid few hours of interesting and entertaining information about the state of Idaho. \n\nThis museum recently completed a very extensive renovation, so all of the exhibits and the building are very fresh and new.  The flow of things is very easy to follow and there is plenty of room for numerous patrons to be in the same space at the same time. \n\nSo much to learn about Idaho: Native Americans, Mountains, Forests, Rivers, Lakes, Wildlife, Agriculture, Early Settlers, Industry . . . you name it! There are lots of fun interactive components sprinkled throughout that are fun for both young and old to participate with. I have been twice now, and still feel like I probably haven't looked at every single thing there is there. \n\nThey do have two rooms that house rotating exhibits, so every few months there is always something brand new to see. On the lower level they also have a play area for children, which my boys look forward to each time we come. \n\nI'd give yourself a minimum of 2 hours to feel like you covered a decent majority. There is free street parking located within the area, but it is shared with various other attractions (Boise Art Museum, Zoo Boise, Rose Garden, Julia Davis Park) so dependent on the time you choose to visit, parking could require a bit of patience. \n\nAdmission pricing varies based on age, military status, etc. so check their website for current listings. For a family of 4 (one adult, one veteran, and 2 kids) it ran us around $30.\n\nThey do have a small gift shop which offers local artistry fares and other commercially found wares. Pricing is typical for a small museum gift shop, meaning it's not going to be a bargain.",
  "Come here early enough in the day to make sure you're not rushed in the end.  We were there a couple hours but ran out of time when they kicked us out at closing.",
  "This is such a fun museum with tons of interesting facts about Idaho's past from pre-statehood to the modern day.  This is also a great and inexpensive way to teach kids about history; and should be a must-see for everyone who calls themselves an Idahoan.  Enjoy!",
  "Great place with professional, knowledgeable, and friendly staff. The museum is not expensive to get in. It will take a few hours to ensure you see everything. I recommend a membership for it may take more than one visit. I have went multiple times and loved it. Great for for everyone including children.",
  "What a great museum! Very impressed with all the interactive exhibits. My only complaint is the two hour parking, I could have spend a lot more time here!",
  "After closing for the multi-year renovation, the new Idaho State Museum is a huge improvement on its dated predecessor. The exhibits better tell the story of the history of the Gem State and should be a must see for anyone traveling through Boise - or residents who haven't visited in a while.",
  "This is a wonderful place for both locals and visitors to venture in for a solid few hours of interesting and entertaining information about the state of Idaho. \n\nThis museum recently completed a very extensive renovation, so all of the exhibits and the building are very fresh and new.  The flow of things is very easy to follow and there is plenty of room for numerous patrons to be in the same space at the same time. \n\nSo much to learn about Idaho: Native Americans, Mountains, Forests, Rivers, Lakes, Wildlife, Agriculture, Early Settlers, Industry . . . you name it! There are lots of fun interactive components sprinkled throughout that are fun for both young and old to participate with. I have been twice now, and still feel like I probably haven't looked at every single thing there is there. \n\nThey do have two rooms that house rotating exhibits, so every few months there is always something brand new to see. On the lower level they also have a play area for children, which my boys look forward to each time we come. \n\nI'd give yourself a minimum of 2 hours to feel like you covered a decent majority. There is free street parking located within the area, but it is shared with various other attractions (Boise Art Museum, Zoo Boise, Rose Garden, Julia Davis Park) so dependent on the time you choose to visit, parking could require a bit of patience. \n\nAdmission pricing varies based on age, military status, etc. so check their website for current listings. For a family of 4 (one adult, one veteran, and 2 kids) it ran us around $30.\n\nThey do have a small gift shop which offers local artistry fares and other commercially found wares. Pricing is typical for a small museum gift shop, meaning it's not going to be a bargain.",
  "When we have tried to visit this museum in the recent past few years, it has been under renovation. However, today we managed to gain entrance. The wait was well worth the while! \nWe have travelled widely, and this was without doubt one of the best museums we have ever visited!\nTelling the story of Idaho, it uses interactive exhibits, videos, and extensive informative galleries. Always, educational and informative, it still remains attractive and entertaining.\nAdults and children alike will adore this place!",
  "I gave myself an 1-1/2 - needed much more time.  At a minimum two hours.  \n\nGreat information about the history of the land, the people.  \n\nI found it educational, learning about the history of the state, the people, the landmarks.  \n\nWonderful museum.  \n\nThe exhibits were informative and there were lots of interactive displays.  \n\nI never knew there was so much history, innovation in Idaho. \n\nGlad I went to this museum and would put it on the Must-See list for visitors."
 ]
},{
 "name": "Morrison-Knudsen Nature Center",
 "address": "600 S Walnut St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/f7/c4/20/morrison-knudsen-nature.jpg",
 "tags": [
  "nature",
  "music",
  "walk",
  "nature",
  "walk",
  "walking",
  "kids",
  "learn",
  "walking",
  "nature",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558612-Reviews-Morrison_Knudsen_Nature_Center-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "From grandparents to grandchildren, and everyone in-between, the Morrison-Knudsen Nature Center is FUN for everyone in the group. Wear comfortable shoes and bring your camera because there is a lot to see!",
  "It is't a big park, except in experiences you will have.  Get eye-to-eye with trout.  See if the porcupine has taken over the Canada goose' nesting box.  And keep an open eye for the fox.  If it's spring, don't alarm the deer--there may be a fawn close.   It's the most amazing few acres you will ever have the pleasure to walk around.  Birds and butterflys, all to the music of the Boise River.  You have got to visit. ",
  "This is an easy-access nature walk.  If you want to view birds, go early (Very early!) in the morning.  For an informational nature walk with all kinds of surprises around every corner, this is what you want.  I got excited when I found petroglyphs with my grandson!  This is good for young and old.",
  "We enjoyed walking the loop trail and looking at the exhibits.  This would be a great place to bring children too.  We especially liked the replica eagle’s nest that lets you see how large their nests really are, and the pond with ducks and large sturgeon.  There is some very nice artwork along the trail:  mosaics, murals, etc.  The visitor center was closed for renovation so we did not get to go inside.  Allow yourself at least 45 minutes to an hour.",
  "This place is great.  What a well planned out environment in the middle of a city.  Kids would love it, fun & learning about things kids love to learn about.  We're senior citizens and thought it awesome.  Then, you just jet out the back onto the greenbelt for a brisk morning jaunt.  We were there 9:00 am in December, yes, brisk:)",
  "This is a must visit place when visiting Boise. Me and wifey both had fun, loved how they preserved nature. Enjoyed the river, birds, fish and little water fall along with walking trails.  This place is suitable for all age groups.  Highly recommended. ",
  "We happened to be at the park and discovered the nature center nearby. People of all ages will find the diverse nature trails interesting and enjoyable.",
  "We took young teens and children and they all loved exploring the pathways and the visitor center.  You can easily adapt this to a 30 minute walk as part of exploring the green belt or 90 minutes taking in the visitor center and taking your time through the pathways."
 ]
},{
 "name": "Ann Morrison Park",
 "address": "1000 S Americana Blvd near Capitol and Americana boulevards",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0e/fc/91/ann-morrison-park.jpg",
 "tags": [
  "walk",
  "kids",
  "walk",
  "family",
  "walk",
  "walk",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d559263-Reviews-Ann_Morrison_Park-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is our 2nd trip to this park and it is always a pleasure to walk the paths around it. We have seen so many species of birds including the American Bald Eagle! It's a great place to take your dog for a walk as well, but make sure they are on a leash :-) Also - watch your step for geese poop. That's the only thing \"bad\" about it. Lots of geese in the area.",
  "This park has great views, and we walked around the park. It wasn't crowded and because it's a huge park, there are plenty of places to be. Places for kids to play, lots of space for picnics, or you could just grab a coffee and enjoy the greenbelt. ",
  "This place is perfect for all you sports buff. It's right next to the green belt, so you can bike or walk, there are several soccer/baseball fields, and even a place where you can do muscle training using your body weight. You can even picnic by the river",
  "Walk, ride bike, family picinic, dog park, all age playground, all sorts of great outdoor activities. Wonderful, easy to access park.",
  "I finally had a chance to visit with an old friend who moved to Idaho several years ago.  The park was one of the places that we visited and had a wonderful walk along the river.  Close to the zoo, museums and art galleries.  A wonderful place to send an afternoon.",
  "Parking can be rather confusing, but I highly suggest visiting this park for the Boise Balloon Classic. This park is huge, clean, has fountains, and makes room for plenty of balloons to look at. If you have never been you should!",
  "The park is beautiful! It's peaceful, clean, has plenty of open grass for picnics, comfortable picnic tables and benches,  lots of parking space and an absolutely delightful playground. The centerpiece is a fountain that is the largest I've seen anywhere. The day I visited it was 102 degrees (zero humidity) and the spray from the fountain was refreshing. The public restrooms were spotless!",
  "Regardless of the season Ann Morrison Park is worth the visit. From wildlife to beautiful flowers this park is a local favorite for graduation, wedding and family photos. Once you arrive the park entrance is only accessible by foot making it a quiet escape from the bustling traffic. If you go in the spring you are guaranteed to see newborn waterfowl. The fall season is bursting with color from the variety of trees. During any season you are also likely to see deer. Several ponds and landscaping add to this beautiful setting. Another bonus is the abundance of shade offer places to picnic or just sit and relax enjoying the surroundings. The park is also wheelchair accessible with concrete walkways and wide paths. Dogs not encouraged due to wildlife, but leashes are required."
 ]
},{
 "name": "Zoo Boise",
 "address": "355 E Julia Davis Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/c0/59/dc/zoo-boise.jpg",
 "tags": [
  "walk",
  "learn",
  "walking",
  "history",
  "food",
  "free",
  "art",
  "knowledgeable",
  "food",
  "free",
  "kids",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558603-Reviews-Zoo_Boise-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This zoo is always a hoot! My esteemed spouse And I spent the loveliest afternoon there. It’s a small zoo, a pocket zoo if you will, but it has a little bit of everything for everyone! The animals were out and about and also were enjoying a lovely spring day. It’s easy to walk, has interesting and informative plaques, the animals are easy to see... plan your afternoon adventure today!",
  "As the only zoo for a thousand miles or so, Boise zoo is home to many children in the State of Idaho and and other states near by.  I love taking my grandsons here so they can run wild and learn more about our endangered animals. Boise Zoo has expanded its complex and has made it really enjoyable for a small state. ",
  "My two young sons never get tired of this place! It is in the perfect location and the new remodel makes it a smooth transition through the exhibits!",
  "Located in the heart of downtown Boise within Julia Davis Park within walking distance to Boise Art Museum, Idaho Black History Museum, and Discovery Center of Idaho. Parking is within the Julia Davis park and is limited to 2-hours between 8am-5pm (M-F). You can extend this time if you have a receipt from the Zoo (they will issue a parking pass).\nZoo is open from 10am-5pm (Sept-May) or 9am-5pm (June-Aug). Thursday is discount admission day (Nov-Feb) on which admission is half price ($4.25 12-61yrs, $3 3-11yrs, 2-under free). From what we observed, all of the food shops are closed on discount Thurs. Some areas that looked like would normally be staffed were also vacant. The merry-go-round was also not running. \nHas a good variety of animals including but not limited to lions, tiger, sloth, anteater, leopards, monkeys, capybara, zebras, rhea, tortoise, wolf, hyena, porcupine, ocelot, gibbon, lemurs, cranes, and my personal favorite giraffe. On Thurs, we spent roughly 2 hours at the park seeing all of the animals and going back to some for better photos. Traffic was very light on Thurs both driving to the park, within the park, and within the Zoo. Would return again on discount Thurs for the savings alone. Overall great experience and neat opportunity to have such a variety of animals here in the Pacific-Northwest.",
  "I really do love a good Zoo. It's probably one of the most common go-to activities I search out whenever we explore a new area. Followed closely by Aquariums. \n\nThe very first trip we made to Boise, I had heard there was a zoo, but had not searched out the actual location. So imagine my surprise when taking a walk through Julia Davis Park and spying a giraffe. My husband thought I was crazy when I exclaimed \"Look at Giraffe!\" \n\nSince that initial sighting, we have since moved to the area and frequent the zoo on average about 4 times a year.  The facility is always so clean and well maintained. The staff are friendly and knowledgeable about the animals and the variety of animals to view is fairly impressive considering the zoo is a smaller outfit in comparison to the well known ones around the US. \n\nRecently Zoo Boise completed a pretty extensive renovation and addition, which is really nice. They now have an outdoor amphitheater area which my church has already used for a private event and loved. And they also added new animal exhibits including an alligator which my kids just loved. \n\nWhat I love most about this Zoo is that it is easy to tour within a few hours, but you don't feel like well that was it? It's a nice size if you are toting around small kids or elderly patrons that would never be able to last through something massive like the San Diego Zoo.\n\nThere are food options available, if you choose to grab lunch while visiting. As well as multiple snacky options. They offer strollers to rent for the littles, if you need it. They have a small play area that kids of ages are entertained by. \n\nDuring the summer months they add on the addition of the butterfly exhibit, which is always such a treat.  And a wallaby walk, which lets face it who wouldn't want to get near a wallaby? So cute!\n\nOverall they have most of the usual suspects. The only major players I can think of that are missing are elephants, hippos, panda bear, and I'm guessing part of the reason for this is space constraints. My personal favs?  The giraffes and the anteater (which just recently had a baby. Adorable!)\n\nThe Zoo is open year round, which is kind of surprising since we do get a bit chilly in winter. The animals do have warm comfy shelters they can retreat into. The best time to visit is spring and fall when the weather isn't super hot OR first thing in the morning when it is. If you show up in the middle of a hot day, chances are most will be sleeping. \n\nParking is free and available all around the Zoo within Julia Davis Park. I've never had trouble finding a spot, but during peak hours you  might have to park farther out than usual. \n\nThey also offer a Zoo Membership, which is a great deal if you are a local. It allows you the opportunity to pop in with your kiddos for an hour here and there and not feel bad if you leave without seeing everything."
 ]
},{
 "name": "Boise Art Glass",
 "address": "1124 W Front St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/04/d6/6c/boise-art-glass.jpg",
 "tags": [
  "family",
  "creative",
  "family",
  "art",
  "unique",
  "art",
  "art",
  "unique",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d3228526-Reviews-Boise_Art_Glass-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "A group of nine of us took a class and made our own blown glass ornaments on a recent Saturday morning.  The instructor was kind, patient, and just an excellent teacher.    We each picked the colors we wanted, and with help and instruction were very successful in each making a beautiful ornament (one made a paperweight, which also turned out beautifully).  It was a fun experience, well worth the expense of $25.  All of us would do it again, and plan to!  Just doing it was great, and the bonus was seeing how differently they each turned out.  This would be a fun thing for any group of friends or family to do.",
  "My husband bought us a session for Christmas present.  We had so much fun and the instructor was wonderful!  We now own some really beautiful pieces of blown glass. We would highly recommend doing one of their classes!",
  "Kevin was a great instructor! Shouldn’t have waited so long to try glass blowing, wow what a fun creative outlet. Be sure to give yourself time to pick up your finished piece the next day.",
  "A group of nine of us took a class and made our own blown glass ornaments on a recent Saturday morning.  The instructor was kind, patient, and just an excellent teacher.    We each picked the colors we wanted, and with help and instruction were very successful in each making a beautiful ornament (one made a paperweight, which also turned out beautifully).  It was a fun experience, well worth the expense of $25.  All of us would do it again, and plan to!  Just doing it was great, and the bonus was seeing how differently they each turned out.  This would be a fun thing for any group of friends or family to do.",
  "We had heard about this place and wanted to simply stop by and get information on some of the classes.  We ended up hanging out for about an hour and even buying a handmade glass Christmas ornament. \nThey have a great location downtown with metered parking all around the block. \nInside the main entrance is both a viewing area and a glassblowing studio complete with furnaces and torch benches. There was a class going on at the furnace area and some artists working on designs at the bench. \nFurther inside, to the far right, is a very nice glass art store, with lots of different handblown pieces. We were surprised at the prices....nice stuff for excellent prices. \nWe are going back to take a class and will more than likely purchase more glass as gifts.",
  "Boise Art Glass was located near our hotel. It was an interesting studio with a lot of unique glass artwork. While we were there, there was a glass blowing demonstration which was fun to watch. Unless you are shopping for glass, it’s not worth a special trip, but it’s interesting if you’re already nearby. ",
  "Bought an amazing glass blown skull an Horns art figure. It is a great conversation peace. \nIt took about 6 months so be patient!!",
  "Really unique place of gorgeous art items of various sizes and prices! Bought some beautiful pieces and watched them making new ones. Promise that this is the place to purchase something original to take home with you!"
 ]
},{
 "name": "Ridge to River Trail System",
 "address": "1104 W Royal Blvd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/c0/9b/7e/ridge-to-river-trail.jpg",
 "tags": [
  "walk",
  "walk",
  "unique",
  "free",
  "nature",
  "walk",
  "family",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558593-Reviews-Ridge_to_River_Trail_System-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "We live out of town and were just visiting for a day. Doing some exploring and looking for a good vantage point in order to take some photos. \nWe found Table Rock by accident but are very glad that we did. The view is tremendous and inspiring.  There is a cross at the top, which I'm told light up at night, along with some radio/cell? antennae. \nAbout 20 people were also up there on an afternoon and only 4 cars. Then we saw the trail up, with more hikers going in both directions.  Wow! \nNext time we will walk in from downtown and get some exercise.  \nGo if you can. \n\n",
  "You can literally walk from the lowest point in the valley to the highest point on this trail system!  The trails are well maintained, and you always feel safe from other humans, though you might run into a shy animal once in a while...",
  "This is a unique opportunity to have a 200 mile trail system this close to a large city. The trail system spans from the sage brush high desert up to pine forest and has something for everyone. Great hiking, running and mountain biking trails and most do not allow motorized vehicles. Most allow your dog to be off leash as long as you keep them within 30 feet.\n The system is well marked and there on line maps as well as paper maps available. You can get the paper maps at most bike shops, running shops and sporting good stores.\n Early mornings and late afternoons are your best bet to see wildlife.",
  "we started the river trail from our downtown hotel from the Julia Davis park.\nIt is a great trail to walk bike or run, and extends all the way to the boise foothills just after the local golf club.\nwith plenty of things to see, we used the trail to visit the local swimming pool but found numberous different activities to do.\nthere was river rafting, a nature park with a 6 foot sturgeon fish in ,a zoo,and shool sponsored gardens, also a beer garden resturant, and a golf club\nthe trail has really nice sidewalksand beauiful scenery.\nWell worth a visit and it is a public area so it is free to visit..",
  "My family loves to hike and mountain bike the hundreds of miles that make up the Ridge to River Trail System. One of the great quality of life benefits of living in the Boise area is our trail system. You will see different zones of topography from desert to tree-lined at higher elevation. It doesn't matter if you are a casual hiker/biker or want something more intense, you will find a perfect trail for you. Check out the detailed map on the Ridge to River Trail System website to find your pathway to outdoor fun!"
 ]
},{
 "name": "Basque Museum & Cultural Center",
 "address": "611 W Grove St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/cc/0b/da/motivo-de-orgullo-en.jpg",
 "tags": [
  "delicious",
  "history",
  "history",
  "tour",
  "tour",
  "food",
  "history",
  "creative",
  "delicious",
  "history",
  "unique",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d269524-Reviews-Basque_Museum_Cultural_Center-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "After visiting the museum and learning about the history and rich culture of the Basques in Idaho, check out the boarding house next to the museum. I hope you get to see the 3D photos--so cool! Go to the restaurant across the street for delicious paella too.",
  "It is a fantastic place in the Basque block, in the heart of the city, to know better the history of the Basques both in their homeland in SW Europe and in America",
  "The large Basque population in Boise has lent itself to several good restaurants and this neat little museum. It’s very inexpensive to tour, plus the have an awesome gift shop with Basque-themed items! Very cool place if you’re tired of the same old stuff!",
  "This facility was open as advertised but it is a limited experience without a guide.  We imagine that it is a much richer experience on the weekends or when there are cultural events taking place.  \n\nThere are clearly printed legend, artifacts, photos and a video.  Nicely done but limited.  We were unable to enter the boarding house.\n\nBe sure to check the calendar of events to have a full experience.",
  "The large Basque population in Boise has lent itself to several good restaurants and this neat little museum. It’s very inexpensive to tour, plus the have an awesome gift shop with Basque-themed items! Very cool place if you’re tired of the same old stuff!",
  "The Boise area has one of the largest concentration of Basques outside of Spain.  The Museum, I believe the first in the US dedicated to Basque heritage, is a first class museum that explains how the Basques came to Idaho and what they did.  One gallery has old photographs of immigrants that settled in Idaho.  There is a full size sheepherder's wagon and adjoining tent, a display dedicated to dancing and another one to Basque boarding houses around the western US.  Next door is the Uberuaga home which was a Basque boarding house refurnished as it might have been in the early 20th Century.  This is a great place to take friends from out of town.  Located in the Basque Block, there some very good restaurants that serve Basque food as well as American food in this block.  The Museum has a very good gift shop as well.",
  "This museum provides a nice narrative on the history of Basque in Idaho, as well as a history of Basque in general.\n\nInformative and creative presentation of Basque women in Idaho.  I found the most educational part reading about why the women left the Basque land for America.",
  "A slice of Europe right in the heart of Boise! Check out the local Basque restaurants, stores, museums, and historical architecture.",
  "After visiting the museum and learning about the history and rich culture of the Basques in Idaho, check out the boarding house next to the museum. I hope you get to see the 3D photos--so cool! Go to the restaurant across the street for delicious paella too.",
  "This was the highlight of my visit to Boise.  The museum looks small, but is packed with exhibits and videos giving a really good insight into this unique culture.  It covers the Basque country in Spain, including the struggle of the people to maintain their distinctive language and culture during the Franco times.  It also focuses on their migration to Idaho.  Exhibits also spotlight individual members of the Idahoan Basque community who have made significant contributions, from war heroes to community leaders.  It is a surprising, but remarkable, discovery here in Idaho.  A great place for people wanting to know more about the Basque.",
  "Visited the museum.  Wonderful displays.  Took a guided tour of the old house.  We recommend this place to visit."
 ]
},{
 "name": "St. John's Cathedral",
 "address": "775 N 8th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/55/9b/77/st-john-s-cathedral-boise.jpg",
 "tags": [
  "unique",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d558571-Reviews-St_John_s_Cathedral-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "the cathedral atmosphere when you arrive,  the stain glass windows and the old fashioned smell of incense it all puts you in a angelic state of mind.",
  "Nice cathedral in the heart of town.  Easy parking in the provided lot.  I was about 25 early to make sure.   I always love to go to mass at a classic cathedral.   Today was saturycigil mass at 1700.",
  "Beautiful Architecture inside & out, Cathedral has unique heating system, Geothermal from nearby mountain range.  Lovely glass stained windows, very calming atmosphere",
  "This is our favorite place to celebrate midnight mass. The music is so moving and the Bishop always give a wonderful homily. \n",
  "We attended a Christmas Concert here. It is a beautiful church with impressive stained glass windows. Organ is impressive and the sound quality of the building is very nice. I wouldn't call it a tourist attraction since it is a functioning Catholic Church but it will definitely worth your time to attend one of it's many community musical functions."
 ]
},{
 "name": "Boise State University",
 "address": "1910 W University Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/58/5e/0b/central-quad-at-boise.jpg",
 "tags": [
  "field",
  "walking",
  "walking",
  "art",
  "hike",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d144728-Reviews-Boise_State_University-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "We are lucky to have Boise State University as a centerpiece for our Boise community. It not only offers a great education for traditional and nontraditional students, it also offers a venue for watching sporting events and concerts. Look for great public programs offered on campus all year long. ",
  "We are from Southern CA and my youngest son decided he wanted to go the the school with the Blue Field. And I have to say, it was the best decision he ever made! You feel the school spirit all around you. The staff is attentive and full of ideas and so very helpful! My son changed his major 3 times and was still able to graduate in 4 years - which would not have happened if he stayed at an impacted CA school. The last four years have been amazing both for my son and for me! I highly recommend this school to everyone!",
  "Graduation brought us to Boise State University.  We visited many of the buildings at the university including the Student Union, Honors, Engineering, Alumni and friends, and the Taco Bell Arena.  ",
  "Nestled along the Boise River this campus is one of the most beautiful you will find. It is within walking distance of many hotels and downtown. The Boise Zoo is just across the river. Make sure you visit the famous Blue Turf of Albersons Stadium while on campus!",
  "Walking through a student union always brings back fun memories of college in a different state!  We went to see an exhibit of a friend’s beautiful fabric art pieces.  The second floor has a nice area to display large pieces with room to roam between the walls to contemplate the artist’s vision.  A small station held a book for comments and a paper describing the artist’s code for the location of her artist residence.  Since we were there on the afternoon of our friend’s reception, a table of appetizers encouraged the viewers to linger and contemplate for a few more minutes.  Artist, Lisa, was on hand to answer queries about her stitching techniques, the landscapes, and her choice of hand-dyed fabrics.  We came away enthused to resume our own fabric art endeavors and thought about bowling a few lanes as we left the building.  The Lincoln car park across the street made easy access for us ($2.50/hour).",
  "This city is absolutely beautiful! The campus is so nice, however, the football turf is BLUE! I had never been to Boise before and I could move there in a heartbeat. There are so many things to do, great restaurants and you could hike the foothills for days! The weather is so nice compared to the midwest. Very little snow that basically melts in a day. Definitely will go back to the Boise area again and bring my hiking boots!",
  "There were good things about the 2020 Potato Bowl, but I wish someone would have warned me about the dry stadium and every other announcement proclaiming the word \"famous\" before I traveled all the way over there. Who ever heard of not being able to get a beer during a football game (unless it is high school)? The marketing people need to come up with another slogan than \"famous\".  Just because you call it something doesn't mean that it actually is. I won't make the effort to travel there again.",
  "Great campus; compact and easy to get around. Smartly designed, where most everything is within easy walking distance. Ample parking is available in different lots/garages. "
 ]
},{
 "name": "Snake River Birds of Prey National Conservation Area",
 "address": "Snake River Canyon",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/1d/21/d7/swan-falls-dam-snake.jpg",
 "tags": [
  "walking",
  "free",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d107662-Reviews-Snake_River_Birds_of_Prey_National_Conservation_Area-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went out to look for raptors and saw red tailed hawks.swainsons hawk and many ravens and kestrals. It is a ways out but worth the drive just to see the canyon carved by the river and time. Old dam has a museum but we had our dog so didn't go in",
  "We were on a two week vacation to see and experience Idaho. Our first stop was Boise, the state capital and museums, all located within walking distance.  There is a certain quality of the life in Idaho that one must experience including the Birds of Prey National Conservation Center.  The center expanded with the generous endowment by a culture that treasures the life of falconry.  I won't write who this person is but by his gift, he has contributed toward my understanding that all cultures come together when there is a common bond.  The center treasures are in the form of live birds of prey and they are most serious of those birds that are near extinction.\n",
  "The official name is Morley Nelson Snake River Birds of Prey National Conservation Area.  They say you can do the 62 mile loop in one day but you wouldn't be spending quality time at all the points of interest.  We worked our way down to Swan Falls then stopped at Dedication Point before returning to Boise.  What a view of Snake River Canyon.  We saw a pair of falcons.  We did Celebration Park a few days later when we were staying in Grand View Idaho.",
  "There is no place like it in the world. Even if you're not into birds, the scenery is worth the trip.",
  "It seems to take forever to get from downtown Boise out to the canyon, but just think how long it was in wagon times!  This is a great way to get a feel for this Oregon Trail country and see where the wildlife truly hangs.  ",
  "The drive is long, but nice when you want to get out of town. On the way to Dedication Point is Initial Point, the first surveyor's point in Idaho. It's to the left, just a small hill, but still has lovely views. Continuing on the road you will reach the dedication point with outhouses and a pull-out and nice picnic benches on the trail. The canyon views of the dam and Snake River are picturesque at all times. Following the road down to the dam and gravel roads leads to more views, warm summer swimming and great fishing! ",
  "Confusing trying to find the actual place, ended up down by the dam which was interesting. We were early in the season, not many raptors out there except one beautiful pair of Prairie Falcons practicing their aerial acrobatics. Plenty of entertaining ravens and wide views over the Snake River. Then on the way back to 84 we saw a huge Golden Eagle sitting on a telephone pole. She obligingly flew away so we could see her massive wings!",
  "I thought there would have been more about raptors, but instead learned about hydro-power.  The great flood and petrified watermelons were interesting surprises.",
  "We went out to look for raptors and saw red tailed hawks.swainsons hawk and many ravens and kestrals. It is a ways out but worth the drive just to see the canyon carved by the river and time. Old dam has a museum but we had our dog so didn't go in",
  "The views are beautiful. Did about 2 miles of hiking and was good. Watch out for snakes though. Looks like a great place to fish as well. We toured the old dam. It was very cool. Everything is free which is the best part. ",
  "We were on a two week vacation to see and experience Idaho. Our first stop was Boise, the state capital and museums, all located within walking distance.  There is a certain quality of the life in Idaho that one must experience including the Birds of Prey National Conservation Center.  The center expanded with the generous endowment by a culture that treasures the life of falconry.  I won't write who this person is but by his gift, he has contributed toward my understanding that all cultures come together when there is a common bond.  The center treasures are in the form of live birds of prey and they are most serious of those birds that are near extinction.\n"
 ]
},{
 "name": "Discovery Center of Idaho",
 "address": "131 W Myrtle St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/b8/2d/a4/dci-logo.jpg",
 "tags": [
  "family",
  "learn",
  "kids",
  "free",
  "kids",
  "free",
  "kids",
  "family",
  "learn",
  "kids",
  "kids",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d269861-Reviews-Discovery_Center_of_Idaho-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is an interactive learning center, much more than a children's museum.  The attractions and activities change often, making this a fun place to return again and again all year round.",
  "Our family had so much fun here. We never knew that it existed when we lived in Idaho and swung by on our way back from Canada and the northwest US. There are so many interactive exhibits. My family loved the virtual reality sand where you can terriform mountains and lakes. Thank you so much for a wonderful time and science experiments to learn more about the world around us!",
  "My 7 and 4 year olds love the rotating features, the hands-on learning, and the classes offered. The staff here is super kid-friendly and helpful.",
  "The Discovery Center has lots of hands-on science and technology exhibits. There's not a whole lot of atmosphere - the general feeling is of a converted warehouse - but none of the kids ever seem to mind. Little kids can have fun here (there's even a dedicated exploration/play area for littles) but it's a better experience if the kids are school-aged. If they are tall enough to see the exhibits and are able to read at least some of the instruction it makes for a much better experience for all. If you have an annual membership to your local science center you may be eligible for free or discounted entry through a reciprocal program, so check before you head out. The best time to go is during one of the special exhibits; if you go in between the exhibits it's less crowded but there's less to see and do. When we visited this time one traveling exhibit had just wrapped up and set up was just starting for the next, so there was a lot of empty space. What was available was fun, but there were a lot of exhibits that were either broken, unavailable, or looking a little worn. It didn't stop the kids from having fun, but it was a little disappointing to have to tell them that certain things weren't available. Make sure to stop in the entryway and watch the Foucault Pendulum, then spend some time in the first activity room before moving on to the exhibits. We had a lot of fun with the giant bubbles, relics of a huge bubble-themed exhibit several summers ago, and the air cannon (you get to construct a tower of foam bricks and then try to knock it down with the cannon). The paper airplane station (complete with launcher) was a little challenging for my 6 and 8 year olds, but older kids (and adults) had plenty of fun with it. This isn't an enormous, all-day science center, but it's a fun, educational way to spend a few hours with kids. If you're looking to extend the family-friendly outing, cross the bridge out the back and head over to the park. Zoo Boise is nearby, as are two museums, a rose garden, plenty of park activities, and sometimes (in the right seasons) pedal boats on the pond.",
  "The Discovery Center has lots of hands-on science and technology exhibits. There's not a whole lot of atmosphere - the general feeling is of a converted warehouse - but none of the kids ever seem to mind. Little kids can have fun here (there's even a dedicated exploration/play area for littles) but it's a better experience if the kids are school-aged. If they are tall enough to see the exhibits and are able to read at least some of the instruction it makes for a much better experience for all. If you have an annual membership to your local science center you may be eligible for free or discounted entry through a reciprocal program, so check before you head out. The best time to go is during one of the special exhibits; if you go in between the exhibits it's less crowded but there's less to see and do. When we visited this time one traveling exhibit had just wrapped up and set up was just starting for the next, so there was a lot of empty space. What was available was fun, but there were a lot of exhibits that were either broken, unavailable, or looking a little worn. It didn't stop the kids from having fun, but it was a little disappointing to have to tell them that certain things weren't available. Make sure to stop in the entryway and watch the Foucault Pendulum, then spend some time in the first activity room before moving on to the exhibits. We had a lot of fun with the giant bubbles, relics of a huge bubble-themed exhibit several summers ago, and the air cannon (you get to construct a tower of foam bricks and then try to knock it down with the cannon). The paper airplane station (complete with launcher) was a little challenging for my 6 and 8 year olds, but older kids (and adults) had plenty of fun with it. This isn't an enormous, all-day science center, but it's a fun, educational way to spend a few hours with kids. If you're looking to extend the family-friendly outing, cross the bridge out the back and head over to the park. Zoo Boise is nearby, as are two museums, a rose garden, plenty of park activities, and sometimes (in the right seasons) pedal boats on the pond.",
  "Wonderful place for kids to do hands-on science experiments and learn about the how and why. Some exhibits are permanent but others, like Sue the Tyrannosaurus, are on display for a limited time and change to keep it different. They even have a special activity area for very young children. A yearly family pass pays for itself in only 2-3 visits.  We knew it was a winner when, after our visit, our grandchildren immediately asked when they could go back!",
  "We brought 4 granddaughters under the be of 6.  It wsn’t crowded despite it being summer. The exhibits were age appropriate and a lot of hands on places.  The big win was the LEGO exhibit.   We got the grandparent membership and was able to go again a few days later.  The one thing I did  see are the larger children in the small kids play area.  I didn’t appreciate that these older children almost knocking down the toddlers as they ran around.  ",
  "Our children (ages 8 and 11) enjoyed all the hands on exhibits. One of the favorites was a chair that you sit in, then raise yourself, then let yourself down with a bike tire slowing your descent. They also loved blowing HUGE bubbles. There was a show with electricity, flying saucers and \"popcorn.\" They don't have a schedule for the shows, but added it because we asked about the paper helicopter making that was advertised for the Saturday we visited, but was actually a typo and that had ended on Friday. :(\nThere are two large rooms with multiple hands on displays. There is a separate area for toddlers and preschool age children. There was also a Bricks Lego event, but it cost an extra $6 per person, so we didn't visit that. We spent about three hours here.  ",
  "We took our great grandchildren, a boy 7 and a girl 5, and all had a lot of fun - and even learned some things. The kids tried out all the displays - Conrad had a lot of fun with the paper airplanes, his sister with the \"drawing machine\"; the photography booth also was great fun. We spent about 2 hrs there on our last day in Boise; the time flew!",
  "This is an interactive learning center, much more than a children's museum.  The attractions and activities change often, making this a fun place to return again and again all year round.",
  "The Discovery Center has lots of hands-on science and technology exhibits. There's not a whole lot of atmosphere - the general feeling is of a converted warehouse - but none of the kids ever seem to mind. Little kids can have fun here (there's even a dedicated exploration/play area for littles) but it's a better experience if the kids are school-aged. If they are tall enough to see the exhibits and are able to read at least some of the instruction it makes for a much better experience for all. If you have an annual membership to your local science center you may be eligible for free or discounted entry through a reciprocal program, so check before you head out. The best time to go is during one of the special exhibits; if you go in between the exhibits it's less crowded but there's less to see and do. When we visited this time one traveling exhibit had just wrapped up and set up was just starting for the next, so there was a lot of empty space. What was available was fun, but there were a lot of exhibits that were either broken, unavailable, or looking a little worn. It didn't stop the kids from having fun, but it was a little disappointing to have to tell them that certain things weren't available. Make sure to stop in the entryway and watch the Foucault Pendulum, then spend some time in the first activity room before moving on to the exhibits. We had a lot of fun with the giant bubbles, relics of a huge bubble-themed exhibit several summers ago, and the air cannon (you get to construct a tower of foam bricks and then try to knock it down with the cannon). The paper airplane station (complete with launcher) was a little challenging for my 6 and 8 year olds, but older kids (and adults) had plenty of fun with it. This isn't an enormous, all-day science center, but it's a fun, educational way to spend a few hours with kids. If you're looking to extend the family-friendly outing, cross the bridge out the back and head over to the park. Zoo Boise is nearby, as are two museums, a rose garden, plenty of park activities, and sometimes (in the right seasons) pedal boats on the pond."
 ]
},{
 "name": "Aquarium of Boise",
 "address": "64 N Cole Rd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/00/9c/a8/aquarium-of-boise.jpg",
 "tags": [
  "kids",
  "tour",
  "food",
  "knowledgeable",
  "family",
  "kids",
  "tour",
  "food",
  "walk",
  "knowledgeable",
  "kids",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d2550173-Reviews-Aquarium_of_Boise-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Went here with our kids ( 6 yrs old). Bought our tickets off of Groupon. Parking is snuggled between two shops. Cute place. Small. There is alot in here for their size. We bought food for all 4 feeding exhibits. Great interaction idea. Kids had no desire to touch the dead krill to feed animals. There is a sink with soap and fabric towels for hand-washing.  Glad it was there. There were a lot of exhibits and plenty of activity. The stingrays really come up out of the water to get the food. A 'Guy' was outstanding and gave us a small personal tour or the bird cage ( kids got to feed them), then a bug named Bob. Then they held a lizard. nice guy with plethora of info. This was way beyond my expectations!!",
  "Went early in the morning.  Very inexpensive to go. Not big in size but nice.  We got to pet the stingrays (you can feed them too for a fee).  There are lots of fish and some big tanks.  Also sharks!  Iguanas, chameleons, birds, sea creatures.  Not a big huge attraction aquarium but very nice and the staff is very friendly and knowledgeable. ",
  "I've been to many aquariums and loved that the staff were friendly and educational as well as the number of interactive exhibits.  We did pay extra to feed at 3 different exhibits but it was worth it!  It wasn't horribly crowded even with its small size.  Lots of hand washing stations which was awesome!",
  "This is what I call a \"Pocket Aquarium\"  It is a little small, but very lively and well-kept.  You may want to call ahead as school tours make the place a bit noisy, but for somewhere to take the children on a rainy day, this is very nice!  My grandson especially enjoyed the hands-on areas.  It was his first experience with the colors and smells of the ocean.  The lizards and birds were a big treat, as well!",
  "Very small aquarium in a nondescript building (almost missed it). $10 entry is a bit expensive, and as a veteran I was charged $8, however they did not extend this rate to my family. \n\nIf you have teenagers, avoid this, as they will get bored very quickly. On the plus side, if you have never been to an aquarium then this might be OK, as they have fish touching exhibits. Plus the \"tween\" and under crowd will be happy here. ",
  "but still not great. It was a rainy day and there was a Groupon so we gave it a try. I'd thought my 3rd grader would be too old  but he loved the touch tanks. \nThe aquarium is tiny, next to a bail bonds place, and lacking in professional looking interpretive signs. If you've exhausted all of Boise's things to do, it's worthwhile. If not, go to the Old Pen or Birds of Prey.\n",
  "Went here with our kids ( 6 yrs old). Bought our tickets off of Groupon. Parking is snuggled between two shops. Cute place. Small. There is alot in here for their size. We bought food for all 4 feeding exhibits. Great interaction idea. Kids had no desire to touch the dead krill to feed animals. There is a sink with soap and fabric towels for hand-washing.  Glad it was there. There were a lot of exhibits and plenty of activity. The stingrays really come up out of the water to get the food. A 'Guy' was outstanding and gave us a small personal tour or the bird cage ( kids got to feed them), then a bug named Bob. Then they held a lizard. nice guy with plethora of info. This was way beyond my expectations!!",
  "Threw smell was so awful i felt ill. Then i felt ripped off paying $11 per person for an aquarium so small it took 30 min to walk through.  ",
  "Went early in the morning.  Very inexpensive to go. Not big in size but nice.  We got to pet the stingrays (you can feed them too for a fee).  There are lots of fish and some big tanks.  Also sharks!  Iguanas, chameleons, birds, sea creatures.  Not a big huge attraction aquarium but very nice and the staff is very friendly and knowledgeable. ",
  "Unfortunately we did not have much time and could not visit the Aquarium itself. The reason we went there was the penny press machine they had. Staff was friendly and nice and let my girl use the machine which is located inside the aquarium. I looked a little around on our way there and while it was indeed small it looked very interesting and interactive. A little concern in terms of well being of the animals was that there seemed to be no supervision on how visitors would interact with all the open tanks but that may have been a incorrect observation. Although it looked kind of small and could therefore be considered pricely if we would have had more time I would have definitely visited the aquarium.",
  "Took my 4 and 6 year old kids here and they loved it. Small place but made it easy to squeeze into tight schedule. Very interactive with a lot of touch tanks. Also able to buy food for rays, tropical fish, cichlids and parrots for small fee which kiddos loved. I would recommend to anyone with kids. \n"
 ]
},{
 "name": "Idaho Shakespeare Festival",
 "address": "5657 E Warm Springs Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/ad/e0/2a/before-the-show-began.jpg",
 "tags": [
  "free",
  "theatre",
  "theatre",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d10097973-Reviews-Idaho_Shakespeare_Festival-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "Many kinds of entertainment are offered so even if you're not a SHakespeare fan, check the website for the season's offerings - you'll find something you like!\n\nThis is a small venue so there are no bad seats.  Arrive early with dinner and settle in for some epic people watching.",
  "Attended opening night of Julius Caesar.  What a terrific setting for a dramatic, exciting, fun evening.  My teenage son and I bought our dinner from the onsite café and brought it into the theatre so that we could enjoy the pre-play concert.  So comfortable and pleasant to sit outside (despite the heat which quickly wore off).  The acting was great; the audience was enthusiastic; and the gender twist worked well.  The atmosphere and production stand up quite nicely to a similar, but more ambitious endeavor out east that may be free, but makes you die many times to snag a ticket.  Nicely done, Boise. Et tu, Central Park?",
  "Just went to Idaho Shakespeare festival for their Agatha Christie's play Witness for the Prosecution last Friday. Absolutely topnotch case and excellent staging. Very nice open air theatre. We took a picnic and ate beforehand then found our seats. Try to get the chairs in the middle area because the lawn chairs are crowded together. We took my elderly mom and she was able to walk up to our seats easily, and kept sayign she was so glad we had \"real chairs\" this time. I look forward to my next trip to Boise and will definitely attend a play at the Shakespeare Festival venue.",
  "After we listened to the soundtrack on the one and a half hour drive to the production, my husband made me promise not to sing along during the play.  I succeeded, mesmerized by the costumes, the acting and dancing!  As always, an A-one production.  \n\nWhether the reader is from the Treasure Valley or just passing through and looking for a night’s entertainment, head for this venue, regardless of which play or musical the repertory group is performing!  Food and beverages are available for purchase or bring your own.  We look forward to next week’s experience- “Witness for the Prosecution.”!",
  "We have been attending Idaho Shakespeare Festival for years and it is one of the top things we look forward to every year!  You will not be disappointed.  If you are able,  purchase a 4 person or 6 person table, they are the most comfortable.  The Cafe' is excellent and you can pre-order online.  Everyone we have taken has said, it was the best time.  The quality of the performances are excellent."
 ]
},{
 "name": "Payette Brewing Company",
 "address": "733 S Pioneer St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/4f/4f/31/tap-room-and-brewery.jpg",
 "tags": [
  "food",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g35394-d12071231-Reviews-Payette_Brewing_Company-Boise_Idaho.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had the Sake burger and it was great. No bun but on a bed of crunchy noodles and sweet sauce. Fries were just okay. Tuesday is $2 pint nights. The service person was not very good",
  "We went on a Monday afternoon, so it wasn’t very busy. My husband and I had our 5 year old with us (in town for a wedding), and it was great to have so much room for him. There was a giant connect 4 that kept his attention for a while, and the outside area was wonderful. Friendly bartenders and great service. We’ll be back when we visit again!",
  "Great selection of cold beer, friendly and helpful staff.\nPlenty of space to just hang out and dog friendly.\nGlad we stopped in while visiting Boise.",
  "Sunny day in Boise, lots of folks at the food truck, Bistro Babe, in the adjacent yard, playing corn hold, etc.  lots of young BOISE crowd with dogs, etc.  good variety of beer, though I haven’t found the Payette brews incredible.  Our daughter had the hibiscus/guava sour...pretty subtle on the fruit.  The sandwiches from Bistro Babe were good, but fairly expensive at $10.  Bread could use an upgrade.  There are pub games like pool and darts.  Fun, fairly loud atmosphere.",
  "I liked this brewery but it did feel really casual and maybe a space for younger people. The beer selection was pretty good for some. My husband was happy! For me, there were far too many IPA's and hoppy brews. I know these are popular but I look for a more well rounded menu. They did have a cider and a belgian style dubbel which you don't always see so that was kinda cool. The inside was very industrial and sleek. The outdoor space was huge with almost not enough tables and grass that needed attention. Great space but just needed some more attention to details to be perfect. This is the place for India Pale Ales and lots of hops if that is what you are into. A great space for large groups and socializing."
 ]
}]
