[
{
 "name": "Fenway Park",
 "address": "4 Yawkey Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/06/f7/4f/view-from-the-club.jpg",
 "tags": [
  "tour",
  "field",
  "history",
  "historic",
  "history",
  "tour",
  "field",
  "food",
  "history",
  "tour",
  "history",
  "parks",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d105250-Reviews-Fenway_Park-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have toured a number of baseball stadiums across the country.  This is one of the better ones.  There is a lot of proud history here at Americas oldest ballpark    You get team and baseball history    Sit on the green monster, and in the wooden seats, the Ted Williams seat, and see the garden where some of the concessions come from.   Tour groups are larger than others, but I think that is bc it’s so historic.  Saw a Little League Challenger team getting a custom tour, with BP on the field and players meet and greet.  Great to see they did that for a special group of players.  ",
  "Took my two friends from Wales to visit Fenway Park, and it never disappointed! You don’t have to be a baseball fan to enjoy Fenway Park, the history and retro features makes you appreciate and gain an understanding of how much a beloved ball park this place is and just how amazing it must be on game days! It really shows that no matter how much these modern day stadiums offer in terms of views and comfort, that you simply can not beat a place packed with history, tradition and culture!",
  "The tour was fantastic and almost exceeded expectations....\n\nAlong the tour we saw so much including:\n\nA. The visitor's dugout\nB. The Monster seats\nC. The Press Box\nD. The Trophy Room \nE. Fenway Farms (yes, Fenway has a farm)\n\nAs we walked our guide would fill us in on Red Sox and Fenway historical tidbits and was very informative. \n\nWhat didn't exceed expectations? We didn't get to go on the field!! Other ballpark tours I have been on allow field access but this one didn't (although that might have been because the ground crew was out on full force)\n\nIn short the tour is not to be missed - maybe I'll get lucky and go on the field next time!",
  "We visited this stadium and we knew it has history like no other and had heard you are always guaranteed fun and action when you come to a ballgame at Fenway Park.  The food is quite tasty and available at each and every corner you make.  The prices are very reasonable but the thing that sticks out the most is the superior service from all the staff. Such a good team.  Excellent job to everyone and a special thanks to the management for running such a well oiled machine. Why can’t all stadiums be like this?",
  "Been here many times as a kid and young adult growing up. Fenway Park has seen more memories than you could possibly imagine. If you are a baseball fan and you havent been to Fenway than your not a true baseball fan plain and simple. ",
  "Watched the Red Sox and Cubs play at Fenway about 3 years ago. Just wow! So much history. Seats were tight but manageable.  Did not know they had a tour so we will be back.",
  "Fenway Park is one of the oldest baseball parks in the USA. The green monster was fantastic. Being there in person really make you appreciate the size and hright of the wall.",
  "Fenway Park is a great place to enjoy the tradition of baseball. It has an unique atmosphere and is rich of baseball memories. "
 ]
},{
 "name": "Freedom Trail",
 "address": "139 Tremont St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e7/9a/ed/photo0jpg.jpg",
 "tags": [
  "family",
  "walk",
  "kids",
  "free",
  "walking",
  "history",
  "walking",
  "walk",
  "walking",
  "historic",
  "food",
  "historic",
  "food",
  "history",
  "walk",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104604-Reviews-Freedom_Trail-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "We love Boston and every trip with the kids will walk the red line Freedom Trail.  It's a simple concept.  Just follow the red line or red bricks and you will come upon a bunch of historical sites like the North Church, Faneuil Hall, Paul Revere's house and many other places.  \n\nMost of the sites are free to enjoy and there are plenty of others walking along with you.  \n\nIt's a can't-miss family adventure that will produce memories - walk at your own pace and enjoy the best Boston has to offer.  There are lots of bars and restaurants along the way - be careful to take advantage of bathrooms when you have a chance or you'll be needlessly buying drinks along the way just to gain access to the rest rooms.",
  "American history starts here- Bunker Hill Monument, USS Constitution (Old Ironsides), Paul Revere's House, Old North Church, Faneuil Hall, Quincy Market, Boston Tea Party Site, the Granary Burial ground, King's Chapel, Old Corner Book Store are all must see sites. The \"Red\" trail takes you to all these places and more. Very easy walking short segments of the trail.",
  "This is a great walk which you can take your time and enjoy at your own pace\nWonderful historic sites \nSuggest doing in cooler weather as it is lots of walking take strollers for children\nDefinitely one event to do while in Bosto",
  "We walked most of the Freedom Trail, stopping off at shops or for food along the way. It's easy to follow and great to see all the historic places in Boston. A must do while here!",
  "This trail has more than just history! It has the present, buildings and food! Do yourself a favor and make this trek! Totally worth it!",
  "WellWorth doing the trail \nWe actually walked  was interesting if finding the red brick trail as it was missing in places \nGreat history lots to see a long walk but plenty of eating places and bars on route \nWell worth doing",
  "Path of strong historical content with beautiful architecture full of relevant details!\n\nCaminho de forte conteudo historico com bela arquitetura cheio de detalhes relevantes !",
  "The Freedom Trail takes you to the historical parts of Boston and Charlestown,  It is a great walk and takes you to important places that played a significant role during the American Revolution like the site of the Boston Massacre, Old North Church and Bunker Hill.  You can easily make a day of it.  If you're in Boston just for the day, I recommend just doing that."
 ]
},{
 "name": "Museum of Fine Arts",
 "address": "465 Huntington Ave Avenue of the Arts",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/7d/01/6e/photo3jpg.jpg",
 "tags": [
  "history",
  "art",
  "art",
  "performance",
  "music",
  "art",
  "family",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d105257-Reviews-Museum_of_Fine_Arts-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "A beautiful building with wonderful collections of paintings by John Singer Sargent, Mary Cassatt, Vincent Van Gogh, and Claude Monet.They also have the Gilbert Stuart painting of George Washington used on the one dollar bill.",
  "If you've never visited an art museum before, treat yourself to the Museum of Fine Arts in Boston.  There is something for everyone here.  Besides the amazing paintings (like those of John Singer Sargent), drawings, and famous works of art, there are fabulous pieces of history here  -  from collections like the Ancient World, Musical Instruments, Jewelry, and Textiles.  And if you're in need of refreshment, there are a number of cafes at the museum as well.",
  "The Boston Museum of Fine Art has such an impressive and wide-ranging collection! Whether American art, European art, contemporary art, glass art, impressionists -- all of these collections include top notch works. Plan to spend a few hours!",
  "This beautiful art museum is an absolute must-see in Boston, with a breathtaking variety of wonderful exhibits.  There was also a temporary exhibit on mindfulness and one on how art withstands the tests of time, and the Bouchra Khalili exhibit especially was outstanding.  This museum also offers studio classes, as well as films, music, and performance art.  The staff are friendly and helpful, and the museum is well-organized so you can't get lost accidentally.  The building itself is a work of art.",
  "I had an appointment in the Morse Study room to see some works on paper. The staff was very accommodating! I love this museum. It's easy to navigate, the collection is outstanding, and the placards are informative. My one disappointment is the cafe - it's so high priced you can't afford to bring your family. ",
  "Rivals the Met in terms of its size and breadth of art history.  Lovely building and excited to see the renovations to the Asian wing when they're complete",
  "The MFA always has wonderful exhibits, community events, and of course stunning permanent exhibits as well. I became a member and go several times a year. Well worth it!",
  "Arrive right as the Museum opens and take in as much as you can before the crowds arrive. The collections are amazing and you could spend a day in each collection.  One of the best places to visit in Boston."
 ]
},{
 "name": "Boston Tea Party Ships & Museum",
 "address": "306 Congress St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/9b/54/d7/sailing-ship-at-berth.jpg",
 "tags": [
  "kids",
  "family",
  "walk",
  "tour",
  "learn",
  "history",
  "history",
  "kids",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103645-Reviews-Boston_Tea_Party_Ships_Museum-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our family really enjoyed this experience. The actors leading the tours were really enthusiastic, the kids were entertained the entire time. From the opening \"meeting\" to the walk in the replica ship, then the multi-media experience with projected characters that the guides interact with it was enjoyable for the whole family.\nIt was a great experience. It is also mostly indoors, so great for a day with terrible weather.",
  "We had a blast at the Boston Tea Party Ships and Museum.  The staff helps visitors re-enact the events of the Boston Tea Party starting with a rowdy and fun town meeting led by Sam Adams and culminating in the opportunity to toss chests of British tea into Boston Harbor.  The museum videos are excellent and very inspiring.  This is a fun and informative place to spend a few hours and is a treat for visitors of all ages.",
  "I must admit, when Hubby said he wanted to go to this museum , I thought it might be a bit dull- all plaques and cabinets. How wrong I was! This is a fun and informative way to learn about The Boston Tea Party - with Guides in period costume, a re-enactment of a meeting at the start and then a tour of the ships and a small film presentation.\nWe enjoyed this thoroughly!",
  "This museum was led by interactive and historically accurate hosts. From the hall of where is started, all the way to the replica ships that started the birth of America. You're able to throw replica tea into the harbor with ropes attached which was quite fun. Participation is critical only if you want to feel highly involved with the actual history portion itself. You are led into the basement history museum which you get to see and actual, and the only surviving tea crate.",
  "It was a very nice and exciting experience. Almost 100% replica was very charming. The players were very succesful and the show was interactive. I would like to be there again.",
  "Fun experience time went very quick interactive event \nEspecially as we where the only people from the uk\nGood to throw the tea over board and join in the fun\nHistorical and educational \nA must do when visiting boston",
  "I have read a lot about the significance of Boston tea party museum in history book / articles. To my surprise the museum does not offer too much detail on how the events of the tea party war really unturned. ",
  "Being brits we were drawn in by the mention of tea! ... this was a great fun experience and very suitable for kids, the staff/ performers were brilliant and knowledgeable, a very interesting experience and highly recommended "
 ]
},{
 "name": "North End",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/1b/f6/ff/north-end.jpg",
 "tags": [
  "food",
  "walk",
  "history",
  "unique",
  "history",
  "food",
  "tour",
  "walking",
  "eat",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103113-Reviews-North_End-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Italian food is my favorite, and discovering Little Italy in North End Boston is heaven to me! Sipping an Aperol Spritz on a sunny afternoon and eating a cannoli at Bova Bakery is bliss. We stayed on the far North end, and took Prince street straight down and went from there. Everything is walkable. People are friendly. Very safe.",
  "This is a must-do while visiting Boston. Cobblestone streets, authentic Italian restaurants, gelaterias, quaint cafes serving divine espressos, and pastry shops selling that most mouth-watering of Italian desserts -- cannolis. Word of caution: if planning to dine in the North End, make sure you call ahead for a reservation.",
  "A walk through the North End is a must in you Boston trip.\n\nA short walk from the harbour and filled with so many amazing Italian Restaurants, Bakeries, Shops and incredible Espresso Bars!\n\nHighlights are;\n\nMike's Pastry Shop and the Espresso Bar next door, a walk around this neighbourhood is so much fun and rich in history!",
  "Boston is one of those cities that is easy to traverse; great for walkers with tons to see & do.  Just like many larger cities, it has various neighborhoods with unique characteristics (Little Italy, China Town, etc.).  Shops, cafes and restaurants everywhere.  Add the history aspect and you can't go wrong.   ",
  "Wandered through en route to North station. Lovely quirky area with loads of restaurants and coffee shops. Fantastic vibe.",
  "Had no idea when we booked our hotel that we'd be in the North End. What a treat!!  Awesome food!  Nice people!  Fun things to do!  Highly recommend the North End. ",
  "I'm very glad I walked almost every street!! The streets are charming, and there are so many surprises along the way. There is shopping, Italian restaurants everywhere, bakeries, etc etc etc.\nI was walking the streets when I happened upon a tour, and I realized that the Freedom Trail is marked and I started walking it... and the next day I started it again, and I finished where I had started.\nIf you're in Boston, it's worth the time to get lost here.",
  "This area looks almost European with narrow streets and alleyways.  It has charm and is filled with history, interesting shopping and wonderful places to eat."
 ]
},{
 "name": "Boston Public Garden",
 "address": "4 Charles St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d8/78/ad/publiczny-ogrod-w-bostonie.jpg",
 "tags": [
  "walking",
  "performance",
  "walk",
  "parks",
  "historic",
  "walking",
  "nature",
  "history",
  "nature",
  "walking",
  "wander",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103648-Reviews-Boston_Public_Garden-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "No trip to Boston is complete without walking through these gardens! Located downtown and right beside Boston Commons, this is a beautiful spot to stroll through on a sunny day and stop and sit. You can see squirrels, ducks, beautiful flowers in season, ride the swan boats, see the duck statues, see the fountains, and enjoy the day!",
  "Situated amidst downtown Boston shops and restaurants is the Nation's first botanical garden. Beautifully  trees, plants, flowers, water, statues and musical performance can accompany you while you stroll through these beautiful park grounds. Perfect place for an afternoon picnic, exercise or a quick stroll before heading to dinner. Just excellent.",
  "This historic green space is one of the main parks of city along with Boston Common (located next to each other). It was created in 1837 as the country's first public botanical garden. Highlights of the park include the romantic bridge over the lake, fountains, landscaped planted areas and formal flower beds as well as swan boats (large flat peddle boats offering 15 minutes rides to the public). There are also two resident real swans, Romeo and Juliet. \nThe park is not huge as Central Park in New York, but lovely and very green, located at center of city, so you can not miss it if even you spend one day in Boston. Absolutely worth to visit especially if you tired after long walk through the city or planning to have a picnic.",
  "If you find yourself in downtown Boston and are looking for a respite from the hustle and bustle of Newbury St and downtown crossing, than head over to the Boston Public Gardens (directly next to Boston Common). This space was some of the first public gardens in America to provide some beauty and relaxation to the growing number of urban dwellers.\n\nDon't miss the tulips in the spring or the duck boats in the summer.",
  "We just can't pass up a visit to Boston Public Garden when in Boston.  Beautifully landscaped, it was bursting with the promise of Spring during our recent visit.  The Swan boats are worth including in your photos, even if you don't jump on board--which you simply MUST do if you have children.  \n\nIf you read Make Way for Ducklings with your children, as we did, you also must make it over to the bronze sculpture in their honor.  \n\nParking is a pain, but the Public Garden is within walking distance of most Boston hotels.",
  "While it's no Central Park, this little slice of history crossed with serenity is a must do when you're visiting Boston. Whether you're in town for an hour or a week, stopping here will fill you with peace and a wealth of entertainment. From the buskers, to the swan boats, the large variety of botanical splendor you will feel as if you've been here before and won't want to leave once you've arrived. Sunsets are best enjoyed here as you can mix the sound of the city with nature and its guests for a melodic and relaxing close to a beautiful day! Add this to the \"to see list!\"",
  "I often run/jog/walk here when I visit Boston... always clean.. often busy... well kept gardens. Love the ducks !!",
  "Beautiful park for walking, running and enjoying nature in downtown Boston !!\n\nBelo parque para camimhar, correr  e para curtir a natureza no centro de Boston!! ",
  "Great to have a wander round to get away from the bustle of the city. Lovely and tranquil atmosphere",
  "Lovely small tranquil park. It has picturesque lake/pond, famous statues (e.g. one of George Washington or Make Way for Ducklings) and many friendly squirrels. Awesome place to walk through or to spend some time.",
  "A lovely area for a stroll, even when we visited in winter it was stunning. Make sure you see the Make Way for Ducklings statues - they usually have hats or clothing to match the season or sporting calendar!"
 ]
},{
 "name": "John F. Kennedy Presidential Museum & Library",
 "address": "Columbia Point",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/a1/1b/f6/photo0jpg.jpg",
 "tags": [
  "learn",
  "creative",
  "family",
  "art",
  "historic",
  "walk",
  "free",
  "knowledgeable",
  "learn",
  "walk",
  "eat",
  "library",
  "family",
  "library",
  "history",
  "history",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103112-Reviews-John_F_Kennedy_Presidential_Museum_Library-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great day seeing the life of a great man and leader of our country, his life and legacy depicted in stages and accomplishments were awesome , well presented with a great tribute for Jackie added, well worth the trip , great for all young and old",
  "This museum is an excellent place to learn about and appreciate the life and times of JFK. Visit begins with a 15-20 minute film, and then leads you right into creative displays and exhibits about the 1960 campaign, then the inaugural address, and then the Kennedy administration. The Inaugural address setting is as well done as anything I could have imagined, enabling the visitor to experience what it must have felt like to actually be there in the audience. The entire address is given (it was short, only 15 mins) on a large screen monitor and is as bright and sharp as if it was recorded yesterday, not 50+ years ago. Other memorable exhibits included JFK100 special exhibit on the president's 100th birthday with JFKs personal items, the Cuban Missile crisis (very relevant now with N. Korea misbehaving), and Robert Kennedy (a special room devoted to him as JFK's Attorney General. Gift shop is well supplied with quality books and DVDs,CDs, along with the usual souvenir trinkets and t-shirts. Cafe is small but has good light lunch items and a view of the ocean, as does the large glass atrium which looks out onto the sea. I have been to 6 Presidential libraries around the US, and this is the most beautiful and most uplifting. Highly recommended. (There were lots of young people touring there - good!)",
  "It takes a bit of effort to get there by public transport. The T only takes you so far and then you have to get a shuttle bus. It was however worth the effort and we're glad we made it.\nThe museum is really well thought out. After an introductory film, the museum takes you through the election campaign, the White House years including a fascinating film on the Cuban missile crisis, through to the assassination.\nMany of the issues in that election are the same as those facing the world today.\nOne is struck by the charisma of JFK.\nHighly recommended.",
  "I went here with my mother and my husband. My mother, despite her Republican roots, greatly admired JFK and I remember the photo of the family she kept prominently displayed in my childhood home. The museum has something for everyone from great art to fashion and historic memorabilia and documents. You really need any entire day to see it all so plan accordingly. Wear comfortable shoes and have a big breakfast or early lunch. I would go again for sure!",
  "The museum is a fantastic journey through his life and the changing country and world at that time. The visit starts with a well-done movie covering the years leading up to the campaign then drops you off into a multi-media exhibit capturing the excitement of the campaign. Watch, read, and observe everything to really understand the culture of the times. There are galleries for every major theme such as the election, white house, missile crisis, space program, civil rights, the first lady, war, and currently some personal artifacts. Plan on several hours to see everything. Tours are available but the exhibits are well documented for self-paced visits. The staff was friendly and knowledgeable. There are a small Cafe and gift shop near the entry/exit. Restrooms are convenient. Use the directions on the website for GPS address rather than the actual address. Watch for signs carefully, the museum is located near the water at the UMASS campus and the signs can be confusing. Parking was free. Discounts available include seniors, students, Military, and CAC holders. A bonus is the harbor walk along the water.",
  "This is definitely a 'Must See' when in Boston. If you take the subway there is a shuttle from the station to the Library which is great as it is a long walk.  A wonderful building set on the water gives you a sense of peace as you enter but make sure you have something to eat beforehand as the small cafe is just that although the view is great.  The film on JFK was well presented and very poignant in some parts and it is a great lead in to the exhibits that told the story from his beginnings to that fateful day in Dallas.   I was a bit worried how the assassination would be handled but I needed not to worry - it was done with loving respect. Lots of videos being shown as you walk around each exhibit gives you further insight into the man and his Presidency.  Take your time - there is lots to learn and see and you can take photos inside.",
  "I liked this Museum and Library.  There is lots of information about Kennedy's presidency and the Cuban Missile Crisis.  His presidency was before my time, so I learned a lot about him and his family.  This is a great museum. \n There isn't a lot about his assassination here, but for that, you will want to visit the 6th Floor Museum in Dallas, Texas. ",
  "All the details on JFK’s presidency, life and times was awesome. There’s a piece of the Berlin Wall.  Artifacts related to WW2 service, clothing, and the glamor.  The first thing that struck me was the floor to ceiling wall of glass the great view of Boston harbor and cape cod bay.",
  "I had wanted to visit for a long time and I'm so glad I did.  The experience was very moving.  I felt like we were brought back in time and were able to share in some of the experiences of the amazing president.  This is a must see piece of American history.",
  "I saw this in 2004, but this museum still sticks with me even though that was sixteen years ago.  If you have never read my reviews, I am not a museum person.  Very few attract my attention.  This would be one of them.  John F. Kennedy, whether you like him or hate him, was a fascinating person in our country's history.  This museum has artifacts from his younger life to his presidency.  There was a video that you watched before you went in to the see the exhibit.  It is on the outskirts of the city, but worth it.  ",
  "I was one of only 2 people in the Museum after it opened. There was an excellent film about the president's life. The lobby of the theater section had memorabilia and stories of the president from youth to president. Other than that there was a beautiful view of Boston Harbor, a gift shop and nothing else. I thought the library was something you could see . "
 ]
},{
 "name": "Samuel Adams Brewery",
 "address": "30 Germania St Jamaica Plain",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/68/c9/2b/photo0jpg.jpg",
 "tags": [
  "tour",
  "brewery",
  "tasting",
  "free",
  "brewery",
  "free",
  "tour",
  "sampling",
  "free",
  "learn",
  "family",
  "tour",
  "history",
  "brewery",
  "tasting",
  "tasting",
  "tour",
  "history",
  "knowledgeable",
  "brewery",
  "free",
  "tour",
  "free",
  "tour",
  "brewery",
  "tasting",
  "brewery",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d603272-Reviews-Samuel_Adams_Brewery-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was about an hour tour with a free beer tasting at the end. They show you around the machinery, which is pretty quick, then take you to the tasting room! They have a small guest shop where you can spend some time before the tour. \nThe tour is free, but they suggest donating a dollar to local charities, which is not much money considering you get to keep your beer glass at the end of the tour. They have a place where you can mail postcards from the brewery for free! \nSaturdays it gets pretty busy, so try to go early if you have to or you end up waiting around.",
  "Okay, I've been on better brewery \"tours\".  They don't actually brew much here other than some craft and experimental beers.  That being said, the staff is great and it's completely free. You get to sample some Sam Adams beers that you can't find in stores. Sometimes the wait can be long on Fridays and Saturdays, so try to make it in the morning if you can.",
  "This is my second time reviewing this tour, because it's the second time I've been on it... and I still highly recommend it!\n\nI went on Saturday March 14, 2009 and much like the last time I went I was not disappointed. The tour is still free of charge and they ask for the $2 donation to local charities. The tour guide was great and up with the St Patrick's Day weekend festivities. And you still get a free 7oz glass to taste 3 kinds of beer (This trip it was Boston Lager, White Ale, and an Irish Stout-given the St Pattys holiday weekend!). It's still wise to get there early on the weekends because the tour slots do fill up fast (I showed up at 12:08 and had to wait til 1pm for the tour). \n\nHowever, I wanted to note that there have been some changes since the last time I went in 2007--and for the better!\n\nThe interior of the \"welcome\" part of the brew house was reorganized and revamped and for the better. They got rid of that 15 minute or so introductory video they had you stand and watch. \n\nThe rear of the brew house where you learn about the ingredients as well as the equipment has changed slightly. \n\nThere were many barrels stacked all over the place this time around and we actually got to get close to much of the brewing equipment. \n\nWhen it came time to sample the beer, the guide offered IBC root-beer to those were not of legal drinking age and to those not sampling the brews. I found this to be a very nice gesture so that everyone felt like they were participating in at least some way.",
  "Family was visiting from out of town, and we were looking for something fun to do on a cold winter afternoon.  We decided to take the Classic Tour at Sam Adams Brewery.  There is no charge, (although a donation is suggested - all money goes to support community endeavors).  Since it was. Friday, there were tours scheduled every half-hour.  We didn't have to wait, and walked right in.  The tour guide was well-informed, and kept things moving, and humorous.  The tour consisted of a brief history of Sam Adams beer, how it was made, and the research and development that kept it changing.  It ended with a tasting of three different beers (you get to keep the tasting glasses.). It is located near the Stony Brook T stop on the Orange line.  There is a very small parking lot, or else street parking.  This was a great tour, and kept us out of the wind for 1 hour!",
  "Are you in or near Boston? Do you have an hour or so to spare? Do you like beer? If the answers to these questions are “yes” then you need to get over to the Samuel Adams Brewery tour. \n\nThe free tour, while not extensive (most production brewing is done at other sites) -is fun and informative. We have done a number of brewery tours before at both large and small breweries - this was the best one by far. \n\nOur knowledgeable guide explained Samuel Adams Brewery’s history, brew process, and even let us taste some of the brew ingredients. But the highlight was a stop in the tap room where we all tried several different beers and got a quick lesson in the finer points of beer tasting. \n\nOverall a good time! ",
  "Great tour here, looking at how the beer is made and what is included, which was very informative. The tour is free, which is surprising as these are normally paid for. You get to sample 3 types of beer after and are told about them. The gift shop offers a wide variety of beer to but which I have done for returning to England. After went to the Tap Room and I would highly recommend it for a fun afternoon trying various beers.",
  "Things have changed noticeably since my last visit but the new plan is good. First of all, the tour and tasting is still really fun and the charitable support from our donations is commendable. The easy ride from downtown on the Orange Line of the T gets you right to the brewery. The short wait for a tour is in an interesting area. The guides are fun and informative. The beer education is interesting and the tasting room is a highlight of the experience. I have never ended a tour without buying something in the gift shop so I guess no one else should either. The new tap room provided a great opportunity to sample beers beyond those offered on the tour. This is a fun part of visiting Boston and I will do it again the next time I come. ",
  "A dull day with some rain encouraged us to visit the 'famous' Samuel Adams Brewery which was worthwhile. The guide explained the complete process of beer production. Our small group of 6 finished off with a commemorative small glass and then sampled 3 or 4 styles of beers produced on site with personal reviews and opinions of the tastings.\n\nThere is a gift shop selling everything SAM ADAMS. \n\nThe Orange line from DOWNTOWN takes you to Stony Brook and from there a 5 minute walk to the Brewery."
 ]
},{
 "name": "Boston Public Library",
 "address": "700 Boylston St At Copley Sq.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/9e/97/87/the-very-quiet-reading.jpg",
 "tags": [
  "free",
  "library",
  "library",
  "history",
  "art",
  "historic",
  "walk",
  "free",
  "library",
  "tour",
  "free",
  "library",
  "art",
  "history",
  "library",
  "art",
  "free",
  "library",
  "library",
  "library",
  "walk",
  "library",
  "walking",
  "historic",
  "free",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104816-Reviews-Boston_Public_Library-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was a fantastic experience to visit a \nmodern library in great style 2 days back.it is in the heart of the city ,with Copley square at stone's throw.it is strongly suggested to take advantage of free guided tours lasting approx 1 hour,to admire the artitectural glory of this building.\nThe books available here cover A to Z.you can go through the various language books of the world.WiFi is available.one can browse and read books old and new of one's choice.\n\nAfter spending a considerable time one can enjoy a fabulous coffee in Newsfeed coffee\n\nFor information  of book lovers - it is learnt that a regular member  can lend for short time a good number of books for reading.",
  "We had a lovely tea beginning with a choice of gazpacho or strawberry salad and an array of finger sandwiches, petit fore’s, tarts and your own pot of your fave tea! Enjoyed the ambiance of the Map Room. \nBeautiful sculptures, outside gardens, and lovely detail throughout the library.",
  "An architectural gem Found in the heart of the Back Bay in Copley Square is not to be missed! Steeped in history, this Renaissance Revival architectural gem and national historic landmark has many areas to explore the with stunningly beautiful vaulted ceilings in the classic reading room environment of Bates Hall to the alluring art and architectural details of abbey room and chevaunnes gallery \n\nTry taking team in the courtyard café Or simply take respite in the gorgeous quite I like to refer to as Boston’s best alfresco space!",
  "Don't hesitate to drop in for a short visit (free). Walk right in, up marble stairs, past lion statues; peek out window to interior courtyard; admire ceiling murals. The reading room is on the second floor - beautiful large windows; wooden details; green reading lamps on desks. This library also has an exceptional map collection. ",
  "You'll be surprised at what's inside.  See King Arthur's search for the Holy Grail in life size paintings and many other works of art.  The free tours last about an hour and are given by volunteer guides.\nThe Boston Public Library offers public tours highlighting the architecture of Charles Follen McKim and Philip Johnson, as well as the many works of famed sculptors and painters.  No appointment is necessary. Tours meet in the lobby of the McKim Building (Dartmouth Street entrance). Check for tour times and more information, email tours@bpl.org or call 617-859-2373.",
  "The BPL is our nation's first free public library (founded 1848) and even today has the third or fourth largest collection of books in the U.S. In this building on Copley Square since 1895, it is also full of history, beautiful art, and architecture,  The renovated Johnson wing just opened in Feb. 2105--the bright colors, brilliant design ideas, children's and teen areas are breathtaking. Take the free tour--the guides are very good. If you pay attention, you will fall ih love with Boston. Don't miss the John Singer Sargeant Hall with his history of religion depicted in huge murals on the walls. Also there is an unusual Joan of Arc collection. If you've been there before, go again to see the updates and restorations. Great place for lunch, choose either fine dining or a quick sandwich. Have your wedding reception there in the Beaux-Artes atrium.",
  "It’s all about the architecture which is absolutely stunning! I went with a mate and he had to comment on the incredible lion statues! I do have one small complaint and that's the amount of Mutants. It is a working library, but plenty of people here just having a sticky beak.",
  "Magnificent library with superb architecture. To see and why not take the time to read a book. Close late i love",
  "I was told the library in Copley Square was beautiful but I was so impressed. Could have spent the entire day there.",
  "This is not just a historic site, it's an actual library. I love libraries, so I enjoyed walking around and seeing the architecture, but it was a very quick walk.\nIf you're in the area, it's worth >30 minutes to browse the building. If you want to stay and read, even better ;).",
  "A great place to see and it is free. Lots of Art and history. Many use as a rest stop when touring the city."
 ]
},{
 "name": "Museum of Science",
 "address": "1 Science Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/bb/58/02/experience-the-sights.jpg",
 "tags": [
  "food",
  "family",
  "free",
  "kids",
  "family",
  "library",
  "food",
  "family",
  "drink",
  "theatre",
  "kids",
  "free",
  "kids",
  "family",
  "walk",
  "learn",
  "kids",
  "theatre",
  "family",
  "kids",
  "kids",
  "field",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104912-Reviews-Museum_of_Science-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Going to the Science Museum in Boston is pretty much a day event. They have the Omni theater, discovery section, movies , butterfly place nice cafe with different restaurants to choose from, they have an awesome virtual ride, and the museum has a great variety of science. parking lot connected to the museum which is very convenient and they offer coat check and lockers from small to large. Def should take a day and enjoy the museum.",
  "Gridiron Glory: The Best of the Pro Football Hall of Fame exhibit (closes Jan 2, 2018)brought my friends and me to the Museum of Science, Boston, for my third visit this year. While there, we also took in a viewing of Journey to Space, a 3-D movie about NASA's shuttle program projected on an IMAX dome screen at the museum's Mugar Omni Theater.\n\nThat's the great thing about having an MOS membership. Several new and wonderful, general interest exhibits arrive each year, and we members get to enjoy any or all of them at no cost. For $90 annually, two people get free admission to all permanent exhibit halls and most special exhibits, 2 hrs. free parking each visit, a handful of free guest passes to share with friends and half price admission to the Omni Theater, Planetarium, Butterfly Garden and 3-D Theater. A stepped up membership ($125) includes more free guest passes along with free passes to the Butterfly Garden, the two theaters and planetarium. There's also 5- and 8-person family memberships available.\n\nThe main exhibit halls are situated among three wings on three levels of the museum and feature just about everything one would expect from a world class science museum including human life, New England habitat, math, electricity, invention, engineering, high tech, dinosaurs, birds and bees, and other live animals; 700 interactive exhibits in all with games to play and puzzles to be solved by children of all ages and octogenarians alike.\n\nBut it's the special exhibits and Omni Theater films that keep bringing us back several times each year. In the warm weather we bring a picnic lunch to enjoy out on the museum's lawn, adjacent to the Charles River. It is an especially good idea to pack your own lunch, dinner or a snack as the one great flaw of the museum is the over-priced, barely edible food served inside at the Riverview Café and at Puck's (operated by \"the\" Wolfgang Puck it makes the worst pizza I've ever eaten.)\n\nTo end on a positive note, I should ad that from April - November, Museum visitors may purchase tickets to take a ride on one of Boston's iconic Duck Boats at the front plaza driveway, nearby the museum's beloved T. Rex. You can't miss him. ",
  "Managed to score reduced rate tickets for this and absolutely loved this\n\nMassive museum and would take a good part of a full day to do all the exhibits justice with kids\n\nLoads of interactive stuff....particularly the human body area as well as dinosaurs and a must miss electricity show!",
  "Our local library offers reduced price passes to the MOS, which means we pay $5 per person instead of the $19 that is normally charged.  If I were spending $60 to visit, I don't think I'd be impressed. We go every few months, or whenever there is a new traveliing exhibit.  It gets VERY crowded, VERY quickly, so we make sure that we arrive at 9 when they first open.  If you wait any longer, you end up spending too much time waiting in line.  (And as with all museums, not everyone follows the same unwritten rules of waiting your turn, which can be very frustrating for children.)\n\nDon't pay extra for the butterfly exhibit- it isn't worth it.  The space is very small, and there aren't many butterflies.  There's a better butterfly place in Westford, MA.  We haven't been to the planetarium or IMAX shows yet.\n\nI've read other reviews complaining about how old the exhibits are and how rarely they are changed.  This is true- however, children will get something different out of it every time they go.  Often, children need to be exposed to a concept more than once, and the permanent exhibits are fantastic.  When my son was two, he thought it was fun to swing the pendulum.  Now that he's six, he understands more about how it works.  When he was a toddler, he thought the see-saw was just for fun, but now he looks at it and describes how it works.\n\nThe museum also offers memberships, which greatly reduce the price of parking AND allow you to visit 200 other museums and zoos across the country.  We recently purchased a family membership and had it pay for itself on an east coast road trip during April vacation alone.",
  "After attending a wedding in Maine, my family drove down to Boston and visited the Boston Museum of Science. We loved it. It's a very large place with three different levels.\nThere is a huge amount of variety of science here. Dinosaurs, human bodies, a butterfly garden, light and electricity, machines, birds, and nanotechnology.\nThe place offers lots of shows and presentations almost every half hour. One called Lightning! had some really cool stuff with electricity and talked about storm safety. The Live Animal shows included feathered, furred, and scaled critters.\nParking costs money but there is an attached garage.\nThere is food and drink available on the first floor, but food is not allowed in the exhibit halls.\nThere is an omni theatre,3d theatre, and planetarium (each for an additional charge). \nIt is an expensive museum if you aren't a member, $23 for adults and $20 for kids under 12 (under 3 is free).\nIt opens every day at 9, but check based on the season and day of the week as to when it closes.\nThey offer fun activities like overnight outings, and birthday parties.\nThe exhibits are well maintained, interactive, educational, and engaging. This was a really cool museum. I'm glad we got to visit.",
  "My son and nephew both have museum memberships so our family visits often.  There are great educational activities for all ages. This museum has permanent exhibits as well as traveling exhibits and shows which change frequently, so there is always something new to see and learn.  I've been with my whole family-- ages 7, 9, 26, 29 (me), 58 (parents), 79 (grandmother) and we all love it.  If you're even the slightest nerd, you'll love this place! All fields of science are represented in fun and interactive ways.\n\nCONS: These are the reasons I can't give it 5 stars-- 1) The commute.  The Museum of Science is in a very populated area and there is often construction, traffic, and special events taking place nearby. 2) The money. Without a membership, the parking (there is a garage) and museum admission are quite pricy. In addition, all of the \"special\" exhibits and most shows cost extra $$ and are not included in basic admission.  If you don't want to drive and deal with traffic and parking fees, the museum is accessible by MBTA, but it isn't a fun walk across the busy bridge from the train station to the museum. There may be a way to get closer by bus.  3) The crowds.  Avoid times when there may be school groups or summer camps visiting.  It's just TOO CRAZY with all of those loosely supervised kids running around. Literally.  Unfortunately, this is hard to avoid because of-- 4) The hours.  This museum isn't open very late (5:00 most days) which also means you need to plan for a day trip that starts early if you want to see it all. Check the website for exhibit schedules and closings if there is something in particular you'd like to see, because there are some days that certain exhibits are closed for maintenance or private events.",
  "Electricity theatre show, huma anotomy exhibits and the space show in the planetorium are the top most exhibits for me. Boston Science museum offers many exhibits that fall into interests of kids, teens and even adults. I enjoyed the electricty show a lot - having read about the strength of electricty when i was a kid but never experienced anything practically. The exhibit is must go for every one. \n\nYou may want to skip the 4d theatre, its not worth it. I have been to better 4d theater in the past and did not find this super interesting. But if you never visited one, you will be amazed. Good luck. \n\nStay safe and healthy",
  "We visit this museum multiple times a year and have a family membership. We particularly like to see the rotating exhibits over the years. The museum is very child friendly and there are many hands on activities like you would find at a children's museum. There is also a separate area, The Discovery Center, that basically functions like a small children's museum for the younger visitors. It's a great place to visit for a couple of hours but you could easily spend a full day here and still miss things. Don't miss the electricity show, the hatching baby chicks in the hall of human life, and the awesome gift shop!",
  "You could spend all day here and not see everything it has to offer.  The kids love the hands on challenges they run.  We were there for the dog exhibit - a BIG hit.  The day started and ended wiht a single catch phrase from the kids \"wow, look it!\"",
  "Visiting and seeing big dinosaurs, animals and earth. Visiting the small and big exhibition is great!! This is a place to be visited!",
  "The museum is divided by wings that 3 levels a piece. There is so much to see you need the entire time it’s open if you only have 1 day. It’s like 30.00 for adults and 24.00 for kids. Make sure you get a bracelet and try all the different personal quizzes. We enjoyed the live animal shows. The lighting show was pretty cool as well. Something for everyone when it comes to science. The lockers were pricy: $8.00 for one big enough to hold your back packs and jackets. There is restaurant on site. There were so many different ways to learn and explore. It’s a great field trip for kids. "
 ]
},{
 "name": "Isabella Stewart Gardner Museum",
 "address": "25 Evans Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/2a/b6/dc/photo1jpg.jpg",
 "tags": [
  "art",
  "art",
  "tour",
  "art",
  "walk",
  "library",
  "art",
  "unique",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d108823-Reviews-Isabella_Stewart_Gardner_Museum-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "A favorite to visit when in Boston .Designed to emulate a 15th-century Venetian palace, the lighting is low and furnishings make it feel as if one is visiting a private home of a wealthy art collector. Important pieces of American, European, and Asian art and furnishings. The flower filled central courtyard offers a perfect respite for tired eyes.",
  "Too much to say to Fit here but... John Singer Sargent’s El Jaleo is amazing, you’ll see the empty frames from the nations most notorious art heist too. This place is frozen in time on purpose. Please visit to find out why! ",
  "Visited the Isabella Stewart Gardner Museum on the recommendation of a friend from Boston and was so please I did.  The museum is a wonderful gem in the heart of Boston and features the extensive art collection of a prominent Bostonian in Ms. Gardner, all of which is housed in a building that was built to look like an Italian palace.\n\nThe museum is multi-story but very accessible and easily viewed within several hours.  The collection includes works gathered from artists from around the world including Botticelli, Rubens, Sargent, and Manet, just to mention a few.\n\nThere is a cafe and gift shop located within the museum and both are very well done, as are the grounds in and around the museum.\n\nThe collection and building were left as a gift to the people and it was certainly a treat for me to visit.  I would recommend the museum to anyone.  I would also recommend the self-guided audio tour for a few extra dollars. It was very insightful.",
  "Enchanting is certainly one word to describe this place. Easy to just walk around and enjoy entire rooms of art. \n\nBut, Instead of having an informative sign near each art piece that contains information about the art, there are laminated sheets that provide this information in each room. \n\nThe only issue with the laminated sheets is that the visitor has to pair each sheet with each wall and hold all four (1 per wall = 4 walls to a room) sheets at all times. It's a bit too much in my opinion. However, this is a place with wall-to-wall art in each room. There is a library where visitors can just sit and read more about the art.",
  "Excellent museum with a solid permanent collection, interesting special exhibits, and an amazing building with a most beautiful central courtyard garden.\n\nGreat place to spend a couple of hours and a rather nice small cafeteria to grab a bite as well.\n\nSpecial events as well; just check their calendar.\n\nDefinitely worth a trip. ",
  "What a find. Isabella had to have been a force to be reckoned with. The museum/home is filled with treasures that give insight into the love of the arts. Her personality shines through this marvelous experience.",
  "This unique museum in the heart of the Fenway area in Boston is a must see.  It is home of a famous art heist that was never solved.  The empty frames in the museum represent the art works that were stolen.  The art work, garden, and atrium are beautiful.  The building itself is a work of art.  There is a vaired and wonderful colletcion and the volunteers are very helpful and wonderful.",
  "The documentary, \"Stolen\" by Rebecca Dreyfus told the story of Isabella Stewart Gardner and how she collected this fabulous art, and then there was the robbery in March 18, 1990. Since it's coming up on the 30 year anniversary I decided to visit this museum. Spectacular! So beautiful I took all three tours. Like visiting someone's private collection. Because it is."
 ]
},{
 "name": "Boston Common",
 "address": "139 Tremont St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/1c/8a/46/boston-common.jpg",
 "tags": [
  "learn",
  "walk",
  "history",
  "kids",
  "nature",
  "history",
  "walk",
  "walk",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104795-Reviews-Boston_Common-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lately I’ve been thinking about Boston Common because I’m working on a festival that will take place there. I’ve realized it’s less of a tourist destination, and more of a working space that the people of our region use, and use hard. But that doesn’t mean you shouldn’t bring your camera, take a walk through it, enjoy the day, and learn some New England history.\n\nJust a stone’s throw from the golden domed Massachusetts State House, it is a place of celebration, commemoration, and most importantly, it is a public park with memorials and statues. In the summer months we lounge, lunch and watch plays there, and in the winter, we skate, stroll, and watch fireworks on New Year’s Eve. \n\nAnd in all weather, it is a place for public discourse, for protest and gathering. It’s an open, public space that school teachers tell us was developed when the European settlers wanted a nearby place for livestock grazing. There are no cows now on the Common, but there are people, and people from all walks of life. I say go there, value the word “common” and think about what common space does for communities. Boston Common is a space New Englanders cherish and hold dear, for good reason; it is definitely worth visiting.",
  "There’s lots to do! There’s a place for a little kids to swim in the fresh water wading pool called Frog Pond, a carousel for them to ride, plenty of shade trees and benches, as well as beautiful bronze monuments. Kids of all ages will enjoy this venue!",
  "This park has the combination of nature, history and entertainment. Although we visited it during the winter, we thought it was beautiful and interesting to be in pure contact with the flora and fauna of Boston while you stroll by its paths in which you encounter  monuments of the Freedom Trail as well as a skating rink (the Frogs Pond), playing area for children, plenty squirrels that you may feed, a great amount of benches to sit and relax, etc.This is one of the land marks of Boston and definitely worth to visit during your stay in the city.",
  "Lovely small park to walk through or to spend some time in. Starting (or finishing) point of historical Boston Freedom Trial. There are many cute friendly squirrels in the park.",
  "Although we visited in winter, Boston Common is still a wonderful place to saunter through and watch all the dogs enjoying chasing the many squirrels! A lovely place to take in the atmosphere of Boston and enjoy some peace and quiet for a while.",
  "Okay, so I enjoyed my time walking through this area. I walked through the Gardens to get here, but I preferred this park more. There is so much to see, including people watching.\nThere are a lot of locals, and there was something happening in almost every corner of the park. It's a nice place to kill an hour, and to stretch your legs. I spent almost a week in Boston, so I had plenty of time to see it all. \nIf you have limited time, it's worth a quick walk through, but you don't need to see every inch of the park.",
  "This is a nice, relaxing park that provides a great reprieve from all the surrounding buildings. It also has some amazing history tied to it, which is great for history buffs such as myself. There's nothing in particular that stands out and it's certainly not a must-visit location, though it's a nice place to just sit and people watch. \n(5/2018)",
  "Nice park. Squirrels were huge. Walked by a political rally one day and a road race for rare disease another day. Awesome. The make way for ducklings was great! "
 ]
},{
 "name": "USS Constitution",
 "address": "Bldg. 5, Charlestown Navy Yard",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a1/96/53/photo3jpg.jpg",
 "tags": [
  "tour",
  "walk",
  "history",
  "tour",
  "history",
  "active",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d6825959-Reviews-USS_Constitution-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "A very easy visit to a working US Navy ship.  Security clearance is required - must have photo ID.  Enjoyable guided tour on the ship and a wonderful museum with tons of information!",
  "This is a piece of Floating History, accessible by the Freedom Trail and a must see on a history walk around Boston.  Gives a tall guy a sense of appreciation upon coming back above deck and being able to stand up again",
  "What an excellent experience visiting the USS Constitution... blew me away... my brother was British Navy and he would have loved this....I went here in memory  him, but I loved every second of it.",
  "An experience not to be missed when in Boston.  The Warship referred to as 'Oid Ironsides' is a copper plated wooden hull frigate still 'in service''. The crew of guides are all current Naval personnel and the tour was very informative by our guide who gave the history of the commissioning of a Naval Warship and was the first Naval ship which created the U.S. Navy as known today. Launched in 1797 the guide informed visitors she is seaworthy and is launched approximately 5 times a year to sail around the Charles River - technically she could be called to active service but would be highly \nunlikely !!!\n\nThe tour is also a bonus as it is Free...",
  "We loved visiting this incredible piece of history.  There were currently enlisted marines on duty to answer questions and describe parts of the ship and its stories.  The visitor center and museum are also very much worth going to with interactive exhibits and rich information. And displays of reL artifacts and stories.  The view of the harbor is incredible, and if you go near the time of closing, stick around for 15 more minutes to hear and see the crew close the night with taps, taking down the flags, and various other things including firing a gun as the lights from the sun darken and the city lights start to brighten.  For both of these experiences I would allow at least two hours if not three.  "
 ]
},{
 "name": "Beacon Hill",
 "address": "Between Beacon St and Cambridge St Beacon Hill",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/5b/bf/a1/beacon-hill.jpg",
 "tags": [
  "tour",
  "history",
  "kids",
  "walk",
  "tour",
  "walk",
  "walk",
  "walking",
  "history",
  "tour",
  "history",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d142762-Reviews-Beacon_Hill-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fantastic location and stepped in history I took the tour to see all the sights within including the scared cod!!!\nBrilliant tour fun friendly and helpful staff based right on Boston common so great central location \nIf get the chance go to acorn street nearby for a picturesque cobbled street",
  "Take the kids along for a trip back into time as you walk some of the oldest streets in Boston to explore some great architecture of Bostons oldest Buildings around Boston and Stop by the State house for a tour.    ",
  "The oldest part of the  city with gorgeous  typical houses, tiny winding streets,immmaculate  and  lovely to walk through with adorable pricey shopping on Charles  street.",
  "This is one of the wealthiest and nicest parts of Boston.  It has gas lit streets and brick sidewalks.  I personally enjoyed walking around and appreciating the architecture.  I recommend visiting this neighborhood for a nice walk.",
  "Magical area rich with history, Beacon hill is that I Dilick American landscape with beautiful architecture people oriented streets great shops right markets a wonderful alarm all American experience.",
  "Fantastic location and stepped in history I took the tour to see all the sights within including the scared cod!!!\nBrilliant tour fun friendly and helpful staff based right on Boston common so great central location \nIf get the chance go to acorn street nearby for a picturesque cobbled street",
  "Such a charming neighborhood with lovely Little boutiques and cafes nestled in charming old buildings lining the brick paved streets. The architecture is beautiful and the perfect place to see in the autumn and the holidays.",
  "Great walk through some of the old streets.  State House tour is free--great docent.  Enjoyed the shops on Charles Street."
 ]
},{
 "name": "USS Constitution Museum",
 "address": "Bldg 22 Charlestown Navy Yard Charlestown",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/4f/42/4f/uss-constitution-museum.jpg",
 "tags": [
  "learn",
  "free",
  "history",
  "walk",
  "history",
  "learn",
  "walk",
  "history",
  "library",
  "walk",
  "tour",
  "learn",
  "history",
  "free",
  "walking",
  "walk",
  "kids",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104828-Reviews-USS_Constitution_Museum-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located in the Boston Naval Yard across from the actual ship the USS Constitution the Museum itself gives a great education into the history of the ship. From the decision to build the ships, complete construction, the launching and the service as a frontline warship, and its journey into a symbolic and devoted piece of American history. It’s also a good place to cool off on hot summer days, get yourself a water, take a restroom break and learn about a historical ship before or after seeing the actual ship which is located across the yard. A key note is that Museum is free, they do accept Donations.",
  "So cool to be able to walk around and explore the world's oldest commissioned naval vessel still afloat. We just happened to be visiting on the 221st birthday of the ship, which was really interesting. It was amazing to be able to walk about the ship and go below deck to see how the crew would have lived. The crew on board the ship are very knowledgable and happy to answer any questions. When a big group formed, they did a short presentation about the history of the ship. Two things to note: you must have valid photo ID with you get get on board the ship, and the ceiling is very low below deck, so if you are tall, you will have to watch your head and duck as you walk around.",
  "The USS Constitution Museum, which was established in 1972, is housed in Building 22, a restored shipyard building at the foot of Pier 2, in the Charlestown Navy Yard, which is part of the Boston National Historical Park in Boston, Massachusetts. It is situated near the ship USS Constitution, or Old Ironsides, at the end of Boston's Freedom Trail. The museum, through its collections and interactive exhibits, tells the story of the USS Constitution, one of the legendary ships of U.S. naval history, and the people who designed, built and sailed her. For example, All Hands On Deck is an all-ages interactive exhibit that explores the realities of life at sea during the War of 1812. Another ongoing exhibit is Old Ironsides in War and Peace, an in-depth look at the ship's storied history, including how and why she was built, how she earned her fame during the War of 1812 and why she is preserved as the U.S. Navy's oldest commissioned warship. Two other interesting interactive exhibits are Old Ironsides War of 1812, which explains the causes and consequences of the War of 1812, and USS Constitution vs. HMS Java, which tells the story of the battle between the two warships through artwork, archival records and artifacts associated with the battle. The  museum also is home to the Samuel Eliot Morrison Memorial Library, which includes a comprehensive archival repository of records related to the ship's history. Visit the museum, learn about the ship, then board it and walk the planks. Aside from the HMS Victory in Portsmouth, England, Admiral Horatio Nelson's flagship, there is no other ship in the world like USS Constitution.",
  "Joshua and Justin gave us an excellent tour of the USS Constitution.  A+ to them both. \n\nA beautifully preserved piece of American history displayed at the Charlestown Navy Yard.  It’s a quick walk from West End and if you’re walking along the Freedom Trail you’ll come across it. \n\nThe tour lasted 20 min and you are free to roam around the 3 decks. You’ll learn a bit is history and see the sleeping quarters and canons all while imagining a crew of 400+ on board.  Proudly displayed and beautifully preserved, it’s a must stop when in Boston. ",
  "This was a great part of our trip, my husband would definitely have stayed longer but we didn't have much time in Boston.",
  "While we were in the area (Freedom Trail), we decided to check out the museum. I'm glad we did. It was quick and fun. The boat isn't very big, but it was interesting to walk around the boat and go below deck.",
  "Stopped here along our freedom trail visit.  One of the only stops that doesnt require payment.  They ask for donations.   Great info.  Nicely kept.  I have boys 10 and 8 years that loved it. ",
  "It is a very instructive museum and kids as well as adults will learn something from the visit. The personnel and the volunteers are extremely friendly helpful. I liked the display."
 ]
},{
 "name": "Quincy Market",
 "address": "4 S Market St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/74/1f/86/quincy-market.jpg",
 "tags": [
  "food",
  "walking",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d8400863-Reviews-Quincy_Market-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "I enjoyed walking around the Quincy Market and seeing all the food that was available. I definitely recommend coming on a weekday if you can because there weren’t a lot of people when I went. You can definitely spend 1-2 hours here looking at everything. The Colonnade within the market is by far one of the market’s greatest aspects. It’s basically a long hallway of food on top of food. Definitely come with an empty stomach so you can try all the food that is available. If you decide to come here, also check out the Faneuil Hall Marketplace because they are right next to each other.",
  "I don't really spend my time shopping on vacation; I'm more of a browser... and this is a great place to walk around. The Market has a lot of other sites around it, so it's a nice place to start or finish. \nIf you want to try local treats, come hungry. If you want to buy souvenirs, you can find them here. It's a one-stop experience if you're short on time.",
  "Good trip to Quincy Market, good selection of eateries and local Boston delicacies. My sister had chowder here which was fantastic. Out of season when we went, but still enjoyable and good way to try different foods.",
  "We almost skipped this because a market is a market is a market - right? I am really glad we did not. First, it is full of beautiful architecture and history - the cobblestones, the vaulted ceiling, the spiral staircases - it was a treat for the eyes. But it was also a treat for the tummy - there are so many options, we could have eaten here every day for a week and not tasted it all. And it was equally fun watching the hustle and bustle. There were performers in the areas around the market - even on a cold, blustery day. It was definitely a good investment of our time in Boston. I enjoyed it so much that I would return here on future visits. Lots to see, taste, and take in....",
  "I had a few hours to kill whilst waiting to check in for a flight.\nWhat a fabulous place, so many different smells and tastes that just tantalise the taste buds. \nThere is an array of shops that will please many (I hate shopping) and whilst I was there, there was a guy singing his heart out and really good and a couple of acrobatic guys entertaining (and jumping over) the crowd.\nA great place to spend a few hours"
 ]
},{
 "name": "Faneuil Hall Marketplace",
 "address": "1 Faneuil Hall Sq Quincy Market",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/55/38/98/faneuil-hall-marketplace.jpg",
 "tags": [
  "food",
  "walking",
  "free",
  "historic",
  "food",
  "history",
  "food",
  "food",
  "eat",
  "parks",
  "historic",
  "history",
  "walking",
  "food",
  "walking",
  "food",
  "walk",
  "historic",
  "history",
  "walking",
  "food",
  "music",
  "tour",
  "history",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104824-Reviews-Faneuil_Hall_Marketplace-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great food hall omg every food imaginable of every nationality you most visit here we always love to find the local food Market and this didn’t disappoint great atmosphere and great foods ",
  "This historic building has numerous shops and a kiosk for the National Park Service visitor center from which you can catch free ranger-led walking tours of the freedom trail. The one authentic merchant in the hall seems to be the printer in th back corner. He prints replica documents such as the Declaration of Independence using the same equipment and techniques as colonial times. He is passionate about what he does, and he is a delight to talk with.",
  "Every second that we were there there was something going on whether it was checking out all the amazing food vendors and getting lots of yummy meals or hitting the little shops or experiencing the outdoor excitement of the history of the place or watching street performerS!",
  "Quincy Market is OK, but not anything all that special. (I have to admit that they do have some pretty good street entertainers in the area.) Be very careful if purchasing candy or other food items from the vendors in the market. Watch the scales - some of them are very unscrupulous and will rip you off in a heartbeat. For the most part, I don't think they care - they see everyone as a clueless tourist. I think there are some reputable vendors there, but, for the most part, the place is just a little too cheesy for me.",
  "Do enjoy the market but don’t forget to visit the hall upstairs, worth the extra time. It is another of the amazing places on the freedom trail",
  "Faneuil Hall has is basically a big market place for tourists. If you want to go to one area to get your fill of typical souvenirs to take home, this (and Quincy Market) is your one stop shopping place. The National Parks Service has put some historic exhibits up in Faneuil Hall (lower floor) though to at least try to address the history of the buildings.\nQuincy Market is now basically a huge food court. There is a wide variety of food, so everyone should be able to find something they like. There are some souvenir vendors on the sides and on the lower floor. If you go during cold or inclement weather, be advised that indoor seating for eating is minimal at best. When I was last there, it was cold & windy outside, so no one was eating outside. The place was packed, and most people were sitting wherever they could find a step to perch on. I would only come back here during good weather so I could take my food and sit outside to eat.\nI would not plan to spend more than a few hours here. I would also save it to the end of my trip as it is a good place to pick up any souvenirs you may need for family/friends at home.",
  "I enjoyed walking around Faneuil Hall Marketplace and seeing all the shops that was available. I definitely recommend coming on a weekday if you can because there weren’t a lot of people when I went. You can definitely spend 1-2 hours here looking at everything. If you decide to come here, also check out the Quincy Market because they are right next to each other.",
  "Spent about and hour walking outside and inside. Quite a variety of shops and food choices. Well worth a visit.",
  "The market place is part of Boston's history. Amazingly beautiful to walk and visit during a nice day. Food stands are great. Taste of Boston and Massachusetts in general.  Nearby are other significant places to visit. Boston is a walking City. From the first City Hall to the historic burial place, churches and others.",
  "This place has a lot to offer. QUINCY market offers a huge number of fast food choices that includes almost all the cuisines in the world. But not too many vegetarian options though. During Christmas time they usually have huge Christmas tree, live music. I highly recommend every visiting Boston to go here and feel relaxed. ",
  "Come one come all! You'll be glad you experienced the history of the area. The story of Paul Revere and the American Revolution. This is a historic building that has been maintained and yet serves today's needs. It is filled with vendors and foods for every palate. A definite must see on your tour of the Freedom Trail."
 ]
},{
 "name": "Newbury Street",
 "address": "Back Bay",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/37/22/1b/photo3jpg.jpg",
 "tags": [
  "walk",
  "eat",
  "food",
  "walk",
  "eat",
  "art",
  "wander",
  "walking",
  "unique",
  "independent",
  "walk",
  "walk",
  "walking",
  "walk",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d105255-Reviews-Newbury_Street-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place, great shopping, such a huge and diverse city, wonderful cafe scene. Great shopping can't wait to go back ",
  "Great to browse the shops and walk, loads to designer shops and some quirky ones. Some lovely restaurants to eat at, very upmarket area. Photograph of the only primark in the USA, not on Newbury Street.",
  "Beautiful, tree-lined street with great window shopping and people watching (as well as real shopping if you're so inclined). A vibrant and lovely street, very entertaining with good restaurants and coffee shops.",
  "One of the best things about Boston is how walkable our city is. Start out at the foot of Charles Street and take a walk across the Public Garden. Perhaps you can stop at the old Ritz Carlton - now the Taj -- for breakfast (always pleasant). Continue onto to Newbury Street -- although a walk early in the morning is great -- it would be primarily for window shopping as most of the stores, salons and galleries do not open til l0:00 a.m. The street is the home to a myriad of art galleries, boutiques, cafes and high end designer shops. If you walk the entire length of Newbury street -- remember cross streets are alphabetical - from the Taj on Arlington and Newbury to Mass Avenue -- you will cross Berkeley, Clarendon, Dartmouth, Exeter, Fairfield, Gloucester and Hereford. Each block seems to have its own personality -- the first block being more rarified (those less than in the old days) and Mass Ave being more yuppified -- funkier, more youthful in tone and what's available to eat, buy and \"see.\" Some of my favorite shops are CERI for women's clothing, BILZARIAN for the rich and the chic (men's and women's clothes and accessories), WINSTON FLOWERS, The Thinking Cup for a quick and pleasurable cafe latte or cup of tea and sweet treat...the further up the street you walk, the funkier the stores and quite frankly, the more interesting. By the time you get to Mass Ave you'll be looking for a cool treat. Fortunately for you, there is a JP Licks for yummy ice cream including no sugar added (I love the coffee flavored soft serve).Dont be tempted to get a sandwich at Deluccas Market at Fairfield and Newbury - the food is awful. A couple of less expensive things to do on the street includes stopping into one of the cheaper (primarily asian) nail salons for a quick manicure ($1 per minute for a swell neck massage is the best) and as mentioned above, a \"cuppa\" at The Thinking Cup On Newbury between Clarendon and Dartmouth. You can drop some serious cash if you make your way into every designer store -- so do more looking and less buying your first walk through til you know whats there.  If you want to mingle with the millenials, have a cocktail at Sonsie between Hereford and Mass Avenue -- in the summer, the big doors are open and it is quite pleasant and a good place to people watch (though the staff seems more interesting in checking their own reflection in the silverware than in making sure you have what you need or even that you are there). For lunch or dinner -- I think i would wander away from Newbury Street -- remember when you are on Newbury you are parallel to both Boylston Street and Commonwealth Avenue. Take a right to find Commonwealth and a left to go to Boylston. If you have never been to Boston before and are walking down Newbury Street for the very first time, you are going to love it. Warning -- there is tons of construction on the street and it is a very hard place to drive if you are unfamiliar with the area. Even if you are, this is a hard place to find a parking space. Take a cab to the arlington street end and walk the afternoon away. Enjoy.",
  "bring plenty of cash if you intend to shop here....unless you stick to TJMax....CVS, OR Walgreens....it's Boston after all.",
  "Great outdoor shopping street.  Pretty diverse selection of shops..even though there are lots of high end chain stores, ie. Armani, Gucci, Channel etc..there are also lots of funky Boston-only shops as you make your way down..Things get more unique & interesting after Exeter St.  It can get pretty packed on the weekends, but it adds to the charm..lots of outdoor cafes in summer make it a good place to have a bite too.\n",
  "A lovely street to stroll along with everything from high end shops to small independent shops and cafes. Very quaint and friendly street and you could easily forget you're just minutes away from the centre of the city. Check out Trident Books and Cafe - amazing pancakes and books and gifts.",
  "Spending time on Newbury Street is a great way to spend time while in Boston.  Beautiful New England brick stores, charming streets  and some great shopping.   So many places to choose from for a quick lunch, coffee or a glass of wine.",
  "Lots of good people watching and plenty of high end stores to shop. Beautiful street to walk. Overall a fun afternoon in the city",
  "This is a must see!\nThis street has it all. There is shopping, restaurants, a lot of people... and brownstones.\nYou get the Boston feel, and all the old brownstones, without having to walk residential streets. Now, this street is busy! There are a lot of people walking around, and you move in kind of a herd at times. It's worth the visit. There is something for everyone, and so much nearby too.",
  "This and Boylston Streets form a wonderful walk to shop and browse for anything you are seeking from clothes to art to lunch, it is here."
 ]
},{
 "name": "Back Bay",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/77/70/fa/by-leatherndevil-available.jpg",
 "tags": [
  "walk",
  "historic",
  "library",
  "historic",
  "walk",
  "library",
  "walk",
  "walking",
  "walking",
  "library",
  "cheap",
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d208218-Reviews-Back_Bay-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "The back bay area maybe the jewel of Boston's nieghbourhoods after Beacon Hill. Centrally located with excellent public transport and taxi options, this quiet, clean and picturesque neighbourhood is near to Fenway Park, The Prudential centre, Boylston Street, Newbury street and the banks of the Charles River. You can walk from The Prudential centre to long wharf in just over an hour so it is very accessible to all the great sights and sounds this historic city has to offer. ",
  "The Back bay neighborhood has it all - fabulous architecture, historic churches, great shopping and restaurants, upscale hotels, an Amtrak station and the amazing Boston public library",
  "How can I express the ecstatic joy and happy feeling that walk through those streets gave us: from Boylston to Commonwealth Ave; from Copley Square and the Library to Trinity Church and the John Hancock tower. Back Bay ranges between old and new just as the rest of the city does and it's a winner. We were staying at the Park Plaza Hotel close enough to these beautiful places, and I certainly recommend this neighborhood to anyone visiting Boston.",
  "There are quite a few popular neighborhoods in Boston, so it's hard to decide where to stay...\nIf you stay in Back Bay, you can find almost everything you need in walking distance (if you're a walker). You can even walk to the North End, or a quick Uber ride can get you there quickly.\nThere is sooooo much to see in Back Bay, and you if you're in town for a short trip, you don't need a rental car.",
  "There is so much to see and do in Back Bay. Tons of restaurants and Bars. Boutique shops are plentiful as well as well known big name stores. Everything is walking distance. Staying in this area will have you in a central location. ",
  "What can you say about a visit to Boston's Back Bay?  It is a great place for locally owner guest houses, restaurants and bars.  You can spend many days just in the portion of Boston.  Visit the Boston public library is a must.",
  "I stayed almost a week in Back Bay. Learnt to like its historical sites, restaurants, stores, public transportation and good hotels. It has good vibrations all around.",
  "Spent a day in Boston Back Bay, it is so full of history and so much to do!\nIts hard to fit everything in a day n one night. Definitely need at least a full weekend! \nThere is so much History everywhere you go it's hard not to get caught up in all of it. \nThe dinning is so accommodating for everyone from picky eater to vegans to foodies. You can always find something to do wether its the aquarium or visiting Paul Reveres home to shopping. Its also nice that everything is easy to get to in walking distance or a cheap Uber. \n"
 ]
},{
 "name": "New England Aquarium",
 "address": "1 Central Wharf",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/31/a2/05/tropical-fish.jpg",
 "tags": [
  "organized",
  "walk",
  "tour",
  "kids",
  "kids",
  "field",
  "library",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103649-Reviews-New_England_Aquarium-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "So many neat exhibits including the 4 story giant cylinder tank with spiral walk around, very nice habitat for the penguins, a big touch tank with tags AND small sharks, and great viewing areas for families. We loved the penguins and the giant turtle. A very well organized and spacious aquarium with lots to see!",
  "     It was a rainy Saturday and two adults were not sure what they would encounter.  The issue in question was would two adults have an enjoyable experience at a location where there was almost a guarantee to encounter lots of young excited children.  (No disrespect is meant.  We enjoy young children but know it is a different situation when certain environmental conditions, such as a crowded venue on a rainy day, exists.)    \n\n     Our concerns were unfounded and yes we had a wonderful time,  The wonder and splendor of the exhibits made up for the plethora of strollers.  We saw sea lions and sea dragons up close and personal, spent @ a hour and a half watching the sea life in the floor to ceiling aquarium and loved every moment of  this fabulous tribute to the sea.  In fact,we enjoyed the aquarium so much that later in our trip we booked a whale watch tour through a parent organization.  I highly recommend the aquarium, rainy day or not, and would say that all visitors should plan to be amazed by this special place.\n",
  "The aquarium is a true Boston treasure with its massive main tank and surrounding exhibits, it makes for a great chance to show your kids and yourself - the greatness of this planets' sea life.  The aquarium abuts Faneuil hall and the North end making this attraction and the surrounding area a place to spend the day at.",
  "My husband and I took the day after the Super Bowl off of work - which was clearly a good choice. We decided to go into Boston and check out the aquarium just for something different to do. Plus, they have a new octopus exhibit that I wanted to see. We got a pass from our local library that let us in for $10 apiece. The normal admission is around $30, which is REALLY expensive. Since it was a cold, February Monday, there weren't too many people there. The only groups that were around were maybe three elementary school field trip groups. As soon as 1:00p hit, those kids were gone since they had to catch buses to get home. After that, it was dead. Since it was so quiet while we were there, we finished the entire aquarium in just over 2 hours; and we took our time and read a lot of the information near the tanks. We loved seeing the penguins, the giant tank in the middle, the octopuses they have (new and improved tank and it's awesome!), all of the different habitats, the touch tank and the presentations. I've lived in NH my whole life so had been to the aquarium numerous times but I had NEVER done the stingray/shark touch tank because it's always slammed. I finally got my chance and could have stood there all day petting them as they swam under my open hand. Super cool animals and really sweet staff who chatted with us and shared facts and knowledge. We had a really great time, but on a hot summer day - this place is JAMMED and at $30 apiece, it's not worth the price of admission the be miserable. Get a library pass, pick an off day, and go in the early afternoon so the field trip groups clear out. Do all that and it's a great trip!",
  "This is a very nice aquarium and well worth the drive.  I would recommend at least 3 hours to see everything - especially on weekends and holidays due to crowds.",
  "One of the best aquariums in the world with diverse displays and at least 3 different penguin colonies included. The queue to enter is very long (about a 45 minute wait is typical) but it is worth it. Not a place to go if you don’t like crowds as every display would have 5 people/square metre.",
  "So fun! Nice day to relax and explore! We were bummed there were no sharks though but we Def recommend going. It is in a great location too! ",
  "Very large and informative aquarium. There are many different species: penguins, octopus, seals, seahorses, stingrays, sharks, giant turtle and many many others. The creatures look well-treated. There are many friendly people from staff ready to answer your questions. The aquarium is well organized. It’s popular and thus a little crowded, but somehow it didn’t seem a great issue. There are many small areas to rest and observe the sealife.",
  "We have been to the aquarium a half a dozen times and always find interesting things to see there.  Next time we go, we will avoid February school vacation week though!",
  "The aquarium is a great place to visit really clean and the fish look well looked after.\nTry to get there early as it does get very busy",
  "Imax was superb and it was so huge!!!! I enjoyed my time visiting here :) \nWill get to visit again one day"
 ]
},{
 "name": "The Mapparium",
 "address": "200 Massachusetts Ave The Mary Baker Eddy Library",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/cd/c1/15/the-mapparium.jpg",
 "tags": [
  "walk",
  "library",
  "free",
  "history",
  "tour",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d144269-Reviews-The_Mapparium-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was very interesting. Amazing to see the world map of countries as they used to be. You can see and realize the changes in the current map of the world. ",
  "Although the visit is just 10 minutes, this is an amazing experience to be able to see a glass map of the world as it was back in 1935. Located inside the Mary Baker Eddy Library, the glass map is about 30 feet long and you walk inside a bridge to get a real and accurate perspective of all the countries of the world, Children will and most adults will get a kick out of the acoustics inside. Due to the glass sphere, if you whisper on one end the person on the other end will hear you clearly. Definitely recommend the visit here.",
  "The Mapparium is a fascinating exhibit that has to be experienced first-hand.  As well as being a huge inverted stained-glass globe it has very unusual acoustic properties which are good if you love the sound of your own voice!  On the trip inside you are accompanied by a guide who gives you a quick history and explains the ideas behind the Mapparium and then there is a short show that utilizes lights to bring the world to life.  It was only around $6 entry too.  No photos allowed, though they give you a free bookmark with a picture on it.",
  "Amazing visit great aspect of the world as it was and who owned what\nVery educational well worth the entry fee \nGreat guide would do it again lots to see and hear ",
  "We took this quick tour of the Mapparium. If you have time to fit it in your schedule, I highly recommend. It doesn't take long and is $6 per person. Unfortunately you can't take photos inside. It's pretty cool though once inside. It's really just like standing inside the middle of a globe. Pretty cool!",
  "This is a small attraction in Boston that you can enjoy during 15 minutes, there are some nice curiosities created during their constrution as the acoustic sounds.\nYou must visit this place!!",
  "It’s really cool and worth stopping by, but you’re not allowed to take pictures inside which really bugged me ",
  "Very interesting perspective on the World. The word unique id very much overused but this does't give you a view of the Globe three stories high from an unique vantage point. \nAlso it captures the countries at a point in time - May 1935 - and so some countries have been renamed. Good geography lesson."
 ]
},{
 "name": "Boston Children's Museum",
 "address": "308 Congress St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/a5/b8/c5/boston-children-s-museum.jpg",
 "tags": [
  "eat",
  "kids",
  "kids",
  "free",
  "active",
  "knowledgeable",
  "food",
  "kids",
  "kids",
  "library",
  "family",
  "kids",
  "library",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103646-Reviews-Boston_Children_s_Museum-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "About 4 floors of fun!!! Lots of great selections for children of all ages. From a bubble room,basketball, grocery shopping,big chess floor board, little Japanese home, barbershop, a good size section just for children 3 & under, which has an area just for crawlers and a place for the children to eat or for mothers to nurse with privacy & much more. A nice gift shop with prices for everyone and a cafe connected to the museum. Friday evening from 5-9pm price is $1/person. Plenty of parking nearby and a garage across the street. Children's Museum Boston is the place to be!",
  "My girlfriend and I were babysitting a 4 year old and decided to take her to the Children's Museum since they have an exhibit on dinosaurs and she currently loves dinos. She had a fun time climbing up and down the \"jungle gym\" that greets you in the lobby as well as checking out the dinos, climbing around in the construction zone and checking out all of the other exhibits.\n\nYou can easily spend an afternoon here and get the kids tired out. There is so much to see and do for kids and some great moments for parents to bond with their children.",
  "Our sons are 5 and 8 and they absolutely loved this museum! What was especially great is that all the exhibits were very hands on, and so, really fantastic for kids in that mid age range. They especially loved the science area, and the door to ceiling climbing install was amazing! The adults found the Japanese house particularly worth the visit, the the kids also enjoyed it and asked a ton of questions that the knowledgeable attendant was more than happy to answer! It's also great that they offered free admission to active teachers. We will definitely be back!",
  "There are many interesting exhibits with a hands on approach to learning. The museum is busy much of the time, so keep a close eye, especially on younger children.",
  "Do go with yours kids. Lots of places inside to explore, drive a mock plane, a tent, science place, climbing, bubble place (and the live turtle near it), etc. Do take own food as it will help after kids jump and run around! It's one of the small Disney with kids in best spirits around! (it's $1 entry after 5pm till 9pm on Fri)",
  "A treasure in the city. Watch for discount passes, use your library museum pass etc.  Go early to find street parking on a weekend otherwise garage is around the corner and is validated in museum. Special programs always available. Don't try to do it all in one visit or you and your kids will be miserable.",
  "My family and I loved it here definitely recommend this place if you have children it has heaps of fun this for them to do you can join in on the fun too",
  "Although pricey, the Museum is wonderful and so much fun! The only negative experience was the scam at Farnsworth Garage, which the museum provides parking validation for. The cost is supposed to be $25 but the garage charged us $38 and the attendant there claimed our validation was no good. The attendant offered no solution for us and was extremely rude. We quickly let the Museum know of this issue and they were very attentive about it. I advise avoiding this parking garage but if you must park here and run into an issue make sure to let the Museum know. Here is the number for the manager at the garage, Duvante: 857-237-8756",
  "Spent the day at the Boston Children’s museum. There is a lot of hands exhibits for kids to interact with.\nWe went on a Monday holiday and the place was packed. Next time I would not go on a holiday.\nThey have a nice gift shop, but felt like it was geared for younger children.\nMake sure to see if your library offers museum passes, it will save you some money.",
  "Our 3.5 yo son loved it. Suitable probably even more for slightly older children. Quite expensive though given it’s basically a giant indoor (albeit fun) playground for kids. ",
  "So much to do  all sorts of room s for make believe  \nClimbing —dancing —barber shop —car repair —school room  \na snake ——\nAnd there are people complaining there isn’t much to do—-\nThose are the people who will not like heaven !!!!!!\nLittle kids playing with water 💧 \nEtc \nlook at the website look what is available\nAnd pick a few to visit \nIt s great. It is not the Taj Mahal or an arcade it is for young children \nLol😂🤣😄😃😀"
 ]
},{
 "name": "Old North Church & Historic Site",
 "address": "193 Salem St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/8c/6e/7c/this-spire-is-a-most.jpg",
 "tags": [
  "tour",
  "history",
  "history",
  "historic",
  "unique",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104871-Reviews-Old_North_Church_Historic_Site-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Bell Tower Tour is a great addition to a visit to the Old North Church, the church from which the \"two if by sea\" lanterns made famous by Henry Longfellow Wadsworth's poem \"The Midnight Ride of Paul Revere.\" In addition to admission to the church which includes an informative presentation by a docent, you also get to climb the stairs to the bell tower. Be warned - the steps are steep and there's curve, but it's manageable unless you really are not able to climb stairs normally. Unfortunately, the stairs are not original to the church, and the minister who hung the lanterns from the bell tower that fateful night climbed a series of internal ladders that no longer exist, but the area you visit on the tour is the area from which the bells are still rung.  Additionally, the tour takes you underground, into the original crypt and  the docent provides intriguing details about its inhabitants. ",
  "This church Is  preserved beautifully,  I loved seeing the pew boxes and reading the names, there is a wonderful gift shop as well and they let you explore at your own pace, everyone was friendly. ",
  "While the Freedom Trail offers a great overview of early colonial/ revolutionary war history, the North church provides the spiritual sense of the entire endeavor, as well as an appreciation for the sacrifice and risk these men dealt with. This is in my opinion the one absolute thing on the trail not to be missed. Be sure to listen to the talks which are given while sitting in the pews. Helps to understand the history.",
  "This was really an amazing experience.  I am very into history, so I found seeing where the lanterns were placed to warn the riders to warn the militia the regulars, not the British, were coming by sea.  This eventually led to the fighting at Lexington and Concord.  Paul Revere contributed, but there were other riders who deserve credit.  The church was also very nice and was on the Freedom Trail.",
  "The staff was very informative- beautiful old church. Lots of stories surrounding the church of you take the time to listen to the staff. Glad we stopped!",
  "This is a small historic place to visit during your stay in Boston to know more about the story and smell their peacefulness.",
  "This church is stunning and so historical, just wandered about taking in its beauty. Definitely worth a visit",
  "We loved the Behind the Scenes tour. The church is very unique. The staff members were friendly and helpful. My 10 year old son thought it was cool to see the crypt, bell ringing chamber and colonial chocolate demonstration."
 ]
},{
 "name": "HarborWalk",
 "address": "Harborwalk",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/33/11/66/photo9jpg.jpg",
 "tags": [
  "walk",
  "pets",
  "walk",
  "tour",
  "walking",
  "walk",
  "history",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d1145361-Reviews-HarborWalk-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Easy walk along the river that anyone can do. Area Residents jog or walk their pets. Very peaceful and away from the hustle and bustle.",
  "The HarborWalk is not at all obvious as a pedestrian attraction, but it does indeed provide some of the best views of Boston as it winds its way around. \n\nThe full walk as listed on their map is far larger than most people will be interested in walking, but the best part is the section that starts on the eastern edge of the North End, works its way around Boston Harbor past Quincy Market and the New England Aquarium, goes right through the tour boats and nice restaurants around Rowe's Wharf, and finally crosses the Fort Point channel over to the Federal Courthouse where you will get the most amazing views of Boston.\n\nThe HarborWalk isn't really anything more than a wide, paved pedestrian walkway that follows the edge of Boston Harbor.  It doesn't have any specific shops or restaurants and in some places you will be walking through mainly residential areas.\n\nThe entire pathway is paved and clear enough for a child to ride a bicycle along the path as well.",
  "Followed the Freedom trail here and got the opportunity to to see plenty of historical museums and areas.  The USS Constitution is berthed here and several areas managed by the National Park Service.  Take the time to visit here, you won't regret it!",
  "We took the opportunity to walk a fair section of the Harbour Walk whilst staying in Boston and felt it gave us a good impression of both old and new Boston as well as some of the history.",
  "Our tour guide told us about the walk, and at the time, we were stunned by how long it is. We decided to try and see how long we could walk it for, and found that a couple of hours was enough for us. The view is spectacular, it's a nice, relaxing walk, and it's definitely worth a shot."
 ]
},{
 "name": "Castle Island",
 "address": "2010 William J Day Blvd end of Carson Beach, on Pleasure Bay",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/7d/79/df/fort-independence-castle.jpg",
 "tags": [
  "kids",
  "walk",
  "tour",
  "tour",
  "walking",
  "food",
  "walk",
  "walking",
  "walk",
  "eat",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d103642-Reviews-Castle_Island-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a fantastic place to take a stroll and watch the planes land at Logan, grab a quick bite at Sullivan's and watch the boats in Boston Harbor, or just people watch.  The walk around the perimeter of Castle Island (just over 2 miles) is a nice stretch of the legs.  There is also a nice playground for the kids to burn off some energy, and when Fort Independence is open, you can take a tour.",
  "Wanted to be on the water today but didn’t have the time to go down to the Cape. This was a great afternoon, packed a lunch, walked around took in the sights. Very accessible and plenty of parking. Perfect for place to watch the planes takeoff and land for any airplane fans. ",
  "Although parking can be crowded, you can always get a spot. People are coming and going at all times.\nThere are so many things to see and do. Not to mention eating at Sullivan’s - their hot dogs are well know. \n\nActivities include: watching airplanes fly right over your head into Logan airport, Boston., walking paths, biking, skate boarding, watching boats in/out of Boston harbor, tour of the castle, or just people watching.\n\nGreat outdoor place for young and old!",
  "Don't forget to sight see this area, it is truly a gem!  Don't forget to take a drive up to the L St. Tavern for a pint, the scene from Good Will Hunting movie!",
  "This was the first time I had ever been to the ocean and it was definitely the place to go.  Calm water, serene atmosphere, beautiful castle. The weather was a little cold though, but still incredible!!!!!",
  "I am a water baby and decided to go for the day.  Imagine my surprise when I see two juvenile eagles.  I waited long enough to see at least one parent.  I'll definitely be back.",
  "We enjoyed walking in the area and watching the boats. There is a small restaurant you can walk to but it is only outdoor seating. Good food and reasonable prices.",
  "Wonderful view of the many islands in Boston Harbor. Great place to watch planes land at Logan Airport. The fort dates back to the original fort (1634) know as “The Castle.” A lot of history attached to this site - of course, it IS Boston! Great walk around the fort itself. Lots of activities - a small beach, sailing, picnicking, playground. Can also grab something to eat st Sullivan’s. Long lines on Sunday afternoon when we were there. Great spot! Worth a visit. "
 ]
},{
 "name": "Skywalk Observatory",
 "address": "800 Boylston Street Prudential Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/dc/0e/41/vue-du-50e-etage.jpg",
 "tags": [
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d603296-Reviews-Skywalk_Observatory-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "As far as I know, this is the highest publicly-accessible observation deck in Boston. It provides great views of the city. The are a lot of informative materials. The staff is friendly. The deck isn’t crowded. Even though the deck’s lights are dimmed after sunset, it’s not easy to take photos due to reflections, but it’s an issue for most of the observation decks, not just this one. If you have troubles taking photos, just watch, enjoy and remember :)",
  "Great views 360 degrees around the whole tower, lots of educational displays and short movies about history of boston, etc. It’s all indoor, which makes it nice year-round, but for me to give the 5th star it would need the addition of an outdoor section (even if it was a small one) to get the full raw experience of being up that high and fully soaking in the city view. Good activity for an hour or two, worth it.",
  "Loved our visit here, definitely worth the entrance fee. The staff were very friendly and helpful and the audio device you carry around explains both the history and views as you look out over the city and surrounding areas. We had a beautiful sunny morning when we visited so could really see for miles. My daughter asked if she could use her UK student card for discount and this was easily accepted. Lots of information on how Boston was built with immigrants from all over the world, and continues this tradition now. Very poignant in today's climate.",
  "Sadly the skywalk will soon be closed but the views up top were amazing and we received top notch service form the staff!",
  "I don’t think this would have been on our radar if it hadn’t been for the CityPass. I went about an hour before sunset on a weekday and it was quite quiet and so we got some good views. Simple concept. The included audio guide is essential to get any real value out of the visit. However I would have liked some more skyline pictures or staff to point out things to help pick out key buildings to have made this a five star. "
 ]
},{
 "name": "Bunker Hill Monument",
 "address": "Monument Square Charlestown",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/26/2d/97/bunker-hill-monument.jpg",
 "tags": [
  "free",
  "tour",
  "walk",
  "history",
  "walking",
  "free",
  "kids",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d133763-Reviews-Bunker_Hill_Monument-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "I recommend starting at the beginning of the Freedom Trail and working your way here. While Bunker Hill is great by itself, it gives one a better understanding and appreciation of all the parts that led to this battle on Breed's Hill (yes, I said Breed's). Stop by the museum across the street first to explore and get tickets to climb the stairs up the middle of the monument. It's free but usually requires tickets. The monument is great from the outside and inside. Inside at the top gives you a great perspective of the surrounding area. Even today you can see how prominent the Old North Church is and why it was used as a beacon in 1775. By the way, if you're not keen on climbing stairs or heights, the trip is still worth it. ",
  "Right on the Freedom trail you can climb the 294 steps to the top of this monument and get a great view of Boston.",
  "My husband and I stopped here towards the end of our Freedom Trail tour. We did the tour on our own finding information from the Freedom Trail website. It is thorough and informative and allowed us to skip purchasing a tour for the day! \n\nBunker Hill was the first major battle in the Revolutionary War and was technically a lose for the colonists. It did, however, show the British Army that the colonists had fight in them and would actually be a worthy opponent. This is also the same battle where it is purported that Colonel Prescott said, \"don't shoot until you see the whites of their eyes!\" \n\nWe had the good luck of coming right when a demonstration of shooting a musket was about to start. It was the very last one of the day and the last one of the year. We got a realistic idea of how long it takes to load and shoot the musket and how easy it is to misfire (which can be due to a host of reasons). It was really cool to see but also make you realize just how difficult and crazy it was to fight in this war. This was a great and informative stop on the Freedom Trail!",
  "It was a steep climb up the stairs going up.  In the end, however, it was worth it to get a view of the surrounding.  I also think it is a great tribute to those who fought for our independence (even though that wasn't the goal in 1775).  It was a bloody affair that ended in the Americans losing.  Even though they were victorious, the British felt that they had lost because of the high casualties they suffered.  A great place overall.",
  "Great monument on the site of very important battle. There are awesome views from the top,  but be aware there isn’t any elevator - you should climb the stairs. Very friendly rangers downstairs are ready to provide any information.",
  "This is worth visiting, especially if you've committed to part of the Freedom Trail. I loved walking the neighborhoods and having a summit at the end of the journey. It felt like a great conclusion. \nI would recommend visiting this place, even without the trail. It only takes a short time to walk around the monument and visit the museum across the street. It puts history in perspective when you can see these places. Plus, it's very pretty.",
  "This is a very nice monument. You can climb to the top for free. It is 294 steps to the top but well worth the view! The stairs are spiraling against the outside wall of the inside and well lit. ",
  "Climb was a lot of fun.  Did it with kids 5-12. Rangers were very knowledgeable and friendly. Great views of city"
 ]
},{
 "name": "New England Holocaust Memorial",
 "address": "Between Congress and Union Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/8a/b9/fd/20150521-125015-largejpg.jpg",
 "tags": [
  "history",
  "free",
  "walking",
  "free",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104794-Reviews-New_England_Holocaust_Memorial-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located right off of the Freedom Trail and within steps of Fanieul Hall, the New England Holocaust Memorial is both striking and moving.  It is an immersive experience in that you can read quotes and a short history and timeline of the Holocaust, and then physically enter the towering transparent memorial itself, each tower inscribed with identification numbers representing the multitudes murdered in each of the six death camps, as a foggy mist rises up all around you.  In the midst of the bustling city on a beautify spring day, this was an opportunity for quiet reflection, and an important teaching moment for our young son.  Seeing the numbers rising up multiple stories above our heads in each of the six towers gave a quantification that I don't think can really be appreciated when you simply hear the words \"six million\".  Seeing six million identification numbers, rising up far above your head and surrounding you, provides a visualization of the amount of devastation and human loss that mere numeric statement can't possibly offer.  ",
  "This memorial is very tasteful and pays a beautiful tribute to one of humanity's darkest hours. For those who know little about the holocaust there is good education and for those who are familiar with it the memorial reminds the terrible cost the Jewish race paid at the hands of a madman. ",
  "This is a free memorial on the street.The glass towers have numbers of holocaust victims etched into them.The numbers go all the way to the top and sides.Each tower represents an individual concentration camp.Difficult to not feel the sense of tragedy and loss.",
  "I think I walked by this memorial at least 3 times before I realized it was a memorial. At first, I thought it was a cool exhibit built into a small park. It's very pretty, modern, and interesting.\nIt's actually profound. I'm glad I pulled up things to see in the area, and I realized what it represented. I recommend walking through it.",
  "This is a must visit memorial in Boston, it was carefully designed and you can feel the pain for all the people suffered during this historic age.\nShould visit as this is also free.",
  "This is a very thought provoking and powerful memorial. Take time to read the words of the survivors, as some are truly touching. There is no entry fee and it’s just off Quincy Market so not far to walk.",
  "This made me cry, but I think everyone should visit here and Ly respect to all those souls who were robbed. Bless them all... go ... read... respect",
  "Came upon this by accident.We read through the inscriptions and were very moved, then we saw all the numbers etched on each panel relating to every person, how very very sad, yet a wonderful tribute."
 ]
},{
 "name": "Arnold Arboretum",
 "address": "125 Arborway Jamaica Plain",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/14/93/3c/arnold-arboretum.jpg",
 "tags": [
  "walk",
  "walking",
  "walk",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d104571-Reviews-Arnold_Arboretum-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have visited Arnold Arboretum in every season and it is always such a wonderful experience! There are various sections within the park that showcase trees from around the world:  evergreen trees, swampy area with rushes, magnolias, lilac hill that always blooms around Mother's Day, trees from Asia and cork trees from Portugal, linden trees and climbers, hill with birches and bonsai collection, maples and oaks, beech trees - one can explore and always be surprised by something new! The park is a part of Emerald Necklace and is a continuation of green belt around Jamaica Pond and Muddy River. There are several entrances to the park with limited parking, in season there are several portable restrooms and water fountains throughout the park. Dogs are welcome. Hunnewell Building hosts Visitors Center with some education displays and staff to answer questions, share maps etc. This is a trip not to be missed when in Boston.",
  "During Week #1 of vacation with a friend from the South Shore of Massachusetts, we took a daytrip to Arnold Arboretum.  It had been on my wish list of places to go in the Boston suburbs for quite awhile after I moved away from that area.  \n\nThe arboretum is the second largest park in Boston’s Emerald Necklace.   \n\nFrederick Law Olmsted designed the 280+ acre park which has about 15,000 trees, shrubs and plants.\n\nWe got a driving permit from the office at the Hunnewell Visitor Center as I have one tricky knee, and my friend has had two knee replacements that haven’t helped much.  With the permit, we were able to visit most of the arboretum and were able to get out of the car and walk a bit here and there. \n\nOur visit was in mid-June.  We were surprised at the number of trees and shrubs in bloom at that time\n\nWe found the variety of trees and shrubs from various countries to be very interesting as we’d never seen about half of what the arboretum had even though we’d been to many famous gardens throughout the US.  \n\nEven with the aid of an SUV, it took us over 3 hours to get around to see everything.  This could easily be a whole day affair for those who plan to walk the arboretum.  Picnicking is allowed.     \n\nOur favorite areas included the Bradley Rosaceous Collection, the Mountain Laurels section on Hemlock Hill Road, and the Rhododendrons on the Rhododendron Path.\n \nWe really enjoyed our visit and plan to return during a different season to see other trees and shrubs in bloom.  \n\nParking near the entrance close to the Hunnewell Visitor Center is limited.  There are a couple of handicapped parking spaces and about five others.\n\nWe rate the Arnold Arboretum at 5.0.   We highly recommend a visit.\n \nIf you found this review helpful, please click THANK below.",
  "Our favorite open space in Boston is the Arnold Arboretum.  There are lots of beautiful trails, and an incredible variety of trees and plants to enjoy throughout the good weather months of the year.  The special celebration known as Lilac Sunday (usually on Mother's Day) is a fabulous take; so many varieties of lilacs to enjoy, and the scent is wonderful.  One thing about that day, though: don't even think about trying to park nearby.  Take an Uber.",
  "It is a very beautiful park especially for foliage. While it is nearby downtown you still can got chance to find parking slot on weekend. I pretty enjoyed walking around there.",
  "I have visited Arnold Arboretum in every season and it is always such a wonderful experience! There are various sections within the park that showcase trees from around the world:  evergreen trees, swampy area with rushes, magnolias, lilac hill that always blooms around Mother's Day, trees from Asia and cork trees from Portugal, linden trees and climbers, hill with birches and bonsai collection, maples and oaks, beech trees - one can explore and always be surprised by something new! The park is a part of Emerald Necklace and is a continuation of green belt around Jamaica Pond and Muddy River. There are several entrances to the park with limited parking, in season there are several portable restrooms and water fountains throughout the park. Dogs are welcome. Hunnewell Building hosts Visitors Center with some education displays and staff to answer questions, share maps etc. This is a trip not to be missed when in Boston.",
  "An amazing place to visit- such a beautifully tended garden. You can spend all day walking the paths and seeing flora from around the world. It is ike a trip to different climates and continents. Beautiful place for a walk, an picnic, a nap, a dog walk.",
  "It's an easy walk from Forest Hills T stop to reach one of the side entrances to the arboretum. There are plenty of walk to take, make sure to head to the visitor center to grab a map and plan your walk. It's a great contrast to the buzz of the city - worth it for a quiet afternoon.",
  "Great place, great trees, and great fun. That about sums up my experience. I had a blast. Everyone should visit. "
 ]
},{
 "name": "Charles River Esplanade",
 "address": "Storrow Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/f4/09/83/photo3jpg.jpg",
 "tags": [
  "free",
  "walking",
  "walk",
  "tour",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60745-d142572-Reviews-Charles_River_Esplanade-Boston_Massachusetts.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Esplanade comes alive in the spring, summer and fall with free concerts for families and couples, and the Fourth of July fireworks can easily be seen from this location. Bring your blanket and a picnic basket, and you are in for an old fashioned great time here. ",
  "The Charles River Esplanade is great for running, walking, or just taking it in.  Nicely laid out for a various run lengths.",
  "Along the magnificent Charles River, by Community Boating, in downtown Boston, hear the great Boston Pops, or attend the 4th of July Fireworks, or take a stroll or jog in any season, this is quintessential Boston. ",
  "We've been to the Charles River Esplanade many times.  The 4th of July Concert is a must if your visiting Boston.  Bring plenty of sunscreen - bring your lunch and blanket and enjoy the concert and fireworks.  Be sure and take public transit, no parking at the Esplanade.\n",
  "This is my favorite place in Boston! It's pretty, beautiful, peaceful and still right in the middle of civilization where you can hear the cars swooshing in the background. It is a must visit, either during sunset or late in the night.",
  "This is a really nice park, right along the Charles. You can walk (or run) for miles with no interruptions or breaks. Just watch out for the bikes which may come up behind you rather suddenly. Perfect place to stretch your legs, and easily accessible from Back Bay or the Cambridge side of the river.",
  "A little way off the hustle and bustle of the city, Charles River Esplanade flatters the senses of the visitors by its beauty of greens, the sparkle of the river surface, the sound of the birds as well as the smell of the wind. I think this is one of the best spots if you'd like a moment to relax during a tour in Boston.",
  "i saw the river while driving through the city...quite a calm place with birds flying around...people jogging and boats in the river",
  "We visited in winter and although cold it was beautiful. well worth visiting. Lots of photo opportunities",
  "I visit Boston frequently, and every time I am there I run and/or walk on the Esplanade. The river is beautiful, and the path is always full of people especially when the weather is nice. In the summer, there are always lots boats on the river and crew teams rowing. A must do when in Boston!",
  "do the whole Charles River Basin- walk the Esplanade and see the joggers, roller blades, performers, Pops, go across any one of the bridges to the Cambridge side and walk back on the Memorial Drive Side, part the Museum of Science (with a stop at Cheesecake Factory?)."
 ]
}]
