[
{
 "name": "Nevada State Museum",
 "address": "600 N Carson St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/2c/2f/4a/old-mint-building.jpg",
 "tags": [
  "free",
  "history",
  "walking",
  "walk",
  "free",
  "history",
  "learn",
  "walk",
  "unique",
  "family",
  "tour",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d103297-Reviews-Nevada_State_Museum-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent most of the morning learning about mining, mining towns and minerals, native americans, minting coins, native plants and animals and many other subjects. Very well done!",
  "Great coverage of Nevada's history of native Americans, mining, early settlers, and minting of gold and silver coins. Extensive rock and mineral exhibits showing raw gold and silver ore. Plus exhibits of pioneer life style and hardships they faced settling in the area. You are able to walk through the original mint and view a working coin press, and an extensive display of examples of silver and gold dollar coins from about 1850 to early 1900s. Children and adults will enjoy walking through a life like underground gold mine.   Open 8:30 am - 4:30 pm, Tuesday through Sunday. Adults $8, under 17 free.",
  "We stopped here because of all the great reviews I had read about the museum. And they were right. Admission is $8 and parking is free.  The first floor has a small section on Native American heritage.  At the other end is a wonderful ghost town where you can listen to an old miner retelling its history, and then walk through to the mint and coin press. On the second floor there are geology and animal exhibits and a section on Nevada history. Our favorite part was the mine exhibit in the basement. It was very interesting to explore the mine shaft and learn about the variety of jobs the miners had. And how much timber it took to build the shafts and keep them shored up. This museum may be small but it contains a lot of Nevada history and it is very well done.",
  "We went on a Saturday when the original coin mint was operating. A silver commemorative coin, pressed on the machine first used in the 1800s, was available for sale...a great memento. The docents operating the mint were informative and the rest of the exhibits were well presented and extensive. There is an elevator for use between floors for those preferring not to take the stairs.",
  "I'm not a museum type visiting person, but my wife and I stopped by there and spent and enjoyable couple of hours..clean, interesting and run by nice people.  Don't drive by if you are in Carson City without a stop...you will enjoy the eperience.",
  "If you are really looking for a museum that shows Nevada, then this is it.  Yes, the building looks small, but inside it has multiple floors (including a basement) that has a walkthrough mine.  The old west town is themed perfectly and gives you chills as you see some of the artifacts from the wild west.\n\nThis museum also presses real silver (and sometimes gold) coins from the original Carson City mint press here (check the schedule).  I wasn't expecting much of this museum, but was quite surprised at how much they really packed in here.  Definitely worth going at least once...",
  "We spent most of the morning learning about mining, mining towns and minerals, native americans, minting coins, native plants and animals and many other subjects. Very well done!",
  "Well run museum with a dedicated staff and volunteers.  We enjoyed the wide range of displays, especially the coin area with its unique coin press.  Someone from California recommended the museum so we made a point of going to Carson City to see it instead of just driving through the town on our way someplace else.  We highly recommend a visit there.",
  "Hadn’t been there in a few years. We had family in from California and took them there. There were a lot of new exhibits along with some of the favorites we had seen before. We had such a good time and our family really enjoyed it.",
  "Although we live in Carson City, it's been over 20 years since we last visited the museum and it has changed a lot --- and for the better. I decided to take my two younger granddaughters there for a short learning experience as at their age two hours is long enough for anything like this. We got into the building just before a guided tour of the mint itself and it was most interesting. We learned how hot it was to work in there in the 1800's with no air conditioning, outside air temperature around 100 degrees, as steam engine for electricity and the hot furnaces to work the metals. We learned how the coins were pressed and then the weighing process to assure each coin was the exact weight. Those to light were sent back to be reprocessed and those to heavy were trimmed by the women who worked their. Interesting also was the fact that their uniforms were burned periodically to recover the gold and silver dust that had accumulated in the cloth. During the restrengthing of the building after an earthquake, an exact model of a gold mine tunnel was constructed in the basement. By then we only had a few minutes to look at some of the Paiute Indian exhibit but did enjoy some of their basket work and a 1903 photograph of a family and their shelter. Looking forward to our next visit and learning more.",
  "Best bang for the buck.  good for both kids and adults.  small, but very informative and well designed."
 ]
},{
 "name": "Nevada State Railroad Museum",
 "address": "2180 S Carson St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/58/9d/41/nevada-state-railroad.jpg",
 "tags": [
  "historic",
  "kids",
  "history",
  "knowledgeable",
  "knowledgeable",
  "unique",
  "knowledgeable",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104067-Reviews-Nevada_State_Railroad_Museum-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Museum has a wonderful selection of historic RR artifacts including steam locomotives Dayton,Inyo and #25, McKeen and Edwards motorcars and Coach 17 from the “Golden Spike” ceremony at Promontory Summit in Utah as well as several other rolling stock pieces. On selected days kids and adults alike can get up close and take a short ride on one of the authentic trains. It is a wonderful place with a friendly staff who welcome questions and love to discuss the museum pieces. Ask about the locomotive with no brakes!",
  "Became a member and  when I visit my Grands I take them on a train ride and into the Museum to look at the trains...",
  "The Nevada State Railroad Museum has several old steam locomotives and rail cars on display as well as many other railroad items of interest.  ",
  "We've been to several railroad museums, and none of them seem to disappoint.  This one, however, might top all of the others due to its historical values.  \n\nWe arrived when they opened at 9am, and were promptly greeted.  Upon entering one of the docents spoke with us for about 15-20 minutes.  Most of the trains on the grounds had been used by Paramount in a lot of movies.  I think the most notable was the Inyo #22 engine that was used mainly by John Wayne.  Another thing that was very neat to see was the actual rail car that carried the golden spike for the first transcontinental railroad May 10, 1869.\n\nOut back there is another building that housed numerous other engines and cars.  This is definitely a must see, even if you don't like trains too much.  Most of the visit is self guided, but there are docents there to give you a history of everything in the museum.",
  "Our trip to the NSRM was wonderful. The staff were knowledgeable and friendly. The grounds were impeccable and the displays were awesome. We'll definitely visit again.",
  "We decided to take our three grandsons for a day outing and could not have had a better time.  The staff is extremely knowledgeable and willing to talk to everyone.  The only disappointing part was we visited during the week and there were no train rides available; however, we plan to go back because the boys want \"a train ride\".",
  "Lynn and I and friends recently spent a couple of hours at the Nevada State Railroad Museum. The West is popular for numerous railroad museums and this one is one of the best. There are 3 steam engines under one roof.   They are in meticulous condition. As a matter of fact while we were there one of the volunteers was lovingly polishing the brass. There is an opportunity for a short ride on one of the unique trains as well. There are maps of rail routes on the floor that are quite interesting. Additionally there is a station and a large garage building housing even more trains that are in various stages of restoration...and an outside boneyard of derelict train cars awaiting restoration. The volunteers appear to be rail junkies and are quite knowledgeable. This museum was a favorite stop on this trip. Admission for adults was $8.00 which seems to be a favorite admission price for Nevada State run museums. ",
  "For train buffs, this is a very nice collection of several steam engines, touring cars, turning table, and even a working handcar that four people can operate to get the feeling of the rails. The museum contains collections of scaled model trains complete with an engine and assorted cars. The museum store has various memorabilia for visitors to consider. Rides to Gold Hill and Virginia City are also available. A lar.ge tour group was easily accommodated. Docents are on site. Be sure to bring your camera."
 ]
},{
 "name": "Nevada State Capitol Building",
 "address": "101 N Carson St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/7e/3c/7a/nevada-state-capitol.jpg",
 "tags": [
  "history",
  "historic",
  "food",
  "history",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d3619312-Reviews-Nevada_State_Capitol_Building-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nevada’s State Capitol is amazing, elegant and rich in history and class. The staff is almost as amazing as the architecture.",
  "Road trip!  Today we visited our 46th state capitol. This historic building is beautiful and is a must see!",
  "This is a tiny cafeteria with a minimal, but inexpensive menu. Food isn't wonderful and atmosphere is different, being inside the building where the state legislators meet, so that makes it worthwhile. ",
  "A fun place to visit. It's great that our government buildings are so accessible. The museum inside is rich in history and interesting exhibits",
  "Like most Capital Buildings Nevada's is no different, it is a work of art. The museum on the second floor tells the history of Nevada and all its struggles through the years.\nWell worth seeing."
 ]
},{
 "name": "Casino Fandango",
 "address": "3800 S Carson St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e6/9c/ad/the-casino-entrance.jpg",
 "tags": [
  "eat",
  "food",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d501211-Reviews-Casino_Fandango-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "This local casino in Carson City is a great place to play and eat. Love the sushi bar and we go to the movie theater (connected by sky bridge) frequently.",
  "Coffee shop food doesn't taste like my experience with casino coffee shops because the food is excellent.  Big spacious casino which allows for air to be cleaner without choking on smoke.",
  "Fandango is a fun place to go with your significant other. There are multiple restaurants to choose from and all are good. On the weekends they have live entertainment in the casino and its fun to dance, and play a few slot machines or card games. Try it, you’ll like it!",
  "The smell of popcorn is real. The different Theaters are decent. Nothing special either good or bad.",
  "Always good food and lots of it. We always get two meals by taking leftovers home for next day.BB has many locations around California and Nevada. Always a good place to eat and you know that they are always going to be the same."
 ]
},{
 "name": "Governor's Mansion",
 "address": "606 Mountain St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/d2/5f/11/governor-s-mansion.jpg",
 "tags": [
  "walking",
  "walk",
  "tour",
  "learn",
  "walking",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d103293-Reviews-Governor_s_Mansion-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "As we drove by, I was struck by the natural beauty of the well kept grounds.\n\nThe mansion is also very impressive and while one is unable to go inside, one can tell that their is a state's pride in this building that is also a home.\n\nTake a drive to view it, it will be worthwhile",
  " Beautifully done, in the heart of the old  of the old section of Carson City. Halloween  a favorite as the Governor and wife give out the candy to the little goblins.",
  "The State of Nevada Governor's Mansion is located about four blocks away from the Nevada State Capitol. I enjoyed seeing it but am not positive that were I on foot walking the walk would be worth the effort. Why I ponder does anyone need such an elaborate mansion.",
  "A very nice tour and a lot of things to learn. The mansion is beautiful! I also rented the hall for a fashion show my salon put on for s non profit organization. The staff at the mansion were very helpful and really nice to work with. It was a wonderful experience.",
  "Great place to visit nd see. Biking around the area and talking to the locals is the best. We usually have lunch while walking the streets.",
  "Great tour and lovely grounds.  This is not necessarily open to the public for inside tours.  Only on select days and holidays.  They do a really nice job for Christmas and the Capitalis right down the street which they also do up for the holidays.",
  "As we drove by, I was struck by the natural beauty of the well kept grounds.\n\nThe mansion is also very impressive and while one is unable to go inside, one can tell that their is a state's pride in this building that is also a home.\n\nTake a drive to view it, it will be worthwhile",
  "Nice large house but I don't know if I'd like to live in it. With tourists driving by all the time. Here are a few other houses in the area too. And the centennial tree"
 ]
},{
 "name": "Washoe Lake State Park",
 "address": "4855 Eastlake Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/f0/f1/de/dune-trek-trail.jpg",
 "tags": [
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d7211669-Reviews-Washoe_Lake_State_Park-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our visit here was very short since there seems to be little to see or do in the winter months. Perhaps the summer would be more entertaining",
  "I visit Washoe Lake State Park a lot. There is an irrigated field parallel to some of the park where deer often graze and rest. While I haven't yet kayaked in Washoe Lake, I plan to. There are facilities at the park that make it convenient if you want to say a while for a picnic or even camp where camping is allowed. You could spend less than hour, several hours or even days at the park.",
  " Stayed on Loop A. W/E at reasonable price. Very clean and well taken care of park. Approx 30 min to Lake Tahoe and Reno. Wild horses everywhere. Park staff was very friendly and helpful ",
  "The view was beautiful, it was quiet, but the camp sites need a little more clearing. It has showers and clean toilets. ",
  "Drove past this park on the interstate. It gives you access to a number of trails and a reasonable place to stopover with an RV"
 ]
},{
 "name": "Bowers Mansion Regional Park",
 "address": "4005 Bowers Mansion Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/d3/17/9b/bowers-mansion-in-the.jpg",
 "tags": [
  "tour",
  "family",
  "tour",
  "kids",
  "tour",
  "tour",
  "family",
  "tour",
  "kids",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d558626-Reviews-Bowers_Mansion_Regional_Park-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "I haven't been able to tour the Bowers Mansion yet, but I've been to family reunions there and I also sometimes stop and just read there. There is a lot of picnic area and a swimming pool. The park is well-maintained and there is plenty of parking.",
  "We all know Mrs. Bowers was into the Mystic, and also died broke, but left us a wonderful mansion and park.  The grounds have a large outdoor pool great for kids and adults.  They also have BBQ facilities for cooking.  And the mansion is fun to tour, built with Comstock silver money.  Situated in Washoe Valley it is away from city life, quiet, and great views.  They also have concerts in the summer that are well worth the visit.  Go and relax, very safe, and well maintained.  A can't miss.",
  "Weekend tour of an extremely-well-preserved mansion with both a joyous and tragic, storied past, beginning in the 1850s. Silver riches built the mansion and when the mine played out, Sandy and Eilley Bowers became poor as quickly as they became rich. Subsequent owners wanted to turn its grounds and pools into a public park. With a $1 down payment, civic-minded Reno women raised $25,000 to save the estate. Washoe County paid the remaining $75,000 and the mansion and grounds became a regional park. The mansion tour, summer swimming, picnicking, and stellar views from the hillside grave site are well worth the detour.",
  "I haven't been able to tour the Bowers Mansion yet, but I've been to family reunions there and I also sometimes stop and just read there. There is a lot of picnic area and a swimming pool. The park is well-maintained and there is plenty of parking.",
  "We came up here on a Thursday and it’s closed the sign says tours in the mansion is only open on weekends.   See our photo. ",
  "We all know Mrs. Bowers was into the Mystic, and also died broke, but left us a wonderful mansion and park.  The grounds have a large outdoor pool great for kids and adults.  They also have BBQ facilities for cooking.  And the mansion is fun to tour, built with Comstock silver money.  Situated in Washoe Valley it is away from city life, quiet, and great views.  They also have concerts in the summer that are well worth the visit.  Go and relax, very safe, and well maintained.  A can't miss.",
  "But that being said, I'm still glad we stopped here.  Lovely old mansion, grounds are beautiful, huge picnic area and pool which closes on Labor day. Interesting reading about the mansion and it's occupants. Would definitely love to see the inside",
  "We came across this museum when we were looking for haunted houses, although it isn't haunted it has quite a history for Nevada.  Very beautiful and somewhat restored.  Worth the tour."
 ]
},{
 "name": "Kit Carson Trail",
 "address": "Carson St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/9e/90/43/kit-carson-trail.jpg",
 "tags": [
  "walking",
  "walk",
  "walking",
  "walk",
  "historic",
  "history",
  "historic",
  "walk",
  "tour",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d3870425-Reviews-Kit_Carson_Trail-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place. Walk the buildings and downtown for eats and drinks. So many things to see and do in the city. Walking /biking is the best",
  "We spent a couple of hours walking around the streets, following the map from the visitor centre. The map gave a trail to follow to view the homes and it provided information such as when the house was built and who lived there.  you will see the house where John Wayne shot his last film. And Samuel Clemens brother's house - Samuel Clemens did stay there.  You can shorten your walk if you wish - we could have spent longer enjoying these quiet streets.  My mother is restricted with mobility so she followed in the car, making stops to get out on occasion.  The streets are quiet, tree lined with many manicured gardens.  Well worth your time - and at no cost. ",
  "You follow the blue line (faded in some areas) around several blocks in the historic section of Carson City. It's a great way to kill time, or if you're a history buff to check out the building and homes, many being restored.",
  "It was a lovely day and we enjoyed our walk through the city following the blue line. \nIt leads to historic residences and government businesses. Lots of info at each stop by reading a brochure or listening to a phone app. \nIt took about 2 hours.  ( I don’t know why it’s called Kit Carson. Maybe the folks at the visitors bureau can answer that when you stop in to get the map)",
  "After visiting the Nevada State Capitol building, we headed out for a walk along this trail.  We used the Carson City app to help us, but once we got started near the State Museum, it was easy to follow the painted blue line throughout the neighborhood.  The app provided interesting narrative about numerous historic structures, and the trail passes by the Governor's Mansion.  Good weather made for an enjoyable tour."
 ]
},{
 "name": "Skunk Harbor",
 "address": "Lake Tahoe State Park",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/73/5d/e4/skunk-harbor.jpg",
 "tags": [
  "hike",
  "walking",
  "hike",
  "walking",
  "hike",
  "hike",
  "walking",
  "hike",
  "walk",
  "hike",
  "music",
  "family",
  "food",
  "hike",
  "walking",
  "historic",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d3309837-Reviews-Skunk_Harbor-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "An easy hike down a dirt road brings you to Skunk Harbor, a beautiful cove on Lake Tahoe.  This is a scenic trail with views of the lake all the way down.  The beach includes a gentle sandy section and areas with boulders for scampering or resting atop.  There are views of blue and green water all the way across the lake.  It's all gorgeous.  \n\nI made the trip very early on a weekday yet still did not have the place to myself -- boaters and hikers had camped out here the night before.  As they were still asleep, I had some time for peaceful enjoyment of the cove.  Traffic picked up by 9 a.m., with many more hikers and even daycare groups making the trek to the beach.\n\nThe paved parking areas are very small, accommodating maybe 10 cars total. They come up suddenly -- I don't remember seeing signs for Skunk Harbor or parking, but I might have missed them.   Traffic can be heavy, so be careful if you're pulling into the parking area or walking along the highway.  No restrooms or water available at either end of the trail, and you'll need to take your trash back with you.",
  "An easy hike down a dirt road brings you to Skunk Harbor, a beautiful cove on Lake Tahoe.  This is a scenic trail with views of the lake all the way down.  The beach includes a gentle sandy section and areas with boulders for scampering or resting atop.  There are views of blue and green water all the way across the lake.  It's all gorgeous.  \n\nI made the trip very early on a weekday yet still did not have the place to myself -- boaters and hikers had camped out here the night before.  As they were still asleep, I had some time for peaceful enjoyment of the cove.  Traffic picked up by 9 a.m., with many more hikers and even daycare groups making the trek to the beach.\n\nThe paved parking areas are very small, accommodating maybe 10 cars total. They come up suddenly -- I don't remember seeing signs for Skunk Harbor or parking, but I might have missed them.   Traffic can be heavy, so be careful if you're pulling into the parking area or walking along the highway.  No restrooms or water available at either end of the trail, and you'll need to take your trash back with you.",
  "Its best to visit in the morning before the noisy boaters and the rest of the hikers start to trickle in. Vivid green and blue harbor that's hidden away enough for quiet reflection but not too far to hike, a rarity for any natural beauty. The hike is from the main road and will only take 30 minutes as its all downhill, a bit more of challenge on the way back up. While not a difficult hike it would be challenging for those out of shape at the elevation. The old building is interesting but no facilities for RR or fresh water. Be sure to bring plenty of your own.",
  "The beach and old pavilion/party house are great and can keep you entertained for a few hours at least. It's relatively quiet in October when we've been; 2 times in 5 years. It's a great view and you can see cool critters and plants at the beach and during the hike. Hardest part is the parking, as there's little of it and one pull off requires walking along the road for a bit. The hike out is definitely the workout part of the hike with a pretty good gain in elevation. The trail is easy as it's mostly a sand/granite forest road.",
  "This hike was in the difficult side, because of the way back up to the road (steep incline), and as an east coaster - the elevation made it even more difficult. Saying that - I can’t wait to go back. The view and water was amazing. The hike and beach at the bottom was just about the most relaxing place I’ve been to.",
  "We are always on the lookout for hikes with our dog and dog friendly beaches at Lake Tahoe. Skunk Harbor was a great find as it combines both! As others have noted, parking is sparse so unless you go early in the morning, I would recommend heading there later in the afternoon when people are leaving. We were lucky to snag a spot yesterday afternoon near the green gate and headed with our dog down to the harbor. \n\nThe hike down is fairly easy - you just need to take care when attempting the steep shortcuts to not slip. I tend to like hikes with rewards at the end and this one has one of the best! Skunk Harbor is absolutely stunning! I love the craggy rocks, the nooks and crannies to climb and explore. You can find lots of different sandy areas or bigger boulders to camp out on for the day. \n\nIt is also interesting to walk around the former summer party home built in the 1920's for a wealthy California family. You can almost imagine what it would have been like to be there during the Roaring Twenties- with music, food and laughter in this beautiful spot! \n\nIf you take the shortcuts back up instead of the main trail, be prepared for a bit of a workout! It can be rather steep!",
  "Park on the side of Highway 28 by the green gate. Pack a picnic lunch and head down the trail to the lake for gorgeous views and crystal clear water. When you get to the lake, keep walking around to the right and find a spot on the rocks to enjoy the views. We had fun jumping off the rocks into the water. Save some energy for the hike back up the trail.",
  "Park on side of Highway 28. Hike down to the lake for gorgeous views, photographs and flowers. Historic stone building at lakeside. Enjoy a picnic before you hike uphill. Approximately 2 hours for tourists. "
 ]
},{
 "name": "Capitol Complex",
 "address": "Carson Street Musser and 5th",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/7e/4d/54/nevada-state-capitol.jpg",
 "tags": [
  "tour",
  "wander",
  "free",
  "history",
  "tour",
  "tour",
  "wander",
  "free",
  "history",
  "tour",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104064-Reviews-Capitol_Complex-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Road trip!  Our 46th state capitol!  This complex consists of the original Capitol and the new legislative building. They weren’t any tours available but the self guided tour was good. All of the staff and security guards were friendly and helpful.",
  "The Capitol Building in Carson City is home to the Nevada State Legislature. Visiting is very informal and you can just wander around or join a free guided tour. There was no intrusive security screening unlike in most government buildings of the USA I am sure.\nThere are some interesting displays on various aspects of Nevada State history.\nThe helpful gentleman at the front desk even stamped our Route 50 Passport with a Nevada state stamp.\nCertainly worth a look around.",
  "Road trip!  Our 46th state capitol!  This complex consists of the original Capitol and the new legislative building. They weren’t any tours available but the self guided tour was good. All of the staff and security guards were friendly and helpful.",
  "Grounds are really lovely with lots of monuments and trees.   We were not able to get into the capitol, we circled the entire Capitol and all doors is locked.",
  "We had 20 minutes to kill and took a stroll through the grounds of the capitol.  We thoroughly enjoyed the wide variety of plants and trees, many labeled.  It was something our 88 year old mom could safely enjoy.  The statues were interesting and the grounds well kept.  This is a very inviting capitol.",
  "The Capitol Building in Carson City is home to the Nevada State Legislature. Visiting is very informal and you can just wander around or join a free guided tour. There was no intrusive security screening unlike in most government buildings of the USA I am sure.\nThere are some interesting displays on various aspects of Nevada State history.\nThe helpful gentleman at the front desk even stamped our Route 50 Passport with a Nevada state stamp.\nCertainly worth a look around.",
  "We walked to the Capitol Complex after it had closed,  but thoroughly enjoyed walking around the building.  The grounds are beautifully kept and we enjoyed the signs identifying the different kinds of trees there. The capitol building is beautiful from the outside."
 ]
},{
 "name": "Shoe Tree Brewing Company",
 "address": "1496 Old Hot Springs Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/95/89/67/great-ode-to-the-nevada.jpg",
 "tags": [
  "learn",
  "tour",
  "brewery",
  "drink",
  "delicious",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d12378969-Reviews-Shoe_Tree_Brewing_Company-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "We ate at Sassafras next door and decided to come over to Shoe Tree Brewing for a few beers after dinner.  We have eaten at sassafras before  and commented that we needed to go to  Shoe Tree Brewing but before this have yet to visit.\n\nWe were impressed - the interior was decorated cute and it was comfortable. Shaun was helpful in explaining the options and my wife was happy to learn they make their own root beer.\n\nI also liked the fact that they offer both a double and triple IPA. They have board games and even old school video games!  Their swag is nice as well and reasonably priced - cool logo too.\n\nI even had a couple of growlers filled to take with me to enjoy later. Great experience - we will be back!",
  "Visited as part of our tour of North American breweries and this was well worth the trip. A good selection of beers to suit all tastes with video and board games to entertain children. Bar tender was super friendly and knew all about the beers and allowed us to try before choosing which ones to go for. Atmosphere very relaxed and a good mix of customers so this will suit all tastes, I have no doubt and would highly recommend. Prices also very reasonable. Top brewery!",
  "Well this place looks the part, a sweet little building in a car park opens up to a well designed, good looking bar. Excellent typography on the walls, beautiful wood tables. There was a Nintendo 64 set up that my daughter enjoyed playing along with some board games provided.  She drank a sparkling lime and mango drink which was delicious.\nWe generally try the flights but went for 4 halves instead. The beer was good, I particularly enjoyed the vanilla cream on nitro and the Brunswick blonde ale. Mr G enjoyed the ash canyon Amber and the shoe horn although at 9.2% a half was enough.\nWell recommend a visit. Sadly we got here just before a load of potty mouthed workers so our peace was disrupted. However we know a bar is an adult place it just pit a bit of a dampener on the visit.\nThe bar man was friendly.",
  "Every time I visit friends in Carson, I make it a point to drop the Shoe Tree Brewery.  Many many choices of brews...I had a vanilla beer on nitro and it was excellent.  Beertender was really nice and all the locals were cool.  Looking forward to my next visit.",
  "Got to visit a few times during my extended stay and each time I was wowed by their beer. And the homemade rootbeer!! Yum! It's the perfect place to pull up a stool, tuck into a flight and meet some new friends. A little off the beaten path from downtown but so worth it! Make a day of it by going  the hot springs and getting a great lunch at the restaurant both of which share the same parking lot.."
 ]
},{
 "name": "Children's Museum of Northern Nevada",
 "address": "813 N Carson St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/da/2b/6f/children-s-museum-of.jpg",
 "tags": [
  "kids",
  "kids",
  "kids",
  "historic",
  "kids",
  "kids",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104066-Reviews-Children_s_Museum_of_Northern_Nevada-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "My children always love this place because it has a lot of fun activities . The place is clean and it is safe for the kids.",
  "Fun place in WPA building. Great for kids from 2 years old on. I have to carry my 3 year granddaughter out! Very reasonable cost on a daily basis or membership.",
  "My children always love this place because it has a lot of fun activities . The place is clean and it is safe for the kids.",
  "It is a neat museum in a historic building.  My son still had fun but for an 11-year-old only about an hours worth of interest.  The museum is definitely designed for younger children.  I think the perfect age range would be 2-8 and some kids up to 10 but not much for middle school aged or middle school ability.  Definitely was a fun little break.  ",
  "Fun place in WPA building. Great for kids from 2 years old on. I have to carry my 3 year granddaughter out! Very reasonable cost on a daily basis or membership.",
  "They change things often enough to go back. Even have days when they bring out the old press and stamp out coins.",
  "This place is a lot of fun.  Kids get to play with items and learn.  I really had fun here even when I was just with another adult.  "
 ]
},{
 "name": "King Canyon Waterfall",
 "address": "4450 Kings Canyon Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/cf/67/1b/photo6jpg.jpg",
 "tags": [
  "hike",
  "hike",
  "hike",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d17480264-Reviews-King_Canyon_Waterfall-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "The hike is easy to moderate with a little climbing at the very end, but it’s only about a mile. It weaves back & forth along the mountain side which keeps its from being strenuous. Pretty little waterfall In an unlikely place. Read the info boards. I was surprised to see it’s one of the main suppliers of water for the area. ",
  "Easy drive from Carson City, and what an unexpected hidden gem! Easy hike to the lower falls, but so pretty!",
  "Great easy fun hike. Was surprised to know there was a water fall in Carson. It’s pretty and a nice surprise. Going to the top next time. Great day",
  "Easy to find, and not crowded. We only did the hike to the first falls and it was beautiful. Really it was a pretty short hike for a great pay-off. I would wear shoes you can get wet as you really want to get in the water to see the lower falls well, however the trail is difficult enough that you need something substantial on your feet (not flip flops)",
  "The hike to the lower Kings Canyon Waterfall is moderate with beautiful views. You go up in elevation quickly and the trail is narrow in some spots but the end result of reaching the bottom of the falls is worth it. It is only a 5 minute drive from downtown Carson City and then a short hike (1/2 hour one way) to the lower falls. The trailhead is well marked and be sure to bring a camera as you will get some spectacular shots of Carson City and the mountains. There is a longer hike that will take you to the top of the falls."
 ]
},{
 "name": "Carson City Culture & Tourism Authority",
 "address": "716 N Carson St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/bd/62/87/carson-city-convention.jpg",
 "tags": [
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104062-Reviews-Carson_City_Culture_Tourism_Authority-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Such an awesome resource - super important that you stop here first!\n\nThey can help you with everything you need to know abou tthe area.  Even though I am a local, I stop in several times a year.     What concerts are in town - or coming... what festivals are in town - or coming... they know it all.     Love the local insight as to restaurants / theater / whatever.\n\nIf you need Nevada T-shirts etc - show here, and support the great State of Nevada!",
  "Since I'm new to Carson City, this has been a fine and reliable go-to place for me.  The people are friendly and helpful, free materials are voluminous, and there's a good bookstore, too.  Adjacent is a gift shop, but I've not been there.  The Visitor Center neighbors the State Museum, near several fine local restaurants, and also Morley's Rare Book store (which also has a good selection of not-so-rare Nevada books) so if you're visiting Carson City this is a good place to begin.",
  "Such an awesome resource - super important that you stop here first!\n\nThey can help you with everything you need to know abou tthe area.  Even though I am a local, I stop in several times a year.     What concerts are in town - or coming... what festivals are in town - or coming... they know it all.     Love the local insight as to restaurants / theater / whatever.\n\nIf you need Nevada T-shirts etc - show here, and support the great State of Nevada!",
  "We stopped in to get some information abou Carson City. We were given a wealth of information about the area and given maps to make our travels in the area easier, could ask for nothing more! The people we talked to were fantastic.",
  "Friendly and helpful.  Wonderful pictures by local talent hanging on the walls ( for sale). They can give you pamphlets and directions to so many interesting places in N. Nevada",
  "Really appreciated the clean restrooms! Waited over thirty minutes to taste anc purchase their liquor and t-shirts but was ignored by the one sales lady who was helping another couple.",
  "Nothing posted as to why one of only two places we found in CC that souvenirs was closed on a Sat. The other was also closed so not impressed with CC handling of visitors at all."
 ]
},{
 "name": "Carson Station Casino",
 "address": "900 S Carson St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/4f/ce/a2/best-western-carson-station.jpg",
 "tags": [
  "free",
  "drink",
  "eat",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d3494001-Reviews-Carson_Station_Casino-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Friendly staff, great games and we won. A jewel in the Carson city crown ❤️😀\n\n4th time I’ve been here and it’s improved every time. Would recommend",
  "First off it’s the Max Casino now.\nNot many machines,I think they advertise 200.Many slightly older machines and some brand new.No cash slip machines to cash out on,cashiers will gladly cash your ticket for you.\nThe employees all seemed friendly.\nThe bartender is your cocktail waitress but they would let you come up and get a free drink while playing slots on the floor.\nNo table games.Didn’t win but that’s how it goes sometimes.I would give it another try.\n",
  "Just want to let y’all know that this is now the Max Casino. It changed with new owner quite a while ago. \nI haven’t stayed there, however; there is a Black Bear Diner inside that has really good food. We eat here occasionally. Very close to downtown.\nIt is very clean inside and the employees are friendly .",
  "When I drove up it has all changed. It is now Max Casino instead of Carson Station. They have redone the inside and it does look nice. It is kind of a strange floor plan for machines but they do have some machines I like to play. I am not sure I like it as well as before but everything is changing.",
  "The restaurant has very good food at a good price, recently converted to a Black Bear Diner. Fri. & Sat. is local band night. Half the bands they get are pretty decent, and the cocktail waitresses are pretty on the ball i.e. not a long wait. "
 ]
},{
 "name": "Carson Nugget",
 "address": "507 N Carson St",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/d8/59/2c/carson-nugget.jpg",
 "tags": [
  "music",
  "family",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104063-Reviews-Carson_Nugget-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "First time visiting the fabulous Carson Nugget. I guess the best way to describe it is \"dated\"...\nDoesn't look like much has been done to the Nugget in the last 20+ years. The exterior is gaudy at best, but nothing really to entice someone to come inside. Parking was scattered and a pain to negotiate.\nInside was as if you took a time machine back to the 1970's. I think there were chairs that were older than me there...\nThe staff looked pretty tired and definitely not happy. A few conversations with them revealed what I expected, the new-ish owners are just milking the place, pay is down, benefits are disheartening. Sad to see that. With a little effort it could be a cool place. The atmosphere (lack of oxygen) was disconcerting, it just smelled \"old\".\nThe sports bar, for a Friday night, was deserted. Actually, the entire casino was pretty dead...oh well...it was definitely a trip into the the past, albeit, not a good one...",
  "My husband and I were heading home to the Midwest from a California vacation and decided to stop for a little gambling at the Nugget since there is a Nugget in Las Vegas. The machines were kind to me and we saw a celebrity. My hubby and I both noticed, at the same time, an older black gentleman sitting at a machine. It was Charlie Pride. I told him I saw on a billboard that he was  performing nearby and he said yes, right here. So the next night he was doing a show at the Nugget. What a sweet, shy man. We talked about my favorite song of his which he said was his Number 1 hit ‘Kiss an Angel Good Morning’ . What a Great forever memory.",
  "Old School Casino - was a bit smoky \nVery friendly staff.    Great place to pop in and see if you are in area.",
  "I was attracted to the Carson Nugget because of it's central location. Once inside I was surprised to see live Keno, which I enjoy playing and watching my numbers while dining or playing other games. For a $1 bet it could pay $30K, which was an attraction. They have several places to dine. My favorite was Angelina's, which offered, steak, lobster, Italian pasta's and more. It opened at 4:PM. Our waiter \"Tony\" was well versed, explaining the contents on the menu. The atmosphere was cozy, candle lite with soft music to enjoy. I'll go there again on Oct. 11th with family, to enjoy my 82nd birthday. They also have live comedy club entertainment which I did not attend.",
  "I found only 2 quarter slot machines.  It seems that most of the casinos in Nevada are removing their quarter machines and replacing them with pennies.  They must be bigger money makers for the casinos.  We had a drink at the bar and the bartender had no personality.  We dropped $50 in the casino and left....smelling like an ashtray. :-("
 ]
},{
 "name": "Comstock Casino",
 "address": "3680 Goni Rd Ste 1",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e5/9f/89/20160708-115555-largejpg.jpg",
 "tags": [
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d9874542-Reviews-Comstock_Casino-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very local one. They are indie, I assure you. They run on like a souvenir store. But, the place is still good.",
  "Have a good selection of machines and a comfortable sports book viewing area. The food in the restaurant is among the best Mexican food in Carson City. ",
  "Juan's is privately owned and he caters to his local customers as well as travelers passing through. My hubby enjoys the light menu of shredded beef taco with refried beans and Juan's is the only place who makes my cheese and onion only chimichunga.\nWhen Juan is there, he makes it a point to come out and greet his customers to make sure all their dishes were prepared as requested.\nStaff is very nice and pleasant.",
  "Went to Comstock around 1:30 p. today to redeem my 10 dollar match play coupon. Showed the coupon to the woman at the desk and asked if I had to wait at the machine to use the coupon. She said yes, and added \"you may have to wait a few minutes.\" So I found a machine, pushed the service light button, and inserted 10 dollars into the machine. And I waited \"a few minutes.\" And I waited \" a few minutes\" more, After 20 minutes I walked up to the woman at the desk and told her I'd come back when they weren't so busy. I may be retired, but my time is valuable to me. I could've been screaming \"fire\" and nobody would've noticed. I've been gambling there for years and have never seen such terrible service. Thanks a lot Comstock.",
  "Definitely somewhere between average and poor. It was very smoky. Not a whole lot of machines. Very dark period but for a local small Casino if that's your thing it could be ok. They have a sports book. Had a bar."
 ]
},{
 "name": "Warren Engine Co. No. 1 Museum",
 "address": "777 S Stewart St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d7/00/bc/warren-engine-co-no-1.jpg",
 "tags": [
  "free",
  "historic",
  "walk",
  "walk",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104070-Reviews-Warren_Engine_Co_No_1_Museum-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "With a husband retiring from the fire department we enjoyed looking at vintage apparatus and equipment. It is a small but very enjoyable visit!",
  "We visited the Warren Engine Co. No. 1 Museum in Carson City.  It is connected to the Carson City Fire Department Headquarters.  It is free to visit; although donations are encouraged.\n\nThere are very nice historical fire engines. There are some from the 1800s and later.  They are in superb condition.  There is also exhibits, photos of the fire staff of the Warren Engine Company, as well as some historic fire photos such as of the Prison Farm Fire of May 9, 1939 and also of the Carson City Opera House on April 5, 1931.\n\nit is a local gem of a museum to see.  It will take less than 1/2 hour to see but well worth the time.",
  "I found this by accident, one day when out for a walk.  It wasn't open, but the beautifully restored equipment could be seen through the windows.  When I went in to the fire station to ask about hours, they simply opened the museum for me!   Close up, the restoration is of Smithsonian quality.  Don't miss this one. ",
  "Working fire station. Walk in and they will be happy to open the museum door.\nGreat place to chat with the firemen. Attached to a large dog friendly park. Within a block of the Carson Mall.\n",
  "This museum is a hidden gem in Carson City, but worth the visit if you would like to see historic fire fighting apparatus.  There is even a Hunneman hand pumper, which I think was from the 1840s.  The volunteer staff member was very informative and friendly."
 ]
},{
 "name": "Fuji Park",
 "address": "601 Old Clear Creek Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/cd/61/9e/fuji-park.jpg",
 "tags": [
  "kids",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d7982156-Reviews-Fuji_Park-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fuji Park in the main is a good park.  The DOG PARK, however, leaves a great deal to be desired. It is dirt-based (no grass), and divided into small and large dog sections.  That would be OK, if the small dog owners stayed in the small dog section, but they don't. So you have yappy little dogs trying to exert their dominant on Great Danes.  Another disadvantage is that the regulars sit and chat with each other, pay no attention to their dogs (who steal other dogs' tennis balls), and don't clean up their dogs' waste.  There is a water spigot, but it drains into the dirt, so there is always a mudhole around it.  Sonoma Park is only a mile away, and much better.",
  "We needed a spot to let the kids burn off some energy before heading back to Tahoe \n\nWe found this park via a web search. It worked out just fine.\n\nThe kids enjoyed the park. They played for about thirty minutes or so.\n\nThe park was pretty clean and plenty of parking.\n\nThe one negative, not the park's fault, was the wind. It got a little chilly.",
  "Have taken grandchildren there a few times. They enjoyed it. It is  across from Costco,  As a member we could go and buy lunch and eat it at the park.",
  "This park is like an oasis!  It was over 100 degrees during our visit, but the trees and the grass made it seem much cooler.  Our dog logs it here!  Nice place to picnic, stretch your legs and let the dog burn off some energy.  Two thumbs up!",
  "After several hours in the car, I thought I would give my boys some relief and let them stretch their furry legs. Fortunately, a quick search on Waze, turned up this park. \n\nLots of room for dogs to run, play and wag. The park also offers both small and large dog areas.\n\nI visited on Christmas Day."
 ]
},{
 "name": "Jack C. Davis Observatory",
 "address": "2201 W College Pkwy Western Nevada College",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/35/c3/62/jack-c-davis-observatory.jpg",
 "tags": [
  "walk",
  "free",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d1049975-Reviews-Jack_C_Davis_Observatory-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very nice Observatory connected with Western Nevada College, (WNC).\nAbove the college and Carson City on the slope of the Carson Range.",
  "We have attended the Saturday night lectures several times and have always enjoyed them.  They are fascinating and fun!",
  "We hiked up to the observatory from the college and it was a great little walk (you could drive as well).  It was a great diversion from work.",
  "We went to this observatory during our vacation in Nevada. they have free astronomy lectures in addition to star gazing every saturday (the lecture is at 730pm and star gazing led by volunteers after that weather permitting). The volunteers are a wealth of knowledge and the lecture is done by a college professor. \nAll these volunteers bring telescopes and show and explain things to dummies like us :)\nI never heard of it let alone even saw a real telescope. The volunteers spent an hour explaining to two of us just the basics . It was amazing. I mean current technology is amazing but the spirit I if volunteerism is even more stunning to me . And I saw Jupiter with three moons and some galaxies and nebulae clusters :)\nThey have a whole citizen science with hundreds or maybe thousands of volunteers doing the asteroid occultation project.  I was amazed by spirit of volunteerism and cooperation of humankind. There are lots of amazing individual discoveries and accomplishments but the world as a whole is running on cooperation I more and more am certain about it.\n",
  "Jack C. Davis Observatory is at Western Nevada College at Carson City.  The facility has three telescopes.  There are free star gazing parties here as well as free lectures and other events.  There are also tours of the facilities.\n\nThe Planetary Walkway connects the main campus with the observatory.  This is a nice place to walk as there are good views of the Carson City area.  It is also a memorial walk.  There are nice rock sculptures of the different planets along the pathway.\n\nThe observatory was built by inmates from thee Carson City prison."
 ]
},{
 "name": "Stewart Indian Cultural Center",
 "address": "5366 Snyder Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/3c/7c/2c/stewart-indian-cultural.jpg",
 "tags": [
  "history",
  "learn",
  "food",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d104069-Reviews-Stewart_Indian_Cultural_Center-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "The history is sad, but the architecture is amazing and the grounds outstanding. Anyone wanting to take a step back in history should visit this place. ",
  "Came upon this site by accident and was so glad we took the time to visit everything and learn about the Stewart Indian Center.  Great in all ways!  It was so interesting and educational.  Our high school grandson was very impressed.",
  "Pastor Shelley Ellison of the church on the property was a pleasant person to meet and they give into the community food and assistance. ",
  "There is a Carson Pow Wow here once a year in June that I have been going to for a long time and I always enjoy it.  The place is a bit eerie and sad in the history of how Native Americans were forced out of homes to go to White schools, but the local tribe doesn't want to burn the place down and instead likes to keep the memories.  It is very interesting historically to walk around and see how they lived and the old buildings.  Nice and shady too.",
  "when I used to live in carson city this was still the indian school, and i had only been by. this trip we spent an hour or so and walked around many of the buildings. if you like old stone buildings, you will love this site. there are some state offices there now, but it's still very quiet and peaceful.  if you are traveling south on 395 from carson city, watch for the sign that says stewart complex, it will be a left hand turn. if you miss it as we did, just proceed to the next stop light and turn left. you will snake around a bit, but can easily get to the campus."
 ]
},{
 "name": "St. Paul's Lutheran Church",
 "address": "1201 North Saliman Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d19144589-Reviews-St_Paul_s_Lutheran_Church-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a relatively small congregation of evangelical Lutherans, who are deeply committed to the church's Scandinavian roots. Each October they hold a Scandinavian Festival, with ethnic foods (sadly, the lady who had made Lutefisk for the festival for years passed away, so there was no Lutefisk; but they did have Lefsa, made fresh on the spot. And Swedish meatballs); craft-making; live Norwegian fiddle music, and lots of fun."
 ]
},{
 "name": "Mills Park",
 "address": "1111 E. William Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/96/4c/81/traveling-carnival.jpg",
 "tags": [
  "eat",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d17698502-Reviews-Mills_Park-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park is a great place for picnic /biking /walking and skating. Swim center next door along with places to eat.",
  "Mills Park is a 51-acre city park with multiple activity areas.  These include soccer fields, a skateboard park, an Olympic-sized indoor pool, BBQ and picnic areas, kiddie playground, horseshoe pits, a community center and an indoor pavilion, suitable for rodeos. On Independence Day this year, there was a full-fledged traveling carnival. There is a miniature riding railroad, which is, unfortunately, not operating currently. Something for everyone."
 ]
},{
 "name": "Sonoma Park",
 "address": "1003 Sonoma St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/14/26/25/sonoma-park.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d17652459-Reviews-Sonoma_Park-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "Sonoma Park is a five-acre, fully-fenced municipal park that is divided into a kiddie park and an off-leash dog park.  The kiddie par, which is nicely shaded with big trees, features a jungle gym, slides, swings picnic tables, a water fountain, and sanitary facilities (Port-a-potty).  The dog park is mostly open and grassy, with some shade trees at one end.  There are four gates, so you can avoid crowds at one end; a doggy water feature, and several doggy-bag dispensers and waste cans.  As long as owners clean up after their pups, it is a very nice dog park."
 ]
},{
 "name": "Korean War Veterans Memorial Park",
 "address": "600 Marsh Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/28/49/0f/milking-shed.jpg",
 "tags": [
  "historic",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d17691239-Reviews-Korean_War_Veterans_Memorial_Park-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "The entrance to Riverview Park is a dedicated memorial to those who lost their lives during the Korean War. It has three flags (US, Nevada and Korean), several memorial plaques and some benches.  RIVERVIEW PARK continues on beyond the Memorial, and provides a significant portion of Carson City's walking, equestrian, and off-leash dog-walking trails.  It is a 109-acre preserved area, which includes upland sagebrush, wetlands, and riparian ecosystems. Geese, several species of ducks, raptors, and owls are common, as are many species of smaller birds. There is also a small pack of coyotes, and the occasional rattlesnake. \nAmenities include restrooms, BBQs, picnic tables and a sheltered area.  Of historic interest are an outdoor brick oven and a milking shed from a 19th century ranch that once occupied the site.  VERY GOOD FOR OFF-LEASH DOGS!"
 ]
},{
 "name": "Charlie B Gallery",
 "address": "114 W Telegraph St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d19248782-Reviews-Charlie_B_Gallery-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "The museum is devoted to pottery and artists of America and the world.  Charlie is an expert in both the medium and the artists.  Wonderful place to visit for those who love earthen arts."
 ]
},{
 "name": "American War Birds, Inc.",
 "address": "2600 College Pkwy Hngr 33",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/e0/db/1b/american-war-birds-inc.jpg",
 "tags": [
  "tour",
  "field",
  "historic",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d2038182-Reviews-American_War_Birds_Inc-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "If Tripadvisor had a rating of 'Not Really Sure\" I would have selected it instead of the Average rating that I did. I have been asked to do this review before & declined because I really do not know if the destination that I ended-up at is the one that is listed in the header. I'll explain further. I was in Carson City, NV in January 2016 from the east coast as a visitor & did indeed set out to visit American War Birds, Inc. located at the listed address on College parkway. After searching for over 30 minutes for an obvious location centered around the airport, I went into a business directly associated with the activities of the airport & was told that the group that I was looking for was in a hanger just down field of their office. Once through the controlled-access gate I went to where I was directed & sure enough, there sat war birds-ahh, getting close. The adjacent hanger that I found had military vehicles & equipment displayed outside & I just knew that I had found what I was looking for... well, not so fast: No sign announcing American War Birds, Inc.- we have aircraft, we have vehicles & we have associated equipment. How could this be wrong? Odd though, over the hanger doors was a sign which read \"Cactus Air Force\". I walked the entire perimeter of the hanger looking for an obvious entry point thinking that the way that I came upon the destination was more private than public, but nope, just some unmarked personnel doors. I finally went to the one of the doors & knocked whereby a gentleman opened it & I asked if this was the \"museum\". He replied that it really wasn't a museum but I was welcome to come in anyway & look around. I explained that I was in from out of town & that I was a fanatic over vintage aircraft. Both of the gentlemen on board that day were very gracious with the time they spent with me & gave me the full tour. Because this is a review (?) of American War Birds, Inc. I won't go into what was housed within this restoration hanger, but believe me when I tell you that if you are interested in a couple of \"1-only's\" this is the place for you.\n\nSo here's my final thoughts: I have no idea if I was in what is the remnants of my original destination, but according to the local's that I talked to, this had to be the place. And if anyone has current information about where I visited vs where I was supposed to visit, please don't hesitate to tell me. I promised you a confusing review & I believe I have delivered exactly that.",
  "Love this stuff and cannot get enough. a great spot to go to view heroes of the last few wars. These birds are historic and rapuidly vanishing. You can admire what our service people flew and the conditions that they did it. A great record of the historu of armed fores aviation through the years.",
  "The web site doesn't allow you t book a flight directly but you can submit a message to ask about the availability of flights and you are immediately given the cell phone number of the pilot, Dennis. He was able to offer me a ride on the day I wanted and we just agreed to meet at he airport. No formalities here. Dennis is friendly, knowledgeable and experienced - all he things you need when taking a ride in a two-seater plane that's more than 60 years old.\n\nThe flight was smooth, the scenery wonderful and Dennis treated me to a loop, some rolls and other fun acrobatics over the middle of the lake. Dennis made sure I was comfortable at all times and was an excellent guide to all we could see. It was very enjoyable, ",
  "This was hands-down one of the most fun things I have ever done.  \n\nThe loops, rolls, strafing run, and the opportunity to control the aircraft with a champion air racer and flight instructor is something that you just shouldn't pass up if you have the opportunity.  The great stories and local tourism knowledge is just a bonus.\n\nHighly recommended!"
 ]
},{
 "name": "Hanifan's Art and Antiques",
 "address": "210 N Carson St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d19378812-Reviews-Hanifan_s_Art_and_Antiques-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "They have high quality items, will negotiate prices and can handle their own shipping.  Expect to take a while, as there are a lot of small items to examine as well as furniture, old movie posters and things to purchase and refinish for display.  Parking is easy, lots of nearby places to eat and only about 40 minutes from Lake Tahoe.  There are two entrances, and the rear entrance has a lot of items one might otherwise miss."
 ]
},{
 "name": "R and D Ranch",
 "address": "7177 Schulz Dr",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/6b/15/c4/r-and-d-ranch.jpg",
 "tags": [
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d4885548-Reviews-R_and_D_Ranch-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "This ranch closed several years ago and is no longer operational.  Therefore, don't expect to ride horses on the trails.\nOwner moved to the Midwest.\n\n",
  "We went to find this place yesterday (9/7/14) and couldn't find it.  When we visited the Carson City Visitor Center the very helpful lady told us that the guy had moved out of town.  Too bad - it sounded more fun than just a trail ride.",
  "This is a great trail ride, whether you're a novice or experienced rider! We had the a bit of an exclusive trail ride on a delightful March day after another group cancelled. Wrangler Rich and crew make sure that you don't just leg up, but learn a little about grooming, safety and saddling up. Our trail ride took us out into the bush, through a stream and included great opportunities for a little canter here and there - definitely not just nose to tail trail ride. The scenery was stunning and the company delightful. We highly recommend R & D for a great trail ride experience!",
  "excellent adventure learning about horseback riding from the pro's at R and D Ranch!!!Weather was great for even a longer day ride. Will do more of these, definately!",
  "My friend and I had the pleasure of attending R and D Ranch this week for a winter ride through the Nevada plains. As knowledgable Australian  riders we were very much looking forward to and authentic American riding experience and something that had that 'edge' and I can happily report that this certainly had it and so much more. \n\nUpon arrival Wrangler Rich introduced us to our mounts and got us accustomed to our horses and saddlery. \nWe took a two hour ride up a close by mountain and I must say, the experience was one I will never forget. The horses were quiet, comfortable and confident and instilled in you a sense of complete safety. The beginner riders who accompanied us were smiling from ear to ear and had an amazing time also. \n\nIt is very hard to put into words just how wonderful this is. \n\nIt is in no way a quiet hack around a paddock! This is a breathtaking adventure that will leave you absolutely gobsmacked and begging for more. \n\nI have absolutely no hesitations in recommending Wrangler Rich and R and D ranch to anyone interested in a horseback adventure. \n\nAnd as for Wrangler Rich himself, it was an absolute honour to ride with someone with the knowledge, skills and experience that only genuine horsemen have! Whether you are an absolute beginner or an experienced rider, you will leave feally totally satisfied. \n\nR and D Ranch has that wow factor that really packs a punch!!!\n\nThank you so much, I look forward to visiting again soon.\n\nChannelle and Rhian!!"
 ]
},{
 "name": "Jackpot Crossing Casino",
 "address": "1897 N Edmonds Dr Behind Slot World",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45926-d14120110-Reviews-Jackpot_Crossing_Casino-Carson_City_Nevada.html",
 "source": "TripAdvisor",
 "reviews": [
  "It is kind of hidden behind Slot World but beings I stopped there I decided to see what it was. It is a smaller casino but has some of the slots I like to play. It also has a self serve beverage machine which is nice. If you want to beat the crowds this is a good option."
 ]
}]
