[
{
 "name": "West Virginia State Museum",
 "address": "1900 Kanawha Blvd E Capitol Complex",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/af/ab/48/inside-the-museum.jpg",
 "tags": [
  "free",
  "history",
  "free",
  "history",
  "free",
  "history",
  "walk",
  "free",
  "walk",
  "kids",
  "free",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144573-Reviews-West_Virginia_State_Museum-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Free cultural museum with 26 Discovery Rooms that showcase West Virginia’s geology, prehistoric cultures, exploration and settlement, frontier conflicts and life...statehood, railroad, coal company town, mining,... the Great Depression, Civil Rights movement...transportation, fairs and festivals, cultural state collections and famous West Virginians. Very well done with extensive and interesting displays about West Virginia’s history and culture. Conveniently located next to the capital building.",
  "We loved this wonderful, free museum that had a little bit of everything.  There was a coal mine, stories and pictures of the Hatfields and the McCoys, dresses from the various Miss West Virginia Beauty Pageants or the ball gowns from wives of the various governors, so much interesting history like the story of John Brown's Raid.  This is a must see place to go and you might want to return a couple of times in order to see it all.  ",
  "I was pleasantly surprised at how well done this museum is.  Great exhibits, free, and a ton of West Virginia history!  A must see!",
  "West Virginia state museum is the best museum I have ever been to, All cities states countries whatever should have the same type of museum that they have here it’s interactive entertaining well thought out well laid out it’s a fantastic experience if you ever come to West Virginia this is something you definitely want to walk through.",
  "Wear comfortable shoes because this museum is large and packed with awesome exhibits. It is laid out so well and there ate some interactive displays along the way. I actually went back a second time to finish seeing it all. Plan on 2- 3 hours to really look at it all. You could take longer. Free and open every day. Parking is a little bit of a walk but not bad. Bring change for the meter.",
  "The kids ages 9 and 11 really enjoyed the museum. When we first arrived we grabbed the museum's scavenger hunt and after that we did the geocache hunt. I think the geocache hunt is what got my 9 year old really into the exhibits. The exhibits are beautifully done, but he likes to find treasure at the end. He said he felt like a detective. I think there was only one other person in the museum while we were there. There was a lot of staff present. The place is sparkling clean. We spent almost all day here.",
  "It is not easy to impress a history geek and museum cutator. That said... I fell in love immediately. The variety of items, the quality of displays and the docents were top notch. The experience of West Virginia becoming a state and the storytelling of it was fun and a great learning experience. Best of all it is free, self paced and in an amazingly cool space! I plan on coming back soon!",
  "The long history of West Virginia begins eons ago with geological artifacts. The whole story is told with many interactive rooms. Each of the rooms covers a different aspect of a time or the people up to the present. There are many, many artifacts to take in and kiosks of written explanations to help one understand what is being displayed. We are not from West Virginia but enjoyed learning about the state and the people of the state. In some of the displays the lighting was insufficient and and some of the displays could be updated. There is no admission charged for this museum but there is a value to visiting it."
 ]
},{
 "name": "State Capitol",
 "address": "1900 Kanawha Blvd E",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f9/cc/4e/20190107-174541-largejpg.jpg",
 "tags": [
  "tour",
  "unique",
  "unique",
  "walk",
  "tour",
  "tour",
  "walking",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d103000-Reviews-State_Capitol-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Every May for about the past 10 years we have visited WV and we make sure to always see the capitol building.  During the week you can have a guided tour of the inside and it is a good tour.  This year we got there around 5PM and just strolled the grounds.  The flowers are beautiful. The statuary is amazing,  Our favorite is the WV coal miner.  We also visit the war memorial each year--WWI, WWII, Korean War, and Vietnam War and the list of names.  Thank you for remembering.",
  "The Gold dome is actually painted with gold leaf and very unique in that it stands on the bank of the Great Kanawha River and where it can be viewed from the river or Interstate 64 which is just a few blocks away.",
  "The West Virginia capitol is a beautiful building with lots of marble and special features.  It has a unique dome that is blue with gold leaf. It was opened in 1932, so it doesn't have as much of a historical feel as some state capitols, but it is well worth a visit.",
  "I'm amazed at the true beauty of our Capitol.  Parking isn't great but it's worth a walk from a neighboring street to go into the atrium.  The lawn is beautiful as well!",
  "I say \"unexpectedly\" because visitors tend to under rate West Virginia, but the capitol (part of a multi-building complex which includes the Culture Center) is a gem.  It was designed by Cass Gilbert, who also designed the capitol in Washington, DC.  The surrounding statuary is marvelous - especially the one of Abraham Lincoln on the south front. If you go, wear shock-absorbing shoes - the floors are marble.  And be careful on the stairs!  There is a cafeteria, which in my experience has ranged from very good to mediocre to closed.  At the moment, I am told it is back to being good.  If you have a camera with a long lens, shoot for the detail way up high on the building.  Public access is now restricted to two entry points with metal detectors.",
  "We were traveling to North Carolina and stopped to stretch legs.  It is an amazing capitol.  We were able to have a personal tour.  I really enjoyed our visit.  Don't forget to visit the state museum in the complex!",
  "Walking through the Capitol building was a wonderful experience.  Walking down the marble hallways looking at the artwork on the walls.  Seeing the young children on tour with their classmates learning all they can. It’s definitely a place that you want to stop in and see.",
  "A fan of state capitols, I seized the opportunity to tour West Virginia’s while in Charleston.  The decor is impressive with marble flooring and walls, delicately engraved flowers made of West Virginian woods throughout the legislative chambers and waiting rooms.  Do not miss the Austrian crystal chandeliers in the House and Senate chambers and the Bohemian one in the Governor’s Reception Room.  While not the most ostentatious state capitol I have toured, it is worth a visit.\n\nWe enjoyed watching both the House and Senate in session.  The tour guide was very informative.  I am glad I took the tour.",
  "I would have rated this place terrible but it is the state capitol.  Where is the security to keep people from making this place smell like urine.  The only other place i have been that smells like strong urine is in DC.  And what is up with the workers not finishing the gilding on the dome?  Who is in charge of these people.  We have one of the most beautiful capitols in the nation and for it to be disrespected like this.  What a shame.  Won't be coming here again.",
  "We love visiting state capitols so I wanted to be sure to see this one. I was at first disappointed that it was undergoing remodeling of the dome but glad we went inside because it was very pretty. Upstairs the Senate and House were both open to the public and they had beautiful chandeliers. Each room had a large great room before you entered it with enormous  black and white historical murals. Also, I loved the old fashioned doors and doorknobs reminding me of the 1950s or earlier. The Governor’s Office had its door wide open as if to send a message all were welcome! We enjoyed it! ",
  "Every May for about the past 10 years we have visited WV and we make sure to always see the capitol building.  During the week you can have a guided tour of the inside and it is a good tour.  This year we got there around 5PM and just strolled the grounds.  The flowers are beautiful. The statuary is amazing,  Our favorite is the WV coal miner.  We also visit the war memorial each year--WWI, WWII, Korean War, and Vietnam War and the list of names.  Thank you for remembering."
 ]
},{
 "name": "Clay Center",
 "address": "1 Clay Square",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/2e/f2/56/clay-center-for-the-arts.jpg",
 "tags": [
  "structure",
  "music",
  "kids",
  "performance",
  "music",
  "art",
  "kids",
  "eat",
  "art",
  "structure",
  "music",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568884-Reviews-Clay_Center-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have been to the Clay Center numerous times but only for concerts, shows and gorgeous weddings. This was a first with a toddler and taking him to the youth exhibits. The \"My Town\", \"Water Works\" room, Healthy Me and the Music Studio...Wow!  So much to see and do for all ages! Plus a very cool climbing structure in the middle of the lobby. My Town has little stores and shops and offices...a grocery store, doctors office, diner, veterinarian office, big fire truck...and so much more! The Water Works is a big room with a couple of very cool hands on water features. We highly recommend stopping in...even if you don't have children! (it's fun to watch them) \nEven though there were 3 school bus loads of kids, it really wasn't that crowded as there is so much to do...not one area was too crowded.",
  "My husband and I and another couple recently attended a live performance of Mountain Stage at the Clay Center.  What a beautiful venue and the acoustics for live music was awesome!  Really enjoyed the show.",
  ".....…I was rather struck by the fact that it appeared to have an art museum attached – the Juliet Art Museum, so I ventured in and this is what I found: a large, 2nd floor open-plan gallery, with quite an extensive hang of themed paintings – people, places and so on - and amongst the usual dreary dross there are some wonderful treasures. These include one of the earliest portraits known to have been painted in America, one of only two dozen colonial works to have survived. It is actually quite good for the time and place, is a gem and worth seeing. They have a good Nathaniel Hone, a founder member of London’s Royal Academy, of a portrait of the lawyer Charles Lossett. Of their later things they have a truly beautiful and atmospheric watercolour by John Singer Sargent of pine woods and though it is easy to be disparaging about any local art museum’s home collection, the work of West Virginian artist Barry Vance is very fine – plein air painting in the Impressionist tradition, landed in the local hills and mountains.\n \nIncidentally, the two tavern scenes are nothing to do with Dutch 17thC art, but are 19thC copies after the Flemish artist David Teniers the Younger – just so you know.\n \nAltogether a real gem and worth a detour.",
  "What a great venue for a concert/ choir/ band show!! \nAwesome auditorium with wonderful seating and sound! \nWe could do but they have museum/ discovery center and whole additional part for families and cost just $9 adults and less for kids.. great bang for the buck for afternoon of fun!",
  "My boys love this place. So many things to keep their minds busy and thier imagination soaring. I definitely recommend this place.",
  "Interesting, fun displays with lots of sensory experiences. Planetarium was amazing and the presenter also showed us the positions of stars etc in the sky in the part of Scotland where we had travelled from !  Had almost 5  hours there but would have liked more time.  Just vending machines  - no cafe; helpful staff gave us directions where to eat nearby, but we were enjoying ourselves too much to leave. A packed lunch would have good.",
  "I thought I was going to an art museum, but their art collection is 4 paintings. However, they have a nice chidren's museum with water, music and human body rooms. There is an amazing climbing structure as well. I enjoyed the children's displays.",
  "We were surprised at the variety of shops & restaurants here, as well as the extensive parking facility should you be driving. We were fortunate enough to walk her from our hotel-so, yes, there are also hotels at City Center"
 ]
},{
 "name": "Capitol Market",
 "address": "800 Smith St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/43/e1/a9/capitol-market.jpg",
 "tags": [
  "music",
  "food",
  "eat",
  "food",
  "delicious",
  "walk",
  "eat",
  "free",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144576-Reviews-Capitol_Market-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Omgoodness- what a fab place to visit and shop or find a cozy outside seat and relax with the sights of a Farmers Market \nInside you will find food, beer, wine, sushi, meat market offering organic selections, fish,  fresh chocolate delights, market fruits and veggies and dried beans , spices, wv crafts, glassware and wv food products——-just to name a few of the indoor offerings. \nOutdoors are local farmers with their booths filled with fresh products, micro greens, flowers and herbs, icecream by Ellen’s icecream , at times music  and activities, seats to enjoy delights and relaxation, and a restaurant at one end that offers outside seating. \nIt is like a little city encased in this wonderful market. \nA definite must see while visiting Charleston",
  "This market has so many offerings including outdoor local fruit and vegetable vendors and indoor local products as well as a butcher shop, coffee shop, wine shop, restaurants and year round produce.  Take time to enjoy it all.",
  "No matter the season, this quaint market is one of Charleston's finest places to visit. Outside, you can find fresh flowers, plants and produce in season from many local vendors. Inside, you'll find delicious food at the SoHo restaurant along with several local shops with locally-made wines, cheeses, fresh meat, seafood, books, West Virginia souvenirs and some of the finest chocolate you will ever eat (Holls). The Purple Onion is the perfect place to find fresh, reasonably-priced produce and other interesting food items.",
  "Love going to the Capitol Market when in Charleston WV.  A variety of vendors and market items as well as a couple of great eateries make this a great place to while away some time in the city and pick up something you'll love. And it has a wonderful atmosphere and vibe. It can be hot in the summer so go early to beat the heat. Walk through their wide offering of live plants and have a crab cake sandwich at the little seafood eatery!  They also offer fresh produce and foods, wine, chocolates and books. Recommend visiting! Enjoyable!  ",
  "Spring is coming to Charleston and the capital market will be full of bedding plants for gardens and annuals for containers. Herbs will go into gardens and color will return to window boxes. Local farmers will begin to sell lettuce and small bushes for early planting. Great place to go on a weekend. Get there early for the best selection and a parking place.",
  "A must stop for a Capital City visit.  Both an open air and enclosed market offering true West Virginia made products.\n\nAn excellent restaurant is available for lunch\n\nAllow 60-90 minutes for a visit.  Parking is available ",
  "Cute farmers market with multiple shops, crafts and places to eat! Worth a stop and would even be better in summer with outdoor markets!",
  "The Capitol Market is a true gem in Charleston. We are so lucky to have fresh farm vegetables, a traditional butcher, a sushi shop, Holls chocolates, a seafood stand, the wine shoppe and SoHos restaurant all under one roof— and the flowers Spring through summer are gorgeous, and winter brings evergreens in all forms!! Don’t miss visiting here if you are in Charleston!",
  "My mother and I stopped here for lunch and split a reuben and another sandwich at soho's.  The reuben was excellent.  Parking at the market is free.  The place seems clean.  We saw some apparent homeless people but they didn't harass us like in other parts of Charleston.  You can find fresh produce, meats, wines, cheese, candy, etc. but the prices are high, so we didn't buy anything even though we could have used some fresh fruit and meat.",
  "Love the Purple Onion, and the Wine and Cheese Market, The Seafood Market!! All of the Shops are 5 Stars!",
  "good place for locally sourced food, particular during the summer. They have a decent wine shop, coffee shop, There is a quality meat shop there, where you can also get lunch. You can pick up WV gifts there."
 ]
},{
 "name": "Capitol Street",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/7f/61/d4/result-1557690152755.jpg",
 "tags": [
  "family",
  "eat",
  "food",
  "cheap",
  "eat",
  "drink",
  "eat",
  "library",
  "walk",
  "historic",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144575-Reviews-Capitol_Street-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "In the 70s, before the mall came to town, this was the place to be in Charleston. \n\nFor years, it was run-down and desolate. \n\nSince the 90s, Capitol Street has bounced back and is the place to be again!\n\nEllen's Ice Cream, Taylor Books, The Block, Adelphia, Bar 101, Sam's Uptown Cafe, Pies and Pints. \n\nSomething to do there from dawn until well into the night. \n\nCheck out ArtWalk! ",
  "Visiting Capitol Street is a must if in downtown Charleston;  bars, restaurants, and shops abound here.  Most are worth visiting on their own merits;  having everything in a couple-block area makes for a very walkable evening or afternoon!",
  "I loved this area, it was so clean and pictureques, the entire street boast of family friendly restaurants and little eateries. we ate at Pie and Pints which served the best handmade pizzas ever, all fresh ingredients and next door is Adelphis which was also a very nice place to eat good mix of american food and catch the game as it was a sports bar atmosphere. last but not least is the ice cream parlour just across the street with its home made ice creams. The street is quiet and peaceful! beautiful ",
  "If it were a nice day, a cup of coffee or a scoop of ice cream would be a good go to... Don't miss the Peanut Shoppe ( weekdays only).  Some nice folks, some not.  Don't get too excited about this street, even though it's one of our best.",
  "Good spots to eat and drink and shop. Trolley will get you around and parking is seriously cheap. It's a downtown street, so you do have to experience some colorful characters.",
  "If you want to go here to eat or shop or walk, park somewhere else (May I suggest up by Capitol Market if it's during the day, or down on the river otherwise?) because you won't even be able to find a space here except by the grace of the parking fairies.\n\nAlso for confused natives and a handful of people reading brochures put out by the city of Charleston, for some reason the brochures are now calling this area \"Renaissance Village\".  Please don't ask locals about \"Renaissance Village\", we don't know what you're talking about as the Visitor's Bureau didn't tell anyone they were giving downtown a name\n\nAnyway.  Attractions include:\nCapitol Market (at the very end)\nCharleston Bakery\nDaniel Boone Inn (not much to do, but it is pretty)\nBear's Den\nSwiftwater Cafe\nHenry Gassaway David Park\nGrazziano's\nEllen's\nTaylor's Bookstore\nPies and Pints\nAdelphia's\nThe Peanut Shoppe\nThe Library\nIchiban\nand a slew of bars closer to the river.",
  "Charming Capitol Street! We visited in the evening and look forward to coming back during the daytime as well. It was more populated than we expected on a chilly Fall night. Our favorite was Taylor's Bookstore and Ellen's Ice cream. Pretty street for a stroll anytime of day.",
  "We love the architecture and feel of Capitol Street. It has such character that suburban shopping areas lack. There’s Pies and Pints, Ellen’s Ice cream, Taylor Books and coffee plus a number of other options as you stroll down this historic street. For those of us who miss that downtown shopping feel of the past this is a must.",
  "This is beautiful section of downtown Charleston, WV and has a feel of New Orleans, LA or old Savannah, GA.  The tree-lined streets are wonderful and there are a lot of festivals and things to do. The restaurants and entertainment venues are quaint and fun. Come visit Charleston, WV (Charlie West) for those flying into Yeager Airport and enjoy the river and quaint downtown.\n",
  "Capitol Street used to be the main shopping street in Charleston, but most of the big chain stores have moved out.  Now the street is lined with trees and has great small shops and gift shops.  We visited a book store, an ice cream shop, a jewelry store, a novelty shop, and a restaurant.  Park in the parking garage that is central to all of it.  Great fun browsing the many and varied shops.",
  "Heart of it all. Bars and restaurants line the street and the choice is up to you. Its a great part of Downtown and all is in walking distance in just 3 or 4 blocks. Very safe!"
 ]
},{
 "name": "Culture Center",
 "address": "1900 Kanawha Blvd E Capitol Complex",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/6c/5a/3b/cultural-center.jpg",
 "tags": [
  "family",
  "library",
  "music",
  "history",
  "free",
  "kids",
  "history",
  "history",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d103001-Reviews-Culture_Center-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Each time that I visit the Culture Center, I am reminded of the rich simplicities of life that are often forgotten or put on the backburner for sometimes cold and empty technological advances.\n\nOver the years, my family and I have grown to appreciate the beauty of the local artisans on display with paintings, sculptures, quilts; the diversity in musical selections, and the enormous archived resources available in the library. \n\nThere is a very satisfying and refreshing feeling that you leave with anytime that you visit The Culture Center.",
  "The correct name is \"Culture Center\" -- it's not how I would have labeled it but it is what it is.  \nThere are always great displays in the lobby, several series of lectures during the month, a really good state museum, and sometimes you stumble onto special events there, if you're lucky.\nThe Culture Center is home to \"Mountain Stage\" -- the public radio show heard across the country and on Armed Forces Radio around the world.\nCheck it out!",
  "Mountain Stage brings live music from around the country and world to West Virginia. This is a fantastic and intimate venue and the line ups are always amazing. Joanie D is fantastic.",
  "See my review under 'State Museum' for details.  It does include a great quilt collection and small gift shop.  Don't miss the engraved state history carved into the granite walls to the right of the main entrance and around the right outside of the building.",
  "Although parking is a little confusing with the legislature in session, a trip to the Culture Center and Museum is well worth it. (especially since its free). Its close to the interstate and sits on the capitol's grounds. There were a lot of newer exhibits since I was last there but my favorite is still the lifelike coal mine. Lots of kids there today that were filling out scavenger hunts.",
  "The lower level of the Culture Center is a masterpiece museum of West Virginia's long and curious history, going back to the eons ago when it was south of the equator. Prepare to be amazed, and don't schedule less than an hour. You could easily spend 3 hours and miss half of what is there to be revealed. And you find something that surprises you, for sure. ",
  "It is closed I think on Mondays so find out before you head that way.\nParking is at meter parking, unless its i think its on the weekend.",
  "Located on the State Capitol grounds it is a must see stop for visitors to the Mountain State. The exhibits change periodically, but the message is to tell the history of the State and to show case current artists and craftsmen. It also gives one and opportunity to view a Cass Gilbert designed State Capitol building located next to the Culture Center.",
  "We weren't sure what to expect, but the entire experience was excellent. We were greeted by a nice person who told us about the different floors and exhibits. Completely enjoyed learning more about West Virginia.",
  "For finding out more about West Virginia, this is the place to go.  Beautiful, well-laid out exhibits.  Plan to spend some time here as it is worth it.  A beautiful, clean place.",
  "I went to visit The Culture Center in Charleston to do my family research and I found a lot of interesting facts about WV. My visit turned into a tour because I was fascinated by the deep culture that is hidden in WV. "
 ]
},{
 "name": "Kanawha State Forest",
 "address": "7500 Kanawha State Forest Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/b0/4a/34/kanawha-state-forest.jpg",
 "tags": [
  "hike",
  "kids",
  "hike",
  "nature",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144578-Reviews-Kanawha_State_Forest-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went on the first day hike on New Years Day and it was great. We will be receiving a patch in the mail for doing it which is cute, and our guide was great, everyone was very nice. ",
  "My son and I spent a restful weekend tent camping in early spring. We found a wonderful site (#45) near the mountain stream that goes through the campground. It was a bit cold (40's at night), so we were the only campers, but it made for a quiet and relaxing stay. The campground attendant was friendly and made sure we had enough wood. This seems to be a popular park for mountain bikers, hikers and picnickers. The one trail we hiked on Sunday afternoon was near the campground (Pine Ridge Trail) and led us up the high hill that borders the long, narrow camping area.\nThe drive up to the entrance is a winding, narrow, paved road that has one hairpin curve. But it's worth it to get to this wonderful forest area. From the campground, it's about a 30-minute drive to get to the nearest Kroger. \nI could not get cell phone service in the campground--which was a good thing for this trip. There was limited wi-fi service at the bath house for an occasional weather update. If you like to be away from civilization, this is a great place to recalibrate and relax.",
  "This little gem is close to Charleston and offers camping, picnics, hiking trails, biking trails and fishing pong for kids.  Very beautiful place!!!",
  "There is a local hiking group that organizes hikes every weekend.  I recommend going if you get a chance.",
  "We went on the first day hike on New Years Day and it was great. We will be receiving a patch in the mail for doing it which is cute, and our guide was great, everyone was very nice. ",
  "We drove to this park while exploring the area looking for scenic areas to take pictures of. We found this to be the prettiest by far. At one spot they had a nice loop nature trail with an abundance of interpretive signage. We had visited another park earlier and wished we had come here first as it was far prettier and more natural. ",
  "We camped at Site 27 for two nights, absolutely loved it!! Clean, quiet and level. We hiked a few of gorgeous trails. Staff is friendly and knowledgeable. We can't wait camp at this park again. We traveled from Florida.",
  "Disappointed there was nowhere to swim, but overall really enjoyed the park. Staff was super helpful. \n"
 ]
},{
 "name": "West Virginia Veterans Memorial",
 "address": "Greenbrier Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/4c/b9/ef/veterans-memorial.jpg",
 "tags": [
  "free",
  "walk",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d106638-Reviews-West_Virginia_Veterans_Memorial-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located on the grounds of the beautiful State Capitol and a few steps from the WV Cultural Center & Museum, you hit the trifecta by stopping by the State Capitol as you visit Charleston, WV.",
  "This is a memorial tribute to those WV soldiers who paid the ultimate sacrifice for our freedoms. Be sure to stop - the great sacrifice of so many is commemorated by the names of each person lost in the wars.",
  "On the grounds of the WV State Capitol complex and easily accessible from Greenbrier Street.This is a must see Memorial for all. It is beautiful by day and amazing at night when it is glowing with stunning blue lighting. Parking is very close and free after hours. \n\nThe names of the fallen WV heroes of each war are engraved in concrete to never be forgotten. ",
  "Nice memorial right on the Capitol Complex\nGrounds. Nice walk around. Capitol rotunda is beautiful. Walk the halls to see the portraits and marble.",
  "Every May my husband and I visit West Virginia to put flowers on a friend's grave in Princeton.  We always visit the state capital and the veterans memorial on its grounds.  The memorial is beautiful with the statues of soldiers and sailors of WWl, WWll, Korean War and Viet Nam wars. The memorial is tear wrenching--all those names all those lives lost.  I believe the pool represents all our tears.  Thank you for remembering.",
  "Located on the grounds of the beautiful State Capitol and a few steps from the WV Cultural Center & Museum, you hit the trifecta by stopping by the State Capitol as you visit Charleston, WV.",
  "Beautiful memorial spanning a century of war for our WV citizens.  There is a water most underneath the walk ramps along with a female veteran memorial.  All are located on the state Capitol complex.  There is one hour free parking for those who want to visit the memorial.",
  "This was a very nice memorial with multi conflict representation.   It is on the Capital grounds. This memorial also had a female in fatigues to represent the wo.en who have served.  Well done and nicely placed."
 ]
},{
 "name": "Charleston Coliseum & Convention Center",
 "address": "200 Civic Center Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d2/57/8f/charleston-civic-center.jpg",
 "tags": [
  "art",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1418663-Reviews-Charleston_Coliseum_Convention_Center-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "In planning an event we walked through the old North & South Halls, through the West Wings, and into the new ballroom. WOW! It is magnificent. The wall coverings and carpet are beautiful. The new tables and chairs are impressive. The backdrop are where we are going to put the stage is a 3 dimensional white wall that can be washed with colored lights. The outer lobby area over looks the Elk River and has various conversation areas and art displays.  ",
  "If there had been some decency to open the doors and allow customers to visit another restroom we would have been thrilled.  A large group of ladies trying to use 5 stalls (some unworking) with 2 sinks is unacceptable however the narrow hallway to the restroom was more so.  No paper towels in 1 of 2 dispensers wasn't appreciated.",
  "Very modern look and recent expansion has proved to make this a prime place for concerts, basketball tournaments, trade shows, weddings, or any event. Very clean inside and out. It is a must see when in Charleston",
  "Started letting people in 1 1/2 hour before the concert through the doors and security.   Line moved very quickly with no problems.   Had to wait 30 minutes to go to seats,  but everything was well organized.  We had a great time. ",
  "We attended Chris Stapleton concert.  Great Venue.  Parking was $3.  Compared what we paid on our Nashville visit were shocked.  Will Call tickets were easy to pick up.  We were happy and watched an artist my husband has wanted to see.  We are Steeldriver fans so seeing him solo was a must. "
 ]
},{
 "name": "Haddad Riverfront Park",
 "address": "Kanawha Blvd E",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f0/a4/65/photo1jpg.jpg",
 "tags": [
  "family",
  "walk",
  "affordable",
  "music",
  "food",
  "active",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568887-Reviews-Haddad_Riverfront_Park-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Had an enjoyable evening here with family to see a concert.  The traffic and parking was a nightmare.  We had to park so far away and Charleston is very dangerous at night.  We had family from out of town that wanted to see the concert, otherwise I would never come to Charleston during the day or night as it is very dangerous and people harass you for money.  I have even had purchases stolen.  My cousin was car jacked at a church.  My dental assistant was bodily picked up to be kidnapped and put in a car but was rescued by a stranger.  We had several adult males with us, otherwise we wouldn't have come.",
  "Plenty of seating and a good view of the stage. The Kanawha River makes an excellent background for the performers. Parking just a short walk.",
  "On a warm summer night, while taking a leisurely stroll, you might come across live music, food vendors, and scores of people enjoying life and one of the most beautiful rivers ever.  West Virginia in general is jaw-droppingly gorgeous, well worth a visit, and quite affordable. I urge the West Virginia Department of Commerce and Tourism Office to do more active outreach, as I think that many people are unaware of what a gem WV is.",
  "Went for 4th of July activities and it was great! Kids had a wonderful time and the entertainment was phenomenal!",
  "We went for a walk during our overnight stay in Charleston and luckily found the waterfront area; filled with people listening to a live band.  Sounded like Tom Petty for sure.  Nicest area in the city from what I've seen."
 ]
},{
 "name": "Charleston Town Center Mall",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e3/98/47/charleston-town-center.jpg",
 "tags": [
  "food",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144577-Reviews-Charleston_Town_Center_Mall-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Clean mall. Has many choices for clothing and supplies. Not too much of a wide variety of food to choose from on the 3rd floor. Great atmosphere. Parking is $1.75. Close to hotels and directly across from the Charleston Civic Center.",
  "We were so lucky to have found a mall so close to everything we needed to do over the weekend. \nAlthough we were committed to activities in the Civic Center(right across the street)it was so handy when it was time to eat. \nThere are plenty of places to grab a snack, coffee or a meal. \nThe mall was very clean, with chairs and benches to take a break if necessary. \nDidn't have much time to shop, but there is a nice variety of shops. I did notice the Sears store is closing.  The Hallmark Store was one of the nicest I have ever been in. We wish we would have had more time to explore the facility. \n",
  "They have almost every store you could want, clean, easy to get to , easy parking, right downtown Charleston WV",
  "Went there for post-Christmas shopping, good sales and adequate security which was good. Dying a slow death like all malls, lots of vacant stores, not many people even considering it was right after Christmas. It's a lovely building, glass elevator and 3 terraced floors. Hope the owners can turn it into some type of community rec center, there doesn't to be much going on in Charleston WV in the winter months. Good luck though",
  "All the shops are gone. The place isn’t what it used to be. It’s just run of the mill rundown mall that used to be booming. ",
  "If you want to be seen or spend a lot of money, this is the place to be.  Don’t come looking for bargains.  ",
  "The mall is larger than I expected. Parking was a flat rate of $1.75 ( not sure if that’s just a Sunday rate) and there is plenty of space. Inside the mall there are a good number of standard mall shops but also, sadly, a fair number of vacant units. Overall I was pleasantly surprised.",
  "Shoppers delight! Plenty of shops covering a wide variety of needs, small food court and bigger restaurants on the outside. Clean tidy and late opening with reasonable parking fees. Not my kind of thing but my transfer really enjoyed it. Please not Very little choice of vegetarian or vegan food locally."
 ]
},{
 "name": "Spring Hill Cemetery",
 "address": "1555 Farnsworth Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/3e/68/dd/spring-hill-cemetery.jpg",
 "tags": [
  "historic",
  "walk",
  "walking",
  "history",
  "history",
  "unique",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d6877497-Reviews-Spring_Hill_Cemetery-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Like so many historic cemeteries in America, Spring Hill is not just a goodbye to the dearly departed, it also serves as a quiet and peaceful park, large enough to take a serious stroll and get lost in. Nestled on a green hill full of trees, Spring Hill overlooks West Virginia's charming capital Charleston. It also happens to be, perhaps not surprisingly, listed on the National Register of Historic Places.",
  "A wonderful place to walk with fantastic view of Charleston. Make certain to keep dogs on leash! Deer are commonly seen. ",
  "Good for a couple of hours of quiet contemplation of the funerary monument arts from a century ago.  Well delineated, with numbered spots corresponding to a map.  Great views of the Kanawha Valley below.  Fairly well kept, with paved lanes for driving in slothful comfort or walking sweatily about.  Great spot for local history buffs.",
  "This cemetery tells the history of Charleston and has great views over the city.  It's a nice peaceful little outing.",
  "Large cemetery, lots of winding lanes with steep inclines. Great view of the city. Many large and unique monuments. A must see for history enthusiasts. Closed dusk to dawn. "
 ]
},{
 "name": "Governor's Mansion",
 "address": "1716 Kanawha Blvd E",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/23/e5/a4/governor-s-mansion.jpg",
 "tags": [
  "tour",
  "free",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144571-Reviews-Governor_s_Mansion-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "The mansion is right next door to the capital.  If you visit the capital, make time to visit the mansion if a tour is offered.  You don’t see all that much--four rooms on the main floor--and the tour takes about 30 minutes.  But it is free and nicely decorated.",
  "Short tour of a pretty building that sits overlooking the river. You will see five rooms and see some beautiful woodwork and a remarkable staircase. Tour is short, maybe 15 minutes tops, so worth your time if you are in the area.",
  "The Governor's Mansion is beautiful from the outside, but we tried to make a reservation for a tour and were told that the mansion was being renovated and therefore the tours would be limited to 15 minutes if you can find a time slot that works for you.  We didn't get to go on a tour.",
  "Very nice, traditional styling. Beautifully decorated and surprisingly available for rent for certain groups. ",
  " The guide (Royce) was excellent. We made a last minute reservation and he worked hard to fit us in. Worth an hour of your time and next door to excellent museum and statehouse."
 ]
},{
 "name": "Craik-Patton House",
 "address": "2809 Kanawha Blvd E",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/8a/37/8d/craik-patton-house.jpg",
 "tags": [
  "free",
  "history",
  "knowledgeable",
  "tour",
  "history",
  "free",
  "tour",
  "kids",
  "historic",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568885-Reviews-Craik_Patton_House-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was free (we made a donation).  If you enjoy history you must stop.  The historian was Very knowledgeable.  This is a home that is constantly changing as they acquire new pieces.  There is also a cabin on the property. \nPlan for at least an hour. \nNo gift shop.",
  "This property tends to be overlooked situated next to Daniel Boone Park on the river and besides the Moose Club.  Docent Nathan Jones conducted tour during his lunch time and was very articulate and well versed in connecting family/events to make history come “alive “.  We’re very glad we stopped at this free attraction.  Home is well maintained and loved.",
  "Kids enjoyed this tour and it was just enough.  He even recommended other places to visit close to the area. ",
  "Historic home that can be viewed inside during park hours. Home has historic ties to both the Civil War & WWII. It was constructed in 1834 and of the Greek Revival style architecture. Informative staff will be happy to give all the details. Beautiful grounds.",
  "The Craik-Patton House is the second oldest home in Charleston dating back to the mid-1800s.  It’s a lovely home, I was able to see how the different families lived, learnt a little bit of history about the state and made a new friend in the form of tour guide Hayes."
 ]
},{
 "name": "Avampato Discovery Museum",
 "address": "300 Leon Sullivan Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/de/25/d1/avampato-discovery-museum.jpg",
 "tags": [
  "art",
  "family",
  "art",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d144582-Reviews-Avampato_Discovery_Museum-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I went to the da Vinci  exhibition, and with some time on hand, I discovered the \"childrens city\", with a play supermarket, bank, service station and many more .... so cute for younger children☺.\nda Vinci was more than expected an I enjoyed all his foresight of machines and movement and his paintings.\nAlso the planetarium runs movie shows in high definition and great sound.\nA place to visit if you have an inquisitive mind.",
  "Avampato & Clay Center is a complete performing arts museam that also adds science & art. The museam is conviently located downtown close to CAMC General Division and has many activities for the whole family. Many of concerts have I enjoyed there. Very nicely decorated & no matter where you are seated you always have a good view of the stage. Children can experience hands on art activities and play with the exibits that are on display. Planetarium is impressive. ",
  "what an amazing, safe and fun venue for children...unfortunately, the hours kind of suck...not everyone are stay @ home parents...please consider staying open until 8pm, 3 or 4 days a week, especially in the summer...we are about an hour and 1/2 away...we work...your current hours exclude a lot of good people...",
  "My husband and I took our ten year old daughter. We loved the exhibits, but the snack bar never opened. We ended up filling up cups at the water fountain to stay hydrated. We loved the National Park Adventures planetarium show. It was so relaxing. I watched it with a smile on my face the whole time. We also enjoyed the exhibit in the art museum. We would visit again, but we would bring along some snacks and bottled water. ",
  "The exhibits are very entertaining and wonderful learning experiences. Plan a reasonable length of time as it is hard to drag the kids away.\nGo to the Water Works last as they mostly will get a little bit wet. "
 ]
},{
 "name": "Yeager Airport Observation Area",
 "address": "100 Airport Rd 2nd Floor",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/a8/9b/f9/visited-the-observation.jpg",
 "tags": [
  "food",
  "history",
  "food",
  "eat",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d10354662-Reviews-Yeager_Airport_Observation_Area-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Flew in to and out of this airport a few times, always a good experience, drop off parking is OK, but limited on time, so friends have to say goodbye long before the flight takes off, longer term parking is expensive.\n\nInternal services are good, the airport is on top of the mountain, so your already half way to the clouds before you even get on the plane, staff are helpful and security is well managed and quite quick, food services are a little limited for both choice and quality, but flights run on time each time I was there. Very easy access to the Freeway and WV a great place to visit.",
  "The observation area is a great place to hang out and watch planes take off and land. There are some awesome views of the runway, so be sure to bring a camera. Lots of opportunity for some really cool pictures. If you are into history be sure to check out the display cases. Lots of interesting things from the airport decades ago, as well as, the Pentagon artifact from 9/11/01. Absolutely worth checking out and visiting again!",
  "Flew in to and out of this airport a few times, always a good experience, drop off parking is OK, but limited on time, so friends have to say goodbye long before the flight takes off, longer term parking is expensive.\n\nInternal services are good, the airport is on top of the mountain, so your already half way to the clouds before you even get on the plane, staff are helpful and security is well managed and quite quick, food services are a little limited for both choice and quality, but flights run on time each time I was there. Very easy access to the Freeway and WV a great place to visit.",
  "great airport with extremely nice folks who go there. but I was flying in from charlotte and American delayed my plane for over 2 hours. my poor boyfriend was stuck at the airport for 2 hours (this airport only has one place to eat and it closes at 8pm) my flight didn't get in till 9:30/10 ",
  "Fine vantage point for watching the airplanes come and go.  And, it is all perched on a mountain top!",
  "A family friendly place for those that love aviation and airplanes.  Please know that this is not a very busy airport compared to other airports so it is important to time your visit when there are planned takeoffs and landings or you will be disappointed.\n\nGoing on a cold or hot day, visitors will have the benefit of watching from a enclosed observation area with good views of the runways.  After watching the takeoffs and landings, you should take time to peruse the interesting artifacts around the public areas.",
  "Nothing but an area where you can watch a plane depart. Not very clean and little information. Can be upgraded.\n\n"
 ]
},{
 "name": "Mountain State Distillery",
 "address": "800 Kanawha Blvd E",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/88/fa/af/official-logo-of-mountain.jpg",
 "tags": [
  "art",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d17381362-Reviews-Mountain_State_Distillery-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We stopped in on a weekend evening, tasted the samples, and the cinnamon infused moonshine, I will never be able to forget it was so good. We had a good time talking with the owner and learned a lot from one another. Highly recommend!",
  "A must stop if you are in the area and enjoy spirits! So smooth! Got a great thing going. Can't wait to see where he will be in a year.",
  "A surprisingly good whiskey...very smooth.  A fantastic addition to the Mountain State.  A quaint shop with the distillery on site.\n\nTake time for the visit..very much worth it ",
  "Wonderful and friendly place go by and visit  genuine people making genuine products support your local people and go by a visit a spell",
  "Visited Mountain State Distillery during Charleston’s Art Walk. The staff and owner are very friendly and helpful. We tasted three different selection the original, cinnamon and vanilla. The original was very smooth and the cinnamon was not too overpowering how some cinnamon whiskey can be. The Vanilla was my favorite so I will definitely be back to purchase it as soon as it becomes available next week. They also have nice shirts, cups and flask available for purchase along with bottles of whiskey."
 ]
},{
 "name": "East End Historical District",
 "address": "Bradford and East at Kanawha",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d2/58/db/east-end-historical-district.jpg",
 "tags": [
  "walk",
  "history",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568886-Reviews-East_End_Historical_District-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was once a place of beautiful homes and excellent families.  Now the houses are chopped up into multiple apartments that are poorly cared for.  Many homes have fallen in disrepair and some have had to be destroyed.  Lots of druggies and junkies in this area.  Not a place you would walk at night and not alone during the day.",
  "Sadly, many of the stately old houses have fallen to disrepair.  The area is filled with Charleston's history from Early 1900's.",
  "The houses in this area are incredible testaments to architectural passion and trends of yesteryear (generally turn-of the century through the 1920s). There are some fantastic properties in this area that should be better looked after and restored, not simply renovated to the trends of the day. A pleasure to drive through but it would be nice if some of the properties were restored and opened for tours. I recently viewed a property that had what appeared to be antique Dutch Delft tiles built into it. Definitely not something to let go to waste. ",
  "During our first full day in Charleston (and the only one of four days that was sunny and warm), my spouse and I walked from our downtown hotel to the state capitol along the Kanawha River. The Historic East End is a 110-acre district that contains more than 400 historic buildings including a wide variety of architectural styles ranging from neo-Classical, Greek Revival, Georgian to mid-19th century pre-World War I styles. In addition to the buildings, one also finds signs marking such historical sites as Fort Lee, built in 1788. After our visit to the capitol complex and governor's mansion, we meandered through various neighborhoods and along multiple streets. It was a pleasant day in the neighborhood!",
  "the houses here are beautiful but this is a dangerous place.  there are cigarette butts, everywhere, the place smells of urine, and street people aggressively ask you for money."
 ]
},{
 "name": "Wallace Hartman Nature Preserve",
 "address": "adjacent to Hampton and South Ruffner Roads",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d2/52/45/photo1jpg.jpg",
 "tags": [
  "hike",
  "walking",
  "walk",
  "family",
  "nature",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568902-Reviews-Wallace_Hartman_Nature_Preserve-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This trail is a bit over a mile long but is not an easy walk in the park.  This hike is for those who are fit and able to do some uneven and uphill walking.  If you are fit, go for it!",
  "Nice little trail in our neighborhood. Very family friendly and easy to follow. Picnic tables located at the bottom as well as a nice bench to sit and rest while enjoying the forest. ",
  "We enjoyed this beautiful nature preserve. Only complaint was the lack of signage and trail maps. It would be easy to get lost so we simply hiked in and then re-traced our steps back. But it is a quiet pretty location.",
  "This place is located in a residential area and basically starts from on top of a hill and goes down the mountainside (gradually). Make certain to bring your hiking shoes. Trail is maintained and very nice. Wildlife is all around with deer everywhere.",
  "Minutes from downtown. Take a picnic and enjoy the scenery- there are two picnic tables along the trails.  The trails are steep in short sections, but not difficult to manage. The lower trailhead on Adrian road is the easiest access, a gradual ascent into the Preserve.  There is a small family cemetery, its location is marked. I've seen lots of Deer, Pileated Woodpeckers, Turkeys, and, Black Bears-you forget your only 2miles from downtown Charleston. \n\nMelvin Newman. Charleston, WV"
 ]
},{
 "name": "The Art Emporium",
 "address": "823 Quarrier St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/db/0d/28/conveniently-located.jpg",
 "tags": [
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568923-Reviews-The_Art_Emporium-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place, wonderful owner and superb service. Custom framing is special. The local art showcased is really nice. ",
  "Traci and her team are all over it. Quality local artwork, both for sake and on display. The place to be during Artwalk. Wonderful framing skills\n ",
  "I’ve ordered online, gone in etc and my service and products have been exceptional.  I purchased a clock that is amazing.",
  "my honey got me a nifty trinket from the emporium and i love it!...he said there were so many things to pick from...i look forward to visiting w/him next time we are in town!...",
  "Many exquisite items for sale, ranging from handmade jewelry to pottery to art work and more.  Everything presented in an attractive manner and overseen by a very helpful and charming salesperson."
 ]
},{
 "name": "Criel Mound",
 "address": "301 7th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/99/6e/82/criel-mound-in-south.jpg",
 "tags": [
  "history",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d15746964-Reviews-Criel_Mound-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very glad we stopped to see the burial mound and discuss its preservation.  Would have enjoyed more interpretive signs and a different placement of the adjacent stage.  Adored the well-built, \"natural looking\" stairs to the top.  Surprised it was literally in the town -- there have to be some fabulous interpretive insights there.  ",
  "The Criel Mound is a Native American burial mound located in South Charleston, WV. The mound was built by the Adena culture, around 250–150 BC. A prior excavation by the Smithsonian Institution located 13 skeletons inside.\n✤\nThis was my first experience at a Native American burial mound and it was better than I could have hoped. This mound is located in the heart of South Charleston but is easy to get to, with parking right in front of it. There are two staircases set into the mound with long, generous steps that follow the gentle curvature of the mount up to its summit. From the top, you have a nice view of the surrounding neighborhood. Never once did we feel unsafe in the area and we could see our car the entire time. The size of the mound is impressive too! \n✤\nMy experience at this mound has made me want to visit other mounds in the region and explore the history of the mound-building cultures that inhabited the surrounding valleys, so kudos to this simple mound for inspiring so much interest! ",
  "If you like history and are in Charleston, or just passing through, this is a really cool spot.  It is an ancient Adena Indian burial mound.  The park around the mound is beautiful and they have several displays giving you the history of the people, their culture and information about the mound.  There are several restaurants close by.  We discovered it when we stopped for lunch on a cross country road trip.  The kids spent about an hour running around the park and up and down the steps."
 ]
},{
 "name": "Shoney's Big Boy Museum",
 "address": "116 Kanawha Blvd E",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/59/8d/56/i-can-t-remember-where.jpg",
 "tags": [
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d12479081-Reviews-Shoney_s_Big_Boy_Museum-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Stopped on the way as were going to another attraction.  Very small, took only about 15 mins to see it all.  If you like quirky, then you will like this.",
  "So we have to DO something in each state in order to \"count\" it as a state we've visited.  For West Virginia, we stopped at this place.  It is just a big statue with some information about the Big Boy burgers on it.  It literally took us 5 minutes, but for a quick quirky fun place to stop, this worked.  And we've never eaten at one-not sure where they are but not in Iowa.",
  "This is a quick roadside attraction on the west side of Charleston. (Address is NOT correct here) as it is on Kanawha Blvd W, not East. \n\nThe \"museum\" is a few windows of history about Shoney's Big Boy as this was the site of the original. It's a nice tribute, but only really interesting to those that remember it.  ",
  "It is not a museum...very much a shrine to days gone by. It is a pillar/plinth of sorts with a Big Boy on top. Around the base is information regarding the foundation of both businesses and the link between them.",
  "This is basically a small shrine to Shoney's. There is column with a BIg Boy on top and a plaque with the history of the restaurant below as well as some pictures. Interesting to see if you are in the area."
 ]
},{
 "name": "Charleston Convention & Visitors Bureau",
 "address": "800 Smith St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/b3/ca/9d/wanting-information-on.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d12902970-Reviews-Charleston_Convention_Visitors_Bureau-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had just passed thru Kentucky and were about 6 miles into West Virginia on Highway 64 when we saw the Visitors Center.  Since we were headed for our first trip to West Virginia and weren't sure what to see and do, we were fortunate that Gwen Knoll and Jacob Paxton were working there that day because they were both so helpful.  They gave us maps and highlighted places that we would be interested in seeing near Charleston (where we would be staying).  We walked out of there with a wealth of information about the area, and we took their advice -  visiting all the great places that they told us about.  How lucky for us that they were still open when we arrived because it was getting late in the day!",
  "Our questions were answered thoroughly and we were given great suggestions for entertainment.  Very pleasant.",
  "Needing to stop and take it all in, we decided to stop at the visitor center and get the necessary information for our stay in W. VA.  The attendants were very helpful and the maps guided us through the town.",
  "They offer a nice selection of state and local information.  Located in the Capitol Market is a big plus. Grab some treats before hitting the road!"
 ]
},{
 "name": "Cato Park",
 "address": "200 Baker Ln",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "kids",
  "historic",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568882-Reviews-Cato_Park-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Cato Park is a nice small park in Charleston. It has hills and hiking trails. It has hills and wild deer. The 9-hole golf course needs work, but it is a municipal and therefore with minimum funding.",
  "This is not the best park in Charleston, Coonskin is much better.  It has a small playground for kids and a golf course.",
  "We had this little gem all to ourselves as it was a brisk Sunday morning.  I enjoyed the drive to Cato Park, viewing all the beautiful and historic houses along the way.  What a great place to bring one's dog as there are doggie disposal stations around the course.",
  "Not  for those on the PGA tour but fun to play, and not very expensive. Pools are very nice, in the summer. Several tennis courts are available. The park is easy to access, not far off the interstates. ",
  "Named after the benefactor Judge Cato.  He had a camp in St Albans near my mothers beach and would visit with my family often and he always attended my sister Luana's birthday parties and he would dance with Luana "
 ]
},{
 "name": "Charleston Baptist Temple",
 "address": "209 Morris St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/6a/a7/26/worship-service-may-28.jpg",
 "tags": [
  "music",
  "music",
  "music",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1574727-Reviews-Charleston_Baptist_Temple-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very friendly members and nice dignified service.  Upbeat sermon and with audience participation through well selected Bible passages. .(When I was there the choice was a lovely portion of Proverbs)  A very pleasant and thoughtful service.  One of the best choirs I've ever heard and highlighted by powerful piano and organ music, and just a little offering of beautifully executed bell ringing. The place to spend your Sunday morning if your visiting.",
  "The Baptist Temple (American Baptist Convention) is a beautiful, well-maintained, traditional church located at the western end of the Historical East End District.  It is large, physically, and the welcome you will find inside is equally large.  The music is outstanding, and the organ magnificent.  Child care is available during Sunday School and church services.  There are several child/youth programs.  Members of the church are actively involved in outreach programs, and support a large number of local organizations.  Entertainment is frequently presented in the Fellowship Hall.",
  "The facility was a beautiful building built in the early\n1900's.  The service was uplifting!  Message and music was well received.",
  "I have been away from my home church and just needed some christian company. I was treated like a long lost relative the people were friendly and helpful. the service was nice and the choir fabulous. I will surely visit agai if I am still here on Sunday!",
  "If history and historic religious facilities is of interest to you then this should be on your list of things to see."
 ]
},{
 "name": "Magic Island Park",
 "address": "",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d14052719-Reviews-Magic_Island_Park-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park has a great bike trail and a playground and on the river.  There is free splash park but the water wasn’t on, which made the park a little less than magical. We could not figure out how to turn on the water, several families came while we were there with hopes of the water being on, there are bathrooms which is a bonus! Enough to do to spend 30 minutes if you didn’t bring your bikes.",
  "If you wonder why the park is referred to as Magic Island it is because often it submerges underneath the Kanawha River during high waters. Not much is there but it does make for a nice walk by the river. Often during different seasons events will be held there.",
  "This park was an Island built along the Kanahwa river.  It is scenic and has play equipment for both children and adults."
 ]
},{
 "name": "West Virginia Symphony Orchestra",
 "address": "One Clay Square",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d2/56/dd/west-virginia-symphony.jpg",
 "tags": [
  "performance",
  "music",
  "performance",
  "music",
  "family",
  "music",
  "creative"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568897-Reviews-West_Virginia_Symphony_Orchestra-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have enjoyed the performances of the WVSO for more than ten years, and it gets better and better.  Under Maestro Grant Cooper both the musicianship and the programming improved dramatically.  When the symphony moved into the Clay Center it found an acoustically superb performance space.  There is an extensive education component and concerts are offered in locations outside Charleston.  The symphony is now selecting its next music director and there is every prospect that it will continue to excel.",
  "We went to see the Nutcracker and it was wonderful.  The music was just lush and captivating.  My entire family loved the performance and the seating at the Clay Center is great.",
  "I always greatly enjoy the Symphony when I am able to attend.  They put on some wonderful performances and are very professional.  Nothing second class about them at all.  If you enjoy great classical music by very talented people, I suggest you go to one of their performances soon.",
  "The WV Symphony Orchestra is outstanding and the Maestro is innovative and creative.  He often creates arrangements for fun.  At Christmas he arranged The Twelve Days of Christmas with a different composer style for each \"day\". Great fun to try to guess each one.  The answers were available on their website",
  "For a city this size, this is a great orchestra. The symphony's home is the Clay Center which is a lovely venue with great acoustics. "
 ]
},{
 "name": "Charleston Light Opera Guild",
 "address": "411 Tennessee Ave Guild Theater",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1568922-Reviews-Charleston_Light_Opera_Guild-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Light Opera Guild is still doing great work.  The performances are top notch and I love to go for an evening out.",
  "For a city this size, it CLOG puts on great shows and draws from great local talent!  I've even been to shows that match the quality of those in NYC.  Prices are very resonable.",
  "Each show is enjoyable and well presented.  I would recommend taking the time to enjoy an evening with this group.",
  "Great shows, excellent costumes, lighting & sound.  Wonderful orchestra - I felt like I was watching a Broadway show.\n"
 ]
},{
 "name": "Charleston City Hall",
 "address": "501 Virginia St E",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/2f/a9/f1/city-hall-charleston.jpg",
 "tags": [
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d1574621-Reviews-Charleston_City_Hall-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Big clock in front of city hall and ornate fixtures throughput-it houses the Charleston city police Department and the Mayors office ",
  "The Charleston City Hall is a classic granite tomb of a building, located near the Great Kanawha River. Personally, the only reason to visit here would be to conduct any business inside. Nothing special.",
  "For those who enjoy seeing historic buildings with attention to detail, visit the city council chambers.  The detail in the woodworking is a reminder of days when quality mattered."
 ]
},{
 "name": "T-Rex Science Center",
 "address": "520 Southridge Blvd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58947-d19972823-Reviews-T_Rex_Science_Center-Charleston_West_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visited the T-Rex Science Center today to check it out before taking our grandchildren.\nGreat displays of several dinosaurs and fossils. Also has several stations for children to participate in learning activities. There was a Paleontologist who was available for q and a if needed. As I understand the Museum will be moving to Bigley Avenue later this year to a larger facility. The curator has a great passion to make available this learning experience for WV  children and their family. We are members of the Clay Center. Would be a great fit to partner this learning center with the Clay Center. Also has a well stocked gift shop and you can even have Birthday parties there also."
 ]
}]
