[
{
 "name": "Wyoming State Museum",
 "address": "2301 Central Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/c2/69/ed/hands-on-habitats-lab.jpg",
 "tags": [
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279397-Reviews-Wyoming_State_Museum-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Wyoming State Museum is not widely advertised. It is a well curated, extensive collection and an enjoyable atmosphere. It's worth a visit or even ten.",
  "It has a little something for everyone!  The children's section is great cause it's all hands-on!!  There are other sections which are also hands -on.  It is a great small museum.",
  "You can't beat the price- it's free. It's also a very user-friendly museum. The exhibits are well-thought out and I learned a lot about the state. Some of the exhibits could use a bit of modernizing, but don't let that stop you from going and learning about sheep wagons, Western furniture, and more.",
  "We visited the State Museum while we were waiting for I-80 to open.  It was interesting to our young son.  He loved hearing about water bottles made out of bison bladders and looking at all the old artifacts.  Its a good place to stop if you have time in town.",
  "What a nice way to spend an hour or two if you are in town. The museum was quaint and clean. Each exhibit had an explanation that would be easy to understand for anyone. Make sure to go upstairs to see the Native American portion of the exhibit. It was worth it."
 ]
},{
 "name": "Cheyenne Depot Museum",
 "address": "121 W 15th St Number One Depot Square",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/54/18/eb/cheyenne-depot-museum.jpg",
 "tags": [
  "historic",
  "knowledgeable",
  "historic",
  "history",
  "history",
  "walk",
  "history",
  "history",
  "historic",
  "knowledgeable",
  "history",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d582386-Reviews-Cheyenne_Depot_Museum-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Excellent place to visit in general and the depot museum certainly a must.\nVery informative staff and, as you would expect, full of train memorabilia and the model train exhibit (which one man took years to complete) is well worth seeing and children would love it.\nLots of things to do and see in cheyenne itself and we would recommend the horse drawn carriage ride where a very b\nKnowledgeable gentleman driver gives so much local information on the historic buildings as you ride in style.",
  "This is a very nice museum about railroading in general and the great Union Pacific specifically. It has some very fine displays of how locomotives work and beautiful historic records, models, artifacts, charts and maps showing in great detail the history and story of the Union Pacific.It is also nice that it is housed in the fine building that was the actual depot that was used by the UP in Cheyenne. Right out back is the famous UP Steam Shop where Big Boy 4014 was restored, and where 844 and 3985 reside. Along with the State Capitol building, this museum should not be missed by any visitor to Cheyenne.",
  "A good way to spend an afternoon, good price and plenty of railroad history, be sure to walk out the back and upstairs to the comfy chairs and watch the train roll past form the inside viewing area.",
  "$8 entry fee I initially thought was a bit high but after visiting this great museum I think it is spot on.\n\nIt follows the history of the Union Pacific Railroad and building of the transcontinental route and the “Hell on Wheels” people that built it.\n\nThere is an observation area on the upper floor where you can watch the passing parade of UP freight trains which never gets old and also a model railroad. \n\nOpen from 9am until 5pm M - F and 3pm weekends in a beautiful part of downtown Cheyenne.\n",
  "The Cheyenne Depot Museum provided a nice afternoon for my son & me.  Don't overlook the miniature gauge layouts on the second floor.  They are amazing.  Guests even get to operate selected trains.  \nThe museum on the first floor is also nice.  Our visit was enhanced by another visitor who had been a train engineer his entire life.  He talked to my 18 year sold about the trains and their mechanics for the better part of an hour.  My son didn't mind at all - he loves all things mechanical!  I highly recommend a stop here.",
  "What a great place to visit with a group or even alone, definitely worth your time to step upstairs and interact with the lovely model train staff!",
  "We were surprised at the gorgeous Depot Museum in Cheyenne, WY.  Attractive, informative nicely restored and helpful docents.  A look back at the railroad history across America.  ",
  "Very interesting items to review. Great old train details and a very nice minature set up depicting the travel out west in olden days, doesn't operate every day though so need to check first.",
  "Excellent place to visit in general and the depot museum certainly a must.\nVery informative staff and, as you would expect, full of train memorabilia and the model train exhibit (which one man took years to complete) is well worth seeing and children would love it.\nLots of things to do and see in cheyenne itself and we would recommend the horse drawn carriage ride where a very b\nKnowledgeable gentleman driver gives so much local information on the historic buildings as you ride in style.",
  "The history of Union Pacific and other railroad lines is well presented in this museum.  My main purpose for going was to see the architecture of the beautiful building.  It did not disappoint.",
  "We were just breezing through on an overnight stay and we stopped over there. We did not actually go in the museum we went to the visitor center. Could not find anything on TripAdvisor for the visitor center. The lady was very helpful. It is a cute quaint old historic town."
 ]
},{
 "name": "Cheyenne Frontier Days Old West Museum",
 "address": "4610 Carey Ave Frontier Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/06/81/84/frontier-days-museum.jpg",
 "tags": [
  "art",
  "theatre",
  "history",
  "history",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d278944-Reviews-Cheyenne_Frontier_Days_Old_West_Museum-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Even if you are not in Cheyenne during Frontier Days in July, you can go to this museum at any time. The memorabilia about Frontier Days and Wyoming are interesting and nicely displayed. What really stands out is that there is also a huge stage coach collection, including carriages from other parts of the country. There are so many that there is an entire auditorium sized room as overflow of carriages. It's amazing that they are all in this one museum.",
  "Fabulous sculptures outside - inside very friendly & helpful staff plus a great display of old west transportation beautifully restored.  Memorabilia for Rodeo fans & great gift shop as well.  Time well spent!",
  "Definitely plan on spending some time here! The museum is great, lots of historical information and artifacts, as well as a art show that happened to be on display while we were there. The museum has some wonderful pieces, and a little video viewing area - complete with movie theatre style seating - with so much rodeo history footage!",
  "Frontier Days are a big hit in Cheyenne, WY during July each year with rodeo, exhibits and participants.  If you can't make it here in July, visit the Old West Museum that chronicles the history of this incredible town and the Frontier Days they celebrate.  Well worth seeing.",
  "Even if you are not in Cheyenne during Frontier Days in July, you can go to this museum at any time. The memorabilia about Frontier Days and Wyoming are interesting and nicely displayed. What really stands out is that there is also a huge stage coach collection, including carriages from other parts of the country. There are so many that there is an entire auditorium sized room as overflow of carriages. It's amazing that they are all in this one museum.",
  "What a great local museum.  We were the only ones in the building on this frosty day so we took our time and read everything!  Great videos, memorabilia and of course, the buggy collection is amazing.  So much rodeo and Cheyenne history.. we really enjoyed our afternoon.",
  "We visited this on the TROLLEY RIDE and it was very interesting to see the old wagons and cars they have restored. This is next to frontier days stadium and we saw a few videos about that program that were informative.\n",
  "First and foremost, the gal at the front desk would bring me back all on her own. I’m sorry I didn’t get her name, but by golly she’s spunky! Not being particularly “into” the whole Western thing, we came here because it’s what ya do when in Cheyenne -  we’re consummate tourists. I enjoyed the maaaany carriages, and learning a bit about rodeo events. There were no children in the kids area when we visited, so we availed ourselves of the opportunity to dress up with the bonnets and take funny pictures on the toy horses. Of course, we put everything back away where we got it from! Good museum with awesome staff!"
 ]
},{
 "name": "Southeast Wyoming Welcome Center",
 "address": "5611 High Plains Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e7/41/24/photo0jpg.jpg",
 "tags": [
  "free",
  "learn",
  "history",
  "historic",
  "knowledgeable",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d3953858-Reviews-Southeast_Wyoming_Welcome_Center-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great exhibits. Friendly staff. Free maps and brochures. Tons of great ideas about places to see in WY. This is a combination museum, welcome center trip planned. Stop in and this is why.",
  "Driving cross country with my pup.  We needed a break and stopped. Center is clean, modern, and bright.   Lots of history there.  Facility is 1st rate. Grounds are nice.  There is a pet exercise area which is a small corral.   Animals can run and play, safely.\nFELT LIKE A MUSEUM.  So much history to learn about.  Nicely decorated. Lots of parking.  ",
  "This is a great pit stop. Very interesting exhibits. We loved everything. Interesting dinosaur exhibit and frontier artifacts.",
  "Plan to spend 20-30 minutes here just looking at displays and info on nearby historic locations.  Very freindly and knowledgeable greeters. ",
  "We've been before so we knew to allow plenty of time. There's information about the history, geography, places to visit and why you should go there. Lots to read about on the walls and literature to take on areas you might want to go. Planty of car parking, clean toitles and friendly helpful staff to answer your questons. I took photos of the mammoth replica and of the interesting facts/figures on the large wall panels, as there's a lot to take in and remember"
 ]
},{
 "name": "Cheyenne Frontier Days",
 "address": "4610 Carey Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/06/84/e8/old-yellowstone-carraige.jpg",
 "tags": [
  "art",
  "music",
  "history",
  "delicious",
  "free",
  "affordable",
  "music",
  "sampling",
  "drink",
  "food",
  "family",
  "family",
  "kids",
  "food",
  "music",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d8820183-Reviews-Cheyenne_Frontier_Days-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Well they call CFD the daddy of 'em all and they're not kidding. Not like we've been to any other rodeos, but given the scale of this one I'm not sure how it could be beaten. \n\nThe main attraction for us was the rodeo itself and it didn't disappoint. It was exciting, riveting and everything we hoped it would be and then some. Each event was introduced, with the MC making sure to explain everything that would be happening clearly, so newbies like us understood exactly what was happening and how each event was being scored. We also got a bit of history on how the events developed and information about participants backgrounds too which was interesting. It was a blistering hot day (we attended 23 July 2016) and though our seats were in an uncovered part of the stands, there were water misters and plenty of stands to buy fresh icy lemonade to cool us down. Restrooms were also good within the rodeo area.\n\nWhile there we also visited the indoor market (some weird and wonderful cowboy and native american items, from art and craft works to clothing, jewellery, and tech gadgets). We also went to the frontier town, which was cute, with some interesting live presentations, including a blacksmith explaining his craft and a petting zoo. We also visited the Indian Village where we watched ceremonial dances performed in full ceremonial dress, with live music and singing and also commentary introducing each dance, its significance and the dancers performing it. We ate Indian Tacos there (delicious) before making our way home late afternoon. It was a pretty full day and exhausting in the heat but totally worth it - we're all rodeo hooked now!\n\nTip: we used the Bull park 'n' ride which was efficient and super good value for money at 10USD per car, which also included our entry fee to the rodeo grounds.",
  "The Cheyenne Frontier Days rodeo and surrounding events are fabulous and well worth you time and efforts!  The rodeo events are great and include things like bull riding, bare back bronco riding (personal favorite), saddle bronco riding, barrel racing, and more.\n\nThe rodeo events are roughly 12:15 to 3:00 each day.  There are lots of surrounding activities to fill the other morning, afternoon, and evening times.  Cowboy Church on Sundays, carnival, chuck wagon cook offs, and lots of vendors offering western and Indian items. \n\nParking - go early and park on the site, or at a nearby park and ride the event bus.  If you get there really early (10ish)  there is off street parking in the neighborhood. \n\nEvent store has lots of fun stuff from t-shirts to high end cowboy boots - special edition boots.\n\nIf you know you are going, get the 2016 Guide to Cheyenne Frontier Days, which contains all the maps, event schedules, and articles on the events and interesting local stuff.\n\nCFDRODEO.COM",
  "First ever visit to this rodeo. The park&ride set up was fantastic. Super easy to use and lots of busses. All the staff were very friendly and the venue is excellent. Plenty of bathrooms and amenities. Lots of carnival rides and things for all ages. Big Bubba's BBQ was soso on the ribs. But everything else was first rate. Corn dogs were best I've had in a long time. ",
  "I've been wanting to go to this event for years but don't endorse animal abuse so went with my friend who's knowledgable about such things to be sure I didn't end up paying to watch something cruel. We avoided the actual rodeo events but had a great time at the parade, shopping at the stalls, seeing the Western Experience and wild horses that been brought in to BLM auction, watching the American Indian dances in the Indian Village, sampling food, and going to the Tim McGraw concert. \n\nWe had trouble at first locating the free shuttle in the morning which was hilarious because it turned out we were standing right in front of the \"Free Shuttle\" sign. We ended up being able to call someone to drive us out to the fairgrounds. There were tons of lines but somehow whenever we happened along the line kind of dissipated and it seemed we never waited. We had difficulty finding wine; turns out the general CFD cowboys are not big wine lovers. Oh well, we made do and spent a nice while chilling in the Garden. We perused all the food before choosing Grandma's Kitchen as the only place that had anything with any semblance of nutritional value. After we had checked out everything we had a drink at Buckin' A Saloon before our concert. They had a live band. It was nice but crowded and we were a little out of our element being older Denverites in a land of younger cow folk. The concert was good and amazingly affordable at $135 for two tickets.\n\nFinally, the most horrible tortuous part came after the concert when we were exhausted and could not get out of those fairgrounds to save our lives. After standing in line for a mile we got on a bus  that took us to a parking lot even further from our hotel in town. By the time we got back to the fairgrounds, the shuttle services were done and there was not an Uber to be had. We thought we were going to have to just give up and move there. There were drunk freezing people actually crying all around us. To make matters worse, we were carrying a big metal rooster I had bought my husband. We were beyond thankful when we finally engaged a pedicab kid. Like, it was one of the happiest moments of my life when we were sailing along the town streets listening to awesome music in a bike wagon headed to our hotel. I think we paid him around $50, completely worth it. One crazy, exhausting, fun day.",
  "Just plain clean fun!  Best of the West!  Parades, Rodeo, Hometown Fair, Dancing, Music......There is just nothing I've ever experienced that was so much family friendly fun.  Whether its every year or once in a lifetime......Not to be missed in your lifetime!",
  "Cheyenne Frontier Days was the highlight of the summer for us. We made a trip out west with Cheyenne Frontier Days being the main focus and it was all we expected and more. My kids were completely entertained! They loved every minute of it and never asked if we could go or said they were bored. We went to the rodeo two days, the PBR one night, and spent a day at the carnival and in downtown Cheyenne. My family wants to go back!",
  "The Trolley Driver/Guide briefly stopped at the ARENA where the activities for the Cheyenne Frontier Days  take place annually during the last two weeks of July.  Learned that it could accommodate as many as 500,000 people! Near the venue are more tourist attractions such as a museum, Botanical Garden, etc.\n\nShe explained that the main reason for this event is to bring back the days when cattle ranching was prevalent in the city. Ranchers moved out and left the city when their cows were decimated by a blizzard.\n\nI will definitely come back in Cheyenne to personally experience this exciting event, particularly the RODEO Competition!",
  "Worlds largest outdoor rodeo.  Awsome. Bull riding. Bare back riding. Steer roping. Mutton bustin with little kids.  Wyoming cowboy bull riding champion 🥰🥰. People from different countries come to this event.  Also. Carnival.  Great food.  Music.  Blue angels fly show is great"
 ]
},{
 "name": "Terry Bison Ranch",
 "address": "51 I-25 Service Road East",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/22/1d/e7/terry-bison-ranch.jpg",
 "tags": [
  "free",
  "family",
  "unique",
  "food",
  "tour",
  "history",
  "tour",
  "food",
  "free",
  "family",
  "food",
  "field",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d2284971-Reviews-Terry_Bison_Ranch-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Northbound on I-25 just past the colorado/wyoming border is where this place lies. Even though it's right off the interstate, you would miss it if you blink.  This place is a Hidden Gem  with lots of fun activities such as horseback riding the bison train where you can ride out and get up close and personal and feed the bison.  There are also a multitude of different animals on the ranch you can see for free and the Senators Steakhouse is also on the property where you can get an awesome bison burger. If you're ever in the area you should definitely check this place out especially if you've got a family with children.",
  "So glad we were able to visit this place.  Restaurant has excellent food (try the bison burger!) and server was extremely courteous and friendly.  Highlight was taking the train and hand-feeding the bison.  Was really unique and fun experience & highly recommend it!",
  "Worth the train ride around the ranch excellent service at the restaurant and gift shop great for cabin rentals and RV enjoyed the tour guide and the information provided regarding the history of the ranch and the area in general overall excellent experience and a great day trip",
  "Really hard to enjoy in the cold weather! But if you bundle up it’s still fun! Fed the buffalo, rode horses and took a few photos. Only took us about an hour and a 1/2 to do everything. ",
  "We went with our son, daughter-in-law and a 6 month old baby. It was a lot of fun. Got to see pleny of bison and the trip is well narrated by the conductor/tour guide. \n\nIt does get a bit cold out there (we visited on a pretty clear, sunny day in early January. Temp was about 30 F. Train doesn't have much (any?) heat so please come dressed for the conditons. Gets a little drafty on a one hour tour. But you get to see the bison in their element, and feed them.\n\nIt feels very safe and fun. They encourage you to visit the restaurant aftewards but we had enough by the time we got ouit and thawed out. General store is there and you can get some coffee and snacks. Not much else around.",
  "Who knew I loved bison slobber? I could have fed the bison all day long, and luckily, our group of 6 friends were the only ones on the mid-day, mid-week train ride, so we each had plenty of time to feed the food pellets to the bison - probably a solid 20 minutes. They were so gentle in taking the treats right from our hands. What a treat!\n\nThere are quite a few animals to see on the grounds - goats, llamas, horses, chickens, peacocks, turkeys, camels, and of course, bison. Totally worth the drive from Denver!",
  "Northbound on I-25 just past the colorado/wyoming border is where this place lies. Even though it's right off the interstate, you would miss it if you blink.  This place is a Hidden Gem  with lots of fun activities such as horseback riding the bison train where you can ride out and get up close and personal and feed the bison.  There are also a multitude of different animals on the ranch you can see for free and the Senators Steakhouse is also on the property where you can get an awesome bison burger. If you're ever in the area you should definitely check this place out especially if you've got a family with children.",
  "We stayed here with our grandchildren on our trip to Yellowstone. It is a field with hookups, gravel sites, but it is a working ranch. The kids got to feed and pet buffalo on their buffalo train ride. The train goes through the fields where some of the buffalo will come up to the train for alfalfa pellets. The \"conductor\"  told us that the buffalo were still wild so do not go out of the train. But they know there is food so they come up and everyone gets to pet them. We also saw donkeys, horses, chickens, turkeys, annd lots of baby animals. The kids loved it."
 ]
},{
 "name": "Curt Gowdy State Park",
 "address": "1351 Hynds Lodge Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/04/8f/f0/crystal-reservoir-curt.jpg",
 "tags": [
  "hike",
  "walk",
  "knowledgeable",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279474-Reviews-Curt_Gowdy_State_Park-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Hiked Crow Creek to Hidden Falls. Moderate uphill climb. Trail had some snow and icy stretches in late March. Crampons advisable if ascending shady side of Crow Creek. I returned on opposite bank sans snow and ice. Melinnial hikers and young families frequent this trail. Bring drinking water. Area RR locked in off season.",
  "There are several hikes, different levels in this park, but we chose the Hidden Falls trail...about 3.6 x 2...listed as moderate with some hard parts, we found it quite easy (only one spot we had to climb over a rock, and then rocky near the falls).  Lovely hike, would be more crowded on weekends, and summer, but fall during colors was FAB!  No falls to be seen (due little water)..so I took off my shoes/socks and waded in the FREEZING water back into the canyon...could hear but not see the falls.  Suspect spring would be spectacular!  Lovely, well maintained trail.",
  "So amazing to have the opportunity to drive through the park on a winder day when the park was virtually empty. Being able to actually take in the scenery without the touch of humans around. Frozen rivers, scattered snow, absolutely breath taking. So happy we made the day trip.",
  "If only I had more time I would have liked to stay for a day or an overnight. I stopped at the visitor center which is located in a beautiful building featuring a rear wall of windows overlooking the reservoir and surrounding plains. Inside the center is a small museum which is packed full of information about the area. I did have the opportunity to take a short walk along a nearby path which provided me with some wonderful vistas of the area. The volunteer staff here is exceedingly friendly and knowledgeable. It’s only about 30 minutes drive from downtown Cheyenne, but seems worlds away.",
  "Nice place to camp, fish,pickwick, with or without the kids. At visitors center there's nice hot showers.pay"
 ]
},{
 "name": "Big Boy Steam Engine",
 "address": "Holliday Park Near East 17th St and Morrie Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/54/be/35/big-boy-steam-engine.jpg",
 "tags": [
  "history",
  "kids",
  "history",
  "history",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279403-Reviews-Big_Boy_Steam_Engine-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "First, do not follow the Google map directions here.  Pleasant drive and we saw antelope, but takes you to the middle of nowhere.  Started fresh and found it.  Amazing, HUGE engine and history info provided.  It is very well maintained and behind a fence to help it stay that way.  Definitely worth a visit, and there is a great playground right there for the kids.",
  "Big Boy was one of 25 built in the 1940's, taken off steam in the 50's, great shame. 132 feet long with 16 big wheels and 12 small ones, it carried 28 tons of water and weighs 1.28 million pounds! What else can I say: go and see it for yourself!",
  "Title pretty much says it all.  Big Boy has a history - if you know it, then you know why the train is here.  If you don't know, or don't care about the history, it's just a train engine in a park....",
  "It's great to see that much metal in one place which was a part of railroad history. The display is near a park so when youngsters tire of viewing a static display, there is someplace to play.",
  "It is cool to see this engine and imagine its heyday - being the workhorse engine that pulled trains up and over the mountains of Wyoming. But this one is sitting in the middle of a city park surrounded by a chain-link fence and totally untouchable.  This could have been so much more - placed maybe by the all the other trains/tracks in this city - or with a walk-through or something. I spent 5 minutes here - and that is only because it took some time to walk from the parking lot to the engine - and that was probably 3 minutes more than needed. Oh well.",
  "A great stop if you are in the area.  Cheyenne has lots to offer and is a great place along to the way.",
  "Holliday park is a great park, let me just say that. It is an expansive park with Lake Minnehaha in the middle. We like to have lunch in the gazebo on the southern edge of the lake and watch the ducks. There are also 2 separate playgrounds for the little ones. And to top it off, the Big Boy steam engine sits on display for all to see. You can get an up close look and walk 360 around this huge locomotive. The only complaint I have is there is a chain link fence that encircles it. But otherwise, the visit is impressive.",
  "We are on vacation and will see 3 of the 8 Big Boys on our trip.   Like the one in Omaha, this one is in great shape.  It is tucked away, but has a great playground nearby.  Great to let the little ones let their energy out. "
 ]
},{
 "name": "Cheyenne Botanic Gardens",
 "address": "710 S Lions Park Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/51/05/20/cheyenne-botanic-gardens.jpg",
 "tags": [
  "tour",
  "kids",
  "free",
  "walking",
  "walk",
  "walk",
  "art",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279401-Reviews-Cheyenne_Botanic_Gardens-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "The trolley tour stopped here for a minute the previous day, so I decided to visit. It’s a bit smaller inside than I anticipated but still had beautiful plants and trees inside and out. It was fun to look in the periscope! I walked the grounds for a while and then stopped by the Children’s park. What a great place to bring kids to let them do some hands-on activities. ",
  "On a road trip from southern Colorado to South Dakota, we asked for input from teenage granddaughters for points of interest along the way.  The 13 year old found this, and we are so glad she did!  Restful, beautiful, immaculate, and so well done.  The grounds are a lovely stroll to statuary and a labyrinth, with benches for contemplative enjoyment.  Water features and a sweet children’s hands-on interactive garden make it absolutely a delight.  ",
  "We visited Cheyenne Botanic Gardens while in Wyoming for Thanksgiving.  The flowers and plants were beautiful.\n\nOn the second floor of the gardens was a periscope.  A former Navy man had an idea to put it in the Botanic Gardens.  He volunteers there and tells you what you are seeing as you turn the periscope around.  You can see 14 miles outside the city of Cheyenne.  He also said that the person using  a periscope during wartime had 7 seconds to look before the ship would be identified.  Mr. Marshall's idea was an interesting feature. Google: \"Cheyenne resident honored by military for service to community By Kristine Galloway, Wyoming Tribune Eagle  Nov 11, 2017\" \n\nThe children's garden had benches made of metal of a dragonfly, a butterfly and a peacock.  There was a windmill that turned a water wheel and filled a fountain that cascaded along a walkway.  \n\nThere were many features here other than plants and flowers.  I found this place to be very interesting for adults and children alike.",
  "It is 3 stories of nice vegetation and has a rooftop to look over the lake and Children's village.  It has a little fairy area, that little ones will enjoy and small pond/water feature with fish and a turtle!  There is also an outside pond with fish too!  You can also look through an actual sub telescope.  There are some walking paths and other plants to view outside.  You won't be dissapointed and you can't beat free!!",
  "A great outdoor walk, good plant displays and beautiful statuary.\nThe new building is beautiful.  There is much to read, so take your time and plan to spend some time.",
  "Nice variety of flowers. enjoyed the pleasant walk through inside and out. Staff was helpful in explanations. ",
  "Excellent outside areas as well as inside\nThe childrens garden a must to visit and make sure to go round and take in the garden art\nThe botanic greenhouse area is lovely and so much to see\nUpstairs viewing area and also a periscope to take in the surroundings!\nThen take a walk around the back of the buildings to see the lake area\nLovely quiet serene area.",
  "This botanical garden was so pleasant. Beautiful flowers and ponds are throughout the lower level. A greenhouse on the upper level was nice, as well.It's free, but definitely worth a donation."
 ]
},{
 "name": "Cheyenne Big Boots",
 "address": "121 W 15th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/08/e6/3e/cheyenne-big-boots.jpg",
 "tags": [
  "walk",
  "learn",
  "art",
  "historic",
  "eat",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d8259414-Reviews-Cheyenne_Big_Boots-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "I absolutely LOVE the big boots in Cheyenne!  If you haven't seen these, you are in for a real treat.  They are painted by individual artists in Cheyenne, and are so  unique---no two are alike in any way. Each one represents different aspects of Cheyenne.  Taker a walk through Cheyenne, and enjoy these wonderful boots!",
  "Stop at the Depot to get a brochure that tells you where each Boot is and you get to see 4 right there in the plaza! ",
  "This is an unusual attraction.  The different boots have different paintings on them.  As you stroll from boot to boot, you realize the artistic skills of people.  We liked the various and bright colors on the boots.  Some boots represented special things with the city.  This is a good change of pace as you are touring the city.",
  "Was neat to ride all over town and find these.  Was like a scavenger hunt.  The artwork is wonderful on each one.",
  "These are all over the city and they're cool to look at not very much else to them. They're worth a photo-op",
  "We were in town for lunch and in visiting the downtown area we came across one of these boots. What a clever idea. You can learn alot by finding each one and the next time we are there we'll have to find more.",
  "We drove up from Colorado to visit historic downtown Cheyenne. Walking around this place was fun, with lots of colorful art decorated boots and buildings. We stopped at Sanford's for a bite to eat. I highly recommend you eat there while touring downtown Cheyenne. We will definitely need to come back to Cheyenne for Frontier Days next July. Thats sounds fun!",
  "Stopped on the way to South Dakota, we will definetly be back for a longer stay! Took some good pictures with our granddaughter! Very historical town. "
 ]
},{
 "name": "Historic Governors' Mansion",
 "address": "300 E 21st St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/a4/d5/89/wyoming-s-historic-governors.jpg",
 "tags": [
  "unique",
  "history",
  "tour",
  "free",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "historic",
  "walk",
  "free",
  "free",
  "historic",
  "tour",
  "history",
  "knowledgeable",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d278946-Reviews-Historic_Governors_Mansion-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "The governor's mansion is unique because you get to explore it at your own pace. I appreciated being able to take my time so I could shoot all the photos I wanted. The history is also very interesting and it is just cool to see how people lived in times past. ",
  "The house is located in downtown Cheyenee, there is a very short intruduction and then a free self guided tour of the house that includes the basement and 3 floors including the atic.\nwe enjoyed the tour and the big spacious rooms icluding the closed balconies.",
  "We brought our 3 young grandaughters to tour the Mansion over the Christmas season. Each room has decorations from the past up to the 50's when it was no longer used as a residence. Our guide was friendly, knowledgeable and fun. The girls aged 11, 8, and 4 were enthralled. If you like history that isn't locked away behing glass, this is the place for you.",
  "This historic property was restored by caring and dedicated citizens of Wyoming at a cost of over $1 Million. When you realize that it was originally build and furnished on time and slightly under budget in 1905 for under $60,000 it is impressive. Admission is free, however donations are accepted. Just walk up and knock on the door during their hours of operation, and a friendly staffer will open up. They have a self guided cell phone tour available, so bring your headphones. ",
  "Visit the Historic Mansion several times a year.  It's free! The displays change every so often so I enjoy visiting whenever anyone comes to Cheyenne.  There are stairs to climb and no elevators so be prepared.  Make sure to go to each floor!  ",
  "This is a very interesting historical site. It is the home most of Wyoming's governors lived in. The rooms are nicely preserved. The staff who work there are very pleasant and very helpful. On the street parking is plentiful so if you have a car there is a good chance to can park right in front of the home.",
  "Loved seeing all levels of the house and speaking with the local guide there. Many of the artifacts are in such great condition.  Very enjoyable visit.",
  "You can tour the mansion and see the various rooms and here about certain things, but it's nothing special unless you are really a history buff.  Children aren't really interested in this type of thing, so go to the State museum instead for them.",
  "My wife and I visited the Governor's mansion for the first time,  the staff was very knowledgeable and were glad to show us around even though we arrived right about closing time.  They answered questions and made sure that we saw everything.  Great staff, kudos for a job well done.",
  "Beautifully restored and maintained. The history is well integrated into each room From furniture to pictures and Dishes to memorabilia the house feels authentic.\n The staff is friendly and informed.",
  "My granddaughters loved going through the old Governor's mansion.  We spent much more time than what I thought we would need.  They explored each room and ask great questions.  They are 6 and 9.  We talked about living during the early 1900's and how difficult that would be.  "
 ]
},{
 "name": "Cheyenne Depot Plaza",
 "address": "121 W 15th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/7d/af/30/cheyenne-depot-plaza.jpg",
 "tags": [
  "history",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d3957946-Reviews-Cheyenne_Depot_Plaza-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Construction going on so could not see a lot.  What we did see was interesting.  Wish I could have seen more.",
  "Good stop. Especially for rail fans but interesting for most. Great history in this area. If you get the time go through the whole depot and rail museum.  ",
  "The depot is great to show how train travel used to be. A nice souvenir shop and brochures for other attractions are alos available.",
  "I stopped by when the plaza was packed with marathon runners and volunteers as a marathon was taking place. Although crowded, I was able to walk around and read some of the plaques regarding the history of Cheyenne and the area. It looks like more improvements are coming and I especially liked the colorful HUGE cowboy boots on display.",
  "Located across from  my hotel, this was the first attraction I visited  after checking in. There are several Giant boots on display here, stops for the trolley and horse drawn carriage, statues, plaques or signages re the attractions, Beer House, etc.\n\nTruly, a great place to start your visit of Cheyenne!"
 ]
},{
 "name": "Warren Air Force Base",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/b4/7a/98/geese-on-fe-warren-october.jpg",
 "tags": [
  "active",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279731-Reviews-Warren_Air_Force_Base-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum on the base was the highlight of our trip!  We were fortunate to talk to a volunteer who made our visit so excellent.  He added so much to our visit!  (He said he is no longer a volunteer, but he  helped out and wow - was he ever impressive!)  We already had such a great respect and gratefullness toward our military and all they do to protect our freedoms, but this museum only increased our appreciation and respect for them.  Thanks to those serving at the F.E.Warren Air Force Base for all you do for each of us! (Be sure you call the base 48 hours ahead of when you want to visit so that you may receive clearance to go on the base. Just do a google search for the museum and it will give you the number to call.) ",
  "Nice base but the only Missles you will see are at the main gate. Security Police do wear blue berets and are of the special forces type. So be nice. The base has a great commasary, and BX. If you happen to have a current Military I.D. you can purchase nice items in the BX and buy groceries too. There are magpies, and Antelope on base too. The buildings off the main road are very old. I had been stationed there in the 60's so it was special for me. ",
  "Unless you are retired, active duty or have some other access to this dont bother going to see the museum your taxes fund.",
  "I am a Federal Contractor for the US Government and travel to many Air Force bases across the country.  This is one of my favorites and I think mainly due to the building and the structures of them.  Not many bases anymore have red brick buildings.  Mos are more modern and/or most of them are painted what I refer to as \"Air Force Tan\".  Really neat to see these old building and to see that they have been preserved so well.  Very nice base indeed!",
  "We stayed here while in Cheyenne. The accommodations are fantastic. The show hall had great food and of course the service is top notch. The omelets in the morning were the best! "
 ]
},{
 "name": "Wyoming State Capitol",
 "address": "200 W 24th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/77/63/53/wyoming-state-capitol.jpg",
 "tags": [
  "knowledgeable",
  "art",
  "free",
  "walk",
  "historic",
  "knowledgeable",
  "tour",
  "history",
  "walk",
  "wander",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d278945-Reviews-Wyoming_State_Capitol-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Again, well worth a visit.  As well as being a very\nImposing building it gives so much information about how local\ngovernment is run\nFriendly, knowledgeable front desk area and then you self guide\nLots of rooms to visit and architecture to admire\nThe vast safes are worth seeing so make sure you do.\n",
  "Traveling with my sister. This is a stunning building. The massive amount of work to restore the building to it's original glory is mind-blowing. The list of things to catch your eye include woodwork, tile floors, statues, art work on the vault doors, paintings and the stained glass. ",
  "Beautiful building - \nReally cool statue worth seeing if you are passing thru. We found this place on accident looking for the big boot park.",
  "Legislature was in session but you are stll free to walk around.  Amazing how beautiful the building is when you think about when it was built.",
  "I stopped in here to check out what a very expensive remodel looks like and it did not disappoint.  They managed to keep the historic look of the building while putting in all the modern features.  Make sure you step into the gallery of the old court room.  They restored it to it's original look and it is cool.",
  "The work that has gone into rehabbing the capital was well worth it.. The place is immaculate. It was quiet when we went in. The woman at the front desk was quite knowledgeable about all aspects of the building. As an added bonus, the governor was moving back into the building so we just happened to meet him. ",
  "A co-worker and me were in town for some training at the Cheyenne Police Department and had some extra time since our class got out early before we had to head back to Gillette.  My co-worker had never seen the Capitol and I had never been in it (the last time I was in town it was being remodeled).  So we decided to go check it out.  The nice lady who checked us in spent a great deal of time explaining all of the things we needed to see.  She gave us our information for the self-guided tour and away we went.  Oh my gosh, the attention to detail and the resurrection of beautiful things that had been painted over were simply amazing.  It was like you could take a few steps and just stare at the detail and craftsmanship.  It was so cool to be inside a building that has such a rich history behind it.  From the painting with the bullet holes in it (European cows), the upside-down bannister, the paintings on the vault doors in the basement that were painted over, the four sisters, and the underground walkway connecting the Capitol and the Herschler Building.  It was all just so very cool to get to see.  They still have a lot of little things to do (A/V, etc).  But to have the ability to walk in the House and the Senate sides of the Capitol, look at all the amazing paintings was pretty neat.",
  "The Capital building was reopened this year after a major face-lift . One of Wyoming more elegant old buildings, you are allowed to wander the halls and view the house and senate rooms. There is exquisite woodwork, paintings and statues to see within. . If you enjoy architecture, history and art this is worth visiting. There are volunteers there to assist."
 ]
},{
 "name": "Cheyenne Civic Center",
 "address": "510 West 20th St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/8a/c4/61/peter-frampton.jpg",
 "tags": [
  "eat",
  "drink",
  "art",
  "free",
  "free",
  "free",
  "music",
  "kids",
  "walk",
  "tour",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d1418668-Reviews-Cheyenne_Civic_Center-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Not a bad seat in the house and the acoustics in the place are great acoustics. Parking is convenient and close to the Civic Center with easy access in and out of the parking facility.  Ticket prices can be a bit high though. ",
  "There is a wide range of shows and entertainment at the Civic Center.  They don't have much to eat or drink so it's best to do that first or later.  The shows are very good and they have rotating selection which is sure to please anyone.",
  "Gorgeous auditorium but not too big. Free parking in the large parking garage nearby or on the street. Not enough women's restrooms. Some times they have very nice art exhibits, check them out during intermission.",
  "Went to the recent Lyle Lovett acoustic group concert at the Center.  Laid back setting with very friendly ushers and service personnel.  Seats were comfortable but wish they had cup holders.  Acoustics were great for this show.  Although the center was \"full\", it never seemed crowded.  One great perk is that there is free parking in the garage next to the center so you never have to worry about the weather or if you can park closely to the venue.  My wife and I had a wonderful time and the center was a perfect setting.",
  "Came here for the short films series and loved it! Concessions were convenient, bathrooms were clean, lovely atmosphere. Coat checking was great too! Parking was amazingly convenient, truly astonished at that actually. \n\nI'll definitely be returning, they have some awesome shows coming up! ",
  "I have held season tickets for the Civic Center for several years.  This year they have a new manager who has added a number of different events that have a much broader appeal to different audiences.  It is exciting to see the season's offerings.  I have even bought ticket packages as Christmas gifts for families.  I would suggest you make reservations as soon as you hear about an event or program you want to attend.  The prices vary, depending on the event.",
  "We attended an Avett Brothers concert here and were pleasantly surprised!  I thought everything about the venue was just about perfect. We live near Austin but knew we would be visiting our kids in Evergreen, Colorado at the same time the Avetts were playing in Cheyenne so purchased tickets months in advance. We’ve been to just about every music venue in Austin but this place was one of our best experiences ever.  Parking was free and only a short walk to the civic center and in Austin, we always pay for parking. The acoustics were awesome  and drinks were half the price we pay at home. The people we met were so friendly...if I lived in or around Cheyenne I would definitely take advantage of this place often. \n",
  "Went to see ZZ Top Monday and Phillip Phillips Tues. ZZ Top tickets were outrageous, were has Phillip Phillips $49 for front row. Parking is free which is a plus. Disappointed ZZ Top had no tour shirts with Cheyenne. Overall, cool to see this venue get some big names, disappointed they only played a little over 1 hour. Concert for ZZ Top was over by 9pm."
 ]
},{
 "name": "Happy Jack Road",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/c4/d7/00/happy-jack-road.jpg",
 "tags": [
  "hike",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279475-Reviews-Happy_Jack_Road-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "After seeing some reviews, I decided to take this road from Cheyenne to Laramie, and it was a great scenic drive. It starts out pretty slow near Cheyenne, but after a few miles, the road begins to climb and the scenery changes from flat plains to rolling hills and then to beautiful rock formations and forest. It was a very enjoyable drive. \n\nIf you're headed east-to-west, just be aware that the road ends a few miles east of Laramie and you'll have to get on the Interstate to get into town.\n\nIf you're visiting Curt Gowdy State Park, or if you're traveling between Cheyenne and Laramie, or if you're just looking for a nice scenic drive -- this is as good as it gets in eastern Wyoming.",
  "Happy Jack Road runs from Cheyenne to I-80 West.  Once on I-80, you are about ten minutes drive from Laramie.  Happy Jack Road is not scenic for perhaps the first 25 minutes from Cheyenne, but after that it enters some of Wyoming's most beautiful scenery, with rock formations, state and national forests, and lakes.  It is a very pleasant, about one hour drive from Cheyenne to Laramie, and avoids most of the heavy traffic on I-80.",
  "Take these scenic route to Cheyenne or Laramie and miss all the traffic on I-80.  Stop at the rest stop at the top of Sherman Hill where you can take a break and go through the visitor's center.  A bust of Abraham Lincoln is also at this rest stop.",
  "It's a great road for a bike workout into the hills with the downhill back to town as a reward for the effort. Beautiful scenery.",
  "Well worth the drive up from Denver to make this drive through Medicine Bow. Didn’t spot a ton of wildlife but the scenery is amazing!",
  "We enjoyed this scenic route between Laramie and Cheyenne rather than taking the highway both ways. We didn’t have time to stop but there were several places to pull off the road and enjoy trails or other outdoor recreation. ",
  "Looking for a more scenic route from I-80, I decided to take Happy Jack Road from Laramie to Cheyenne. The two lane road is light on traffic and NO 18-wheelers! I took my time driving along this scenic road that meandered through a high plains landscape dotted with unusual wind-carved rock formations. Several reservoirs are accessible from the road as well camping and hiking opportunities. A stop at the Curt Gowdy State Park is a most pleasant place to camp, hike, fish or just relax amidst beautiful nature. ",
  "Drove Happy Jack Rd. from Lincoln Monument toward Cheyenne thinking it would reach the Paved part of Happy Jack from near Warren AFB. We ended the gravel road about 1/2 way to Cheyenne as the scenic part was not that scenic and I really wanted to show my wife the paved part where I had taken my biggest mule deer 49 years earlier. We were headed to Casper and I should of went North from Laramie and skipped Happy Jack. Would of made more time and would of been more interesting."
 ]
},{
 "name": "Laramie County Library",
 "address": "2200 Pioneer Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/f6/34/dd/laramie-county-public.jpg",
 "tags": [
  "family",
  "library",
  "active",
  "library",
  "drink",
  "library",
  "food",
  "library",
  "kids",
  "kids",
  "library",
  "family",
  "library",
  "active",
  "library",
  "kids",
  "library",
  "drink",
  "library",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d4545230-Reviews-Laramie_County_Library-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "This library is uniquely constructed to serve the needs and interests of all ages in any family.  I was particularly impressed with the children's section (a whole floor in itself!) and the permanent activities built into the spaces to keep active children busy.",
  "A beautifully designed and well used library. It has exceptional programming for children and teens. An entire floor is dedicated to them. Meeting rooms are available for community events encouraging a wide variety of attendees. There is also a small cafe where you can get something to drink and a sandwich or sweet treat.",
  "This has to be one of the NICEST city libraries that I have attended.  Having grown up on the east coast while attending Columbia University, I was used to the grandeur of BUTLER Library which rivals the Library of Congress for number of volumes.  However, this local library has more than enough for the above average user who intends to do some research on almost any topic.  The place is quiet even with numerous children coming through.  The Wi-Fi connection is pretty fast once you get some assistance to get it properly set up.  There's plenty of help from the librarians.  There's a nice café adjacent to the library when you need a study break.  It's comfortable and the temperature is well maintained.  I'd come here on a regular basis from now on.",
  "Great place to relax or attend a program.  There are kids, adults and group programs on a variety of topics.  There is also a cafe for food or coffee.  The best library in Wyoming I've seen. ",
  "Been bringing my child her since she was a baby.  Tons of activities for the little kids to do on the 2nd floor and the most helpful staff. Lots of computers for the kids to use with safe programs. ",
  "Many valuable resources are housed in this library and staff is available for assistance.  City directories, phone books, etc.",
  "This library is uniquely constructed to serve the needs and interests of all ages in any family.  I was particularly impressed with the children's section (a whole floor in itself!) and the permanent activities built into the spaces to keep active children busy.",
  "A lot going on with this library ... a lot of activities for kids and some Wyoming volumes that are difficult to find anywhere else. Was quite pleased.",
  "A beautifully designed and well used library. It has exceptional programming for children and teens. An entire floor is dedicated to them. Meeting rooms are available for community events encouraging a wide variety of attendees. There is also a small cafe where you can get something to drink and a sandwich or sweet treat.",
  "Everything and anything, I've looked for is easily found in this library. The library has no bars held. I frequent the library  at least 3-4 times a month and have had never been disappointed with my research. I've been to libraries in several states and larger cities, none of which can compare to Laramie County Library. If you're looking for anything at all, this Library has it. A must be a check-it-out, even if you are just passing through Cheyenne.",
  "This library is modern and beautiful!  Wonderful place to relax and read or to catch up on the latest magazine or newspaper!  Great selection of books including the newest of releases!"
 ]
},{
 "name": "Cowgirls of the West Museum",
 "address": "205 W 17th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/cb/d0/f6/exhibit.jpg",
 "tags": [
  "history",
  "structure",
  "history",
  "learn",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d3353461-Reviews-Cowgirls_of_the_West_Museum-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "A neat collection of cowgirl history not to mention a friendly greeter.  It’s worth stopping by to see all they have to offer. ",
  "This store/Museum is small but worth a stop.It is on 17th St off of Capitol Ave.He haw, , go check out all the cowgirl things.",
  "My Mom and I stumbled across this by accident and it is certainly worth a few minutes of your time to stop and take a peek. It is not huge place, but rather small and one to see if cowgirls of the west is of interest to you. We were glad to stop in and see the displays.",
  "The museum does have some interesting displays but there is a LOT of reading to be done. Downtown parking is marginal (2 hours) though one could park in a structure a couple of blocks away.",
  "A neat collection of cowgirl history not to mention a friendly greeter.  It’s worth stopping by to see all they have to offer. ",
  "This museum is small, but has interesting exhibits that showcase the contributions of the cowgirls. Names of these cowgirls and their contributions are posted on the walls.\n\nAlso on display are boots, jewelries,  bags, clothing, etc. \n\nNext door is their related shop that sells women-related items such as clothing, jewelries, bags, calendars, etc.",
  "It’s a tiny place with tons of pictures, artifacts, stories - just lots to see and learn about women and cowgirls! The women who work there were very friendly. I’m coming back next month when I’m in town because I did not get to see and read everything! ",
  "A fun place with friendly folks to visit with you. Next door is their small gift shop that has many unique items for a reasonable price. Fun place to shop."
 ]
},{
 "name": "Nelson Museum of the West",
 "address": "1714 Carey Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/56/69/d6/western-cowboy-boots.jpg",
 "tags": [
  "tour",
  "art",
  "kids",
  "organized",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279398-Reviews-Nelson_Museum_of_the_West-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a wonderful place to spend an hour or two.  They sort of have their own hours, so be prepared to visit the news stand until they open.  Then for a nominal charge, i think $6 you get to tour the museum and take pics too.  ",
  "Do not miss this museum if you are interested in the Old West.\n\nExcellent displays of nineteenth-century military and Indian\nartifacts.\n\nThe display descriptions are a delight to read.\n\nIf you are interested in firearms, ask the receptionist if it is possible\nto view the collection across the street which is not usually open to \nthe public.",
  "We knew about the Nelson Museum of the West from our trip preparation on TripAdvisor but what we actually found far exceeded our expectations.\n\nThe charge is $ 4 per head - it would be worth more just for the experience.\n\nThe museum covers 3 floors which includes the basement and there is an elevator.\n\nThe first item that really touched my inner little boy was that all this cowboy and cavalry stuff is real - including the costumes from Roy Rogers and Dale Evans!\n\nThe cavalry display was amazing - period uniforms, weapons and equipment from the time the cavalry came into the West thru WWII - just fantastic.\n\nThe weapons displays are awesome - real cowboy guns!\n\nPerhaps you can tell I enjoyed this.\n\nDo not fail to visit the Nelson Museum of the West - if you do you will regret it.",
  "The main floor has the military displays which weren't my favorite. The basement and top floor were by far the biggest hit with my son and I. Upstairs has some amazing grizzly and other bears, and the basement has the outlaw and lawman exhibit. ",
  "We had bought an inclusive ticket for several museums and were glad we hadn't actually paid to come here!  There were lots of stuffed animals, some uniforms and a law and order display downstairs.  The last bit was interesting, with a sheriff's office and various stories of outlaws but that was about it.",
  "Incredible variety of historical art and artifacts.  Loads of information on military / cavalry era in the West.  Great displays of cowboy era, saddles and other displays including Native American items. Could easily be its own mini-Smithsonian of the West - 3 floors with QR code or voice information for your cell phone. Worth at least 2 hours.",
  "This founder of this museum is a collector of western things, has a military background and is a hunter.  This museum (which he still actively is involved in) showcases his collections.  The museum has very beautiful collection of artifacts and western style things including military uniforms, and lots and lots of animal trophies.  My wife and I really enjoyed the artifacts (even the animals which are tactfully displayed) but the captions are not extensive here, so why some thematic statements are offered there is not a lot of narrative detail.  You come here to look rather than read.  For that reason I see this museum as a great compliment to the State Museum up the street which is more informative.  It is also why the name of the museum is a bit of a misnomer.  (there are other larger museums that cover the west with more detail which is why I give 4 stars not 5) Kids would like seeing this museum.  As someone who has visited lots of museums that discuss the west I really liked this place because it offered little details that added to my knowledge about the bigger subject with its incredibly beautiful artifacts.  We spent an hour here and for the small entrance cost, it is hard to argue against a visit.",
  "Great exhibits, well organized and complete with very good explanations. The people were very knowledgeable and helpful. I could not ask for a better experience. Spend some time here, you will not be disappointed."
 ]
},{
 "name": "The Merci Train",
 "address": "E. Lincolnway and Big Horn  (in American Legion Post #6 parking lot)",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/5c/1e/7d/box-car-beneath-a-roof.jpg",
 "tags": [
  "history",
  "food",
  "history",
  "history",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279404-Reviews-The_Merci_Train-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "We learned about this late in our visit to Wyoming and were fascinated by the WW II history it represents.  You can read about the Merci trains on Wikipedia and get the whole story beside what's in the reviews here. You can also see what happened to the Merci cars that went to other states (most of them still exist in state capitals or in railway museums or such). I was happy to find out that the one for my state is in a railroad museum fairly near me, and I had never even heard of it but will now go and see it.  We will also seek them out as we travel around to see how the states have preserved them and are continuing to tell this friendship story that is a good lesson for today's world.",
  "A reporter named Drew Pearson thought up the idea of sending food, clothing, blankets, shoes, and other needed items to war-torn France after WWII.  Americans responded by giving over 40 train cars full, which were eventually sent to France.  As a thank you (hence the name \"Merci\"), the people gave what they could (books, silver, paintings, calendars, and other items), placed them in these small railroad cars and sent them to America.  Their RR cars did not fit on the U.S. gage tracks, so they were placed of flatcars and were distributed to state capitols across America.  This is an important and touching act, worthy of a few minutes of your time.",
  "The Merci Train box car given to Wyoming is in the parking lot of American Legion Post #6.  The box car stands on a short set of tracks in the open air, but with roofing over it. It appears to have been recently refurbished - the badges mentioned by a previous review from 2016 as missing are still there. What's new is the fact that instead of it saying \"Merci Train\" the sign across it says \"Gratitude Train.\"  What's also new is the bright yellow railing of the steps that lead up to the entrance, and beside that, an elevator.  Currently you can't go inside the Merci Train box car - perhaps that is going to change.\n\nFrom May 2017 to approximately October 2017, the Wyoming State Museum has an exhibit of many of the gifts that were inside this boxcar, on their second floor. That exhibit is well worth visiting in conjunction with visiting the Merci Train boxcar.",
  "We learned about this late in our visit to Wyoming and were fascinated by the WW II history it represents.  You can read about the Merci trains on Wikipedia and get the whole story beside what's in the reviews here. You can also see what happened to the Merci cars that went to other states (most of them still exist in state capitals or in railway museums or such). I was happy to find out that the one for my state is in a railroad museum fairly near me, and I had never even heard of it but will now go and see it.  We will also seek them out as we travel around to see how the states have preserved them and are continuing to tell this friendship story that is a good lesson for today's world.",
  "I had never heard of our Friendship train we sent to France. Then they sent us back the Merci boxcars with thank you gifts from 6 million French families. What a thoughtful piece of American and French history.   We have found another one in Cody Utah.   So interesting to read about. So glad we saw this little jewel.",
  "Was in Cheyenne on a business trip from Chicago.  Saw this one pop up and it looked interesting.  Thought the write up on this was done very well as some of the comments also.  Interesting stop and was glad I came here.  This is one of those places you would never know about it not for tripadvisor!  Excellent stop!",
  "To see this monumental piece of history from the second world war. To show appreciation to the state of Wyoming from France.",
  "A reporter named Drew Pearson thought up the idea of sending food, clothing, blankets, shoes, and other needed items to war-torn France after WWII.  Americans responded by giving over 40 train cars full, which were eventually sent to France.  As a thank you (hence the name \"Merci\"), the people gave what they could (books, silver, paintings, calendars, and other items), placed them in these small railroad cars and sent them to America.  Their RR cars did not fit on the U.S. gage tracks, so they were placed of flatcars and were distributed to state capitols across America.  This is an important and touching act, worthy of a few minutes of your time."
 ]
},{
 "name": "Bit-O-Wyo Ranch",
 "address": "470 Happy Jack Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/3d/dc/2a/bit-o-wyo-ranch-horseback.jpg",
 "tags": [
  "hospitable",
  "kids",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d1061874-Reviews-Bit_O_Wyo_Ranch-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Bit-O-Wy Ranch is a beautiful and friendly place to ride for folks who don't have a lot of experience with horses.  Our guide (Kim) did a great job matching horse personalities with people personalities so everyone was comfortable.  We took a one hour ride - just enough for our never-been-in-a-saddle backsides!  The scenery is wonderful and the Kim was extremely polite and informative.  With a little more practice we may go for a longer ride.",
  "Had a good time taking a trail ride by horseback with my wife and another couple.  Our guide was a young but confident and capable young woman.  I cant remember her name unfortunately, but from conversation she is about 22 yrs old and lives very near the ranch.  If you let me know your name i will update my review to include the personal recognition you deserve.\n\nHorses were very tame and well behaved for having 4 very novice riders.  Thanks it was a good time.",
  "I called this place several times over three days during our visit to Cheyenne trying to set up a trail ride.  No one ever returned my calls. ",
  "I visited the ranch in June 2018 with my two kids (12 and 9). It was their first trip out west, and certainly their first visit to a ranch.\nDennis is top notch. He was extremely hospitable and did everything I could ask for to make our stay enjoyable.\nThe setting of BoW is breathtaking. About 15 miles west of Cheyenne, and relatively easy to get to. The ranch sits off the road about a mile. Nothing but peace and quiet.\nThe guest cabin is plenty for a couple (or in my case, one adult and two kids).\nIn the morning you can't help but sit on the deck and listen to nature and enjoy the vista.\nAt night the volume of stars you see while stun you to silence. Just incredible\nThere is a trout pond onsite with very nice size trout. My kids both caught a few 2+ pounders\nWe did not get to do the trail ride due to a Wyoming storm that rolled through late afternoon, but from what I could see, it would've been a great adventure.\nDon't expect much use of your smart phone - but then again who needs it!\nMy kids have already said they want to go back. I thank Dennis very much for getting our 10 day vacation off to such a wonderful start",
  "Tonight we attended a Bit of WYO dinner/music experience. It was lovely. A great steak meal and excellent entertainment in a comfortable barn atmosphere made for a special summer night. The musicians were outstanding...banjo, guitar, base, fiddle etc with excellent vocals as well. A touch of cowboy poetry and spoonerisms added a light hearted touch to the evening. I would certainly recommend this venue."
 ]
},{
 "name": "NCAR-Wyoming Supercomputing Center Visitor Center",
 "address": "8120 Veta Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/b7/4a/7a/the-building.jpg",
 "tags": [
  "organized",
  "tour",
  "walking",
  "learn",
  "food",
  "tour",
  "tour",
  "learn",
  "free",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d3671816-Reviews-NCAR_Wyoming_Supercomputing_Center_Visitor_Center-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Friday's at Noon is the organized public tour, though you can arrange a group tour at a time and day of your choosing.  As this is a non-profit organization and not a private company, they welcome people to tour and take pictures of their operation.\n\nFor three babyboomer geeks who worked in high tech and love all that goes with it, this was the perfect two-hour-plus stop.  No food or anything is available, but it is a great place to see what modern computers are all about. And learn that it is more than just a calculating machine, it is a place that power and water are important for cooling and running the joint, and it is all done at a top-level environmentally friendly way.\n\nIf you need a wheelchair, there is one, and there is a lot of walking, so take advantage of it.  There is no charge to visit the facility.\n\nThis was one of the highlights of our visit to Wyoming.",
  "Didn't expect much here, but were pleasantly surprised.  We were too late for a tour, but the visitor center had a wealth of information.  Lots of kiosks with video clips and interactive exhibits.  You can see into the supercomputer center (behind glass walls) and it is amazing stuff!  Give it a chance, you will be fascinated too!",
  "We arrived not expecting much. This place is so informative.Movie clips and interactive exhibits and so much more. Security at the entrance were very friendly and informative. The  super computers are behind a glass wall but you can see them without anything blocking them. If you are driving Happy Jack Road this is a must stop!",
  "This place has a lot of information, and shares it in ways people of any age can understand. There are displays for children and interactive displays for everyone. The tour is self-guided and free. You will learn about forecasting weather in Antartica, wind power, tornados, as well as see the Cheyenne Supercomputer. All of this is sponsored by the National Science Foundation (NSF).",
  "A small exhibit, but worthwhile if you have an interest in science, climate or super computers.\n\nInformative and jovial staff gave us a quick overview \"tour\" and then we lingered on parts of the exhibit that were of most interest to us.\n\nA very nice way to spend an hour or so."
 ]
},{
 "name": "Messenger's Old West Museum",
 "address": "616 Crook Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/17/16/fd/20181018-112145-largejpg.jpg",
 "tags": [
  "history",
  "history",
  "knowledgeable",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d3179445-Reviews-Messenger_s_Old_West_Museum-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is one of better and more interesting museums in the Cheyenne area.  Lots of artifacts from the history of the Equality State.  Somewhat off the beaten track, so be sure to get good directions or use your GPS.  Definitely worth the time and minimal expense for what you get to see.  ",
  "We almost didn't find this at first.  But, look closer....it is IN the Cheyenne Storage building.  This is a private collection of lots of memorabilia but mainly various Wagons.  It was very interesting.  Doesn't take a ton of time to go through.  There is a video to watch as well.  Price is by donation only so you get to decide!",
  "This is one of better and more interesting museums in the Cheyenne area.  Lots of artifacts from the history of the Equality State.  Somewhat off the beaten track, so be sure to get good directions or use your GPS.  Definitely worth the time and minimal expense for what you get to see.  ",
  "I've had such an amazing experience with this place , clean ,friendly and they really do have a full on museum! It's so beautiful in there you guys !! A must see in my opinion.. great job you guys thanks for the great service!..",
  "My friend and I stopped here on a whim one Friday evening (because this was the only museum in Cheyenne that was open past 4pm!) We were a little confused because yes, it is connected to a storage unit and it just doesn't look like a museum from the outside. However we were pleasantly surprised when we went inside. It is much bigger than it looks on the inside and has a variety of very well-preserved carriages and items from the westward expansion, Civil War, pioneer days, Buffalo Bill, etc. Extremely well-kept and also had some great animals on display. I would definitely recommend this museum to anyone in Cheyenne. Normally old western museums creep me out but this museum was displayed in a very inviting and friendly way and just had so much to look at! The museum owner was so knowledgeable too, I was amazed by some of the stories he told us. Definitely be sure to check this out!",
  "We were pleasantly surprised to see the huge collection of old West memorabilia. Wagons, equipment, tack, household, taxidermy, rifles, autos, so much! Lots of harness, pics, wagons, and awards from their beautiful, prize winning Percheron team. And a lot of impressive small scale models of various wagons and carriages. Complete with livestock in harness. Tons of photo opportunities. Well worth the small fee. ",
  "This is one of better and more interesting museums in the Cheyenne area.  Lots of artifacts from the history of the Equality State.  Somewhat off the beaten track, so be sure to get good directions or use your GPS.  Definitely worth the time and minimal expense for what you get to see.  ",
  "The collections are super well done. Lots of various wildlife trophies that really allow those of us from back east to grasp the size of wildlife. Beautiful collections of butterflies, stones, transportation modes and many, many other things. Some beautifully restored carriages, cars (ever earn of a Mercer automobile?) saddles, bits, old and new west. Don't miss it! Yes, it is in a place where you rent storage bins!"
 ]
},{
 "name": "Cheyenne Artists Guild",
 "address": "1701 Morrie Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/7d/31/26/getlstd-property-photo.jpg",
 "tags": [
  "art",
  "art",
  "art",
  "unique",
  "walking",
  "art",
  "walk",
  "art",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d3861084-Reviews-Cheyenne_Artists_Guild-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "A Guild of talented, artistic people. A wide variety of art and artistic styles that changes frequently. There is also a gift shop of inexpensive, original art gifts.\n\nWorth the time to visit--and it's in the same park with the \"Big Boy!\"",
  "A Guild of talented, artistic people. A wide variety of art and artistic styles that changes frequently. There is also a gift shop of inexpensive, original art gifts.\n\nWorth the time to visit--and it's in the same park with the \"Big Boy!\"",
  "This is an excellent way to not only decorate your home, but support an artist! I love what the guild is doing, I look forward to visiting yearly!",
  "Every city I visit, I like to visit art galleries, you can find wonderful and unique gifts and see the talent of local artists.  This gem is located in Holiday Park, where you can enjoy walking paths around a beautiful lake.",
  "This is an excellent way to not only decorate your home, but support an artist! I love what the guild is doing, I look forward to visiting yearly!",
  "The Cheyenne Artists' Guild is located in on the west edge of Holliday Park. It is member supported and consists of many talented artists, painters, mixed media, three dimensional and photographers. There is a different show exhibited in their gallery monthly. The guild is also one of the stops on the monthly Thursday Art Walk. There is an artists' consignment shop, so there is always art for sale, from note cards to framed paintings.\n\nWell worth a visit if you like art.",
  "Drove from Denver only a two hour drive stopped by the guild nice art work, free to the public.  If you like art you should stop and take a look and a picture of the boot.  Friendly staff.",
  "Lovely gallery of local artists and artisands.  A wide variety of items - paintings, jewelry, pottery, cards, scarfs, and much more.  Fun to browse and to appreciate the talent of these local artists."
 ]
},{
 "name": "Danielmark's Brewery and Tap Room",
 "address": "209 E 18th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/91/5e/ed/great-tasting-room-layout.jpg",
 "tags": [
  "food",
  "free",
  "food",
  "family",
  "food",
  "free",
  "brewery",
  "free",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d10727033-Reviews-Danielmark_s_Brewery_and_Tap_Room-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Staff was friendly and beer was good. It is in an old house so had a little trouble  spotting it at first. There is no parking lot so have to park on the street. There is lots of room on the patio. There was a food truck and a band the day we were there. Would stop again if in the area",
  "A renovated old house turned into a craft brew pub with 6 or so of their own with a few seasonals for spring, fall, and winter.  Try a flight, decide what you like, and get a pint or 3.  Good atmosphere, free popcorn.  Food trucks outside occasionally or you can bring your own snacks.  Pet friendly.",
  "This is a hidden gem. Family and pet friendly. Has a wonderful patio area. Beer is great, My fave is Star maker. Have tried others but I keep going back to that one. They don't serve food but you can bring it in or sometimes they have a food truck. come in. Not sure which food truck it was but they had pork nachos and they were awesome.",
  "We were in town for the weekend and always seek out microbreweries.  This small company has a good selection of beers foe everyone's taste.  The wife and I both like IPA's, and both offerings we tried, were very good. Desiree our  first tapmaster was very friendly and informative.  They have a great patio area in the rear that we will visit next time, which has several heaters for when it gets cooler.  They also appreciate Veterans and offer them a discount.  Our first stop, and it will be a regular on future trips.",
  "This is a really nice brewery set up in a small house.  There is free popcorn and lots of toys and games for little ones.  The beer is solid though nothing really stood out as a must have for my palette.  If you are starting in Cheyenne it's worth giving this place a visit for a taster or a flight of you have the time.",
  "Decent beer. Lively place with free popcorn. However, I was shocked to see multiple patrons placing their small dogs on the bar. Literally *on* the bar surface where you set your glass. If you look at their Google reviews, you will even see photos of that. Perhaps Cheyenne or Wyoming health codes allow that, but it turned me off.",
  "We heard they had beer & root beer that they brew in the carriage house behind the really cool 100+ year old house. We had to stop & check it out. It was off the main route & kinda of hidden. There was nothing outside saying they made root beer, but it was really good. Such a cool old house & they have it set where it doesn’t feel like a make shift house. It was so welcoming & looked like a great place to enjoy a beer or root beer. Definitely worth checking out.  ",
  "Staff was friendly and beer was good. It is in an old house so had a little trouble  spotting it at first. There is no parking lot so have to park on the street. There is lots of room on the patio. There was a food truck and a band the day we were there. Would stop again if in the area"
 ]
},{
 "name": "Mylar Park",
 "address": "5117 Seminoe Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/ad/aa/2b/fenced-in-goats-near.jpg",
 "tags": [
  "parks",
  "walk",
  "parks",
  "walk",
  "parks",
  "walk",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d10753881-Reviews-Mylar_Park-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is one of the smaller parks in Cheyenne, but it's nice since you can walk to it using the greenway.  There are restrooms, small covered picnic area, small playground and pond.  There is also discus golf and a hill if you want a little challenge.  There is some statues and a very cool sun dial/calendar!",
  "This is one of the smaller parks in Cheyenne, but it's nice since you can walk to it using the greenway.  There are restrooms, small covered picnic area, small playground and pond.  There is also discus golf and a hill if you want a little challenge.  There is some statues and a very cool sun dial/calendar!",
  "We were just looking for a place to go for a 45 minute jog while visiting Cheyenne and happened upon Mylar Park. The park is very well maintained and has a little bit of everything. There is a really nice frisbee-golf course which was being well used while we were there. There is a nice little playground for the little ones and nice little picnic areas for, well, people who want to have a picnic. Convenient for us was the decent bathrooms which we needed before heading out on the run. \n\nLots of people had their dogs too - but there were no goats to be seen.\n\nThe run itself didn't take place in the park which is actually rather small. However, the Dry Creek Greenway goes right through the park so we did a loop on that.",
  "We stopped for a little breakfast picnic (coffee and a Danish) and took the time to enjoy this little slice of heaven.",
  "Great local park that is not busy.  Good playground equipment for smaller children.  Frisbee golf course.  Bocce Ball court.  Bathrooms.  Shelter with grills.",
  "We were just looking for a place to go for a 45 minute jog while visiting Cheyenne and happened upon Mylar Park. The park is very well maintained and has a little bit of everything. There is a really nice frisbee-golf course which was being well used while we were there. There is a nice little playground for the little ones and nice little picnic areas for, well, people who want to have a picnic. Convenient for us was the decent bathrooms which we needed before heading out on the run. \n\nLots of people had their dogs too - but there were no goats to be seen.\n\nThe run itself didn't take place in the park which is actually rather small. However, the Dry Creek Greenway goes right through the park so we did a loop on that.",
  "This is one of the smaller parks in Cheyenne, but it's nice since you can walk to it using the greenway.  There are restrooms, small covered picnic area, small playground and pond.  There is also discus golf and a hill if you want a little challenge.  There is some statues and a very cool sun dial/calendar!",
  "Went here because people (ages ago) said there were heaps of goats, but we didn't see any. Still, it was a nice little park to stroll around in, see the ducks, enjoy nature. Easy to get to, not too big (can stroll around in 10-15 minutes) and has toilet facilities and water fountains. There's also a playground."
 ]
},{
 "name": "Quebec 01 Missile Alert Facility",
 "address": "2025 Road 238",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "tour",
  "tour",
  "history",
  "parks",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d18913136-Reviews-Quebec_01_Missile_Alert_Facility-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took a trip to Quebec 1 in late February, and found the tour (and the folks who work there) to be well worth our time and money! While this facility has only been open for less than a year, they have done much In a very short time! These tour guides assured us that there will be many Additional Improvements shortly-to give an even BETTER Experience! ",
  "If you are traveling between Cheyenne and Casper you MUST make time to stop at this awesome new state park attraction. You get such a view of what it was like to be a airman during the cold war, stationed underground, hoping for the best that you don't have to push the button. An amazing spot to stop.",
  "Thank you Wyoming Parks for preserving this important peace of history and a site personal to me as I was stationed there.  You have done a fantastic job with keeping things the way they truly were and your tour was fantastic and informative even with being in the Air Force and stationed there.",
  "While visiting my relatives, we found this hidden jewel. It is a state park that has only been open a month. We made reservations even though they do take walk ins. It is located 39 miles north of the Colorado/Wyoming border on Interstate 25. There are signs showing the way.  The admission is $6 per person.  The price is for a 30 minute guided tour. The tour will take you down 50 fifty feet in an elevator to the command center of the facility.  There is also a self guided tour of the above ground facilities.  This place is well done and very educational.  Well worth going to.",
  "I visited early on a Friday morning.  The guide spent 30 minutes explaining the function and how the Missile Alert Facility worked. It was worth the time.  I have had many friends who have worked at these facilities over the 35 years I have lived in Cheyenne.  It was great to see the work environment they were in and to experience only briefly what they lived with for 24 hours to 4 days."
 ]
},{
 "name": "Lakeview Cemetery",
 "address": "Seymour Ave.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/08/80/97/lakeview-cemetery.jpg",
 "tags": [
  "tour",
  "walking",
  "history",
  "walking",
  "walk",
  "history",
  "walk",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d279405-Reviews-Lakeview_Cemetery-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lake View is a great place to look into some of the history of the city. Historical graves abound. Walking tour brochures are available at the main office. Many graves  past governors, law makers, pioneers , and outlaws abound. There is even a Native American woman and child interned at Lake View. Take as long as you want to explore the area either walking or by car. Don't forget to look for the blacksmith's grave, you can't miss the anvil that marks it.\n\n",
  "Its a huge cemetery which I guess when you stop and think most are. The cemetery can have a car driven through but it might be better to walk seeing as how most of its gravel and dirty and would easy make driving a car through a pain. The cemetery is well taken care of spans a couple of blocks and has some interesting grave markers. Go see for yourself but take your walking shoes",
  "Have been here many times and it is very interesting to read the epitaphs and it is very easy to walk or drive through here.  There is usually enough space to pull to one side to allow another car to pass by.  Lots of history.",
  "In on a business trip from Chicago and hitting a number of locations in Cheyenne.  I stopped by Lakeview and guess it was a bit different than I thought and/or expected.  In my mind I was visualizing a much older cemetery that what I found.  Still a very neat place.  I like visiting these locations and looking at some of the amazing headstones that are placed.  Very neat visit.",
  "The layout was awesome because it made it easy to get around, and find who you were looking for.  Tons of old graves here which were very cool to check out.",
  "The cemetery is easy to get around and is kept well groomed. They allow flowers, balloons, ornaments year round and take pride in keeping it nice.",
  "We happened to pass this and decided to stop in for a stroll around. Many old and interesting headstones.",
  "If you are interested in western history you will recognize many of the names of Wyoming's early pioneers. A self-guided tour is available and the grounds relaxful and well-kept. "
 ]
},{
 "name": "Frontier Mall",
 "address": "1400 Dell Range Blvd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/48/87/94/getlstd-property-photo.jpg",
 "tags": [
  "food",
  "walk",
  "unique",
  "eat",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d6028483-Reviews-Frontier_Mall-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "The mall was a good outlet to walk around after work while I was here this week. It’s not the biggest mall, but fits the city very well. There are not a lot of choices for dining inside, but what was there was good, and not fast food.",
  "It's been a LONG time since I've been here and the place appears to have fallen on HARD times.  I had NO IDEA that SEARS CLOSED!  When a mall of this size loses one of its anchor stores, that is a BAD sign.  A few LARGE spaces such as Sports Authority have CLOSED and NOTHING has taken their spaces.  I went during the middle of the week and the place felt deserted.  Even the anchor stores left like JC Penny and DILLARDS were fairly EMPTY.  The offerings were reduced as well with fewer brand selections available.  The mall CAN'T survive on seasonal business alone!",
  "Every store we walked in everybody would immiediately ask if we needed help looking for something\nGreat feeling to know we are welcome and have the help without hesitation \n\nBEAUTIFUL PLACE TO GO , AND MADE OUR SHOPPING ENJOYABLE !",
  "This is a nice little mall! There were a few unique stores we shopped at and overall enjoyed our experience.",
  "Really enjoyed my first visit to the frontier mall as it is an indoor mall which is harder\nand harder to find. It was concerning that there were quite a few empty stores, but even with that there is a good selection. I was pleasantly surprised to find an old fashioned candy store, Bourbon Street Candy, where you scoop your own candy. They also appear to be a all year long Christmas store also, although not much selection this time of year. Make sure to eat at Dicky's BBQ while there. You do have to go outside of the main mall to get to it, but well worth the short walk."
 ]
},{
 "name": "Big Country Speedway",
 "address": "4820 S Greeley Hwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/6f/f6/7a/big-country-speedway.jpg",
 "tags": [
  "cheap",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60439-d6163537-Reviews-Big_Country_Speedway-Cheyenne_Wyoming.html",
 "source": "TripAdvisor",
 "reviews": [
  "I went there last Saturday night and was rewarded by seeing a few race cars growling along.  It appeared to be time trials rather than an actual race, but it was still fun.  The place is huge, restrooms are clean, but parking can be a challenge.",
  "Fun entertainment for all ages in the Summer. \nGood selection at concessions stands.\nGreat to see men AND women racers following their dreams! \nGets a little chilly when the sun goes down, bring a jacket or a blanket, and also bug spray.",
  "The speedway isn't overcrowded. It's pretty family friendly and as of 2014 Will have some awesome food to share with the family at cheap prices. Definitely worth the Saturday night it was a blast.",
  "Located on the outskirt of Cheyenne, this is a nice place to go for the weekend. Although not being a huge fan of racing, this was an experience. Crowds seem steady and he drives always entertain. Bring a coat or blanket because the nights can get chilly. ",
  "A great way to spend a summer Saturday night. Big Country Speedway has been a Cheyenne icon since 1948.  BCS is a 1/5 mile asphalt paved oval.  See their website for schedule of events."
 ]
}]
