[
{
 "name": "Franklin Park Conservatory and Botanical Gardens",
 "address": "1777 E. Broad Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/a0/61/5b/franklin-park-conservatory.jpg",
 "tags": [
  "wander",
  "art",
  "music",
  "art",
  "kids",
  "free",
  "eat",
  "walking",
  "food",
  "family",
  "drink",
  "kids",
  "free",
  "walk",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d269061-Reviews-Franklin_Park_Conservatory_and_Botanical_Gardens-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "The botanical garden is a small portion of Franklin Park, so you have the opportunity to wander the grounds outside the botanical garden in addition to enjoying the outside gardens and indoor exhibits of the botanical garden itself. There's a very nice children's garden, a small formal garden area with a beautiful sculpture, an area devoted to community garden education, a conservatory with a variety of exhibits, a glass blowing demonstration, an excellent gift shop and a cafe. June 1, 2019 marked the start of a Chihuly exhibit that will be throughout the garden areas until the end of March, 2020. We just missed the Chihuly exhibit, but we will return to see it!",
  "My wife and I have been coming here for years,and have consistently been amazed by the Conservatory. The grounds themselves are beautiful, as are the plants that are displayed. There is always a rotating art exhibit in the gallery that features a high-caliber artist, and the special exhibits, like the annual butterfly exhibit or the New Year's gala with big band music and their Christmas lights was spectacular. Highly recommended.",
  "Relaxing, beautiful, interesting, calming, quiet. Great spot to visit to get away from city life, gloomy weather, winter and renew oneself with fresh oxygen and scents from the vast variety of vegetaion set in many climates like desert, tropical, garden, etc. Fabulous Chihuly glass artwork spread throughout that catches light and transforms appearance throughout the day. Nice little snack area and marvelous gift shop that sells plants, art, books, cards, things for kids, garden accessories, more. Displays rotate throughout the year with walk-through live butterfly exhibit in spring/summer. Bonsai tree and orchid section are beautiful. Many weddings are held here and must be booked way in advance. Informative and helpful staff are always around to answer questions and give advice. This is one of Columbus' best jewels with surrounding park, pond, and outdoor farm garden in warm weather. I visit this conservatory at least once a year and the park more often. It's for all ages but be respectful of the animal and plant life. Visit for an hour at least but to enjoy everything take 2-3 hours minimum. Free parking!",
  "On a very nice spring day, our family of four (4 and 6yr olds in tow), were able to enjoy the indoor conservatory, walking grounds, and playground.  Count on at least 4 to 5 hours to enjoy the entire facility.  The butterfly room is beautiful and well maintained. There is a good flow from one place to another.\n\nIf they had more family friendly activities indoors for the kids, it would have received a 5 star from us.  Simple things like a scavenger hunt would work or more \"touch and see\" items.  But, as usual, it's more of a mass \"don't touch that\" we hear from all the parents.\n\nStrollers are a good idea, but expect to find some places where it's tough to use them.  We found a few parents with infant strollers that just could not experience some areas.\n\nFood from the café is fine. It's a buck or two more than they should charge and don't count on a fancy coffee drink (they just have brewed).  They offer bottled sodas, beer, and a few other \"non-soda\" choices. When it's lunch time and no one is eating their food in the pleasant courtyard area, you can guess it's only going to be \"ok\".\n\nIt's a bit pricy at $13 per adult and about half that for kids.  But, for the price, you are also treated to some of the wonders of Chihuly Glass which is placed throughout the facility.  Look up!  \n\nWatch out for the remodeling project going on right now at the front entrance.  \n\nDown the street and around the corner is a \"Bag of Nails\" restaurant.  Eat there for a couple bucks more!",
  "Gorgeous building, with wonderful exhibits.     Do check what the feature exhibit is first - styles and content vary greatly.   But the botanical gardens are gorgeous all the time.",
  "This is one of the best places in Columbus.   And most people don't know how nice the grounds are.  Don't just visit the Conservatory, take a stroll through the outdoor gardens",
  "It's a bit expensive if you won't be going there on a regular basis and get an annual membership, which I did and then used it only once. Very nice seasonal displays and attractions for different consumer groups (wine and vines, kind of thing) with a large focus on children. The Chihuly displays are nice but often over-booked. You can walk around the outside gardens for free.",
  "I went to see the Chihuly Exhibit but loved the Botanicals as well.  It was very welled planned with a variety of areas to visit.  This helped with traffic control and allowed for many people to be there without the feeling of being busy.  They had a nice kids area and lovely outdoor space as well.",
  "FIrst time visit and it wont be my last !  Attended the Dale Chihuly exhibit which was outstanding !  I was so impressed with this conservatory. It was probably one of the finest displays of Tropical plants I have seen this side of Florida !  The grounds are huge and I can't wait to return in the Spring/Summer to see everything green and in bloom ! Well worth the 3 hours drive we made for this visit ! ",
  "Went as a trip to get my mom out and about to something that was indoors for her birthday. Knew nothing about the place prior too so was going in with no expectations. Kinda neat to kill a few hours. Probably best to go in the early spring when the outdoors is in bloom.  South side with butterflies was probably the highlight for the kids. Use the coat check once you get upstairs or you will regret it.",
  "Went to see Chihuly exhibit. Amazing display of Chihuly glass. Gives you a good idea of what to see if you visit Chihuly glass in Seattle Wa. An added bonus was the orchid display. Awesome display of beautiful flowers thru out the gardens."
 ]
},{
 "name": "Easton Town Center",
 "address": "160 Easton Town Ctr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/f7/2b/7e/shopping.jpg",
 "tags": [
  "food",
  "free",
  "family",
  "unique",
  "theatre",
  "food",
  "food",
  "theatre",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d256675-Reviews-Easton_Town_Center-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you're looking for a great place to shop and also have lunch the Easton is a great area of Columbus to do that I found it it was easy to navigate and the places in the selection for shopping and food wonderful",
  "This wonderful outdoor shopping experience is perfect for finding EVERYTHING!!  It is so much fun to shop in high end stores like Tiffany's, specialty stores like American Girl, and family favorites like Macy's!!  The are lots of restaurants that offer various menus!  There are bars that are fun and unique!  Other reasons to visit Easton is the multiplex theatre offering the latest movies, the outdoor entertainers, the free trolley that goes all over the Easton area, and the landscaping/decorations at different seasons/holidays are beautiful!!  Easton is a place you can go and spend a weekend by staying in one of the several hotels located right there which makes a great place to drop off your purchases and freshen up before heading out for more fun, good food, and great shopping!!",
  "This center is a great place to visit while staying in the area.  You can go to all your favorite stores in a outdoor mall setting as well as going to the movies if you feel like doing something more relaxed.  While at the movies you can enjoy some food and relax in loungers.  All shopping that I enjoy was to be had as well as some great places for a cocktail afterwards.  Definitely a great place to visit.",
  "Basically this is just an upscale mall that pretends it's really a small village, but one that has a Tiffany Store in the town's center. Mostly chain stores and restaurants. During the holidays there are lots of events and lights to attract people with nothing better to do, and traffic can be horrific. It's not a covered mall, so you have to face the weather to go from one behemoth store to the next. ",
  "never ending of shopping from every angle, people are great it's a ageless experience from all levels",
  "the decor of the area was great. parking was also adequate. the drinks at the movie theatre were nice",
  "A real nice place to shop all the stores and to eat at fantastic restaurants. They also have movie theaters to waych a relax in. Plenty of parking available.",
  "This has amazing food options, an incredible movie theater plus all the stores you need and great parking."
 ]
},{
 "name": "Center of Science and Industry (COSI)",
 "address": "333 W Broad St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/3e/76/c3/cosi.jpg",
 "tags": [
  "theatre",
  "kids",
  "food",
  "kids",
  "free",
  "eat",
  "walk",
  "knowledgeable",
  "affordable",
  "kids",
  "family",
  "learn",
  "kids",
  "food",
  "kids",
  "walk",
  "kids",
  "kids",
  "free",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d110218-Reviews-Center_of_Science_and_Industry_COSI-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of fun exhibits for all ages. COSI has a little kids' space that is wonderful and exclusive for small kids and their parents. Great exhibits for older kids and adults too! Wear sneakers if you want to ride the high wire unicycle. Nice theatre! Fantastic traveling exhibits can be found here as well! This is a great place to visit for families. COSI also has great adult events.",
  "COSI is definitely a place you have to visit, we were so impressed with how much there is to do and we could have easily spent a few days there. I loved how well laid out the center is so that you can easily go from exhibit to exhibit without getting lost in a maze. We loved the Dinosaur Gallery with awesome replicas, real and cast fossils. We entered Lost Egypt with its stunning artifacts including a real mummy and sarcophagus! The Oceans area is visually stunning, one side was like being on board an interactive submarine and the other side was a totally hands on Neptune themed water play area. It has to be seen to believed with all the watery, cavernous detail that kids and adults will love. A really cool area was Progress which depicted a life like reconstruction of a typical street corner during the turn of the 20th century. Then you turn the corner and the exact same street corner is updated to the 1950s. It was so interesting to experience how transportation, communication and technology have changed over the past century. Gadgets is a terrific hands on area with tonnes of experiments and simple machines. There are experiment labs that are first come first serve which book up quickly, so I recommend checking that out earlier in the visit. There is also Planetarium on the upper level showing spectacular films inside the 60 foot dome. It is a great place to take a mid visit break and check out any of the eye-catching, cinematic gems. There are some great outdoor areas to see too like the courtyard with any larger kid-friendly experiments and a beautiful, new playground just outside the main entrance. The amenities like the Atomic Cafe had tasty, healthy food options for all ages that were very reasonably priced and the huge gift shop had fun and educational mementos. Needless to say COSI does not disappoint and would definitely consider the annual membership as it is a great visit anytime of the year, rain or shine. Thanks COSI",
  "We were in Columbus for three days and decided to check out COSI.  My children, ages 14, 10, and 6 loved it.  I read through reviews on Tripadvisor ahead of time so that I had an idea of what others really enjoyed while they were at the museum.  I am so glad I did, because I think we would have missed the lab in the Gadgets area had I not read a reviewers advice on that.  \n\nWhen we walked in, we got a few maps and a copy of the shows that were going on while we were there.  I asked the employees what they thought my kids would enjoy and they pointed us in the direction of the Mysteries of China 3D, The Journey to Space 3D movies.  They also suggested the KidSpace for my six year old and the Oceans, Science, and Progress areas.  \n\nWell, my six year old loved everything about KidSpace.  It was very clean, nicely laid out and I really liked that the water table area was in the back and in it's own area.  She spent a lot of time at the water table with the water wheel and buckets.  The little craft area was super cute and she painted a couple of pictures.  We built a house with the big blue foam blocks near the water table and she liked climbing a rock wall that she could actually do on her own.  The ticket system is great that the entrance and exit are monitored with a ticket that you have to show to be allowed to leave.  There was a show on animals while we were there and my daughter loved it.  \n\nThe oceans area was really different (odd), but my kids all thought it was cool and spent a lot of time using the water shooters, climbing in the cave and submersible.  \n\nThe highwire unicycle was an enormous hit with my 14 and 10 year olds.  They rode it numerous times.  My six year old was a few inches too short to be able to do it.  I think your inseam has to be 25\".  You need to have real shoes on, no flip flops or crocs, but they do have some shoes you can put on if your shoes do not meet the requirements.  They have a big hook that they use to help pull you if you get scared or you can't get across.  It appears to be incredibly safe with lap belt and shoulder harness and the employees are fantastic at encouraging you and reminding you of what you need to do.  \n\nThe Gadgets area is really neat and we spent a lot of time there using the pulleys to lift themselves up, setting up the gears on the walls and the other displays.  The Gadgets lab was an enormous hit and we all laughed so hard when we blasted the top off of the canister using the Alka Selter tabs.  We made flubber, picked up ice cubes with string and salt, made an old penny shiny . . .we honestly could have stayed there for hours.  The employees bring you one experiment at a time.  You order them off of a menu.  It was brilliant with how it was set up.  \n\nWe also liked the Astronaut area where you can get a mission and drive/fly different space vehicles.  My six year old didn't care for it, but the older kids had a lot of fun with it.  \n\nWe briefly ran through the Energy Explorers and wish we could have had a bit more time there.  It was fascinating and they liked trying to bike somewhere faster than a car can drive and trying to drive a car and try to get good gas mileage.\n\nThe Progress area shows a street in 1898 and then the same street in 1962.  It's kind of shocking when you see how much everything has changed in that short amount of time.  I didn't think my kids would enjoy it, but they found things to do and I had to kind of hurry them along b/c they kept finding things that interested them and the museum was getting ready to close.  \n\nAll of the shows were top notch.  We saw the mice playing basketball, the science behind fireworks, and the show on static electricity.  These shows were free and very well done.  The kids also liked the different exhibits in the hallways.  \n\nThe employees and volunteers were among the best we've ever encountered.  Everyone was extremely helpful, knowledgeable and kind.  I was really impressed with some of the teen volunteers. Some held doors for us, others had tables with fossils or other experiments.  They had ribbons of how many hours they had volunteered and I noticed one young man's ribbon said he had over 800 volunteer hours.  \n\nWe did not eat there as we had packed a cooler.  They have some picnic tables outside and a place inside where you can eat your picnic lunch.  They are working on a parking lot, so the museum parking ($5) is a bit of a walk, but not bad.  It's clearly marked and easy to find.  You take the ticket as you drive in, pay when you get your museum ticket and then feed the ticket back into the machine when you leave.  There were COSI employees standing by the machines to prevent too much of a back up.  \n\nWe had a fabulous time at this museum.  We live near Indianapolis and my kids are pretty bored with our children's museum because of the number of times we have been there.  This was so different from what we have and we all felt like it was a great mix of hands on, some screens, and great and interesting topics.  The 3D shows were really affordable at only $5 a person.  They enjoyed both of them, but were really excited about the Mysteries of China and talked about it for probably 30 minutes on the drive home.  \n\nWe made great memories at COSI and it's hands down the best thing we've done this summer.",
  "Myself and my daughter have enjoyed the COSI Camp In for 7 years, this year, our 8th year, we gave back and volunteered for a whole new experience.  This is an awesome place to explore and I would recommend to anyone.  Check out their webpage for on the information on the CAMP IN dates and times.",
  "This is a great place to spend the day with the kids! My kids loved all of the interactive activities. It's a very hands on place. They always learn something new. During the summer, weekends, or during school breaks  it can get pretty crowded. It also can get pricey if you add on any extras like the movie. Overall, my family enjoys their time there. We try to go a couple of times a year.",
  "The kids had a blast, the adults had a blast watching the kids explore and experience. Exhibits were interesting to many ages, very clean.\n\nIt is under construction, long cold walk from parking lot, take advantage of the drop off zone, then park the car, this way they little ones wont need to take part in the long cold walk.\n\nMany bathrooms to use all over the science center, snacks and food in the little cafeteria, and many large lockers to rent to hold coats and things.",
  "Visited with kids while taking time to know the city. We spent about 4-5 hrs while enjoying this exciting place for all ages. \n\n",
  "We have a membership.  It is a great way to spend a day with the kids. Progress is my kids favorite. As a fun tip the rocket works with a any change.",
  "I was born and raised in Columbus, Ohio. I had many childhood experiences in COSI and I even took my own daughter to see all the cool things. Just a few years ago, COSI took away their interactive adventure puzzle. They replaced it with the dinosaur museum. The first time through is great but for a permanent exhibit, the dinosaur museum is subpar. I miss the interactive puzzles that once filled COSI. Now it's hardly worth going to see since nothing every gets changed or updated. I had a membership for three years with them and all that changed in that time was the Dinosaur museum and their mystical creatures exhibit.",
  "I visited during my free time on a business trip and was pleasantly surprised. The museum is massive and full of interesting exhibits. I was impressed with the historical counts of the native Americans who contributed so much to the area. Plenty for all to do and see across age categories. Close proximity to downtown restaurants, etc. ",
  "COSI was a fun trip for my husband and I and our 2 granddaughters.  Our main objective was a day of exploring the dinosaur exhibit with our 2 dinosaur loving granddaughters.  They were so excited to see dinosaurs up close and personal.  We also explored some other exhibits, but had to leave after 3 hours when the youngest went into meltdown mode.  We did purchase a grandparent family pass for $180+ and have since returned to visit COSI again.  It is a great way to spend a couple hours seeing the world thru a child's eyes."
 ]
},{
 "name": "North Market Farmer's Market",
 "address": "59 Spruce St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/e7/25/b4/img-20180726-170514-largejpg.jpg",
 "tags": [
  "food",
  "walk",
  "food",
  "eat",
  "food",
  "food",
  "family",
  "food",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d278918-Reviews-North_Market_Farmer_s_Market-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Amazing selection of restaurants and vendors with wide selection of meats, vegetables, baked goods, & made to order food. Great place to walk around. North Market is steps from Columbus Convention Center and many nearby restaurants and pubs. Street, surface, and garage parking available. ",
  "Watching my 1 year old granddaughter at a nearby hotel while her mom attended a conference, we walked over to this great market every day. They have just about any kind of food you can imagine: Greek, Thai, Nepali, Vietnamese, Italian pasta, American barbecue, Polish, vegetarian, hearty grains,  Mexican, craft beers, bakeries, ice cream, specialty donuts, fried chicken, crepes, produce,  two butchers, fishmonger, coffees, spices, and a flower stand.  Most things were $10 or less. There is seating upstairs  It is busy and crowded around the lunch hour, so we tried to go after two o’clock each day.",
  "Been here several times, now I make it a regular stop every time I am in Columbus. All sorts of prepared cuisines to have a great lunch, from Italian to Indian, Sushi, Greek, Asian, Katzingers Deli, etc. Specialty shops for wine and beer, cheese, breads, donuts, oils, vinegars, gifts, cards, flowers, etc. My favorite spot is \"The Fish Guys\"! Tons of fresh seafood to buy and take home to cook, very hard to find where I live, so I always take a cooler and get several varieties to take home. If you don't have a cooler, they will fix you up with a Styrofoam container and plenty of ice. There's something for everyone at the North Market! ",
  "If you are looking for something to eat, this is the place to go. There are lots of options from around the world and many of the stalls cook food to order.\nThere was so much choice we came back another day as we wanted to try  out more cuisines.\nHighlights were the sushi (for my husband) and the ice cream for me!\nOnly downside is the lack of seating near the stalls however their is another level with seating but we did not check this out.\nDon't let the shabby exterior put you off.",
  "The variety of retailers is amazing.  Food from around the globe can be sampled here.  There is also an incredible spice shop, a balsamic vinegar vendor, meat market, and Bakery.  It is one of my favorite destinations in Columbus.",
  "Excellent time with family, enjoyed every meal!!! Multiple choices to select your perfect plate!!! Beers, Tacos, Donuts, BBQ... all in one place!!!\n",
  "This place is such a gem. I was lucky enough to be introduced to it by a native buck eye. There are so many food options to choose from in here, makes it ideal for groups or people that like variety. I mean pho, ramen, dumplings, pretzels, Thai, Somali, hot chicken, donuts,baked goods. You can also pick up fresh chicken, fish, beef, alcohol and spices. I sincerely enjoyed my time at North Market. Anytime I'm in Columbus I'll make it a point to visit and you should too.",
  "Nice place with some local producers. Best if you look for something to eat quickly that is not fast food."
 ]
},{
 "name": "Scioto Mile",
 "address": "233 Civic Center Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/1e/5f/90/scioto-mile.jpg",
 "tags": [
  "music",
  "walk",
  "walking",
  "walking",
  "walk",
  "free",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d3427631-Reviews-Scioto_Mile-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "There is more to this site than simply a mile walk. There are actually several miles of well-maintained hiking paths. While taking them, you can see a good view of downtown Columbus. There is also an extremely amazing and quite large fountain. During summer months there are several ongoing events, ( including music and dining ). Bikers can also this wonderful destination. A portion of the \"Mile\" offers excellent viewing of the Scioto River, gardens with plenty of benches. Wear comfortable shoes.",
  "The area was so clean and very well maintained I would hope to pass by here again! It’s definitely good for running,walking and biking! It probably looks gorgeous during the summer time but it was fall and the leaves changed colors!",
  "I loved walking with my beautiful wife next to the river it was a great  evening, we also rented bicycles to ride the mile great time will do again for sure. ",
  "Nice walk along the river with the view of the downtown. Many people walking riding their bikes. very clean and green.",
  "This was a beautiful area for a walk. Everything was clean, well maintained and free of trash. Plenty of people walking and biking in the area. It was so nice to just enjoy the day and not be too worried about the atmosphere or whether two females were in a dangerous place. "
 ]
},{
 "name": "German Village",
 "address": "588 S 3rd St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/56/e7/a2/german-village.jpg",
 "tags": [
  "tour",
  "walk",
  "nature",
  "food",
  "parks",
  "historic",
  "kids",
  "unique",
  "food",
  "delicious",
  "art",
  "family",
  "walking",
  "walking",
  "art",
  "family",
  "walking",
  "unique",
  "walk",
  "unique",
  "free",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d110220-Reviews-German_Village-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great parks , historic homes , cobblestone streets , old bookstore , fantastic restaurants, bars and more \nThe first ho,e o German immigrants to columbus hence German village where beer was brewed , has turned into nice homes historic in nature , bricked streets , many nice restaurants Including two of my favorites Lindys and katzingers deli and I can’t forget original Schmidt sausage house for German food lovers . Schiller park a great place to walk, walk dog, take kids fishing , also has rec  center  ( basketball , work outs ), area for outdoor plays in the summer and more \nReally beautiful homes surrounding the park has their own home tour each year . ",
  "a sweet area, spent some time in the loft book store, could have gladly spent the whole day.  the greatest book store ever.....had coffee and pastries at the bakery and bought chocolate at the candy store....",
  "Every time I'm in Columbus I make sure to visit German Village. You will find unique experiences and items in all the quirky, fun shops such as Vernacular, Helen Winnemore's, The Book Loft (truly a must-see), Hausfrau, and enjoy delicious food from the casual Katzinger's to upscale Lindey's. Also check out Pistacia Vera and Stauf's Coffee (next to the Book Loft). If you're craving bar food head to Mohawk or Roosters for wings and fantastic salad. Picnic in Shiller Park and if you have little ones, look for the fairies!",
  "We spent a very full day in German Village with some family and friends. This quaint area of Columbus has some points of interest - a nice park, beautiful architecture (although some of the homes and shops look nice and sound, many structures are in desperate need of repair), coffee shops, restaurants, art galleries, and shops where you can buy a variety of items and souvenirs. Weekends get very crowded here, so if you can, it is best to go early on a weekday in order to avoid the parking dilemma, as parking space is at a minimum. Be prepared for lots of walking; the brick streets are extremely narrow and bumpy, as are the sidewalks, so wear comfortable shoes. In my opinion, the nicest store in German Village is Helen Winnemore's, which has lots of high quality artisan made jewelry, clothing, candles, beautiful cards, etc. As soon as I walked in the door, a woman greeted me with a smile and offered me a coffee, which was served in a real coffee mug, not styrofoam. My purchases there were carefully boxed and bagged. The customer service - not to mention the quality of the merchandise at Helen Winnemore's is exemplary, and I will go back. \nEarly evening, we headed to Barcelona Restaurant, which I will review separately. All in all, we had a pleasant day just meandering through the village, stopping to shop, having coffees, relaxing. A trip to German Village would be good for the young and the young-at-heart.",
  "It's always a special treat when we get to visit German Village. The restored brick homes are beautiful and line the brick streets back to back.\n\nLots of great little shops and dining in the area. The park is also a nice place to relax in the summer time.\n\nFavorite places are The Book Loft and Schmidt's Sausage Haus, both of which fill up pretty quickly.\n\nParking can be quite the chore, so plan on wearing your walking shoes.",
  "We spent a very full day in German Village with some family and friends. This quaint area of Columbus has some points of interest - a nice park, beautiful architecture (although some of the homes and shops look nice and sound, many structures are in desperate need of repair), coffee shops, restaurants, art galleries, and shops where you can buy a variety of items and souvenirs. Weekends get very crowded here, so if you can, it is best to go early on a weekday in order to avoid the parking dilemma, as parking space is at a minimum. Be prepared for lots of walking; the brick streets are extremely narrow and bumpy, as are the sidewalks, so wear comfortable shoes. In my opinion, the nicest store in German Village is Helen Winnemore's, which has lots of high quality artisan made jewelry, clothing, candles, beautiful cards, etc. As soon as I walked in the door, a woman greeted me with a smile and offered me a coffee, which was served in a real coffee mug, not styrofoam. My purchases there were carefully boxed and bagged. The customer service - not to mention the quality of the merchandise at Helen Winnemore's is exemplary, and I will go back. \nEarly evening, we headed to Barcelona Restaurant, which I will review separately. All in all, we had a pleasant day just meandering through the village, stopping to shop, having coffees, relaxing. A trip to German Village would be good for the young and the young-at-heart.",
  "A very trendy place, although the buildings themselves aren't unique as they were originally built for German workers in various city industires (esp. breweries). There are periodic Haus und Garten shows where people who have spent beaucoup bucks show off what they can do in 1500 square feet. It's a pleasant place for a stroll with Schiller Park in the middle and a sprinkling of German-run or themed restaurants, esp. Schmidt's Sausage Haus (125 years old) with its cream puff and Juergens Restaurant with authentic German foods. Prepare for cobble stone streets and one-way traffic.",
  "My wife and I have made few trips to the Bavarian part of Germany. This past March we went to Bad Zwischenahn in the north west area. We visited friends for a week. We went to an 800 year old church and ate lunch in a 300 year old restaurant.    Bad Zwischenahn is a quaint lake side resort village with beautiful scenery and great restaurants. It is also convenient to travel to the Netherlands from also.",
  "Beautiful example of how you can restore and preserve old homes from the 1800's !  Well worth the trip to just walk, look and have lunch.  The are several really good restaurants for lunch and dinner. ",
  "A unique and older neighborhood in the city, except for architecture and brick-paved streets and sidewalks, there wasn't much to see or do.",
  "Not at all impressed by this area as it is a bit rundown and the parking is an issue.  There are lots of restaurants, but tough to find cheap or free parking nearby."
 ]
},{
 "name": "Ohio Stadium",
 "address": "410 Woody Hayes Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/c4/62/46/photo0jpg.jpg",
 "tags": [
  "eat",
  "history",
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d559429-Reviews-Ohio_Stadium-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Attending a football game in the 'Shoe was on my bucket list.  Great venue, great team, even better fans!",
  "This is one of the biggest college stadiums to watch a football game in. The noise level is high along with the excitement of watching the home team scoring a touchdown.",
  "Whether you’re going to a football game or to a concert, Ohio Stadium is the place to be. The 4th largest stadium in America has multiple concession stands that include Donato‘s pizza and even Panera. You’ll always have tons to eat and a lot of fun. If you’re going to a game, you’ll have a blast watching the game and an incredible halftime show by the best damn band in the land. ",
  "I have been to Nascar races, NFL games, NBA games, MLB games but NOTHING compares to college football games. The Stadium is old and has history in it. You can feel the energy of the fans and the teams. The concession stands and souvenir stands are comparable to the major league sports. But there is so much to see and do on Game Day... Buckeye Nation is the best fan base is all of college football....O-H",
  "Tailgated before the game and then sat on the 50 yard line for the game. Had a great time, and the Food prices inside the stadium were not bad. Buckeye Donuts was great for Breakfast, and Eddie George's 27 restaurant was very good as well, however it has moved and is no longer within walking distance to the stadium. Tommy's pizza, was a letdown, and way overpriced. Got to get up close and even have a talk with some of the Fox Sports personalities and Ohio State players. Same with ESPN, and many of them hung out at Panera Bread right across the street from the Stadium. Urban Meyer's restaurant was booked solid and we could not get in, make advance reservations!!!!"
 ]
},{
 "name": "Ohio Theater",
 "address": "39 E State St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/86/b5/1f/ohio-theater.jpg",
 "tags": [
  "tour",
  "music",
  "performance",
  "history",
  "historic",
  "theatre",
  "historic",
  "music",
  "music",
  "history",
  "kids",
  "performance",
  "historic",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d110223-Reviews-Ohio_Theater-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "This beautiful historic theatre is a must see for any performance! The Ohio Theatre has a plethora of activities to choose from.  Live plays, concerts, silent films with live organ music, and much more are available on schedule every year.  There is no such thing as a bad seat as the acoustics are perfect all the way to the top seat in the balcony.  The building is beautiful down to the smallest detail.  And the center chandelier is breath taking.  Carpeted stairs take you to the balcony and to the soft velvet seats throughout the theatre. Refreshments are available in the lobby. Restrooms are clean and as intricate as the history of the theatre in beauty. Garage parking is available under the Statehouse across the street.  The schedule features the best in the business of entertainment and no show will disappoint you.  The staff is wonderful and takes extreme pride in this historical landmark theatre. CAPA also offers a tour of the theatre if you don’t get enough when you go for a performance. I highly recommend seeing this beautiful theatre and enjoying any of the shows scheduled on this amazing stage of entertainment.",
  "This theater is wonderful and is located right next to the Ohio Statehouse in downtown Columbus. There is plenty of parking in the nearby parking garages and they showcase a wide variety of shows from Broadway to symphonies to dance and everything in between from the community artists and traveling artists. The interior is beautiful with historic details that have been preserved in the renovations and it is a large theater with mezzanine, loge, balcony, and upper balcony sections for a variety of views and price points for shows. They also show great old movies in the summer when the theater season is over complete with organist that plays themed music before the movie and during intermission on the",
  "This Theater has been restored to its 1920's style! Lots of Maroon velvet and beautiful detail work! The people that run it are the elite Snobs of Central Ohio and are proud of themselves and for good reason. Weather you are enjoying the Nutcracker ballet, the Columbus Symphony Orchestra or simply the Summer movie series it is a delight and reasonably priced! The great Whurlitzer ? Organ is Boffo and gives you a real insite as to the class and luxury of the 20's and 30's. the Movies include old Silent films such as Laurel And Hardy  and Buster Keaton , Chaplin and the great Harold Loyde! the Organist has the sheet music that went with the Movies in those days and you can immerse  yourself in the history of the great times when Hollywood was pro American and the Government and police were not considered the enemy! This place is right across  the Street from the State House And ample Parking is available there ! If you want the Kids to have a hoot this is a good place to go and not expensive!",
  "If you are enjoying your performance, or the look of the performers, you will benefit from the spacious seats and dim lighting of the space, which is very conducive to you sneaking in a quick tug. Overall this place is pretty great.",
  "The 1928 build theater has survived many years and was scheduled for demolition in 1969 but was saved and completely restored. The inside is elegant with much of the old style preserved including a theater pipe organ that was restored. It is home for the Columbus Symphony Orchestra, local ballet company and several other performing arts. It is staffed by mainly volunteers who usher guest to their seats. The volunteers are all dressed similarly and very polite and friendly.  The Ohio Theater also host several touring Broadway Shows. The theater is across the street from the Ohio State Capitol building and parking is available in their parking garage.  I have seen several Broadway Shows, listen to Symphony Orchestra performances, watched old movies in the summer, and attended some small College graduations. \nIt is always enjoyable to attend things that take place at the Historic Ohio Theater.",
  "Enjoyed the show. This place has great seating all around and atmosphere that takes you back in time. Easy access and to alot of events before or after a show.",
  "We went to see the Christmas Carol. It was an amazing experience. The play was excellently performed with a perfect mixture of laughter and sentiment. The cast was very talented and the staff was kind and considerate. The theater was beautiful.Another favorite thing was the organ player, watching it go up and down was a fun treat. The orchestra did a lovely job as well.",
  "I have loved this theatre since the 50’s !   I have seen George Carlin, Boston and other bands I frankly can’t remember!   The aura and beauty of this national landmark hits you as you enter the lobby. The restrooms remind me of when they actually had attendants to give you a towel or someone to shine your shoes! Ah, the good old days!\nCome see the Ohio and the RKO Palace to go back to the Eisenhower era. You will be blown away!"
 ]
},{
 "name": "Otherworld",
 "address": "5819 Chantry Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/1e/f2/0b/photo3jpg.jpg",
 "tags": [
  "unique",
  "family",
  "creative",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d17653079-Reviews-Otherworld-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Awesome and unique experience.\n\nSome rooms will give me nightmares for the rest of my life while others I'll dream about for years so I guess it cancels out. \n\nBiggest negative for me were my eyes wanting to die after about 3 hours of unnatural light.\n\nI guess it is an other world afterall!",
  "Outside looked deceiving, but once you get inside, you will have the time of your life.  A great family outing.",
  "The artists are creative and skilled at immersing you into their world.  Spent a little over an hour here.  Your admission covers the entire day, so if you wish to leave and come back - you can.  We found ourselves visiting some exhibits twice because we enjoyed them so much.   Wished we lived closer so we could visit this amazing place more often.",
  "This was an amazing interactive (TOUCH THE WALLS!!) immersive art experience that our entire family enjoyed. Highly suggest you get there right at opening because it gets busy quick and there are long lines! Be sure to check out the bathrooms as there is some pretty cool art in there too! Keep your eyes open for hidden little rooms and crawl spaces that make the place even more enjoyable! ",
  "We really enjoyed the visit. Ages six to ten. Recommend buying tickets online saves time and it’s for a 24 hour visit so if you go in afternoon can go back the next day. It was worth the price."
 ]
},{
 "name": "Columbus Museum of Art",
 "address": "480 E Broad St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/f9/80/67/inside.jpg",
 "tags": [
  "art",
  "eat",
  "delicious",
  "art",
  "learn",
  "free",
  "art",
  "cheap",
  "food",
  "free",
  "art",
  "kids",
  "art",
  "free",
  "art",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d519178-Reviews-Columbus_Museum_of_Art-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Trip Advisor does not recognize the existence of Schokko Art Café in CMA, so I will leave a review of this outstanding part of the newly remodeled wing.\nAs all In Central Ohio know, the name Cameron Mitchell behind a dining establishment is a very good thing. His newest creation, Schokko Art Café at the CMA is no exception.\nIt is a bit different from his more traditional places as one orders at the front. A server brings your selection to your table.\nThere are a variety of soups, salads and sandwiches offered as well as a reasonable selection of wine by the glass. You do not have to visit the gallery if you just are there to eat. Many downtown employees as well dine there. It is designed for quick turnover but in off hours I'm sure lingering would not be a problem. The Café is open 10-5 on Tuesday, Wednesday, Friday, Saturday and Sunday; 10-9 Thursday; closed Monday.\nMy partner and I had a salad with salmon and chicken Caesar salad respectively. Both were delicious. They have some desserts which look mouthwatering. We shared a scrumptious brownie. A museum visit followed by a lunch at Schokko Art Café makes for a most pleasant day in C-bus.\nThe new addition to CMA is greatly enhanced by this venue. Kudos to all involved.",
  "The Columbus Museum of Art is an incredibly accessible collection of internationally renowned, high quality art.  The entire staff -- from director to curators to staff to volunteer docents -- they are clearly following a mission of sharing their love of art with everyone they encounter.  They are justifiable proud of the museum in all its aspects and really seem to care if others enjoy and learn about what's there.  Free admission Sundays and later hours on Thursdays show their concern that everyone can access their museum.  Yoga, book club, concerts and other events demonstrate how art can weave into anyone's interests.",
  "We headed to this museum to see the Toulouse-Lautrec exihibit, but we were also pretty impressed by the permanent collection. A goodly number of Impressionist works were on display, along with an excellent selection of American art. The original building is lovely, and the new addition looks promising. We are likely to go back once the addition is completed. By the way, Sundays are free, though admission is very cheap during the rest of the week by museum standards. They have several activities geared toward children, and the cafeteria is far from fancy, but it's decent food and not outrageously priced.",
  "I love modern and contemporary art and the new acquisition at CMOA was a welcomed surprise. I visited on my own on a game day Saturday, arriving right after they opened. I was greeted warmly and offered optional discounts which I actually could take advantage of, but then added the special contemporary exhibit which was wonderful. (Either way your money goes to support the museum so it’s worth paying extra!) The docents were equally friendly and helpful. The museum has a lot to offer and I enjoyed all the interactive elements, even the Wonder space that was great for kids and adults a like. An unexpected, excellent art experience in Columbus!",
  "Columbus Museum of ARt is not the biggest. That is a \"good thing.\" It is a great place to introduce students to arit without overwhelming. There activities, especially those for children are outstanding. They have traveling exhibitions and change activities frequently. The museum has free Sundays so that even those on a budget can spent time enjoying art. ",
  "This is one of the most beautiful art museums I’ve ever visited. It looks smaller than it will be from the outside but once you’re in the versatility in art will astound you. I was impressed at how different each area of the museum is. You have something for everyone. If you are an art lover this is a must see spot to visit. ",
  "I made a special trip to Columbus to see the impressionism and cubism galleries in this museum.  They have some prominent painters presented in these galleries which made it worth the trip. I also appreciated viewing the American regionalism paintings. I was rather disappointed that the museum was rather small and did not have a wide variety of works from periods throughout history.  I was rather pleased that they will validate your $5 parking ticket if you spend at least $5 in the gift shop or restaurant.",
  "We visited today for the special Rodin and Alice Schille exhibits. An additional admission charge is assessed. The Rodin bronzes were overwhelming. Narrative descriptions of each work. Great explanations and overview of Rodin’s life. Will need a second visit to truly appreciate. The Schille exhibit was marvelous. Schille was a Columbus native. The watercolors are arranged chronologically. Good explanations and history."
 ]
},{
 "name": "Wagner-Hagans Auto Museum",
 "address": "476 E Kossuth St Add Email Address",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/e8/33/01/wagner-hagans-auto-museum.jpg",
 "tags": [
  "tour",
  "tour",
  "knowledgeable",
  "tour",
  "historic",
  "unique",
  "history",
  "history",
  "tour",
  "free",
  "tour",
  "knowledgeable",
  "history",
  "unique",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d7377857-Reviews-Wagner_Hagans_Auto_Museum-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Steve is a wonderful person! I’ve come all the way from Bulgaria and so far I’ve enjoyed his museum the most in Columbus. The collection is really nice and the combination of his classic american cars from the 50-60s, his very rare license plates, signs and items is a perfect combo and creates an unforgettable experience. He knows his stuff and he will be glad to give you a tour.",
  "What a great visit to the Wagner-Hogan’s museum, with a personal tour by Steve, the immensely knowledgeable collector of all things cars.  Among numerous anecdotes, he showed me the now highly illegal knob on the steering wheel of an early pickup truck - that would break your arm if you let it go in mid-turn.  Or the sedan with the front seats that convert to a bed; apparently drive-in owners would complain at too many steamed up windows, and the feature was discontinued.  And on and on.  Thanks again Steve for a great visit - I’ll keep my eyes open for that Vatican City license plate for you (can’t promise single letter, though)  ;-)",
  "This is a very fun museum, packed full of interesting and unique post-war cars, a very unique license plate collection, neon signs, gas pumps, and pre-war military jeeps and motorcycles.  Steve Wagner is a great entertaining tour guide, full of fascinating car trivia and historic information about Ohio's role in automotive history.  Whether you are a kid or an old-timer or anywhere in between, there is plenty here to keep you interested.",
  "Met Mr. Wagner some years ago at a car show and he invited me to come visit his museum - it's more of a private collection but who's splitting hairs ;) Finally made the trip to visit and it was so cool.  A trip back in time to see some amazing history and vehicles and Mr. Wagner is such a great host.   You have to call and make arrangements to visit; no set hours here. \n\nHe had one car in there that was both an automatic and manual.  That must be interesting to drive!",
  "After having just left this fabulous auto museum, we know exactly why this attraction is rated the #1 thing to do in Columbus. The owner & tour guide, Steve, was able to schedule us the same day. We had such a great time listening to his interesting stories about each car as well as all the memorabilia! He has a BEAUTIFUL collection of antique cars in a myriad of colors and has maintained their original details very well. We couldn’t believe that this tour was free (although we were so happy to have the chance to leave a donation on our way out as a thank you for his time & opening up his garage to us). We were delighted to be able to actually touch the vehicles, open doors/gas caps & really look at the cars. Such an enjoyable & relaxing hour & well worth anyone’s time! Thank you Steve! ",
  "Car enthusiasts will be in nirvana after visiting this place; non-motorheads will also enjoy it if for nothing else than the infectious enthusiasm of Mr. Wagner, the co-owner who provides tours. It all starts by calling ahead of time to set up an appointment to view this museum, which joins the cream of the crop of two private collections. Mr. Wagner will meet you at the property at the appointed time and give you a personalized tour of the joint collection. OMG, it's like dying and going to motorhead heaven! His half of the collection specialized on cars from the 1950s which should be of special interest to baby-boomers (and pique the curiosity of younger visitors). His delivery is laid-back but fact-filled and it's a privilege to have this knowledgeable collector share his personal stories and vast knowledge. He also collect license plates, license plate toppers and other automobiliana artifacts and is happy to share his stories of how he acquired each item/car. The other half of the museum is devoted to Mr. Hagans' collection of classic cars (most/all of which are Packards). Mr. Wagner modestly says that he isn't as knowledgeable about the 1930s Packards that his colleague collects but don't be fooled--you'll leave your personalized tour knowing more about Packards than you knew before. He is also knowledgeable about the advertising signs adorning the museum, and takes a special interest in explaining the research he's put in to some of the period photographs. This was my first-ever visit to Columbus and to the German Village neighborhood. I had a blast and can't wait to come back; but the definite highlight was getting a personalized tour of this museum from the friendliest guy I've met in years. Definitely the most amazing hour I spent during my C'bus visit. BTW, Mr. Wagner is also full of useful information for C'bus visitors including restaurant and lodging recommendations. He claims to be in private industry but I suspect that he secretly works for the C'bus Tourism Board. If he doesn't--they need to snatch him up quickly because he's the best city booster I met--and everyone here is proud of C'bus!",
  "We had a great time visiting the Wagner-Hagans Auto Museum. Steve was terrific as he shared the loves of his life -- cars and the license plates that make them legal! What interesting stories he has to tell about the history of cars (find out about the role soybeans played!! Amazing!!) It's a off-the-beaten-path place that we're sure glad we found!",
  " Your cars are unique in the fact that they are all original, all run and all are used on a regular basis.  The licenses are also a fabulous collection . Steve's knowledge and passion for classic cars makes this visit a very special one. \nWhat a treat to spend time with Steve and share in his special collection.",
  "If you would like to see a car collection from the 1950's and 1960's this is the place!  You need to call in advance and schedule an appointment with the owners (Steve was our host and he made the visit extremely interesting).  All of his cars have been well restored and for us it was a trip down memory lane.  He has a fantastic collection of license plates and other car nostalgia.  There are also some military vehicles on display.  I have been to many classic car shows and museums over the years and this was by far the best that I have seen.  Don't miss this museum!",
  "This museum is small and houses vintage automobiles in a small warehouse type of building so you do need to call first and set up an appointment as it is under lock and key. Steve, the owner, a very pleasant man with a lot of knowledge about cars, greeted us as we pulled up. He walks you through his collection and really gives you a lot of information about the cars he owns. We spent at least an hour here. This is a must do in Columbus if you are a car enthusiast.",
  "Steve is an amazing host. He's super knowledgeable with so many things in his collection. You don't need to be a gearhead to appreciate his collection. Steve makes his collection relatable to almost everyone. It's a great way to spend an hour or two. Listening to Steve spin his yarns is a treat; his approach is so much more personable than any museum your one could get anywhere. It's a step back in time and one couldn't be luckier to have Steve as your guide. Make an appointment now!"
 ]
},{
 "name": "Nationwide Arena",
 "address": "200 W Nationwide Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/86/35/20/nationwide-arena.jpg",
 "tags": [
  "food",
  "food",
  "drink",
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d183841-Reviews-Nationwide_Arena-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "We go every January for a CBJ game, last year did the CBJ-Bob Seger double. An easy facility to navigate & a super staff all around.",
  "Saw the Blue Jackets play the Maple Leafs and was impressed with Nationwide Arena. It’s a nice modern venue with large, airy corridors on the main level. They have quite a few food options to choose from. Our seats in the lower bowl were good. \n\nOne thing that adds to the environment during a hockey game is the cannon that goes off when the Blue Jackets score. I wasn’t expecting it and it definitely made me jump the first time it went off!\n\nThe doors open one hour before game time. This seems a bit early to me. We arrived before that and there were several lengthy lines of people waiting to get in. \n\nParking was very easy. There is a large parking garage about a block away that was very easy to get I and out of. At $10 it was a good deal given the location. ",
  "The Blue Jackets have a fantastic facility here - some lounge options if you're seated in the right area,  lots of food and drink stands and easy to access facilities.    A friendly place to visit which had a great atmosphere for the game.    Probably helped they won 8-4 :-)",
  "Attended a professional conference at the same time as the Junior Olympics Fencing competition, as well as a volleyball tournament. It is a beautiful venue of the kind every major city should have. But, the concessions were as overpriced as every sports venue and parking was absolutely a nightmare!",
  "I visited this arena for a Blue Jackets / Panthers game while on a quest to see an NHL game at every arena in the NHL (trying for 2 to 3 per season). \n\nThe are around the arena was fantastic, lots of parking, clean streets with lots of bars and restaurants to power-up for the game.\n\nThe arena itself was a bast, the staff were all friendly, attentive, the common-areas clean, and everything well maintained. It had ample bathrooms and a wide variety of eating places. \n\nCompared to other NHL arena's I've visited, the prices of the concessions are slightly cheaper than average - which is nice. \n\nThe fans were also great, most seemed to have a great sense of hockey etiquette, knowledge of the game, and the players.\n\nThe seats were a bit snug for a big-boy like me, but that's pretty much the standard these days. ",
  "We go every January for a CBJ game, last year did the CBJ-Bob Seger double. An easy facility to navigate & a super staff all around.",
  "Nationwide arena is in a great location with many restaurants in walking distance as well as some hotels. It’s a well kept stadium that has plenty of food options and pleasant staff. Recommend it as a venue.",
  "We purchased tickets to a Blue Jackets/Penguins game...and were quite impressed with the Nationwide Arena facility. There are no obstructed views at this modern facility...and really not a bad seat in the house. The usher staff and workers at the concession/food areas were very friendly and helpful....and we look forward to going to more games in the future."
 ]
},{
 "name": "Ohio State University",
 "address": "N High St between 11th and Lane Aves.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/0d/c8/f2/ohio-state-university.jpg",
 "tags": [
  "art",
  "library",
  "free",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d519181-Reviews-Ohio_State_University-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Parking is very expensive and limited, and I'm not sure what you can see besides the Wexner Art Museum (fee), maybe the library, or just stroll the immense campus now almost completely filled with buildings. There's a small \"Mirror Lake\" and a few very old trees on the small campus near High Street. When students are in session, it's pretty packed with students, and sometimes towards the week end various small festivals like a Renaissance festival, or other activities some of which might be amusing. The arboretum off Lane Avenue has a nice collection of tree and plant specimens and is free. You will need to drive there from the main campus. ",
  "This is truly an awesome campus.  Regardless of season or reason its a fun place to be.  So much to see just walking around.  High street forms the eastern edge.  Lane to the North.  Love this place!",
  "The campus here is really beautiful...the pond with the ducks is really lovely. I can imagine when the weather is warmer, sitting there soaking up the sun.  The stadium is really magnificent, after all it is the 3rd largest in the US. The area by the campus is full of shops and restaurants too! ",
  "Before OSU's dominant sports programs, the college was founded as a land-grant University. Founded in 1870, its original name was the Ohio Agricultural and Mechanical College due to its location in a farming community.  Its name was changed to The Ohio State University in 1878. OSU offers more than 160 undergraduate majors. The highly ranked graduate programs are offered from schools as the College of Education and Human Ecology, Max M. Fisher College of Business and College of Medicine. The campus has has a widespread of opportunities,  It is a quality education for a large amount of students,",
  "Great people and great education - Very prestigious!! Everywhere you go you can get an O-H when wearing OSU gear! "
 ]
},{
 "name": "Huntington Park",
 "address": "330 Huntington Park Ln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/2a/48/9d/huntington-park.jpg",
 "tags": [
  "unique",
  "walking",
  "food",
  "drink",
  "walking",
  "cheap",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d1758593-Reviews-Huntington_Park-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a very good park to catch a AAA baseball game, and convenient walking to most of downtown Columbus.  The sight lines were pretty good here throughout.  Only real complaint was the \"homogeny\" of the vendors throughout the lower level;  there wasn't much that stood out as unique.  I did have a freshly made sub from the one unique vendor stand, which was a pretty good value.  Overall, a very good place to watch some baseball!",
  "This is a great ball park. Not a bad seat. Decent specials throughout the season. We don’t even like baseball but love the experience. Small groups or larger groups. Grab some food and drink and have fun! ",
  "We enjoyed the game as well as the atmosphere. It’s almost like the look of an older ballpark. We loved every part of it!",
  "This is a great ball park near the heart of downtown Columbus.  Parking is well within walking distance with easy in and out.  The ball park itself is beautiful.  ",
  "Big improvement from the old stadium. First time seeing this stadium since I moved out West. Although they lost in the game I attended, still fun atmosphere. Wished there was more memorabilia to look on display. Parking is cheap. Food and gifts are a little pricey, but nothing new there. Go check it out. "
 ]
},{
 "name": "Shadowbox Live",
 "address": "503 S Front St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/30/d8/96/20160129-194454-largejpg.jpg",
 "tags": [
  "music",
  "family",
  "food",
  "drink",
  "walk",
  "art",
  "affordable",
  "music",
  "food",
  "music",
  "creative",
  "food",
  "art",
  "performance",
  "theatre",
  "music",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d2356385-Reviews-Shadowbox_Live-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have not been to shadowbox for YEARS.  And we went with family and friends.  It was REALLY great!\nIt was so funny. The music was great! The food was really good!  We had an amazing pizza!\nThe skits were hilarious and the staff was wonderful.  \nCan't say enough good things about this!  Really a fun night!\nGo early and have a drink so you can get a good table!",
  "I've been many times to the Shadowbox Live. It seems that when we need something to do, whether it be with my husband or with the girls, we can depend on the shadowbox for some good clean entertainment. The price is a little steep in my opinion. At times they offer special rates but it seems it's never on a date that were able to attend. The booking process is very easy. The entire staff are very helpful and friendly. The skits are hilarious and the music is very mesmerizing.  It seems I've hear mostly rock or alternative rock music. I personally wish I could hear a little more pop or hip hop but that's bc I prefer it. But I can usually recognize at least two songs out of the night. Regardless, I enjoy watching the musicians play like a piece of art. The food seems very good. I've never ate anything there I didn't like. The service is awesome. The drinks are very well worth the money. The surroundings are accommodating and clean. Parking is affordable and roomy without needing to walk far. ",
  "Shadowbox' cabaret-style show is full of energy and creativity, music and comedy.  Can be a bit \"naughtly,\" so find out what show is playing before you go.  Have attended dozens of their shows and never disappointed.",
  "A million laughs + great food and service!  What more can I say! Very talented people doing  creative skits.  Musicians were great!",
  "I have been coming to ShadowboxLive since I was 18 years old. Just as I have evolved in these last 13 years, just as my journey has taken many different paths, so has Shadowbox. They went from doing one type of show to putting on original musicals, powerful dance productions, boot camps for educational outreach, and immersive theatre experiences where they share stories that will make you laugh and cry, and of course, all to the soundtrack of some pretty powerful music. They have transformed this organization all without ever losing themselves. And I guess, for me, that’s what keeps me coming back. That is what makes them special. Every performer there believes in the mission of the company, they share a heart that beats for the same cause and no matter how much they change or the number of new productions they try, they always stay committed to the same thing; to impact this incredible community we live in through art. When I sit in that theatre on any given night, for those 2 hours, nothing else matters. For those 2 hours, I get to be immersed in the Shadowbox experience. I get to be taken on a journey that always puts me in a better place than I was when I walked through the doors. People often say they find it difficult to describe Shadowbox because of the vast amount of uniqueness each show brings. But, you don’t even need words to describe it because performance speaks to the soul in a way no words truly can. Come experience it and I can assure you, you will never regret that you did.  ",
  "Great fun. But build skits around something other than sexual jokes. I laughed but the skits had a repetitive nature!",
  "We got a gift card for this theater and decided to go last weekend. We didn't quite know what to expect but were pleasantly surprised with our experience. It's dinner style setting so you can end up at a table with just about anyone. Our companions were fun and younger than us so it was a mix of age groups. My husband and I each had a steak sandwich which was excellent. Everyone from the cast or band participate in all aspects of the production from selling tickets to serving drinks. The skits were funny but not sophomoric and very much like Second City were although I haven't seen one of theirs in years. The musical talent on stage was fantastic. We were amazed with the talent of the musicians and vocalists. We are definitely planning to go to future productions.",
  "Reasonably priced, funny improv musical (TBD: the Musical). There was some language but we took our two late teen daughters and had a fun time. The place was clean and it was easy to park and find. The staff/cast members were friendly, funny, and talented. This is the only show we have seen, but we will definitely go back. "
 ]
},{
 "name": "Ohio Statehouse",
 "address": "1 Capitol Sq",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/bd/2b/29/statehouse.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "unique",
  "tour",
  "tour",
  "art",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d110217-Reviews-Ohio_Statehouse-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Ohio Statehouse is a bit understated compared to many other more opulent or grand state capitols. However, even in its relative simplicity, it is still a very handsome building with a lot to see. The visitors entrance is on the east side of the building, facing 3rd St. The layout is a bit confusing, so you'll want to get a visitors guide at the tour desk on the ground floor.\n\nAlso on the ground floor are a nice gift shop and an excellent little museum about Ohio history and the state legislative process. On display are the original copies of the state constitution. The visitor's guide will lead you through the upper floors into the Senate and House chambers, rotunda, and atrium. The grounds around the capitol are very well kept and are also worth a visit.",
  "I took a self-guided tour of the Ohio State House.  I found it easy to negotiate on my own.  It is a typical state capitol and certainly worth seeing.  The rotunda has a nice statue portraying the surrender of Vicksburg. The Ohio State Chamber features a unique carpet, a custom-made exact replica of the original carpet.  The grounds surrounding the capitol have several statues.  Notable is the  William McKinley Monument, on the west side, that honors the nation's 25th President, an Ohio native who was assassinated in 1901. ",
  "This historical State House is full of adventure. Several tunnels that lead to parking, other state office buildings, and to street level transportation so you adventure can be to other areas like the Short North from public transportation. Historically the State House is located in the heart of downtown town and at the corner of Broad and High Streets. This is the nautical heart of the city and with the overly adequate ground transport provided, the entire city is at your doorstep, and buses run every 10 minutes to all destinations of this beautiful city.",
  "We didn't have time for the guided tour so we browsed through the museum and the public areas. The Gift Shoppe clerk was very friendly and helpful on giving suggestions on what to do in our limited time. Next time we are in the area, I will definitely do the guided tour. Fantastic picture/photo opportunities.",
  "Be certain to take a tour.  The guides are so good.  The place is absolutely beautiful.  I moved away from Columbus in 1986 and the change since I last visited is amazing.  This is a humbling experience for sure.  We have visited many state capitals- yes even Pierre SD and it is really fun to see as many as you can.",
  "The restored 1861 Ohio Statehouse is truly one of Ohio’s treasures. The massive restoration completed in 1996 while expensive, has ensured this landmark will be enjoyed by many generations to come. Kudos to the Capitol Square Review and Advisory Board for their amazing commitment to maintaining Ohio’s Crown Jewel. ",
  "The Statehouse seems dome-less, but there is one, You can see it from inside the building.\nIt is beautiful inside with art and architectural flourishes. They do have monuments to Lincoln as all the northern Midwest capitols do.\nMicky was out tour guide who did a great job showing us around. We always take the guided tour if it is offered, because we think it adds a lot to the experience.\nAnd, of course, we got our State Capitols passport stamped at the Museum Shop.",
  "Learned quite a bit about Ohio on our recent visit.  We didn't have the opportunity to see the legislature in session but the  museum on the lower floor was interesting."
 ]
},{
 "name": "Topiary Garden",
 "address": "480 E Town St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/33/e5/d9/fb-img-1469349264818.jpg",
 "tags": [
  "walk",
  "unique",
  "art",
  "nature",
  "free",
  "walk",
  "art",
  "walking",
  "library",
  "wander",
  "walk",
  "unique",
  "free",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d278902-Reviews-Topiary_Garden-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Being familiar with George Seurat's famous painting, \"A Sunday Afternoon on the Island of La Grande Jatte\", which was also the inspiration for a Stephen Sondheim musical, it was amazing to see a topiary garden designed after the same painting. The small park in near downtown Columbus, a tiny oasis of peace and tranquility. \n\nWalk around the small park and marvel at the sculpted bushes. Lovely.",
  "Columbus doesn't have that many attractions like NYC or Orlando. Columbus Zoo is great but it will take more than one whole day to cover and is very tiring since it is one of the largest and top rated Zoos in the country. Topiary Garden is one of the places to visit if you want a quick and unique place to visit where anyone can identify the city from the background photos. Fully worthwhile a trip to this beautiful park that has figures and animals sculptured with trees. It is amazing how they maintain this park.",
  "Georges Seurat was a pointillist artist of the early 1890's when he created his masterpiece \"A Sunday Afternoon on the Island of La Grande Jatte.\"  Stephen Sondheim created his own Broadway musical masterpiece in the 1980's when he re-created the scene of the painting at the climax of his work.  And now, in Topiary Park at the edge of downtown Columbus, the hedges have been manicured so that it looks exactly like the scene out of the painting (or musical).  If you have ever seen the  painting or the musical, then you will really enjoy the landscaping at the Topiary Garden.  A true work of art!  Bring your camera.  ",
  "This is not a park with a playground or other park-like attractions. It is simple with its square design and simple paths. Not a ton of flowers, but the topiary sculptures are great if you like nature or of course, Monet. There are no flushing restrooms here unless the museum is open, which isn't often.",
  "We were here on a misty morning, but we still enjoyed this small park in downtown Columbus.  The topiaries  are wonderful, and you can walk around them to see them from different angles.  The topiaries are a work in progress, and you can see the metal frameworks on which the yews are growing.  Yes, they are live plants, not plastic.  There are winding paths and many benches.   Don't miss the little museum/gift shop which has a video about the park.  There are also clean restrooms. The park  would be a perfect spot for a picnic.  Seurat's painting comes to life.  Also, it is free.",
  "We stopped here for our lunch stop.  It was a nice park and a great concept.  However it is very small.  The best part is it is next to the library which has an art exhibit, coffee shop and gift shop.  We did a lot more walking in the library then around the park.  It's a nice stop overall but don't plan to spend a lot of time.  There is a very small museum but the hours are very minimal and closed seasonal and Fridays. ",
  "A relatively unknown gem in downtown Columbus. Quiet little park where you can wander at your own pace or just sit and enjoy. Nicely manicured figures although some need to fill out a little more.  Worth a trip.",
  "go in the summertime-so pretty.  walk through on a summer day or have lunch.  was visiting columbus for a conference and found this gem",
  "When I travel it's astonishing how how homogenized our culture has become. Aside from minor details, I could have exactly the same breakfast virtually anywhere in the US. So it's amazing to me when I come upon the the gems that make our cowtown look uptown. This magnificent topiary park is unique to Columbus, and not to be missed. ",
  "We spent a pleasant 45 minutes in this most unusual public garden. Carefully placed bushes were artistically trimmed to replicate a topiary version of the famous impressionist painting Un Dimanche Après-midi à l'Île de la Grande Jatte (A Sunday Afternoon on the Island of La Grande Jatte) by George Seurat. The topiaries include human figures with their top hats and parasols, a monkey, three dogs, and a cat. There is even a real pond with topiary boats. You can see the painting as Seurat created it from a vantage point on a little hill, but its even more fun to walk among the topiary figures and to move around as if you are part of the painting itself. It is a pretty and peaceful to decompress or to take photos of the family. Admission is free.",
  "This park recreates in topiary the Georges Seurat painting \"A Sunday Afternoon on the Island of La Grande Jatte.\"  Columbus artists James and Elaine Mason obviously had a monomaniacal obsession to have created  and maintained this extensive work, which not only includes all the people and animals on land, but also two sailboats and a skiff or shell being rowed by 8 men on a small pond.  There is a slightly raised viewpoint from which you can see the same view shown in the painting.  Unfortunately there is no good copy of the painting at the viewpoint - there is a brass plaque but it has low contrast and doesn't really portray the scene.  I recommend you print a copy of the painting and take it with you to fully appreciate the topiary."
 ]
},{
 "name": "The Ohio Expo Center & State Fair",
 "address": "717 E 17th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/59/f4/f7/ohio-state-fair-2006.jpg",
 "tags": [
  "food",
  "food",
  "performance",
  "family",
  "food",
  "free",
  "eat",
  "food",
  "free",
  "eat",
  "food",
  "food",
  "walking",
  "kids",
  "food",
  "walk",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d278936-Reviews-The_Ohio_Expo_Center_State_Fair-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "We did not expect the fair to be as good as it is.  The grounds are clean, more than enough food vendors, inside arenas, barns, exhibits, air conditioned food court, picnic areas, and about three times the number of rides we expected.  Talley Entertainment has done a wonderful job of running the show in their first year, and we were impressed with the number and friendliness of the Talley staff running the rides.  It's easy to make an enjoyable day of it, and we will go again.",
  "Great State Fair! Normal selection of fair food that is always good. Love the animal barns, exhibitions, competitions. Ohio artisans displays are a pleasure. ODNR exhibit is a must see.",
  "Ohio Chinese Lantern Festival\nNovember 25, 2016 - January 2, 2017\n\nEvent Navigation\n« Buckeye Quarter Midget RacingUnited Ford Owners Presents Fall Super Swap Meet »\nOhio Chinese Lantern Festival\nNovember 25, 2016 – January 2, 2017\nA 5-week celebration of Chinese culture will come to the Ohio Expo Center. Get ready to experience Columbus in a whole new light with exquisite silk lanterns, traditional performances, and amazing food!\nPrice: Online: $15 – Adults; $12 – Military (Military ID Required); $12 – Children Under 18; $40 – Family 4 Pack (2 Adults/2 Youth).  At the Door: Mondays, $12 for Seniors (65 plus), Thursdays $12 for College Students (Student ID Required); Groups of 15 or more receive $13 admission for Adults and $8 for youth. Onsite Box Office Hours starting November 25th, 4:30 pm – 9:30 pm. Performances are included in festival admission.\nTime: 5 pm -10 pm nightly; performance times: Sunday-Thursday, 6:30 pm and 8 pm; Friday and Saturday, 6:30 pm, 8 pm and 9 pm\nLocation: Natural Resources Park\nWebsite: ohiolanternfestival.com/\n\nthis was the first time the lantern fest visited Columbus and they weren't sure if this would be a yearly or one time thing. Went in early Dec .. when the low was in the 30's.    Not too uncomfortably cold since we dressed in lots of layers. Thought the lanterns were gorgeous but the performances weren't great. .. still worth seeing.",
  "Never been to this fairgrounds and it was in March so kinda chilly weekend. If your not familiar with Equine Affair its a very large horse show. The facility is huge so wear comfortable shoes. It rained previously in the week so there were some major puddles but the mud was not bad. Tip: bring some type of seat cushion for sitting on the various bleachers, I asked if there were any padded seats and they pretty much laughed at us (I have back trouble). For this show there were a ton of carnival food vendors that I can't say I tried. I did eat at the cafeteria restaurant and was overcharged $11 by the elder cashier who did not have a grasp of the credit card machine or prices. Came back later to complain to the manager and she gave us the meal for free. The parking does not allow you to re-enter so once your in you will have to pay to re-enter. Bathrooms were clean and parking lots are patrolled so its safe. This event they had beer for sale. Tip#2 They had a free shuttle running but you had to flag him down in the parking lot to catch a ride. Its worth getting on the shuttle as it can be quite a trek from the parking are to the actual gate depending on where you park. Tip#3 the road is blocked on 17th to the East but you can enter this way if you traveling from downtown. Tip#4 They have a concealed weapons ban so leave your pistol in the car. Tip#5 last one, Fantasia is definitely worth it if your horse person buy your tickets way in advance if you wanna go they sell out (all 3 nights) many months in advance. We found somebody at the message board that scalped a couple for us.",
  "Never been to this fairgrounds and it was in March so kinda chilly weekend. If your not familiar with Equine Affair its a very large horse show. The facility is huge so wear comfortable shoes. It rained previously in the week so there were some major puddles but the mud was not bad. Tip: bring some type of seat cushion for sitting on the various bleachers, I asked if there were any padded seats and they pretty much laughed at us (I have back trouble). For this show there were a ton of carnival food vendors that I can't say I tried. I did eat at the cafeteria restaurant and was overcharged $11 by the elder cashier who did not have a grasp of the credit card machine or prices. Came back later to complain to the manager and she gave us the meal for free. The parking does not allow you to re-enter so once your in you will have to pay to re-enter. Bathrooms were clean and parking lots are patrolled so its safe. This event they had beer for sale. Tip#2 They had a free shuttle running but you had to flag him down in the parking lot to catch a ride. Its worth getting on the shuttle as it can be quite a trek from the parking are to the actual gate depending on where you park. Tip#3 the road is blocked on 17th to the East but you can enter this way if you traveling from downtown. Tip#4 They have a concealed weapons ban so leave your pistol in the car. Tip#5 last one, Fantasia is definitely worth it if your horse person buy your tickets way in advance if you wanna go they sell out (all 3 nights) many months in advance. We found somebody at the message board that scalped a couple for us.",
  "To all my CCW holders out there you can carry your weapon in the state fair even tho they do not tell you this i found out from a friend last year and all you have to do is go to the gate tell the Cop at the detector that you  have your CCW and you have your weapon on you and they will check it and let you in. Their are some rules that you can not go into any buildings including bathrooms but that is no big deal for me being the area the fair is in and watching someone get mugged in the parking lot one night a few years back i feel safe being there. Now to the fair its one of the best around i have been to lots of different fairs and this one fantastic. lots of rides for the kids and lots of food i can spend a day just eating and do each year. if you can take the helicopter ride its beautiful especially at night and fly over the shoe which is awesome! just be safe walking to your car at night and pay attention especially if your car is back by crew stadium.",
  "Hadn’t been here for a gymnastics meet in over ten years but enjoyed coming back for the Buckeye as my daughter’s now a coach. Parking is convenient even though they expect you to pay $5 again if you come and go during one day. Large enough with reasonably comfortable seating and space. Clean bathrooms.",
  "Had a great time. The food was good and the entertainment was excellent. I will continue my annual visits ",
  "Ohio is no place to be, roads are some of the worst in the country.  The people used to be nice midwesterners, not anymore.  Most of them are rude and very unfriendly and definitely not helpful at all unless you flash huge wads of cash. The weather is some of the worst I have ever had to endure. Everything costs $$$$. Don't go.",
  "I have been attending the fair since the 1970's and always enjoy everything about it except for the fact that you need to walk through billows of cigarette smoke. I would like to see the fair board identify certain areas for smokers. Failing to do so jeopardizes the health of all of us.",
  "It was our first time attending and we found the parking and entrance fees to be reasonable. The fair was huge and there was lots to see and do.\nI've never seen so much fried food before but it's good to be bad sometimes. :D\nThe only thing I did find expensive was beer. $7 a can I think I paid. Ouch.\n\nWe found the agricultural area to be educational and the kids enjoyed the games they played there. \nThe prices for the rides and games was also reasonable and we all enjoyed the market area.\n\nWe had a great day and the kids were exhausted when we left."
 ]
},{
 "name": "Short North Arts District",
 "address": "120 W Goodale St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/23/4b/78/short-north-arts-district.jpg",
 "tags": [
  "art",
  "walk",
  "art",
  "eat",
  "food",
  "drink",
  "unique",
  "art",
  "walking",
  "food",
  "free",
  "food",
  "walking",
  "walk",
  "eat",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d183839-Reviews-Short_North_Arts_District-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you haven’t been to downtown Columbus lately just north of downtown is an area called short North it’s full now of trendy restaurants bars and art galleries about 10 blocks worth. There’s a shuttle bus that goes up and down there’s two parking garages in our Cota bus that goes all over that will drop you off for a nice lunch or walk in Goodale Park  one street over\nIt is Columbus is secret and now it’s known to the world",
  "The Short North is a great place to visit or stay if you are coming to Columbus. It's a convenient location: just a few blocks North of downtown, the Statehouse, Huntington Park, The Pizzuti Collection, North Market and the Arena and only steps from the Convention Center. \n\nThe Short North is home to the best of Columbus' art galleries: Studios on High Gallery (voted best gallery in Columbus for several years now), Hammond-Harkins, and the Sherrie Gallerie to name my favorites.\n\nThere are new hotels nearby:  The Joseph (a Le Meridien hotel) and a new Hilton, both of which have art collections that are worth seeing. The Convention Center also boasts a strong collection of the best local artists.\n\nYou are close to the downtown venues of the Columbus Symphony, ProMusica Chamber Orchestra, Ballet Met, and Opera Columbus and only a 10 minute drive to the Ohio State University and all it has to offer.\n\nThere are lots of places to eat from casual to fine dining, clubs, bars, live entertainment--something for everyone.\n\nIf you are in or around Columbus, this is definitely the place to visit and stay.",
  "The district is full of small restaurants with great food and drinks. There are quite a few bars to grab a nice drink and the first Saturday of the month is gallery hop to check out the local galleries. A nice stroll up and down High street is also worthwhile for the sights and sounds. ",
  "Don't miss the gallery hop but be prepared to search for parking. It's limited. Also, the restaurants are always full during the hop but there are many of them so you won't be left starving! The pet store is very unique.",
  "The Short North Arts District is one of the most fascinating, eclectic areas of Columbus, Ohio, and well worth your time and attention.\n\nChock full of interesting shops and restaurants, food and art, ambience and architecture, the SNAD can be enjoyed through your own walk-through, by guiding walking tours, and more involved tours, as well.\n\nShort and sweet, don't miss this; it's worth your while!\n\n.",
  "So many entrepreneurial stores & restaurants to choose from.  The activity is mainly along High street in this area adjacent to downtown Columbus.  This one of the artsy areas of town.   Residents range from millennials to empty-nestors.  And there is a lot of foot traffic on any weekend especially the 1st Saturday of each month which is the Gallery Hop.  You can find high end dining at places like Hyde Park, to great pub food at Mac's.  Barley's offers an awesome selection of micro brews.  Parking is a challenge as this is a popular area.  There is a free bus service called CBUS that circles around the greater area. http://www.cota.com/cbus.aspx\nhttp://www.shortnorth.org",
  "Go for the first Saturday of the month \"Gallery Hop\" especially in nice weather.  Lots of action. The Pearl, The GuildHouse, Marcellas, Northstar, Lemongrass, Basi, Jenni's, Hyde Park to name just a few of the top notch restaurants to choose from.  The only negative of the area is PARKING is fierce, in short supply.  There are lots of valet stands ($$$) and the meters are driven by phone app....which is beyond me.",
  "nice walking area, nice souvenir shops, nice restaurants and cafes, you can walk to north market from there as well...",
  "This is a success story in the city of Columbus. Many years ago this area wasnot exaactly the cultural haven it is now. This section of town, minutes from downtown Columbus, has become a very popular site. During your visit you will find many converted structures.  Just about anything can be found there: old clothing, records, various restaurants, flower shops, toys and jewelry. For those of us from Columbus, it is exciting to see the progression of this area. ",
  "Having been far too many years since I've made it back to the area,  I was blown away by the countless improvements changes and choices surrounding the University and Columbus area.  Countless great places to eat & drink. Great area. We had our group of 9 Buckeyes converge for the football weekend and glad we stopped back in.  We'll be back sooner than later. ",
  "My favorite part of Columbus. Definitely upscale dining... Ruth Chris, Blue Point, Hyde Park. Yum! Excellent Hotels, with a lot more coming. Arts everywhere. Don’t forget North Market..."
 ]
},{
 "name": "Palace Theater",
 "address": "34 W Broad St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/2f/94/83/palace-theater.jpg",
 "tags": [
  "art",
  "performance",
  "history",
  "performance",
  "historic",
  "kids",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d110224-Reviews-Palace_Theater-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visited the theater for the performance of Cinderella and this is such a beautiful venue. The theater is elegant with beautiful art and chandeliers throughout. The way the seats are arranged there is not a bad seat in the house and acoustics are top notch. Sat in the balcony and we could clearly everything.\n",
  "This is an excellent place to view a theater production.  I am rather short but can see perfectly. Also, parking garage attached!",
  "Saw the Dave Koz Christmas special excellent venue great show! Users are super nice and seating is great! VIP section is supreme worth the money!",
  "You should arrive early just to look at the stainglass and carved wood- much like the theaters in Europe, it is beautiful! We sat in the Louge and had great views and good acoustics. There are so many exits that it was easy to leave.\nMany steps and not all isles have hand rails and I didn't see an elevator.\nThere were many different spots for refreshements so no long lines. On the left side, where it looks much more modern there is a display from the original manager's door where he had all of the celebrities sign from Red Skelleton to Julie Andrews- great history!",
  "Very well maintained local theater. Good for a variety of musical and theatrical events.\nStaff is very cordial and helpful. Venue is conveniently located.",
  "This is an ornate and well maintained theater.  Seats are comfortable.  Please note that there is no elevator, so the building is not ADA compliant.  If you can find street parking, the meter rates are reasonable.  Meters are enforcable Mon-Sat until 10pm.  There is additional parking in the LeVeque garage.  I suggest you pay for your parking before the performance instead of after, to save on exiting time.",
  "We went to Palace to see Darcie Lynn, kids loved her!  Theater was awesome!  Clean, convenient and very historic.",
  "The palace theater is an intimate venue with good acoustics. The lobby is a bit small and so if people are waiting for the bar it gets quite crowded. But it’s a pleasant enough place to catch a performance."
 ]
},{
 "name": "Greater Columbus Convention Center",
 "address": "400 N High St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/46/f0/d5/exterior-view-of-the.jpg",
 "tags": [
  "walking",
  "walking",
  "eat",
  "eat",
  "walking",
  "walk",
  "hike",
  "walking",
  "food",
  "drink",
  "food",
  "walk",
  "performance",
  "food",
  "walking",
  "art",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d1418778-Reviews-Greater_Columbus_Convention_Center-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "I attended a conference (headquartered in the Hyatt) and trade show in the Convention Center this month.  The location is great. Easily accessible from the airport by public transportation or other services.  There are many hotels and restaurants within walking distance.  Best of all is the beautiful convention center. ",
  "My husband and I go every year to the car show.  Great place to have it, very clean and staff is friendly.",
  "We were here for a cheer competition. Place is big and has plenty of bathrooms and outlets for everyone. It has some many restaurants near by all in walking distance along with hotels. ",
  "The Convention Center is absolutely huge...so wear comfortable shoes.  I also recommend bringing your own drinks, even though they have coffee and pepsi...Diet Coke addicts have a hard time finding something worthwhile.\n\nI didn't eat anything, but the salads \"looked fresh\".",
  "This one is obvious, the GCCC has some of the largest events in the world here.  The biggest is the Arnold Sports Expo.  People from all over the world attend this event, bringing in millions of $ in revenue for the city.  It also attracts Comic Con, Tattoo festival, among others.  You will walk and walk around this venue, so bring good walking shoes/sneakers!  Also it's in the Arena District and close to Short North, so there is plenty of places to eat and shop!  Highly recommend North Market to eat which is very close to the GCCC.  ",
  "This convention center is HUGE! My husband participated in an event there while myself and two young children watched.  Quite a hike from one end to the other so wear your walking shoes.  We enjoyed meals thru the day in the food court which had a lot of options.  Didn't have to look far for drink machies or restrooms.  Everywhere we went was very clean. ",
  "The place is a monster! Parking is around but it’s sort of clustered. The actual convention center has a parking garage as well. Traffic seemed to move well around building during Arnold event as well.  Inside had quite a few food places, WiFi, lots of lounges. I will add anyone and their brother can just walk in off the streets. There was some homeless dude asking people for money when we were there. So if you do have a permit to carry! Rock it! ",
  "We attended the COA Midwest Nationals Cheer competition here. Their website is great and offers the option to pre-purchase your parking ticket in four different garages. This is a huge advantage for this type of event. Some times your performance time isn’t til later in the day and parking can be a nightmare. Having the option to prepay and hold our parking spot took a lot of stress of of us for the weekend. The center itself is very nice. There is plenty of signage and employees around to help you locate places/things. Everything was clean and well stocked. The food/drink options were top notch. Attending these type of cheer events can be a little crazy and you never know what you are heading bro with each new venue but this is definitely one of the top spots for this year!",
  "This place is massive. Parking is a problem because so many events are booked at the same time. We were there for a dance competition and at the same time there was a tattoo convention. This was quite a difference in dress, manners and typed of people to be placed near each other. The dance competition had mainly little girls. The tattoo people looked very strange. Food in the conference center is limited and expensive. There are very few maps to tell people where the different areas are in the center. ",
  "I attended a conference (headquartered in the Hyatt) and trade show in the Convention Center this month.  The location is great. Easily accessible from the airport by public transportation or other services.  There are many hotels and restaurants within walking distance.  Best of all is the beautiful convention center. ",
  "I attended a 3-day convention here. It was probably not considered a large event as this venue can host a very large convention in its spaces. Signage was a bit thin to me on the first day, trying to orient myself and find the meeting rooms and marketplace, but I did manage. The staff who helped me were apparently part of this particular convention, not convention center staff, but I eventually found the right meeting room and figured out how to navigate back to the hotel. By the second day, I noticed the signage on the ceiling that pointed my way, so that tells you why I thought signage was missing. There were a couple of decent sandwich and coffee kiosks inside the convention center, but there were also plenty of eating spots just outside the event, on the street. Easy walk to all sorts of places for a quick lunch, including back to the hotel dining spot. There were interesting art installations here and there, especially at the north entrance, and I liked that I could walk via an enclosed overpass back to my hotel if weather was bad. If this same convention is held here next year, I will likely return."
 ]
},{
 "name": "Downtown Columbus",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/41/95/83/downtown-columbus.jpg",
 "tags": [
  "free",
  "history",
  "historic",
  "eat",
  "walk",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d278638-Reviews-Downtown_Columbus-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "So... I was at a week-long seminar in the area and had a few hours to kill with friends before our flights departed. We all decided to see what there was in downtown Columbus. Ohio state capitol? Sure, let's go see it...\n\nIt was a fantastic experience. No, it's not the Louvre or Palacio Nacional, but it's free and it's great fun inside. We were there on a day when the legislature wasn't in session, so we pretty much had run of the place. Private doors were locked, but all the halls were accessible. The internal architecture and designs are quite pleasing and there's a neat whisper point underneath the capitol dome.\n\nIt took about half an hour to run all over the insides, and then we came to the basement. There's a small, but highly enjoyable museum in the basement and what really drew us in - a gang of history teachers, mind you - was an interactive exhibit about balancing the state budget from different points of Ohio's history. I never knew before how much Ohio used to have to spend on firewood to keep its buildings open through the year.\n\nOutside of the capitol was the most important and moving part of the capitol area. There are gardens to beautify the grounds. In those gardens, by the rear entrance to the capitol, are monuments to Ohioan soldiers' last letters home. Some are jubilant: \"I'm coming home!\" Most, however, are letters sent home after a final, ultimate sacrifice. \n\nWe couldn't help but cry at many of these. It is an overwhelming experience, but well worth having. Instead of having a few hours to while away, we participated in a realization of what was most important to say for one's last words.",
  "Be sure while in the city to stroll along the river and stop at the capitol building to see the architecture etc. Winter months are COLD but other times of the year are great. Head over to the area called German Village and check out the chocolate shop and Schmidts for a meal",
  "Be sure while in the city to stroll along the river and stop at the capitol building to see the architecture etc. Winter months are COLD but other times of the year are great. Head over to the area called German Village and check out the chocolate shop and Schmidts for a meal",
  "Downtown area nice. The Ohio Statehouse is truly a gem that is a must see. Many beautiful historic buildings. ",
  "We enjoyed a play on Tuesday night at Ohio Theater.  Downtown has many places to go to eat and entertainment.  Only problem we found was that many place near the theater close down by 9:00 PM so no place close to which you can walk",
  "Very beautiful and lots of amazing thing to see except there is a lot of LGBTQ stuff going on in that area and everywhere else. Just a thought for yall Convervatives.",
  "I was staying at a hotel 20 minutes from downtown. Googling popular restaurants in the area, I found Lemongrass, a Japanese, Thai, Chinese, American, and Mediterranean cuisine nearby. While driving, I noticed it would be on the downtown strip. That's fine, I thought. I'll simply park parallel with the traffic. Hopefully its not required to pay the parking meters on a Thursday evening at 6:30p. \n\nOh, I found the restaurant. I saw it the first time driving by, then driving back, and a third time, driving behind the building. Absolutely nowhere to park. Meters filled everywhere or half empty parking lots designated with private signs. Just not possible. Simply not worth my time. When we drove down to Columbus in the past, we had to leave our car at the park and walk to the Arnold, but to find a restaurant? Needless to say, it was raining and it was easier to drive to German Village and find somewhere better.",
  "Bed linen not changes for a week, i staid for 2 weeks and had to ask for it 3 times. Staff in the pub downstairs very nice and friendly, food selection very limited tho. For EU guests there was no adapter, they said that there is only 1 for the whole hotel...so bring yours."
 ]
},{
 "name": "Schiller Park",
 "address": "1069 Jaeger St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/09/ec/37/schiller-park.jpg",
 "tags": [
  "free",
  "eat",
  "walk",
  "wander",
  "free",
  "free",
  "art",
  "walking",
  "walking",
  "free",
  "theatre",
  "parks",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d670265-Reviews-Schiller_Park-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "June through September in Schiller Park - live theater - so much fun.  Take a picnic and arrive early with your lawn chairs or blankets - you won't be disappointed.  Rarely have we not enjoyed the play - and if we didn't, we could leave because we didn't have a lot invested. They ask for doantions which we always make because we want the outdoor theater to continue.",
  "Just stroll along seeing the historical home shops and archetecture is worth the nice walk, good for adult and also children will like it . then go eat in German village. free parking in area",
  "Nice park to spend time in, it has a pond and is well landscaped.  In the summer there are free Shakespeare performances in the amphitheater, which are great to attend.  Many great restaurants around the park, just don't wander too far as the area around German village can be a little sketchy. ",
  "This is a smallish park close to downtown in the midst of German village. During the summer there's a free Shakespeare festival. ",
  "Schiller park is in the heart of German Village.  It has a pond where children can fish and release. The park has walking paths and a small ampatheater where different Shakespeare plays are performed along with several other activities.  Currently they have about 2 dozen  pieces of art gravity defying sculptures suspended from wires above walkways, pond, between trees and many other areas. These pieces of art are on loan from a Polish artist. Many are sporting sculptures. \nThe park also has a enclosed recreation center for community events, basketball, dancing, exercise. During the spring and summer they have many different types of flowers in bloom. \nThe park is about 3 blocks by 2 blocks in size.",
  "Very nice park with paved walking paths, fountains, cute aerial statues, ponds and a bridge. Lots of people out with their dogs; apparently you can have your dogs off-leash here. ",
  "This super cute park is well maintained. It has a nice fountain along with other things to look at and decent bathrooms. \n\nIt’s perfect for doing yoga, relaxing and picnicking. \n\nThere are beautiful homes on all 4 sides as well as parking on all 4 sides along with a parking lot. \n\nThis is the venture for Shakespeare in the park put on by Actors Theatre. It’s free and runs through the summer. \n\nThere are several restaurants within a half mile as well as a coffee place",
  "I love parks, I do. I adore our wild-ish metro parks and pocket parks. But for a very polished and genteel meeting with nature, one you can conduct in nice clothes, nowhere beats Schiller Park. Take your friends from the continent there when they visit, they'll feel right at home. "
 ]
},{
 "name": "Whetstone Park / Park of Roses",
 "address": "3923 N High St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/9e/bf/e7/photo5jpg.jpg",
 "tags": [
  "library",
  "walking",
  "library",
  "free",
  "free",
  "free",
  "free",
  "walking",
  "library",
  "historic",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d278642-Reviews-Whetstone_Park_Park_of_Roses-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful park which includes trails, a lovely rose garden, open fields, playgrounds, a community center with rec room and a very well-stocked and well-staffed library.",
  "Even after the roses are past their prime, the layout of the park is so wonderful for walking around and it's very quiet and peaceful no matter when you go.  When the roses are in bloom, though, it's just stunning and you can go day after day and not see everything. It's located near the library, a huge playground, tennis courts, the Olentangy River Trail and so many shops and restaurants on High Street, it's amazing that you can still you feel like you are in your own little world. They do a beautiful job of keeping it up - it's gorgeous.",
  "This is a regular stop in our local faves, just as it is for many others.  If you are local and haven't been....why not?  \n\nIf you are a visitor in need of something other than shopping and/or eating and drinking, it's a beautiful way to spend relaxing time.\n\nParking is ample unless there is an event, it's pet friendly, and it is absolutely free! There are no food/beverage vendors, so bring plenty of water or a picnic (perfect location).\n\n",
  "If not, you'll be bored here.  But if you like roses, you won't be disappointed.  Has 400 varieties of roses and around 12,000 total.  It is park of Whetstone Park so there are also tennis courts and a hiking/biking trail near by and softball fields.  But yes, the roses are the attraction.  It's free to get in and there's also a Herb Garden and it's a popular location for Summer weddings.  Bring your camera; it's unlikely you'll be the only one there with one.",
  "This is a regular stop in our local faves, just as it is for many others.  If you are local and haven't been....why not?  \n\nIf you are a visitor in need of something other than shopping and/or eating and drinking, it's a beautiful way to spend relaxing time.\n\nParking is ample unless there is an event, it's pet friendly, and it is absolutely free! There are no food/beverage vendors, so bring plenty of water or a picnic (perfect location).\n\n",
  "This is a regular stop in our local faves, just as it is for many others.  If you are local and haven't been....why not?  \n\nIf you are a visitor in need of something other than shopping and/or eating and drinking, it's a beautiful way to spend relaxing time.\n\nParking is ample unless there is an event, it's pet friendly, and it is absolutely free! There are no food/beverage vendors, so bring plenty of water or a picnic (perfect location).\n\n",
  "This is a fairly large park near High Street in Clintonville, just behind a branch of the public library. It has some limited sports facilities, lots of walking trails, picnicking and most important come summer a wide display of roses, starting with heritage roses well worth your visit if you like roses with fragrances. Then come the various hybrids, lots of wedding parties and rose lovers. Concerts are scheduled in the summer. A very pleasant place to stop and smell the roses, have a picnic and enjoy yourself.",
  "Historic rose garden beds are full of fragrance in June.  There are also loads of examples of every kind of rose you can imagine.  In addition there are other perrennial gardens with herbs and sustainable themes.",
  "This is beautiful in any season. We like roses, but the overall landscaping is gorgeous. It is a comfortable walk and the parking is easy. ",
  "I always stop by in June, when thr roses are at peak bloom!  Walk the trails, catch a soccer game or watch the ducks\nin the pond!  Love that it is in Clintonville too!",
  "We were just there this past weekend for a car show - had a great time & really enjoyed the beautiful surroundings!"
 ]
},{
 "name": "Ohio History Center",
 "address": "800 E 17th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/7e/d2/10/ohio-history-center.jpg",
 "tags": [
  "unique",
  "history",
  "library",
  "history",
  "free",
  "history",
  "walking",
  "library",
  "library",
  "nature",
  "tour",
  "history",
  "family",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d110221-Reviews-Ohio_History_Center-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a museum of Ohio History run by the Ohio Historical Society located near the Ohio Expo Center/Fairgrounds in Columbus. The building itself is unique, built out of concrete with a cantilevered upper section (the museum is actually in the basement, the visible part of the museum can't usually be visited and contains offices/archives). Inside are exhibits providing a comprehensive overview of the state's history. Some of my favorite exhibits are the Conway Mastodon, Hopewell culture effigy pipes, Civil War battle flags, Ohio built automobiles, and the thematic furniture exhibits. Don't forget about the two headed calf! This is one of the quirkiest exhibits and it has been on display since I was a child. I would recommend this museum for adults and families. The museum also hosts Ohio Village, which is open in the summer and interprets a Victorian era village in Ohio.",
  "My wife and I re-visited the Ohio History Center recently and were very impressed.\nThe new exhibits were informative and interesting, especially the Ohio Sports History section.\nThe artifacts and vestibules are spread over three floors and have several areas to sit and rest afterward.\nWe enjoyed the friendly staff and used the huge library to look up past records in Ohio counties.\nI highly recommend this experience to anyone who enjoys the historical development of the state from early natives through modern times.",
  "This is a great place for multi-generational discovery. There is something for everyone to explore, Grandparents can relive and tell stories about how things were done in there day! While parents can relive the 50's and 60's. Don't forget to take a picture with the giant Mastodon. There is also a cafe to enjoy refreshments with hanging Airplanes made by the Wright Brothers!!  ",
  "Spending five days in Columbus, Ohio on business I took a free morning and visited the Ohio History Center Museum hoping to find some information about a World War One Doughboy statue once located on the Ohio State campus.  So I was delighted to find that the statue actually stands in front of the museum building and exceeded my expectations.  Unfortunately, the statue was not mentioned in the extensive World War One exhibit inside.  Even more distressing was the fact that the excellent displays of original First World War equipment, rifles, and other weapons from seemingly all nations were not accompanied by captions identifying and explaining what was on display (most of the items still had only their inventory tag by way of identification).  However, the museum made up for this omission with an excellent exhibit of restored original Civil War battle flags originally carried by Ohio regiments of the Union Army.  Accompanying panels identified the regiments, included maps showing where they served, etc. and where possible identified the maker of the flag.  Other items of equipment and weapons associated with regiments and individuals named expanded the exhibit in great style.  The more permanent exhibits were interesting but here the prize goes to the original Lustron home erected inside the museum (minus its roof and room ceilings).  A post-World War II answer to the housing shortage, these were prefabricated buildings made from enameled steel panels.  Reportedly about 2,500 were manufactured before ceasing production in 1950.  Walking through the front door and touring the house, with furnishings and appliances, was great nostalgic fun - and ended with a visit to the 'backyard'.   The museum is housed in a 1970 Brutalist cement building which I think must make staging exhibits a challenge since there is no possibility of rearranging the internal space.  You will want to pick up the museum map and study the floorplan to make sure you don't miss anything of interest.  On the upper level is a small cafe (overflown by two airplanes on exhibit!).  The gift shop near the entrance offers a reasonably wide range of books, craft items, etc (one item I picked up was a copy of the original map of Ohio which I thought might be useful for my genealogical research).   Also located above the museum floors is a library research collection and a small lobby area that also hosts exhibits.  During my visit it hosted a small exhibit on World War One training sites in the Columbus vicinity, featuring great photos, letters, and memorabilia from Ohioans who had trained or worked in the camps.  While the museum charges varying admission for students, adults, and seniors - if it's important to you speak up.  They didn't ask if I qualified for the Senior rate and I decided I didn't begrudge them the extra dollar.",
  "I liked the building itself as well as the displays and it is small enough to get a good look at everything.  I've been here before to use the very large Ohio geneaology research library upstairs.  Very friendly and cooperative staff.  Just be aware they are not open on Monday and Tuesday.  I made that mistake with a four year old one time.",
  "The center is comprised of two areas: the main building that houses the exhibits and the village that was created to look like small town around the time of the civil war.  The museum itself has great exhibits that change periodically.  Unfortunately, the village is only open for special occassions such as halloween and christmas, but are well worth visiting when open.",
  "We were disappointed when we tried to find information on our Civil War flags.  They have a large room dedicated to flags, but very few actually on display.  There is a huge chest.  Does it hold more?  Maybe books or computers with pictures of other flags would be a good idea.  We even went upstairs to the research dept. and while friendly, they weren’t able to help in our search.  Other displays were interesting, but didn’t seem complete....only a bit here and there of a certain time period.  Some displays had the actual items from the time and others would be a facsimiles with no rhyme or reason.  The nature center was another example of this confusing arrangement.  I think our state could be better represented.",
  "This museum is a must visit if you are in ohio. There is so many fun events throughout the whole year and the exhibits are so neat. Of course the best one is Conway the mastedon skeleton!",
  "I'm temporarily posted to a project in Ohio and I thought I would check out the Ohio History Center for some insights into how Ohio came to be what it is today - but no such luck. What little staff there is, is engaged and enthusiastic, but they don't have direction. The building and its contents are tired and and arranged in the least attractive and least imaginative way possible so I came away with no benefit for my admission fee. Maybe one or two organizing principles would help, particularly if they were explainable as a way to tour the collection. \n\nI like museums, particularly ones that are off the main track, but the OHC is a complete fail.",
  "We've been here so many times. There is something interesting at all times of the year and when you've seen all the exhibits, there are programs to check out throughout the year. We've been to the Dickens Victorian Village, the opening of the village event, the Veterans' event (just this past weekend), and members-only events.We'e been members for the last two years and it is worth every penny for our family. We highly recommend the Ohio History Center if you have a family member that interested in history!",
  "Given how rich and interesting Ohio's history is, I expected a bit more from this museum.  The exhibits are generally good, but I didn't think the museum as a whole really conveyed what truly stands out about the state's past and its quite important role in American history."
 ]
},{
 "name": "Hollywood Casino Columbus",
 "address": "200 Georgesville Rd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/fb/42/ad/hollywood-casino-columbus.jpg",
 "tags": [
  "eat",
  "walk",
  "eat",
  "free",
  "food",
  "music",
  "drink",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d3573948-Reviews-Hollywood_Casino_Columbus-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visited the Hollywood Casino in Columbus Ohio. Very clean casino. Only stopped here for the day and it was on a Wednesday so the casino was not very crowded. Don't bother with valet parking in the garage  as you still have to walk a short way to the casino. Ample parking places outside. Mu husband and I did eat at the Epic Buffet and it was okay as far as buffets go. They honored veterans that day so we got half price off the lunch. Cashier in front did not tell us this , the waitress informed us so she got the refund for us. Most of the workers were very pleasant. Left here with $200 dollars ahead which is good . I will probably be going back to this casino in the future.",
  "We took a little spontaneous trip to the casino on a Monday afternoon to play a little slots and grab some lunch. Unfortunately, the only thing available to eat was from a little thing called the \"grill\". The buffet was closed and the steak house was not open yet. We knew the steak house was not open all the time but we were very surprised when the only thing to eat was a concession type set-up and an Asian noodle place. IT's not a big \"Vegas\" casino but it's the right size for Columbus. It could use some stations set up throughout with hand sanitizer. We still left our \"donation\" and had a little fun. Just check ahead of arrival if you are planning to eat at the buffet on a Monday. We'll be back.",
  "Pros:\n•  Big new casino / over 70 table games / more than 2,500 slots / 36 live poker tables\n•  Non-smoking!!!\n•  Huge Hi Def TV screens, great for watching OSU games at the O.H. bar.\n•  Excellent live entertainment\n•  Free soft drinks and coffee.\n\nCons:\n•  The biggest drawback to the Hollywood, Columbus is that it's an expensive place to gamble. Don't expect to find $5 tables here. The minimum most of the time is $15 (when they first opened it was $25). Off peak hours can go down to $10.\n•  Food is expensive and in some cases not the best quality.\nIf you would like more info about local casinos go to: www.BuckeyeStateGambler.com.",
  "I’m totally against gambling and one visit was all it took to confirm I was right\nThe only people there could not afford to be there\nI went to hear music and each table was filled with people that couldn’t even buy a drink \nI felt sorry for them\nNow the steak place was excellent \nI’d go back there for sure\nBut terrible location that hasn’t helped the area at all after all these years and it hasn’t help over all schools as promised ",
  "Katy and the team at Hollywood Casino Columbus were an absolute pleasure to work with for our recent event we held in the H Lounge. From the initial planning stages I had every confidence that Katy would be taking the best care of our group and she did not disappoint. The planning and organization of our event was a very smooth process and it all came together perfectly. The suggested menu was fantastic…particularly the Mac N Cheese bar, Fried Chicken and the scrumptious desserts…and the space, The H Lounge, was the perfect place for our team to hang out and socialize, enjoy a drink from our private bar and eventually dance the night away to the tunes played by our own private DJ. Bravo Hollywood Casino Columbus and Katy Wolfe for showing us such a great time!",
  "I was very impressed with the Hollywood Casino Columbus. The staff treated each customer like you were important to them.",
  "Slots just don't pay out at all. We play the $1.00 slots and have went anywhere from 40 to 90 spins without a winning pay. That's right, there was once we spun a $1.00 slot 95 times without a winning pay. This is the reason Hollywood Casino's revenue is so much higher than any Casino in Ohio. ",
  "Excellent casino which I recommend to all casino lovers.There are many slots and table games to choose from."
 ]
},{
 "name": "Polaris Fashion Place",
 "address": "1500 Polaris Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/8e/77/84/looking-up-at-second.jpg",
 "tags": [
  "eat",
  "field",
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d2233633-Reviews-Polaris_Fashion_Place-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "Polaris is more than just a mall, plenty of stores and places to eat in the surrounding area.The mall has two floors and lots of variably priced stores with several sports memorabilia stores.\nOutside the mall is a Field and Stream among others in a outside walking area.\nThe traffic can be a small aggravation,but when I shop in Columbus,this is my preferred stop..",
  "I enjoyed the variety of stores available in the Mall. From inexpensive to expensive.  I could look at things easly.\n",
  "Everything was clean, excellent food inside, and a lot of stores. It's a very high class mall. Highly recommended.",
  "This mall was amazing.  It is so nice and has so many wonderful stores.  My favorite is Lush; which isn’t very big, but the people the people that work there are very nice. ",
  "Very cool indoor I liked the mall and rtestaurants too. It as black friday and was packed but still could find very good bargains"
 ]
},{
 "name": "National Veterans Memorial and Museum",
 "address": "300 W Broad St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/0c/a2/36/img-20190622-134528263.jpg",
 "tags": [
  "free",
  "walk",
  "family",
  "history",
  "kids",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d15288176-Reviews-National_Veterans_Memorial_and_Museum-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "A very interesting and solemn place.  Dedicated to the veterans of the US. A must see if in Columbus for military personnel and their families. ",
  "Visited on President's Day 2020 with our teenage grandson! All of us loved our visit here. Each of us took away special tidbits from exploring all the exhibits inside. The displays are beautiful and done in such a respectful and tasteful way for our military's sacrifices to be remembered. \n\nThe only thing I'd change on our trip there is minor- we came in February. So they had us come in at the \"winter entrance\" instead of the main floor entrance, which is down on the bottom floor. Then we were told to go to the middle floor by the main floor entrance to pay for our admission. Paying the admission was done at a little area just inside the main floor. It would've made more sense to set up the admission station somewhere near the winter entrance for that period of time (maybe a temporary station of some sort). Having never been there before, it was a little search to find the right spot to pay the admission at first. Well-placed signs for it even would've been nicer than pointing in a general direction I think. \n\nWe appreciated that it had an elevator rather than having to climb the many steps- and made it all handicap accessible too. The building and grounds are just beautiful and very well-kept. The staff there obviously take great pride in showing respect in that manner as well. \n\nThe kids were offered a sheet for a scavenger hunt also. So they had pictures of things on display to try to watch for in the building as they toured, and mark them off for a little prize at the end of their time there. My grandson is 13, but still had a good time trying to watch for the items- not all were easy to find either! So that helped the whole group be engaged together to help him with a hint once in a while. Many of the displays are interactive and have where you can listen to voices reading the letters written or telling their stories- which brings the historical moment to life really. There were many videos of actual service persons telling their stories of the various experiences too. I wish I could've just had hours and hours to take in each and every display to its fullest and not miss 1 moment of any of them! For each person paid a great prize serving for me, and are well worth listening to the stories and learning about the times of our history! I have it on my list to hurry back! I'm sure I probably missed alot! \n\nThe top floor honored the fallen heroes that paid the ultimate sacrifices from all the wars too. There's an area on the 2nd floor where you can celebrate a veteran that is special to you also! There's a spot near there where you can leave a question for a veteran; and where veterans have answered questions previously left. Loved that. They haven't forgotten the POW-MIA military either....all our military are honored in this beautiful building! The bottom floor had a special exhibit honoring Bob Hope's contribution thru his USO service to the military also. \n\nThen over from the main admission area, there's an area of a gift shop offering some neat things to honor your veteran now; or just to purchase as a memory of your day at the Memorial. Their were books, shirts, cups, belts, magnets, playing cards, and many other items in the shop. \n\nParking lot's directly across the street from the museum & after you get the parking ticket validated inside - will be free to park. However, you have to first get past the men directing you to head into the parking lot across the street from the COSI building! Otherwise, you'll pay $5 to park at the COSI lot, have to walk further to the Vets Museum, and it will not be validated there! Thanks COSI lot worker! I was headed in the straight driving lane headed to the museum, but he forced me to turn left to go to the lot! \n\nVeteran's admission is free- with proof of Vet status. Then the other rates are on the website. The day we went there was a special I guess for a winter rate? But I am 64 and my grandson is 13 and we had 1 veteran/free, total admission was $13.50 for the day. \n\nA nice family trip would be to do the Veteran's Museum and COSI in about 2 days there....they are directly across the street from each other. Both would be good places for all ages to enjoy together as family trips together. We need more of that now a days - especially if it means getting the devices out of everyone's faces! The museum is excellent to open conversation paths with family of maybe past stories of your family veterans, as well as all of us learning things that are either new or maybe even forgotten- and then giving all the ages of our family the chance to discuss things displayed there! My grandson is still talking about things days later. \n\nGold stars to each and every one that have had anything to do with making the new National Veteran's Memorial and Museum become a place to come for our families. It's a welcome reminder of the price of our freedoms! Thank you all!",
  "My husband is a big military person so we decided to go visit the museum. I also thought it was a little steep in price but we did get a couple of dollars off because we are AAA members. It was laid out nice and they had a lot of room to add more exhibits, pictures, artifacts, etc. Yes, there was a lot of reading but how else are you going to find out the information if you don't read~I guess you could just look at the pictures. We both enjoyed the Bob Hope exhibit and short film a lot and remembered watching him on TV doing a lot of his tours. There was also a very nice volunteer that showed us how to permanently place my dad's name and state and what branch of the service he served in. We had walked right by the exhibit but didn't know what to do with it. It was nice to spend a couple of hours on a dreary winter day reading and learning about some history!",
  "A great place to acquaint young people with history, or to help a vet reminisce and feel honored by his countrymen.",
  "What a wonderful experience, very tastefully and respectfully done  — definitely worth a visit....  \nVeteran’s receive discounted tickets and parking ....."
 ]
},{
 "name": "LEGOLAND Discovery Center Columbus",
 "address": "157 Easton Town Ctr",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/b7/58/c4/kingdom-quest.jpg",
 "tags": [
  "kids",
  "theatre",
  "kids",
  "theatre",
  "kids",
  "kids",
  "free",
  "eat",
  "kids",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d15115461-Reviews-LEGOLAND_Discovery_Center_Columbus-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "My kids aged 4 & 6 love exploring here. Lots of different parts to break up the fun. Staff are really friendly and it was quiet and clean (in the week)\n\nFigure trading is fun & the movies are frequently changed so we see a different one every time!",
  "Great experience! Very friendly staff—especially Sam! Lots of activities for all ages.  Opportunities to build new creations and get inspired. ",
  "We came for mother's day and the funnest part of our time was the class with the master builder.  It was not crowded so we didn't have to wait long for the rides or play.",
  "We decided to do this as we were passing through town with our almost 3 year old son. Overall we spent about 2.5-3 hours here and he absolutely loved everything in it.  It was hard to get him to leave...but he loves rides, play areas and building.\n\nI would give this place 5 stars except there  was a strong lack of parental supervision and there was staff complacency regarding unsupervised children. I watched kids deliberately destroy and kick over structures that other kids were still building, grab Legos out of other kids hands, and not take turns or cut in line in the racetrack area.\n\nThe place is somewhat small with 2 structured rides. There is a laser shooting ride upstairs and the pedal bike up and down ride is downstairs with all of the other attractions.\n\nThere is a 4D theatre with 15 min movies running every 30 min, a rather nice play area for older kids and a small slide and a building area with large blocks for younger children.  There is also a quite impressive Lego City with some interactive things like a boat race and a jackhammer.",
  "We decided to do this as we were passing through town with our almost 3 year old son. Overall we spent about 2.5-3 hours here and he absolutely loved everything in it.  It was hard to get him to leave...but he loves rides, play areas and building.\n\nI would give this place 5 stars except there  was a strong lack of parental supervision and there was staff complacency regarding unsupervised children. I watched kids deliberately destroy and kick over structures that other kids were still building, grab Legos out of other kids hands, and not take turns or cut in line in the racetrack area.\n\nThe place is somewhat small with 2 structured rides. There is a laser shooting ride upstairs and the pedal bike up and down ride is downstairs with all of the other attractions.\n\nThere is a 4D theatre with 15 min movies running every 30 min, a rather nice play area for older kids and a small slide and a building area with large blocks for younger children.  There is also a quite impressive Lego City with some interactive things like a boat race and a jackhammer.",
  "My kids loved playing with all the Lego’s and seeing how they are made but at this location every hand sanitizer was empty!\n\nI get it if our reservation was later in the day but our reservation was for Sunday at 10 am the first batch for the day.\n\nAll the sanitizer boxes on the walls were empty!\n\nWith the flu still floating around you would think that LEGO would be on top of their game for making sure those pumps are full.",
  "First off, huge lego supporter and enjoy Lego, This place is a super fail. We have went twice. The first time we did the buy one ticket get one free. After waiting forever we finally got inside. Starts off real strange but had hopes of maybe this will be kinda cool..... First ride we waited 45 mins for a min ride..... No one at any point told us we could skip this line and come back. We finally get to the lego room and I will admit it is cool to see Ohio landmarks this is where this place ends and it just becomes a playground with legos on the floor. This visit this place was packed, I'm not sure how another person could of been added. We never did get to ride the second ride. The movie loop needs to be every 15-20 mins not 30 so you can see all the movies. Anyways. We left saying we would never go back and that was a waste of $50 and an hour drive one way. Come christmas we purchase a set and they give us 4 free tickets...... ok we'll give it another chance when maybe not so busy, so we go on a weekday. Knowing what we know we skip the first part and there isn't a person in line for first ride....... Hmm guess we did pick a good time. The ride is not good so we didn't even go back on it...... so now the rest of the place to ourselves. Decided to do a \"master build\" couldn't purchase the build because the cafe was already closed.... but did anyways. Now what??? movies and the ride we didn't ride last time..... Ok we are done...... Yep  if there are more employees there then people if you don't wait for all the movies you can be out in 30 mins. Unless you get free tickets SAVE YOUR MONEY!!!",
  "I gave it a 3 mainly due to price. We drove for 2 1/2 hours to get there, and luckily it was first responders month so we got in for $10 each. I would have been really upset to pay $24 per person for the size of the place. That aside, if we lived close and went a lot, the annual pass may be worth it. Also, since we aren’t from the area we had to ask someone where to find it. FYI, it’s inside of the mall.  The boys are both 10 and they did pretty well, but I wouldn’t recommend it for any older.  Eat before you go, because the snack shop is expensive. The displays in mini land are awesome. There’s several things for them to do including a 4D theater that plays 4 different short films, a climbing play place, a ride where you shoot characters with a laser gun, a ride that goes in circles (they liked this one),  and several interactive LEGO stations. ",
  "My daughter, my 14 yr old grandson and I went there 2/2/20, it cost us $75.60,  he was really looking forward to it, it was promoted really different, the first ride was broken then you go to a room that has a display that is neat put you can only look at it, then you go to a open area that has snacks and a girls area that looked fun for under 10, then there was a ride small and short ride, then finally a boys section but it only had where you could built cars, axles tires but hardly any legos, it was so disappointing for $75.00, if they would have told us we’re we bought our tickets that was for small kids we wouldn’t have went in, 20 minutes from start to finish",
  "My granddaughter wanted to celebrate her 7th birthday at LEGOLAND. It was amazing. The interactive discovery and the hands on interaction for the kids was truly remarkable. We took a party of 8 for the afternoon. We arrived at 1:00 pm,  and at 5:00 pm, they were just starting to lose steam. You can purchase adventure tickets ( a neck laynard with coupons) when you purchase your tickets, it give the children a chance to discover each station and receive a special embosed stamp for that particular card. It's rather inventive. It's amazing watching all of these children on this treasure hunt for these stations. All in all, it was a blast! Everybody had a great time.",
  "We have 3 boys, ages 9,5, and 1. I really didn't expect our 1 year old to have much to do but he actually had a blast in the duplo area. Tickets are kind of expensive for how small the place actually is inside but we got a deal - buy 1 adult, get 1 kid free - which made it worth the $."
 ]
},{
 "name": "Hayden Falls Park",
 "address": "4326 Hayden Run Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/21/5f/b1/beautiful-falls-after.jpg",
 "tags": [
  "walk",
  "free",
  "nature",
  "walking",
  "walk",
  "walk",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g50226-d8840936-Reviews-Hayden_Falls_Park-Columbus_Ohio.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love Hayden Falls, I've been coming here for years. It's maybe a 2 minute walk down some stairs and a boardwalk, and you're at the falls. There are a lot of stairs though, and they can be really slippery when wet.\n\nThere are 2 little decks where you can stand and look over top of the falls.\n\nThere's limited parking, probably only around 10 cars can fit in the parking lot. And you can't park on the street (busy road), and not really any grass parking either.",
  "Hayden Falls is beautiful but out of the way location makes it not so special.  If it were closer to other nature trails of other nature related spots it would be wonderful.  Free but limited parking is available and a very short walk takes you to the falls. Once you've looked at the beauty of nature, nothing else will keep you there although the Scioto river is adjacent to the falls but private property surrounds the area limiting your stay.  Across the Hayden Rd bridge there is a very nice walking trail and picnic area but not convenient to the falls.  ",
  "there are only a few water falls in the Columbus Area.  This one is the  best.  There isnt a lot of parking but if you go mid week the is plenty. There is a lot of stars to walk so I wouldnt recomment for handicap persons. ",
  "Such an easy to get to waterfall. Small parking area and steps and boardwalk to get to it. A pretty bit of nature without having to travel clear out in the backwoods! Boardwalk can be a bit icy in winter. Plan to check it out in different seasons.",
  "Wonderful little water fall just outside Dublin. Accessible by stairs (>50) and can be slippery in winter or wet weather. ",
  "Further walk than thought and more steps. Pretty walk. Dont make a special trip. It is probably better in the spring or after a rain.",
  "This is a really nice waterfall. There are stairs down to the boardwalk.\n\nSome things to know...you are not permitted o leave the boardwalk, parking can be a bit hairy, and there are memorial mementos for someone whom committed suicide on the wall on the way down.",
  "It was beautiful and a fun spot to visit when its warm outside. However, the waterfall was a disappointing because it was dried up. (See first picture) 🤨"
 ]
}]
