[
{
 "name": "Riverbanks Zoo and Botanical Garden",
 "address": "500 Wildlife Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ab/74/5c/riverbanks-zoo-and-botanical.jpg",
 "tags": [
  "kids",
  "kids",
  "walk",
  "food",
  "kids",
  "walk",
  "eat",
  "walk",
  "learn",
  "food",
  "historic",
  "kids",
  "walking",
  "kids",
  "performance",
  "family",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d126621-Reviews-Riverbanks_Zoo_and_Botanical_Garden-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We are able to come here on day trips and the kids enjoy it alot!  They have alot to offer in the way of animals and also things to do.  They have the carousel, pony rides, train ride, zip lines, ropes course, large splash pad, large tree house for kids, and more.  Our kids are 11, 9, and 7.  Their new animal exhibits are great too!!",
  "The Riverbanks Zoo is a great place to take a day trip, it's big enough that you will get tired before you've seen everything.  They have a new Sea Lion Exhibit that is really cool with an underwater and above the water viewing area. \n\nIf you have kiddos be sure to get an \"Explorer Pass\" so you can do lots of fun bonus things that would otherwise be an extra charge: \n- Feed the Giraffes\n- Feed the Birds\n- Climb the Rock Wall\n- Ride the Merry Go Round\n- Ride the Pony\n- Ride the Kids Train\n- Discount on the Ropes Course (Super Fun for older Elem/Middle School Kids)\n\nIf you walk across the bridge you can take the trolley to the Gardens and the Kids Splash Pad area, which is a fun place to spend a morning if you have little ones - although if you're just going to the Splash Pad and now the Zoo you can park at the West Columbia entrance to save some time.  \n\nIf you're a local, it's probably worth it to buy a yearly pass and just whenever you want",
  "This zoo has so much to offer it is too much to list... you have the botanical garden, the Waterpark for the kids, the Highwire walk, sea lion exhibit, penguin exhibit, giraffe feeding, we are members and intend to stay that way. If you are a local, you really should get a membership,,, If you are a visitor, it is probably the best or one of the best attractions Columbia SC has to offer!!! Food can be a bit pricey, but otherwise it is a great park!!!",
  "Get there before 11 am on Sunday if the weather is great.  Very high volume of people by 1 pm.  One of the best zoos in the nation.",
  "I have been going to the zoo for a long time, but have been remiss in writing a review. As  I've said, I've been coming here for a long time, and have been a member for many years. It's a great place to come and walk, see animals, get some exercise, and learn a thing or two about animals.\n\nSome of the exhibits themselves are a bit dated, and I'd really like to see them update the enclosures, especially the large mammal ones (lion, tiger, elephant).  However, other ones are much better, and there's quite a bit of diversity in the somewhat limited amount of space the zoo uses.\n\nWhat really sets the zoo apart is the botanical garden \"across the street.\" Near the carousel is the bridge to the botanical garden and Waterfall Junction. You can walk the .3 miles up to the garden or ride the tram to the top. The botanical garden itself isn't huge, but there are quite a few species of plants. Go in the late spring or summer to see the most blooms. If you have kids, make sure to hit Waterfall Junction for a variety of places to play. And keep an eye out for the trail that goes from the rose garden down to the factory ruins. Or the trail from the tram to the ruins. Either way, find your way to the historic ruins and the river.\n\nThe only complaint I have, aside from the dated enclosures, is the concern I have about so many other tourist attractions, and that is microtransactions. You pay to get in the zoo so you can also pay to ride the carousel, do the ropes course, do the zipline, etc. Food is a bit expensive, too, so plan ahead, and eat before/after you go.",
  "We took a large group of families here and it's small-ish size was perfect for keeping up with everyone.  The exhibits were well done, except for a few that were a little too small for such a large amount of penguins in such a small enclosure.  There is plenty to do such as feeding the giraffes, to doing a mini cable-line adventure course or ziplining across the park.  The botanical gardens are beautiful and well done and are included in your ticket price.  Make sure you leave time for them, kids might not like them as much.  Also get there early as parking goes quickly and is not suffecient for its size.  The Embassy Suites is walking distance and has a lot of parking.",
  "My family and I love the Riverbanks Zoo! We got season passes for Christmas and are so happy we did. We were able to go to Lights at the Zoo with them. I definitely recommend going to this event every year because it is so beautiful! You'll be sad if you miss it. The sea lions at the front entrance are a great addition to the zoo. We love the performance they put on! We can't wait for the rhino exhibit to open up this summer!",
  "If your still a kid at heart and enjoy animals this is the place to be. Lions were all out and about, even got to hear the male roar. The  farm area was pleasant. Enjoyed our time there as a family, hope to return soon.",
  "I visit this zoo yearly and each year is just as well or better than the year before. Thank you I will continue to visit.",
  "Loved this zoo! We always try to visit zoos when we go on vacation. This zoo was nice and the garden was also cool if you’re into that. I would highly recommend going to the gorilla feeding. It was at 1:30 pm and we took our time at the zoo just so we could make the gorilla feeding. It was very cool! ",
  "my boyfriend and i had a really good time. the gorillas were probably our favorite exhibit and they were right up in front of us! we definitely recommend going to the little shows they have roughly every half hour, it’s pretty cool to see how intelligent these animals really are. we spent about 3.5 hours here, for those wondering."
 ]
},{
 "name": "Columbia Canal and Riverfront Park",
 "address": "312 Laurel St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/e2/5c/32/photo1jpg.jpg",
 "tags": [
  "free",
  "walk",
  "walking",
  "family",
  "walk",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d2623386-Reviews-Columbia_Canal_and_Riverfront_Park-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful and safe place to walk, jog, bicycle, relax in hammocks, park benches, Adirondack chairs by the riverfront and Columbia canal.  Dogs welcome.  Large free parking lot.  Bicycles are also available to rent. Gets busy after work (5 pm) but still relaxing.  ",
  "Very pretty walking path along the river. Plenty of people were out on this warmish winter day: families, dog-walkers, couples, joggers plus a couple taking engagement photos. We were enjoying the path so much that before we knew it, we had walked for 2 hours. The trail felt safe and clean and people were friendly. Definitely recommend if you like the outdoors.",
  "Well maintained with overlooks and seating along the way.  Also places to enjoy down by the river near the restrooms, make for a good picnic area (maybe plan that next time)",
  "This park was so pretty! I wish we had wore our family photo clothes. The trees were so nice with the fall colors. The River was a nice backdrop for a fall walk. ",
  "Beautiful scenery and nice walk. Good for kids, families couples, and exercise. We were there at sunset and enjoyed the walk. Thete was quite a few people there with many attending a beerfest."
 ]
},{
 "name": "South Carolina State Museum",
 "address": "301 Gervais St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/5c/c4/b3/south-carolina-state.jpg",
 "tags": [
  "eat",
  "walk",
  "field",
  "walking",
  "kids",
  "family",
  "kids",
  "learn",
  "kids",
  "history",
  "history",
  "walk",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d143424-Reviews-South_Carolina_State_Museum-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "I accompanied my daughters 4th grade class to the museum for a half day trip and they had a wonderful time!  They visited all four floors, they were able to eat lunch as a group in the snack area just inside the entrance and there was ample parking. Be ready to walk but there elevators for each floor and the building is ADA friendly. Enjoy!! ",
  "Be sure to allow plenty of time wearing comfortable walking shoes to experience all that this museum has to offer. Be sure to include the 4-D interactive theater and observatory. Many activities for kids of all ages and is well planned out. There are four floors filled with stuff and we started on the top floor and worked our way down. The day we went there were a few school groups on a field trip. For a complete listing of their events, check out their website scmuseum.org ",
  "Shared the entire day with 2000 of my closest friends from all over. Family and kids (9 and 12) had a great time exploring the Museum, the Civil War Relics and the educational Kids Museum.  The day was well spent. The viewing area was fantastic. The area was comfortable and the staff (paid and volunteer) were enthusiastic and cooperative.",
  "If you visit the state museum on a Saturday, get there early before the kids start arriving around noon.  Also as a note when we attended, there was a lot of construction so you need to park in the back and enter the museum from the back. The King Tut exhibit was open, but we did not go into that section. Instead we walked the three floors of the exhibit enjoying the large shark handing from the ceiling, the mastodon, the over grown armadillo, the textile industry exhibit, the old cars and the train set.  There was also a hands on section which is where most of the kids gather.  This is a great place to learn about science. Over all this is an excellent place to spend a half day learning about South Carolina, you will find it educational.",
  "We spent three hours in the South Carolina State Museum and the connected Confederate Relic Room and Military Museum.  This museum is very well done and provides an excellent overview of the history of South Carolina.  Many of the exhibits are interactive, which adds to the learning experience.  Of particular interest was a special exhibit was the role of religion during the Civil War.  Visiting this museum complex is a must for people interested in the history of South Carolina.",
  "Unlike many state museums this one charges a fee to enter.  There are four stories but the exhibits do not start until the second floor.  The 2nd and 3rd floors are more like a children's museum with interactive exhibits and basic nature/technology exhibits.  The 4th floor displays South Carolina history.  There is an elevator for all floors unless you are going from the top to the 1st floor where you have to get off and walk down the stairs on the second level. The interactive exhibits are fun even for adults and they weave some state history into them.  ",
  "Spend a lovely 2 to 3 hours at the South Carolina State Museum's Sherlock Holmes Experience. A terrific hands on, interactive exhibit of Sherlock Holmes murder mystery.  Use your notebook, check off the clues and solve the mystery, if you can. There is also a fun scavenger type hunt in a full size display of Holmes' study. Can you spot the items in your notebook?  This exhibit is scheduled to be at the Museum until April 19, although we were told that it might be extended. It is worth a trip to Columbia, especially if you are a mystery fan.  And the rest of the Museum is also worth the trip, if you can't make the Holmes exhibit. There is also a planetarium and 4D movies. There is an excellent exhibit of the history of South Carolina also.",
  "Neat exhibition with a brief 4D animation followed by the walk through hands on exhibition which took us about 1.5. Learned a lot about Conan Doyle & got to play detective as well. I would think best suited for 4th grade and up children although smaller children would still probably enjoy the animation and all the hands stations. On until middle of April with a possible option to extend.",
  "Had an enjoyable afternoon with friends taking in the Sherlock Holmes exhibit.  Had fun solving the mystery and finding everything in Sherlock's Baker Street room.  We enjoy visiting the exhibits and the telescope.",
  "Enjoyed exhibits and movies.  Staff was helpful when tickets were purchased to give detail locations and timing for shows so we could make three movies during our visit.",
  "I made a brief visit to the museum many years ago but this trip was planned and time was allotted. Lots of parking is available. There are four floors to the museum. Elevators are available but I went with the stairs. There is a basic admission charge. Discounts are available to seniors. Additional charges apply for planetarium and movies. I loved the areas that included hands on items. I was impressed by the replica of the submarine, the Hunley, and how it showed how the men operated it underwater. I spent over three hours in the museum and walked about two miles. No complaints. Finally, the store is a great place to visit and buy gifts."
 ]
},{
 "name": "South Carolina State House",
 "address": "1100 Gervais St 1100 Gervais St, 29201-6215, Columbia, South Carolina",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/6f/98/e0/south-caroline-state.jpg",
 "tags": [
  "tour",
  "history",
  "free",
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "walking",
  "academic",
  "learn",
  "family",
  "tour",
  "history",
  "tour",
  "history",
  "walk",
  "tour",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d256937-Reviews-South_Carolina_State_House-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "A beautiful peace of history well worth the visit, free to go inside just need to pass through security to go inside take as many photos as you like, and there’s even a guided tour if you want to take advantage of that. \n\nThere is parking around but it’s paid parking. ",
  "Bryan did a superb job of explaining the history of South Carolina as he introduced a fairly large tour group to the features of the SC Statehouse and the role it has played in the history of this beautiful state!",
  "While in Columbia for the Eclipse 2017 event we made sure to visit every significant site we could during our short four day stay.  Unfortunately, we missed the last tour of the day. But in the short time we had we were able to cover enough of the State House's gorgeous interior and manicured grounds and exterior monuments to get a good appreciation for the sweep of Columbia's role in the history of our country.  From pre-Revolutionary (George Washington's visit, Francis \"The Swamp Fox\" Marion), pre and post Civil War (John C. Calhoun), monuments and plaques to the Regiments who served during war in Cuba, and (many!) other countries I had no idea we ever sent soldiers to fight in!  The exquisite details in the interior architecture make this beautiful building well worth a visit.",
  "The tours are of no charge. Have taken this once with family and another time with a visitor. It's one of the prettiest State Houses there is, inside and out. You will watch a brief video and then tour the building. There's so much to see, so when walking into another room on the tour, notice as much as you can, including any plaques or artwork. There are usually one dozen or more on the tours. Stay ahead of the group if you want to be certain to hear clearly. There are many many stairs, but an elevator is available. \nBe sure to visit the gift shop. It is a wonderful place to find local goods and items of local interest. It's a gem tucked away, so if you can't find it be certain to ask. It's worth a purchase! \nThe grounds are incredibly planned and worth seasonal visits as the landscape changes and a Christmas Tree Lighting takes place, I believe in November. Could be December; just check a local calendar of events. The grounds are inviting for photographs and for meeting new people. Last time I was there I met an Academic Professor from China who was here to learn about the culture. You never know who might be interested in a local's point of view. We learned a bit from each other. \nParking can be a bit troublesome in Columbia, but have patience and enjoy your visit!",
  "Right down the road from USC, a nice lunchtime walk-around. The building is impressive, and the grounds very nice. Don't go out of your way, but if in the area, check it out.",
  "The Capitol building was very crowded and busy during my visit.  I was lucky to get a small group tour even with all of the school groups there.  Parking is available across the street at 1232 Assembly St for $2 an hour.  Do not park beside large SUVs because they will ding your car with their door. If you plan on getting souvenirs go to the Capitol's gift shop because the State Museum does not carry most of the items there.   It is a shame that they took down the flag and flagpole for the Confederate monument especially since it was the compromise that removed the flag from the Capitol building.  Hopefully it can be reinstated at the monument after this environment of hate and erasure of history has passed.",
  "First, let me say that the gentleman who led our tour was fantastic! He had a great knowledge of the state and the building-and other states.\nThe building's interior is really beautiful from floors to ceilings. I also highly recommend that you walk around the outside. On the north side is a wonderful African-American History Monument with reliefs showing their history in America, an obelisk, a rendition of the Middle Passage, rocks from some of the places that they came from in Africa, etc.",
  "The guided tour given by a woman in a wheelchair was excellent. She had an answer to any question we had.  I think it was about 45 minutes.  Beautiful building. Tours are free.",
  "The State House is worth several hours of one's time. Pick up a guide book. Quite a good bit of history in this building. Definitely a must see in Columbia.",
  "This was the very first state house I visited in the US and in all truth, it is glorious to see the beautiful architecture and when you take in the peace and quiet it's very calming, Considering it is on the main road. All in all, I thought it was a very calming relaxing experience. When I am passing through again I shall stop and visit.",
  "Columbia was the last State House in th4e USA that I visited,  I was especially impressed with the grounds surrounding the building.  They were very well maintained and provided ample spots for pictures.  The building itself is not as grand as some other State Houses, but it is also well maintained and well appointed for its size."
 ]
},{
 "name": "Soda City",
 "address": "1500 block of Main Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/7e/e2/e9/photo0jpg.jpg",
 "tags": [
  "free",
  "family",
  "food",
  "tour",
  "food",
  "walking",
  "food",
  "walking",
  "food",
  "eat",
  "food",
  "walk",
  "unique",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d7142417-Reviews-Soda_City-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a family friendly venue with loads of free parking. Ignore the signs and meters... yes, it really is free parking. Lots of food trucks.... from tacos, to donuts, ice cream, coffee, bakeries, produce, breads, advocating toast (my fav!) adult popsicles, waffles w fresh fruit and whipped cream.... name it, it’s there. Artists display their wares, craftsmen sell their goods, street musicians play their jams.... it’s a nice family friendly event. If you’re pushing a stroller, plan to go early so you have room to maneuver. It can get pretty crowded as the day goes on. \n\nIf I can come up with anything to complain about, it’s the crazy number of dogs. They’re everywhere. And I’m a dog lover.  It’s overwhelming during the later morning. I’m sure they have responsible owners who wouldn’t bring biting dogs.... but there’s always a chance in a very crowded environment with food and loads of other dogs around.  Besides, with all of the food around, it should be an animal free zone.",
  "I cannot believe how lucky we were that we were in Columbia on a Saturday to be able to experience Soda City!  Truly a gem in Columbia.  \n\nIt was not impossible to find parking once we located the garage.  We ate, shopped, watched and listened to performers, and pet dogs for blocks until we made it down to the State House.  I wish we had time to go on the tour that was available.\n\nIt was an absolutely delightful morning and I would absolutely go out of my way to be on Columbia again on a Saturday morning to go to Soda City!",
  "Soda City Farmers Market on Main Street in Columbia SC is the place to be on Saturday morning. This is a great market with a large selection of international food vendors, craft and farmers with locally grown fruits and vegetables. It is always fun to watch the people with their dogs and listen to the different musics.",
  "We visited Saturday Feb 27 so it was a bit chilly, and unfortunately we got there a little late - it seems that around 10-11 AM are good times to shop. Lots of arts, crafts, street musicians, etc. it was a nice morning. The only issue seems to be parking and you need to feed the meter on Saturday so bring some quarters",
  "Even if you aren't in the mood to buy anything, walking the two blocks of this market will provide you with lots of great people watching! There are a variety of vendors selling everything from food to clothes to honey to olive oils. It's a great diverse market area that is well worth getting up for on a Saturday morning. Great place to tale visitors from out of town. ",
  "Even if you aren't in the mood to buy anything, walking the two blocks of this market will provide you with lots of great people watching! There are a variety of vendors selling everything from food to clothes to honey to olive oils. It's a great diverse market area that is well worth getting up for on a Saturday morning. Great place to tale visitors from out of town. ",
  "Soda City Market is my favorite way to spend a Saturday morning! Local vendors, farmers, food trucks and artists gather and set up small “pop up” shops to sell their products. You can get a whole box of produce for about $10. All different types of food and cute goods to buy. Even if you don’t eat or shop the bustling Main Street area is lovely to walk through. Dog friendly, kid friendly! Don’t miss it! ",
  "This is a must if you're visiting the area or have recently moved here. Bring your pup!! There are tons of dogs every weekend. The vendors offer awesome, handmade, unique items. The popcorn stand is something you absolutely have to stop and try. Plus, come with an appetite. The food is incredible!! ",
  "Soda City Market on  Saturday mornings in Downtown Columbia is a refreshing change to typical.  Varied vendors galore.  My favorite is Kyle's Pottery. Original designs and beautiful workmanship. ",
  "I had the chance to check out the Soda City Market while in town. There was a lot of people selling locally made products and locally grown produce. There was quite a lot of variety of stuff you can purchase and look at. I highly recommend checking out the Soda City Market if you’re in town. It’s a great glimpse into the culture of Columbia and the state of South Carolina as a whole.",
  "Two blocks of Main St. closed off and packed with food trucks, coffee tents, craft huts and street musicians; what's not to love? If you happen to be downtown on Saturday morning, it's worth the stroll; something new every week."
 ]
},{
 "name": "Saluda Shoals Park",
 "address": "5605 Bush River Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/b2/7f/d6/playground.jpg",
 "tags": [
  "walk",
  "kids",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d2547240-Reviews-Saluda_Shoals_Park-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great Lights for Christmas. We go with 12 people. Great for groups. Love the hot chocolate and marshmallows.",
  "We love to go to Saluda Shoals and walk the trails. Our dogs enjoy going as well. We bought the annual pass so we can go as often as we wish. ",
  "If you have small children or children with special needs/physical disabilities this park is for you. Everything is brand new and well thought out. Places for young ones to crawl, climb, run, swing and just be kids. Highly recommend! ",
  "Lovely park with a new play area to include all children with disabilities.  Splash pad, walking and biking trails.  Picnic areas.  Birthday parties are held here for children.  Beautiful drive through Christmas display..  Something for everyone.  Many individual events throughout the year.  ",
  "We were getting bored in the hotel and Saluda Shoals Park was a welcome respite for just $15.  it was $5 for a car to enter the park and then two of us rented bikes and rode them all over the park.  Most of the pathways were shaded and there were other folks walking, riding bikes but the paths are real wide and it was not a problem.  There are numerous benches overlooking the streams running through the park."
 ]
},{
 "name": "Columbia Museum of Art",
 "address": "Corner of Main and Hampton Sts",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/71/22/45/fountain-night.jpg",
 "tags": [
  "art",
  "walking",
  "art",
  "art",
  "organized",
  "art",
  "free",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d534096-Reviews-Columbia_Museum_of_Art-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a well curated, reasonably priced museum that delivers on artistic value.  We went to see the recent major traveling exhibition \"Impressionism from Monet to Matisse.\"  It alone was worth the trip from western North Carolina, but the permanent collections were in many respects just as impressive.  The strength of the permanent exhibitions are the quality and variety of works presented - well selected traditional art work, an amazingly good silver collection, primarily Asian ceramics, a collection of Picasso prints, a relatively small but exquisite number of furniture pieces, and a few more modern pieces.  There is also a very nice ChihuIy chandelier.  I would recommend a minimum of two hours for a visit that allows you to comfortably see everything.  There is a parking garage close by and on-street parking - however, during the week, the best best will be the parking garage.  The museum does not have a restaurant and there does not appear to be a restaurant within easy walking distance.  Overall, you will be hard pressed to find as comprehensive and high quality a collection of art in this area of the state.  if you are going to be in Columbia for any length of time and like art, be sure to make time to see what this museum has to offer.",
  "The art museum in Columbia, SC, houses a good general collection of mostly European and American paintings with some Classical and Far Eastern antiquities thrown in for good measure, along with some furniture and sculpture.  There are two special exhibit galleries on the first floor as well.  The highlight for me was the glass sculpture that hangs in the atrium.  The museum is in a fun area with small cafes, etc. and some cool street art. Not particularly easy to find for an out-of-tower, but worth the effort.  Nice gift shop as well",
  "This is a great place to stop on a rainy day, or if you just love art.  The museum is just large enough to get a pretty thorough review of the entire museum on a day.\n\nDuring our recent visit there was a very good special exhibit on Impressionism \"Monet to Matisse\".  The collection may be a small step below the major museums, but it is well worth visiting.  The museums descriptions are thorough, there are plenty of really fine paintings and works from a wide range of periods, and the special exhibit was especially interesting.  \n\nWe were very pleasantly surprised.",
  "I was thrilled with the great exhibit on the 1930's horror films by Hammer and other. It also included manikins dressed in original costume outfits worn by Bella Lugosi and Boris Karloff. A great collection !",
  "Went in on a whim and was very impressed.  Best $5 I spent.  Had a horror collection and guitars owned by Kirk Hammett (lead guitarist of Metallica.)  Had a few pieces from BC, was cool getting to see something that old.",
  "I was in town to see It’s Alive by Kirk Hammett (of Metallica fame). I liked how they organized the exhibit by putting the old movie theater posters in one section of the museum and the artwork and guitars in another section of the museum. I also saw the permanent art exhibits which occupies the second floor of the museum. There was a variety of artwork from different countries and time periods. You can definitely spend two hours here if you take your time looking at the exhibits. I definitely recommend visiting the Columbia Museum of Art while you’re in town. ",
  "We visited in early January to see their Van Gogh exhibit.  For a museum of this size (i.e., in Columbia, S.C. versus being in NYC or London), I thought they did a very good job with the exhibit.  OTOH, we visited on the final weekend (Saturday) of the exhibit and the crowds were amazing.  Thankfully we had booked tickets online, which saved us probably an hour in line; however, we still had to wait for about 40 minutes in line just to enter the exhibit space.\n\nTo be completely fair, I'm not really criticizing the exhibit or the museum.  If I had it to do over again, I'd have tried to go in the middle of the exhibit's run (maybe even on a Monday/Friday, since we had to travel) in hopes of avoiding crowds.  And I'm not sure what more the museum could have done re: crowding, other than institute some sort of timed-entry scheme (which is probably overkill for the problem).  They appeared to be limiting entry more in terms of safety / fire-marshal capacity.\n\nOnce inside the exhibit space, it was difficult to check out individual works without joining the slow conga line of patrons.  We ended up staying in the exhibit for under 90 minutes, but (given the crowding) got the most out of it that we could. We enjoyed it.\n\nWe also then checked out the rest of the museum (i.e., the 2nd floor).  I was impressed at the wide range of works they had in their permanent collection.  There were paintings and sculptures from disparate countries and periods (Chinese, European, early American, etc.). If I lived in the area, I'd be glad that they had a museum of this apparent quality to visit.\n\nSo overall, this was a bit of a learning experience for us in terms of planning for visiting a temporary exhibit of this level of popularity in another city.  \n\nParking for the museum (for us) wound up being in a pay-lot across the street.  Street parking on the weekend in downtown Columbia is apparently free, but there is some (Saturday /weekly?) farmers' market / craft sale that is adjacent to the museum on a blocked-off street, so that saturated the street parking in the area before we arrived.",
  "Coming here was the main reason for my Columbia trip! I was super pumped for this exhibit because Van Gogh is my favorite artist. This museum did not disappoint.\n\nThe staff was friendly & made me feel welcome. The exhibit was awesome! Sure, there weren't as many Van Gogh pieces as I anticipated, but I was grateful to view the ones that I did. What a fabulous opportunity to have.\n\nI spent the better part of the next couple of hours exploring other exhibits and art, finding myself not at all disappointed by the array of pieces and feeling so close to history. Even without the Van Gogh pieces I would recommend that anyone spend time here. It is well worth the expense (which isn't that much!) & time spent.\n\nThe gift shop was lovely & while some things were pricey, there's something for everyone. I got a cute journal (Almond Blossoms) & sunflower Van Gogh soap, along with a magnetic bookmark, buttons, & postcards! <3"
 ]
},{
 "name": "University of South Carolina",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/32/ce/2b/university-of-south-carolina.jpg",
 "tags": [
  "historic",
  "library",
  "historic",
  "library",
  "approachable",
  "academic",
  "active",
  "organized",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d126619-Reviews-University_of_South_Carolina-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "My middle of 3 sons attends USC and loves it.  Great facilities, dining, housing.  He loves the warm weather.  Nice for SEC sports.  Best international business program in the country.  One of the best Honors colleges in the country.  In the Honors program, he gets the small school attention/advising in the middle of a BIG school",
  "What a beautiful campus. Great friendly students and faculty. Definitely on the list for a future application for our son. It is in the heart of downtown Columbia and is very nice.",
  "This is a exceptionally beautiful campus with so many historic buildings and many new modern building...the wonderful Horseshoe area in the center of the campus is so cool.\nTake the time to spend a few hours enjoying this great campus.",
  "My middle of 3 sons attends USC and loves it.  Great facilities, dining, housing.  He loves the warm weather.  Nice for SEC sports.  Best international business program in the country.  One of the best Honors colleges in the country.  In the Honors program, he gets the small school attention/advising in the middle of a BIG school",
  "After visiting parts of the the campus several times over the years, my husband and I walked the entire campus in one day. The Horseshoe is quite beautiful with several buildings that are architecturally significant along its perimeter. The trees and ornamental plants are beautiful and provide a nice amount of shade during the day. The reflecting pond outside of the library is also a tranquil spot to visit. ",
  "This is not big, but calm and beautiful campus. \nMany trees and historic buildings were good. \nSpecially I recommend to look around the library, there are a lot of marvel animations and campus alumni political correction.",
  "Our daughter chose this school among all great schools she got in. It is totally the other side of the country for us. We came for a visit. We can tell she is happy and receiving what she needs- school events, families, academic resources. Great approachable professors. \n\nThen the built amazing student recreation center with beautiful indoor and outdoor pools, climbing wall, indoor running tracks, state-of-the-art exercise machines, racket ball rooms, studios... They do encourage the students to be active.",
  "We visited this college for our daughter and it was clean, everyone was very nice \"southern Hospitality at it's best.  IT was clean, very organized, had great dorm rooms, nice food options, great facilities with a climbing wall, workout area, indoor and outdoor pool and many other options. Would recommend checking it out. , "
 ]
},{
 "name": "South Carolina Confederate Relic Room and Military Museum",
 "address": "301 Gervais St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/28/36/7c/photo0jpg.jpg",
 "tags": [
  "knowledgeable",
  "learn",
  "history",
  "free",
  "history",
  "history",
  "unique",
  "free",
  "free",
  "walking",
  "history",
  "field",
  "pets",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d2622948-Reviews-South_Carolina_Confederate_Relic_Room_and_Military_Museum-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nice collection of South Carolina military artifacts, Very knowledgeable employees. Excellent programs.",
  "The South Carolina Confederate Relic Room and Military Museum is very informative for some one who is unfamiliar with contributions made from the Revolution War to the Confederate war to current day.  An impressive variety of relics and memorabilia.  As a northerner, it was interesting to hear and learn about the other sides perspective on what has been labelled as a war of \"northern aggression\".....seems like the war is still smoldering in many respects.  The museum represents the pride, contributions, and heroism of South Carlonians from the Revolution to the present day military conflicts. I wold recommend a visit to this museum.",
  "Such amazing artifacts; especially the battle flags that have been through hell and back and now live on in a great museum for Civil War and American history buffs. See some great South Carolina military history for a small fee that is 100% worth it. ",
  "This museum is located inside the South Carolina State Museum and is a seperate entrance fee to get in.  It is not very expensive because it won't take long to go through the museum; Two hours tops.  One section covers Sherman's March through South Carolina and the personal reflections of the people during that time are very enlightening.  It does have a nice collection of military artifacts from the Revolutionary War through the Iraq conflicts.  It is worth a couple of hours to see it especially if you are a war buff.",
  "This is a small museum located on the ground floor inside of Science Museum. The civil war exhibits of flags and soldier's personal gear was very informative and interesting. The staff was very informative, and the atmosphere was very much like that of a chapel to honor the past. The relic room is also home to artifacts used by South Carolinians in the wars before, and after, the War of Yankee Aggression. Don't miss the large model of the WW2 cruiser USS Columbia. Well worth the low admission fee to see these important parts of our past.",
  "I remember many years ago visiting this museum and it being an old fashioned collection of artifacts and labels unimaginatively displayed in shrine-like fashion.  Wow has this place changed! \n\nNow located at the back of the South Carolina State Museum, the museum houses two outstanding exhibits.  One deals with Sherman's burning of Columbia in the context of his entire Carolinas Campaign of 1865 and the other, larger exhibit, outlines military history as it pertains to the Palmetto State.\n\nBoth exhibits feature professional displays and a staggering array of flags and other original artifacts.  The museum is NOT a hagiography of all things Confederate but rather an objective and non-biased historical examination of its subjects.\n\nThere is a good little gift shop and a space for educational programs and presentations.  If you enjoy Civil War history or any kind of military history, don't miss this gem.  Free parking is available right on site in downtown Columbia.",
  "A great display of sword play demo was put on by Dr Jane Littman's Columbia Fencer's club at the relic room to a large crowd of enthusiastic spectators. Insode there was a lecture on how cavalry soldiers managed sabers from the saddle. It;s a great annual event not to be missed.",
  "Had a few interesting pieces and facts. Would love to see them add more exhibits from the other wars. ",
  "It's not all about the Civil War but it is more about the history of South Carolina and the military. Location is in the back of the State Museum of South Carolina and is an additional charge. South Carolina has a wonderful, historical past that can be better appreciated after a visit to this museum.",
  "This museum was much more extensive and developed than we expected. There are a tremendous amount of rare and unique artifacts framed by well-written interpretive in well designed exhibits. It’s worth the few extra dollars (and another hour) to add this onto the State Museum admission. A very pleasant surprise. Free for veterans.",
  "If my review is useful, please give me a “helpful” vote.\n\n1. Bottom Line Up Front. As a retired Marine Corps Infantry Officer and history enthusiast, I have had the privilege of visiting quite a few museums of this type across the United States so my expectations are typically very high.  This is an enjoyable museum with very high quality artifacts.  It is admirable that this museum keeps the name “Confederate” in their name, embraces their history and proudly display Confederate flags.\n\n2.  Details of my visit.  \n\n2.a.  Date/time.  I visited the museum on a Saturday morning in early September 2019. \n\n2.b.  Other patrons.  During my visit, there were 4 other groups of 1-5 people in the museum.  These were composed of adults and teenagers.\n\n2.c.  Length of visit.  I was at the museum for approximately 2 1/2 hours.  I did not read all of the informative placards/displays; to do so would have required approximately 4 hours.  I spent approximately 45 minutes speaking with the Education Curator.\n\n3. Directions/location/accuracy \n\n3.a.  The museum is located at 301 Gervais St  Columbia, SC.\n\n3.a.  I plugged the address in my iPhone and it took me directly there.\n\n3.c.  The museum is located in the same building as the South Carolina State Museum but they are not affiliated.\n\t\t\t     \n4. Access\n\n4.c. Passenger vehicles. The parking lot can be accessed by any type of passenger vehicle.\n\n4.d. RV and semi tractor-trailer access. I was not in an RV or pulling a trailer on the day of my visit but I realize that many people visiting attractions such as this one are on vacation and may be in over-size vehicles.  I would consider the parking lot to be accessible to oversize vehicles unless it is packed to capacity; I recommend looking at the facility on Bing or Google Maps to confirm accessibility.  \n\n5. Parking \n\n5.a. The parking lot is paved.\n\n5.b. There is no charge for parking.\n\n5.c. There are quite a few parking spaces (I would estimate over 200).\n\n6. Admission (obtained from the sign at the museum’s entrance). \n\n6.a.  Adults (18-61).  $ 6.00.\n\n6.b.  Youth (10-17).  $ 5.00.\n\n6.c.  Children (9 and under).  Free\n\n6.d.  Seniors and Military.  $ 5.00. \n\n6.e.  1st Sunday of the month.  $ 1.00. \n \n7. Hours of Operation (obtained from the sign at the museum’s entrance). \n\n7.a.  Tue – Sat.  10:00 AM – 5:00 PM.\n\n7.b.  First Sun of the Month.  1:00 PM – 5:00 PM.\n\n8. Prohibitions/permissions. \n\n8.a.  Weapons.  I did not see any signs prohibiting the carrying of concealed weapons but I would recommend calling first to confirm.\n\n8.b.  Photography.  Non-flash photography is permitted.\n\n8.c.  Food & beverages.  Not permitted and not available. \n\n8.d.  Pets and service animals. There was no sign indicating otherwise but I would imagine pets are prohibited ad service animals are permitted.\n\n9. Type/nature of museum visit.\n\n9.a.  Non-guided.  Visitors may conduct non-guided tours of all the  museum grounds/exhibits.\n\n9.b.  Guided.  I do not know if guided tours are available.\n\n10.  Exhibits.  Consisted primarily of South Carolina’s involvement in:\n\n10.a.  Revolutionary War.  Uniforms, pistols, muskets, swords/sabers.\n\n10.b.  Inter-war period.  South Carolina state militia uniforms, pistols, muskets, sabers/swords and uniforms.\n\n10.c.  Civil War.  Uniforms, pistols, muskets, rifles, sabers/swords, field equipment and quite a few Confederate battle flags.\n\n10.d.  World War I (limited).\n\n10.e.  World War II (limited). \n\n11. Handicap access. I am not handicapped but understand that this can affect someone's decision whether or not to visit a site/attraction. Visitors who are wheelchair-bound or have difficulty walking can access the museum with little/no difficulty.  \n\n11.a.  There is handicapped parking located directly in front of the entrance.  \n\n11.b.  The museum is located on the first floor of the building and there is are shallow ramps inside the museum to access the different levels. \n\n12. Child friendliness.  Children may find it a bit boring; there are no inter-active, hands-on displays.\n\n12.a.  I do not have children and on the day of my visit, there were approximately 2 small children (with their parents).\n\n12.b.  I would remind parents and teachers (of school groups) that \n this is a museum and not a playground; loud & un-restrained actions detract from the enjoyment of others.\n\n13. Amenities/creature comforts.  \n\n13.a.  Restrooms.  There are restrooms located in the rear of the exhibit hall.\n\n13.b.  Water fountains.  There is a water fountain located near the restrooms.\n\n13.c.  Food & beverages.  Food and beverages are not permitted in the museum.  There is a cafe on the second floor of the adjoining South Carolina State Museum.\n\n14. Gift shop.  They have a small gift shop with items oriented towards children and adults.\n\n15.  If you are in the mood for an extended trip, I can personally recommend the following:\n\n16.a.  Patriots Point Naval & Maritime museum; Mount Pleasant, South Carolina (near Charleston - 2 ½ hours to the southeast). \nThere are three US Navy vessels here:  USS Yorktown - aircraft carrier; USS Laffey – destroyer; USS Clamagore – submarine.  They have several pristine World War II aircraft in the hangar deck indoors and approximately 12 1950s-1980s aircraft on the flight deck outdoors.\n\n16.b.  Charleston Museum; Charleston, SC ( 2 ½ hours to the southeast).  This was the first museum in the U.S. (founded in 1773).  They have exhibits pertaining to Charleston, South Carolina, the U.S. and history in general."
 ]
},{
 "name": "Fort Jackson",
 "address": "Strom Thurmond Blvd.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/18/5e/5e/fort-jackson.jpg",
 "tags": [
  "field",
  "family",
  "food",
  "field",
  "family",
  "food",
  "family",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d11932518-Reviews-Fort_Jackson-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Arrived the day before Family Day.  Everyone on post was friendly & helpful.  We located Hilton Field which was only minutes from our stay. There is plenty to look at & do on your own. Large playground by the Solomon Center that can entertain children forever. Plenty of food options.  The lunch buffet at theNCO club is great! And casual dinner spot at McGruders Pub.  Definitely worth the time and $ to stay on post. Never had to leave the area. Will return again if there is a purpose.  Courage Worthy! ",
  "Our second grandson to graduate from basic at Fort Jackson. Both followed in their father's footsteps who was a career Army Officer. Family day and graduation ceremonies are very impressive. Watching 1000 new soldiers march across the field gives you goosebumps and makes you proud of our military. Go Army.",
  "Loved Fort Jackson. Graduation was perfect! Organization was amazing and the Blue Line helps out so much. Jacks Inn was very comfortable and perfectly located. Police Officer Brown was the most courteous, compassionate and professional!! Thank you all for the incredible experience! Sincerely, Proud Parents",
  "Came here for a basic training graduation. Wow. They have their act together. Quick efficient entry. Good food options on base. Bowling alleys, shopping, parks, hotels, museums. Had plenty to keep you busy during family day. Hats off.",
  "The home of the Drill Sergeants Academy for the United States Army. If you want to see if you have what it takes to become part of a prestigious group swing by the academy.  The Command Sergeant Major would be more than willing and happy to talk to you and show you around! Make sure to give him a call and tell him how much you miss your child. "
 ]
},{
 "name": "Williams-Brice Stadium",
 "address": "1127 George Rogers Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/2f/67/5d/williams-brice-stadium.jpg",
 "tags": [
  "music",
  "field",
  "field",
  "tour",
  "field",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d3174732-Reviews-Williams_Brice_Stadium-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "I am a graduate of University of South Carolina.  Williams Brice is a safe secure place to host a football game or music event.  It holds 80k people.  On a Saturday in the fall, you will hear the roar of the fans of the Gamecocks cheering on their team.   Most people who attend games tail gate and its a blast.  There is ample parking but bring cash to park as almost all spaces require fees.  One word of caution, the stadium does not allow any bags that are not see through.  These heavy duty clear plastic bags are available for purchase at the store under the stadium.  Come on down to Cola town to support the Gamecocks. ",
  "Home of South Carolina football. Great atmosphere. Study the stadium map before your first trip so finding your seat will be easier. Arrive 30 minutes early to see and hear 2001, the best entrance in College football.",
  "Be sure to get to your seats to watch the team come on the field! There are no bad seats. Plan on making a day of it as traffic can be heavy.",
  "Williams-Brice is an underrated but excellent place to catch a college football game amongst the rabid USC fans.  Relatively easy to get to with plenty of parking.  Great football environment and friendly fans.",
  "Arrived about 40 minutes prior to kick-off. Bag check line moved quickly-clear bags only. Be aware that pom-poms are not allowed. Easy to find our seat section. Usher showed us to our seats. Brought clear water bottles that we could fill with ice cold water from a large cooler positioned on the concourse near our seats. Seating is very tight. Stood for the majority of 3 quarters of football.",
  "We enjoyed our outing today to the USC/Alabama game. It was a very hot day!!! Visiting side was directly in sun!!! Seats were way too close together and narrow in the upper deck. Bathrooms were so cute with Gamecock carvings on the stall doors. Lots of people!!!",
  "What side of the field does the visiting Cheerleader cheer? Trying to buy tickets want to watch my Granddaughter cheer.",
  "This is a fabulous venue - I have been to both football games and live concert - BEYONCE & JAYZ -On the Run Tour --- EASY WALK INTO THE VENUE - great visuals no matter where you sit - I have sat on the field and high in the stands - also once event is over to flow out of the stadium is VERY EASY! \nTraffic surrounding this venu when a big event happens is HORRENDOUS.  You get out of the venue quickly and anothe 2-3 hours to leave the area unless you decide to walk to Rosewood Ave to get to your ride-share or car.  That's a major turn off"
 ]
},{
 "name": "EdVenture Children's Museum",
 "address": "211 Gervais St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/11/73/16/edventure.jpg",
 "tags": [
  "kids",
  "free",
  "family",
  "eat",
  "kids",
  "affordable",
  "family",
  "kids",
  "kids",
  "food",
  "kids",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d1967038-Reviews-EdVenture_Children_s_Museum-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We live an hour from Columbia but had a membership to the Edventure Museum for many years when my daughter was little.  Now that she is 10, she is outgrowing it.  I recommend it mainly for children 8 and under, though some older ones may enjoy it too.  My daughter's favorite exhibits are the play veterinary hospital, the real fire truck, and the big Eddie statue that kids can climb around in.  We enjoy the butterfly garden every summer too.  It is well worth a visit.",
  "We recently visited Edventure in Columbia. This is a great children's museum in the capital. It is in a complex with the State museum and a few other attractions. The museum has tons of events and hosts birthday parties as well. There's a restaurant to eat in, so you can literally spend all day here. There are various indoor and outdoor exhibits including a butterfly garden; career area with a grocery store, fire truck, play restaurant, and a farm where kids can try out their skills; putt putt (additional fee); a building and engineering zone; a pizza kitchen with a giant pizza; a shadow box to make shadows on the wall; a Lego and block area; wind machines; veterinarian's office with stuffed animals; and a playhouse for under 3s that has a ship, slide, tree house, and a little area for babies. One great thing I loved were the nursing areas for moms in the Big Backyard toddler section. There are rooms where special interactive activities take place like cooking lessons. There were extra charges for these. There's also a water play area outdoors. This museum has a lot to offer. They were doing renovations when we visited, so we were given a free ride on the carousel, which we didn't use. That was a nice way to accommodate for the missed exhibits, one of which was an auto shop. Little ones and big kids will find tons to do at this museum. It was reasonably priced, around $10 and has a reduced fee the last hour that the museum is open. I would definitely recommend a family trip here! ",
  "Our kids love going here!  We have an annual pass so it makes it even more affordable to take the family on a regular basis. I would highly recommend!",
  "My kids love this place, but not much changes (or is particularly well maintained for that matter) and the temporary exhibits are always disappointing.  Great place to take your kids especially if it is too rainy for the zoo, but maybe bring a magazine!",
  "I took my ten year old daughter there for the first time.  She had a great time interacting with the various exhibits.  Glad I took her this year...in another year or two she would definitely have been too old.  Be aware there are two or three things that cost extra once you get in the door...and skip the cafe, the food is average and costs an arm and a leg!",
  "Kids from 12 and under love this place.  My grandchildren love it and ask to go every time they are in town.  Older kids may not be interested in repeat visits except when the snow village is there around Christmas time or when the butterflies are there in the spring.  Those two things normally bring the older ones in.",
  "We come here on a regular basis. However this last visit was so disappointing! First of all the entire facility was dirty. While we understand that it is hard to keep a place like this clean, it seemed like some of the areas (especially around the big kid slide) hadn’t been properly cleaned in weeks. There are a lot of cool things for children to do if they work but things were broken or missing or not staffed. One can only hope that it will go back to the exciting, fun, and clean place it used to be...",
  "Edventure was a great place to take our 18month old granddaughter to on a very hot day in SC. She had room to run and be safe and lots of interesting objects to engage and intersect with while learning at the same time. Highly recommend a visit. It’s a bit pricey but was with the several hours we spent there.",
  "If your expecting to go there and learn something it's best you go somewhere else! I have been afrw times. When I go to a museum I expect for my daughter to learn how things work or came about allow me to help her learn. While she is entertained I want to learn something myself. If I wanted her to go to a playground that's where I would have taken her!",
  "We had a great time at this museum.  There was plenty to do for both of our kids at different ages.  Take advantage of the outdoor spaces as well, with tricycles and gardening.  If we lived in the area I would definitely get a pass.  ",
  "EdVenture is an educational museum to introduce young children to museums and libraries.  EdVenture cleverly cobbles fun, adventure and learning all together.  We need more museums like these and Discovery place in Columbia"
 ]
},{
 "name": "Sesquicentennial State Park",
 "address": "9564 Two Notch Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/98/ca/b4/beautiful-view.jpg",
 "tags": [
  "walking",
  "family",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d2624486-Reviews-Sesquicentennial_State_Park-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visit Sesqui 4-5 times a month and enjoy the various permutations one can enjoy while walking on the park's various trails.  The pond is quite nice and is a blast to fish, also.  I read a review complaining about noise from Ft. Jackson.  I've never noticed it, ever.  If had, I'm sure my dog and I would be fine, since we love the sound of freedom.  Murica.",
  "Beautiful place in the city but it is way too noisy due to its close proximity to Ft Jackson. My dog absolutely hates it at the park because of the nearly continuous gunfire and grenade explosions--any day of the week and being a vet I hate that noise too.",
  "This state park campground is amazing close to everything in Columbia.  Ten minutes to the visitors gate at Fort Jackson.  Fifteen minutes to downtown.  Five minutes to the nearest interstate.  The campground is open all year.  The roads and site in the campground are gravel with only electric and 30 and 50 amp electric, but there is a convenient dump station.  We stayed here to go to our grandsons graduation from boot camp.  There are also clean restrooms with showers.",
  "A nice park to visit for the family.  We had a family cookout and reunion in the park.  The kids played in the water.  They didn’t swim, they played.  ",
  "I had some time to kill. Since I have a state park passport, I decided to visit Sesquicentennial Park. I really enjoyed my brief time at this lovely park hidden in plain sight. I've gone by the entrance many times, but have never ventured in. I had an enjoyable walk. "
 ]
},{
 "name": "Segra Park",
 "address": "1640 Freed St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/c8/dc/33/spirit-communications.jpg",
 "tags": [
  "free",
  "hike",
  "walk",
  "eat",
  "walking",
  "kids",
  "family",
  "food",
  "free",
  "hike",
  "walk",
  "affordable",
  "walk",
  "food",
  "kids",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d10212396-Reviews-Segra_Park-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Spirit Communications Park is the recently completed (2016) ball park for the Columbia Fireflies, a Minor league team in the South Atlantic Conference (SAL). This is a great venue for baseball with lots of seating options from boxes to a grassy slope in the outfield. Lots of options for eating from the traditional hot dogs, peanuts and cracker jacks to Tex-Mex, bar-b-cue and funnel cakes. The team store, The Mason Jar, has plenty of gear for fans. Parking  is $3 and is a little distance because the parking garage has not been built yet. Free Trolleys will take you to and from your parking area if you choose not to walk. Games are fun with games between innings and roving video which is shown on the giant scoreboard. There is a children's play area and a measured track around the stadium should you need to take a hike.",
  "Spirit Communications Park is a great, new minor league baseball stadium.  Sightlines are excellent, the park has a great, cozy feel, and there doesn't seem to be a bad seat in the house.  Being there on opening night was a treat, but with some issues...\n\nPros:  Seating, as mentioned.  Overall food and beverage choices are good - some of the \"cart\" food options are really good, if a little on the expensive side (but not outrageously expensive).  Merchandise store is nice with a wide range of kids and adult selections.  Bathrooms were ample on a busy night.  The fireworks show after the game was really impressive!  Arriving early allowed ample time to shop and eat - the lines later during the game were not fan-friendly...\n\nCons:  1.  Realizing it was opening night and maybe there were growing pains and workers becoming familiar with the job and the surroundings, the lines for concessions were horrendous.  There should not be a 55-minute wait at any concession stand, ever!  This was the case at the \"standard fare\" concessions - basic ballpark stuff - burgers, dogs, popcorn, nachos, etc.  Constantly running out of the most basic items (fries, nachos/cheese sauce) is really unacceptable - you knew the hype surrounding this game and were quite unprepared for the anticipated crowd.  2.  The parking situation isn't ideal, but I understand there is a long-term plan for the entire area, so over time I would hope this improves.  However, very low lighting and uneven ground (even having to hurdle a small drainage channel) is asking for somebody to get hurt walking to the stadium or back to their car after a game.  3.  Crowd control - on one hand, selling $5 \"concourse\" tickets to allow standing is a great idea.  On the other hand, especially on a \"Thirsty Thursday\", the number of drunks utilizing this option is pretty high.  During the course of the game, the atmosphere in the section we were sitting in went from pleasant and family-friendly to something quite less desirable.  It was obvious there were some new faces in the rows behind us, and they were quite vocal and borderline profane (the standard ballpark yelling at the opposing team and umpires - which I think is childish, but drunks don't care).  We eventually left the section we were in and found seats elsewhere for the last three innings.  Why aren't you checking tickets more closely?\n\nAll in all, we had an excellent experience.  I only elaborate on the \"cons\" in hopes these items will improve the overall experience for future attendees, which will likely include my family again.",
  "Spirit Communications Park is the recently completed (2016) ball park for the Columbia Fireflies, a Minor league team in the South Atlantic Conference (SAL). This is a great venue for baseball with lots of seating options from boxes to a grassy slope in the outfield. Lots of options for eating from the traditional hot dogs, peanuts and cracker jacks to Tex-Mex, bar-b-cue and funnel cakes. The team store, The Mason Jar, has plenty of gear for fans. Parking  is $3 and is a little distance because the parking garage has not been built yet. Free Trolleys will take you to and from your parking area if you choose not to walk. Games are fun with games between innings and roving video which is shown on the giant scoreboard. There is a children's play area and a measured track around the stadium should you need to take a hike.",
  "Not a bad seat in the house! Fun evening, great seats in section 105 (top row). Bailey was our server and took excellent care of us. Lots of interaction with the crowd, and fun with the Flyboys during the 7th inning stretch. A most enjoyable, affordable evening.",
  "The park is very modern and has all kinds of bells and whistles, including very fast internet! Lots of between inning things to keep the crowd going. We sat in every section of the stadium to see what’s best, honestly there’s not a bad seat anywhere. \n\nIt’s $4 to park in the dirt lot and it’s a bit of a walk, if you have a cane or any other disability I would pay for the suite parking to get closer. There’s lots of roots and it’s wicked dusty, you cross an old parking lot along the way and go through tall grass, watch out for ticks and snakes. \n\nAlthough the parking situation is not ideal it does NOT take away from the overall experience! We had a blast!!",
  "A great venue for baseball and the Columbia Fireflies.  Comfortable seats,  plenty of food, beer sodas and restrooms for the crowds, things for kids to do.  My favorite ballpark!",
  "Thoroughly enjoyed the park and the game.Plenty of action in between innings with the children having activities on the field.The grounds crew are entertaining,it helps to allay the length of the game.Unfortunately the team is coming along slowly,the highlight of the team is Tim Tebow of the University of Florida played for them until he moved up.Also there is handicap valet parking in the front of the stadium,general parking is a ways from the stadium,they do have shuttles to bring you to the stadium.",
  "My wife and I have attended several games here and always enjoy them. The stadium itself is very well done. The food is typical stadium food which means it is fine but overpriced. But that is what was expected. The bad thing is the parking. Parking is in a dirt lot. There is a lot of space near the stadium but none is open for parking. I don’t know what is going on with that open area but I have heard from locals that it may or may not be a parking deck. If it is, please make multiple exits and entrances. At least pave the lot and get your procedures down. It seems like parking is a last minute decision on how they want to do it each day.\n\nWe will be back as we enjoy the games. But be ready to walk through grass/dirt/mud a good distance if you attend. "
 ]
},{
 "name": "Tunnel Vision Mural",
 "address": "1550 Marion St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/9b/29/88/blue-sky-mural.jpg",
 "tags": [
  "art",
  "walk",
  "art",
  "kids",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d6920303-Reviews-Tunnel_Vision_Mural-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "It’s Great Wall art and was a pleasant surprise while we were driving down the road. I wouldn’t drive out of my way to stop though. ",
  "Downtown Columbia, park and walk to see the unbelievable artwork of the tunnel mural, and across the lot to see the hydrant plug sculpture.",
  "Fun art and stop while waking around the city... kids thought it was cool... close to the giant fire hydrant so you can do both in one stop",
  "This mural is on the side of a building in downtown Columbia near a hospital. It is well done and really adds to the culture of the area when walking around. I wouldn’t go much out of my way to see it, but it was nice nonetheless.",
  "Needed to find things to do and we were close.  Thought we would check this out.  It is starting to fade but it’s still okay. "
 ]
},{
 "name": "Colonial Life Arena",
 "address": "801 Lincoln St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/3e/6b/ed/colonial-life-arena.jpg",
 "tags": [
  "food",
  "kids",
  "walking",
  "food",
  "tour",
  "food",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d3173502-Reviews-Colonial_Life_Arena-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were here for the state HS basketball tournament. Staff does a good job!\n The location of the arena is convenient to The Vista, which is nice for eating and more entertainment. Security is well done. Seats were comfortable, restrooms well taken care of. Parking is not easy in Columbia and there were lots of parking not available to the public, ( blocked off areas, lots of police to enforce restrictions. )\nFood is a little expensive and might not be what you are looking for. I could have used a Starbucks coffee, a little surprised they didn't have it inside the arena. \nOverall the arena makes a nice venue for this kind of event. \nVery nice for the kids who have worked so hard to get to the state championship to be able to play on a big stage.",
  "Went to state high school championship game. Tickets, concessions, restrooms, staff and seats all excellent.\nLoved walking up Lincoln Street to restaurants afterwards.",
  "We enjoyed attending a women’s college basketball game here. Easy access, plenty of eateries and college apparel for sale. There is also a parking garage up and across the street.",
  "I recently attended Colonial Life Area for a High School Competitive Cheer competition.  I understand that much depends on the host of the event, but everything about this arena was poor.  Very few concessions open, high prices, long lines etc.  After standing in line for 30+ minutes we were informed they were out of food.  There was nothing left but onion rings which were burnt.  Columbia should be able to do better than this!",
  "Enjoyed seeing Carrie Underwood in the Cry Pretty 360 tour. Easy going through security, entering the venue and finding our seats. The view from our seats was fanstastic - not sure there is a bad seat in the place. Great food and drink selections."
 ]
},{
 "name": "South Carolina Military Museum",
 "address": "1 National Guard Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/28/40/20/photo3jpg.jpg",
 "tags": [
  "free",
  "family",
  "family",
  "history",
  "kids",
  "tour",
  "history",
  "free",
  "organized",
  "history",
  "history",
  "free",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d2622183-Reviews-South_Carolina_Military_Museum-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "You will be going onto an actual National Guard military site so be prepared to show a picture ID for all adults.  This museum is well worth the free visit.  Lots of military memorabilia, large and small, inside and out.  Lots of items from General Westmoreland that his family has donated to the museum.  Artifacts from all the wars that South Carolina had soldiers participating in.  This museum has done an amazing job with this small museum.  Lots to see, plan on spending some time looking at everything.",
  "Friendly staff.  Relics very nicely displayed.  Even has a Jeep available to climb into for a photo op.  Clean restrooms.",
  "This Museum is phenomenal !  I spent a few hours at this museum and was captivated by the depth of the collection especially those items from WWII. I originally saw it about a year and go and  have returned to view it. Although I said 2 hours, that is really not enough time to see all the galleries and read all the descriptions. f you are a history  buff or researching a project for school or just curious this will fascinate you and your family and kids.",
  "Was very impressed with this small museum which is ran by vets and offered FREE for all who would like to attend. Lots of interesting artifacts and history. We were greeted upon entering and made to feel very welcome. I highly recommend if you are into history. They even have helicopters and several other pieces of military equipment on display that have been restored. We were lucky and had a vet who joined us towards the end of the tour and gave us a lot of interesting information regarding the place and some of the artifacts. Kudos to everyone who had a hand in getting this together and keeping it open.",
  "Displays are well organized and loaded with artifacts. Love all the large equipment! We went for the Battle of the Bulge commemorative event and were impressed with the reenactors, displays and the ceremony.",
  "A wonderful collection hidden away and not easy to find. But keep looking, it is worth it! Great South Carolina and American history artifacts and weapons including the first helicopter sold to the US Army.",
  "I am a history buff and this museum had a good mixture of early history and modern history. Had many weapons from different time periods and different countries. This is a must see for anyone interested in military history.",
  "Even if this wasn't free, I would still recommend it. Just remember it's on a National Guard Base, so you have to show ID to enter. The museum and staff were great! I think we spent about 2 hours in the museum. The exhibits were informative without being overwhelming. Whether you have an interest in the military or not, I think this was a great experience. They had three videos, but only one had a place to sit to view it. The other two were hard for me to watch as you stood bent over a little to see it. As you couldn't touch or sit in any of the machines, it might be difficult with young kids, as even I wanted to jump into the jeeps. Great way to spend the humid day."
 ]
},{
 "name": "Township Auditorium",
 "address": "1703 Taylor St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e0/0b/ef/township-auditorium.jpg",
 "tags": [
  "food",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d3173509-Reviews-Township_Auditorium-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Auditorium is easy to find, but not a lot of parking.  Most parking is on the street. This venue does not allow you to bring in outside food and drinks as they have their own concessions.",
  "This venue has been extensively renovated.  Sound quality was good.  Seating was good.  Sat in 2nd balcony.  A little hike up the stairs.  Offer on street parking and some parking lots available nearby.",
  "This is a recently renovated auditorium and they did it very well.  We came for a three night concert event to see the Avett Brothers and we are so glad we did.  The acoustics were some of the best we have heard, the staff was very accomodating (I am in a wheelchair) and the size of the venue (3 or 4 thousand) made it feel like the old days before the brothers started playing  PNC center sized venues.  We are hopeful that there will be more bands booked in that we want to see, because it is worth the hour or so drive to see them.  If I had to list one con, it would be the lack of parking.  We had no issue with our handicapped parking, but there is not really a parking lot so it is a little challenging to find somewhere close by.  If you stay at a close B & B like The 1425 Inn you can walk the 3/4 mile to the venue...if you are in good health, or take a cab.  Overall though the pros really outweigh any cons.  Highly recommend this venue and wish them good luck on getting some more great acts there soon!  ",
  "We loved the beauty of this place, the staff was very kind and the size made our experience of seeing REO Speedwagon very intimate. The only thing I will consider next time is not to get floor seats unless it is on the front row as the seats are all level to each other and there is no incline to help you see over the individuals in front of us. All in all it was a great experience and would love to see more shows there.\n\nRegards,\nDale and Naomi",
  "We decided to go see REO SPEEDWAGON and the closest concert was 500 miles in Columbia,  SC at the Township Auditorium. \nUpon arriving,  it looked like a gymnasium. And found out it only held 3000 people. Very skeptical. \nBut after entering,  was amazed at layout. There was not a bad seat in the house. Seats were roomy and everything was very accessible. \nLearned not to judge a book by it's cover.",
  "Amazing gallery view Dave chappelle was amazing and I love this Venue expect me to be coming back. I was very pleased the concessions was fine a little crowded but I did get my popcorn and the show was very enjoyable.",
  "Was a very nice venue for this type of show. seating was comfortable and view was mostly unobstructed. ( if people would stay seated) . I just wish people would purchase tickets for the seat they wanted instead of trying to move to other seats after purchasing a different seat section. parking is limited and often has a cost involved,",
  "Awesome facility! Loved the view from anywhere in the facility.  I would recommend this venue to everyone!"
 ]
},{
 "name": "River Rat Brewery",
 "address": "1231 Shop Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/48/50/82/17-beers-on-tap-weekly.jpg",
 "tags": [
  "unique",
  "unique",
  "food",
  "drink",
  "brewery",
  "delicious",
  "family",
  "food",
  "eat",
  "kids",
  "food",
  "brewery",
  "food",
  "pets",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d6725403-Reviews-River_Rat_Brewery-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "My father and brother were in town so my husband and I decided to try this place out for a unique bar experience- and this place was definitely it! The rooftop bar area has great views and heaters so customers stay comfortable. We went for lunch and the wings were awesome, which says a lot because we are all from Buffalo, NY. The pork and brisket was so yummy and the twisted lemon beer refreshing. Very cool scene and will be back for date night!",
  "Kind of ashamed I have never written a review for River Rat, providing how many times I have gone, but if you have yet to try it and are going through Columbia, it is a must stop. The location is unique compared to some of the other breweries, but the food is great and the beer is even better. The atmosphere is great for families, couples and friends just looking to get a drink. Favorite place to get a drink is the rooftop bar and take in the sunset and nearby USC Football Stadium.",
  "I returned to River Rat after enjoying my first visit three years ago and a lot has happened since then.  I visited with my adult children and we enjoyed several flights of the beer they offer as well as some delicious, upscale appetizers.  The yard was full of couples playing corn hole and enjoying a beautiful Sunday afternoon.  Well worth a visit to the brewery if you are in Columbia!",
  "This is where our son wanted to spend his birthday. We reserved a couple tables outside, for a price. It was $50 to hold 2 tables. If 50 people showed up then the money would be refunded. 50 didn't show so it was paid. Daughter-in-law paid it, so OK with me.\n\nHad never been here and my thought was that \"family friendly\" meant they had food kids would like. Oh no, much more than that. Fenced in area on astroturf that had corn hole games, riding toys for toddlers, slides for toddlers, older kids tossing footballs. Dogs are welcome. Truly a great family atmosphere. \n\nService was good. You order food at the bar and they give you a number and bring it to you. Hamburgers, wings and nachos were good. \n\nI had the LUMINESCENT LAGER which I enjoyed so much that I brought a growler of it home.\n\nI would not come specifically to eat, but food is good and a great place to hang out with family and friends while kids can run around. \n\n",
  "The parking lot was full on a Saturday afternoon, so we figured that this was popular and good. The first assumption was correct, but the second was marginal. Most of the patrons were young, and many of them had young children with them. The food, on the other hand, was very so-so. The hamburgers were OK, but nothing that would set this apart from a fast food place. The fries were even slightly sub par.  The beers were likewise marginal, but, for all I know the ones we didn't order could have been outstanding. One orders at the bar and a server brings the items, so the service didn't call for either compliments or complaints. Altogether forgettable.",
  "This is a great place to go with friends and just have a good time! A great variety of beers on tap for all palettes. There is cornhole in the back, and it's close to the stadium. Lots of fun!",
  "Visited Columbia on a hot day and wanted a place for lunch where we could take the pup and my daughter suggested River Rat Brewery.  This brewery is located by the the Gamecock stadium and I'm sure they do a brisk business on game days.  We had to try some brews although it wasn't a hardship on a hot day.  The offerings change so it's a good excuse to return.  You order inside and they bring the food to you.  You can see by the photos that there is a large exterior space with games and space for kids to run.\n\nI had the burger and portion size was huge.  The chicken and waffles went well with beer.\n\nIf you want to take kids and pets while in Columbia and don't mind drinking a few cold ones, then this is a place for you.",
  "My husband loves his dark beer and it is quite hard to find sometimes.  River Rat's brew, My Morning Stout as most enjoyable.  The nachos were some of the best we have ever had.  They also have a deck, that is an open second floor and a great place to hang out!  We will be going back, for sure!"
 ]
},{
 "name": "Worlds Largest Fire Hydrant",
 "address": "1400 Taylor St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/6f/c6/dc/world-largest-fire-hydrant.jpg",
 "tags": [
  "cheap",
  "walk",
  "walking",
  "art",
  "walking",
  "creative",
  "art",
  "daring"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d10382490-Reviews-Worlds_Largest_Fire_Hydrant-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Stop and take a picture, then you can walk across the parking lot and take a picture of the mural.  There are meters for parking on the street but it is extremely cheap to park for the 10 min it will take you to take a pic of both.",
  "Its very whimsically enjoyable to see. However, it is not in a location that merits lingering and walking about.  You can enjoy it from your car or a Brief stroll. However, it is near downtown where there is plenty to see so its worth a look if you have time.\n\nIts the south, down your windows, play some tunes and plan a nice, relaxed drive around downtown.  ",
  "This is an interesting stop just for a quick picture. The hydrant is surrounded by fencing and NO DOGS ALLOWED signs. Located next to it is the well-done tunnel vision mural.",
  "It's big. And it is worth stopping by, but I don't think it works :) It is in close walking distance of some other art installations and the downtown area",
  "Not as impressive as I expected but worth a stop for a photo op if you are in the area. I thought the downtown neighborhood would be more walkable but it seemed industrial so we just pulled up, took a couple of photos and then left.",
  "Creative, gigantic, a must see in Columbia. Everyone visiting the city should take a selfie with the very large fire hydrant.",
  "A daring and interesting art piece accommodating the famous “Tunnel Vision” mural nearby. The hydrant looks liked it got hit by a truck, which was purposefully made that way. This is a good quick stop if you have just done Soda City nearby on Main St. ",
  "Its art...its a fire hydrant! Actually was pretty impressed. The cap chains are anchor chain so this is pretty substantial weight and size. Take 5 minutes and have a good laugh. "
 ]
},{
 "name": "Robert Mills House & Gardens",
 "address": "1616 Blanding St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/f5/4e/86/robert-mills-house.jpg",
 "tags": [
  "tour",
  "family",
  "history",
  "knowledgeable",
  "organized",
  "historic",
  "tour",
  "historic",
  "family",
  "tour",
  "family",
  "history",
  "knowledgeable",
  "tour",
  "family",
  "history",
  "knowledgeable",
  "tour",
  "walk",
  "knowledgeable",
  "family",
  "historic",
  "tour",
  "tour",
  "tour",
  "family",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d143426-Reviews-Robert_Mills_House_Gardens-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This house is well-worth seeing.  So is the the Hampton- Preston house across the street (don't let the hideous colors they decided to paint the exterior discourage you from visiting it.  This one was actually occupied by a family.)\n\nThese houses are surprisingly close to the center of downtown Columbia. \n\nThere is so much fascinating history to be learned here.  (Each house tour takes an hour or slightly more.)  The gardens of the Robert Mills House are great.  \n\nWe think one can get an admission that includes both houses, at a lower combined price than buying them separately.\n\nCall first to find out what hours they have the house tours.\n\nThe tour guides are very knowledgeable, friendly, and enthusiastic.\n\nThis gives one a wonderful, different perspective of Columbia.",
  "Started my day trip in Columbia by touring the Robert Mills House, named for its designer. Robert Mills was the first Federal Architect and designed many buildings including the Washington Monument. He practiced symmetry in his design of the house and gardens which occupied the entire four acre block of the city. The entry was grand, but lacked a traditional grand staircase which he (accurately) considered to be a great fire hazard. It did include, however, several faux doors in order to maintain the symmetry. The house complex housed a Presbyterian College for most of its life, but was nearly torn down in the 1960's. The Columbia Historic Society was formed in order to save and restore it. It is now the headquarters of the Society which operates four historic house museums in the city.  Best to take the organized tour and combine with other nearby sites.",
  "I've loved historic houses all my life & spent my professional life working in house museums or historic sites from docent to director. Robert Mills is one of my favorite architects from that period & I've know of this site for 30 years but was never able to visit.\nWORTH THE WAIT!! I had a fantastic guide and was able to take a bit more time in the rooms ( as this is the stuff that makes my heart pump!) to admire the fine collection of furnishings and portraits from the Historic Columbia Foundation.\nWhile never actually a family home, the house is staged as such & gives an idea of how the slave holding elite lived while \"in town\" from the country estates.\nThank you!!",
  "This house is well-worth seeing.  So is the the Hampton- Preston house across the street (don't let the hideous colors they decided to paint the exterior discourage you from visiting it.  This one was actually occupied by a family.)\n\nThese houses are surprisingly close to the center of downtown Columbia. \n\nThere is so much fascinating history to be learned here.  (Each house tour takes an hour or slightly more.)  The gardens of the Robert Mills House are great.  \n\nWe think one can get an admission that includes both houses, at a lower combined price than buying them separately.\n\nCall first to find out what hours they have the house tours.\n\nThe tour guides are very knowledgeable, friendly, and enthusiastic.\n\nThis gives one a wonderful, different perspective of Columbia.",
  "This house is well-worth seeing.  So is the the Hampton- Preston house across the street (don't let the hideous colors they decided to paint the exterior discourage you from visiting it.  This one was actually occupied by a family.)\n\nThese houses are surprisingly close to the center of downtown Columbia. \n\nThere is so much fascinating history to be learned here.  (Each house tour takes an hour or slightly more.)  The gardens of the Robert Mills House are great.  \n\nWe think one can get an admission that includes both houses, at a lower combined price than buying them separately.\n\nCall first to find out what hours they have the house tours.\n\nThe tour guides are very knowledgeable, friendly, and enthusiastic.\n\nThis gives one a wonderful, different perspective of Columbia.",
  "This is a lovely historic home that has been restored to what it would have been like as a family home in the 1820s. Since the original family only lived there a short time and the house was used by various religious educational institutions, most of the furnishings are period pieces that are not original to the home. The architectural details of the house are beautiful and surprising. I enjoyed seeing all the furniture, exhibits, and the rooms, both upstairs and downstairs in the kitchens.\n\nWe arrived early on a Tuesday morning and there were no other people there, so we basically got a private tour. The guide was friendly and knowledgeable and very patient and engaging with the four-year-old we had with us. The gift shop clerk was friendly, and there was a good variety of South Carolina memorabilia, books, souvenirs, and edible snacks. I recommend the Benne Wafers and the Pecan Pralines!\n\nIt was a cool, clear spring day, so it was great to get to walk through the small formal garden and stroll around the grounds.",
  "A wonderful old home, that was never actually used as a home.  You will have to visit and have your guide explain the interesting story.  Our guide was full of information,  which provided great conversation among our small tour group. We're glad we stopped by,  this was a good sight to see.",
  "A look into a time long past and how the well to do lived in a forgotten era. Guides are very informative, ready to answer questions, and helpful",
  "From the brick and cast-iron fencing to the imposing brick main house and outbuildings, this \"house\" would be best described as a Carolina mansion. The view from the front portico is lovely, and the gardens were showy, with flowers in bloom everywhere.\n",
  "The tour was very informative and the grounds beautiful.. The tour guide did an excellent job and answered questions with knowledge.",
  "This house is well-worth seeing.  So is the the Hampton- Preston house across the street (don't let the hideous colors they decided to paint the exterior discourage you from visiting it.  This one was actually occupied by a family.)\n\nThese houses are surprisingly close to the center of downtown Columbia. \n\nThere is so much fascinating history to be learned here.  (Each house tour takes an hour or slightly more.)  The gardens of the Robert Mills House are great.  \n\nWe think one can get an admission that includes both houses, at a lower combined price than buying them separately.\n\nCall first to find out what hours they have the house tours.\n\nThe tour guides are very knowledgeable, friendly, and enthusiastic.\n\nThis gives one a wonderful, different perspective of Columbia."
 ]
},{
 "name": "Koger Center for the Arts",
 "address": "1051 Greene St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/c1/b2/d2/soldiers-fighting-battle.jpg",
 "tags": [
  "performance",
  "walking",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d3173504-Reviews-Koger_Center_for_the_Arts-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had a great time seeing “Wicked” at the Kroger Center. The performance was great and the seats were comfortable. If you have difficulty walking then you should try getting seats towards the end of the aisle. There are only two entrances to each aisle. There are many restaurants within walking distance.",
  "Parking was a little trying but everything else was great. We got in in good time and there was good organization for the event",
  "I bought tickets to WiSCevend and made sure that we had handicapped seating so my son, age 37, blind and in a wheelchair could enjoy the show. Little did I know we would be ushered into a 3 walled room separated from the rest of the audience and that we would ne seated on old worn out chairs that looked like they were from an old doctor's office. Thank goodness my son was in his good wheelchair and not his transport chair. I was appalled at the segregation. We were even asked if we all had handicapped tickets by a woman in a yellow vest who never identified herself. I later found out she was a nurse making a courtsey visit. Since when does disabled mean medically fragile? I was embarrassed and appalled. I will be elevating the matter. Would not recommend to anyone needing a wheelchair or walker.",
  "Wonderful. The week prior I attended the Boston Ballet Nutcracker and I enjoyed Columbia's so much more. I am definitely making it an annual event, all 7 of us loved it!",
  "The Koger Center for the Arts is an ideal place to enjoy concerts, symphonies of both the South Carolina Philharmonic or University of Music Programs or traveling Broadway shows.  My husband and I try to see three performances a month with the variety of shows.  Very enjoyable and generally crowded.  Audience invited to wear blue jeans for the Blue Jeans and Beethoven concert - a winner."
 ]
},{
 "name": "Fort Jackson Museum (not open to All public)",
 "address": "4442 Jackson Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/08/0d/ca/img-20180207-155132913.jpg",
 "tags": [
  "tour",
  "family",
  "history",
  "walking",
  "active",
  "history",
  "family",
  "unique",
  "structure",
  "field",
  "pets",
  "food",
  "walking",
  "active",
  "history",
  "family",
  "unique",
  "structure",
  "field",
  "pets",
  "food",
  "walking",
  "active",
  "history",
  "family",
  "unique",
  "structure",
  "field",
  "pets",
  "food",
  "family",
  "tour",
  "family",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d9764727-Reviews-Fort_Jackson_Museum_not_open_to_All_public-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "NOTE - base access is required in order to visit this museum.  If you're unsure of your access, I highly recommend you contact Base security for details.\n\nThe vast majority of people reading this review are probably family and friends of soldiers-in-training.  Fort Jackson is a major Army recruit training command, and hosts a recruit graduation almost every week of the year.  An important part of this event is Family Day.  \"Your\" Soldier will be able to spend time with you, touring you around the base.  They will probably be very eager to guide you through the Museum - it's one of the \"must sees\" on Family Day.  How much time will it take?  Your call - anywhere between 20 minutes (you'll miss a lot) to two hours (you'll need a rest).\n\nAlthough this is not a HUGE museum, it is provides an excellent overview of Army recruit training through the years.  Detailed visual displays tell the history of Camp Jackson/Fort Jackson.  Another section detailing the history of Drill Sergeant training - the senior enlisted members of the US Army who are responsible for developing your person into an American soldier.\n\nBut  your soldier will really be \"in their element\" when they guide you through the phases (Red, White, and Blue) of THEIR training.  Numerous visual displays enhance the tour.  Several \"hands-on\" training aids draw attention, particularly from younger siblings.  Watch your soldier as they explain items and events (sometimes in excruciatingly long detail) occurring during their basic training.  Notice how proud they are?  How confident they appear?  A Drill Sergeant helped build those traits.\n\nThere are also several eye-catching outdoor static displays located in front of AND behind the Museum: tanks; artillery pieces, jeeps,etc.  Finally, perhaps nicest of all, several shaded patio tables offer a spot to sit, rest and regroup.",
  "If my review is useful, please give me a “helpful” vote.\n\n1. Bottom Line Up Front. As a retired Marine Corps Infantry Officer and history enthusiast, I have had the privilege of visiting quite a few museums of this type across the United States so my expectations are very high.  I think this is a unique museum in that, while it provides a large amount of information, it is not like most military museums that have a tremendous amount of informative placards oriented towards military history enthusiasts.  I believe this museum is oriented towards parents who are aboard the installation for their son or daughter’s graduation.  I believe that parents are not so much interested in reading endless informative placards but instead are interested in having their son/daughter guide them through the museum and use the exhibits to help explain what they have experienced throughout basic training.\n\n2.  Caveat.  During my visit, there were, what I assume to be recruits, conducting routine cleaning at the museum.  I would imagine that they are instructed not to interact with museum patrons, so do not engage them in conversation.\n\n3.  Details of my visit.  \n\n3.a.  Date/time.  I visited the museum on a Friday morning in early September 2019. \n\n3.b.  Other patrons.  During my visit, there were two other groups of 4-5 people in the museum.  These appeared to be soldiers and their parents.\n\n3.c.  Length of visit.  I was at the museum for approximately 2 hours.  I did not read all of the informative placards/displays; to do so would have required approximaltey 3 hours.\n\n4. Directions/location \n\n4.a.  Enter the main gate on Interstate 77.  This will put you on Strom Thurmond Blvd.\n\n4.a.  Proceed approximately ¼ mile.\n\n4.b.  Turn right on Jackson Blvd.\n\n4.c.  Proceed approximately ½ mile.\n\n4.d.  The museum is on the left (at the intersection of Jackson Blvd and Forney Road.\n\n4.e.  The museum is not large; it is in a one-story structure that I assume dates back to the early stages of the installation (circa 1960s).\t\t\t     \n\n5. Access\n\n5.a.  General.  The museum is aboard the Fort Jackson military \ninstallation.  From previous review, it appears that the installation is only accessible to:  active duty military personnel; national guardsmen and reservists; civil service employees; military contractors; military retirees; and (I assume) family members attending Basic Training graduations.\n\n5.b.  From previous reviews, I understand that visitors who do not fit the categories above may contact the Fort Jackson Public Affairs office to coordinate entry to the installation. \n\n5.c. Passenger vehicles. The parking lot can be accessed by any type of passenger vehicle.\n\n5.d. RV and semi tractor-trailer access. I was not in an RV or pulling a trailer on the day of my visit but I realize that many people visiting attractions such as this one are on vacation and may be in over-size vehicles.  I would consider the parking lot to be accessible to oversize vehicles unless it is packed to capacity; I recommend looking at the facility on Bing or Google Maps to confirm accessibility.  There appears to be sufficient space on Green Avenue to the southwest of the museum.\n\n6. Parking \n\n6.a. The parking lot is paved.\n\n6.b. There is no charge for parking.\n\n6.c. There are approximately 50 parking spaces in front of the museum on Jackson Blvd and to the south on Forney Road.\n\n7. Admission.  There is no charge for admission. \n\n8. Hours of Operation (obtained from the sign at the museum’s entrance). \n\n8.a.  Normal.  Mon-Fri 9:00 am – 4:00 pm.\n\n8.b.  Family Day (I assume this is associated with Basic Training \nGraduations).  9:00 am – 6:00 pm.  \n\n9. Prohibitions/permissions. \n\n9.a.  Weapons.  Since this museum is aboard a military installation, privately-owned weapons are not permitted.\n\n9.b.  Photography.  Photography is permitted.\n\n9.c.  Food & beverages.  There is a sign at the entrance prohibiting food and beverages.\n\n9.d.  Pets and service animals. There was no sign indicating otherwise but I would imagine pets are prohibited and service animals are permitted.\n\n10. Type/nature of museum visit.\n\n10.a.  Non-guided.  Visitors may conduct non-guided tours of all the  museum grounds/exhibits.\n\n10.b.  Guided.  I do not know if guided tours are available.\n\n11.  Exhibits - History of Fort Jackson.  It is interesting to note that the installation was:  stood up in 1917 for use during WW I…stood down…stood back up during WW II…stood down again…stood back up for the Korean War…and then (in 1956) officially stood up as a permanent Army installation.\n\n12.  Exhibits - Detailed description of the different phases of Basic Training.\n\n12.a.  Red phase.  These exhibits portray the receiving process and initial training.  This portion has a nice, full-size diorama of a recruit barracks (circa 1950).  This portion of the museum also contains examples of Army uniforms from WW I to present.\n\n12.b.  White phase.  These exhibits portray the intermediate activities.  This portion has exhibits portraying things such as: confidence course training; pugil stick training; a life-size diorama of the evolution of marksmanship training from WW I to present day and contains displays of service rifles used by Solders throughout the years:  M1898 Krag-Jorgensen 30-40 cal bolt action rifle; M1903 Springfield 30-06 cal bolt action rifle; M1917 Enfield 30-06 cal bolt action rifle (used by US Soldiers in WW I); M-1 Garand 30-06 cal semi-automatic rifle; 30 cal semi-automatic carbie; M-14 7.62mm semi-automatic rifle; M-16 5.56mm semi-automatic rifle.  \n\n12.c.  Blue phase.  These exhibits portray the final activities of recruit training.  This portion has:  exhibit containing individual Soldier’s fighting load – 1910, 1945 and 1985; some small scale dioramas depicting trench warfare training of WW I, a Vietnam War training camp, and a modern urban warfare training facility.  This portion of the museum also contains some very nice weapons displays of:  anti-tank weapons, machineguns and specialized weapons (M2897 Winchester shotgun, M1918A1 Browning Automatic Rifle, M1A1 Thompson submachinegun, M3 45cal submachinegun, Colt M1911A1 semiautomatic pistol, M1917 .45 cal revolver).\n\n13.  Outdoor exhibits.  All of these items are in very good condition.  As best as I could, I have listed these in chronological order with respect to their times of employment.\n\n13.a.  M3-A1 Armored Scout Car.  WW II.  50cal machinegun, 2 x 7.62mm machinegun.  Crew-2, Passengers-6.\n\n13.b.  M3 Anti-tank gun.  WW II.  37mm\n\n13.c.  M4A-3E8 Sherman Tank.  WW II & Korean War.  76mm main gun; 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.d.  M-26 Pershing Tank.  WW II & Korean War.  90mm main gun, 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.e.  M15-A1 Gun Motor Carriage.  WW II & Korean War.  37mm anti-aircraft/artillery, 2 x 50cal machinegun.  This appears to be a modified “half-track”.\n\n13.f.  M4-A1 Walker Bulldog Tank.  Korean War.  76mm main gun, 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.g.  T-30 Heavy Tank prototype.  155mm main gun, 2 x 50cal machinegun, 2 x 7.62mm machinegun.  From my research, this is an extremely rare tank; there seem to be only three prototypes remaining; the others are at Fort Benning (Columbus, GA) and Detroit Arsenal (Warren Michigan).\n\n13.h.  M84 mortar carrier.   1956-1981.  4.2” mortar, 50 cal machinegun.  This is a tracked vehicle (similar in appearance to the M113 armored personnel carrier.  It has a crew of 6.\n\n13.i.  M37 Cargo Truck.  Vietnam War.  Crew-2.  Capacity.  1 ton.\n\n13.j.  M114 Command Carrier.  Vietnam War.  50cal machinegun, 7.62mm machinegun.  This is a very small armored vehicle; from the information on the placard, I can only assume that it’s purpose is to place the Commanding Officer of a unit (and possibly two others) near the front lines in order to affect the battle.\n\n13.k.  M27-4A1 Platform Truck (Mechanical Mule).  Vietnam war – early 1980s.  This is a very simple and unique vehicle.  It had a 17 hp engine and could carry ½ ton of cargo.  It was used for multiple tasks such as:  transporting ammunition and rations, laying field wire and could also mount a 106mm recoilless rifle.  After touring multiple military museums, I have only come across three others (and they were in very poor condition); these two are under a covered pavilion and are in very good condition.\n\n13.l.  Bell UH-1B (Huey) Utility Helicopter.  Vietnam War. \n\n13.m.  4-5 jeeps of different vintage and configurations\n\n14. Handicap access. I am not handicapped but understand that this can affect someone's decision whether or not to visit a site/attraction. Visitors who are wheelchair-bound or have difficulty walking can access the museum with little/no difficulty.  There is a ramp at the museum’s entrance and ramps between all of the different portions of the museum.\n\n15. Child friendliness.  This attraction is child friendly.  There are even a couple of hands on exhibits where patrons can handle replicas (M-16 rifle, M-1 rifle, hand grenade).\n\n15.a.  I do not have children and on the day of my visit, there were \n approximately 2 small children (with their parents).\n\n15.b.  I would remind parents and teachers (of school groups) that this is a museum and not a playground; loud & un-restrained actions detract from the enjoyment of others.\n\n16. Amenities/creature comforts.  Food & drinks are not permitted in the areas of the museum that contain exhibits.\n\n16.a.  Restrooms.  There are restrooms near the museum entrance.\n\n16.b.  Water fountains.  There is a water fountain near the museum entrance.\n\n16.c.  Food & beverages.  NA.\n\n16. Gift shop.  NA.\n\n17.  If you are in the mood for an extended trip, I can personally recommend a 2 ½ hour detour to Charleston, SC to visit the Patriots Point Naval & Maritime museum; Mount Pleasant, South Carolina (near Charleston).  There are three US Navy vessels here:  USS Yorktown - aircraft carrier; USS Laffey – destroyer; USS Clamagore – submarine.  They have several pristine World War II aircraft in the hangar deck indoors and approximately 12 1950s-1980s aircraft on the flight deck outdoors.",
  "If my review is useful, please give me a “helpful” vote.\n\n1. Bottom Line Up Front. As a retired Marine Corps Infantry Officer and history enthusiast, I have had the privilege of visiting quite a few museums of this type across the United States so my expectations are very high.  I think this is a unique museum in that, while it provides a large amount of information, it is not like most military museums that have a tremendous amount of informative placards oriented towards military history enthusiasts.  I believe this museum is oriented towards parents who are aboard the installation for their son or daughter’s graduation.  I believe that parents are not so much interested in reading endless informative placards but instead are interested in having their son/daughter guide them through the museum and use the exhibits to help explain what they have experienced throughout basic training.\n\n2.  Caveat.  During my visit, there were, what I assume to be recruits, conducting routine cleaning at the museum.  I would imagine that they are instructed not to interact with museum patrons, so do not engage them in conversation.\n\n3.  Details of my visit.  \n\n3.a.  Date/time.  I visited the museum on a Friday morning in early September 2019. \n\n3.b.  Other patrons.  During my visit, there were two other groups of 4-5 people in the museum.  These appeared to be soldiers and their parents.\n\n3.c.  Length of visit.  I was at the museum for approximately 2 hours.  I did not read all of the informative placards/displays; to do so would have required approximaltey 3 hours.\n\n4. Directions/location \n\n4.a.  Enter the main gate on Interstate 77.  This will put you on Strom Thurmond Blvd.\n\n4.a.  Proceed approximately ¼ mile.\n\n4.b.  Turn right on Jackson Blvd.\n\n4.c.  Proceed approximately ½ mile.\n\n4.d.  The museum is on the left (at the intersection of Jackson Blvd and Forney Road.\n\n4.e.  The museum is not large; it is in a one-story structure that I assume dates back to the early stages of the installation (circa 1960s).\t\t\t     \n\n5. Access\n\n5.a.  General.  The museum is aboard the Fort Jackson military \ninstallation.  From previous review, it appears that the installation is only accessible to:  active duty military personnel; national guardsmen and reservists; civil service employees; military contractors; military retirees; and (I assume) family members attending Basic Training graduations.\n\n5.b.  From previous reviews, I understand that visitors who do not fit the categories above may contact the Fort Jackson Public Affairs office to coordinate entry to the installation. \n\n5.c. Passenger vehicles. The parking lot can be accessed by any type of passenger vehicle.\n\n5.d. RV and semi tractor-trailer access. I was not in an RV or pulling a trailer on the day of my visit but I realize that many people visiting attractions such as this one are on vacation and may be in over-size vehicles.  I would consider the parking lot to be accessible to oversize vehicles unless it is packed to capacity; I recommend looking at the facility on Bing or Google Maps to confirm accessibility.  There appears to be sufficient space on Green Avenue to the southwest of the museum.\n\n6. Parking \n\n6.a. The parking lot is paved.\n\n6.b. There is no charge for parking.\n\n6.c. There are approximately 50 parking spaces in front of the museum on Jackson Blvd and to the south on Forney Road.\n\n7. Admission.  There is no charge for admission. \n\n8. Hours of Operation (obtained from the sign at the museum’s entrance). \n\n8.a.  Normal.  Mon-Fri 9:00 am – 4:00 pm.\n\n8.b.  Family Day (I assume this is associated with Basic Training \nGraduations).  9:00 am – 6:00 pm.  \n\n9. Prohibitions/permissions. \n\n9.a.  Weapons.  Since this museum is aboard a military installation, privately-owned weapons are not permitted.\n\n9.b.  Photography.  Photography is permitted.\n\n9.c.  Food & beverages.  There is a sign at the entrance prohibiting food and beverages.\n\n9.d.  Pets and service animals. There was no sign indicating otherwise but I would imagine pets are prohibited and service animals are permitted.\n\n10. Type/nature of museum visit.\n\n10.a.  Non-guided.  Visitors may conduct non-guided tours of all the  museum grounds/exhibits.\n\n10.b.  Guided.  I do not know if guided tours are available.\n\n11.  Exhibits - History of Fort Jackson.  It is interesting to note that the installation was:  stood up in 1917 for use during WW I…stood down…stood back up during WW II…stood down again…stood back up for the Korean War…and then (in 1956) officially stood up as a permanent Army installation.\n\n12.  Exhibits - Detailed description of the different phases of Basic Training.\n\n12.a.  Red phase.  These exhibits portray the receiving process and initial training.  This portion has a nice, full-size diorama of a recruit barracks (circa 1950).  This portion of the museum also contains examples of Army uniforms from WW I to present.\n\n12.b.  White phase.  These exhibits portray the intermediate activities.  This portion has exhibits portraying things such as: confidence course training; pugil stick training; a life-size diorama of the evolution of marksmanship training from WW I to present day and contains displays of service rifles used by Solders throughout the years:  M1898 Krag-Jorgensen 30-40 cal bolt action rifle; M1903 Springfield 30-06 cal bolt action rifle; M1917 Enfield 30-06 cal bolt action rifle (used by US Soldiers in WW I); M-1 Garand 30-06 cal semi-automatic rifle; 30 cal semi-automatic carbie; M-14 7.62mm semi-automatic rifle; M-16 5.56mm semi-automatic rifle.  \n\n12.c.  Blue phase.  These exhibits portray the final activities of recruit training.  This portion has:  exhibit containing individual Soldier’s fighting load – 1910, 1945 and 1985; some small scale dioramas depicting trench warfare training of WW I, a Vietnam War training camp, and a modern urban warfare training facility.  This portion of the museum also contains some very nice weapons displays of:  anti-tank weapons, machineguns and specialized weapons (M2897 Winchester shotgun, M1918A1 Browning Automatic Rifle, M1A1 Thompson submachinegun, M3 45cal submachinegun, Colt M1911A1 semiautomatic pistol, M1917 .45 cal revolver).\n\n13.  Outdoor exhibits.  All of these items are in very good condition.  As best as I could, I have listed these in chronological order with respect to their times of employment.\n\n13.a.  M3-A1 Armored Scout Car.  WW II.  50cal machinegun, 2 x 7.62mm machinegun.  Crew-2, Passengers-6.\n\n13.b.  M3 Anti-tank gun.  WW II.  37mm\n\n13.c.  M4A-3E8 Sherman Tank.  WW II & Korean War.  76mm main gun; 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.d.  M-26 Pershing Tank.  WW II & Korean War.  90mm main gun, 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.e.  M15-A1 Gun Motor Carriage.  WW II & Korean War.  37mm anti-aircraft/artillery, 2 x 50cal machinegun.  This appears to be a modified “half-track”.\n\n13.f.  M4-A1 Walker Bulldog Tank.  Korean War.  76mm main gun, 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.g.  T-30 Heavy Tank prototype.  155mm main gun, 2 x 50cal machinegun, 2 x 7.62mm machinegun.  From my research, this is an extremely rare tank; there seem to be only three prototypes remaining; the others are at Fort Benning (Columbus, GA) and Detroit Arsenal (Warren Michigan).\n\n13.h.  M84 mortar carrier.   1956-1981.  4.2” mortar, 50 cal machinegun.  This is a tracked vehicle (similar in appearance to the M113 armored personnel carrier.  It has a crew of 6.\n\n13.i.  M37 Cargo Truck.  Vietnam War.  Crew-2.  Capacity.  1 ton.\n\n13.j.  M114 Command Carrier.  Vietnam War.  50cal machinegun, 7.62mm machinegun.  This is a very small armored vehicle; from the information on the placard, I can only assume that it’s purpose is to place the Commanding Officer of a unit (and possibly two others) near the front lines in order to affect the battle.\n\n13.k.  M27-4A1 Platform Truck (Mechanical Mule).  Vietnam war – early 1980s.  This is a very simple and unique vehicle.  It had a 17 hp engine and could carry ½ ton of cargo.  It was used for multiple tasks such as:  transporting ammunition and rations, laying field wire and could also mount a 106mm recoilless rifle.  After touring multiple military museums, I have only come across three others (and they were in very poor condition); these two are under a covered pavilion and are in very good condition.\n\n13.l.  Bell UH-1B (Huey) Utility Helicopter.  Vietnam War. \n\n13.m.  4-5 jeeps of different vintage and configurations\n\n14. Handicap access. I am not handicapped but understand that this can affect someone's decision whether or not to visit a site/attraction. Visitors who are wheelchair-bound or have difficulty walking can access the museum with little/no difficulty.  There is a ramp at the museum’s entrance and ramps between all of the different portions of the museum.\n\n15. Child friendliness.  This attraction is child friendly.  There are even a couple of hands on exhibits where patrons can handle replicas (M-16 rifle, M-1 rifle, hand grenade).\n\n15.a.  I do not have children and on the day of my visit, there were \n approximately 2 small children (with their parents).\n\n15.b.  I would remind parents and teachers (of school groups) that this is a museum and not a playground; loud & un-restrained actions detract from the enjoyment of others.\n\n16. Amenities/creature comforts.  Food & drinks are not permitted in the areas of the museum that contain exhibits.\n\n16.a.  Restrooms.  There are restrooms near the museum entrance.\n\n16.b.  Water fountains.  There is a water fountain near the museum entrance.\n\n16.c.  Food & beverages.  NA.\n\n16. Gift shop.  NA.\n\n17.  If you are in the mood for an extended trip, I can personally recommend a 2 ½ hour detour to Charleston, SC to visit the Patriots Point Naval & Maritime museum; Mount Pleasant, South Carolina (near Charleston).  There are three US Navy vessels here:  USS Yorktown - aircraft carrier; USS Laffey – destroyer; USS Clamagore – submarine.  They have several pristine World War II aircraft in the hangar deck indoors and approximately 12 1950s-1980s aircraft on the flight deck outdoors.",
  "If my review is useful, please give me a “helpful” vote.\n\n1. Bottom Line Up Front. As a retired Marine Corps Infantry Officer and history enthusiast, I have had the privilege of visiting quite a few museums of this type across the United States so my expectations are very high.  I think this is a unique museum in that, while it provides a large amount of information, it is not like most military museums that have a tremendous amount of informative placards oriented towards military history enthusiasts.  I believe this museum is oriented towards parents who are aboard the installation for their son or daughter’s graduation.  I believe that parents are not so much interested in reading endless informative placards but instead are interested in having their son/daughter guide them through the museum and use the exhibits to help explain what they have experienced throughout basic training.\n\n2.  Caveat.  During my visit, there were, what I assume to be recruits, conducting routine cleaning at the museum.  I would imagine that they are instructed not to interact with museum patrons, so do not engage them in conversation.\n\n3.  Details of my visit.  \n\n3.a.  Date/time.  I visited the museum on a Friday morning in early September 2019. \n\n3.b.  Other patrons.  During my visit, there were two other groups of 4-5 people in the museum.  These appeared to be soldiers and their parents.\n\n3.c.  Length of visit.  I was at the museum for approximately 2 hours.  I did not read all of the informative placards/displays; to do so would have required approximaltey 3 hours.\n\n4. Directions/location \n\n4.a.  Enter the main gate on Interstate 77.  This will put you on Strom Thurmond Blvd.\n\n4.a.  Proceed approximately ¼ mile.\n\n4.b.  Turn right on Jackson Blvd.\n\n4.c.  Proceed approximately ½ mile.\n\n4.d.  The museum is on the left (at the intersection of Jackson Blvd and Forney Road.\n\n4.e.  The museum is not large; it is in a one-story structure that I assume dates back to the early stages of the installation (circa 1960s).\t\t\t     \n\n5. Access\n\n5.a.  General.  The museum is aboard the Fort Jackson military \ninstallation.  From previous review, it appears that the installation is only accessible to:  active duty military personnel; national guardsmen and reservists; civil service employees; military contractors; military retirees; and (I assume) family members attending Basic Training graduations.\n\n5.b.  From previous reviews, I understand that visitors who do not fit the categories above may contact the Fort Jackson Public Affairs office to coordinate entry to the installation. \n\n5.c. Passenger vehicles. The parking lot can be accessed by any type of passenger vehicle.\n\n5.d. RV and semi tractor-trailer access. I was not in an RV or pulling a trailer on the day of my visit but I realize that many people visiting attractions such as this one are on vacation and may be in over-size vehicles.  I would consider the parking lot to be accessible to oversize vehicles unless it is packed to capacity; I recommend looking at the facility on Bing or Google Maps to confirm accessibility.  There appears to be sufficient space on Green Avenue to the southwest of the museum.\n\n6. Parking \n\n6.a. The parking lot is paved.\n\n6.b. There is no charge for parking.\n\n6.c. There are approximately 50 parking spaces in front of the museum on Jackson Blvd and to the south on Forney Road.\n\n7. Admission.  There is no charge for admission. \n\n8. Hours of Operation (obtained from the sign at the museum’s entrance). \n\n8.a.  Normal.  Mon-Fri 9:00 am – 4:00 pm.\n\n8.b.  Family Day (I assume this is associated with Basic Training \nGraduations).  9:00 am – 6:00 pm.  \n\n9. Prohibitions/permissions. \n\n9.a.  Weapons.  Since this museum is aboard a military installation, privately-owned weapons are not permitted.\n\n9.b.  Photography.  Photography is permitted.\n\n9.c.  Food & beverages.  There is a sign at the entrance prohibiting food and beverages.\n\n9.d.  Pets and service animals. There was no sign indicating otherwise but I would imagine pets are prohibited and service animals are permitted.\n\n10. Type/nature of museum visit.\n\n10.a.  Non-guided.  Visitors may conduct non-guided tours of all the  museum grounds/exhibits.\n\n10.b.  Guided.  I do not know if guided tours are available.\n\n11.  Exhibits - History of Fort Jackson.  It is interesting to note that the installation was:  stood up in 1917 for use during WW I…stood down…stood back up during WW II…stood down again…stood back up for the Korean War…and then (in 1956) officially stood up as a permanent Army installation.\n\n12.  Exhibits - Detailed description of the different phases of Basic Training.\n\n12.a.  Red phase.  These exhibits portray the receiving process and initial training.  This portion has a nice, full-size diorama of a recruit barracks (circa 1950).  This portion of the museum also contains examples of Army uniforms from WW I to present.\n\n12.b.  White phase.  These exhibits portray the intermediate activities.  This portion has exhibits portraying things such as: confidence course training; pugil stick training; a life-size diorama of the evolution of marksmanship training from WW I to present day and contains displays of service rifles used by Solders throughout the years:  M1898 Krag-Jorgensen 30-40 cal bolt action rifle; M1903 Springfield 30-06 cal bolt action rifle; M1917 Enfield 30-06 cal bolt action rifle (used by US Soldiers in WW I); M-1 Garand 30-06 cal semi-automatic rifle; 30 cal semi-automatic carbie; M-14 7.62mm semi-automatic rifle; M-16 5.56mm semi-automatic rifle.  \n\n12.c.  Blue phase.  These exhibits portray the final activities of recruit training.  This portion has:  exhibit containing individual Soldier’s fighting load – 1910, 1945 and 1985; some small scale dioramas depicting trench warfare training of WW I, a Vietnam War training camp, and a modern urban warfare training facility.  This portion of the museum also contains some very nice weapons displays of:  anti-tank weapons, machineguns and specialized weapons (M2897 Winchester shotgun, M1918A1 Browning Automatic Rifle, M1A1 Thompson submachinegun, M3 45cal submachinegun, Colt M1911A1 semiautomatic pistol, M1917 .45 cal revolver).\n\n13.  Outdoor exhibits.  All of these items are in very good condition.  As best as I could, I have listed these in chronological order with respect to their times of employment.\n\n13.a.  M3-A1 Armored Scout Car.  WW II.  50cal machinegun, 2 x 7.62mm machinegun.  Crew-2, Passengers-6.\n\n13.b.  M3 Anti-tank gun.  WW II.  37mm\n\n13.c.  M4A-3E8 Sherman Tank.  WW II & Korean War.  76mm main gun; 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.d.  M-26 Pershing Tank.  WW II & Korean War.  90mm main gun, 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.e.  M15-A1 Gun Motor Carriage.  WW II & Korean War.  37mm anti-aircraft/artillery, 2 x 50cal machinegun.  This appears to be a modified “half-track”.\n\n13.f.  M4-A1 Walker Bulldog Tank.  Korean War.  76mm main gun, 50cal machinegun, 2 x 7.62mm machinegun.\n\n13.g.  T-30 Heavy Tank prototype.  155mm main gun, 2 x 50cal machinegun, 2 x 7.62mm machinegun.  From my research, this is an extremely rare tank; there seem to be only three prototypes remaining; the others are at Fort Benning (Columbus, GA) and Detroit Arsenal (Warren Michigan).\n\n13.h.  M84 mortar carrier.   1956-1981.  4.2” mortar, 50 cal machinegun.  This is a tracked vehicle (similar in appearance to the M113 armored personnel carrier.  It has a crew of 6.\n\n13.i.  M37 Cargo Truck.  Vietnam War.  Crew-2.  Capacity.  1 ton.\n\n13.j.  M114 Command Carrier.  Vietnam War.  50cal machinegun, 7.62mm machinegun.  This is a very small armored vehicle; from the information on the placard, I can only assume that it’s purpose is to place the Commanding Officer of a unit (and possibly two others) near the front lines in order to affect the battle.\n\n13.k.  M27-4A1 Platform Truck (Mechanical Mule).  Vietnam war – early 1980s.  This is a very simple and unique vehicle.  It had a 17 hp engine and could carry ½ ton of cargo.  It was used for multiple tasks such as:  transporting ammunition and rations, laying field wire and could also mount a 106mm recoilless rifle.  After touring multiple military museums, I have only come across three others (and they were in very poor condition); these two are under a covered pavilion and are in very good condition.\n\n13.l.  Bell UH-1B (Huey) Utility Helicopter.  Vietnam War. \n\n13.m.  4-5 jeeps of different vintage and configurations\n\n14. Handicap access. I am not handicapped but understand that this can affect someone's decision whether or not to visit a site/attraction. Visitors who are wheelchair-bound or have difficulty walking can access the museum with little/no difficulty.  There is a ramp at the museum’s entrance and ramps between all of the different portions of the museum.\n\n15. Child friendliness.  This attraction is child friendly.  There are even a couple of hands on exhibits where patrons can handle replicas (M-16 rifle, M-1 rifle, hand grenade).\n\n15.a.  I do not have children and on the day of my visit, there were \n approximately 2 small children (with their parents).\n\n15.b.  I would remind parents and teachers (of school groups) that this is a museum and not a playground; loud & un-restrained actions detract from the enjoyment of others.\n\n16. Amenities/creature comforts.  Food & drinks are not permitted in the areas of the museum that contain exhibits.\n\n16.a.  Restrooms.  There are restrooms near the museum entrance.\n\n16.b.  Water fountains.  There is a water fountain near the museum entrance.\n\n16.c.  Food & beverages.  NA.\n\n16. Gift shop.  NA.\n\n17.  If you are in the mood for an extended trip, I can personally recommend a 2 ½ hour detour to Charleston, SC to visit the Patriots Point Naval & Maritime museum; Mount Pleasant, South Carolina (near Charleston).  There are three US Navy vessels here:  USS Yorktown - aircraft carrier; USS Laffey – destroyer; USS Clamagore – submarine.  They have several pristine World War II aircraft in the hangar deck indoors and approximately 12 1950s-1980s aircraft on the flight deck outdoors.",
  "...Only people with access can enter...I traveled there for an event I had to attend and the time there was very much appreciated. There's several places to visit on the base to keep the family visit while spending time with your loved ones. Theres several museums that are quote interesting and places to have family fun such as bowling, pool table and many other sites that you can take advantage of visiting.",
  "NOTE - base access is required in order to visit this museum.  If you're unsure of your access, I highly recommend you contact Base security for details.\n\nThe vast majority of people reading this review are probably family and friends of soldiers-in-training.  Fort Jackson is a major Army recruit training command, and hosts a recruit graduation almost every week of the year.  An important part of this event is Family Day.  \"Your\" Soldier will be able to spend time with you, touring you around the base.  They will probably be very eager to guide you through the Museum - it's one of the \"must sees\" on Family Day.  How much time will it take?  Your call - anywhere between 20 minutes (you'll miss a lot) to two hours (you'll need a rest).\n\nAlthough this is not a HUGE museum, it is provides an excellent overview of Army recruit training through the years.  Detailed visual displays tell the history of Camp Jackson/Fort Jackson.  Another section detailing the history of Drill Sergeant training - the senior enlisted members of the US Army who are responsible for developing your person into an American soldier.\n\nBut  your soldier will really be \"in their element\" when they guide you through the phases (Red, White, and Blue) of THEIR training.  Numerous visual displays enhance the tour.  Several \"hands-on\" training aids draw attention, particularly from younger siblings.  Watch your soldier as they explain items and events (sometimes in excruciatingly long detail) occurring during their basic training.  Notice how proud they are?  How confident they appear?  A Drill Sergeant helped build those traits.\n\nThere are also several eye-catching outdoor static displays located in front of AND behind the Museum: tanks; artillery pieces, jeeps,etc.  Finally, perhaps nicest of all, several shaded patio tables offer a spot to sit, rest and regroup.",
  "We took our grandson and he loved it.  They had a paper for you to find different things and he had so  much fun doing it.",
  "A well kept museum of military history, an must see to understand the sacrifice and dedication of those who have served\n\n•“Those who don't know history are doomed to repeat it.” ― Edmund Burke"
 ]
},{
 "name": "Five Points",
 "address": "Intersection of Greene St. and Harden St.",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/26/9f/9f/five-points.jpg",
 "tags": [
  "food",
  "cheap",
  "walking",
  "kids",
  "unique",
  "historic",
  "food",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d3195156-Reviews-Five_Points-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "While parking can be tough at busiest tumes, Five Points has a fun, funky vibe worth taking in. There are lots of places to grab coffee or a meal from chains like Starbucks or Salsaritas to non chains like Rise or Blue Cactus Cafe. Lots of small shops as well. Don't miss the Hootie & the Blowfish Sculpture. Hmm--what is it?",
  "You will find a mixture of people in 5 points and they have lots of cameras up now for safety due to a lot of fights that happen with the college kids.  The area has tons of bars all walking distance and cheap drinks.  As your walking you can get some food from a local vendor selling basically chicken on a stick that is grilled right there in front of you.  They have a lot of festivals that happen in this area especially with the fountain.  The fountain turns green for St. Patricks and Blue for Autism.  There is tons of little hidden eating spots on the side roads off of the main road and little shops to buy clothing, running shops, recording studio, wine, and cigars.  It is a great place to go with your friends, girlfriends, or just a few randoms for adult time.  If you take children go early of course because any festivals and events typically turn into a beer festival.",
  "Look for the wonderful fountains that anchor this neighborhood area that has lots of unique restaurant and shopping services.  Pedestrian friendly and lots of local character. ",
  "A well preserved historic area with lots of great shops and restaurants catering to foot traffic. We spent a pleasant December afternoon perusing the boutiques and had a great lunch at the Gourmet.  Only wish we had more time to explore.",
  "Plenty of pleasant stores including flower shop, shoe repairs, clothing, barbershop, gourmet food as well as dining alternatives. There are a couple of fountains and clean sidewalks. There is plenty of parking. There is a supermarket as well as a post office and drugstore. There are banks and ATMs.\nTake a stroll in the fall.",
  "Lots of stores and eating places here.  Store owners and staff are nice and helpful.  Plan on spending around an hour and a half.  Some stores are a bit pricey.  ",
  "What a waste of a beautiful, historic area. Full of drunks, homeless, beggers, nasty streets and walks.",
  "We live near 5 Points and feel quite lucky to be near a variety of restaurants, stores, craft shops, drug stores, bars.  The area has community activities that bring together a variety of residences including university students.  Convenient for most shopping. We find almost everything in a great community.  Christmas decorations and murals always lighten up the center of the area.  "
 ]
},{
 "name": "African American History Monument",
 "address": "1100 Gervais St South Carolina State House Grounds",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/c1/5e/fa/african-american-monument.jpg",
 "tags": [
  "history",
  "walk",
  "walk",
  "walk",
  "history",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d7987770-Reviews-African_American_History_Monument-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "When I first saw on this website that people were recommending a visit to a specific monument I was a little surprised.  But, my husband and I stopped by there on a recent Saturday morning and we were so, so, so glad that we did.  This is a well done & powerful monument.  My husband and I are big believers in the idea that erasing history isn't the appropriate way to deal with it.  The State House grounds have several very large monuments to Confederate-related people or groups of people.  Presumably, to even the history out a little bit, they added this monument. It is powerful, educational and stunning.  It shows the African-American role in South Carolina's history from the first slave ship's arrival up until modern day.  There is information about which specific African nations most of the South Carolina slaves came from.  When you are in Columbia, be sure to take an hour to walk the State House grounds (all of it is worth seeing) and do not miss the chance to stand and contemplate history at the African American History Monument.",
  "Worth a trip to the State Capital to see this monument.  It depicts slavery to current day. Interesting sculpture that both explicitly and  subtly illustrates fact and emotions.\n\nCombine with a walk through the building with beautiful architecture and a stroll through park like grounds to spend anywhere from 30 minutes to a couple of hours.\n\nHighly recommended.",
  "Worth a trip to the State Capital to see this monument.  It depicts slavery to current day. Interesting sculpture that both explicitly and  subtly illustrates fact and emotions.\n\nCombine with a walk through the building with beautiful architecture and a stroll through park like grounds to spend anywhere from 30 minutes to a couple of hours.\n\nHighly recommended.",
  "The African-American History Monument is on the north side of the State House. It is a well done monument with bronze reliefs and an obelisk. It memorializes the achievements of African-Americans in South Carolina and is one of the many memorials to keep your eyes open for while  strolling through the State House grounds.",
  "When I first saw on this website that people were recommending a visit to a specific monument I was a little surprised.  But, my husband and I stopped by there on a recent Saturday morning and we were so, so, so glad that we did.  This is a well done & powerful monument.  My husband and I are big believers in the idea that erasing history isn't the appropriate way to deal with it.  The State House grounds have several very large monuments to Confederate-related people or groups of people.  Presumably, to even the history out a little bit, they added this monument. It is powerful, educational and stunning.  It shows the African-American role in South Carolina's history from the first slave ship's arrival up until modern day.  There is information about which specific African nations most of the South Carolina slaves came from.  When you are in Columbia, be sure to take an hour to walk the State House grounds (all of it is worth seeing) and do not miss the chance to stand and contemplate history at the African American History Monument.",
  "Located in the heart of the city, and accessible from I-126, The African American History Monument is very moving.  The figures are highly detailed and draw you in.  We've never seen a more vivid artistic depiction of the lives of our American ancestors frozen in time and left to the silent interpretation of the visitors, who pay tribute to their contributions.  It will leave you wanting to discover more.",
  "This monument is a great tribute to African Americans.  Located near the S.C State House, this is a must see.  The workmanship is amazing.",
  "It’s a nice addition to the “mall” there’s lots of statues and monuments to see around the capital building. This one is really worth checking out. "
 ]
},{
 "name": "Founders Park",
 "address": "431 Williams",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/8f/9e/21/founders-park-columbia.jpg",
 "tags": [
  "family",
  "food",
  "kids",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d6889753-Reviews-Founders_Park-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "New and somewhat controversial Columbia development.  This area is still under development and parking can be an adventure since there are no signs and directions and the entrance keeps moving around. Otherwise it is a very nice modern ball park facility.  Be sure to figure out how you plan to leave the park because after dark the area is not lit and ruts in the surface are very hard to see.",
  "Such a nice college ball park.  Fun, family atmosphere, good parking, good food.  Will definitely go again.",
  "My daughter Savanna is only 8 years old and already a huge Gamecock fan. She literally refuses to even have any Clemson stuff in the house. She's been to basketball, soccer, football and others but this was her first gamecock baseball game. We got bleacher seats but being an early afternoon game in the middle of the week i knew we would beable to move up because everyone was working and in school. Great Stadium with great amenities for children. Was easy to access and find right in the heart of Five Points. Customer service was helpful and they even had a booth for kids to sign up for junior gamecock club, photos with Cocky, and get a certificate mailed to your house recognizing your first game. Nice playground overlooking the outfield and plenty of concession options throughout. Only real complaint is the same one i have with every sports park in America. They spend so much money on the stadiums and it seems they always forget or just outright neglect customer parking. Parking is the biggest problem and saying that means that this Stadium is customer friendly and accessible. Well be back for plenty more games. ",
  "Great place to watch a ballgame with the entire family.  If you don't like the standard \"bleacher\", there is a grass berm you can sit on. Very friendly staff and just overall beautiful ball park!  They keep you entertained even when the game is not going on.  If in town while there is a game, it's usually easy and inexpensive to find tickets!",
  "We went for a baseball game...despite the construction around it, parking is accessible and there are people to direct you to the park.  Visiblity of the game is good from any seat.  Your typical vall park food is served...it is a beautiful facility. "
 ]
},{
 "name": "Harbison State Forest",
 "address": "5500 Broad River Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/f8/6a/a2/harbison-state-forest.jpg",
 "tags": [
  "nature",
  "hike",
  "nature",
  "walking",
  "walk",
  "family",
  "hike",
  "eat",
  "nature",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d2024170-Reviews-Harbison_State_Forest-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Harbison has nature trails, visitor center and a natural area.  It is accessible and near Columbia. Good day hikes, biking, and nature walks.",
  "I have been to Harbison Forest a handful of times and always enjoyed the experience. They do have a printed trail guide for visitors located in the front parking lot as this came in very helpful for my first two hikes. Like others have stated, the trails are well marked. There could be white paint on trees or sometimes I have also seen blue squares on them as well. I hike alone and the first two visits got turned around in which way to go, but never once felt I was \"lost\" and could not make it out of the forest. If you \"look lost\" and are gazing at one of their trail maps on the trail don't be surprised if someone passes by asking if you need help which is quite nice. Fortunately I have not run upon any snakes, but have encountered a turtle, deer and many squirrels. \n\nFirebreak and Spider Woman are two of the best trails at Harbison. The view of the Broad River from Spider Woman is awesome. Harbison rates this trail as difficult and it is a challenge. In my experience mostly due to the terrain and sharp turns. There is a section going down to the Broad River where you are literally on a very narrow ledge and you could feel the gravity pulling you to the right. \n\nOverall it is a great place to visit and definitely worth the $25.00 annual fee. However, you can also purchase a day permit for $5.00. Nice place nestled within the suburbs!",
  "Love hiking here in nature.  Cooler in the summer and can really get your heart going if you keep up the pace.  Only wish it would open before 9AM",
  "We were looking for a place to mountain bike while in Columbia and found this local park. Called the # to make sure trails were open. There was a $5 per vehicle fee which was easy to pay (drop off box) - if we were local, I'd buy an annual pass. The parking area was small and we were fortunate to get there early as when we came out, there were cars parked up and down the road. The stewardship loop mountain bike trail was mostly intermediate (as described) with a few more challenging spots and had nice terrain through the forest and down to the river. Some of the forest is logged and not as pretty but other parts are quite scenic. Definitely will mtb there again next time we're in town.",
  "My husband and I stopped there looking for a place to walk our dog. We had never gone before. Great walking trails! Got an unexpected 5 mile morning trek in. Now my husband would like to try biking one of the trails!\n",
  "Whether you are mountain biking,camping or hiking with family or dogs, Harbison State Forest is a fun place to go.  We camped there years ago with Scouts.  When you are there it is a step into nature and you are taken away from the hustle and bustle of the shopping and the mall and restaurants.  I think mountain biking events are held here and we like to take our dogs for a hike.  There is a small fee to enter.  We purchased a yearly membership.  If you want to experience nature here in Columbia and see the river, head on over to Harbison , grab a bite to eat and experience nature for the afternoon.",
  "Harbison has nature trails, visitor center and a natural area.  It is accessible and near Columbia. Good day hikes, biking, and nature walks.",
  "This is a great spot for hiking. Trails are well marked and maps are available. Everything is maintained and you can pick different distances and levels of hikes."
 ]
},{
 "name": "Fort Jackson National Cemetery",
 "address": "4170 Percival Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/25/91/1d/touching-remembrance.jpg",
 "tags": [
  "family",
  "family",
  "wander",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d8129339-Reviews-Fort_Jackson_National_Cemetery-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "They greeted the family car as you enter, They treat you and your loved ones with the upmost respect. Service w. as very touching, provided some closure knowing my father was laid to rest in honor. I Love you SFC. Gibson always in our heart and minds. Never forgotten",
  "Beautifully maintained and such great services. Veterans are honored along with their friends and family. ",
  "New National Cemetery that has several features of America’s Best: Arlington. Happened to there while a memorial service was happening. It is impossible to enter these sacred grounds and leave with dry eyes. Many thanks to those who envisioned, planned, and built these amazingly well-groomed grounds.",
  "Attended a service there recently.  My heart was filled with pride for our servicemen and women who are buried there.  It is so beautiful, peaceful, immaculately clean.  Service is taken care of in an efficient, caring, respectful way and environment.  If you have not seen a National Cemetary it is worth going to see.  ",
  "We visited this over the Memorial Day holiday and I'm so glad we did. The place is immaculately well-kept, with winding roads that can be easily driven, and plenty of space to wander. There are covered areas for gathering or to get out of the heat, and the restrooms are clean. My family and I felt that this cemetery does indeed honor the fallen men and women who chose to put themselves between all of us and those who wish us harm, and there is no greater sacrifice. "
 ]
},{
 "name": "Finlay Park",
 "address": "930 Laurel St",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/8e/04/dc/finley-park.jpg",
 "tags": [
  "family",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d877777-Reviews-Finlay_Park-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "It is a lovely place with a lake, falls, birds, benches to have a rest and with a beautiful city view. It is worth a visit even if you have just a little time. It is true that there are some homeless people there, but at the \"worst\" they just greeted us nicely, and were not disturbing actually when we got there. Maybe we were lucky, but we didn't find the situation so worrisome, so don't be afraid and visit this park :)",
  "Love the skyline from the top of the park- definitely bring your camera. The swings are nice to enjoy the beautiful weather. On a busy day there might not be enough parking at the top in the parking lot.   On a good many occasions to this park, I have been hit up for money by homeless, so be prepared for that.",
  "Love the skyline from the top of the park- definitely bring your camera. The swings are nice to enjoy the beautiful weather. On a busy day there might not be enough parking at the top in the parking lot.   On a good many occasions to this park, I have been hit up for money by homeless, so be prepared for that.",
  "As previous reviews claim  -- Don't go. We visited on a hot July day and no waterfalls were in sight. The water in the pond appeared green and yes --- unfortunately, the homeless population has claimed this park as their home. Didn't feel safe and we quickly left.",
  "I lived in Columbia when this park was built.  It was a gem and beautiful (26 years ago?). The swings would overlook the entire city and you could see so much beauty.  I don’t understand how a city would actually let this happen and why they don’t do anything about restoring it.  Very sad indeed.  I went to visit over a year ago and it was heartbreaking to say the least.  The hotel on campus had a book that had the original photos of Finlay Park.",
  "This park could be beautiful if it wasnt for all the homeless, the full shopping carts of their garbage, the literal piles of clothing/garbage strewn about, and the awful stench thru out the park",
  "I saw this park on a blog and decided to take my family. Huge disappointment! No waterfall, condom wrappers and homeless people everywhere!! We walked around for a few minutes and left when we realized we were the ONLY non-homeless people. We did find another great park for kids less than 5 minutes from here. Do yourself a favor and just don't go!",
  "Its not the best but my kids love it. Even tho my 7 year kept asking why are those people sleeping on the ground during the day...."
 ]
},{
 "name": "Sea Lion Landing",
 "address": "500 Wildlife Pkwy",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/ce/87/ac/zoo.jpg",
 "tags": [
  "active",
  "walk",
  "active",
  "walk",
  "active",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54184-d10389650-Reviews-Sea_Lion_Landing-Columbia_South_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a recent addition to Riverbanks. They have many Sea Lions and they are very active. Be sure to see the educational show - it gets crowded so go early. You can walk around the top of the tank and you can go downstairs to get an underwater view. Neat sculpture down there that is made from plastic collected from the stomachs of sea animals. Powerful statement to see - my children were amazed and I think it did change their perspective about our overuse of plastics. Great exhibit to see. This is located on the left as soon as you walk in main gate. Sea Otters, Bears and Lions are on right. Don't miss seeing the baby Gorillas during your visit either.",
  "This is a recent addition to Riverbanks. They have many Sea Lions and they are very active. Be sure to see the educational show - it gets crowded so go early. You can walk around the top of the tank and you can go downstairs to get an underwater view. Neat sculpture down there that is made from plastic collected from the stomachs of sea animals. Powerful statement to see - my children were amazed and I think it did change their perspective about our overuse of plastics. Great exhibit to see. This is located on the left as soon as you walk in main gate. Sea Otters, Bears and Lions are on right. Don't miss seeing the baby Gorillas during your visit either.",
  "I have frequented Riverbanks Zoo for many years as a patron, volunteer and employee. While not the biggest zoo, it is well designed and very welcoming and entertaining. This is by far one of their best exhibits. When I first started going in the 90s, they had a sea lion exhibit that was very basic and akin to a pool rimmed in a railing for viewers to look down into the tank. After a while they moved the sea lions and put up a lemur exhibit. \n\nIn 2015/2016 they constructed and opened the new Sea Lion exhibit. It is fantastic. It is a large pool with several outdoor and indoor windows into the tank so no matter where you or the sea lions are, you can see them swimming around. Outside viewing options are a set of covered bleachers or an upper deck that is wheelchair accessible. There is a snack stand located on the upper deck. \n\nThe seal lions actual 'housing' is a red building with a dock and a deck that the sea lions can jump onto.\n\nBelow the upper deck is an interior viewing room. Here one can go down a set of steps to be 'immersed' in the tank. floor to ceiling viewing panes allow you to see the sea lions up close and personal as they swim around. The panes here are contoured, giving you sometimes suddenly delightful 'drive bys' of the animals.  There is also seating down on this level so you can just relax for a few minutes and watch the action.\n\nYou can watch the sea lion feeding training at scheduled times. It is quite entertaining. When I went we watched a male and female sea lion and a harbor seal being trained. They barked, fetched, shook fins, roled over, dove and more. It was educational and entertaining. I suggest watching the harbor seal when he shuffles across the deck. He does an adorable blubbery little wiggle that it is sure to bring a smile to your face. For best viewing results, stand on the upper deck or any where above the water line as most tricks are performed on the platform. ",
  "Wonderful to have sea lions at Riverbanks,  So much care is taken in creating their habitat. Riverbanks staff is among the best in the coutnry.",
  "This is a recent addition to Riverbanks. They have many Sea Lions and they are very active. Be sure to see the educational show - it gets crowded so go early. You can walk around the top of the tank and you can go downstairs to get an underwater view. Neat sculpture down there that is made from plastic collected from the stomachs of sea animals. Powerful statement to see - my children were amazed and I think it did change their perspective about our overuse of plastics. Great exhibit to see. This is located on the left as soon as you walk in main gate. Sea Otters, Bears and Lions are on right. Don't miss seeing the baby Gorillas during your visit either.",
  "All the handlers were very professional and caring.  The announcer even walked around to individually ask us if we had any questions and answered some of our own about the sea lions.  The animals looked happy and playful like pups!",
  "Up close and personal.  Sounds of the sea in the background make the experience more enjoyable.  The sea lions appear to be very comfortable in this environment.",
  "Riverbanks Zoo consistently ranks among the best in the country, and Sea Lion landing is a wonderful addition! The architecture is particularly striking--definitely designed to highlight the beauty and majesty of these creatures as they swim and frolic. The dappled sunlight comes in through the water and strikes the blue floor. The huge window allows even the tiniest of tots to get a great look at the swimming sea lions.The statues made of recycled objects will (I hope) help visitors remember to cut down on their use of plastic, especially single-use plastic, lest our oceans wind up being trash cans."
 ]
}]
