[
{
 "name": "New Hampshire State House",
 "address": "107 N Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/53/53/2f/gorgeous-state-house.jpg",
 "tags": [
  "free",
  "history",
  "walk",
  "educate",
  "history",
  "art",
  "history",
  "walk",
  "history",
  "walk",
  "tour",
  "historic",
  "library",
  "walk",
  "wander",
  "history",
  "historic",
  "tour",
  "knowledgeable",
  "history",
  "tour",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109532-Reviews-New_Hampshire_State_House-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "The beauty of this piece of history flows from the golden dome on the outside to senate chambers and every nook and cranny of this gem.  As you walk into the hall of flags you can feel the sense of history all around you.  Meander around the building and experience the beauty of every room open to the public.  Hats off to the friends of the state house who help to educate the visitors and maintain the pristine beauty of this masterpiece. Best of all it's free.",
  "New Hampshire is still a small state by population, as it was when the nation was born.  Thus, it has only modestly enlarged the capitol building since the original portion was constructed in the early nineteenth century.\nMaryland has the oldest capitol in continuous use (by about 40 years), but New Hampshire has kept their original chambers, and the senate, which was the only one accessible on our visit, is beautiful and gives a surprisingly convincing idea of what it was like in the past.\nThe lobby displays battle flags, mostly from the Civil War, making it a special attraction for history buffs.  And, the gift shop has a small display of campaign stickers and pins, paying tribute to New Hampshire's \"first in the nation\" primary. ",
  "We found this state capitol building full of history, with stunning artwork and displays. We were able to walk around freely, enjoy the art and displays, and visit the House of Representatives and the Senate. Everyone was very friendly, especially the man and woman working in the gift shop. Our 5 year old son collects state flags, they were out of New Hampshire flags, so the lady directed us to Flag Works, down the street, where he found his NH flag:) We really enjoyed our visit here and highly recommend it to everyone!",
  "Walk where you want, when you want.  No charge and no hassle.  Tons of history all over the place.  You are generally self-guided (unless you are in elementary school) so read what you want.",
  "See the statues of Franklin Pierce, Daniel Webster, and John Stark on the grounds of the State House, admire the gold dome, and then step inside for a self-guided tour of the capitol building.  The building design is formal, but the feel is casual and friendly.  A tour brochure is easily available providing guests with the ability to tour at their own pace.  We especially liked the murals and windows in the senate room and the portraits in the house of representatives.  One interesting fact is that it is the oldest State House in the country in which the legislature still meets in the original chambers.\n  \nAfter touring the capitol, walk around the few blocks of town to see more beautiful architecture in the state library, a legislative building, nearby churches, and historic storefronts.",
  "Wander the capitol building; so many amazing paintings and rooms the Senate CHambers esp.); the Hall of Flags is interesting for everybody. The legislature is large and unwieldy and puts on quite a show if you arrive on a session day. There is a legislative cafeteria in the basement where you can people watch over a coffee. Even if you don't see the 4th largest body in the world haranguing each other, you will enjoy the quirks of this great old building and all its history. The landscaping -- trees that were gifts of the Japanese for an important treaty negotiation, sculpture, arches, lilacs, benches, monuments, and lawn are pleasant.",
  "In contrast to many public buildings, the NH state house remains open and welcoming. Volunteer greeters met us at the entrance, and we chose to guide ourselves. To the right is a souvenir shop that doubles as an historic site in itself. On one wall are campaign stickers and buttons from former electoral campaigns, including those of lesser-known candidates. One of the volunteers in the shop spoke fluent French, an added plus for our northern neighbors and many from overseas. On a side alcove were dioramas of earlier historic battles. Some may find them interesting in themselves; I found them interesting for insight into what their creators, some from the 1930s, thought about how to represent the past. On the upper floors one had access to the chambers of the house of representatives, perhaps the largest of all states with (if I recall correctly) 400 delegates, each paid $200 for a two-year term. Senators, not delegates, shared offices. There are perhaps 200 photographs and portraits of senators, representatives, and politicians from earlier eras, nine of which are women. The language describing these past electoral heroes is often fascinating. Suicides are recorded, for example, and business ventures, not always successful. There's a basement cafeteria open to all those who can pay, and in front of the building an attractive open square. ",
  "We stopped in for a visit at the NH State House, got a short tour with a knowledgeable volunteer for an hour well spent.  Highly recommend this!",
  "We recently completed visiting all 50 state capitols.  Having consulted to New Hampshire's governor in the early 1980s, I had the opportunity to see all areas of the state house.  It has an interesting history and worth visiting.  However, architecturally, it lacks the majesty of many other state houses and it's grounds are far less expansive to other capitols.",
  "We visited this place on October 18. If you want a guided tour you have to be a group of at least 10 persons. Couples and singles can ask a brochure to use for the self guided tour. In the senate is a little desk that is used by the presidents candidates to inscribe their name on the ballot.",
  "\nConcord, NH is full of history and grand architecture.  The state house is among several historic buildings.\n"
 ]
},{
 "name": "Red River Theatres",
 "address": "11 S Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/3b/16/ad/red-river-theatres.jpg",
 "tags": [
  "theatre",
  "affordable",
  "theatre",
  "independent",
  "theatre",
  "independent",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d4283481-Reviews-Red_River_Theatres-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I've always wanted to see a movie here and was able to attend a showing of 'Little Women' after the Oscars.  The facility was clean, friendly, and offered some great snacks.  I definitely would go again.",
  "The lobby area is well laid out has plenty of room and is staffed by friendly and welcoming, mature staff (unlike most movie theatres that employ young teens and have a crowded noisy and sometimes unattractive lobby).  The theatre seats are very comfortable and recline. The seating arrangements are such that you don't have a problem viewing the movie when someone sits directly in front of you. Lastly, many movies shown are not shown in the major theatres where only major productions with a potential for huge audiences .",
  "My wife and I come to the theatre quite often... and while I write reviews of my frequent  travels, I tend to overlook what is right in my backyard. \n\nRed River Theatre is a smallish, independent theatre in downtown Concord... and it is one of the city’s gems. It is brilliantly located, adjoining the new Hotel Concord, the always marvelous O, Steaks & Seafood Restaurant (I just love their lobster mac and cheese!), and the Capital Commons garage, among other choice in-town amenities.\n\nIt’s especially nice after a meal because you can go to the concessions stand and purchase a glass of wine to savor with your movie (or a beer, if you prefer!)\n\nThe theatre offers first-run movies, independent films, classics, and (in the summer) the occasional outdoor movie... all at an affordable price (and if you are a sustaining member it’s even cheaper!). The seats are pretty comfy and there is ample leg room (even for a big guy, like me).\n\nIf you haven’t been to RRT yet, give them a try... you’ll be glad you did!",
  "This movie theatre caters to mostly independent films with good reviews. They are community-based & encourage membership which includes discounted tickets. Beer & wine choices. Comfy stadium seating.",
  "We went there to see Aretha Franklin's movie. Though I live in MA I go to N.H. quite a bit but have never gone to this theater. Very homey theater and a very comfortable feel to the place. The attendants were knowledgeable which was a pleasant surprise for a movie theater. The theater in itself was smaller in size with comfy seats and enough room for your knees etc. Easy in and easy out with Main St. right there for dinner or a light snack."
 ]
},{
 "name": "Carter Hill Orchard",
 "address": "73 Carter Hill Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/da/22/d4/carter-hill-orchard.jpg",
 "tags": [
  "walk",
  "walking",
  "delicious",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d5041814-Reviews-Carter_Hill_Orchard-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "On the Concord / Canterbury line.  Carter Hill orchard also raises and sells other vegetables at their farm stand. They have a good selection of apple varieties to pick or buy at the farm stand. Also sell home made pies and other local products.  They also grow peaches. The trees cover a hill which can accessed via a tractor pulled wagon if the walk is a bit much. The also have picnic tables and a play area for children.",
  "We stopped on the way to the hotel and fell in love with the donuts, cider and maple candy. We are stopping again in the morning!",
  "I really enjoyed\nMy time here - great view, peaceful walking among the trees, delicious apples, and great gift store !",
  "this orchard has a great variety of apples and vegetables. try the cider and fresh apple cider donuts. the views from the observation deck are amazing on a clear crisp autumn day. ",
  "We visit Carter Hill Orchard regularly when they are open for apples and other fruit, or pumpkins and squash at Halloween.  Just about every weekend in the fall we visit and get a little bag of cider-donuts, a small jug of apple cider, and climb the  birdwatching tower (right off the parking lot) to look at the distant mountains and watch for birds. \nYou can buy bags of apples or pick your own;  family groups often come here.  There is a large playground area between the parking lot and the orchard."
 ]
},{
 "name": "Capitol Center for the Arts",
 "address": "44 S Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/e6/3c/ae/capitol-center-for-the.jpg",
 "tags": [
  "historic",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109542-Reviews-Capitol_Center_for_the_Arts-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Old historic building with lots of history, restored and with great shows.  If you see anything of interest, check it out.",
  "I visited the Center last year to see Grace Potter, and this time it was for the comedian Lewis Black.  We had very good orchestra seats, and enjoyed an excellent show.  The Center is modern, with comfortable seats, good acoustics, and a pleasant staff.  There was adequate parking about one block from the Center, and was easy to walk to and from.  A very nice place to see live performances.",
  "The best of Broadway, concerts, comedy and smaller venues in Governors Hall, this is simply the very best.  With great and exciting plans for the future, CCANH makes Concord a destination.  Check out their web page and buy tickets.  They are also great for special events in their Kimball House Mansion.  Well run, great people and they know their business...Show Business.\nJust saw John Cleese, witty, clever and thoroughly entertaining.",
  "Went here on a Saturday night to see a comedian.  Entrance was easy to find.  Staff at the entrance to ensure safe entrance.  Easy access to staff to scan our tickets.  Bathrooms are easy to access.  They offer beer, wine and soda in the furthest room.  You can bring drinks into the theater.  Theater is beautiful in history.  Acoustics were fine.  ",
  "Beautiful venue - very clean, and I don’t think there’s a bad seat in the house. The sound was great - would definitely recommend. ",
  "We saw Jesse Cook here and what a terrific show.   I like that you can get a beer or wine before the show and during intermission.   The pizza smelled good too but we didn't try it.   Seating is a bit tight but so are most small venues.  Acoustics were excellent and so was the show.  Not a bad seat in the house unless you have someone's huge head in front of you.  So glad there was an open seat on the end to move to!",
  "Nice place with loads of volunteer ushers everywhere. Super helpful making it easy to find seats.  Drinks were privy even for an arts center.  I know it is about raising money but one beer should not cost double a six pack. Most shows are pretty highbrow but some are ok.  Very expensive.  More than Manchester & Portsmouth, NH venues. Seats on the floor are very flat making viewing poor unless you are in the front.  Balcony was also not as steep as similar venues in NH.  Worth the drive to go to Portsmouth or Manchester to see a show if they have what you want.",
  "I love capital center of arts for lots of reasons. It's located downtown in the capital area. Easy to find pleasant people to help out with questions every seat is a great view. Acoustics are great for contests. "
 ]
},{
 "name": "Susan N. McLane Audubon Center and Silk Farm Wildlife Sanctuary",
 "address": "84 Silk Farm Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/85/f1/f5/board-walk.jpg",
 "tags": [
  "kids",
  "nature",
  "nature",
  "walk",
  "nature",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109545-Reviews-Susan_N_McLane_Audubon_Center_and_Silk_Farm_Wildlife_Sanctuary-Concord_New_Hampshir.html",
 "source": "TripAdvisor",
 "reviews": [
  "Good little nature center for young kids.  A couple of rooms with taxidermy displays as well as live tanks.  Live birds of prey.  Short manageable hiking trails.  Gift shop.",
  "We stopped at this nature preserve on a quiet July 4th; having the trails pretty much to ourselves.  The trails are scenic and not too steep, so anyone could walk them.  There were several lakefront viewing platforms that provided good views of the water & the birds.",
  "Just a few minutes off the highway, the Audubon Center is a \"must-see\" for nature lovers. There are several well maintained hiking trails. We took the yellow trail through a beautiful woodland to the pond. The trail is well marked and mostly level,  but the protruding roots and rocks demand hikers' attention. In the welcome center there is a classroom where visitors can get up close to study preserved animals. This was one of my favorite spots. There is also a building in the back where injured raptor are housed. The 90 minutes we were here were well spent. Our thanks to those who care for this land and it's animals.",
  "Interesting, quiet.  Loved seeing the animals you have there.  Keep up the good work.  Staff was very friendly.",
  "We went here to hike. Just as we were about to start on the trail, two groups of summer campers came out of the wilderness. The trail we followed was very quiet. No creatures were stirring. We saw why this state is nicknamed the Granite State."
 ]
},{
 "name": "McAuliffe-Shepard Discovery Center",
 "address": "2 Institute Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/e2/03/bb/mcauliffe-shepard-discovery.jpg",
 "tags": [
  "active",
  "learn",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109539-Reviews-McAuliffe_Shepard_Discovery_Center-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I visited the McAuliffe-Shepard Discovery Center in early June and was pleasantly surprised.  The show in the planetarium was perfect for young children, with whom I was visiting.  The employees were present and available for questions.  The hands on activities were spectacular.",
  "This space museum concentrates on the contributions of New Hampshire astronauts Christa McAuliffe & Alan Shepard.  Most of the artifacts are related to one of them.  The fine displays in the museum focus on manned spaceflight; and its been a few years since some o them were updated (the displays still refer to the Space Shuttle as an active program).  There's also a good planetarium show for additional cost; we saw a good film on extreme space weather.  Still a good place to spend a couple of hours if your are interested in space & science.",
  "Those old enough to remember where they were the day of the Challenger disaster will have a special level of appreciation for this center.\nNamed for Christa McAuliffe, a Concord, NH teacher, and Alan Shepard, this discovery center offers truly hands-on and interactive exhibits.\nYou can create your own weather-cast, try your hands at landing a space shuttle in a life-size replica and learn about the science of space.  Truly, a fantastic stop when you are in town.",
  "I visited the McAuliffe-Shepard Discovery Center in early June and was pleasantly surprised.  The show in the planetarium was perfect for young children, with whom I was visiting.  The employees were present and available for questions.  The hands on activities were spectacular.",
  "A great museum for to enjoy. The space is open and not corward to move at different places. Two hours start to finsh.",
  "I  took my two grandchildren ages 8 and 11. Sadly they were bored. The planetarium show we watched had already been seen by both of them in school, which I paid $15 for. There was a weird odor in the room and the seats were all taped up. The flight simulator told them what to do..... but it did not work! They bombed out. A few other displays didn't work. The employees tried to make it a rewarding experience though, and thank goodness for them. But would I go back yet again? NO! The cost of admission is too much for what you don't get. Sad that this has fizzeled out!",
  "Terrific aerospace museum and wonderful planetarium with lots of different viewing options. Very enjoyable visit with tweens and teens.",
  "We were very interested in learning more about Christa McAuliffe’s travel on the space shuttle. There seemed to be little information about her untimely death. When we inquired, we were told that the museum downplays that. We felt that this was part of her story and her sacrifice should be honoured.\n\nThere was a lot of information about Alan Shepard, which we enjoyed. There is a small gift shop on site. The staff here were very friendly and encouraged us to try the flight simulator. \n\nWe thought the admission price was expensive. It was about $11.00 per senior and they do offer a dollar off for AAA/CAA. The parking for this museum was free. We are glad we went, but probably would not go back."
 ]
},{
 "name": "Concord Craft Brewing Company",
 "address": "117 Storrs St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/6f/c4/4a/storefront.jpg",
 "tags": [
  "tour",
  "brewery",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d12116823-Reviews-Concord_Craft_Brewing_Company-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place, friendly staff, amazing beer.  Lucky enough to be there on the release day for their 3rd anniversary beer.  It was good enough to buy more to bring home.  A must stop for beer lovers in Concord.",
  "I went here close to closing.  Easy to find, on street parking.  Building was nice.  The staff was great and attentive.  Beer was fantastic. I will be back!",
  "As a home brewer and veteran of many craft breweries, I can say these guys really know how to brew.  Everything I had was good, and the Barrel Aged Maple Brown was one of the best I've had in the area.",
  "Great place, friendly staff, amazing beer.  Lucky enough to be there on the release day for their 3rd anniversary beer.  It was good enough to buy more to bring home.  A must stop for beer lovers in Concord.",
  "Im not a fan of beer however they head slushies made with beer that were pretty good. Really laid back atmosphere and the staff was really nice and accomodating. My friend is a beer connoisseur and really enjoyed trying the beers made right there in the brewery. We even got a tour of the brewery. Pretty cool to see how its made.",
  "Visited on a Tuesday evening around 5:30. Small bar inside is nearly full, but several open tables.\nThe space is long and narrow, but fairly small. There is a long, granite wall on one side of the space that makes it feel like a cellar.\n\nConcord craft is evidently “dog friendly” which, as much as I love dogs, is always annoying to me. I mind less at outdoor venues, but having animals indoors always seems to invite trouble. I observed the usual mild scuffles and bouts of barking.\nNot everyone wants to be subjected to this, in fact, many are afraid of dogs, but that seems to be no deterrent to the entitled, man bun types you encounter virtually everywhere now.\n\nThe real problem for me was poor service.\nFirst off, there was one bartender in the place. She was pleasant enough when I finally got her attention, but it took her nearly 15 minutes to acknowledge my presence. \nI almost left.\nSecond, there is no system or order or retail area where one can buy beer or merch. You basically stand behind the bar patrons hoping the bartender will notice you.\nSeveral people, myself included, stood at various points around the bar waiting to be served. Some of these people managed to get service before I did, despite my being there longer. This I blame on an inexperienced bartender.\nShe did have some great tattoos though.\n\nWe each drank two different double IPAs, When Rhinos Fly, and The Guvnah, and while both were fine, they were certainly not unique. The drafts were $6 each, which we found reasonable, the cans for sale seemed steep. While the cans In the cooler had no prices on them, we watched a woman pay nearly $100 for a case.\nOnly a handful of breweries can justify prices like that.\nThis is not one of them.\n\nGiven my overall experience here, probably not worth another visit.",
  "I was so happy that I could bring my dog inside! The beers are good and the staff is always friendly. ",
  "I went here close to closing.  Easy to find, on street parking.  Building was nice.  The staff was great and attentive.  Beer was fantastic. I will be back!"
 ]
},{
 "name": "Winant Park Hiking Trails",
 "address": "Fisk Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/e9/cf/a9/winant-park-trails-map.jpg",
 "tags": [
  "hike",
  "field",
  "hike",
  "hike",
  "family",
  "hike",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d10231023-Reviews-Winant_Park_Hiking_Trails-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Always a pleasure to enjoy being in the woods in the middle of town! You can see the state capital building on one side and ski mountains from the other!",
  "When you arrive at the Fisk Road parking lot, there are actually two trail entrances. The one over the bridge by the little pagoda is the *real* entrance to Winant park. The other trail, marked in red right off the parking lot, is a connector trail to another hike.\n\nAfter reading the other reviews, I expected some really nice scenery, There are exactly two spots where you sort of get a nice view, both on the red loop. You *must* take the white trail to connect to any of the others, and they are all very short. I did all the trails except the blue trail in under an hour. \n\nYou would think that the yellow trail to the water tower takes you to a lookout. You would be incorrect (I was). The water tower is situated in a field surrounded by trees. It is uphill back, not there. The orange trail is steep-- I did it downhill. \n\nAll in all, it's a good way to get exercise and breathe fresh air, assuming your goal isn't breathtaking vistas or a really special unique-to-Concord experience.",
  "There are three trails to choose from.  Signage is good.  Most of the hiking from the parking lot is UP.  The elevation increase might be difficult for some.  Best news, the return hike is downhill.  Scenery is very nice and peaceful.",
  "My family and I decided to hike here on a beautiful Sunday morning, and it was quite a treat!  Blazes clearly marked all trails, which were also color-coded.  The trail map was very easy to follow as well.  The trails themselves are very well-kept, relatively smooth, and well-marked.  \n\nThe trail distances were surprisingly short in length, and a few points offer great lookouts of Concord to the east and the mountains to the west.  It's also a very dog friendly place!  Our pups loved romping around and playing on the trails.  \n\nGreat trail system...highly recommend for anyone!",
  "Had a chance to visit the extensive set of walking trails on southern edge of Concord (near St. Joseph's School) that stretch for miles into the woods.  The trails' steepness range from easy to somewhat hilly; I'd wear good walking shoes & insect repellent.  Off street parking is available in several areas, and the trails are well-marked.  The Concord Recreation Department has on-line maps available, so they trails are all easy to follow.  Most trails had scenic highlights - such as hilltop views of nearby lakes - to make the hike up worthwhile."
 ]
},{
 "name": "New Hampshire Historical Society",
 "address": "30 Park St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/d2/04/3f/new-hampshire-historical.jpg",
 "tags": [
  "tour",
  "history",
  "library",
  "history",
  "tour",
  "history",
  "tour",
  "library",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109536-Reviews-New_Hampshire_Historical_Society-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Many interesting items from Indian artifacts to civil war items. Beautiful New Hampshire paintings. Recommend tour with docent since there is so much history associated with displays.",
  "I did not have time to visit the museum, but I do need to rave about the library and archives there! If you're doing genealogy or other New Hampshire research you need to make sure you pay a visit here. They have great collections of original primary source materials and hard to find books. I spent much of a day there and peppered staff with questions and kept them hopping all day. They remained courteous and helpful through out!  I made a lot of great discoveries there.",
  "A nice visit and beautiful building.  We enjoyed learning about the architecture and the White Mountain Paintings exhibit.\n",
  "We visited this place on October 18. It has one room with artifacts connected to the history of New Hampshire. The best part is the architecture of the interior of the building.",
  "Many interesting items from Indian artifacts to civil war items. Beautiful New Hampshire paintings. Recommend tour with docent since there is so much history associated with displays.",
  "It won’t take long to tour this museum but it was nice. My favorite thing was the “egg” that was discovered in an excavation in Meredith enclosed in clay.  Be careful of location there are erroneous addresses in google.",
  "I did not have time to visit the museum, but I do need to rave about the library and archives there! If you're doing genealogy or other New Hampshire research you need to make sure you pay a visit here. They have great collections of original primary source materials and hard to find books. I spent much of a day there and peppered staff with questions and kept them hopping all day. They remained courteous and helpful through out!  I made a lot of great discoveries there.",
  "This museum is kept well, clean and easy to navigate. We expected more on the history of New Hampshire and it's evolution, though. This museum had some exhibits that collected items, but didn't so much make us feel like we learned a great deal about the history of the state as most capital city historical museums offer."
 ]
},{
 "name": "Concord Antique Gallery",
 "address": "97 Storrs St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/50/58/e9/the-mall.jpg",
 "tags": [
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d4589818-Reviews-Concord_Antique_Gallery-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Off Main Street, down Depot St., at the corner on Storrs St., this is a two-level multi-dealer shop with tons of things to take you down memory lane.  If you want 17th or 18th century stuff, go elsewhere.  If you want late 1800s through 1900s, this is the place.  The stuff we grew up with, so there are tons of memories in every aisle.  Prices vary depending upon dealer.\n\nThe staff are super helpful and take good care in wrapping/packaging your purchases.  I always have to stop every time I'm home, and I never fail to find something that I must have.",
  "Concord Antique Gallery has a nice collection of antiques. The variety is excellent with many local area items. If you like antiques you should definitely give them a try.",
  "This is now at Concord Antiques - 137 Storrs St. - right up the road.   97 Storrs St. will be closing January 31, 2020",
  "I've visited a lot of antique stores. This one is average. Prices were on par. Several vendor booths. Very pleasant people working here.\n\nParking can be a problem.",
  "So many things to look at here. The staff is very helpful and you're free to shop without being followed.",
  "Off Main Street, down Depot St., at the corner on Storrs St., this is a two-level multi-dealer shop with tons of things to take you down memory lane.  If you want 17th or 18th century stuff, go elsewhere.  If you want late 1800s through 1900s, this is the place.  The stuff we grew up with, so there are tons of memories in every aisle.  Prices vary depending upon dealer.\n\nThe staff are super helpful and take good care in wrapping/packaging your purchases.  I always have to stop every time I'm home, and I never fail to find something that I must have.",
  "Didn’t expect such a large shop downtown. Nice variety of stuff from multiple vendors.  Well maintained booths and facility.   Prices were as expected or better on most items. We found several “treasures”.  Some vendors have a discount for cash.  "
 ]
},{
 "name": "Pierce Manse",
 "address": "14 Horseshoe Pond Ln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/1f/6f/0c/photo0jpg.jpg",
 "tags": [
  "family",
  "tour",
  "family",
  "tour",
  "family",
  "knowledgeable",
  "family",
  "tour",
  "historic",
  "family",
  "knowledgeable",
  "tour",
  "history",
  "tour",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109537-Reviews-Pierce_Manse-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "The home of the 14th president of the United States (1853-57) with a look at the home and Pierce's turbulent presidency. A place worth visiting for sure and then make sure to stop by Pierce's birthplace and his family tomb.",
  "The Friends of Pierce Mansion saved this historical landmark from ruin, moved it to current location, refurbished it and maintain it for tours and special events.  The Docent Led tour was filled with interesting information about the President, his family, the home,  and the town of Concord  I loved being able to see the President's personal belongings in such an intimate and upclose way.",
  "The house is where Franklin Pierce and his wife lived before his rise to the presidency. Many of the furnishing and artifacts are originals, having been preserved by the Pierce family since Franklin Piece’s death. There is a mini museum that has a number of interesting artifacts and signage describing aspects of his life and career. Then a docent leads you on a tour of the house. Our docent was extremely knowledgeable and provided many insights into little known stories about the president and the people he befriended, particularly Nathaniel Hawthorne. His Presidential term was presented fairly without being overly favorable nor unfairly critical, but presented through the lens of the time and not based on our current beliefs. Definitely worth a visit.",
  "The home of the 14th president of the United States (1853-57) with a look at the home and Pierce's turbulent presidency. A place worth visiting for sure and then make sure to stop by Pierce's birthplace and his family tomb.",
  "The Pierce Manse is worth a visit. Check the days and dates that it is open, since visiting times are irregular. The home is maintained by a private group of people who aim to protect and promote the presidency of Franklin Pierce, a man some historians consider one of the worst U.S. Presidents. His defenders at the site are willing to suggest other candidates for \"the worst,\" such as Van Buren.\n\nAt any rate, the home is worth a visit. The building was moved to the current site and has been altered a bit, as the docents will explain. Some of the artifacts and furniture are original to the Pierce family and the house, and others are simply from the era. Some are reproductions, such as presidential china on display. \n\nOur docent was reasonably knowledgeable and enthusiastic about Pierce but had some facts wrong, such as the circumstances of one of his children's death. She said it was in a carriage accident, but we found out in a reputable source that he died in a train accident in a very gruesome manner that I will not repeat here. She did describe it accurately. It is a sad fact that all three of his children died, and his wife became severely depressed and died a few years later. Pierce became an alcoholic, which our guide justified, saying, \"He died of cirrhosis of the liver, and I would have died that way too if all those things had happened to me.\"\n\nThe docent glossed over some of the problems with Pierce's presidency and painted a rosier picture of his tenure than he probably deserves, claiming that he achieved four of the five goals he established in his inaugural address. The one he failed to achieve just happened to be ending slavery (to his credit, Pierce was an abolitionist). But, as the docent, quipped, \"Well, who could do anything about that anyway?\"\n\nI found the tour a bit \"granular\" as the guide pointed out and demonstrated numerous utensils and objects. I could have done without the demonstration of the apple corer with a wooden apple. But I digress.\n\nAs you can tell from the tone of this review, I found a certain amusement in a tour by Pierce apologists.\n\nNevertheless, I give the Pierce Brigade a lot of credit for maintaining the site and the memory of the 14th President, their native son. They are a dedicated bunch, and I recognize how hard it is to maintain a historic site on a small budget with a volunteer corps.  So I probably rated the site a notch above what I really thought of it because of the esprit de corps the Brigade demonstrated. I applaud them for their effort.",
  "A must for history lovers and people following the Presidential trail. A nice tour and well done. Hours are a bit limited which makes scheduling hard. The word manse makes it difficult for many to know what this site is about",
  "Excellent tour with very knowledgeable guide.  A lot of original Pierce belongings in a well restored home.  "
 ]
},{
 "name": "Litherman's Limited Brewery",
 "address": "126 Hall St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/fc/01/35/photo0jpg.jpg",
 "tags": [
  "brewery",
  "adventurous",
  "learn",
  "food",
  "hike",
  "music",
  "family",
  "brewery",
  "music",
  "family",
  "sampling"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d11706831-Reviews-Litherman_s_Limited_Brewery-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had one of their sours in the bar of the hotel we were staying in.  It wasn't on tap at the brewery but I was very pleased with all of their beers, especially Cosmic Baker, a multi-fruit sour.  Took a couple of four-packs home.",
  "Dog friendly place to sample some good beer, maybe get a food truck grilled cheese snack (depending on who's there). Some fine traditional and VERY adventurous beers here. Something for every taste in a casual, unpretentious  spot. Strike up a conversation with whoever is hanging around and you may learn something.",
  "My family and I went here following a hike nearby, and we were very surprised by the quality of beers!  The actual establishment lies among a group of warehouses, but good signage leads the way.  Parking is very limited, so many people (including us) parked along the roadside.  Once inside, we were both a bit nervous that the beers, most of which contained fruit, would be very sweet...but that was not at all the case!  \n\nWe each drank a flight of four beers, and we each had a different four.  My particular favorite was the Cherry Sour.  It drank like a traditional sour, but had a flavor of cherry on the back end.  My husband's favorite was the Pear Sour, which was similar to the Cherry.  I also really liked how each beer's name was a play on a rock music song...ingenious!\n\nThis is, by far, our favorite brewery in New England!  We highly recommend it to anyone visiting southern NH or northern MA!",
  "Going with their music theme, this micro carries the burden of creating a multitude of styles and flavor creations so all you have to do is sit back and enjoy. Follow the signs at the address in this business park and you'll find an out of the way location with either indoor or outdoor seating. Rotating taps with an obvious following of clientele that stop in for growler fills and cans to go. Most likely not a destination must but a nice place to stop in if you are happening by within their limited business hours.",
  "We love coming here and sampling the beer, there are about 10 on tap?  A great range of tastes to make everybody happy.  There's a few rotating taps so there's always something new. They had 2 sours on our last visit. Really, really good beer. Family friendly place. They have outdoor seating and they serve pints! The owners are super  nice and it's just a really cool place to hang out, have a pint and chill and be happy."
 ]
},{
 "name": "Hatbox Theatre",
 "address": "270 Loudon Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ee/3f/52/99-comfortable-seats.jpg",
 "tags": [
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d12951866-Reviews-Hatbox_Theatre-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have been going to Hatbox since it opened and have never been disappointed. Hatbox has a wide variety of high quality productions. It’s open seating so have to get there early because the shows often are full.",
  "This is a very nice local theater venue.  Nothing fancy but great seating for watching live performances.  If you enjoy local/regional theater, then this is a great way to do it. Plus their concept of just being the theater and having production companies pitch shows to them means that there are many different shows available throughout the season.  Break a leg!",
  "For the last night of our vacation my family and I attended a production of \"1776\" at the Hatbox and are we glad we did. Outstanding production with a great cast, excellent costumes, comfortable seats and a very nice facility. Wish we lived closer so we could take advantage of future productions. Cost very inexpensive - paid a lot more for a lot less.",
  "Nice cozy, not small venue. Almost felt like you were part of the musical. Saw 1776 recently, absolutely loved it. Franklin was great !",
  "Hat Box is a fun place to watch a play. It is small so you are really close to the action. It is sort of connected to the back of a mall. If you are late you cannot get in because the door is practically part of the stage.\nWe saw an ensemble play that was both funny and touching.\nThey have lots of plays and activities here. \nCheck it out."
 ]
},{
 "name": "President Franklin Pierce Tomb",
 "address": "Old North Cemetery North State Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/4e/a3/ef/photo8jpg.jpg",
 "tags": [
  "walk",
  "history",
  "structure",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d4358867-Reviews-President_Franklin_Pierce_Tomb-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took a stroll through here one day to find the presidential tomb of Franklin Pierce. I'm not sure what I was expecting, something more elaborate? It's a rather ordinary looking stone at the rear of the cemetery, you could easily walk through and not know it's there. I guess for a former president I expected a little more. It was interesting though, I recommend checking it out.",
  "Rd#The cemetery is easy to find and very small so not too hard to find his grave. Cemetery is rather sad with lots of really old and toppled headstones, but the Pierce plot is pretty well kept.",
  "This cemetery is centrally located in concord new Hampshire it is easy to access and well maintained. The president and his wife are buried in a special area easy to find.a great piece of history when you combine it with a visit to the pierce man we that is nearby",
  "I was very surprised to see the simple burial place of the 14th President of the United States.  The grounds is not what I expected from past visits to other Presidential resting places.  The tomb is elegant and simple, with no fanfare other than a few small American flags planted in front of the tombstone, there were a few flowers planted, but nothing to suggested that a past President of the U.S. is buried here.  The tombstone lies inside a gated area of the Old North Cemetery, easily identifiable considering it is the tallest structure in the cemetery. ",
  "If you're in town, this is worth a quick visit. Pierce is the only New Hampshire President, even if he was one of the least effective. in American history."
 ]
},{
 "name": "Dimond Hill Farm",
 "address": "314 Hopkinton Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/59/76/9b/what-a-view.jpg",
 "tags": [
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d6637801-Reviews-Dimond_Hill_Farm-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Dimond Hill has been around forever and for good reason. Their produce, dairy and assorted other little bits of joy are all first rate and local. It is simply the place people anywhere within ten miles go to get there veggies, sweetcorn and all other farmed items. Beyond that the people who work there seem to be infused with good spirits. They are always happy and happy to help. great place all around and in a beautiful rural setting.",
  "So close to home we can run out there and get fresh veggies on a whim.  Suddenly want corn, peaches, a cucumber, some garlic?  Can do.  And then there are other local products like Vermont and New Hampshire cheeses, soups, pies and even local meats.  Haven't lived here long enough to know what happens in winter other than cross country skiing!",
  "Great source of local veg and fruit--not all grown here but sourced locally at least.  Quality is worth the price premium.",
  "The farm store is in a lovely old barn. Great produce during the growing season, mostly grown there. Plus lots of other great healthy stuff--dairy products, maple syrup, bread, etc.",
  "This was a nice farm. The old barn is really cool (I love barns). The place was clean. Good variety of early apples. Baked goods and lots of veggies. Nice folks. A couple of Llamas out back. We walked the snowmobile trail through the woods (no snow as it was 84 degrees lol) the trail was nice and was maybe a half mile each way. Fun walk as not many people there. The young girl at the cash register seemed like she'd rather be somewhere else. Oh well."
 ]
},{
 "name": "Oak Hill Trail",
 "address": "Shaker Rd The trailhead to the Tower Trail and Dancing Bear Trail can be found further north along Shaker Road. Or, park where the trail begins off of Oak Hill Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "hike",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d11871466-Reviews-Oak_Hill_Trail-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great short hike for when you just don't have the whole day to be outdoors, or you're not quite fit enough for a steep climb. The view from the firetower is your reward for getting out of your chair and improving your health! Recommended for folks with dogs and/or young children, as well as anyone who just needs an excuse to get away from electronic screens for a while.",
  "My spouse introduced me to Oak Hill.  It's beautiful from April to October, if your lucky sometimes November too.  It's great for beginners or hikers with children.  This local spot always restores my soul with it's vistas.  ",
  "From this trailhead runs a trail network several miles long. The longest trail through the woods ends at the Oak Hill fire tower with its fine views (featuring Mt. Kearsarge to the west).",
  "Great hike uo to the fire tower. Good climb and its runnable. Usually others on the trail with you, but not crowded. Picnic table at the top with a small clearing for lunch or a snack. Nice spot.",
  "The Oak Hill Trail is a fun short 2 mile hike up Oak Hill to the fire tower on top. Bring some drinks and sandwiches and have a picnic when you get there. There are two access points to start the hike. One is on Oak Hill Rd. and the other is on Shaker Rd.\nBring your dogs!!"
 ]
},{
 "name": "Apple Hill Farm",
 "address": "580 Mountain Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "organized",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d19079536-Reviews-Apple_Hill_Farm-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "An old fashioned apple orchard with a wonderful farm stand.  You can apple pick, grab some fresh baked pies and desserts as well as other local farm products.\nDuring the summer fresh berries are also available \nGreat for anyone, young and old",
  "Well organized farm with many different apples to choose from.  One of the employees was kind enough to point is to a small section that still had honey crisp and we loaded up on them.  Yum 🍎🍎",
  "Lots of varieties to choose from. Trees were loaded and made for easy picking.    Trees are tagged with colored tape to identify the different varieties and a sticker on the bag that you buy at the farm store tells you which color is for which apple variety.  The farm store smelled like fresh backed cookies when we walked in and you can purchase all sorts of yummy baked goods, preserves, cider, veggies, pumpkins, cheese, fresh eggs and maple syrup.\nNice place for a walk about among the many trees.  There are wagon rides too if you would like help getting round the orchard.  There is a children's play area. Also a rope-swing that you'll have to look on the map for directions to find.  Restrooms are also on site.",
  "The Concord area is blessed with a number of orchards and farms.  Apple Hill is one of my favorite.  They typically open mid-June with strawberries and strawberry picking... and things just keep picking up 'til they close the day before Thanksgiving.  Besides PYO strawberries, they do PYO blueberries and of course PYO apples.  They also have peaches, raspberries, corn, potatoes, lettuce, garlic, tomatoes, beans, eggplant, cukes, onions, squash, jams, pies, and baked goods.  They also have symbiotic relationships with other local producers, so you can get fresh eggs, smoked cheese, bacon, and milk.  They also have beautiful farm-fresh flowers.  I'm never disappointed when I visit here.  They also have a outside fridge and an honest-John box if you happen to arrive after hours."
 ]
},{
 "name": "Daniel Webster Statue",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/75/a7/37/daniel-webster-statue.jpg",
 "tags": [
  "walking",
  "tour",
  "sampling",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109535-Reviews-Daniel_Webster_Statue-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were passing through Concord, NH and wanted to see the statue of Daniel Webster and read a little bit of his contribution to this area.  Seems he was an awfully good man.",
  "A nice statue that stands outside the state house. I am not sure what else to say about it of than it's nice and some what interesting.",
  "This is our 50th State Capital to visit. The downtown is small. It is worth your time to explore the area. Take your camera. Plenty of eateries down in the area. The statue sits in front of the beautiful capitol building.",
  "The Daniel Webster statue in front of the NH State Capitol building is probably the most well known and visited statue in the State, You can enjoy walking the grounds around the Capitol, and see this and many other statues.",
  "Daniel Webster's statue on the statehouse lawn is just a sampling of what you'll see in downtown Concord. Tour the state house and the hall of flags. The NH legislature is the third largest democratic body (424), smaller only to the British House of Commons and US Congress - and they still meet in their original quarters.  There is a small gift shop in the statehouse, and a restaurant in the basement. Walk all the grounds. "
 ]
},{
 "name": "Mary Baker Eddy Historic House",
 "address": "62 N State St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/56/71/a5/mary-baker-eddy-historic.jpg",
 "tags": [
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109541-Reviews-Mary_Baker_Eddy_Historic_House-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I happened to come when Holly Morris, site manager, was present.  She is a genteel, courteous and knowledgable lady.  She adjusts to the customers' interests--for instance, she asked what interested me most, and said that for example some people were interested in the furnishings.  That hadn't even occurred to me--I was interested in the life of Mary Baker Eddy because her views would come from her experiences.  I asked about the sequence of the different homes in which she'd lived, and Holly Morris was able to give me brochures about the other homes, and also tell me about some of them.  And she was able to tell me some (in the brief time we had--I arrived with insufficient time before closing) about the beliefs of Christian Scientism--at my request.  She is a truly outstanding guide and manager.",
  "The Mary Baker Eddy house in Concord is one of many in which she lived in her lifetime.  But the guide at the house was really telling us the whole story of Mary Baker Eddy, not just about her time in this house, although her connections to the Concord area are very strong.  The house furnishings are typical of the period although were not necessarily her furnishings.  Several interesting displays and a short film give a good overview of this amazing woman.",
  "The docents of the Mary Baker Eddy home transport visitors to the time of Mary Baker Eddy with stories and explanations appropriate to each room.  The house is in beautiful condition and a must-see for aficionados of historic places.",
  "A nice place to see but trying to park is a nightmare.....only street parking.  Since this place is in a residential/business neighborhood, just 2 blocks from the State House, parking is at a premium.\n\nThe City of Concord does have a multi story parking garage which is about 1 mile away....too far to park there & walk.",
  "Happened to drive by, spent a few minutes explaining who she was and continued driving. Might impress followers more. Go to Center in Boston to be impressed."
 ]
},{
 "name": "Statue of Franklin Pierce",
 "address": "107 N Main St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/62/8d/19/photo0jpg.jpg",
 "tags": [
  "walk",
  "free",
  "walking",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d10713083-Reviews-Statue_of_Franklin_Pierce-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Thank goodness we have Alan Shepard, because if Franklin Pierce were our only New Hampshire native of note, that would be sad. But, the Pierce memorial is just one of many interesting historical icons in the city. Go to the state house. ",
  "The front of the capital has two famous New Hampshire senators, a famous general, and Franklin Pierce.  The back has a statue of Admiral Porter and across the street is the law enforcement memorial.  If you're seriously going to make a special trip for one statue, you might as well walk around and see the rest.  Better yet, seek out the Mill Brook sculpture garden and also take note of the increasing artwork popping up on the city streets of Concord.  It shows a community that is willing to invest in its image.",
  "How does one write a review of a statue? It is very well done and sits in front of the state house.The statues are free to see and sit on the lawn for all to view.",
  "Walking around Concord N.H. you will come across this Statue of Franklin it is a very nice place to walk and to see. ",
  "If you are in Concord, NH. It is worthwhile to take a walk around the State Capitol to see the beautiful buildings and historical statues like the one of Franklin Pierce 14th President of the United States from NH."
 ]
},{
 "name": "Kimball-Jenkins Estate",
 "address": "266 N Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/59/6e/ae/off-main.jpg",
 "tags": [
  "art",
  "historic",
  "free",
  "knowledgeable",
  "art",
  "art",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109538-Reviews-Kimball_Jenkins_Estate-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Free and open to the public art galleries located in a historic mansion and carriage house. Frequent public events, art shows, lectures which are offered at no charge. ",
  "Great place for classes shows and weddings etc two different parts of the place  with wonderful ambiance . Talks , exhibits and classes on many subjects. Great knowledgeable and accomadating staff.",
  "I attended a commissioners round-table on culture and tourism and found this property to be interesting and comfortable for an event. It has beautiful grounds and clean bathrooms, with interesting local art. This would be a nice place for a wedding or anniversary party.",
  "We attended a summer wedding at this venue in 2011 and it was beautiful! lovely outdoor gazebo area for the ceremony and a nice indoor reception area with dance for and kitchen!",
  "My daughter LOVES the summer art kids camp.  The grounds are beautiful, I appreciate the architecture and the neighborhood.  If you are in the area take the time to go in the gallery and see the estate."
 ]
},{
 "name": "Fort Eddy Plaza",
 "address": "73 Fort Eddy Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/64/d6/cb/fort-eddy-s-plaza.jpg",
 "tags": [
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d13997277-Reviews-Fort_Eddy_Plaza-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "This shopping plaza is conveniently located off Exit 14 of Route I-93 and near the junction Route I-393/US Route 202.   \n\nIt has service businesses, stores and restaurants.\n\nThe anchor store is Books-A-Million which carries books for the whole family.  There’s a large children’s section.  One will also find games, puzzles, plush characters, and toys throughout the store. There is a smaller section with books for teens.  On my visit this time, I shopped at Books-A-Million where I got two nice books at deep discounts.\n\nOther stores of interest to travelers include GameStop, Staples, GNC, Eastern Mountain Sports for outdoor gear, Rite Aid for forgotten or used-up toiletries, OTC medicines, and first aid items.  The Shaw’s Supermarket is not only good for snacks and beverages, but it also has a Citizens Bank ATM inside for emergency or extra cash.  \n\nThere’s a Supercuts where one can get a quick haircut.  \n\nThere are two eateries - Five Guys Burgers & Fries and Moritomo Japanese Restaurant. \n\nFort Eddy Plaza is across from the L.L. Bean Outlet and Uno Pizzeria & Grill.  The McAuliffe-Shepard Discovery Center is about 2 miles away.\n\nI rate the Fort Eddy Plaza at 4.50 for its convenient location with easy access to highways and the variety of businesses there.\n\nIf you found this review helpful, please click THANK below."
 ]
},{
 "name": "Greater Concord Chamber of Commerce",
 "address": "49 S Main St Suite 104",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/6a/4d/bd/concord-s-clock-tower.jpg",
 "tags": [
  "art",
  "eat",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109546-Reviews-Greater_Concord_Chamber_of_Commerce-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "What an amazing retail space with information and brochures and art and gifts to local products.  Very helpful people really good place to visit. ",
  "Since I have been living in Concord, the Chamber has been in three different locations in the 90s on N Main St., then by the Grappone Conference Center and now back on S Main St, where it belongs.",
  "So many great shops and places to eat. With the renovations on Main St this place is wonderful. Always bustling and always something to do. I wish the shops had longer hours.",
  "A very well organized operation with a nice meeting room area, and staffed with a lot of pleasant people.",
  "Located on Main Street, across form the capitol Center for the Arts is the Chamber of Commerce. A lovely bright and open goldmine of information about Concord and the highlights of the city and surrounding areas. The Chamber Guides have been very helpful  with local information, getting around, places to go. I recommend visiting if you are new to town!"
 ]
},{
 "name": "Lewis Farm & Greenhouses",
 "address": "192 Silk Farm Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/9d/65/eb/aerial-view-of-lewis.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d10757181-Reviews-Lewis_Farm_Greenhouses-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Friendly and knowledgable owners! Daily fresh produce and you can cut your own flowers! Minutes off I-93, very accessible. I love supporting small business and locally owned farms. They have a great selection of veggies (especially corn and cherry tomatoes) and terrific prices."
 ]
},{
 "name": "John Stark Statue",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/59/6f/77/til-you-see-the-white.jpg",
 "tags": [
  "free",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d109534-Reviews-John_Stark_Statue-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I mean it is a statue.  What else can you day. Less pigeon poop than most. Not sure if they clean it better or the pigeons are just polite around it. ",
  "This statue also sits on the lawn in front of the state house which was closed on Sunday. It's free for all to view.",
  "Take a walk around the NH State Capitol. You will see beautiful buildings and some historical statues like the one of war hero John Stark.",
  "Headed to the Capitol to see this man and realize what \"they\" our founders did, believed in really makes you smile in gratitude",
  "If you want to understand this tiny flinty state, stand in front of the John Stark statue for a minute, and imagine how he has lit up the population to be proud to carry around his remark on all the license plates: Live Free or Die. \nHe was probably a charismatic leader; his wife Molly Page was born in a beautiful old farmhouse a couple miles away. So while you are in downtown Concord, say hey to the Big Man John Stark"
 ]
},{
 "name": "Lehtinen Park",
 "address": "Horse Hill Road",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/d9/b4/fa/another-set-of-trails.jpg",
 "tags": [
  "hike",
  "adventurous",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d19269154-Reviews-Lehtinen_Park-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "The park is easy to miss as the entrance we used was barely noticeable except for the Stone Marker.\nThere are several trails, and as we are senior citizens, tyook the easier trail. It was a great hike, no difficult climbs, just a rambling trail.\nNext time will try some of the other trails.",
  "Went with friends of the same age group (70s) for a quiet walk in the woods. This is an easr trail which splits off to several more adventurous hikes. For the bone weary and those afraid to fall, the gentle trail is a great exercise and a great time in the open air. We will try to other trails when we visit again in the Spring."
 ]
},{
 "name": "Depot Antiques & Toys",
 "address": "30 N Main St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d8537323-Reviews-Depot_Antiques_Toys-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have been going to Toms stores for years.....great in the community and for the community. BIG help with his knowledge of trains and help.\nThe store is always packed with nice antique items...",
  "I walked in this establishment to buy some antiques as I collect a lot of stop from the 1950s I have never taken one thing in my life and because I had a leather vest on with no sleeves I was accused of being a thief and kicked out these people are the biggest scumbag I have ever met in my life",
  "I found this while ambling along Main Street after visiting Gibson's Books.  Just my kind of store (just being an old kid), it was full of wonderful antique toys, from building sets, cars,models and old trains.  Plus there was a good selection of other things, such as furniture, etc.\n\nJust a fun place to stop and browse."
 ]
},{
 "name": "John Parker Hale Statue",
 "address": "107 N Main St In front of the NH State House",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d10713084-Reviews-John_Parker_Hale_Statue-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visitors note statues of Franklin Pierce (president), Daniel Webster (senator), and John Stark (general), but many times when passing through the State House grounds (I live in Concord), I have had to expressly ask them to take at the statue of John P. Hale, who, as a leading member of the Free Soil Party and its presidential candidate (against Pierce!), became anathema to the Democratic Party in the state. The inscription on the statue is quite simply one of the most moving ever composed."
 ]
},{
 "name": "Sleeplegate Mall",
 "address": "270 Loudon Rd",
 "avg_visitor_review": "2.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1b/31/36/88/misty-s-magic-mist-customized.jpg",
 "tags": [
  "food",
  "food",
  "theatre",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d13936154-Reviews-Sleeplegate_Mall-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "This used to be such a thriving mall and now only a minimal amount of stores have survived!  It's like a \"ghost\" mall with stores here and there.  Not many food options like their used to be either.  Given it's convenient location in the state's capital city, I find it hard to believe that local residents are not supporting this mall better.   I really miss shopping there more and would love to see whoever owns this property bring in more shopping options!!!!  If this mall ever closes now that Sears will be gone in February, it's \"shame on them\"! Going there to shop would be much more convenient than driving to the Mall of NH!",
  "There is a great shoe store in the Steeplegate Mall called the Shoe Dept. I have tried putting a review on their web site but can't find anywhere to put one so am doing it here. Have great selection of shoes, boots,etc. at reasonable prices. Jess waited on me and was wonderful. She went the extra step and brought me a pair of sneakers in a different color in my size that wasn't displayed. I loved the color better than the pair I tried on so purchased the new color, as well as a different style. ",
  "This mall is really only useful for those who are interested in shopping at the anchor stores Sears and JC Penney.  At a rough guess, about 2/3 of the shops are shut down, a few that don't seem to be shut down were closed (lunch time on a Tuesday).  The food court has 2 venues operating, a pizza place and a pastry place.  Overall the mall is depressing - the only good thing it has going for it is the quiet and ease in parking - because there is no one there!",
  "The Steeplegate Mall was a large, sprawling shopping center with sections.  Some stores were clustered together. Others were more like stand-alones but only a short distance from the clusters.  It was an unusual layout; however, that layout worked well for finding a parking space near the stores one wanted to patronize.  \n\nThe largest stores were JCPenney, Sears, VIParty Rentals, and two stores for The Bon-Ton. The Bon-Ton seemed to be closing as there were signs in the windows for a big liquidation sale going on.    \n\nOther stores I noticed were: Bath & Body Works, Hot Topic, Charlotte Russe, Chico’s, Dressbarn, Maurice’s, Rue21, Talbots, Victoria’s Secret, Lenscrafters, GameStop, f.y.e., GNC, Yankee Candle, Olympia Sports, Kay Jewelers, Claire’s Boutique, Sunglass Hut, and several more.  \n\nFood options included a Basil Pizza, Dunkin Donuts, Tarrasini Pastry Shop, True Confections for candies, and Tutti Fruitti for frozen yogurt.  On the outskirts of the mall, there was an Applebee’s Neighborhood Bar & Grill.  \n\nThere was also a TD Bank with an ATM on the outskirts.  I saw some ATM’s inside the mall, too.  \n\nIn my travels around, I saw a couple of stations with rental strollers.\n\nThere were sets of restrooms on opposite ends of the mall.  One set was near Sears; the other was near The Bon-Ton. \n\nFor entertainment, there was the Hatbox Theatre for live performances.\n\nI rate this mall at 4.0 mostly on its size and its 40+ stores.  I enjoyed my visit here and will return.\n\nIf you found this review helpful, please click THANK below."
 ]
},{
 "name": "Kiwanis Riverfront Park",
 "address": "15 Loudon Rd",
 "avg_visitor_review": "1.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/73/b7/6d/the-park.jpg",
 "tags": [
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46052-d12446923-Reviews-Kiwanis_Riverfront_Park-Concord_New_Hampshire.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were traveling north and wanted to take a break with a picnic lunch. This one seemed nice since the Kiwanis website claimed that it had a picnic area by the river. \nWe expected picnic tables, at least one trash can and a bathroom. It had neither. It did have a very large empty parking lot so at least they are optimistic. The river was lovely though.\nWe were planning to visit Concord on the way but seeing this sad park did not inspire us to see it, so we decided to move on.",
  "The parking lot is huge. Sits right behind the arena building. Took ten minutes to walk from one end of the trail to the other and back again. Plenty of trash to photograph. River is nice. Two dogs running free from their owners.",
  "It's a nice riverfront park.  It had some beauty, especially with the river right there, but it's on a busy road, so there's not too much peace and quiet.  It did have a few areas to hang out, but parking was a little tight. It was fairly clean."
 ]
}]
