[
{
 "name": "Denver Botanic Gardens",
 "address": "1007 York Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/98/6d/74/denver-botanic-gardens.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Walking thru the gardens is not just about plants--there are sculptures, seating areas to reflect and much more. Gaze at the fish and stand under a tall tree--all nice escapes for the day .",
  "Because of the pandemic all the indoor displays were closed. \nOutdoors was pretty dead and desolate nothing really was in bloom - no bonsai on display. Nice layout and spread but really nothing much to enjoy maybe because of the weather and the current global event.",
  "We went to the botanic gardens for their winter Christmas display - it was breath taking and a wonderful experience for the entire family - HIGHLY recommended.",
  "Early March is possibly not thought of as the best time to visit a Botanic Gardens, however we really enjoyed our visit to the gardens. Spring flowers are blooming and the trees are budding. The Japanese Gardens were looking beautiful. \nWe visited the science building and had an excellent one to one talk on microscopic hairs on plants. Absolutely fascinating. \nAs always, there were beautiful blooming orchids in the hot houses. ",
  "Staff was friendly and view spectacular. A must-see in Denver even if you don’t have a green thumb. The science pyramid is informative and the gardens enchanting. "
 ]
},{
 "name": "Mount Evans",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/ac/db/70/on-the-sawtooth.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I think I've said it all in the title. Getting there from Denver area is a scenic drive in itself. The grove is amazing. Goats can be seen. It is awesome.",
  "When you get to the top you feel like your on top of the world - you won't be disappointed!!!!  The drive up to the top is incrediately.",
  "Definitely worth traveling in your own car. But be careful when planning your trip because: (1) the road may be closed because of snow even in the middle of summer and (2) the road is narrow and may be icy. We did not have any problems with the high altitude, but I heard that some people did. There is a short but a bit challenging walk from the parking lot to the summit, so take good shoes. And of course, have warm clothes because it is really high and the temperature may be quite low.",
  "Somewhat daunting drive up to the peak. High elevation is noticeable and the harshness of the wind,temperature, and terrain is memorable",
  "I didn't know this until I went, but you can only get all the way to the top between Memorial Day & Labor Day. Before Memorial Day & after Labor Day you can only drive up to Summit Lake, but can walk the rest (if you are prepared for the walk/hike the last few miles up the road!). I could definitely feel the altitude difference at Summit Lake, so be prepared for that. The drive was fun & entertaining."
 ]
},{
 "name": "Denver Union Station",
 "address": "1701 Wynkoop St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/44/17/57/travel-by-train.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Bring back the good old days. Nice areas, clean, to sit and people watch or grab a meal. Center of Denver and good starting point. Read the signs hanging inside for some interesting history. ",
  "This is a cool spot and while it is still a train station they have turned parts of it into food stations and cute stores. Worth a walk through! ",
  "Having worked in downtown Denver for 30 years, I remember when Union Station was a rundown, seedy stop for Amtrak and little else.  Now it's a booming visitor center filled with restaurants, shops, a hotel and lots of happy ids running through the fountains during the summer.  You can still catch a train or a bus, but you'll enjoy the experience so much more now.",
  "As soon as we learned how to use the rail system we used it! Talk about easy. If you still do not know the security was fabulous to us & helped us. Even told us where to eat.",
  "Everyone told us we had to come check this out. I honestly don't get all the praise and clamoring over it. Now granted we were between meals, and weren't into having a drink at 10:00 am, so while it was pretty, I'm not sure all the hype, unless you need to catch a train. \nIt's pretty busy with a lot of people getting food and waiting for trains. Looks nice and restored."
 ]
},{
 "name": "Coors Field",
 "address": "2001 Blake St At 20th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/11/a0/d8/imag1087-largejpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We have been to the field several times.  It is fun for the entire family.  Baseball at its finest.  Plenty of food venues and restrooms.",
  "We took the family ro see a Rockies game and it was fantastic! The stadium is very convenient to get to with great views and plenty of delicious restaurants to check out!",
  "Excellent location in the heart of downtown Denver. You can drive, take the train, or ride the bus up the 16th street mall. The air is electric and the crowds are friendly. The food is a cut above other stadiums I have had the luck to see. You can watch from your seat or from one of several bars located throughout the stadium. Be sure to head there early as it is a popular venue for Denver fans. Follow the crowds toward one of the best experiences you can imagine. They also have a store for any fan who forgot to wear his/her purple. It's safe and fun. If you don't have a lot of cash you can buy rock pile tickets for a reasonable price.",
  "Affordable professional sports option for families.  Great memories and sunsets.  Variety of food offered.",
  "Our tour guide was so cute and adorable. You can tell she has a real interest in passion in her job, and it just shines through in her story telling. Her name slips my mind, but I remember she had been there since the park opened 26 years ago. We saw many aspects of the park and learned some history of it, and the surounding areas. Fun fact, Blue Moon beer originated here under a different name, but the building is still there. I love this ball park and always have, but seeing it in person is really what you need to do. I definitely want to return to catch a game here someday."
 ]
},{
 "name": "Mount Evans Scenic Byway",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/9f/58/e5/photo0jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This was so beautiful!!!!  We went for a Saturday ride and it had just snowed. That is what we moved here for. My daughter had flown in to visit so she really enjoyed the ride.",
  "Echo Lake, Summit Lake, and the summit of Mt Evans are the places that you can easily reach with your car and have an experience of high mountains.",
  "We drove this scenic byway hoping to drive to Mt. Evans but only made it to Echo Lake as the road to the peak was already closed in October. However we drove all the way to Evergreen and it was a great drive on a nice road with colorful aspen leaves to look at. Juniper Pass was a great stop along the way.",
  "We drive the Mt. Evans Scenic Byway (Highway 5) at least once every summer.   Via I-70 from downtown Denver to Idaho Springs exit 240 is about 32.5 miles, to Highway 103.  Highway 5 is about 13 miles of Chicago Creek, past Chicago Forks and just beyond picuresque Echo Lake 10,600'.  Denver Botanic Gardens Mount Goliath Dos Chappell Nature Center,  +3 miles) at about 11,500' is advised; with hikes among wildflowers and bristlecone pines.  Continuing UP Highway 5, views open to all directions, wildflowers line the road, and critters appear (marmots, pika, bighorns, mountain goats, and birds)  Sharp dropoffs beside the road are common, hence the warning about  acrophobia/a\ngoraphobia.  Six miles to Summit Lake, 13,000' is stunning, with views up, down, sideways; parking is often crowded.  Great views of the lake with Mt. Evans behind.  Many, many alpine wildflowers through July into August.  Occasionally wildlife near the lake.  The final 5+ miles to \"summit parking\" at 14,130 abounds with switchbacks, pulloffs, sights, and often animals.  Pika are elusive, marmots like to eat and sun, bighorns wander, and mountain goat are often along this section and/or at the top.  Views from Longs Peak to Pikes Peak north and south, to the Collegiate Peaks west, and Denver and the Great Plains east.  A short gravel walk/crawl to the peak at 14,250 is available.  Water, sunscreen, snacks/food as this is a half to full day venture (120 miles round trip minimum) from downtown Denver.  Bring layers of clothing.",
  "Did this attraction on the last day of a 2 week trip around the Colorado rockies . A lovely drive , hairy at times, and often takes much longer than planned due to travelling at the slowest speed of the car in front. We were lucky the road had only recently reopened after a late snowfall in June.  But worth the travel right up to 14000 , as we were able to see all the mountains we had explored during the trip ."
 ]
},{
 "name": "Denver Museum of Nature & Science",
 "address": "2001 N Colorado Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/20/5b/4c/front-of-the-museum.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "A spectacular major museum that is well worth a visit if you have 2-3 hours to spare in Denver. I particularly enjoyed the many dioramas of North American natural history, but there is also an excellent history of life gallery, with many cool dinosaurs and mammals, and lots of other galleries too. ",
  "The museum offers an amazing overnight program to schools in the city.  There were about 300 5th graders attending.  I chaperoned with my granddaughters class.  It was amazing and fun!!  This is a memory they will have forever!",
  "Russian artist extraordinaire Konovalenko has created some of the most amazing sculptures from gemstones.  His work must be seen to be appreciated.  Go see it!!  ",
  "Very big and has lots of cool things for the family to do and see. Very busy on the weekends, but still enjoyed ourselves.",
  "Having grown up in Colorado, I was lucky enough to bring my own daughter here for a visit!  \n\nJust like when I was a child, a full T-Rex skeleton (replica) greets guests upon entrance.  The Pre-Historic Journey exhibit on the third floor (containing all the dinosaur and early mammal fossils), as well as the taxidermy dioramas on the second floor, remain largely unchanged since I was a child.  However, I have noticed over the years that the information on placards and discussed in museum tours are updated.  Other exhibits have been changed since my youth including Expedition Health (formerly The Hall of Human Life) and Space Odyssey.  These are now more tailored to children but are very fun.  The Egyptian Mummies are also neat to see.\n\nAs a parent, I greatly appreciated The Discovery Zone on the second floor, which is like a mini children's museum.  It was great letting our daughter blow off some steam so she'd be calmer while my husband and I enjoyed the exhibits about international cultures.  As with many museums, there are also plenty of restrooms and places to eat, as well as a large gift shopped filled with overpriced items.\n\nWe concluded our tour with a trip to the Sky Terrace.  Here, the views of the Rocky Mountains and downtown Denver are unmatched!  \n\nGreat location adjacent to City Park...perfect way to spend the day with family!"
 ]
},{
 "name": "Denver Art Museum",
 "address": "13th Avenue Between Broadway and Bannock Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/35/6f/3b/dam-looking-north-up.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I feel so grateful to live in a city with such an excellent museum. European Masters? Check! Amazing Asian exhibits? Check ( and I am a world history teacher) super cool modern Asian art oh yeah! Just so many great things and in a small enough chunk you can really spend time, but enjoy it all. Please don’t leave without a stop here!",
  "There is something in the museum for everyone in the family.  We went to see the Monet collection and it was wonderful.  ",
  "Denver Art museum is curated with a lot of taste and is every eclectic in its vibe. We enjoyed our visit there and had a great time looking at all the arts, it has a lot of cool places which are kids friendly and they would have fun too while the adults can look at paintings etc. \nwe specially loved the mirror and lights gallery",
  "This museum has no permanent exhibition and the way they present art is not good. The exhibition about light had problems with highly reflective glass used for the paintings. The curation of lamps crossed the line between museum and product placement. Café without tables and a 30% fine on those daring to visit from outside Colorado.",
  "Very cool!  It was free the first Saturday of the month-  not sure how long they are doing that,  but awesome exhibits!  The building itself was fantastic!  It’s not very big,  so it only takes about 60-90 to get through,  but there were a few exhibits not open.  Probably wouldn’t pay regular price for it since it kind small for the regular price.  "
 ]
},{
 "name": "Stranahan's Colorado Whiskey Tour",
 "address": "200 S Kalamath St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/21/9e/d7/first-distilling-pots.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "What a great distillery experience! Dave really got into how Stranahan’s got its start and where they are today. Can’t say enough about the experience. Afterwords, we got to experience “Future Monday” where Lucas makes some of his signature cocktails. I would highly recommend checking out Stranahan’s! Can’t wait to come back.",
  "What were we thinking doing two distillery tours in one afternoon?!? I tell you what, it was totally worth it. I'm not much of a whiskey drinker, but you have to check out Stranahan's Colorado Whiskey.\n\nWe had some time before the tour, so we bellied up to the bar. Steve B., mixologist and server, was really cool and explained the drinks to us. When it was time for the tour, we were introduced to Logan. He was an awesome tour guide, and has a great personality for it. He gave us a history of Stranahan's as well as what it takes to make their whiskey.\n\nDuring the tour, we were given some samples. Again, not being a whiskey drinker, I was surprised at how you go about tasting it. And it wasn't bad! Logan even showed us what happens to the whiskey when you add a little bit of water to it. We were able to keep our tasting glass as a souvenir, and some of our group took advantage of the discount after the tour to bring home a bottle or two!",
  "This is a fun, entertaining, and informative tour with some excellent whiskey involved!- what’s not to like?!",
  "Two take-aways from our stop; first was just how friendly every staff member was at Stranahan's, and second, the whisky flight was outstanding.  The Snow Flake sample was one of the best whiskies that I have tasted.  I can see why the \"once a year\" event has folks lined up for days to acquire.  These guys understand whisky and are always happy to share their knowledge with you.",
  "Even though the heading is for Stranahan's Whiskey Tour, this review is for their Volunteer Bottling Crew. I have been on their wait list for several years and figured my name had fallen into the black hole of the volunteer bottling crew until BAMM, I finally received the email. The bottling session was a great time and did also contain a brief tour by Matt prior to hitting the bottling. Matt has the tour guide system wired and is very funny and informative. After the tour we were prepped on how the bottling line runs. Sterilizing the new bottles, adding heat shrink to their tops, corking, adding stickers, capping, boxing, etc etc. All a good time with a dram of the whiskey after every pallet filled. After a few hours of fast bottling, the day finished with a pizza lunch and a bottle of Stranahan's to all the volunteers. From what I understand the list is 28,000 long to get a spot, but it was a blast and I'd love to do it again. Cheers Stranahan's. Big Fan."
 ]
},{
 "name": "Denver Zoo",
 "address": "2300 N Steele St Denver City Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/57/fc/6a/denver-zoo.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I can tell you that the Denver Zoo is worth a visit. They have a new section for elephants and tigers that are comparable to San Diego. I’m still smiling from the sunny weather and craft beers...it was a good day at the zoo.",
  "We have been to the Denver zoo many times and each time is a wonderful experience.  They have babies to view in the spring, new buildings are going up, the animals seem very happy and well taken care of.  There are plenty of benches to sit and relax if you get tired of walking.  Overall wonderful experience.",
  "Nicely laid out zoo with both indoor and outdoor exhibits. Plenty of extras for the kids. In colder weather, the tropical exhibit house is a good spot to warm up. ",
  "It is just over two years since I last visited the Denver Zoo. Again, we found a lot of empty enclosures. However we were impressed with being able to get close up to many large animals, \nMany exhibits only have a very few animals for instance the tigers, there are just Siberian tigers, one male, one female. I hope that they have success in their breeding programme. Elephants, I understand that they only have males.\nThe primates area is well designed and provides the story of the primates evolution and families very well, however so many of the large primates are missing - chimpanzees and gorillas were absent.\nI was rather disappointed with the food outlets.\nLooking to the future, there are some new displays and buildings on the way and I suspect that I will visit again when I return to Denver.",
  "We visited the zoo in March 2020, mainly because we finished the things we really wanted to do in Denver early.  A good number of exhibits did not have animals, as it was still fairly cold.  However, the prices are raised starting March 1st.  The selection of animals we did see was decent, and we saw two of the animal feedings.  However, I was hoping to see move animals native to Colorado."
 ]
},{
 "name": "Molly Brown House Museum",
 "address": "1340 N Pennsylvania St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/88/0e/fb/photo1jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Enjoyed the tour and the story about Margaret Brown.  It gives you a glimpse into Denver in the early 1900's and while only about 10% of the furnishings are actually from the Brown family, they've done a nice job of securing other items from that time period.  And if you can't climb the steps, they have a virtual tour on an ipad which was a nice option.  I was glad I did the tour.",
  "This was the 2nd time I've taken this tour.  I found it just a enjoyable as the first time.  The history of the home, not to mention the furniture and rooms are top notch.  I'd recommend this tour when visiting Denver!",
  "I was fascinated by the Victorian decor and the stories about Margaret Brown.  I had to shed all my misconceptions from the movie, The Unsinkable Molly Brown.  Oddly I found the real Margaret Brown much more interesting than the fictional one.  The house is not large and the guided tour does not take long.",
  "As a history buff I thoroughly enjoyed our visit. Our tour guide was very knowledgeable and encouraged questions. Millions have been invested in restoring the home to its original state. I also learned a lot about Molly Brown. The movies don’t tell her real story!  Worth a visit if you are interested in history. ",
  "When you are in Denver, make time to visit the Molly Brown House Museum.  Margaret \"Molly\" Brown is a well known survivor from the Titanic (Played by Kathy Bates in the famous movie)  The museum is an accurate portrayal of what the house looked like when Margaret and her husband, JJ, lived there in the early 1900's, and the museum tour dispels several myths about who she was and outlines the significant contributions to society she made.  There are frequent tours, and the gift shop is a study in influential women and Victorian charm.   Family friendly"
 ]
},{
 "name": "Forney Museum of Transportation",
 "address": "4303 Brighton Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/dd/70/be/forney-transportation.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We were leaving Denver on a Tuesday, so we wanted to do something interesting on a Monday when a lot of museums are closed. The reviews of the Forney Museum of Transportation sounded good, so we gave it a try. It was terrific! No matter who you are, you can find something here that will appeal to you. Trains, motorcycles, bicycles, cars, even an airplane! Models and toy cars for the kids, too. It's fun to see old cars and think about what transportation was like in the last century - beautiful designs. The highlight for me was the actual car owned by Amelia Earhart! Another surprise was how huge the locomotive was and how complicated it was to run. Staff was great and the museum wasn't crowded at all. They require you to put bags and coats in a locker which means you don't have to carry all that stuff around with you. ",
  "My husband and I thoroughly enjoyed the museum with it’s diverse selection of antique cars and other modes of transportation. A must see for all car buffs ... and their wives 😊\n",
  "Fun museum to visit. Transportation history from wagons to today. I saw a couple of great examples of how what seems new is actually old (electric car from early 1900's, bicycle pedaled with a stand up elliptical action). Good place to spend a couple of hours or more. ",
  "This is one of Denver's least known gems.  Going to other area museums involves battling crowds, and the Forney Museum space is wide open with a fascinating variety of old cars, trains, bicycles, motorcycles, and other modes of transportation.  Seeing these well restored vehicles brings back nostalgia as well as a sense of fun imagining Amelia Earhart driving around Boston in her yellow Kissel or being a passenger on one of the luxury train cars in bygone days.  Having one of the very few the Big Boy locomotives adds to the visit.",
  "Wow so much to see. Old Cars, Motorcycles, Carriages, Bicycles and Trains.. very impressed with condition all items were in. A must see in Denver area. Give yourself a couple hours to walk through."
 ]
},{
 "name": "Larimer Square",
 "address": "1430 Larimer St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/d8/0f/c7/larimer-square.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "If your a visitor you need to go to Larimer and experience the history of Denver - its a wonderful place to visit at Christmas time.",
  "Walked thru and felt chills by the lights strung above the street along with American flags. My son is in the USAF and I was proud to be an American in Denver in Larimer Square. Nice shops, bars and restaurants.",
  "An excellent area for nightlife. Many restaurants and bars are open late. Stores close a little early. Loving the lights on the street. Hardest part is finding a place to park. Expensive part of the night was the parking.",
  "Nice place to walk around. Interesting shops and restaurants. Not far from the convention centre and the hotels.",
  "I love Larimer Sq. There is plenty to see and enjoy. Stop in every shop. The people are all friendly and you will this will become one of your favorite streets. The restaurants are all great. I have eaten at every one of them multiple times. There is a Starbucks. and Market with quick bites and non alcoholic drinks and even ice cream.. "
 ]
},{
 "name": "Sports Authority Field at Mile High",
 "address": "1701 Bryant St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/d6/42/92/2015.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This tour was great. Definitely recommend whether a football/sports fan or not. Got great pics and informative.",
  "My tour guide April was very friendly and knowledgeable. It was interesting to see a lot of the behind the scenes areas of the stadium. The best part was getting to go on the field!",
  "Went to a football game the bartender Cat was excellent remembers what you drink and is very grateful that you are there",
  "What a bust.  Been to the stadium many time in the past and found it to be typical for an NFL stadium.  Long lines for food and beer, expensive food and beer.  The fans are typical for the NFL and overall mostly polite and respectful to other fans.  What was the big downer on this visit was the way the stadium was prepared for the game.  A large snow fall happened the Tuesday before the game and the stands were not cleared of all the snow.  This afternoons game it was about 40 in the sun at game time and the snow under the seats began to melt which put freezing water at everyones feet during the game.  The Broncos played poorly and by halftime our feet we frozen even with heatpacks.  We left at the start of the third quarter because our teeth were chattering.  Bad game preparation SAF.",
  "We had a great experience!  The escalators make having high level seats very do-able.  There are a variety of concessions very accessible to every section. \nEvent staff were friendly and attentive.  Fans from both teams were friendly (rare..may have been just the ones near us 😉) \n\nParking is a a good distance away no matter where you go.  We were not in a hurry so we took an Uber there and a taxi back.  "
 ]
},{
 "name": "Washington Park",
 "address": "S. Downing St. & E. Louisiana Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/fe/db/67/photo0jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Its a wonderful park for the entire family but also lovely for one person or a couple to just walk around and enjoy the sunshine.",
  "This beautiful park is wonderful for a walk, bike ride, picnic or to play volleyball in the summer for example.  There are two lakes in this park and lots of space for everyone.  There is a kids play area, a rec center, many trees and paths, tennis courts and other game areas.  In the summer there are free concerts in the park.  It's a great place to meet a group of friends, or make new ones.  ",
  "This was a great place for a walk in Denver! I took my kiddo here and she loved it as well. The paths are clearly marked for pedestrians and equipment on wheels (i.e. bikes, roller skates). There were families, couples, and individuals as we walked around the pond area. It's a quick walk to Bonnie Brae's Ice Cream shop as well through a very quaint neighborhood. I will most certainly come here again!",
  "Denver should be on everyone’s list! What other city can you go to world renowned art, entrance to the great Rocky Mountains, walk in sculpture parks and live moderately with super sports!\nWonderful city, great food and such nice people!",
  "Wash Park, as it is known, is a haven for people from all corners of Denver and the suburbs. On my many visits there, I've seen runners, runners with dogs, runners with baby strollers, local celebrities playing fetch with their dogs on the lake, and picnickers. It is also a primary location for 5K runs, etc. that fundraise for charities. Some people just sit on the benches and read. Take a trip to Wash Park. You won't be disappointed."
 ]
},{
 "name": "History Colorado Center",
 "address": "1200 N Broadway",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/b6/71/0b/history-colorado-center.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We've been here several times, once even for a school gala fundraiser. The interior architecture is quite cool. It's a great space, and there are lots of different interactive exhibits on many different topics. The last time I went, I brought a lot of extended family members as part of a reunion, and I didn't allow enough time; there's a lot to see! That day, I specifically enjoyed an exhibit about native American Indian Coloradans.",
  "This modern \"museum\" does a great job telling the story of Colorado with many creative exhibits. As fairly new residents we found the \"Top 100\" exhibit to be  especially helpful to get the high points of CO history.  And I liked the special exhibit on the history of beer in our boozey state. We only wished we had budgeted time to stay longer in this great spot.",
  "My family and  I visited on a Friday afternoon the museum had several school groups in the building so the staff suggested we start on the top floor. I could have spent several hours on the top floor alone. the exhibits on The Ute native american is very engrossing.  Also the beer exhibit was quite informative. ",
  "its a gorgeous place to see some really great artifacts from the old west and its quite vacuous so you will have a great time walking around.  you can go for free when you get a culture pass from your Jeffco Library.  thats right, FREE  !!",
  "We almost didn't go to this museum after reading some of the negative reviews, however I realize most of those were written in 2018 or previous, so we took a chance & went. I'm so glad we did!  It is as much fun for adults as for kids...from being able to \"drive\" in a model T Ford, to being on a \"ski jump\", or taking the simulated \"elevator\" down the mine shaft , & \"set off\" a simulated TNT explosion,..there is so much to do!  I am a native of Colorado, but I learned some cool things about Colorado I had never known. The 4th floor had a cool exhibit of \"100 things Colorado\", which was awesome, and touched on many things, which I thought they did an excellent job of! 4th floor also has an exhibit about Colorado's history of microbrewery, which my husband enjoyed as did I. Then you can go down to the attached cafe & try an assortment of brews & snacks...what's not to like?!?"
 ]
},{
 "name": "Kirkland Museum of Fine & Decorative Art",
 "address": "1201 Bannock Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/46/46/77/kirkland-museum-s-new.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Fabulous! Could spend days there. Great representation of Colorado artists too. Don't miss the gift shop!",
  "This museum has artwork by Vance Kirkland, his studio, and a large collection of other art.  We really enjoyed Kirkland's paintings.  The other art was eclectic, including lots of local artists.  Some of the rooms were so packed full of stuff on the walls, in cabinets, and on the floor that it was overwhelming.  It is conveniently located near the Clyfford Still Museum and Denver Art Museum.",
  "Ornate museum housing beautiful works of art and home decor. It was interesting to see how many of today’s furnishing are influenced by the furniture designs of the past. ",
  "Decorative arts, fine art, history and so much more.  I spent 3 hours just enjoying all the wonderful exhibits on view.  I would go back today.",
  "The building looks small, but there's a lot packed in there. It was unlike any art museum I've previously visited in the way things are grouped together for display. My husband, who normally doesn't enjoy art museums very much, loved it and was fascinated with so much of what he saw. It was a good n experience to go through the museum with friends. The gift shop is great too. "
 ]
},{
 "name": "Downtown Aquarium",
 "address": "700 Water St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/50/6b/ff/downtown-aquarium.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Animals specially fishes always mesmerize me, DENVER aquarium was no exception, they have a lot of really cool and really colorful collection of fishes and other sea creatures. \nIt’s a Must visit with kids - and don’t forget to see the tiger and pet the sting rays ",
  "Early\nThis is a great aquarium that is easy to explore. We went on a weekday right when they opened and we had the whole place to ourselves. It was wonderful.  You will pay $8 for self park and one child and two adults was $64.50 for only the aquarium exhibits. I would plan one to two hours. There are many great  medium sized exhibits that are easy to navigate. The experience is much more intimate than some of the major aquariums and definitely less hassle. All ages should enjoy. I can recommend this aquarium and I will return again!\n\n",
  "I hadn’t been to the Denver Aquarium in over 10 years, and went back this weekend. I think the presentation is amazing. It is really well laid out and makes it super easy to maneuver and see everything. The exhibits are great for kids and adults and allow an up close exposure to the fish and animals. ",
  "Overall this aquarium was nice with plenty of fish to see. The stingrays were so friendly and we loved interacting with them. My one year old loved seeing all the fish! The food was very good and prices were not bad.  I only gave a rating of two because of the tiger. There is no need for a tiger to be in that place, it is way too small and you could tell the tiger was stressed out. It made us very sad and I truly think it would be much better if that tiger was out of that building.",
  "Loved this aquarium. We spent half a day here and it was great. We go there right when it opened so it wasn't very busy. Many floor to ceiling viewing areas and a ton of information available. "
 ]
},{
 "name": "Colorado State Capitol",
 "address": "200 E Colfax Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/36/b6/66/colorado-state-capitol.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "OK, we did do the pictures outside on the mile high step, I admit it!  The inside of the capitol is quite lovely, and our guided tour was fascinating.  We saw the House in session from the balcony as we toured the building.  The dome is not as bad a climb as I worried and the view of the inside and outside was worth it!",
  "Didn't take the full tour.   Went in on a brief grayline tour stop.  Glad we did, just right for us.  Beautiful brass, granite and murals.",
  "Go on a tour to get the full benefit of this place, but well worth a look at anytime. History and art collide beautifully in this space",
  "This is a lovely building with the mile high step as a feature.\nIt is well worth a trip as it puts this lovely city into perspective.\nThe whole city is really easy to get around.",
  "Did not get to spend as much time there as I'd like but it was beautiful to walk around the building and to just take it all in."
 ]
},{
 "name": "Wings Over the Rockies Air & Space Museum",
 "address": "7711 E Academy Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/b7/f0/bd/wings-over-the-rockies.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This museum is one of the most amazing and delightful museums of its kind, not just in Denver, or Colorado, but, the entire region, if not, the country. This museum was built at the former Lowry Air Force Base. If you’re into the history of airplanes and spacecraft, this museum will tickle your fancy (pique your interest). ",
  "This museum has a good collection of mainly US military aircraft, housed in what used to be a large hanger on what used to be a military airfield.\nYou cannot miss the entrance - there is a B52 bomber outside to welcome visitors.\nMost of the exhibits are US military aircraft, I would hope that at some time in the future, a greater variety of planes are added, there is still plenty of room to fit in extra exhibits\nThere were a number of very enthusiastic volunteers who were happy to talk about some of the displays.\nI found some of the most interesting displays were not the actual aircraft but smaller and poster displays such as the poster display on some aviator heroes from the world wars, German and British as well as American. Also, there are side room displays that should not be missed, such as the Colorado Air National Guard room and the room devoted to female aviators.\nAt one end of the hanger, displays look to the future, space and drone technology. \nAs we had a young child in our party, we did enjoy the excellent small kids space with books, building blocks child play areas.",
  "Has a nice collection of planes, considerably smaller than say the Smithsonian or the National Naval Air Museum but larger than other regional air museums.  The X-Wing fighter is an amusing addition to the museum though :)  Has a good assortment of different types of aircraft and a few nice additions like flight simulators for the kids.",
  "This museum gives you an up close and personal experience with a wide variety of aircraft, including a B1 bomber!  It was very interesting to see the various aircraft and read about how they were used throughout history!",
  "An amazing array of airplanes and flight simulators.  It even has some space stuff and a simulated international space station.  I highly recommend it!"
 ]
},{
 "name": "16th Street Mall",
 "address": "16th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/44/03/e8/denver-s-sixteenth-street.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Fun place to walk around. Lots of shops and restaurants. Some cool statues and art work to take pictures with. ",
  "Great place for shopping and dinning! Large variety of shops and restaurants for family and friends.",
  "We stayed at the Grand Hyatt & walked 2 blocks down to 16th street mall for dinner @ Henry's Tavern. It was great & super convient.",
  "Overall this area is really nice and fun to go to but be prepared to have many homeless people ask you for money. \n\nLots of good restaurants and stores. Nice feature is the free shuttle bus that goes up and down the street. ",
  "The experience of the 16th Street mall is a wonderful time for the entire family.  Interesting shops along the streets; horse drawn carriages; entertainers - the list goes on and on."
 ]
},{
 "name": "Denver Mountain Parks",
 "address": "3000 E 1st Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/35/1d/1f/denver-mountain-parks.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Someone must have been blessed with vision and wisdom when Denver began acquisition and development of its wonderful chain of mountain parks. Many of us who have lived in Denver for decades still thrill to get out of town to one of the parks (Personal favorite is Mt. Falcon) for a picnic or a hike.",
  "By far one of the most awesome experiences of my life so far! - What a concert - what a venue!!!!!  Even with rain - everything went on without a hitch - everyone enjoying themselves - and the view - the amazing view - oh my goodness!!!!!",
  "Red Rocks was the only one of the Denver Mountain parks that we were able to get to, and it was worth the trip. Gorgeous setting, and nice hiking trails. Lots of sun exposure, so go early in the day. Good for birds as well.",
  "Amazing beauty in every direction. Enjoy many different environments as you traverse through these parks. Mountains, forest,valleys, and tundra to name a few. Pictures don’t do it justice. ",
  "Shame that we missed a great concert the week before we arrive and the week after we left! But even without a concert, the views were to die for!"
 ]
},{
 "name": "National Ballpark Museum",
 "address": "1940 Blake St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/dc/aa/f1/b-s-ballpark-museum.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This museum is for everyone, baseball lover or not. The amount of history within these walls is mesmerizing. I could have spent hours here. Great price and everyone was very friendly and knowledgeable. Thank you!",
  "Raelee greeted us the second my friends and I walked in the door, and I was amazed on how much memorabilia is in the museum. From old scoreboard replicas and seats to bobbleheads, jerseys and stadium replicas, this is a great place to visit- whether you are a baseball fan or not.",
  "Very neat place to visit for baseball fans! Extensive baseball memorabilia including signed baseballs.",
  "Love this place. A baseball treasure in the mile high city. Historical baseball collection for everyone. I’m a massive Yankees fan from NY living in Denver and being family here all the time. I have to pull the older relatives of mine out kicking and screaming. Brilliant collection of stadiums around the country. Well worth the time spent here. Pieces are historical worthy of the visit. A Denver must. ",
  "What an amazing find of a museum!   Absolutely wonderful - with so many great exhibits and memorabilia on the old ballparks.  We thoroughly enjoyed our visit and even the people there were amazing in their knowledge of baseball players and teams.  Fun to talk to.  \nIf you have any love of baseball and its history, you need to pay a visit here.  Well worth the effort - and especially if you are already going to Coors Field!  I"
 ]
},{
 "name": "LoDo",
 "address": "Lower Downtown",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/39/e1/1d/lodo.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Like most places! Felt safe enough during the day but it would def be sketchy at late night or women alone. I’m not a person who this bothers a lot until something happens to make me feel vulnerable. But a homeless man had an outburst during the middle of the day- I’d say he was an addict from the looks of him- which I tried not to look but he was throwing stuff from a doorway! The businesses were interesting and the food was amazing at most the restaurants! There are some areas that you don’t see as many homeless people but they are always a few. Mental illness and drugs seem to be a big part of the issue.",
  "If you have not been to Denver,, you will love being in LODO.\nLo(lower) Do(downtown) There are tons of restaurants, bars, stores and easy walking. ",
  "Walked around Lower Downtown and there's a lot of restaurant and places to have a drink. I was on my way to the Pepsi Center so it's a convenient location",
  "Love the artsy vibe in LoDo.  Dairy Block was one of my favorites and is such a fun part of the city to walk around in.",
  "The LODO is home to plenty or bars, restaurants, theater and off Broadway type venues that you can enjoy just about anything including recreational smokes and candy. A must see when traveling to Denver."
 ]
},{
 "name": "Cathedral of the Immaculate Conception",
 "address": "1530 N Logan St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/69/59/db/cathedral-from-the-outside.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I loved this Cathedral. I felt inspired as soon as I walked through the doors. As a protestant I'm always agog at Cathedrals and love to enter the sacred spaces. the stations of the cross are so exquisite. I was literally transported to the passion as I walked them. Must see!",
  "I was looking for the Cathedral and it is beautiful, Gothic style makes it unique in the area. Quiet place to hang out, appreciate its windows",
  "This cathedral is beautifully crafted, but that is not what makes it so special. It is so incredibly peaceful.",
  "My wife and I love to visit old Catholic churches. This Cathedral is one of the more beautiful we've visited.  The architecture is spectacular and the stained glass windows are awe inspiring.",
  "Stopped here briefly Saturday afternoon between our stop at the Capitol en route to the Molly Brown house.  Attractive church interior.  Peaceful and quiet.  A nice stop if seeking a few moments of prayerful solitude."
 ]
},{
 "name": "City Park - Denver",
 "address": "Colorado Blvd. and York St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/59/72/04/lake-and-mountains.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "City park, like everywhere else in the Denver metro has been completely overrun by drug addicted homeless who migrated here when marijuana became legal. We are natives and have watched this city turn into a dumpster fire. During our most recent trip to City Park (with our 8, 5, and 1 year old children) we encountered a used condom and a crack pipe. Hooray. There’s nothing like exposure to disease and drugs during a trip to the museum to make you want to run for the hills. This city is gross now. We hate it here. Good luck to anyone who comes here- I hope you don’t find or step on a drug needle.",
  "the view had the mountains behind the buildings, it was a nice picture but very hard to capture. You have to stand on the steps behind the denver museum to capture it the right way.",
  "This gorgeous park is situated right next to The Denver Zoo and Museum of Nature and Science. My mom and I took a stroll and enjoyed the geese and water view for a good hour after lunch.",
  "This is a really nice park close to where I was staying. I walked past tennis courts used by a local high school. They have Greenhouse a Zoo and a Science Museum.",
  "After visiting the science and nature museum, we needed to unwind from the stress of all the screaming children in the museum.  We took a nice, quiet walk around the lake. The grounds were in excellent shape, no trash and no homeless people looking for handouts.  This is a hidden gem in the middle of a big city."
 ]
},{
 "name": "Clyfford Still Museum",
 "address": "1250 Bannock St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/71/3a/90/clyfford-still-museum.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Enjoyable museum showcasing Clyfford Still's work.  It was very interesting to see his pieces in roughly chronological order, showing his changing style.  I'm not sure I've ever seen it so thoroughly done at any museum for any artist.  This may have been my favorite of the art museums I visited in Denver (of at least 4 total).  I believe they also rotate the pieces on display, so if I lived in Denver, I might visit a few times a year.",
  "What a museum. As his paintings are not found in other museums this really is the place. Didn’t expect to find abstract expressionism in Denver. Must see for those interested in modern art.",
  "Love the idea of a museum housing an artist’s entire work throughout their creative journey. You can therefore really appreciate the growth of Still as an artist and his artistry. The building is also very beautiful with a ceiling that allows natural light to filter through.",
  "Dropped into this museum and was VERY pleasantly surprised! ONLY works by Clyfford Still are on exhibition - which allowed me to really see and experience his artistic evolution. Would recommend.",
  "located just behind the DAM is the Clyfford Still Museum.  His art is Abstract Expressionism and fits in well with Mark Rothko and Robert Motherwell.  His work was unknown to me until this visit."
 ]
},{
 "name": "United States Mint",
 "address": "West Colfax & West 14th Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/c7/c0/98/us-mint-in-denver.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "It has actually been awhile since I have visited the Mint.  I was there for a job interview and was able to see the coin making close up as they took me down on the floor where you don't get to go on the tour as it is too dangerous.  I went on a tour before 9/11 and it was very interesting to see the coins being made.  Everyone had to empty their pockets of change, even the employees.   ",
  "The tour was great, really went by quickly. Lots to see. Make sure NOT to bring a bag/backpack as there is no place to store it as it's not allowed on the tour",
  "Truly a piece of history that extends to today.  Take the tour.  This is great for adults and well as kids.  Just plain awesome.",
  "We arrived at the airport in Denver about 9:30 am, and were not able to get to the Mint until 11:00 am, but they still had two tour times in the afternoon open. (End of January).  It was a wonderful tour, with an excellent guide.  We loved hearing about how coins are made, and some history behind it.  It was totally worth the effort of getting tickets and coming back later that day.",
  "Our tour guide was a combination of humor and facts.  Very interesting to listen to and learn from!  Lots to see!"
 ]
},{
 "name": "Balistreri Vineyards",
 "address": "1946 E 66th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/7c/35/84/balistreri-vineyards.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "What a hidden gem. And by hidden I mean it is literally located in the middle of mega industrial zone. There are cranes and factories everywhere. If you can get past that the place is lovely. Wine tasting guys are very friendly and knowledgeable. Def the reason so many people are buying bottles. Gift shop could use a lot of love but overall it was a nice way to kill an hour before a flight.\n\nWe bought a couple bottles and had them ship them to our home. Very easy process and reasonably priced.",
  "What an awesome place to visit.  Seemed like endless amounts of wine to taste (like over 20) free of charge. Hard to decide what to buy, all was so good!!  Owner was there serving samples- so knowledge of course and super nice as was all staff!! ",
  "We had a lovely afternoon with super good lunch, outstanding wines, tasted 21 from whites to icewine and everything in between. Friendly hosts and nice tour.",
  "This place is amazing! The food is so good it’s hard to believe as you are driving into this industrial area. But it’s better than a lot of fancy restaurants in downtown Denver.  Best lunch I’ve had in a while. Plus the wine is great, the staff is super friendly and happy to bring you tastes of wine to your table. I can’t wait to go here again!",
  "We randomly found this place and so glad we did! The owner John was very nice and informative! The wine tasting features all 20 of their wines...for FREE! We then stopped and picked up some things in the gift shop, and enjoyed a glass by the little creek outside! Highly recommend! "
 ]
},{
 "name": "Colorado Convention Center",
 "address": "700 14th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/76/46/2f/the-big-bear-at-the-colorado.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We have been to the convention center several times for various events.  It is a wonderful place for the entire family.  Easy to walk - facilities for all to use.  LOVE the bear looking inside!!\n",
  "I was recently a guest at the Colorado Convention Center, downtown on 14th.  The facility itself is nice, well kept and convenient.  Easy walking access from many places in Downtown (hotels, restaurants and attractions).  The parking is a bit lacking and signage in parking garage is unclear and a bit confusing but other than that it is an excellent facility.  It is clean with massive halls that can accommodate thousands of guests, vendors, participants and multiple events.  The grounds have a mall style entrance in the front, and the back has a grassy area for attendees to enjoy with a view of the front range.  Overall for a convention center Denver has done a great job with this facility.",
  "Love Denver,so easy to get around.  The convention is center centrally located. Not too far for the AirPort or Central Denver. Great restaurants and easy transportation.  ",
  "The bear is the star of the show here.  We had a very brief look inside during a recent short stay in Denver and were welcomed by everyone inside.  We couldn't see much as there were various events on that we weren't part of, but we managed to photograph Big Blue!",
  "We stopped here for one reason - to get a photo of the ginormous blue bear outside of the building.  If strolling through downtown Denver and if are a photographer, this is a fun addition for your photo shoot spots.  We got lots of great and fun shots of the big blue bear."
 ]
},{
 "name": "Cheesman Park",
 "address": "8th Ave & Franklin St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/18/6a/fe/gorgeous-fall-foliage.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This is a lovely park where people were walking dogs, jogging or enjoying the warm sun on a winter's day.  It has a lovely neoclassic pavilion in the park as well.  ",
  "Wonderful large and open lawn space with room for frisbee, football toss, volleyball, walking the dog, and walking around the park on the sidewalk. Pretty flower gardens by the pavilion and the pavilion itself is beautiful. Great place to relax!",
  "Cheesman park is one of the oldest parks in the Denver area.  It was originally a cemetery.  The contractor who was tasked with moving the graves was paid by the casket. He allegedly cheated the city by faking the movement of hundreds of graves. Many were never moved and are still on the grounds. Hauntings in the area were the inspiration for the movie \"Poltergeist.\"",
  "I live 2 blocks away from Cheesman Park and one thing that I love so much about it is that it's super clean and doesn't have any geese poop. The entire path around the park is a little over a mile so it's nice for a little run after work. They do have a bike path that runs on the inside of the park too.\n\nIt's also way less crowded than Washington Park and not as big as City Park so it's the perfect size. The Pavillion area is known as a place to take photos too.\n\nStop on by!",
  "This is a nice, green, and attractive park in Denver with lots of locals doing a variety of activities. This park is fabled to be haunted, especially some of the unique structures in it. Visited during the day, and had a nice time checking out the paths."
 ]
}]
