[
{
 "name": "Capitol Building",
 "address": "1007 E Grand Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/1e/ca/f4/front-of-iowa-state-capital.jpg",
 "tags": [
  "music",
  "learn",
  "history",
  "library",
  "unique",
  "tour",
  "tour",
  "knowledgeable",
  "tour",
  "library",
  "tour",
  "history",
  "family",
  "knowledgeable",
  "tour",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d1464412-Reviews-Capitol_Building-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Worked at the Capitol during the Legislative season for a decade.  During that time, the building was painstakingly restored to its original beauty. The Victorian detail which had been painted over was rediscovered and replicated.  I never drive by, approach, or enter the Capitol building without immense appreciation for its beauty and stateliness.   Be sure to take the official tour to learn the history, unique attributes, and especially the trip to the dome.  Don't miss the fabulous law library, and take time to read the many quotes on walls throughout the building.  \nFor historical/educational purposes, visit during the Legislative session (January-April).  For Capitol beauty, music and panoramic sunsets, other times to enjoy the view are 1. Music Under the Stars (Sunday PM June-July), and 2. Yankee Doodle Pops near the 4th of July. I would rate Yankee Doodle Pops one of the Top Ten things to do in Iowa!",
  "It is usually possible to get a guided tour of the building lead by guides who are knowledgeable and friendly. Don't miss this strikingly beautiful Victorian architectural gem that has been carefully restored!",
  "I worked here as a page when in high school so I may a bit of a bias. I love the architecture inside and out for this building. The state has done a fabulous job of upkeep. It is worth a trip up the stairs in front or take the back entrance for fewer steps. Great view of downtown.",
  "One of the most beautiful capitols in the country. I am biased, but non-Iowans agree. Tour guides are great and if you happen to run into one of the legislators, they are likely to give you a personal peek in the Speaker's office!  Dont miss the law library.  Some photos are online for a sneak peek. Stop by the Secretary of States office to see the Iowa Constitution! Dont miss it! You have an invitation from the former Speaker of the House.",
  "My fiancé and I took a tour of the Capitol while in Des Moines visiting family. It’s a beautiful building with an interesting history. The guide was very knowledgeable and fun. Definitely check it out if you’re in the area!",
  "We took a tour by ourselves. It took us about an hour to get through everything. The building and artwork were amazing! We thought it was well laid out and accessible with strollers. ",
  "It's a beautiful building, especially the library. The first pic is taken on the side of the building...imagine not seeing the bldg through the trees in the summer.",
  "A wonderful building with many things to see.  Check out the detail of the construction and all of the wonderful paintings.  The model of the USS Iowa is worth a look as well."
 ]
},{
 "name": "Iowa State Fairgrounds",
 "address": "3000 E Grand Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/f5/d5/13/you-won-t-go-hungry-with.jpg",
 "tags": [
  "history",
  "food",
  "free",
  "kids",
  "art",
  "music",
  "free",
  "free",
  "food",
  "food",
  "walk",
  "food",
  "kids",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d274242-Reviews-Iowa_State_Fairgrounds-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "There is truly something for everyone, whether you browse the vendors under the Grandstand or in the VI Building, or watch the Husband Calling Contest in Heritage Hall.  There's the tiny museum of Fair history, and a huge model train display.  You can watch demonstrations of Dutch oven cooking at the DNR Buiding, and admire the Butter Cow and other sculptures while strolling through the Ag Building sipping your honey lemonade or munching a sample hard boiled egg from the Egg Council.  Visit Little Hands on the Farm with your children.  From the Biggest Bull to the newest baby piglets, there's something new to see every day.  Many quality free shows and concerts throughout the Fairgrounds, as well as the paid nightly entertainment at the Grandstand . Fabulous food all over the Fairgrounds, including  hidden gems like the old-time soda fountain with real old fashioned malts and shakes.  Watch a chain saw carver create a work of art in a few minutes, sing along at the Hymn Sing at the little church, or hold your breath while four year old kids try their hands at mutton bustin'. The midway is typical. You can park and ride from Southeast Polk High School on the east and the Capitol grounds from the west.  Parking in these two places is free, and the bus ride is $2, with veteran discounts, and discounts for prepurchased Fair admission. Parking on the grounds is available for a fee.  You could attend all 10 days of the Fair and never experience it all. ",
  "Been doing the fair since I was born - and it's still a minimum 2x a year visit still. Honestly, it takes a full two days (and nites) to get the real experience. So - to keep the list short here are some must dos:\nGiant slide\nSki chair ride over the main drag\nCorn dogs (veggie too!)\nBaby animal barn\nButter cow\nIowa beer tent\nFree music stages\nPork chop on a stick\nIndustrial building \nMidway \nAt least one grandstand concert\nAnimal barns - horses and pigs r cool!\nAs much free stuff as u can carry\n\nI think u get it - and this is the smallest of must do's - enjoy",
  "Lots of things to do! Plan on spending several days to be able to see everything. Lots of on-site parking is available. However, local residents offer many options for parking as well as several \"park-and-ride\"sites are also available. Many AG events including horse, cattle, swine shows and competitions as well as a large Varied Industries building with many exhibits and services. The Fair also boasts just about every kind of food imaginable! Anything grilled is a must try! Simply amazing Pork Chop on a stick, bacon wrapped ribs and bacon brisket bomb are irresistible! Large midway with many rides for folks needing more excitement in their lives along with multiple free entertainment entertainment stages are everywhere. Grandstand events are sure to please by offering a wide variety of acts from Country ti Hip Hop. Also, dont forget many on site restaurants also have live bands both day and night with something for just about everybody. Make certain to pick up a guide to Fair events, available in multiple locations, to assure you see everything you are interested in doing!",
  "We have been to several state fairs, Indiana, Kentucky. I was really impressed with the Iowa state fair. The people were really nice, the fair grounds were clean, prices were not bad at all, attractions were plentiful. The parking can be a challenge if you arrive later in the day. Exhibits were interesting but I guess what was most surprising that there wasn't any \"wild\" behavior or \"craziness\" you would typically find at state fairs, just nice friendly people.",
  "You have to visit the Iowa State Fair once in your life. This is a classic, and a huge one. Be prepared for all the usual stuff only bigger and better. Its worth spending a few days to get the whole experience, but be aware, it can be hot.",
  "In general, the Iowa State Fair is ridiculously overpriced. The main reason we even go is to people watch. You can see some of the best species of people around. Things you'd never think you'd ever see. Children seem to have a good time here, but be prepared to spend a lot. Also the ATM's on site charge a massive surcharge, so it's best to get cash before you get here.",
  "Never miss the greatest show on earth. Best food, best  people watching, best  everything. It's pricey but well worth it.",
  "Very high priced just to get into this place.   $10 - $12  a piece.   Another $10.00 just to park your car and then you WALK a hundred miles .   But.... I must say the variety of foods is fantastic !   BUT also VERY expensive !     $5.00 for a watered down glass of lemonade ?    Pop, the same.   AND it is wall to wall people !   Very little courtesy.",
  "Best food, hundreds of different foods, craft beers, rides, animals and more animals.\nNew experimental foods,  great deals on hot tubs, mowers, food ",
  "We stayed one night in our motorhome. The area was muddy and not level, but what is to be expected from a large campground (over 3,000 sites).\nIt was VERY difficult to find the campground from the main road as it was down season and they are not allowed to have signs outside the grounds.\nPerhaps there can be a sign as soon you enter? The first we found was about 1/4 mile in.\nThe hosts in the Brown Cougar were great.",
  "Iowa’s fair is so much fun for the family and kids. Rides, food, chuck wagon races, horses, other fArm animals, tractors and so much to buy. Great time"
 ]
},{
 "name": "Blank Park Zoo",
 "address": "7401 SW 9th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/0c/f2/b7/entrance.jpg",
 "tags": [
  "kids",
  "kids",
  "walking",
  "active",
  "drink",
  "kids",
  "walk",
  "kids",
  "kids",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d274244-Reviews-Blank_Park_Zoo-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Love love love this zoo for an easy day trip! It's small, but definitely packed with some punch! A fun zoo! Kids bored, this zoo you could get through easily in a couple hours or so, and the kids would love it and I dont feel it ever gets old! Very impressed with all the changes since i was a kid! Will most definitely continue to go!!",
  "Had a great time. Perfect weather and get a close up view of baby girl,Kamala! We saw all 5 lions outside and the camel ride was a hit with our grandchildren!",
  "Beautiful, just the right size Zoo to visit in a few hours. The outdoor animal cages were perfect for viewing, and the foliage from the trees provided a wonderful sun cover and an air conditioned feeling when there was even a slight breeze.",
  "Fine for the kids but this zoo is pretty small. Don't go out of your way but if you are trying to keep small children busy on a Saturday it is an okay outing.",
  "We are from Omaha, NE and came up to Des Moines for a weekend visit. We love the Henry Doorly Zoo in Omaha but the Des Moines zoo was great and had lots of exhibits and you can honestly tell that the people here care about the animals and put a lot of time and money into this zoo. The day we went it was a little bit chilly so some Animals were not out. There were lots of things we absolutely loved about the zoo though. One of the things was the Adventure Area that you walk into straight from the entrance. It had the rain forest and then the aquarium and the birds and lots of other great areas. This took us about a half hour to go through because you can see so many different things. One of our favorites was the bird area because they were so close and flying all over the place and they were so active. Another great part was the turtles. They were swimming around and all over the place. But I love turtles! I also really liked the big amazon fish and how close you can get to them and see how big they really are. They were huge! Also they had this area where you can see all of the bats in their habitat and it was really neat being able to see them when they are sleeping. A couple of times they even flew back and forth. When we exited this area we went to the Kids Kingdom area where the goats were. Mind you I went with a group of 5 people all of us in our 20's and we spent so much time with the goats and llama. They were so fun and seeing them run over the bridges that go between each area was so neat! I absolutely loved this area and wish that our zoo had something that neat. We also loved the playground. It was a really nice large playground with lots of aspects to it. Including the deck that goes out onto the lake. The playground is great for kids because they can get sick of walking around and just want to go waste some energy. This was a large wooden playground and had lots of fun things on it like a rock wall and a few slides and other parts. After that we went to see the sea otters and the lions. One of my other favorite parts was the Prairie Dogs display. We climbed into the middle and the groundhogs were running around and it was neat seeing them from both sides. That was a really cool addition they added. After this we went to see the Sea Lions and the penguins which were both outside. The Sea Lines were doing a feeding and they did some great tricks! One of my favorites was with the ball they would bounce at it and then they would swim over and wave at you. It was great. We also went to the penguins and they were so funny! If you could get a big enough group to cheer for them then they would all swim REALLY fast and start doing tricks and jumping out of the water while swimming and things like that. They were so cute and funny! But you had to cheer for them before they would do it! After that we went to see the Lions and Tigers which were sleeping. The lions were sleeping right in front of the window and they were HUGE! Also the monkeys and the bald eagle. The monkeys were funny. One of them was chasing a chipmunk through the exhibit and that made me laugh. Last of all was one of my absolute favorite and it was the Red Panda. This panda was SO FREAKING CUTE! It was adorable. He would run around and run up into his little hut and drink from the fountain. He was so adorable! It was ridiculous how cute he was. Overall the zoo was absolutely amazing. It is not a huge zoo with a zillion animals, but the difference is they have a quality zoo with quality animals. They really put a lot of effort and time into making this a place people will enjoy and I honestly loved it and will be coming back. It was a great experience and I think if you go in expecting it to be like the Brooklyn Zoo then you are going to be disappointed. But I was in love with this zoo and I think it is great!",
  "I am spoiled when it comes to zoos.  I grew up going to Brookfield Zoo near Chicago.  There really is nothing wrong with Blank Park Zoo.  It is a fine place to take the kids for half a day.  It is clean, well planned out and the staff is very helpful.  There just needs to be more.",
  "A great place to spend a day with  kids.  The zoo Is easy to get around. There are many great exhibits to enjoy and kids are able to feed some of the animals. There’s also a train that kids love to ride to get an overview of the zoo.",
  "Love love love this zoo for an easy day trip! It's small, but definitely packed with some punch! A fun zoo! Kids bored, this zoo you could get through easily in a couple hours or so, and the kids would love it and I dont feel it ever gets old! Very impressed with all the changes since i was a kid! Will most definitely continue to go!!",
  "My wife and I arrived to the zoo around 3pm, Saturday, October 19th.  The parking lot we were in seemed nearly full.  There were many children there, dressed up in Halloween costumes.  Too cute!  On top of that, it was a beautiful afternoon.  We were in the zoo in no time at all. This was my first time to this zoo.  It is a smaller zoo, but the admission price seems very fair.  We had a great time and even as busy as it was, it was a great visit.  I would visit again.",
  "Blank Park Zoo is not the biggest zoo but you can still enjoy a nice day there, specially if you have kids. The zoo in general is very well taken care of and all the animals are simply adorable.",
  "The zoo is small, but well taken care of. The giraffe and penguin displays were my favorite. There were many families enjoying the day. There is a train for the children to ride and a petting zoo. "
 ]
},{
 "name": "Gray's Lake Park",
 "address": "2100 Fleur Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/2a/12/5a/photo0jpg.jpg",
 "tags": [
  "hike",
  "kids",
  "walking",
  "walk",
  "walk",
  "walking",
  "family",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d2478032-Reviews-Gray_s_Lake_Park-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Good place to hike on a smooth surface. Easy to get into plenty of places to park, picnic, swimming is also available. No lifeguards on duty so keep close eye on everyone.",
  "I love Gray's Lake Park near downtown Des Moines.  The only reason I gave 4 stars instead of 5 is because it is so nice that it becomes extremely crowded in nice weather, and the crowds of families walking with kids and strollers and not paying attention to the fact that there are others around can be very frustrating.  This crowding can also make it difficult to find parking.  \n\nHaving introduced that caveat, I still love it.  I believe the paved trail is just shy of 2 miles - 1.9 I believe, but it also has extensions that take you along the river to link up with the riverfront trails downtown, and also to Water Works park across Fleur Drive.  The Gray's Lake trail is part of several running events, including the Leprechaun Chase and the Des Moines Marathon, and the lake itself has been used in the past for the swim portion of the Hy-Vee Triathlon.\n\nThe path is well done and beautiful, with a lovely walking bridge that has a nice colored light effect at night, and there is a point on the trail where you have a fantastic view of the downtown skyline across the water.  There are plenty of spots to stop and sit on a park bench, and you can rent boats if you want to get on the water.  There is also a beach if you want to swim.  I've seen people paddle boarding, kayaking, fishing, canoeing, biking, walking, blading, running…there is something for most everyone here.  There are decent bathroom facilities positioned along the trail, so you aren't squatting in bushes or dealing with port-a-potties.  There is a concession area open during the warmer months, and they occasionally have outdoor movie nights.  \n\nIn recent years, they have also started hosting Yoga In The Park, which draws a good crowd and is a beautiful way to begin a Saturday morning.\n\nI definitely recommend Gray's Lake Park for the person looking to enjoy the outdoors, especially if you are looking for a good running route that makes it easy to keep track of mileage, just be advised that on the nicest days, you will need to brace yourself for crowds of people who don't really pay attention to the people around them.",
  "We visit here often. It is a beautiful walk especially about sunset. Worth stopping to see if you are passing through des moines in the evening.",
  "Come here a lot to bike, walk my dog, exercise and just enjoy one of Des Moines best things to do. Love this park!",
  "Gray's lake has so much to do! walking trails, fishing, and paddle boating are just a few options for the whole family. With the new underpass walk trail opening up to Waterworks Park, this is the place to enjoy the outdoors in the greater Des Moines Area. \"Like\" their Facebook page for details on night events at Gray's lake.",
  "Nice pedestrian path. Almost 2 miles full circle. Great biking venue. Eagles nests sometimes visible. ",
  "Cute park, great little beach area, and a wonderful clean trail! We love going for walks here! Recommend 100%",
  "Brought a lunch and had a picnic next to the lake.  It was June and the weather was perfect.  Nice place to bring the kids and just let them run around. "
 ]
},{
 "name": "Pappajohn Sculpture Park",
 "address": "1330 Grand Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/f2/99/ea/pappajohn-sculpture-park.jpg",
 "tags": [
  "kids",
  "music",
  "art",
  "food",
  "art",
  "unique",
  "walk",
  "kids",
  "free",
  "library",
  "art",
  "kids",
  "free",
  "art",
  "free",
  "walking",
  "free",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d2425389-Reviews-Pappajohn_Sculpture_Park-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was very nice place to get out of the car and run around and take in some wonderful outdoor sculptures.  Kids very much enjoyed it, and we were all impressed w the downtown area.  Great place!",
  "The Sculpture Park is a beautiful and interesting collection of larger-than-life pieces set in a very nice green space at the West end of downtown Des Moines. The park takes up several city blocks and there are walkways that wind through it and benches to sit and linger. The area surrounding the park hosts a wide variety of eateries offering everything from fast food to fine dining. A number of events are held in the park throughout the year ranging from music concerts to art fairs.",
  "Right in the heart of downtown Des Moines, this park really provides a wonderful respite from the hustle and bustle of everyday life. It draws you in to every piece of art; very interactive. ",
  "This is all in about a 2 block space.  Nothing exciting except the sculptures are super cool.  Make sure you have change for the meters as there doesn't appear to be freee public parking.  The sculptures are all unique and it's just a nice little walk in the middle of downtown.",
  "Kids will enjoy these odd sculptures and have fun running around on the grass. It is a great place to have a picnic and The Central Library is also close by (but check library's opening times.) Free fun for all.",
  "Everyone should stop in and see the wonderful art work in this park, its a great asset to downtown Des Moines and its close to so many resteraunts.  Check it out at sunset if you have time, my favorite time to go.",
  "One of the highlights of our day in Des Moines. The weather was nice, the sculpture collection was interesting,my kids got to run around, and the garden is surrounded by lively cafes and such. Great photo ops here. FREE.",
  "Varied assortment of sculptures in a downtown park.  Great for photos of the art or your significant other and you.  My favorite is the one shaped like a human head out of letters.",
  "If you only have time to see one thing in Des Moines, visit the downtown sculpture park. It is a community staple that never closes and never gets old. Surrounded by lunch and dinner options from $-$$$, local and chain coffee shops. Free to visit.",
  "We really enjoyed walking around and looking at all the neat sculptures. Nice area. You can park right on the street at metered parking.",
  "With all this space they could fit more in. \n\nSome of the ones that were there I could have done better in my high school welding class. I guess art is in the eye of the beholder. \n\nThe descriptive plaques don't line up with what you are looking at and it wasn't until 1/2 way through I found the stand with brochures. \n\nLots of potential to develop this area with more sculptures, maybe with the \"sculptures on parade\" type lending system?\n\nIt was great for the price I paid (free) but then again what is \"art\" is in the eye of who is looking at it."
 ]
},{
 "name": "Principal Park",
 "address": "1 Line Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/9a/c7/18/principal-park-at-sunset.jpg",
 "tags": [
  "kids",
  "eat",
  "family",
  "food",
  "drink",
  "food",
  "family",
  "drink",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d1752074-Reviews-Principal_Park-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Go several times every year and have been for 35 years.  Really nice park with some family friendly features.  Water fountain for kids to splash around on a hot day, picnic tables to make it easier to eat with kids.  Of course, food and drinks are too expensive, quality is sub par, so they should allow food trucks pre game in the parking lots.",
  "This is a fairly clean, well kept park.  The parking isn't that great, although there is parking right next to the park, but the road in and out, along with the parking isn't the best for keeping tempers even.",
  "This is a friendly place, no metal detectors, no hassle about having a backpack.  Decent sized seats, and lots of choices for food and drink.  The vendors are friendly and the prices are about what you expect to pay at a baseball stadium.",
  "It was a Sunday morning and we were going somewhere else and it was full.  Driving around we decided to see if the ball park was open.\n To our surprise it was and it was good. normal breakfast goodies and fabulous omlets.",
  "Minor league baseball is a hoot!  These guys play so hard trying to make it to the big show or just for the love of the game.  The park is a great place for a family, a date, or even just by yourself!",
  "If you are a fan of baseball, then this is a great venue to watch a game.  The stadium has been added onto in the recent past with more seating and kid-friendly activities.  There are some local food and drink vendors that make the stadium feel a little more like home.  Win or lose for the Cubs, it is still a great stadium to experience.",
  "This is a beautiful baseball park with a wonderful view of the Iowa state capital easily seen over the fence.  There are lots of treats but expect to pay a bit more here than at a convenience store.",
  "By all means go out there and support our local ball club.  What a beautiful park, and before you head into the game you can walk around the area and take in a restaurant, pub, or two with friends.  We've made this a yearly trip!"
 ]
},{
 "name": "Downtown Farmers Market",
 "address": "555 Walnut St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5c/b4/c9/polk-county-court-house.jpg",
 "tags": [
  "music",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d273761-Reviews-Downtown_Farmers_Market-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Too many people, too many dogs. Rotten parking situation.  Fraudulent vendors buying produce at hyvee and fairway then turning around and reselling it. Fraud! Perpetrators of fraud.  Lousy experience.",
  "Downtown Farmer's Market is an amazing place to meet new people, experience new foods, and simply enjoy a day in a festive atmosphere.",
  "The downtown famers market is literally a smorgasbord of delightful temptations. There is something here for everyone. It's great for couples, families and even pet friendly. The long lines at some vendors is a tip that something really good is happening there!",
  "We have been coming to this farmers market for years - and I remember how Jaw-dropping it was the first time I went!  It’s huge and so much fun!  Everything you can imagine and more - all the farm fresh fruits and vegetables you can imagine, home baked goodies like fruit tarts, huge cinnamon rolls, cakes, and  cookies.  Honey, salsas, wine, crafts vendors, flowers and plants, live music, doesn’t town bars and restaurants, and don’t forget all the breakfast food trucks!  Popcorn, coffee stands, balloon animals, ethnic foods, spices, jellies... so much of everything!  You have to experience this!",
  "I shop the veggie stands mostly, but usually find a variety of stands to choose fruits and other tasty things to nosh on while shopping. Lots of people. I love my dog but wish people would leave theirs home , unless a service dog, as streets are very crowded without maneuvering leashes."
 ]
},{
 "name": "Greater Des Moines Botanical Garden",
 "address": "909 Robert D Ray Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/f7/87/0a/20180714-144046-largejpg.jpg",
 "tags": [
  "family",
  "walk",
  "kids",
  "walk",
  "art",
  "kids",
  "food",
  "family",
  "music",
  "structure",
  "family",
  "walking",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d266364-Reviews-Greater_Des_Moines_Botanical_Garden-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "My family visits about once a year, almost always during the winter.  On a cold winter day, this is an oasis!  Great venue for meetings as well.",
  "It is winter and yet inside this botanical garden, it gives us the tropical summer feeling!!\n\nThere’s plenty of blooming orchids flowers, ripping bananas on a tree, gardenias, ferns, and other tropical plants to see.\n\nThis place is good to hang out!",
  "It was a cold, but sunny day - I happened to be in town and wanted to visit.  The inside plantings are beautiful - so many things to see - the lady in the gift shop was so nice and very friendly, just visiting with her made my day!  The gardens were not crowded so you could linger at your favorite plants - the outside walkways make for a nice (but cold) walk - I want to come back during the spring to see the roses....    Overall, beautiful plantings and a pleasant way to spend an afternoon - I'm glad I went",
  "Under new leadership, the Botanical Center and Gardens has really changed and improved since 2014. To get there, take the 6th Street exit off of 235 on the east side and head to Des Moines Street. Turn near Albas and head west to the end at the city building at Robert Ray Drive. If you turn north here, you will go under 235 and end up at the Botanical Center. The East Side entrance has been closed during construction. Visit the center on a Tuesday – Sunday between 11 am and 2 pm when the Trellis Restaurant is open and stop in for lunch. Lisa LaValle who used to run the Art Center restaurant is running Trellis. She always has a soup, salad and an entrée or two as options and you can also chose any two for a lovely, light lunch. Some of the lunch options are better than others (my older lunch companion did not enjoy a recent messy egg salad sandwich) It is always crowded, so arriving at the start or end of the lunch rush is usually a good bet. After or before lunch, visit all of the walkways of the inside garden dome to feel as if  you are visiting a tropical rain forest of Costa Rica. If it is April – October, walk outside and see the new ponds and outdoor gardens with waterfall. They have set up the gardens with lovely vistas to make the space seem larger than it is. The native planting, great in every season, gives you ideas for your own garden. You can also see the expansion plans on a slide show in the lobby area. While you are entering or leaving, visit the Center Shop. There is a great selection of cards and garden oriented gifts, especially for kids.",
  "This is a great place to take kids in the winter. It is warm inside and you can enjoy the plants.",
  "The botanical is excellent, not only can you find a wide variety of plants and explanations on their properties, but sometimes they also have artistic gardening exhibitions.\nThe gift shop has many educational toys. It is volunteer run, and these people do a great job in many areas.\nDo not skip the café, their food is really really good!",
  "My family visits about once a year, almost always during the winter.  On a cold winter day, this is an oasis!  Great venue for meetings as well.",
  "Visited the botanic garden in the winter, admittedly not the ideal time to fully enjoy and get full value for admission.  The domed structure is noticeable from I-80 near downtown Des Moines.  Easy/free parking on a Sunday was nice, and friendly desk staff.  The enclosed dome was nice for allowing natural light to bathe the interior, and ramps/stairways nice for taking in different perspectives.  However, found the plant variety to be average, compared with Omaha's Lauritzen Gardens, the Missouri Botanical Gardens in St. Louis, and Denver's similar offering.  The Gardens does seem to be a place for horticultural/botanical research, and that is commendable.  Live music was about to start when visiting.  Might revisit during the spring/summer when the outdoor gardens are in bloom.",
  "Beautiful kool different plants and trees to see wonderful experience for family and children also peaceful",
  "The Botanical Garden is a great place to go to relax, to take photo’s, have a wedding, take a class, so many things to do there. The greenery and flowers are beautiful and you can spend hours there just walking around taking in the views. We love to go there. Our daughter got married there 25 years ago. Beautiful!!!",
  "We were so lucky to stumble upon an excellent Learn Saturday lecture. The speaker discussed vegetables transported from Africa. I wished that we had arrived earlier. Every Saturday, the gardens host a different speaker. I was in town for a business trip and was able to squeeze in a trip to the botanical garden. Most gardens host speakers during the week and us workers miss out on the fun."
 ]
},{
 "name": "Des Moines Art Center",
 "address": "4700 Grand Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/a5/84/b9/des-moines-art-center.jpg",
 "tags": [
  "free",
  "art",
  "art",
  "free",
  "art",
  "food",
  "art",
  "art",
  "food",
  "kids",
  "family",
  "free",
  "art",
  "history",
  "free",
  "art",
  "structure",
  "delicious",
  "free",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d262761-Reviews-Des_Moines_Art_Center-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is not a huge museum, nor is it comprehensive. However, it is possible to get a reasonable look at their exhibits in 60-90\", which worked for us. It is not overwhelming, but neither is it a disappointment. A number of major artist's works are on display, and the variety of the pieces is refreshing. The buildings were designed by 3 prominent architects, and all are impressive. Admission is free. Check it out!",
  "This museum has a very impressive collection. Picasso, Hopper, Rothko, Warhol, Weiwei, Basquiat, Koons, etc. If you are a fan of art, you will enjoy this museum.",
  "I have traveled to many cities and visited many an art museum, and I can tell you the Des Moines Art Center surpasses most.  The building, which is a work of art in itself, houses a permanent collection of pieces by an astonishingly diverse and renowned number of artists.  Rotating exhibits are as unexpected as they are thought-provoking.  I am not an art snob.  I will admit, there's a lot of \"art\" out there I just don't get.  So I may be just a hick from the sticks, but I put on a grin as wide as the horizon when I take visiting friends to this gem and watch their jaws slack with awe!  This place stuns!",
  "This is a free stop.  The art is great, the gift store is good, has some classes, and some food.  it's clean, is going through some renovations so a bit more difficult to get into, so check first to be sure it's finished.",
  "We went to the Des Moines Art Center to see a specific exhibit, but it was the other displays we really enjoyed the most. The DMAC has an odd collection of work, many pieces from very famous artists (Dali, Worhol, etc.) but they aren't \"typcial\" examples and that makes them all the more fun to see. While this might not be the best place to bring young children, the park and sculpture outside will keep them busy if you need to trade off viewing and tending children. \n\nOne particular piece to see is what appears to be a pile of sunflower seeds. Don't dismiss it. Read the information about it to appreciate it. It is simply amazing. ",
  "Visit for the art but stay for the flowers on the grounds and the food in the cafe.  A lovely setting.",
  "We visited as a family with 2 kids ages 5&9. They were given art “bingo” sheets to help get them engaged with the art and several works included nearby “kids”plaques with thought provoking questions to help introduce child to the gallery experience or to help them think more deeply about the art. It’s not a large museum but the collection is impressive and includes some very famous artists. They also bring in temp exhibits. It’s actually the perfect size for family visits, as the kids have fun but are not there long enough to get bored. FREE admission. Definitely worth a visit!!",
  "Decided to visit this museum as a cold, grey winter day escape.  The building is a striking architectural structure, set in a stately neighborhood on the west side of Des Moines.  The free admission was a source of attraction for the visit, as was the 4.5-star TripAdvisor rating.  As someone who really enjoyed art history in college and appreciates the discipline, I was sorely disappointed.  The front desk attendant and gift shop associate were very personable.  The size of the permanent collection was, frankly, unimpressive.  The galleries hosting the temporary exhibit featured a bizarre collection of what appeared to be pastel cellphone sculptures from the ceiling, with gold-tinted foil scattered on the floor.  The representational art collection was small in its holdings.  Moved through the entire museum in only a half hour.  I am open to cultivating an appreciation of modern and contemporary art, but this did not strike me as particularly modern in character, and was devoid of artistic merit.  Cannot anticipate revisiting, and fell well short of experiences at Omaha's Joslyn Art Museum (likewise offering free admission), and Kansas City's Nelson-Atkins (both about a two-hour drive).  Surprising that a more robust art museum does not exist in the state's capital.",
  "I was not expecting a museum like this!!!! What a jewel. We ate at the restaurant and it was delicious.\nI have no idea what museum the guy that complained about the gender neutral was in. I never saw any and even if I did I thought we have all grown past that kind of judgement.",
  "Was waiting for a few phonecalls in the area . Caught the perfectionism and landscape of the outside. As I walked the property was amazed that the perimeter was spot on. Having a problem being a compulsive perfectionist found tube property a great invitation of motivation to come visit.",
  "Our guide helped me understand modern art in a way I could finally appreciate it, so grateful.  I loved the variety of art shown from sculptures to Japanese Prints to Impressionist paintings. This art centre is free and so welcoming.  We also enjoyed the rose garden, a perfect mid day excursion."
 ]
},{
 "name": "State Historical Museum",
 "address": "600 E Locust St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/ac/26/20/state-historical-museum.jpg",
 "tags": [
  "history",
  "free",
  "tour",
  "history",
  "free",
  "walk",
  "history",
  "knowledgeable",
  "history",
  "learn",
  "history",
  "music",
  "free",
  "family",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d777965-Reviews-State_Historical_Museum-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Here's a fine place to dig into your curiosity about Iowa!  Whether you grew up here, or not, there's something for everyone.  As someone who loves planes and flying, I was most delighted with the planes suspended from the ceiling (brought back memories of the planes suspended from the ceiling of the Museum of Science and Industry in Chicago).\n\nFYI:  For those who love all-things-political, the Museum has an excellent collection of campaign buttons, ribbons, hats, and even plates (perhaps for those fund-raising dinners).  Although there are stairs, there is an elevator available, so please don't miss the Museum's highlights just because you don't know about the elevator!  Now you do!\n\nIf there were one thing I wish were different, it would be the giftshop:  The day we visited, it certainly seemed as if the shelves were bare (as in \"out of stock\").  Why would there be such a place filled with \"lively\" Iowa history, yet matched up with a hardly-stocked giftshop?  (Note:  If you stock it -- we will come!) ",
  "For a free museum this place can't be beat!  Very detailed exhibits that go on and on.  I was surprised by how large the museum is.  Parking in the area is a bit tricky but that is the only negative.  We picked it on a whim as a time filler but put it at the top of your list.  You won't be disappointed.  ",
  "Can't beat a free admission. It's a good way to pass a couple hours on a Sunday afternoon. Several floors of exhibits. I was most interested in the natural history section highlighting hunting and farming. Short walk to the capitol building if you have extra time to incorporate a tour there into your trip.",
  "Very nice museum about the history of Iowa. The Iowa bike race exhibit was interesting since I never heard of it. The communication exhibit was also interesting. The staff was knowledgeable.",
  "Very large museum whose interesting collection goes from prehistoric times to the 19th century.. Each hall has its own style and is beautiful.\nHowever the wealth of information covering the history of this immense country is described in Russian only (very few sparse, meager English notes here and there)  which makes it impossible for any foreigner to understand.\nEven with the best of will, the whole experience is utterly frustrating.\nSo, either you learn thoroughly about the museum collection ahead of time, or you hire a good guide!\nIn addition to the huge main collection, the museum hosts several temporary exhibits next door: \"Faberge\" was one of them, unfortunately very small and not worth the extra money if you have already seen the Faberge masterpieces at the Kremlin Armoury Chamber.\nI must admit that I found the 1812 Museum across the street (about Napoleon's invasion of Russia and Moscow, and his subsequent failure) much more interesting and accessible.",
  "Some very cool exhibits highlighting our state. Across from the capital near everything downtown. Was a joy to see some history of our state.",
  "Family of six with 3 teens and a seven year old and everyone loved it and it was free. Lots of great local exhibits and had a local movie and music exhibit that was outstanding. They were currently dealing with a lot of leaks in the roof so there was some exhibits that were closed but we spent at least 1.5 hours there. Right down the street from the Capitol building also ",
  "Travelled a long way to do research at the state library, only to find out it was closed on Mondays and Tuesdays.  Even though the people at the info desk were nice, they didn't know that the library was closed.  I can't really say much about the facility except express my disappointment that what I needed to see wasn't open."
 ]
},{
 "name": "Science Center of Iowa",
 "address": "401 Martin Luther King Jr Pkwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/d3/ba/4a/science-center-of-iowa.jpg",
 "tags": [
  "kids",
  "food",
  "kids",
  "theatre",
  "food",
  "kids",
  "history",
  "learn",
  "kids",
  "kids",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d2243700-Reviews-Science_Center_of_Iowa-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Kids will love it.  Very interactive and fun.  Great demonstration.  Parking is an issue and a bit difficult to get there.  Food court is good but spendy.  Storage lockers for coats etc. are only 50 cents.",
  "The science center offers fun activities for the kids.  We have a membership and have gone frequently so I can say that as an adult I am worn out with it.  But they get a new themed exhibit a couple times a year that we go check out.  They have food which is actually pretty good.  We have seen the Imax a few times.  My favorite things are the special presentations they offer- one is about electricity and one about chemical reactions, and they have one where they show some of the creatures they have and you have a chance to touch them.  I enjoy the room with the critters in it and the star theatre.  The kids favorite thing to do is build rockets and if that is too busy they like building lego cars to race.  It can get very crowded on weekends, it is much nicer during the week.",
  "DaVinci and Egyptian Mummies are only 2 of the recent special exhibits brought to the Science Center!  Get a year pass for Science Center, Living History Farms and Blank Park Zoo and you and the kids (or Grand Kids!) will learn and have fun the whole year!",
  "This is not your average Science Center!  They provide areas here to really get the older kids thinking.  Multiple levels to explore.  They learned coding, explored the lego areas, built an arch, made paper rockets to shoot, and make their own robots to take home!  Many other fun activities too.  The parking garage is right across the street.  Look up online when they are busy and they get a lot of daycare and school groups there.  It gets really crowded.  I would plan for 4 hours or so here.",
  "This science center is definitely geared towards kids 3-9 years old and they do great with that audience. The exhibits are interactive and the topics covered have decent variety, but save for one or two exhibits they don't change much. \n\nNot great for older kids or adults. They do a mixology night for the 21+ crowd that is fun but most of it centers around booze and not science. \n\nThe WHO weather people have a station there which is an awesome experience for everyone.",
  "It might be cause we didnt have small children with us but I wasnt a fan of this science center at all. I got lucky and got a bogo ticket package on groupon. The shows they put on were good but short. The exhibits were few. Im sure my younger than 10 nieces and nephews would have liked it",
  "If you want to go to a place where kids can spend their time doing hands on activities, this is a great choice.  There is activity after activity to be involved in. ",
  "Interesting place to take your kids.  Lots of variety and they change up certain areas so it is not always the same."
 ]
},{
 "name": "Des Moines Civic Center",
 "address": "221 Walnut St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/92/d0/18/des-moines-civic-center.jpg",
 "tags": [
  "performance",
  "music",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d7066787-Reviews-Des_Moines_Civic_Center-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great seats not overly priced snacks and drinks. Easy access to off street parking and they also offer valet parking. We loved it!",
  "I have been to the Civic Center twice recently, for the musicals \"Mamma Mia\" and \"Jersey Boys\".  The venue is very comfortable and the acoustics are great.  Parking in downtown Des Moines can be tricky, but we used a ramp that was only a block away.  We will be back for more performances since the Civic Center is a great place to go for an enjoyable evening.",
  "No matter where you seat is located in the Civic Center, you will be in a good spot.  You can see the stage & hear the sounds in any seat in the place.  The shows presented there are great!  Good management & the staff is friendly & helpful. Not the best location for parking close-by, but there are big parking lots a block or more away.",
  "We went to see the Broadway show of Anastasia and it was beautifully done. We are never disappointed going to the Civic Center and their customer service it always impeccable!",
  "The Des Moines Civic Center is a Must See for all. This venue is excellent to view broadway hits such as Beauty and the Beast and Mary Poppins! Their variety in performance is unparalleled. ",
  "What an amazing, moving, wow experience!  Acting, singing, dancing and of course music were all awesome!  Kudos to Des Performing Arts for bringing this show.  Civic Center staff deserve recognition as well for communication prior to show, security at door, efficient, friendly staff.  Thank you for an all around great experience.",
  "Just went to see Jesus Christ Superstar. The show was amazing. The perfect place to spend an evening.",
  "DM Symphony Orchestra conducted by Maestro Guinta performance was excellent and enjoyable. Gil Shaham, violinist extraordinaire, delivered a virtuoso rendition of the Tchaikovsky Violin Concerto in D Major. A delightful, rare experience Sunday afternoon in DM. \n"
 ]
},{
 "name": "Salisbury House",
 "address": "4025 Tonawanda Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/7f/78/f4/salisbury-house-des-moines.jpg",
 "tags": [
  "tour",
  "tour",
  "art",
  "tour",
  "knowledgeable",
  "tour",
  "walk",
  "kids",
  "tour",
  "history",
  "library",
  "tour",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d109782-Reviews-Salisbury_House-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are in this area do not miss a visit to this house.  As a Brit visiting the states it was a gem of a find.  The house is really interesting, I would recommend taking a guided tour because you get to see the full house, the lady who took us around was brilliant so full of knowledge and extremely friendly.  Highly recommended.",
  "It was a wonderful, pleasant surprise to find such a gem in Des Moines, Iowa. (That's what makes travel such an adventure!) The home has many interesting historical elements, as well as a tremendous art collection. I'd recommend taking the tour, as the guides are well-schooled and knowledgable -- try for David Ross, who has been giving tours at Salisbury for 10 years and knows his stuff. Be on the lookout for the special events that are offered as well, which are well-worth buying tix in advance.",
  "What a surprise.  Not what I was expecting to see in Iowa.  So glad it has been maintained.  Beautifully decorated for the holidays.  The guides throughout the house were very knowledgeable.  It was $20 for the tour but included the Wallace House And Drake Alumni House.  All decorated for the Holidays.  Wonderful way to spend a Sunday.  ",
  "We have probably been to a dozen or so events at this venue and still enjoy it each time.  Shakespeare in the garden is my favorite but it is important to stay hydrated (and to have a designated driver or Uber).",
  "Read a lot about this fabulous place. I got an opportunity to visit to visit. It was a late Autumn evening and it gets dark early. Thus, we did not get a good view of the place. Add to this the entertainment area was overcrowded. Overall, I did not get a good impression, albeit the place where we were crowded had a lot of beautiful artwork and antique pieces of furniture. I will visit this place again during summer or so.",
  "We visited this amazing home in February, and while it was not horribly cold outside, the majority of the home was comfortable and cozy. The decorations and architecture were amazing. When you walk in the main entrance, you walk into the Great Hall, which was like I had always imagined a Great Hall should look like. We opted for the self-guided, main level only tour as we didn't want to wait 1.5 hours for the full, guided tour. Since we were the 1st visitors of the day and the tour guide apparently had nothing better to do, he followed us to a few rooms and gave us a ton of info - and while we probably learned more than we would have in the guide book, it was also a bit annoying as we wanted to be on our own.\n\nWe definitely want to return in the summer when the gardens are in bloom and may elect for the guided tour at that time, so we can see the upstairs of the house. They are planning a Shakespeare on the lawn in June, which could be enormous fun.\n\nThe only downside was the visitors restrooms, which were in uninsulated, drafty rooms, like bathrooms at campgrounds or older roadside reststops (fortunately they did not smell). However, the sinks worked fine and had hot water immediately.\n\nAll in all a must see!",
  "My 72 year old mother, 14 year daughter and I went to the Salisbury House and paid for the guided tour specifically to see the library. 90 minutes into the tour we asked the guide about it and she told us it was closed. That information should have been shared when we purchased the tickets. Very very disappointing. The house was very beautiful and the history was interesting but the tour was too long. I wouldn’t take little kids. Or teenagers. ",
  "We weren't sure what to expect but enjoyed this so much we have already started recruiting family and friends to come back for a visit with a tour -- and hopefully tickets to a murder mystery night! This is an amazing place even without the tour (we were too late, but you don't get to see the whole place without one), and those that work there are in love with the place and share stories and point things out as you walk through. LOVELY, one of the highlights of our spontaneous trip to Des Moines."
 ]
},{
 "name": "World Food Prize Hall of Laureates",
 "address": "100 Locust St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/6a/69/ac/world-food-prize-hall.jpg",
 "tags": [
  "active",
  "library",
  "food",
  "tour",
  "library",
  "library",
  "tour",
  "free",
  "food",
  "tour",
  "history",
  "food",
  "history",
  "food",
  "free",
  "library",
  "tour",
  "active",
  "library",
  "food",
  "tour",
  "library",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d7124988-Reviews-World_Food_Prize_Hall_of_Laureates-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are near or in Des Moines, don't miss this wonderful place.  It's a combination of museum, active educational center, community, state and national gathering place to honor the World Food Prize Laureates and the creators of all that honors agriculture!   The interior of the old Des Moines Public Library has been transformed and remodeled into a beautiful building that makes us all proud.  The docents we had on the main floor and upper floor were so informed and eager to tell the story.   Don't miss taking time for this wonderful place.\n",
  "I remember going to this building when it was the library. It was beautiful then and still is with the remodel!!  We were given a tour and it sure brought back memories.  It is a real gem that we should all be very proud of!!!",
  "DR. Norman Borlaug, an Iowan, is credited with saving a billion lives throughout the world by his work on preventing disease in plants and adapting plants to native conditions.  Housed in the renovated turn of the 20thc Des Moines Public Library, it includes interactive displays that explain his work, a room full of murals painted by Iowa artists and a fabulous display of conscious rising photographs by Howard Buffet taken in third world nations around the world.\n\nThe building itself is worth the visit!  One caution, call as the hours are limited.",
  "This is an amazing building, listed as an historical site. The purpose of this building is to expose the work of the people who have worked and continue to work to eliminate malnutrition and hunger around the world. Dr. Norman Borlaug spent most of his life in pursuit of saving people in third world countries from hunger. There's a photo gallery of works by Howard Buffet featuring photographs from around the world. Our tour guide was a wealth of information, the building and gardens are beautiful. If you ever have a couple of hours in Des Moines, don't pass up this site. The World Food Prize building is open to the public only on Tuesdays and Saturdays so I suggest you call ahead to get a tour time. Tours are free of charge.",
  "A very beautiful old building in Des Moines. Good guided tour of the building and the history of the World Food prize. Tours are only offered twice a week on Tuesdays and Saturdays, so plan accordingly. ",
  "The beautifully restored and repurposed Des Moines Library is a must see.  The World Food Prize Hall of Laureates is an architectural masterpiece.  The tour provides details about the restoration, the history of the World Food Prize, the people who are honored, and the quest to feed the people of the world.  Our volunteer tour guide , Lori, was well versed about the building and the vision of the World Food Prize.  The experience reminded me of visiting the sights of the Nobel Prize in Europe.  Oh, by the way, it is free.  The only real issue is it is not open all the time.  You need to call for open hours, but also check to see if a private tour is an option.",
  "If you are near or in Des Moines, don't miss this wonderful place.  It's a combination of museum, active educational center, community, state and national gathering place to honor the World Food Prize Laureates and the creators of all that honors agriculture!   The interior of the old Des Moines Public Library has been transformed and remodeled into a beautiful building that makes us all proud.  The docents we had on the main floor and upper floor were so informed and eager to tell the story.   Don't miss taking time for this wonderful place.\n",
  "These guys are focused on feeding the world!  The agricultural processes that we rely on here in Iowa are not sustainable for keeping the world fed.  These guys are way out there on determining how to accomplish this.  Their mission is going to become more and more important as a result of global warming.  Worth the vist.",
  "I was very impressed with the WORLD FOOD PRIZE HALL of LAUREATES. This is now located in the old Des Moines Public Library. \nI was here on a Tuesday and took a tour. Our guide, Ms. Grabow was friendly and very informative.\nPLEASE take your time and find out about IOWAN, NORMAN BORLAUG who won the Nobel Peace prize.\n The restoration of this remarkable landmark was done with care and attention to detail.\nIOWA has been a WORLD wide leader in agriculture and the leaders from around the world that have visited IOWA is outstanding.",
  "This building is beautiful, even to the untrained architectural eye. My favorite place were the gardens outside- beautifully landscaped with lots of plant variety. And the gardens are a great place to practice photography\n\nIt is a quick visit unless you're here for an event as there isn't a lot of information around and not much to do.",
  "We were here for a reception in the hall and one of the spacious rooms. Atmosphere is ok, but there was not that much to see/do"
 ]
},{
 "name": "East Village",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/59/a1/e6/east-village.jpg",
 "tags": [
  "unique",
  "food",
  "unique",
  "walk",
  "art",
  "free",
  "unique",
  "walking",
  "unique",
  "walking",
  "free",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d578111-Reviews-East_Village-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were in town for a bachelorette party and we walked around here for a little bit and it's such a cute area with lots of bars, restaurants, shopping, antique stores, etc. It has a young vibe to it and it's one of the cuter areas of Des Moines that I've gone to. Very walkable area with lots of things to do!",
  "This little neighborhood is filled with small and unique businesses that are locally owned. Our favorites are Raygun, All Spice, Gong Fu Tea, The Kitchen Collage and Jett and Monkey! So many fun stores and restaurants. Be sure to go on a Saturday during the summer....you can hit the Des Moines Farmers Market as well.",
  "Lots to enjoy. Shopping and food. Parking can be difficult, but it's worth the trouble. Fun shops and great food. ",
  "To experience a true Phoenix part of Des Moines, in other words, a community that has been reborn from a once decaying neighborhood, make sure you explore this area when visiting our capital city. East Village, now named for the upscale neighborhood it has become in recent years, attracted developers and retailers who had the wisdom and foresight to turn this area into a vibrant, exciting neighborhood that bears no resemblance to its recent past. Full of unique boutique stores, some of the best gourmet restaurants in the city and lively bars, this has also brought upscale condominiums  to meet the discriminating  needs of young professionals working in the downtown. \nIn recent years Des Moines has witnessed an amazing surge in a downtown  revitalization as more and more developers have realized that we have lovely old substantial buildings, warehouses, centers that were in disrepair that once restructured would become highly desirable homes for a wide range of homeowners. East Village is a shining example of this rejuvenation  with more and  more reconstruction  on the go  resulting in a boom of supporting retailers and restaurants to enhance their lifestyle. \nEastVillage has all the charm and visual stimulation that cannot be matched by wandering around another shopping mall. As a resident of Des Moines for  the past 32 years it makes me proud to have witnessed this exciting regrowth of the downtown  and the establishment of a truly unique village atmosphere. Dont miss visiting the area and make sure you have reservations for the restaurant of your choice..they're always well supported by us locals as well as out-of-towners!",
  "Although there is a lot of construction in the area (progress is good!) it is still easy to get around in this area to all the fun shops, galleries, restaurants and wine bars. Park your car and walk this small area to enjoy all the specialty shops.",
  "Not quite the artsy and quaint area I was hoping to find but some real highlights.  Loved the Zombie burger menu, Sticks, and Raygun.  There is a intriguing art gallery nestled in the thick of things as well (sorry, can't remember the name).  Worth about an hour or two of snooping and shopping.  We were there in winter so may be a bit more alive in nicer weather.  people were great.  recommend when your face is mobile and not frozen into a winter grimace.  :)",
  "For a tourist there's not much to see in Des Moines down town, but East Village is completely different. Here we found so many nice cafés, restaurants and shops. Further up hill there's the impressive Iowa State Capitol that you can visit for free. We didn't visit it yet but walked around the building and checked the monuments in the park next to it. From the hill it's a nice view over East Village and down town DSM.",
  "We were in town for a bachelorette party and we walked around here for a little bit and it's such a cute area with lots of bars, restaurants, shopping, antique stores, etc. It has a young vibe to it and it's one of the cuter areas of Des Moines that I've gone to. Very walkable area with lots of things to do!",
  "The east village is full of unique shots and eateries that is definitely worth a visit. We enjoy all the shops and hotels are within walking distance as well as night time activities.",
  "Had a great long weekend in the East Village.  Enjoyed walking the avenues and checking out all the unique businesses and fun bars and restaurants.  Felt absolutely safe at all hours, and enjoyed having access to free DART bus and close proxiimity to lots of interesting places.  DesMoiines is really a very fun city to visit, and the East Village is a great place to stay.",
  "This little neighborhood is filled with small and unique businesses that are locally owned. Our favorites are Raygun, All Spice, Gong Fu Tea, The Kitchen Collage and Jett and Monkey! So many fun stores and restaurants. Be sure to go on a Saturday during the summer....you can hit the Des Moines Farmers Market as well."
 ]
},{
 "name": "West End Architectural Salvage",
 "address": "22 SW 9th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/04/69/6a/west-end-architectural.jpg",
 "tags": [
  "unique",
  "free",
  "history",
  "drink",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d3854122-Reviews-West_End_Architectural_Salvage-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Oh what fun!  My girlfriends and I had a great time here. Some had coffee. I preferred to start my day with a mimosa... and then add many floors of antique shopping. A perfect shopping opportunity!  ",
  "Throughly enjoyed visiting this store. It is over 50,000 square feet of beautiful and unique items from old homes, schools and turn-of-the-century churches. If in the Des Moines area, definitely worth stopping in. It’s like wondering through a museum where everything is for sale. ",
  "This is a gem!!!!  This place is amazing.  Better then the TV version.  Not enough time to look.  I need to go back.  And a free beer because I bought stuff.  ",
  "Some very cool furniture built from reclaimed material. It's fun to explore the four floors of history.",
  "What a great surprise this was!  4 floors of all kinds of treasures.  A bathroom on every floor and you can grab a drink and walk around.  It's amazing what someone can build out of another man's junk!  Staff were so very nice!!! "
 ]
},{
 "name": "Wells Fargo Arena",
 "address": "730 3rd St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ff/83/9b/view-from-the-wells-fargo.jpg",
 "tags": [
  "walk",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d7379602-Reviews-Wells_Fargo_Arena-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "We came to see a hockey game and see the Eli Young Band play afterward. Parking was great, $5 for a garage not to far of a walk from the arena. The Game was fun, the atmosphere was good but the chicken fingers sucked, the fries sucked. They let us move closer to the band after the game, we couldn’t understand what the band was saying or singing. So unless you knew the songs you had no idea! We expected better sound like we had during the game! ☹️ I was super disappointed by that! ",
  "First trip to Wells-Fargo Arena on MLK Day for AHL hockey. Noon game so parking was not a problem. I can see it might be for a big crowd. Hockey sightlines are good, we had row 5 on the blueline. Great on our end, but had to look thru the penalty box glass at other end. No big deal because the overhead scoreboard broadcast the game in real time. It was a high quality picture. Beers at that game were $11 for a big can. Bring your own coolie cup! They chilly. Our seats that day priced twice as much as the beer. We bought the Club seating. I did not see a big benefit to that, but price was the same. We are going back as it was a good time at a very good hockeyvenue.",
  "Went here for my son's birthday. I can see this facility as great for hockey and concerts. Good food choices though it was a 5 minute walk from my hotel it appears there is ample parking across the street. Police stop traffic so we pedestrians don't stay in the cold longer than necessary. Home team lost but it was mitigated by the comfortable seat and amenities. ",
  "The events center was very nice and the show was excellent.   The Parking was an absolute NIGHTMARE!!!  We will have to think twice about events at this venue.",
  "I really like this venue for concerts. I live between DesMoines and Chicago and will choose the slightly longer drive to this venue every time. It's so easy to access and it's easy to find parking even when the main lot is full. The arena is very user friendly and the seats are comfortable. "
 ]
},{
 "name": "Hoyt Sherman Place",
 "address": "1501 Woodland Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/aa/9f/40/hoyt-sherman-place.jpg",
 "tags": [
  "hospitable",
  "family",
  "walk",
  "walking",
  "walk",
  "walking",
  "walk",
  "knowledgeable",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d3461711-Reviews-Hoyt_Sherman_Place-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Prefer to attend any events, such as, The Nutcracker ballet, Jim Brickman concert, etc., at this location.  It is literally the former family home built in 1887 by Hoyt Sherman (younger brother of General William Sherman of the Civil War).  The home literally has a theater with balcony area characteristic of the time period.  If you want to attend an event where you can literally be taken back in time, I highly recommend this beautiful establishment.  At intermission, you walk the floors an observe this home's architectural beauty and the staff are most hospitable and helpful.  If you are traveling in the Des Moines area and are only passing through, this home is open for public viewing daily.  HIGHLY RECOMMEND TO ALL!",
  "Attended a country concert there recently.  The sound was great and it is a nice, intimate venue but I don't think I would return here for a country concert because you can't move around.\nPROS: \nThe home/building itself is beautiful and worth checking out. \nThe acoustics are great.\nValet parking is available.  \nThey sell beer $6, wine $6, pop and water (I don't remember the price of pop and water) and beverages can be taken into the theater area.\nYou can pay cash for drinks or buy tickets if you need to use a credit card.\nThey have handicap seating up front.  \nThere is an elevator in the building.\n\nCONS:\nThe seating area for concerts is pretty cramped.  The seats are close together and rather small.  If you have to get out during the concert, you're neighbors will need to stand up to let you out in most cases. We had aisle seats.  I would not like to have middle seats.  Too squishy!\nThere is no place up front for dancing.   \nIt is pretty dark in the theater.  If you go in to find your seat after the concert starts, you'll need to be shown the way with a flashlight.\nThe volunteers working were all friendly and helpful.\nParking is not good.  Very few handicap spaces, which fill up fast and a tiny parking lot.  You'll most likely need to park on a side street and walk up, as noted in other reviews. \nToo few bathrooms.  Only one women's bathroom with 4 stalls (one is handicap accessible but the hallway into the bathroom is pretty tight) and it is located downstairs by the box office.  Tromping back and forth to the bathroom was a pain.  For guys there is one bathroom upstairs and a one-stall bathroom on the main level near the area where drinks are sold. There were very long lines for the men's bathroom as well as the women's.  \nThere really aren't any hotels within walking distance that we saw.\n\nOverall, this is a beautiful venue and would be great for certain events, but for concerts where you want to move around, it isn't ideal.",
  "Attended a country concert there recently.  The sound was great and it is a nice, intimate venue but I don't think I would return here for a country concert because you can't move around.\nPROS: \nThe home/building itself is beautiful and worth checking out. \nThe acoustics are great.\nValet parking is available.  \nThey sell beer $6, wine $6, pop and water (I don't remember the price of pop and water) and beverages can be taken into the theater area.\nYou can pay cash for drinks or buy tickets if you need to use a credit card.\nThey have handicap seating up front.  \nThere is an elevator in the building.\n\nCONS:\nThe seating area for concerts is pretty cramped.  The seats are close together and rather small.  If you have to get out during the concert, you're neighbors will need to stand up to let you out in most cases. We had aisle seats.  I would not like to have middle seats.  Too squishy!\nThere is no place up front for dancing.   \nIt is pretty dark in the theater.  If you go in to find your seat after the concert starts, you'll need to be shown the way with a flashlight.\nThe volunteers working were all friendly and helpful.\nParking is not good.  Very few handicap spaces, which fill up fast and a tiny parking lot.  You'll most likely need to park on a side street and walk up, as noted in other reviews. \nToo few bathrooms.  Only one women's bathroom with 4 stalls (one is handicap accessible but the hallway into the bathroom is pretty tight) and it is located downstairs by the box office.  Tromping back and forth to the bathroom was a pain.  For guys there is one bathroom upstairs and a one-stall bathroom on the main level near the area where drinks are sold. There were very long lines for the men's bathroom as well as the women's.  \nThere really aren't any hotels within walking distance that we saw.\n\nOverall, this is a beautiful venue and would be great for certain events, but for concerts where you want to move around, it isn't ideal.",
  "Your theater provides great sound, comfortable seats and a awesome environment!!  We are not familiar with Des Moines so parking was hard for us to figure out!!  Would of been nice if we would of been advised prior and then told that lots of the hospital parking was off limits!! ",
  "If you have the chance to see a show/event here do it.!!!!  Phenomenal!!! Well worth our trip fr Cedar Rapids",
  "We came to DesMoines from Milwaukee for a concert not knowing anything about this venue.  Based on pics, we knew it was an older/vintage place.  I sure wish we would have arrived earlier to take in all it's beauty.  There's so much more than a concert/theater.  Not only is the place stunning, but the people who worked there are very knowledgeable, friendly and helpful.  Arrive early would be my suggestion to anyone coming here for an event.",
  "Theater just happened to be in the neighborhood we were visiting from out of state. Gary Allan was performing so we timed our visit perfectly. Quaint theater that rocked the night. ",
  "Classy old theater, beautifully preserved. Box seating is very comfortable, and provides a great view of stage. Great acoustics. Lovely bits of history scattered throughout the lobby areas. Elevator access to the main and balcony floors, with adequate disabled parking spaces and access. Bathroom facilities were clean, though not that conveniently located for the ladies."
 ]
},{
 "name": "Robert D. Ray Asian Gardens",
 "address": "Robert D. Ray Asian Drive",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/cc/b9/ee/pretty-area.jpg",
 "tags": [
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d7891682-Reviews-Robert_D_Ray_Asian_Gardens-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "the Asian gardens is a great place to go to on a sunny day!It's a  great place to take pictures and share with your friends.👍",
  "It is such a beautiful place. I always bring my family here when they visit from out of the state! Lovely",
  "I checked out the garden during my morning run. It's really small and it doesn't take more than 15 minutes to check it out. I don't think it's worth a detour, but it was along my route and it sort of cheered my up as it was such a contrast to the surrounding area.",
  "Everywhere we looked, the Asian Gardens were in need of help.  The gardens were overgrown with weeds and brush.  The ponds some were dried out and others were filled.  Either way they all needed cleaning as does the garden's iconic Asian building.  The accent hardscapes were either broken and/or non-functioning.",
  "This is just down from the botanical gardens and along the river walk. not a lot to do or see but the building is neat and the statues are interesting, but nothing great."
 ]
},{
 "name": "Confluence Brewing Company",
 "address": "1235 Thomas Beck Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/3d/0e/0e/confluence-brewing-company.jpg",
 "tags": [
  "tasting",
  "food",
  "food",
  "unique",
  "free",
  "delicious",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d4022460-Reviews-Confluence_Brewing_Company-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don't let the outside appearance fool you. It's what's inside that counts. The wide choice of great tasting beers is great! Big tasting room and also large outdoor seating area. You can sample flights to determine which beers you like. Fun place. Parking can be difficult if they're hosting a large party, which happened when we visited.",
  "We were a party of four and all had a great time.\n\nEach of us started with a flight of beer.  There were eleven choices that were all very good.  Each flight cost $8.\n\nBecause Confluence does not sell food we brought our own pretzels and then ordered pizza that was dleivered to the Tap Room.\n\nCash only but there is an ATM inside the building.\n\nWith the deck overlooking Grays Lake, this is a definite return trip when the weather warms up.",
  "The staff was great and very attentive. You can bring in food and game from the outside which added to the experience. We will be back!",
  "Went with my sons (16 & 11).  They had root beer. Locally made. Loved it.  I tried a flight of 4 beers.  It’s off the beaten path from Des Moines, but totally worth a visit. Clean facility & happy staff.  ",
  "This is a good example of revitalizing old warehouses into more 21st Century gathering space. The large space seems to be well utilized to brew beers. I read the chalkboard stating that they had a new beer every Friday and the names of the beers were unique and had names of Des Moines landmarks. There was a bicycle path nearby. The cyclists would pop-in to ‘re-fuel’ or recharge before moving on! Quite a mixed crowd – parents with young children; adults and of course always-present millennials at any good beer-tap!\nOur group tried a few beers. All beers we tasted were of good quality.",
  "First of all, Confluence is great inside. Very modern and cool and just a nice place to sit with friends and have some drinks. \n\nBeing our first time here, we ordered a couple flights for our group and we shared them. My wife is gluten free and was able to find some great GF options. \n\nNearly all of the beers served here are great. High quality, craft beers served by friendly and engaging staff. What more could you ask for?\n\n-The Power Trippers\n",
  "This is located in an odd place I think, but who cares when the atmosphere and beer is delicious! Worth a visit...or two...or three...",
  "Don't let the outside appearance fool you. It's what's inside that counts. The wide choice of great tasting beers is great! Big tasting room and also large outdoor seating area. You can sample flights to determine which beers you like. Fun place. Parking can be difficult if they're hosting a large party, which happened when we visited."
 ]
},{
 "name": "Clive Greenbelt Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ba/a1/3e/clive-greenbelt-trail.jpg",
 "tags": [
  "free",
  "nature",
  "library",
  "parks",
  "nature",
  "walk",
  "kids",
  "walking",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d258346-Reviews-Clive_Greenbelt_Trail-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "I regularly run the Clive Greenbelt. It is well-maintained, and beautiful! I frequently see deer. I feel safe on the Clive Greenbelt Trail because it is well-traveled and I often see Clive policemen on bicycles patrolling the trail. Several parks along the trail provide drinking fountains, trash receptacles, and bathroom facilities. There are also benches along the way if you want to sit and watch the beautiful creek and enjoy nature. There's even a nice Little Free Library near the Clive Aquatic Center!",
  "I have ridden my bike on this trail several times.  It is a flat ride along a stream with a pretty view of trees and birds and landscaping.  Each time I was on a longer ride and used part of this trail in my journey.  If you love to walk or jog or run or bike, then this trail is a great place to exercise and enjoy nature.",
  "You can often see deer along the trail.  Especially near sunset.  Sometimes, turkey.  \n\nWhen in town, I like to go here.  Path is generally well maintained and runs alongside a creek.  It runs under street bridges and there are some pedestrian bridges across the creek.  \n\nMany people use this trail to commute via bicycle all over town.  It links up with other trails and so it's possible to think in terms of over 200 Kms of trails from this one trail.",
  "You can get to just about anywhere in the DSM area via the trail.  It's paved, in pretty good condition.",
  "Whether you're biking or hiking, the greenbelt in Clive is simply wonderful. You're likely to come across deer, which makes it that much more interesting.\n",
  "Nice trail for walking or bikers. Small play area for kids near the restrooms. Water, wildflowers and wildlife can be seen and enjoyed. ",
  "nice refreshing trail to walk in. the only issues is with the bugs and the overgrown bushes. \nnot many bicycle riders on the trail. ",
  "This trail has it all. Wide paved bike and walking path. Scenery though treed areas and sunny paths. Seating when needed, and stops with restrooms. Several areas were recently modified to make them safer for the faster moving bikers and runners."
 ]
},{
 "name": "Court Avenue",
 "address": "Court Avenue",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ba/9d/0b/court-avenue.jpg",
 "tags": [
  "kids",
  "walking",
  "brewery",
  "music",
  "kids",
  "eat",
  "structure",
  "drink",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d578110-Reviews-Court_Avenue-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Spring, summer and autumn offers the Saturday morning Farmer's Market (ranked #2 in the nation after Pike's Place in Seattle).  \n\nThere are bars, restaurants, cafes, and the Science Center with the Imax theater.\n\nBoundary on one end by the courthouse and the other end by the river (which has a nice walking trail and city scenery), the Court Avenue district is fun.  \n\nNight when the bars close can get unsafe.  Over drinking and macho attitudes.  The rest of the time, it's not only safe for kids and families, but actually a must visit.  \n\nJava Joe's is on a side street.  Spaghetti Works on the main, and one of the entrances to the Skywalk is in Court Avenue Brewery building.",
  "It's actually a lot of fun once you get down there on a Friday or Saturday night. It's pretty safe (there's always police about to ensure that) it's a decent atmosphere as long as the weather is nice!",
  "There is always something happening on Court Ave. From the farmers market on Saturday mornings. With lots of vendors to choose from to music and even flash mobs to watch. Then at night there are restaurants and bars for the night life. Thought out the srping and summer there are lots of different events happening all the time. Here is a link to see up coming events in Des Moines and the Court Avenue area. http://www.catchdesmoines.com/events/",
  "Once the sun goes down, this place is a pretty cool.  But there are almost always some challenges with drunks or fights...at least every time I have been there.  There have also been a few epic conflicts with lots of folks involved.  Get a sitter for the kids.",
  "This is the place to hang out downtown. They've got many good places to eat, the farmer's market is on Saturday mornings, and parking is close and plentiful. We came here last for the Des Moines marathon and had a wonderful time. ",
  "Coming from Europe the structure of DSM down town feel strange; mainly office buildings without shops on the street level. That's why the streets are quite empty. People move from one to another building along the skywalks. Court Avenue differs from the rest of down town. There's lots of pubs and restaurants restaurants side by side which makes it perfect for pub crawls. However, the area doesn't differ from similar areas we've seen in every city we've visited and as we're not in a party mood, we just went through a couple of times until we decided to cross the river to East Village where we found more peaceful places.",
  "Lot of choices for food and drink in downtown DSM.  The night life gets going around 10pm so if your not into that, come early and enjoy..",
  "Whether you're looking for a watering hole or meal, Court Avenue district is a must-go. Great variety of restaurants and bars. Many of the buildings are architecturally significant.\n"
 ]
},{
 "name": "Terrace Hill",
 "address": "2300 Grand Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/aa/a2/90/terrace-hill.jpg",
 "tags": [
  "learn",
  "history",
  "historic",
  "tour",
  "walk",
  "art",
  "structure",
  "history",
  "tour",
  "history",
  "tour",
  "tour",
  "family",
  "history",
  "family",
  "kids",
  "tour",
  "walk",
  "tour",
  "history",
  "tour",
  "history",
  "history",
  "learn",
  "history",
  "historic",
  "tour",
  "walk",
  "art",
  "structure",
  "history",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d279104-Reviews-Terrace_Hill-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whenever we visit a capital city, we always visit the state capitol building.  If our days in the city coincide with tour days at the state governor's mansion, we make plans to also tour the mansion.  We love the history, architecture, and art that is part of these tours as well as the opportunity to interact with locals who love their state and history.\n  \nCheck the Terrace Hill website to learn of tour days and times.  At the time of our travel, the fee for the mansion tour was $5 -- certainly reasonable and fine with us to pay a small fee to help maintain the beautiful, historic structure.\n \nPrior to the tour, we took a look around the carriage house building which now houses staff, displays, and a small gift shop.  An excellent video was shown as an introduction to the tour.  Our excellent guide, Patty, walked with us to the mansion and imparted more details and stories about the mansion as we toured inside and out.\n  \nThe day was a little rainy, and umbrellas were provided for the short walk from the carriage house to the mansion.  Street parking and handicapped parking is available on Forest Drive, which is on the west side of the property.  Additional parking is located in the Terrace Hill parking lot off of Grand Avenue at Forest Drive.",
  "Some of the history of Des Moines preserved in this building.  Nice to see it is well cared for, and worth the trip.",
  "We made the 10:30 tour with Rhonda who introduced the 15 minute video presented in the old carriage house giving the history of the place from construction to now being the Governors Mansion.\nThen it was across the lawns to the main house and what a spectacular property it is.\nIt is a must see if you enjoy living history and even if you don't!",
  "We arrived on a cold Saturday in time for the 11:30 tour.  I was surprised at how many others joined us.  Our tour guide, John is clearly in love with this building, flaws and all.  He points out mistakes, tells stories and jokes and gives you a great historical perspective.  Well worth $5.  Beautiful 150 year old building.  Don't miss the early Grant Woods painting in the upstairs hallway.",
  "We watched a 15 minute video and then were escorted on a tour. The lady volunteer was informative and enjoyable. She provided a lot of family information, building details, and interesting events and visitors to the mansion. Parking is near the entrance road just off Grand Ave, so there is a climb up the hill to the offices. I recommend one take the time to see this nice old building. It is period furnished and photography is allowed.",
  "It’s probably just me, but I am uncomfortable touring a house that people live in.  Since this is the governor’s house, the family was there on my tour out in the backyard.  You only get to see the first and second floor, and family lives on the third floor, but the kids were out playing in the backyard I felt like I was intruding.  The tour starts in the carriage house, and they have the history of the house and a short film which is very good witch actors portraying the families that lived in the house.  Then you walk over to the house.  You can take pictures of the outside, but none on the inside which is a shame since it is spectacular.  My tour guide was very good, and I ended up taking the tour solo so we could talk.  If you like Victorian style old houses, this one is a treat.  From crystal chandeliers to hand carved woodwork, it really is spectacular.  Parking is on the street, which is narrow and winding.",
  "This is a lovely home with a fascinating history. However, the tour is longer than necessary for the size of the building. Most, if not all, of the interesting information can be learned via the plaques and the video they show. I found myself getting bored waiting for the tour to move from one room to another. I’m also saddened a bit that the carriage house was modernized instead of preserved as it was originally, though I understand why that was done; I feel the sane way about the swimming pool. The highlight of the home is the magnificent stained glass. I would recommend checking it out, especially if you love old buildings, but for me it was a one-and-done experience. I don’t intend to go back for a second tour.",
  "Too beautiful for words.  Beautiful gardens, excellent tour guides, so much history and a Windsor in the mix no one can explain.  Such a mystery!  Where did she hide during the war?",
  "This 150-year-old home (built in 1869) is now the governor's official residence. But they do tours and it's well worth your time. It truly is a set back in history. One suggestion: Do a bit of research on it before you go; it makes it much more meaningful that way.\n",
  "Whenever we visit a capital city, we always visit the state capitol building.  If our days in the city coincide with tour days at the state governor's mansion, we make plans to also tour the mansion.  We love the history, architecture, and art that is part of these tours as well as the opportunity to interact with locals who love their state and history.\n  \nCheck the Terrace Hill website to learn of tour days and times.  At the time of our travel, the fee for the mansion tour was $5 -- certainly reasonable and fine with us to pay a small fee to help maintain the beautiful, historic structure.\n \nPrior to the tour, we took a look around the carriage house building which now houses staff, displays, and a small gift shop.  An excellent video was shown as an introduction to the tour.  Our excellent guide, Patty, walked with us to the mansion and imparted more details and stories about the mansion as we toured inside and out.\n  \nThe day was a little rainy, and umbrellas were provided for the short walk from the carriage house to the mansion.  Street parking and handicapped parking is available on Forest Drive, which is on the west side of the property.  Additional parking is located in the Terrace Hill parking lot off of Grand Avenue at Forest Drive.",
  "It was like a living museum. As the residence of the governor, people actually live here and events are held in the rooms, so it's not a dusty museum. However, there is quite a bit of history to learn. Small group tours are great."
 ]
},{
 "name": "Brass Armadillo Antique Mall",
 "address": "701 NE 50th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/44/15/35/welcome.jpg",
 "tags": [
  "historic",
  "walking",
  "walk",
  "walk",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d8552256-Reviews-Brass_Armadillo_Antique_Mall-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Although it’s a little difficult to get to, it’s quick right off the interstate.  Plenty of cases and hundreds of booths to look through. Found a great selection of historic pieces and many hidden treasures. Spent some time in this as we traveled through. Worth stopping into while searching for treasure. ",
  "Open late, huge - seriously, huge- selection. Clean building/ restrooms & friendly staff. Coffee & vending machines. Great experience had! ",
  "I became acquainted with Brass Armadillo in Wheatridge, Colorado several years ago and it is a MUST stop each time I'm near Denver.  I stopped at the Des Moines location two years ago (amazed to see a mall of the same name) and found that this is the original mall of six.\n\nIn the past two years the inventory has completely changed, and this time there was a significant amount of great oak and maple furniture, at good prices.  The mall is huge, so bring good walking shoes and plan to spend an afternoon (several hours) to walk the entire place and take more than a passing glance at the items.\n\nThey have a mall \"guide\" at the front, along with pencils, so that as you walk through you can register booth numbers and locations (aisles are named for various states and cities -- Des Moines Ave., Missouri Ave, Tuscon Ave., etc.) to help you find that special treasure again.\n\nThe staff members is all 3 locations I've visited are always pleasant and helpful.  \n\nIf you love antiques, this is a MUST stop (actually all of their locations, as each is a bit different).",
  "Walk slow and look in every corner... a lot to see in a lot of places...kind of pricey on some things but ask for discounts...I'm going back in morning to see the next half...enjoy your trip....",
  "Whenever we are in the area we stop even if it delays our trip an hour or four. Always new things to see & reasonable prices. Usually a sale which is always nice. Open 7 days a week.",
  "As to be expected for an overpriced antique store! The place is clean, the staff are friendly so the overly priced items isn’t their fault! But I literally couldn’t find anything that wasn’t seriously overpriced just because it was in the “antique” store! Have fun trying to find something! I did find a brand new Trump 2020 hat for only $10! So that’s awesome! ",
  "Sunday about 11 am place was busy parking lot full . This place is inviting clean organized and help is everywhere. Only a few empty locations and price's were about average. Found items I have already and just didn't get anything today. I will come back mid week when I'm not excusing myself so much.",
  "Huge place with a wide variety of items. We saw it from the highway and after getting turned around a couple of times, we found it and were pleasantly surprised. Lots of different things for every collector."
 ]
},{
 "name": "Easter Lake Park",
 "address": "2830 Easter Lake Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/f8/ff/59/received-10103654062236950.jpg",
 "tags": [
  "walking",
  "family",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d11800697-Reviews-Easter_Lake_Park-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "The lake is still being dredged, but it is worth stopping to see the only covered bridge in Polk County, Iowa.",
  "Easter Lake park in Des Moines is located in the SE corner of the city, touching the countryside. A huge project is (for the most part) now completed, leaving the lake full of water and the park serene and welcoming. New bike trails have been added along with a bridge, connecting the two sides. This park is an ideal day trip for a picnic, kayaking, running, biking, or a Sunday drive.",
  "After a lengthy lake and watershed restoration project, the lake is again full.  Fishing will not be good until next year as they get the lake re-stocked.  The 12' walking trail completely circles the lake now with the installation of a pedestrian bridge at the west end of the lake.  New sand is in place at the swimming beach and there are multiple shelters on the south side of the lake available for gatherings.  Amazing how close it is to the city center, yet still with a very rural feel when you get on the trail.",
  "A peaceful little lake with a lot of activities available for all walks of life. The walking/running path was excellent especially when highlighted with the fantastic bridge. The shelters were a wonderful low-cost venue for a wedding with nearby restrooms and parking.",
  "This park has really upped its game.  Recently they completed a nice bike/walking trail all of the way around the lake (about 5 miles).  The path is smooth wide concrete and has several scenic bridges.  They also drained and dreged the lake so the water is deeper and cleaner and built multiple fishing jetties and docks.  In a couple of years this should be a top notch fishing destination.  Other items my family enjoys are picnic areas, multiple playgrounds, and the beach which is nice as far as Iowa lake beaches go and has concessions, boat rentals, showers, and changing rooms.",
  "After a lengthy lake and watershed restoration project, the lake is again full.  Fishing will not be good until next year as they get the lake re-stocked.  The 12' walking trail completely circles the lake now with the installation of a pedestrian bridge at the west end of the lake.  New sand is in place at the swimming beach and there are multiple shelters on the south side of the lake available for gatherings.  Amazing how close it is to the city center, yet still with a very rural feel when you get on the trail.",
  "Easter Lake park in Des Moines is located in the SE corner of the city, touching the countryside. A huge project is (for the most part) now completed, leaving the lake full of water and the park serene and welcoming. New bike trails have been added along with a bridge, connecting the two sides. This park is an ideal day trip for a picnic, kayaking, running, biking, or a Sunday drive.",
  "The lake is still being dredged, but it is worth stopping to see the only covered bridge in Polk County, Iowa."
 ]
},{
 "name": "Better Homes and Gardens Test Garden",
 "address": "1716 Locust St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/80/0d/03/better-homes-and-gardens.jpg",
 "tags": [
  "learn",
  "walk",
  "tour",
  "knowledgeable",
  "unique",
  "unique",
  "walk",
  "art",
  "tour",
  "walk",
  "learn",
  "walk",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d103665-Reviews-Better_Homes_and_Gardens_Test_Garden-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was pleasant to walk through and see a variety of plants and shrubs that don't necessarily grow in my zone. The two women who maintain the gardens were interesting to chat with and it was an opportunity to learn about the gardens and how they use them in the magazine. ",
  "The BH&G Gardens are truly beautiful. You can catch a glimpse from the sidewalks or plan a visit around the open dates they offer.\nBH&G use the gardens as test plots and to provide a place of escape for their employees. While not Butchart Gardens they are worth a trip to enjoy the country in the middle of the city.",
  "BH&G took us on a private tour. Well worth the time to see all the\nseasonal plants and flowers in bloom. The guide was knowledgeable and does a fantastic job",
  "I love to garden, and this is a wonderful place to stop and spend some time.  Combine this trip with a stop at a unique and local restaurant for a special outing.  \nMake sure to check the open hours and days-closed to the public most of the time.  Well worth the trip, though.  ",
  "I love to garden, and this is a wonderful place to stop and spend some time.  Combine this trip with a stop at a unique and local restaurant for a special outing.  \nMake sure to check the open hours and days-closed to the public most of the time.  Well worth the trip, though.  ",
  "You can walk here on Friday afternoon's and enjoy the well maintained garden or even take pictures.  People of all ages come here.  I recommend especially when the Art Festival is open nearby.",
  "It may have just been the weather, but the gardens looked very parched. I arrived with a stroller, only to find out you have to walk down approximately 6 steps to get into the garden. It is not handicap accessible! Perhaps if I had a guided tour I would have enjoyed it more. It was underwhelming.\n",
  "It was pleasant to walk through and see a variety of plants and shrubs that don't necessarily grow in my zone. The two women who maintain the gardens were interesting to chat with and it was an opportunity to learn about the gardens and how they use them in the magazine. ",
  "The BH&G Gardens are truly beautiful. You can catch a glimpse from the sidewalks or plan a visit around the open dates they offer.\nBH&G use the gardens as test plots and to provide a place of escape for their employees. While not Butchart Gardens they are worth a trip to enjoy the country in the middle of the city.",
  "You need to stop at this place ... Very knowledgeable information shared by guides, Andrea and Sandra. Thank you ladies, it was a great visit even though it was raining.",
  "My husband & I enjoyed a stroll through the gardens. Master gardeners were available to answer questions. Learned a few things while enjoying the beautiful gardens. Make sure to check the schedule for hours of operation."
 ]
},{
 "name": "Des Moines River Trail",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/20/e0/b4/des-moines-river-trail.jpg",
 "tags": [
  "walk",
  "kids",
  "walk",
  "walking",
  "kids",
  "walk",
  "walk",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d258345-Reviews-Des_Moines_River_Trail-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Des Moines River Trail is part of the Iowa trail network, and somewhat follows the south side of the river. Near downtown, you stay within sight of the river and travel along one of the main routes east-west in Des Moines. It includes an emergency bike repair stand just across bridge from the stadium.\n\nCheck it out if you're looking for a less crowded trip than Gray's Lake.\n\nI'm reviewing this as a cyclist, not a pedestrian, who may have different preferences.",
  "This is a nice trail in the heart of the city.  It follows the river which is channelized here but still interesting.  There are a bunch of interesting old buildings along the river and the trail runs along both sides allowing for several loop options.  There is a lot of construction work right now so some sections are not accessible and some of the gardens are closed but it still makes for a nice walk.  There is bike repair station with a tire pump and tools if you are biking and need a quick repair.  This is a nice touch.",
  "A city isn't a real one unless it has a harbour or a river is running through. The Des Moines River is dividing the city between down town and East Village. I've done my morning runs along the river up and down on both sides. Well, I've seen more pleasant river sides, but it's absolutely worth the walk. In some places there's some construction work going in so i just had to switch to the other side. In the upper end there's the Rotary Riverside Park for kids that is just being extended with a skateboarding park and on the opposite side there's the tiny Asian park with the small pagoda. I liked the pedestrian bridge. However I think the city should further development the Riverside. ",
  "This area has a few different points of interest.\n\nYou have a nice view of the capitol from here.\n\nYou can see the Women of Achievement Bridge, and the cute park that looks like a fishing pole with a red and white bobber.\n\nWhile there, a homeless or transient man was walking, sitting, and lying in the area.  Just be cautious and aware of your surroundings, as you would anywhere.",
  "A city isn't a real one unless it has a harbour or a river is running through. The Des Moines River is dividing the city between down town and East Village. I've done my morning runs along the river up and down on both sides. Well, I've seen more pleasant river sides, but it's absolutely worth the walk. In some places there's some construction work going in so i just had to switch to the other side. In the upper end there's the Rotary Riverside Park for kids that is just being extended with a skateboarding park and on the opposite side there's the tiny Asian park with the small pagoda. I liked the pedestrian bridge. However I think the city should further development the Riverside. ",
  "The river is fast flowing, with various nice sigtseeing points, but overall it is not very special, certainly compared to many others in the US or world",
  "I took an hour walk along the river trail. The views were pretty amazing. I was surprise to see how much water was flowing in the river. It was totally full. The path goes up and down and there were many people out enjoying the sunny day.",
  "Just a beautiful walkway by the river and a stunning walking bridge, with two separate arched walkways, and a screaming high flowing waterfall beneath. Excellent spot to walk by the river and have a peaceful time while in the city. \n\nHigh water flooded some of the path on the west side. But east was open and good, north of the walking bridge. Great, sunny spring day. Beautiful day for a walk on the river. Great place!! Good job Des Moines!"
 ]
},{
 "name": "Rotary Riverwalk Park",
 "address": "821 W River Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/a4/77/b4/pedestrian-only-bridge.jpg",
 "tags": [
  "walk",
  "kids",
  "history",
  "walk",
  "kids",
  "walking",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d10426975-Reviews-Rotary_Riverwalk_Park-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "Maps takes you to the Dog park on the wrong side of the bridge, so if you want to see the cool stuff drive over by the Botanical gardens and park and walk. The Bridge is neat and little Asian bridge is cool too. But my favorite part was the river itself. Hope we can come back when it’s warmer to walk along the bank! ",
  "Past through the park during my morning run. The park was empty then so couldn't really see if it's a place that kids love. The swings looked a bit futuristic to me. They are now extending the area by building a skateboard park next to it. Anyway it's a nice a area and once you're there you should cross the river over the nice \"womens bridge\" to see the Asian garden on the opposite side.",
  "I was able to walk some of this section of the city on one of rare sunny days I had in early May while visiting. The trail system has an easy map to follow with some interesting stops. I especially liked the Chinese pagoda area and learning about some of the immigrant history of the city. This lovely nearby bridge offered a vehicle-free view of the city.",
  "Awesome bridge over the dam. Fascinating to watch the water fall and swirl. Powerful river in the spring. \nVery cute fishing pole and bobber play area for kids. \n\nBeautiful, clean bridge and park.\nConnects up to the bike and walk path. Can go anywhere on the path up or down river. \n\nSuggest doing the walking loop across this bridge, then down to the red bridge on south side of Downtown, then walk back up. We did this and enjoyed it!",
  "If you want to bike, walk run, or stroll this is the place to go. You get to exercise, or take photos, all year around and the views are stunning. The trail is always open - even when we have deep snow, you can still walk along the river and take in the changes in seasons."
 ]
},{
 "name": "Des Moines Social Club",
 "address": "900 Mulberry St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/01/9a/14/a-view-from-the-rooftop.jpg",
 "tags": [
  "art",
  "eat",
  "food",
  "music",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d8640055-Reviews-Des_Moines_Social_Club-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "I go here for ariel and it's one of the most beautiful places to go to. The classes are excellent and it's just a really cool place. I also enjoy all the art that surrounds it.",
  "We had a group here and between the service and the food it was a lovely experience!  If you have a chance eat here, GO!",
  "I have eaten here before in business and they always do a 1st class job for our company. The presentation is perfect.  Top cut Iowa beef is a must try. The views of Des Moines are outstanding. I learned how to canoe on the river so good memories. ",
  "Attended a night of music at the Kum & Go Theatre in the Social Club.  \n\nJust a great experience.  Very quaint and a non-stressful evening.  Unlike larger venues, it wasn't very crowded and was a very pleasant experience.\n\nParking is really easy, and we parked in the ramp just to the East, pretty convenient.\n\nDefinitely will attend events here in the future.",
  "Had a great event here with the Allrecipes Allstars. Fun atmosphere and really cool building. We loved dining on the roof top."
 ]
},{
 "name": "Saylorville Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/80/4c/2f/view-from-trail.jpg",
 "tags": [
  "family",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37835-d273771-Reviews-Saylorville_Trail-Des_Moines_Iowa.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Saylorville trails are a perfect place for a bike ride. Beautiful scenery throughout and the trails themselves aren't what I would call challenging. A great family outing.",
  "Great area for a walk, run or bike ride ANY Time of year.  Many shaded areas to get out of the sun.  Love an autumn run through!",
  "we started driving across a bridge that run over the lake it is a mile long then we drove over the dam that makes the lake followed the road in to a camp ground and it took us right down to where the water flows out of the dam and forms the Des Moines river again pretty cool area and really good fishing area people were catching fish pretty regular I will fish next time for sure and camp there are trails and swimming near by and a lot of different areas to set up a picnic and just relax when I come back I will need a few days to explore what a great area close to everything but in the woods  ",
  "I live in Saylorville.  I have ridden my bike on this route many times.  I am usually riding into Des Moines for the Saturday morning Farmers Market.  Other times I ride my bike up to Saylorville Lake or the High Trestle Bridge.  It is a flat, easy bike ride that runs along woods which are along the Des Moines river.  The trail is not usually crowded with other people.  You can ride along in silence and listen to the birds in the trees and look at flowers along the trail and at some open spaces you can see the water flowing in the river.",
  "Walk along the lake, through the woods, stop at the butterfly garden or visitor's center. Get as much exercise as you want in a lovely, lovely setting."
 ]
}]
