[
{
 "name": "Buffalo Trace Distillery",
 "address": "113 Great Buffalo Trce",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/22/cb/45/buffalo-trace-distillery.jpg",
 "tags": [
  "tour",
  "family",
  "free",
  "tasting",
  "history",
  "drink",
  "free",
  "tour",
  "tour",
  "tasting",
  "free",
  "knowledgeable",
  "tour",
  "tasting",
  "tour",
  "tasting",
  "free",
  "history",
  "tour",
  "tasting",
  "tour",
  "free",
  "knowledgeable",
  "tour",
  "tasting",
  "history",
  "tour",
  "free",
  "historic",
  "knowledgeable",
  "tour",
  "tasting",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d1112388-Reviews-Buffalo_Trace_Distillery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Buffalo Trace is one of Kentucky's oldest operating distilleries (although the name has changed over the years), and it produces some of America's best bourbons: Blanton's. Eagle Rare. The Weller family of bourbons. Elmer T. Lee. Even the ultra-expensive Pappy Van Winkle is distilled and aged here, on the banks of the Kentucky River. So Buffalo Trace is a mecca for the bourbon lover. Don't expect to fine the full grand line of whiskeys produced here available for purchase, however; parent company Sazerac intentionally limits its sales so as to not compete with retailers that stock their shelves with these fine products. But fret not: The Buffalo Trace tour is absolutely free (unlike most Kentucky distillery tours) and includes a film, short walks and the intoxicating fragrance of whiskey aging slowly in rickhouses on-site. Following the informative tour, guests can sample products ranging from white dog (clear, unaged whiskey; think: moonshine) to sweet bourbon cream, plus Buffalo Trace and Eagle Rare. Sorry; Pappy isn't on the tour menu (although you can spy bottles of it under lock and key). We've toured B.T. at least five times; we'll keep going back.",
  "Bourbon lovers my husband and I are so we decided we would take a trip over to Frankfort to stop in at Buffalo Trace. Best Sunday afternoon decision. Everyone went above and beyond to share their love of Buffalo Trace. Fabulous tour, amazing tasting (bourbon cream root beer float is to die for) Jessica in the gift shop was a delight and she even shared a bit extra with us the history of Buffalo Trace. We have done the whole Kentucky Bourbon Trail and even though Buffalo Trace is not officially on the trail you must add it as a stop. Their tours are free!!! Some of the tours do recommend to make reservations ahead of time.\nWe will definitely be back as every time we stop in we are greeted with smiles from everyone!! Buffalo Trace is a must do in the state of Kentucky even if bourbon is not your drink of choice!! ",
  "I have been on three of their tours now. The regular tour I did last year and it was really good. This year I did the Ghost Tour which brings you through the former owner's house which is really beautiful and the Hard Hat Tour that shows you more about the distilling areas than the regular tour. All three are worth doing and are also free and each one includes a tasting which is why we went in the first place. The people here are really friendly and knowledgeable.",
  "Visited Buffalo Trace on a recent trip to the other distilleries in the area. Of the 7 distilleries visited this is one of my top picks. Went on the Trace Tour and the Hard Hat Tour. Both tour guides were top notch and both had so much enthusiasm about what they were doing. \n\nFor the Trace Tour we had tour guide J.W. He was phenomenal! Such passion about bourbon and his excitement just wore off on everyone. The tour included a film and a visit to the aging warehouse. He did take the time to point out interesting facts and showed us how empty the barrels get as the years go by. After that we went back to the tasting room and each got to try 2 bourbons.\n\nFor the Hard Hat Tour our tour guide took us through the process and showed us all the equipment. Sadly the plant was shut down, so nothing was really happening. Even so, it was very interesting to see. The group was small - only 6 people- so it was much easier to ask questions. After the hour long tour we went back and did tastings again. This tour does require advance reservations, so make sure you call ahead and get on the list. But do both tours because they are different.\n\nEven though Buffalo Trace isn't on the official \"Bourbon Trail\" it is still worth the visit. Right now they are selling the Buffalo Trace Bourbon Cream - which isn't sold in stores. So be sure to pick some up. They also are one of the few places that sell their used barrels, so if you want one you can get one here.",
  "We decided to visit while in Frankfort. Took the distillery tour which lasts about an hour. Tours stay on the hour so be there a few minutes ahead or you might have a little wait. For tells you about the history and teaches about the bourbon making process.  Also get to do a tasting at the end of the tour.  All free except for souvenirs.  Worth the time to see.",
  "I really enjoyed the Disturbia At The Distillery Tour, and the Tasting Dinner in the Elmer T Lee Clubhouse at the Buffalo Trace Distillery. Just to let you know, though, the evening ghost tour during the time around Halloween is not as extensive as the standard distillery tour that they give during the day, throughout much of the rest of the year. The ghost tour is essentially a tour of the grounds, and older, abandoned buildings (giving it a \"haunted\" atmosphere). If you want to see the interior operations of the distillery, then go on the regular tour!\n\nThe tasting dinner in the Elmer T Lee Clubhouse was a lot of fun. We tasted through a variety of products produced by the Sazerac corporation (owners of the Buffalo Trace Distillery), including Rain Vodka, Buffalo Trace Bourbon, and Buffalo Trace Bourbon Cream (think Bailey's Irish Cream, but made with Kentucky Bourbon). There is limited seating for the tasting dinner and tour, so you need to make advanced reservations.",
  "This gigantic distillery has lots to see. Our fun tour guide was very knowledgeable and helpful.  The free tour was very entertaining. The process of how bourbon is made is fascinating.  Get a big “taste of bourbon history” here.  This very old distillery employs a lot of people.  A must stop!",
  "Our timing was bad.  We arrived the day pretty much all the distillery’s closed there doors over concerns from the virus.  We thought all hope was lost but as we pulled into the parking lot I realized that my favorite Bourbon’s doors were still open.  We had a tour scheduled the next day here but decided to take one of the last tours available that day and it’s a good thing we did because they closed that night.  It was a great little tour lead by Ray.  She was an amazing tour guide.  Very animated and informative.  We had a great tasting and were able to make some purchases from the gift shop.  We were to go to Nashville the next day but it got shut down so that was out the door too.  We drove 6 hours to Frankfort and drove home the next day.  But not before experiencing a little slice of Kentucky Bourbon heaven!  Thank you for saving our short lived trip!",
  "There are at least 5 tours available at Buffalo Trace, so allow plenty of time to see the grounds and experience the tours. The place is beautiful and full of history and some of the nation's best bourbons are produced there. Pick up some Bourbon Cream and root beer in addition to any bourbons you purchase. You won't regret it!",
  "My wife and I checked out two of their many tours. Unlike most of the distillers on the bourbon trail, Buffalo Trace is free. Their tours were better than anything we paid for. The employee from Hungary giving our first tour (without a reservation) was knowledgeable and passionate. Then we went on a historic building tour (that requires a reservation) that also did not disappoint. I am now a Buffalo Trace fan. BTW - My wife bought a bottle of their Wheatley vodka and I think her Kettle One days are over.",
  "Friends referred us to Buffalo Trace, took the basic tour with Nicki?  Very knowledgeable, explained the entire process, physically walked us through the process including a very informative tasting.  So exceeded our expectations, will continue to refer friends.  Probably bought way too much but...."
 ]
},{
 "name": "Castle & Key Distillery",
 "address": "4445 McCracken Pike",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/ce/5b/bf/castle-key-distillery.jpg",
 "tags": [
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "history",
  "walk",
  "knowledgeable",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "tasting",
  "knowledgeable",
  "tour",
  "history",
  "unique",
  "tour",
  "tasting",
  "foodie",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d13109537-Reviews-Castle_Key_Distillery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had a great experience.  It was great to see this 1887 distillery brought back to life.  Maggie, our tour guide was very knowledgeable about the history, restoration, gardens and current operations of Castle and Key Distillery.  We met two of the partners and both took time to talk to us.  The workers there were very friendly.  A worker was filling a barrel, he invited me to taste the bourbon that overflowed and then he let me pound a bung (like a stopper) into one of the barrels.  The only downside is the first bourbon won't be ready until late 2020.  However, the tour is a very worthwhile experience.",
  "My husband and I stopped at Castle and Key as the last stop on our abbreviated Bourbon Trail trip.  Of the three distilleries we visited this was by far my favorite!  The distillery was immediately welcoming with staff situated to guide you toward your scheduled tour/experience or provide information if you hadn't scheduled something.  We arrived an hour before our scheduled experience but were more than able to fill our time with a walk through the gift shop, a cocktail from their walk-up bar and then a stroll on their botanical walk and a seat in the shade on their patio to finish our cocktail.  The grounds were beautiful and this was a wonderful way to spend a sunny afternoon.  We did the Curated Cocktail experience which included a quick tour of the distillery and a description of the distilling process and then the chance to sample two cocktails made with Castle and Key gin.  Our tour guide was Abigail and she was fantastic; very friendly and knowledgeable!  We were the only two on our tour and she was very engaging and personable.  Which is a great description of everyone we encountered here!  All the staff members seemed to really enjoy what they were doing and loved sharing tidbits of history they knew about the distillery and it's restoration.  While they didn't yet have bourbon to sample, the vodka and gin were fantastic!  This was by far the highlight of the trip for me!",
  "The campus for Castle and Key is beautiful and the tour takes you back in time to the history of distilling and the efforts of the current owners to reclaim the site.  As of our visit they are not currently bottling their own bourbon but expect to have some out in 2021 or 22. In the meantime you can taste and enjoy their gin and vodka,  both of which are very good.  Our your guide, Brian, was knowledgeable and fun. A great tour.",
  "A good distillery tour that will quickly progress to OUTSTANDING! with a little more restoration in the facility.  The property is layed out to be a destination for anyone interested in the amber gold they're distilling, but for the moment it's mostly vision and plan.  Our tour guide was perhaps the best we've had at a distillery tour and she is on top of her game.",
  "I took some friends to Castle and Key for the tour and tasting, and all of us thoroughly enjoyed our time there. It was our first time on the property and everyone was so nice! Our tour guide was phenomenal too- very knowledgeable, friendly, and professional.  I will definitely be going back in the future with more friends. Thank you Castle and Key!",
  "Our tour was scheduled at noon.  Was a great experience.  We had visited in the fall of 2018 so was great to see what changes had happened since we were there last.\nRussell was our guide and he did a great job explaining the history of the distillery and asking questions.\n\nPS.  What is the \"impeller or fan\" in the gathering room; was a question we forgot to ask.",
  "Castle and Key is located in the former Colonel Taylor Distillery that existed over a hundred years ago. The owners have done a beautiful restoration job and have created something that is quite unique. Their spirits and philosophy are excellent and I am told they will have bourbon available as soon as the aging process is complete and they feel it is ready for prime time, likely later in 2020, early 2021. Go there.",
  "They are not bourbon ready but are rolling off gin and vodka now. Bourbon should be out later in 2020.  Jessica did an excellent job at touring us along. We were lucky that no one us was on our tour, so was very personable. The tasting was so detailed in that they show you the botanicals that’s go in the gin and you can smell each of them. I really like being more of a foodie than a drinker. They make you two cocktails which you choose from a list and you keep one of the glasses.  Highly recommend as this is a very different production due to its history. Beautiful drive over as well. "
 ]
},{
 "name": "New Capitol Building",
 "address": "700 Capital Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6a/30/df/new-capitol-building.jpg",
 "tags": [
  "tour",
  "free",
  "kids",
  "family",
  "history",
  "unique",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d4012362-Reviews-New_Capitol_Building-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was in town and had some time to kill so I stopped by the Capitol Building for a tour. I was an hour early for the guided tour so chose to take a self-guided tour. It is a grand old building with statues honoring significant Kentuckians (is that a word?), awe inspiring murals, and artifacts signifying the past. It was interesting to go in the Senate and House Chambers. The Supreme Court was occupied by a group so I didn't go in there but would recommend anyone going. You can't beat free at that.",
  "Took the kids here while visiting family because we had never been. It is as grand as anything you may find in Washington, DC. Absolutely stunning rotunda where the ceiling changes colors.. Not sure the people giving the bad reviews went to the same place I did. Even the teenagers were fascinated.",
  "Went by the Cap[tol Bldg. the day before the inauguration and I was not at all impressed.   It was at one time impressive even when not decorated but not it is just dull.  ",
  "Lots of history to experience, beautiful setting, beautiful building!  Take your camera to get lots of pictures inside and out.",
  "While Frankfort is not like most capital cities, it’s unique. The layout is peculiar. It’s not very big. But, to see the Kentucky state capital is definitely a highlight of the city. While you can’t get inside on the weekends, you can still walk the grounds and experience the beauty of the capital complex. It’s worth stopping and checking it out. "
 ]
},{
 "name": "Salato Wildlife Education Center",
 "address": "1 Sportsmans Ln",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/f8/58/42/salato-wildlife-education.jpg",
 "tags": [
  "learn",
  "nature",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d1036640-Reviews-Salato_Wildlife_Education_Center-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Salato is a place that is great for all ages to visit. From the young to older folks. Wild life of Kentucky is interesting and something all learn from. This center does so much for our youth as well as senior citizens. Have you ever had the chance to take your grandchildren some place? This is a place they really light up over. Plants to wild life, they have ot at..... ",
  "The indoor and outdoor displays are very informative and give visitors a good understanding of Kentucky animals, birds, fish, and plants.  Trails can be navigated with a stroller.  Some interactive exhibits.  Some info on habitat needs and restoration.  A fun place to get a dose of Kentucky nature.",
  "My husband and I took our 5 year old granddaughter to Salato Wildlife Education Center on Fall Break. We all enjoyed it immensely. It is a wonderful place to visit and our granddaughter loved it. I let her use my camera to take photos for herself. The staff are exceptional. ",
  "We really enjoyed walking the trails and visiting the exhibits.  The employees were present and helpful, taking the time to answer all of our questions during the bobcat training.  Animals can be observed in their natural habitats and the overlooks make viewing accessible to everyone.  Great place to see for all ages!  Donate now to help keep Salato's animals fed and happy!",
  "See and read about animals which once were or now are in the area.  Walk outdoors and see animals in a natural setting. Very nicely done. A great inexpensive way to spend the day!"
 ]
},{
 "name": "Glenns Creek Distillery",
 "address": "3501 McCracken Pike",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3c/1b/8d/bourbon-history-being.jpg",
 "tags": [
  "delicious",
  "tour",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "history",
  "tour",
  "sampling",
  "delicious",
  "tour",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d11513784-Reviews-Glenns_Creek_Distillery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Glenns Creek Distillery was a refreshing, small-group experience for our group of 5. After a recommendation from our knowledgeable tour guide at Castle and Key, we stopped in late afternoon for a tasting and got much more than expected! Dave is incredibly knowledgable and engaging, describing the bourbon distilling process in more understandable detail than any of our previous experiences. Their small-batch operation creates some very impressive bourbons, and they allow tasting of all of their various (and delicious) brands. Thank you for a great time and we're looking forward to visiting again soon to buy a bottle from the barrel we helped to fill!",
  "We planned a visit to Glenns Creek after reading reviews that called it a small craft distillery. It is located in one of the buildings of the abandoned Old Crow Distillery. From the outside, it was hard to know this was a functioning operation. They do not take reservations for tours however their website states they give tours on the hour. We arrived around 11 am and upon entering the front room, we were called back into the distilling and tasting room by a friendly man named Stuart. He was in the middle of bottling, but stopped to sit with us and talk about Glenns Creek, as well as begin our whiskey tasting. Stuart explained the history of the distillery and how it had become Glenns Creek. They are small, and young and everything is hands-on, including some of the equipment that was made by the owner, David. Stuart gave us an informal tour, and walked us through their distilling process. Compared to the other distilleries we had visited, this was a possible glimpse of what distilleries looked like 150 years ago. One fun aspect was pouring \"whitedog\" into an actual barrel, thus technically creating \"bourbon.\" It is important to note that they are making extremely good spirits. In fact one of the standouts is their OCD #5 bourbon, which uses yeast collected from spores found in one of the original Old Crow fermenting tanks! We were thrilled to bring a couple of bottles home. Visiting Glenns Creek Distillery is highly recommended, even if it is not as glamorous or polished as other distilleries. That is its charm!",
  "Ten of us did a day trip from Cincinnati and visited Woodford Reserve, Buffalo Trace and Glenn's Creek. It was a great comparison of three very different facilities. We ended the day with Dave Meier, owner of Glenn's Crossing, spending 90 minutes with us, giving us lots to sample and sharing his skill and passion for bourbon making. We just hung out with him in the fermentation room listening about the journey of 200 trillion yeast cells eating sugar (converting to alcohol) and then sampling white dog directly from the still. He was so interesting and patient that for me it was definitely the highlight of the day. If you're looking for the \"polish\" of Woodford, then you won't get it here. If you're looking for a personal tour from the owner of a small operation who is overflowing with knowledge and passion then hurry in for a visit.",
  "The place is all about going to the Capitol and yelling disgusting things at the Governor's office during a pandemic. Look on their site, they support this.",
  "Glenns Creek Distillery was a refreshing, small-group experience for our group of 5. After a recommendation from our knowledgeable tour guide at Castle and Key, we stopped in late afternoon for a tasting and got much more than expected! Dave is incredibly knowledgable and engaging, describing the bourbon distilling process in more understandable detail than any of our previous experiences. Their small-batch operation creates some very impressive bourbons, and they allow tasting of all of their various (and delicious) brands. Thank you for a great time and we're looking forward to visiting again soon to buy a bottle from the barrel we helped to fill!",
  "My Mom and I stopped in to Glenn’s Creek Distillery upon a recommendation from our tour guide at Castle & Key!  We met the owner David who was super nice and taught us so much about bourbon and the distilling process.  It was very interesting and the bourbon and vodka was excellent!  The guys were so nice to us and we even got to add white dog to a barrel that will be ready in a few years.  I’ll definitely go buy a bottle of that when it’s ready!  Dave - I drank the the vodka last night and no hangover!!!",
  "In a little corner of the Old Crow Distillery, Glenns Creek is making small batch whiskey. We stopped in for a tasting and really enjoyed the gentleman running the show. Lots of information you probably won't hear at a large-scale distillery, and the whiskey is good as well!",
  "My wife and I had stopped in Frankfort on our way back from a family reunion in Tennessee.  We've toured Buffalo Trace several times, as well as Woodford Reserve, Wild Turkey, Four Roses, and have earned our Bourbon Trail t-shirts.  We decided to visit Glenns Creek early on Columbus day and then head back toward Illinois.  The visit was really worth our time.  Dave and John were wonderful hosts, and we were actually the only two people on the 10 a.m. tour.  Both of these guys were really friendly and informative.  If you want to really see the distilling process and have it explained in great detail, stop by Glenns Creek.  Even though it was just the two of us, we weren't hurried along at all.  True, the building and grounds aren't all pretty like at Makers Mark, but these guys know what they're doing and the product is excellent.  We talked about this great experience all the way home. Thanks, Dave and John, for a memorable visit.  I wish we could get a barrel proof bottle from the barrel we signed and added white dog two when it comes of age!"
 ]
},{
 "name": "Rebecca Ruth Candy Tours & Museum",
 "address": "116 E 2nd St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/95/f2/e7/view-from-outside.jpg",
 "tags": [
  "tour",
  "free",
  "delicious",
  "tour",
  "knowledgeable",
  "tour",
  "history",
  "family",
  "free",
  "unique",
  "creative",
  "tour",
  "history",
  "family",
  "tour",
  "history",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d3948636-Reviews-Rebecca_Ruth_Candy_Tours_Museum-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Excellent stop in Frankfort not far from I64 (and well signed).  Small store with candies made on site.  Take the tour for $5...ours was great--small and casual.  Fascinating tiny factory with a long small business legacy.  A sample bourbon ball candy is your treat at the end of the tour.  Physically near the Capitol building.  Free on site parking.",
  "Due to a severe storm we decided to stop our road trip and follow the signs off the interstate to this candy store. Was pleasantly surprised by the cute historical candy shop. Decided to take the tour and our young tour guide, Madelyn, was wonderful and very knowledgeable about the company, as well as the candy making process. This was especially important because they had failed to tell us that the factory was closed. She was apologetic and was familiar enough with the equipment to make it come to life even though it was not on. My husband and I sampled a bourbon ball after the tour and it was delicious! We even decided to get a small box of different candies to enjoy once we got back on the road and each of them was very good. Worth the stop but ask if the candy is being made before you fork over money for the tour.",
  "We have a visitor from Europe with us for a week and so, planned day trips to show him Kentucky specialties.  The staff at Rebecca Ruth did not disappoint.  \n\nTours are very inexpensive and fairly short (the entire facility is housed in a large, old house).  There is a museum room with antique candy making equipment, Rebecca Ruth artifacts, family photos and memorabilia. \n\nYou will receive a short lesson on the cacao tree (and how the name changed to today's cocoa), a history lesson on the company, and a trip down the assembly line which does include several manual steps.  If you've ever seen the episode of 'I Love Lucy' where she and Ethel are making candy, you won't be able to avoid a smile when you enter the room.  \n\nTop off your tour with a free bourbon ball ... the founder of the company created these gems ... and a quick stop in the shop to buy some candy for later. Everyone is very friendly and the candy is terrific.",
  "The “crafted creative candy” is expensive but very tasty.  They have lots of unique candy not found any place else.  They also serve meals.  They also have tours.",
  "I loved it when my children were growing up and we visited Rebecca Ruth's' to see the Easter Bunny and have photos made. Then we went in and toured the store for a history lesson. At the end of the tour we picked candy and learned all about how they make different bourbon balls. What a great time we had.",
  "I love this place.  I visit the company every holiday to purchase candies for gifts and also for my family.",
  "You can’t go on the Bourbon Trail without getting a Bourbon Ball! And this is the birthplace of them! We didn’t have time to go on the tour, but we did get a sample. I think they use Evan Williams bourbon in theirs. (While taking distillery tours, we also got samples at Maker’s Mark, Buffalo Trace, and Woodford Reserve, with each of their chocolate balls using their own bourbon but all made at Rebecca Ruth’s!) Great selection of chocolates!",
  "Ok   Advertising does work  it got me there and I did read about why pay $5 to watch a film and I could see there point but I did get to hear some of the history of the place and Jim was enthusiastic about what he had to say that given all the free places I had gone to spend $5 didn’t seem much and it was fun way to spend  some time   It also helped me to walk out and not buy anything because I had already spent my money and left guilt free"
 ]
},{
 "name": "Cove Springs Park",
 "address": "100 Cove Spring Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/e2/f2/59/beautiful-falls.jpg",
 "tags": [
  "hike",
  "tour",
  "nature",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d7240726-Reviews-Cove_Springs_Park-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great hidden gem!!! Loved the waterfalls!! Beautiful a peaceful. Great hike!! Can’t wait to go back and see more. ",
  "Went here while in town on business and shot the 3D archery course they have set up there along he trails in the woods.  They also have a really nice range with bag targets out to 50 yards and a large covered area to shoot from.  Good place to sling some arrows to pass some time.",
  "Trail was well marked.  Got the exercise we were looking to get! We could have spent longer there but had to get to our distillery tour!",
  "This is possibly one of Kentucky's best kept secrets that nature lovers should know about.  The park is full of stream views, bridges, water falls, pools, wet and dry creek beds, lush vegetation, and numerous marked hiking trails. Some trails are easy and others are strenuous.  You will find a kiosk showing the trails near the parking lot and part of them are handicapped accessible.\nThere is a beautiful memorial statue & circular garden for parent of deceased children.  There is part of the original dam from the 1800's that held the water from the Penitentiary tributary to the Kentucky River.   I would love to know more about many of the historical features in the park but there is no signage telling about them.  \nThere is a restroom at the parking area but it was closed when we were there because of vandalism.  There was a portable toilet instead.  You will find a picnic shelter with a couple of tables at the parking area too.",
  "We almost didn't visit this park since the official hours are sunset to sunrise, but we arrived at 7:30, and the park still wasn't open.  However, we first did some hiking across the street (about a mile loop), which is still part of of the park, but outside the main area, and then visited the main entrance again, and it was open.  So the hours may be a little unpredictable.  Once we arrived, though, we hiked the Holly and Osage Loop and thought this was a great hiking experience.  There was enough elevation to make the hike a workout, but nothing to make it exhausting.  There was lots of wildlife (deer, raccoons, turkeys, insects) throughout, and lots of different terrain as well.  Better yet, this part is literally just outside Frankfort, so if you are staying in Frankfort, you can probably get here in 10 minutes or less."
 ]
},{
 "name": "Thomas D. Clark Center for Kentucky History",
 "address": "100 W Broadway St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/d0/67/fd/the-battle-of-perryville.jpg",
 "tags": [
  "history",
  "history",
  "knowledgeable",
  "history",
  "family",
  "free",
  "library",
  "history",
  "history",
  "knowledgeable",
  "history",
  "tour",
  "history",
  "learn",
  "history",
  "family",
  "free",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d1112386-Reviews-Thomas_D_Clark_Center_for_Kentucky_History-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "I highly recommend this special exhibit which runs until October.   The exhibit showcases two rarely seen sets of paintings by well-known Kentucky Impressionist artist Paul Sawyier.  The mounting of the two sets is very well-done with interesting historical tidbits of the Frankfort, KY landmarks depicted in the two sets, which differ in their portrayal of a popular 19th century poem.  Photos of those landmarks today are included.  I also appreciated the details showcasing the woman poet in addition to Sawyier and his work.  The History Center itself is very well-done also.",
  "The Thomas D. Clark center has many interesting artifacts and educates visitors on the many eras in the history of the Commonwealth of Kentucky!  Staff is very knowledgeable and friendly!  Exhibits are out of this world!",
  "For those of us who are interested in family history don’t forget the research library upstairs. My wife who was just starting to research her family history was able to find valuable information there today. We spend so much time in the library that we didn’t have time to visit the actual museum. Since we have a Kentucky Historical Society membership we will have other opportunities to visit the museum, the old capitol building, and the military museum. If you live in Kentucky you might like to buy a membership. Don’t forget as a member you can get other discounts or free admission as part of the Time Travelers Program to many other museums in the U.S.",
  "I highly recommend this special exhibit which runs until October.   The exhibit showcases two rarely seen sets of paintings by well-known Kentucky Impressionist artist Paul Sawyier.  The mounting of the two sets is very well-done with interesting historical tidbits of the Frankfort, KY landmarks depicted in the two sets, which differ in their portrayal of a popular 19th century poem.  Photos of those landmarks today are included.  I also appreciated the details showcasing the woman poet in addition to Sawyier and his work.  The History Center itself is very well-done also.",
  "The Thomas D. Clark center has many interesting artifacts and educates visitors on the many eras in the history of the Commonwealth of Kentucky!  Staff is very knowledgeable and friendly!  Exhibits are out of this world!",
  "We found this museum of Kentucky history quite interesting.  Kentucky played a integral part in the settlement of the western part of what was then United States. So, Has a history buff it was interesting to find out more details about that period of development of our country.",
  "The ticket includes 3 places, but I only had time for the interesting tour of the Old Capital and the Ky. History Center in the 5.5 hours I had to spend.  The history museum is exhibited chronologically, and since I was by myself, I was able to read all the descriptive info I wanted!  The labeling of objects is so complete that I never left wondering what THAT thing was... All sorts of topics in Ky. history were covered. No special exhibit was going on that day. I didn't have time to read the Hall of Governors listings by each painting.  After looking at the exhibit of dolls of the wives of Governors in the Capitol, I wanted to learn more about why some served such a short time, etc. Employees were helpful--suggested I store my winter coat on the back of one of their chairs since their coatracks were being used for a special event that evening,  came and found me in the museum to let me know there was going to be a tour of the Old Capitol offered that day after all, opened the gift shop just for me, etc.",
  "For those of us who are interested in family history don’t forget the research library upstairs. My wife who was just starting to research her family history was able to find valuable information there today. We spend so much time in the library that we didn’t have time to visit the actual museum. Since we have a Kentucky Historical Society membership we will have other opportunities to visit the museum, the old capitol building, and the military museum. If you live in Kentucky you might like to buy a membership. Don’t forget as a member you can get other discounts or free admission as part of the Time Travelers Program to many other museums in the U.S."
 ]
},{
 "name": "Daniel Boone Burial Site",
 "address": "215 E Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/20/80/35/daniel-boone-burial-site.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d5415177-Reviews-Daniel_Boone_Burial_Site-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "In the Frankfort Cemetery, follow the yellow lines on the road and it’ll take you to Daniel & Rebecca Boone’s resting place. A great view of Frankfort adds to the stop. While there isn’t much to see, it’s worth the trip to take the step back in time and remember. ",
  "We got to the grave site late in the day.  Also a great view  of Frankfort from this mountain.     i need to google about how Ky got the remains.",
  "Had a little trouble finding the grave but persevered and succeeded.  Lovely spot.  Just up from this grave site is the KY veteran's site, also worthwhile",
  "My friends surprised me by stopping by Daniel Boone’s burial site and sharing the glorious view.  It’d be rainy - but it was wonderful to honor Daniel Boone and see the remarkable view! ",
  "Our touring group made a short stop on a lovely day.  The grounds and view were very pleasant. A nice spot to visit if you are in the area."
 ]
},{
 "name": "Frankfort Cemetery",
 "address": "215 E Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/d0/24/54/war-memorial.jpg",
 "tags": [
  "historic",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d105636-Reviews-Frankfort_Cemetery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had to explain who Daniel Boone was on the drive to this spot. They knew he was a guy who wore a coon skin hat and that’s it. His burial site was easy to find, had a stunning view of the capital, and the rest of the cemetery is quite lovely as well.",
  "This is a beautiful and very large cemetery.  You will see the resting place of Daniel, and Rebecca Boon.  The cemetery overlooks the city of Frankfort with fabulous views from atop the hill where the cemetery is located.  ",
  "It's odd to give a cemetery any type of rating, but my 5 star is based off the view from the location and the historic value.\n\nIt has a beautiful view of the Ky River, with rolling hills and tons of old trees leading up to the \"Mound\" with the State War Memorial.\n\nWe have visited many times to look at Daniel Boone's grave and various historical military monuments.\n\nThere is also a relatively new \"monument\" area for children. It is at the very back of the cemetery with a beautiful view of the river as well.\n\n",
  "Went to see Daniel Boone's grave. It is marked on road & easy. High on the hill overlooking the KY River & State Capitol.",
  "This is a beautiful well maintains cemetery that is worthy to have family in. I have family here and other places. Unfortunately if I had known how nice the Frankfort Cemetery was compared to other local cemeteries, I would have put my family here. I even thought very hardly about moving them here at one point. Great place and well taken cate of.",
  "This is a beautiful cemetery. Daniel Boone's grave overlooked the Kentucky State Capital and Kentucky River. It is very beautiful place.",
  "Picked up the map and the signs indicated to follow the yellow not brick but painted line to the site  I also listened on my phone to the blur they had on the grave site  which was worth   Be sure to explore other sections too and see if you have the dogs    I do love dogs and being from\nCalifornia the culture of other states ",
  "We went specifically to see Daniel Boone’s grave, which is in a beautiful location with a perfect photo op of the capitol. we stopped to see a few others while we were there. The war memorial was a large obelisk with multiple panels listing all the fallen soldiers from all wars. A beautiful tribute. "
 ]
},{
 "name": "Three Boys Farm Distillery",
 "address": "283 Crab Orchard Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/3c/e2/67/ross-offered-a-very-pleasant.jpg",
 "tags": [
  "tour",
  "family",
  "tasting",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d8635776-Reviews-Three_Boys_Farm_Distillery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are in the Frankfort Kentucky area, Don't pass up the opportunity to visit three boys farm. This is a great little distillery off the beaten path. They have a great philosophy, Hunter, the master distiller is a great guy who definitely knows what he's doing. You can do cask strength barrel tastings in the visitor center and the distillery tour across the way is very interesting and informative.",
  "You want to talk about a small distillery this is it.  A family business out on the farm.  It really is worth the drive out there.  The lady in the shop who does the tastings is a lot of fun.  The young man taking care of the distilling is very open to questions.  Bourbon on a whole different level than the big boys. On the down side I do have to say that the bottles are a bit pricey but VERY good.  Enjoy",
  "AS a large group of former college friends did the Bourbon Trail for a long weekend in October 2019, we had many large and famous distillery stops, but this one is very small and owned by a great guy who runs it with the help of his 3 Boys!  I was intrigued as we have 3 boys ourselves.  It was cool to meet the owner and have lunch outside with a view of the rolling hills of Ky.  Great bourbon tasting experience and a fab little gift shop too!",
  "This was our second visit here and it was a must we stopped this time coming to Kentucky. They make it such a personal experience and I really enjoyed seeing their line up grow since we first stopped 2 years ago. It remains a favorite of mine. The tasting from the barrels is a must. ",
  "This is an awesome place to visit. One of Frankfort's best and growing distilleries. It is located on Crab Orchard in Grafensburg. It is worth visiting and you will enjoy it very much."
 ]
},{
 "name": "Liberty Hall",
 "address": "202 Wilkinson St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/e4/0a/c1/liberty-hall-historic.jpg",
 "tags": [
  "history",
  "knowledgeable",
  "tour",
  "history",
  "family",
  "wander",
  "history",
  "family",
  "library",
  "historic",
  "tour",
  "tour",
  "historic",
  "library",
  "history",
  "knowledgeable",
  "history",
  "organized",
  "knowledgeable",
  "tour",
  "historic",
  "knowledgeable",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d1741611-Reviews-Liberty_Hall-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our guide Karen was very friendly, enthusiastic, informative, and very knowledgeable about local history. Well worth our time!",
  "If you like colonial-era houses with lots of history, this Brown family home is great. It's beautifully kept with mostly original furnishings and the guide told lots of interesting details about the family's place in KY history. \nThere are actually 2 houses side-by-side to see and you can wander around the gardens either before or after the scheduled tour.",
  "I enjoyed taking a guided tour of the Liberty Hall Historic Site on Tuesday, April 3rd, 2018. Two tour guides conducted the tour. Since it was apparently Meghan's first tour, she was accompanied by an experienced tour guide (Kate). I felt blessed to get information from two guides.\n\nTours begin at the John Brown house at 1:30 p.m. They currently only do one tour daily according to Kate. She stated that they used to do more, but cut back due to interest levels. This seems a shame, since I think it would be great if many more took time to take this tour. Tours are conducted Monday-Saturday mid-March through late November according a brochure I got at the Frankfort Visitor's Center.\n\nKate and Meghan provided much information about the house, its artwork, furniture, and other furnishings, was well as the Brown family history. The guides even discussed a ghost allegedly seen by multiple people, though they apparently hadn't seen it. This interesting and educational tour provided much information.\n\nIn addition to the rooms of the house, the tour included the laundry building and kitchen, which were near the house.\n\nI enjoyed each part of the tour, seeing the furnishings of the various rooms and learning about them. But, what most impressed me were the contents of an upstairs room in the John Brown house that at some point had been converted into a library. This room contained numerous shelves of old books that had belonged to the Brown family.\n\nKate stated that a two-year grant had aided in cataloging/organizing the books. In many books I saw pieces of paper with what appeared to be Dewey Decimal numbers. Maybe they were in all the books. I could read the titles on the spines of some books. But due to their age, etc., I did not ask to remove them from the shelves or to even touch them.\n\nIt would be great if a complete listing of the books (title, author, publication date) were posted publicly online. Researchers and many others (at least me!) would enjoy this I think. I saw some volumes from what appeared to be a huge six-volume dictionary; it would be interesting to see what those volumes and others contain.\n\nIn addition to the John Brown house, the tour also included the gardens/grounds, as well as the next door Orlando Brown house. Meghan conducted the Orlando Brown house portion of the tour solo. That portion went fairly quickly since it only covered the downstairs, and Meghan noted that the Orlando Brown house and its contents were not as notable as the John Brown house and its contents. Kate came in during the Orlando Brown portion of the tour, and in response to my question, said the upstairs of the former Orlando Brown home was now used for offices, though it originally had been bedrooms.\n\nThe guided tour of the Liberty Hall Historic Site costs $6 for adults and $3 for children of certain ages. The site is conveniently located near downtown Frankfort.\n\nI'm not sure how many persons can take the tour at once. About 6-8 people were on the tour I took.\n\nThe guides patiently answered all the questions from me and the others on the tour. I asked many questions myself. At least a few times, I interrupted a guide to ask a question and perhaps interrupted her train of thought. I apologize for that!\n\nI recommend persons in the Frankfort area consider taking time for this tour, especially if they are interested in early Frankfort history. My guides provided many interesting facts during a tour that probably lasted only an hour or less, including the questions and answers. Even children of elementary school age would enjoy much of this tour in my opinion.",
  "There are actually two old “massive majestic mansions” that make up this historic site museum.  The huge library on the second floor of very old books was most impressive.  The gardens were magnificent.  The tour guide Karen knew a lot and was able to answer all our questions.  You step back in time when you step through the door into these well-preserved buildings.",
  "Our guide Karen was very friendly, enthusiastic, informative, and very knowledgeable about local history. Well worth our time!",
  "Liberty Hall guides were enthusiastic, organized  and knowledgeable.  A+ for making history come alive!",
  "This is a beautiful historic site. It includes the two-story home, furniture, several acres of gardens, a smokehouse and antiques galore. There was so much to see and the guide was so knowledgeable that we had to cut our visit short after about an hour and a half. We can't wait to go back and finish the tour.",
  "We thought this property was very well maintained.  The guide was friendly and knowledgeable.  The grounds were pretty.  You get to see two houses for the price of one."
 ]
},{
 "name": "Prodigy Vineyards & Winery",
 "address": "3445 Versailles Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d6/12/58/winery.jpg",
 "tags": [
  "delicious",
  "winery",
  "tasting",
  "winery",
  "delicious",
  "food",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d8059566-Reviews-Prodigy_Vineyards_Winery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "We stopped here when we were on our way through Frankfort touring distilleries. We were in the mood for a change and wanted to get away from the crowds so we thought a winery would be nice. We were not disappointed! Prodigy Vineyards is a small family-owned operation. It is very inviting and the wine was delicious. On the day we were visited there were only a handful of people and we sat at the bar. I did a flight of dry reds and my husband did a flight of semi sweet wines and we both really enjoyed it. The property has a pond and horses that stroll by while you’re sitting there drinking wine which we thought was pretty cool. There are also a couple of friendly dogs that live there that they let in and out to stop by and say hello. Nice gift shop too. Very much worth the stop if you are in Frankfort.  ",
  "This facility is sort of tucked back-in behind the green rolling hills and winding driveways. Once you get to the winery buildings, there are also horse stables, a tasting room and a patio area that overlooks a pond. The wines are smooth and fragrant, and the service at the tasting room is friendly and efficient.\n\nA word of caution about the horses near the winery...the ones in-and-around the stables near the tasting room are very gentle and mellow. The ones near the parking areas, can be a little \"bitey\" (note the signs on the fences). We noticed another visitor was a little surprised at how quickly they got their fingers pinched, when they weren't paying attention.",
  "We were looking for some place for lunch on our way to pigeon forge and veered off 75 to this wonderful little hideaway. It was a very good decision on our part, we had so much fun with the Sommelier Lorenzo.  The views were beautiful, the wine and the food was delicious and the hospitality was memorable.   Would highly recommend this vineyard to anyone passing through! ",
  "We love Lorenzo!!! Tasted some wonderful wines and enjoyed lunch with my girlfriends!!  We will be back!! See ya in Pigeon Forge!!",
  "We enjoyed our wine tasting at Prodigy Vineyard, we were not rushed and got to taste some really good wines."
 ]
},{
 "name": "Floral Clock",
 "address": "700 Capital Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ec/52/aa/floral-clock.jpg",
 "tags": [
  "walking",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d7193408-Reviews-Floral_Clock-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were there after the Capitol building was closed but that doesn’t stop folks from stopping to snap pictures of the attractive floral clock. Fortunately at that time there are plenty of parking spots especially on a nice day. We at the nearby Rebecca-Ruth Candy Company and decided to drive by and view the capitol building and the floral clock. It only takes a few minutes out of your day if you go after business hours.",
  "The clock is worth a stop. The flowers and details are great. If you are visiting the Capitol, roll around to the back corner and check out the Floral Clock. Worth the visit.",
  "We stopped by here on our way from Lexington back to Louisville. It is very pretty and well kept. It is located across from the Kentucky State Capitol which is oddly but pleasantly, in quite a bucolic setting.",
  "On a two day road trip, we tried to plan unusual stops to stretch our legs. This was a great stop. The clock was beautiful. We took a bunch of pictures on a beautiful day. Needed to ask someone to point us in the right direction once we parked the car, but they seemed happy to do so.  ",
  "Driving behind the capital build to get k the floral clock was simple. It was beautiful and a small group of locals were walking by and offered to take our picture as a family. They were very friendly as have been all we’ve met in the area!"
 ]
},{
 "name": "Old State Capitol",
 "address": "300 W Broadway St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/c8/37/39/old-ky-state-capitol.jpg",
 "tags": [
  "tour",
  "art",
  "history",
  "historic",
  "tour",
  "walk",
  "structure",
  "tour",
  "history",
  "history",
  "historic",
  "tour",
  "library",
  "knowledgeable",
  "tour",
  "history",
  "library",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d105638-Reviews-Old_State_Capitol-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Roger gave a GREAT tour! Interesting stories and trivia, along with art and architectural features. Antidotes  of historical figures were fascinating, and some rather humorous! ",
  "I took an educational, entertaining guided tour of the Old Kentucky State Capitol Building on Wednesday, June 27, 2018.\n\nThe building may only be visited via a guided tour. The guided tours begin with a walk to the Old State Capitol Building from the Thomas D. Clark Center for Kentucky History (The Kentucky Historical Society Museum) a couple of blocks away.\n\nPaying $8 for a self-guided tour of the impressive collection of the Thomas D. Clark Center also entitles one to take a guided tour of the Old State Capitol (and take a self-guided tour of the Kentucky Military History Museum). I think it's a great bargain.\n\nBefore entering the Old State Capitol Building, the guide (Steve) pointed out the spot where Governor Goebel was shot, which is marked by a plaque. he also pointed out some details about the assassination.\n\nThe entrance foyer and overall architecture of the building seemed impressive.  \n\nThe tour included a room that contains a huge collection books, primarily law-related. This room had served as the mail room for the state government long ago, Steve said. \n\nThe self-supporting staircase in the Old Capitol Building is an impressive sight itself. Steve (my guide)  said the only step in the staircase that is supported at all is the top one, which is inset a bit into the wall on one side--to keep it from lifting up, not from falling down. I remember many years ago on my first trip to this building, a 1972 eighth grade class trip, that a tour guide told us that the harder we stepped on the top step the stronger it got. We children had fun stepping and jumping on that step. And I still enjoyed the staircase on this second visit, which was in June 2018.  \n\nIt was also nice to see the structure of the building. And I enjoyed seeing the furnished Senate and House of Representatives chambers with desks, chairs, and artwork. Two large gas chandeliers (one in each chamber) originally there remain. But, they have been converted to electric.\n\nOne of the two cloakrooms is still there. My guide wasn't sure if it was the one for the Senate or House of Representatives. But it was nice to see this room, along with some furnishings. It even had a chamber pot in it behind a curtain. This building did not have either indoor plumbing or electricity when originally constructed.  \n\nDuring the school year there are probably crowds of school children taking the tour. But on the afternoon of June 27, I was the only person there for the 1:30 p.m. tour. It was a privilege to get a one-on-one tour with Steve. He patiently answered my questions, and the tour took probably about an hour or an hour and fifteen minutes.\n\nI urge persons in Frankfort to seek to take a guided tour of his historic structure.",
  "(Kentucky Colonel) Roger Barlow is far and away the best tour guide I've ever had - he is witty, personable, and incredibly intelligent and passionate about Kentucky history. This tour is a fascinating trip through Kentucky and Frankfort political history, and is perfect for history enthusiasts or anyone new to the area. I was fortunate enough to come here on a first date, and Roger's highlights gave us many things to reminisce about to this day, and I owe this relationship (at least partly) to him ;)\n\nFrankfort is a charming city, the weather was gorgeous, and we could not have asked for a better guide or tour! Thank you.",
  "The Old Capitol located in Frankfort is full of history inside and out. Down front was where Governor Goebel was shot in front of the historical building. Inside you will find the self suspending stairs, which is beautiful and yet amazing. Upstairs you can sit at the same tables as the original statesmen gathered to build this great state. Downstairs you can find tons of history relating to Kentucky.",
  "Wed walked the manicured grounds on a bright 62˚F day. The building and its surrounds could tell some great tales - a placid and historic site.",
  "The guide was quite knowledgeable and helped us understand how this building was used as a law library, legislative house, and housing for federal troops (during the Civil War.). Interesting tour.  Also neat to see the freestanding spiral stair that led to the meeting rooms for the legislature.",
  "An hour tour here shed light on the early Commonwealth. The library and chambers were described by the guide, including important events that happened there. A Civil War exhibit is there now, also. Included with ticket to the History Center.",
  "Arrived too late for the tour. But fortunately a gentleman exited the building nextdoor. He gave us directions to the new capital building. We did tour the new capital building. Also he told us the old building was for the historical artifacts. Special thank you to the gentleman for sharing his time with us. "
 ]
},{
 "name": "Elkhorn Creek",
 "address": "off Highway 1262",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/d2/83/41/enjoying-the-creek.jpg",
 "tags": [
  "family",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d107221-Reviews-Elkhorn_Creek-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "A kyack paradise. You can rent a Kyack or canoe from Canoe Kentucky or put your own in. Do not put in above US 421 due to dam above there. Best to check with Canoe Kentucky before putting your cannoe or kyack in to the creek. Scenery is great., ",
  "We did this as a family adventure probably when my daughter was 8.  We had a good time....the sites were amazing.  However we went after it had not rained in a while and the canoe bottomed several times, requiring us to walk it through a few spots.  I actually enjoyed this experience more than I my family would want to admit.  I didn't mind doing it, but they didn't like hearing \"I told you so\"...",
  "Elkhorn Creek is beautiful. Folks canoe in it probably the most around here. It has many beautiful sites like the falls and the distillery. It is relaxing and peaceful. On the other hand many folks love to fish in the creek here because the fishing is great. So if your want to relax and have a great time, check out the Elkhorn Creek and its beauty.",
  "Fantastic afternoon on the creek!\n\nWe saw deer, snakes and many turtles!\n\nWell explained tour, safety and driven up to drop off / starting point!\n\nReally beautiful setting and countryside, rapids were fantastic but not too challenging for quite inexperienced kayakers!\n\nA really great way to spend an afternoon!",
  "Beautiful scenery. Water levels low in August and September. But still had a great time. No major whitewater so even beginners like us can enjoy the trip . Tried to upload photos."
 ]
},{
 "name": "Kentucky Vietnam Veterans Memorial",
 "address": "365 Vernon Cooper Drive",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/cf/42/1e/kentucky-vietnam-veterans.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d105640-Reviews-Kentucky_Vietnam_Veterans_Memorial-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were here on an autumn Sunday morning. Overcast, quiet, birds singing, you can see the State Capitol Building from the memorial. The memorial is a sundial, with the names of the fallen arranges in such a fashion that the shadow of the gnomon will fall on the names on the anniversary of their death.",
  "It is amazing that someone thought of this and then figured out how to construct it.  You can see the capitol from the hill it is on.  There are some good descriptive plaques to teach the viewer how the memorial works.  Moving tribute to the fallen.\n\nWell done and deserves 30-60 minutes of your time.",
  "I always take tourists here if we are in the area together. The memorial is on a hill with a seemingly ever-present wind to blow the flags. The sound of the flags is often the only noise in the area. I love the sun dial concept and the reverence that the site commands. Beautiful.",
  "The memorial itself is simplistic but the bigger significance is the shadow cast by the point of the dial is directly on the individuals for the day they passed away. I am awestruck how the architects were able to achieve this feat but it is a true tribute to the men and women who gave all. It is a peaceful area with not much traffic from what I can tell.",
  "We were here on an autumn Sunday morning. Overcast, quiet, birds singing, you can see the State Capitol Building from the memorial. The memorial is a sundial, with the names of the fallen arranges in such a fashion that the shadow of the gnomon will fall on the names on the anniversary of their death.",
  "It is amazing that someone thought of this and then figured out how to construct it.  You can see the capitol from the hill it is on.  There are some good descriptive plaques to teach the viewer how the memorial works.  Moving tribute to the fallen.\n\nWell done and deserves 30-60 minutes of your time.",
  "This memorial commemorates those from Kentucky who died in the Vietnam War. Each individual is honored as the sundial's shadow points at the name and the date at which each individual lost his/her life. Also,  the capital of Kentucky is seen on the horizon between the sundial and the granite where the names are etched. Sunset is a beautiful time to visit the memorial. ",
  "I always take tourists here if we are in the area together. The memorial is on a hill with a seemingly ever-present wind to blow the flags. The sound of the flags is often the only noise in the area. I love the sun dial concept and the reverence that the site commands. Beautiful."
 ]
},{
 "name": "Capital City Museum",
 "address": "325 Ann St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/d3/b0/40/view-from-parking-lot.jpg",
 "tags": [
  "historic",
  "free",
  "tour",
  "tour",
  "history",
  "history",
  "free",
  "free",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d6732366-Reviews-Capital_City_Museum-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "This small free museum about Frankfort and Kentucky is worth a stop.  Be sure to go upstairs to see lots of historic items.  A stop at the Capital City Museum is a “capital idea.”",
  "This museum in downtown Frankfort is full of fascinating exhibits, including, of course, about the bourbon industry, But I didn't know that Frankfort was once a center for custom-made fishing reels (the Meeks brothers and Benjamin Milam are notable early reel makers). There is a fascinating display of fishing reels, as well as the more \"usual\" historical paraphernalia. We visited on a Saturday afternoon and were the only people in the museum at that time, so spent some time chatting with the very personable young man at the desk. With Halloween coming up, we were talking about ghost tours (Buffalo Trace, the Gray Lady tour at Liberty Hall) and he shared some other local ghost stories with us, as well as general \"visitor information\" about Frankfort. Well worth a stop.",
  "This is a self guided tour that doesn't cost anything. It is a 2 story building but it does have an elevator. This museum focuses mostly on the city's history/",
  "Stopped here after our visit to the state capital building. Excellent small museum with interesting pieces and lots of history of the local area. Very friendly folks that work there as well. I enjoyed this more than the history center across the street that we paid to enter. This was a great museum and the admission was free.",
  "This is a professionally laid out museum that tells the story of Frankfort. They had a very informative display on Bourbon and Frankfort and on the Kentucky River. Their archivist is a fountain of knowledge on Central Kentucky. Have a nice library.  Admission is FREE. "
 ]
},{
 "name": "Josephine Sculpture Park",
 "address": "3355 Lawrenceburg Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/50/05/9c/suspended-in-water-or.jpg",
 "tags": [
  "walking",
  "walk",
  "art",
  "free",
  "kids",
  "tour",
  "walk",
  "free",
  "walking",
  "pets",
  "nature",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d8652610-Reviews-Josephine_Sculpture_Park-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "16-Year-Old Grandson and I saw a few sculptures from the main road of Highway 127 between Frankfort and Harrodsburg KY and decided to explore. Walking groomed grassy pathways, each of the 30 acres offered wonderful huge sculptures of every kind. The posted signage helped a lot to understand some of the pieces.",
  "You have to walk through farmland to visit these works of modern sculpture. The grass was a little wet but it was worth the walk. Some of the art was not for us but others pieces were worth viewing  ",
  "This farm is the perfect venue for exploring outdoor sculpture in a natural setting. It’s a hiking experience with hands on exploration. Many of the sculptures are interactive and allow touching, climbing, etc. My grandchildren love to run thru the mowed paths from one Sculpture to another. We also read about each one and discuss how it was made, what it means, and how it fits into the environment. There are picnic tables for one to use, bathrooms, and a myriad of paths to explore. It’s also FREE!",
  "We took four kids, ages 10-13, to the sculpture garden. We weren't sure exactly what to expect but it was more rugged than we thought. We have been to other sculpture gardens that have had paved paths. This is large fields with the sculptures placed pretty far apart. So be prepared for a walk and wear appropriate foot wear. There is a little visitor center (pretty much a shed) where you can grab a map and a scavenger hunt. The kids did enjoy it but just don't expect any frills and I would take sunscreen and water with you. Also, we went because it was on our way back from a State Capitol tour. I probably would not make a trip just for the Sculpture Garden. Plan to see a few other things in the area too.",
  "I found this place by accident and am so happy I did.  It's a very relaxing and chill private/non profit sculpture park just outside of Frankfort.  I'd have never imagined something like it would be in the area.  There are about 50 modern sculpture works scattered around trails covering quite a few acres.  Take and hour and enjoy the stop.  It's highly worth it and completely free.",
  "16-Year-Old Grandson and I saw a few sculptures from the main road of Highway 127 between Frankfort and Harrodsburg KY and decided to explore. Walking groomed grassy pathways, each of the 30 acres offered wonderful huge sculptures of every kind. The posted signage helped a lot to understand some of the pieces.",
  "This was not even close to what I thought it would be. So glad I had my sister with me who was able to make the experience fun. I cannot recommend anyone to stop here. ",
  "Over 70 pieces of art on 5 nature trails where you can see not only the art, but native plants and local wildlife.  Artists from over 10 countries have constructed the art on the grounds.  Monthly events are held here as well as annual festivals.  Great place for photographers.  You can also bring your pets as long as they are on a leash and you clean up after them."
 ]
},{
 "name": "Switzer Covered Bridge",
 "address": "Jones Lane",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/d1/99/5a/20180920-113200-largejpg.jpg",
 "tags": [
  "historic",
  "free",
  "unique",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d8561238-Reviews-Switzer_Covered_Bridge-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "The historic 1855 Switzer covered bridge over North Elkhorn Creek has been reconstructed.  People can literally “walk through history” free.  Unfortunately, someone has painted graffiti on the bridge",
  "I had read the reviews about the graffiti but still wanted to see the bridge and I was angry about what I saw that I had to step back and take these photos that state words to say this is unique and valuable but the actions of the graffiti on the Walls the floor and even the medal post to prevent cars entering    Big question is why as someone not adapted this bridge   The area is beautiful and peaceful to sit and listen to the stream flowing by but graffiti was just sadness and despair of a place that no one seems to care about",
  "Beautiful covered bridge.  So sad that graffiti has been painted everywhere.  It is still worth the drive to see.",
  "I hated to see all the graffiti all over the bridge, but was glad to see the bridge was in good shape. Be careful of the neighbors dogs, they came running off the hill after us, we had to run back to our vehicle to not be attacked. ",
  "I’m glad we got to see this piece of history, BUT, incredibly disappointed that the human race is despicable enough to cover it with graffiti."
 ]
},{
 "name": "Kentucky State Capitol",
 "address": "700 Capital Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/3d/4c/97/tulips-in-full-bloom.jpg",
 "tags": [
  "history",
  "free",
  "library",
  "historic",
  "walk",
  "tour",
  "tour",
  "historic",
  "structure",
  "tour",
  "free",
  "tour",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d15067112-Reviews-Kentucky_State_Capitol-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "This historic 1910 capitol is an impressive building by itself.  A lot of history has been preserved in the rotunda and surrounding hallways.  Be sure to “look up” the Kentucky State Capitol and “look up” at the ceiling to appreciate the magnificent painted murals.  People will see lots of decorations on a free walk through the building.  There are 70 enormous columns and lots of sculptures.  The glass floor on the second floor of the library was awesome to walk on.",
  "I've visited enough capitols to prefer the ones that actually tell me something about the state. This one does and is beautiful, too. The brochure is not slick some in other states. It is black and white and looks like an over-sized piece of paper folded up. But, it is chockablock full of info. You even get the state song. It tells you little things to look for all over the building.  What it doesn't tell you is what the lady at the desk told me- watch the dome from the rotunda for a few minutes. I won't spoil the surprise, but it is cool. I didn't take a guided tour, but roamed on my own and it was very enjoyable.The State Reception Room's mirrors were cool.  I wasn't surprised to see Lincoln in the rotunda, but was surprised to see Jefferson Davis nearby. I hadn't expected to see him in a capitol of a state that stayed in the Union. It turns out that he was born in Kentucky, too.",
  "Enjoyed first ever visit to historic KY State Capitol. Took a tour inside this historic building with a guide. Can tour on your own. Beautiful design, heard background info. on parts of the structure, people involved in furnishings, etc. See State House & Senate Chambers where government business is conducted. Saw in KY Supreme Court Room & new judge sworn in. Old Capitol Bldg. not far away available for tours & other historic sites to see. Recommend.",
  "The state provides free guided tours of the building. The interior is awesome. They do not build public buildings like this anymore. You will need an hour or more to tour the building. Parking can be a challenge. You can enter through basement floor door near floral clock and not climb all the steps. ",
  "We arrived while no one was in session so it was quiet and no tours were scheduled however we were permitted to tour on our own. The information ladies gave us a rundown of the 3 floors and what to look for and see. The infinity mirrors on the 2nd floor were fun. The marble and ornate wood was beautiful. Parking was ample all around and it was free as was the tour. "
 ]
},{
 "name": "The Grand Theatre",
 "address": "308 Saint Clair St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/70/4c/0c/photo0jpg.jpg",
 "tags": [
  "theatre",
  "drink",
  "theatre",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d2514442-Reviews-The_Grand_Theatre-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Grand Theatre provides a smaller, more intimate space than many newer theatres. Seeing the Vienna Boys Choir in concert here really added to the experience!",
  "We saw Delbert McClinton here last night and had a great time. All of the staff here are very polite and friendly, and gracious to all the customers. The acoustics were fantastic and with the capacity at only 423 there’s not a bad seat in the house. The seating is tight but comfortable, unless you are next to a large person like my wife was. If you need to make a lot of trips to the bar or restroom, and if you’re sitting in the middle of the row, it’s a real hassle because it’s nearly impossible to get out without the whole row emptying out. And when you return with drinks in hand and the people don’t clear out of the row completely, it’s a recipe for disaster. All said though it’s a really neat place to see a concert. Just try to sit close to an end if possible. We will definitely be returning!",
  "Have seen numerous concerts here, but this week was the first time to see a movie. Projection system worked great and there's a first rate audio system as well. A bit larger than the eight plexes you see at shopping malls. Very comfortable seats and very clean, with no strange aticky sinstances on the floor! Highly recommend. ",
  "Enjoyed the Jim Brickman Joy of Christmas concert as our first visit to this theatre.  It is small and fully staffed by volunteers.  It is not much to look at now, but there are a lot of postings inside detailing it's history and I assume it is still undergoing renovation.  Seating is tight, especially for longer legged folks like myself.  We had balcony seats which are very steep but give you the sense of being close to the stage.  Sightlines are good except for those who might have to look through metal retaining bars at the bottom of the balcony aisles > this affected our view but we were able to move to unsold adjacent seats for an unobstructed view.  Acoustics were fine.  They have a small snack bar on the first floor and sold wine & beer on the second floor but no food or drink are allowed into the actual theatre.  It is not currently much to look at compared to similar venues we have visited in Louisville, St. Louis, Cincinnati, or Appleton but is smaller and located in a much smaller city.  I'd love to see the place continue to evolve as it has lots of potential to be a hidden gem.  It has already attracted a very good and diverse selection of talent. I recommend supporting The Grand with your attendance and hope that perhaps some private and or municipal investment would enable it to finish it's restoration efforts. ",
  "This is a gem with outstanding shows in an atmosphere that is second to none. Here you will see top notch artists in what feels like your living room. It is run entirely by volunteers who do a great job. Don't miss this great venue. "
 ]
},{
 "name": "Leslie Morris Park",
 "address": "400 Clifton Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/fa/46/3c/leslie-morris-park.jpg",
 "tags": [
  "walking",
  "nature",
  "history",
  "hike",
  "free",
  "tour",
  "walk",
  "walking",
  "nature",
  "history",
  "hike",
  "free",
  "tour",
  "walk",
  "learn",
  "free",
  "nature",
  "history",
  "walking",
  "nature",
  "history",
  "hike",
  "free",
  "tour",
  "walk",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d3380801-Reviews-Leslie_Morris_Park-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park features walking trails in a beautiful forested setting. Maps of the three trails are available. \n\nOne trail contains historical plaques telling about the two forts that were on the hill during the Civil War, as well as a nice view of downtown Frankfort. Two other trails focus more on nature, providing views of an osage orange grove, two sinkholes, a cave entrance, bird houses and a bird blind, a meadow designed to attract butterflies, and some beautiful nature scenery, with markers that provide information about some of these attractions.\n\nOne way to reach the park is to drive up to its entrance in a car. As an alternative, visitors can walk up the steep hill on a trail that is an old road which was used to bring materials up Fort Hill during the Civil War. The trail is called Military Road, but it actually predates the time the forts were built according to one of the employees in the park.\n\nThis foot trail is the way I went on my visit on Wednesday, October 3, 2018. It is a fairly steep hill and perhaps a 30 minute walk up (perhaps 15 minutes down) that begins by climbing some steps from Wilkinson Boulevard up to apartment buildings, then behind the apartment buildings a sign marks the trail itself. Construction work where the Capital Plaza Tower was torn down prevents access to the original beginning point of this access path. I enjoyed the nature hike up and down this trail and recommend it for those able to hike it.\n\nA log cabin originally built in 1810 that was moved eight miles to the park, has been remodeled to look as a tavern/inn might have in 1860. One room of it looks like a general store, and one upstairs room looks as a guest room might have. Restrooms for park visitors are in the lower level of this building, and the city employees who work them offer water and Gatorade. For persons driving to the park, parking is available near this log cabin. \n\nTwo city employees sitting on the porch of the log cabin patiently answered my questions. I took a self-guided tour. But, I think city employees offer guided tours. You should check with them if interested in a guided tour.   \n\nVisiting the park is free, and I highly recommend it for persons in Frankfort who enjoy learning history and/or taking nature hikes.",
  "This park features walking trails in a beautiful forested setting. Maps of the three trails are available. \n\nOne trail contains historical plaques telling about the two forts that were on the hill during the Civil War, as well as a nice view of downtown Frankfort. Two other trails focus more on nature, providing views of an osage orange grove, two sinkholes, a cave entrance, bird houses and a bird blind, a meadow designed to attract butterflies, and some beautiful nature scenery, with markers that provide information about some of these attractions.\n\nOne way to reach the park is to drive up to its entrance in a car. As an alternative, visitors can walk up the steep hill on a trail that is an old road which was used to bring materials up Fort Hill during the Civil War. The trail is called Military Road, but it actually predates the time the forts were built according to one of the employees in the park.\n\nThis foot trail is the way I went on my visit on Wednesday, October 3, 2018. It is a fairly steep hill and perhaps a 30 minute walk up (perhaps 15 minutes down) that begins by climbing some steps from Wilkinson Boulevard up to apartment buildings, then behind the apartment buildings a sign marks the trail itself. Construction work where the Capital Plaza Tower was torn down prevents access to the original beginning point of this access path. I enjoyed the nature hike up and down this trail and recommend it for those able to hike it.\n\nA log cabin originally built in 1810 that was moved eight miles to the park, has been remodeled to look as a tavern/inn might have in 1860. One room of it looks like a general store, and one upstairs room looks as a guest room might have. Restrooms for park visitors are in the lower level of this building, and the city employees who work them offer water and Gatorade. For persons driving to the park, parking is available near this log cabin. \n\nTwo city employees sitting on the porch of the log cabin patiently answered my questions. I took a self-guided tour. But, I think city employees offer guided tours. You should check with them if interested in a guided tour.   \n\nVisiting the park is free, and I highly recommend it for persons in Frankfort who enjoy learning history and/or taking nature hikes.",
  "I was so surprised to learn of this fun hiking area right in downtown.  Would never have realized it was there on my own.  There are at least two entrances, one of which has a parking area.  We accessed it by climbing some steps and then hiking up a path through the trees.  Good exercise and interesting historical markers.",
  "This four-acre park is located on a hill overlooking downtown Frankfort.  It was a military fortification built by Union soldiers during the Civil War.  There are lots of trails through the wilderness area.  This is a free “peaceful park place” right downtown Frankfort.",
  "Leslie Morris Park is a nature preserve but hidden within the park is Fort Boone site of a Civil War battle on June 10 and 11, 1864. Great view of Frankfort from Fort's overlook. ",
  "Once again we made another visit to the Ft Hill park in Frankfort, KY. The history that is contained in this Fort is very interesting. The over view of the fort and Frankfort is fantastic. You can actually see downtown and how they protected the city. Interesting enough is the lay out of the fort on top of the hill, with the hiking trails that wind through the woods up the side of the hill. It is awesome how the city turned this into a park so people could actually see what was buried up there. Growing up, we always saw people going up the hill with metal detectors to look for the ball rounds from the muzzel loaders from the battlefield area. It is very beautiful in the spring.",
  "This park features walking trails in a beautiful forested setting. Maps of the three trails are available. \n\nOne trail contains historical plaques telling about the two forts that were on the hill during the Civil War, as well as a nice view of downtown Frankfort. Two other trails focus more on nature, providing views of an osage orange grove, two sinkholes, a cave entrance, bird houses and a bird blind, a meadow designed to attract butterflies, and some beautiful nature scenery, with markers that provide information about some of these attractions.\n\nOne way to reach the park is to drive up to its entrance in a car. As an alternative, visitors can walk up the steep hill on a trail that is an old road which was used to bring materials up Fort Hill during the Civil War. The trail is called Military Road, but it actually predates the time the forts were built according to one of the employees in the park.\n\nThis foot trail is the way I went on my visit on Wednesday, October 3, 2018. It is a fairly steep hill and perhaps a 30 minute walk up (perhaps 15 minutes down) that begins by climbing some steps from Wilkinson Boulevard up to apartment buildings, then behind the apartment buildings a sign marks the trail itself. Construction work where the Capital Plaza Tower was torn down prevents access to the original beginning point of this access path. I enjoyed the nature hike up and down this trail and recommend it for those able to hike it.\n\nA log cabin originally built in 1810 that was moved eight miles to the park, has been remodeled to look as a tavern/inn might have in 1860. One room of it looks like a general store, and one upstairs room looks as a guest room might have. Restrooms for park visitors are in the lower level of this building, and the city employees who work them offer water and Gatorade. For persons driving to the park, parking is available near this log cabin. \n\nTwo city employees sitting on the porch of the log cabin patiently answered my questions. I took a self-guided tour. But, I think city employees offer guided tours. You should check with them if interested in a guided tour.   \n\nVisiting the park is free, and I highly recommend it for persons in Frankfort who enjoy learning history and/or taking nature hikes.",
  "This is a beautiful short walk in the woods that leads to a historic over look of the the capitol city. This grounds were once a small Union camp during the American Civil War that stood guard over Frankfort the Capitol of Kentucky. The overlook is amazing and great for photos! Not too difficult to navigate by foot. "
 ]
},{
 "name": "Governor's Mansion",
 "address": "704 Capital Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/58/4d/7e/governor-s-mansion.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d279108-Reviews-Governor_s_Mansion-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had a great time taking the 30-minute tour. The house is four floors but only the first floor is accessible to the public. The docent covered everything from governor history to the history of the executive mansion itself with sprinklings of facts about the first ladies and artifacts in the residence. It is worth doing if you are near the Capitol and have some time to kill.",
  "This building has it all - architectural history and political history. The battleship Kentucky silverware on display is outstanding. Tour guide very knowledgeable. Landscaping is very nice.",
  "The mansion is gorgeous and the history is fascinating.  There are limited tours, so call in advance to make a reservation so that you don't miss out.  The tour guide was excellent, and we really enjoyed it.",
  "I had a great time taking the 30-minute tour. The house is four floors but only the first floor is accessible to the public. The docent covered everything from governor history to the history of the executive mansion itself with sprinklings of facts about the first ladies and artifacts in the residence. It is worth doing if you are near the Capitol and have some time to kill.",
  "The Governor's Mansion is in a lovely setting. The grounds are beautiful as is the mansion. It was not open for touring but it is definitely worth driving by at least.",
  "This building has it all - architectural history and political history. The battleship Kentucky silverware on display is outstanding. Tour guide very knowledgeable. Landscaping is very nice.",
  "A beautiful building with some an amazing looking garden. Perfect location beside the State Capitol for an easy visit. Gardener's paradise",
  "The mansion is gorgeous and the history is fascinating.  There are limited tours, so call in advance to make a reservation so that you don't miss out.  The tour guide was excellent, and we really enjoyed it."
 ]
},{
 "name": "Kentucky Military History Museum",
 "address": "125 E Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "tour",
  "history",
  "free",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d14058087-Reviews-Kentucky_Military_History_Museum-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "While this is  not a large collection and doesn't seem to change very often, it is a well maintained to collection.  Also your eight dollars will get a tour of the Old Capital Building and the Kentucky Historical Society.  It's well worth the time",
  "This museum is free if you have your sticker from the Ky history museum. It is a 2 story building with an elevator. Nice museum if you the military history.",
  "The museum features a nice collection of vintage military arms, some of which were personal possessions of prominent Kentuckians. If you like early weaponry, this is for you. Remarkably, there is also a very comprehensive collection of automatic assault weapons from a variety of nations since before WWI.",
  "This use to be a great military history museum - now it is an art gallery showcasing military history. Guns are few and far between. The Chinn exhibit on the second floor is but a shadow of what once was there.  ",
  "This museum is located on two floors of the building and features many different types of military weapons and gear.  A helpful docent is on hand to answer questions."
 ]
},{
 "name": "Buckley Wildlife Sanctuary & Audobon Center",
 "address": "1305 Germany Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/dc/84/0e/buckley-wildlife-sanctuary.jpg",
 "tags": [
  "knowledgeable",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d1027436-Reviews-Buckley_Wildlife_Sanctuary_Audobon_Center-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you want to spend a day in the outdoors there is no better place than the Buckley Wildlife Center - a little hard to find but worth the drive - friendly knowledgeable guides impart knowledge about wildlife and their importance  ",
  "The trails were just a mowed trails. The grass was a little high. But it was a very beautiful place. Good place to take the kids.",
  "Enjoyed the interesting and informative displays but especially enjoyed watching the birds and squirrels in the blind.  There are also hiking trails but we didn't do them.",
  "We went to visit this place but unfortunately it was closed. The sign board displayed it is closed on Mondays and Tuesdays. I wish people would have mentioned it in their reviews. Would have spared us 50 miles of drive.",
  "Great place to take your time and walk the trails. If you enjoy peace and quiet while taking in natures beauty, this is the place to go. Enjoy special educational talks that are present from time to time."
 ]
},{
 "name": "Broadway Clay Studio and Gallery",
 "address": "223 W Broadway St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/7a/bc/55/filename-069-png-thumbnail0.jpg",
 "tags": [
  "free",
  "free",
  "kids",
  "learn",
  "affordable",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d2514427-Reviews-Broadway_Clay_Studio_and_Gallery-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "The instructors at Broadway Clay are top notch. I appreciated that each had their own style and method of teaching. So each class had its own vibe -- it became my \"sewing circle\" of sorts where I made new friends and even networked.  There was usually structured content for beginners but students were free to pursue their own product or method. Classmates, interns, and instructors alike were eager to help newbies or advanced levels. No pot was trivial to them. The children's classes turned out some really adorable stuff too -- I was almost jealous!\nAs you get hooked, you'll start buying potting tools and glazes but they have everything you need to get started. They'll even let you store your tools in the studio.\nThe shop has some great gifts (at very reasonable prices), including some fancy ceramic gizmos you might not know you needed until now! The work is by instructors, interns, some students, and local artists.\nGo try a class! Just remember to bring a towel and some clothes you won't mind getting dusty. (If you're cold-natured, you may get a chill during the winter as this is a vintage building and you'll be playing in wet clay/water.)",
  "The instructors at Broadway Clay are top notch. I appreciated that each had their own style and method of teaching. So each class had its own vibe -- it became my \"sewing circle\" of sorts where I made new friends and even networked.  There was usually structured content for beginners but students were free to pursue their own product or method. Classmates, interns, and instructors alike were eager to help newbies or advanced levels. No pot was trivial to them. The children's classes turned out some really adorable stuff too -- I was almost jealous!\nAs you get hooked, you'll start buying potting tools and glazes but they have everything you need to get started. They'll even let you store your tools in the studio.\nThe shop has some great gifts (at very reasonable prices), including some fancy ceramic gizmos you might not know you needed until now! The work is by instructors, interns, some students, and local artists.\nGo try a class! Just remember to bring a towel and some clothes you won't mind getting dusty. (If you're cold-natured, you may get a chill during the winter as this is a vintage building and you'll be playing in wet clay/water.)",
  "This is a great place to take your kids and let them make a pot with their own hands.   Our church goes there in the summer during Reading Camp to let our students make a creation of their own.",
  "When we visited a number of children were taking a pottery class. Pottery for sale was of good quality and very reasonably priced. ",
  "Varied types of pottery for sale and the classes are great. You can learn a lot in hands on classes.",
  "A few friends and I decided we wanted to make some pottery. They have classes and will even teach you if you dont know how to thow on the wheel or you can roll out clay to make other things. I have taken two there and one was the wheel(which I love by the way) and the other was to make an owl vase(love it) I recommend stopping in to see the pottery to buy or sign up for a class",
  "As a gift to my mom, we took to Broadway Clay to make a little craft. We had so much fun and have a little souvenir to keep. It is so very affordable!!!",
  "Great staff, great with kids!  Lots of fun for all ages.  There are many beautiful pieces to purchase here as well."
 ]
},{
 "name": "Old Governor's Mansion",
 "address": "420 High St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/e9/5a/05/old-governor-s-mansion.jpg",
 "tags": [
  "historic",
  "tour",
  "history",
  "history",
  "tour",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d108036-Reviews-Old_Governor_s_Mansion-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful, historic site in downtown Frankfort KY.  Home to the Commonwealth's first 33 governors.  Sadly, the Old Governor's Mansion is NO LONGER OPEN TO THE PUBLIC, expect by special arrangement.  Still beautiful from the outside.",
  "After the new Governor's Mansion was built, they turned the Old Governor's Mansion into the Lt Governor's Mansion, but you could still tour it as could you tour the New Mansion. There is a whole lot of history in these buildings and are worth learning about our Commonwealth. Take a tour and relive history.",
  "Took my daughter . We just walked around outside but it was interesting. I had drove past the building many times and had not paid any attention to what it was.",
  "This building, once home to Ky's governor, then restored and home to our Lt. Governor is now used for events. Next to the Ky History Center, it is appointed with Ky furniture. \n\nI'm not sure when it is open, but I do not think it is every day.",
  "This is a very good place to visit if you are in the Frankfort area. It was home to 33 Kentucky governors from 1798 to 1914. This Landmark Mansion is listed on the National Register for Historic Places and notable for the seven U.S. Presidents who have visited here.  You can walk around the outside but, you have to call to arrange for a public tour."
 ]
},{
 "name": "West Sixth Farm",
 "address": "4495 Shadrick Ferry Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/97/fe/a3/west-sixth-farm-at-dusk.jpg",
 "tags": [
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d14771525-Reviews-West_Sixth_Farm-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great little bar with friendly and great service. Kaitlyn was super sweet, very friendly and great bartender!! My wife isn’t much of a beer drinker and Kaitlyn found her a beer she liked. Liked so much we bought a growler to go , and Kaitlyn took time to label it for us. There’s a covered patio outside to sit and enjoy the country and soak up some beers. There are walking paths, farm tours, mountain bike trails and corn hole boards for activities. Can’t wait to come back. ",
  "Met some friends here one evening.  Nice atmosphere, good beer, and the food truck there that evening was really good!  I will go back!"
 ]
},{
 "name": "Capitol View Park",
 "address": "Glenn's Creek Road",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/b9/d1/e1/fields-being-used-for.jpg",
 "tags": [
  "kids",
  "nature",
  "parks",
  "kids",
  "nature",
  "parks",
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g39426-d7898934-Reviews-Capitol_View_Park-Frankfort_Kentucky.html",
 "source": "TripAdvisor",
 "reviews": [
  "Probably one of the nicer ball parks I’ve been to.  Soccer, Basketball, Football, Baseball and more… If you like to play ball then this is your park.  The view is what really makes this place.  Easy to find and the grounds are nice, well kept, and rather large for a ball park.  There are a few picnic areas with grills and nature trails.  They do have one heck of an awesome bike trail.  You will see deer!  \n\nMy only complaint is that there is not a small playground area for the younger kids, especially when you have older kids playing in their leagues, it can be quite boring for them.",
  "Probably one of the nicer ball parks I’ve been to.  Soccer, Basketball, Football, Baseball and more… If you like to play ball then this is your park.  The view is what really makes this place.  Easy to find and the grounds are nice, well kept, and rather large for a ball park.  There are a few picnic areas with grills and nature trails.  They do have one heck of an awesome bike trail.  You will see deer!  \n\nMy only complaint is that there is not a small playground area for the younger kids, especially when you have older kids playing in their leagues, it can be quite boring for them.",
  "Frankfort's premier baseball and soccer fields are located here. During the summer there is always a game going on. some are free for some there is a small charge. Great way to spend a Saturday night watching either baseball or soccer. ",
  "Ball fields were nice,  but we were looking for a picnic area with grills.  The only grill we found was rusted out and barely use able.  ",
  "Frankfort's premier baseball and soccer fields are located here. During the summer there is always a game going on. some are free for some there is a small charge. Great way to spend a Saturday night watching either baseball or soccer. ",
  "The park has a variety of sports fields and is a great resource for outdoor activities.  The grounds are very well-kept.  Plenty of parking available.  I rated it a 4 instead of a 5 because while there were port-a-potties were available, there were no real restrooms in the area where my friends were practicing frisbee.",
  "In area for basketball games and drove by.  Too early for tulips, and Capitol is under Repair.  Hope to return.",
  "We spent the morning on the park's mountain biking trails and had a blast! My husband is an experienced rider and I am a newbie, but we both found the trails challenging and fun."
 ]
}]
