[
{
 "name": "National Civil War Museum",
 "address": "1 Lincoln Cir",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/1c/3f/9b/entrance.jpg",
 "tags": [
  "free",
  "tour",
  "family",
  "tour",
  "walking",
  "eat",
  "history",
  "kids",
  "family",
  "learn",
  "history",
  "historic",
  "music",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d279473-Reviews-National_Civil_War_Museum-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "While the National Civil War Museum does not provide an exhaustive look at the Civil War (best to go to the various battlefields for this) it does give a great overview of the events leading up to the outbreak of hostilities and the key political and military events.  There are monitors with videos scattered throughout and some very interesting artifacts and mementoes (including one of Lincoln's hat boxes!).  There's a large store and the museum sits atop a hill which provides splendid views towards downtown Harrisburg.  There's plenty of free parking.",
  "This is the only American Civil War museum that I have visited which gives an unbiased review of who, what, when, where, why and how this American tragedy affected the families of both the northern and southern cultures throughout that war.  The tour begins with video clips of a mixture of northern and southern families of varied economic strata and progresses with those families personal experiences throughout the galleries as the war progresses.  For the Yankees, it is at times an hypocritical abolishonist agenda of righteousness.  For the Confederates it is both a matter of states rights and an economic necessity for southern plantation prosperity.  To the slaves it comes down to survival, freedom, and the most basic needs of family stability.  Then lastly, there are those who are at best uncertain of where they stand and why.  The galleries are on two floors and filled with full sized and miniaturized dioramas with plenty of artifacts, maps, informational bulletins, narrations, and photographs of the era.  Most visitors are unaware of this museums connection with the Smithsonian Institution and the fact that it is less than an hour's driving distance east of Gettysburg.  I highly recommend you visit this museum.",
  "I enjoy visiting the Civil War Battlefields and Museums. While visiting the Gettysburg National Battlefield we took a trip down to the National Civil War Museum in Harrisburg, a 50 minute drive effort well worth it.\nThe museum exhibits are of very good (actually excellent is a better description) quality and present the Civil War in chronological order making a complex historical sequence of events very understandable. The presentations are in significant depth at the stations and very well explained with tv monitors providing expert presentations and walking the visitor through the events and circumstances. The tour took us 3 1/2 hours, we could have stayed longer. \nExcellent experience.",
  "Super museum .  Don't miss if you are in the area and are a civil war buff. Definitely a hidden gem,, never busy. I always take my friends... military discount.  As good as any of the museums in Philly with 2o% of the crowds.",
  "If you are sensitive to chemical smells, be aware that there is an artificial, fragrant smell in all of the rooms that may induce a headache in those who are sensitive.  The wax sculptures are clever. The artifacts from the American Civil War aroused my curiosity. If you like to participate in the museum experience by reading and watching video clips about the American Civil War, this is the place for you.  It would take some creativity to engage a school-aged child for a sustained amount of time who may not be particularly interested in learning about history by reading informational signs. The suggested app called Aurasma underwhelmed me. Might an audio option involving a headset be developed  to engage a wider range of visitors? The collection, however, piqued my interest. Use the available Groupon, when offered. Bring snacks, and eat them in the designated areas.",
  "This place had been on our list since we started planning our US road trip.  We missed a few things off but I am so pleased this made the list!\nYou will need a good 2-3 hours to visit here, take your time to absorb the information.\n\nAlso take time to appreciate the building and the views from the outside of the museum.\n\nI thought I knew a fair but about the American Civil War until I came here!",
  "Visited Saturday, Mar 14 with our school kids.  Was very impressed with this museum esp when they displayed both sides of the war.  Very well documented and facts presented well.",
  "Great spot up on a hill to give you nice views of Harrisburg. It costed my family of 4 (military) $33.00 to get in. The place is pretty big and takes you through every step before, during, and after the civil war. It’s done very well with print, videos, and artifacts. They have an excellent collection. We needed at least 2 more hours to really learn and read everything. So much I didn’t know. Really good gift store. ",
  "The scheduled time should be about 1 1/2 hour, however it was so informative and helpful we spent another hour. Having the history in chronological order kept our learning flowing. Dioramas and presentation of guns, uniforms, medical instruments taught us a lot.\nVery well worth the trip!",
  "Most Civil War museums have an ax to grind, a peculiar focus—a battle, a general, a lost cause, ironclads, etc.  The National Civil War Museum eschews a viewpoint as best it can and strives to supply the war in broad strokes from causes to reconstruction.  Located in Harrisburg, PA, and associated with the Smithsonian Institution, the Museum admirably looks at both sides in the conflict and uses a plethora of media.  First, a cast of actors appear throughout the museum in video monologues to show how the stages of the war affect the common people including a southern belle on the home front, a married black woman and her husband who endure his enlistment in the USCT, three brothers on opposite sides, and a southern landowner.  Next come the standard artifacts—the guns, cannon and uniforms preserved under glass. Then every other enhancement for the story in paintings, posed mannequins recreating historic scenes, war music, posters, slave sale handbills, and lived uniform reenactors to flesh out the exhibits to greater depth when needed. The exhibits themselves include a timeline of issues before, during, and after the war; slavery as seen by people at the time; campaigns and battles 1861-1865; weapons and equipment; building the armies from volunteers to drafts; women in the war; battlefield medicine; the building of the navies; why men fought; Civil War music; Civil War battlefield grooming; Lincoln; military cooking.  It took us four hours to go through both floors and that gave short shrift even then to some exhibits.  I need to return.  The $13 adult winter admission is well worth the money (60+ $12, 6+ $11). Winter hours: Mon-Sat 10-5, Sun 12-5.  Even if conversant with the vagaries of the war, you will find something new here in the most comprehensive museum on it that I’ve visited.",
  "Awesome place for a wedding. Such a unique place to hold your special day. So many photographic opportunities throughout the venue. Ample parking, great location"
 ]
},{
 "name": "Pennsylvania State Capitol",
 "address": "Third Street ird Street d Street Street reet et",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/89/1f/38/dome-over-rotunda.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "free",
  "walk",
  "knowledgeable",
  "art",
  "learn",
  "history",
  "art",
  "tour",
  "free",
  "tour",
  "walk",
  "free",
  "walking",
  "art",
  "historic",
  "free",
  "tour",
  "tour",
  "history",
  "tour",
  "free",
  "tour",
  "free",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d123130-Reviews-Pennsylvania_State_Capitol-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful building with hostorical background that is worth learning more about...  Take a guided tour, they can share a lot of details regarding the building, renovations, and history of what has transpired as the building has been the center of leadership for this commonwealth",
  "Do you like history? Architecture? Art? Photography? The Pennsylvania State Capitol is the perfect place for you. Take a free tour and learn about this most incredible building that President Theodore Roosevelt claimed, \"The handsomest building I ever saw.\" on October 4, 1906 when the current state Capitol was dedicated. The interior of the building is simply incredible. Every which way you look, there is something more beautiful to see. The gorgeous staircase, the Moravian tiles that cover the first floor under the Great Rotunda and the adjacent corridors. Probably the largest piece of folk art in North America, the floor has 400 tile mosaics illustrating the state's many industries, wildlife, history, occupations and modes of transportation. Truly amazing to see. Make sure to take a free tour which will show you the Senate, the Supreme Court, the House of Representatives, and the great dome of the Rotunda. Artwork literally everywhere, in every corner and on every wall. Mosaics, gorgeous chandeliers in each chamber and throughout. If you enjoy art history, you can spend all day here. Stained glass as well will greet you in each chamber. Make sure to take particular note of The Apotheosis of Pennsylvania, the largest mural in the Capitol, located behind the Speaker's podium in the House Chamber. Very much worth the visit, make sure to confirm with your guide that pictures are ok. You'll past through security upon entering the building from 3rd Street. When the tour is over, make sure to ask your guide how to get to the Governor's Office to take a look around. And yes, you can get there by yourself. Take one of the elevators to the second floor. The Governor's secretary is there and she welcomed us in to take a look around and even welcomed us to take pictures as well. Very friendly and welcoming. This was a wonderful experience and both my son and I enjoyed ourselves very much exploring all of the wonders of the Capitol. Our guide Patty was also fantastic. Extremely knowledgeable and willing to answer questions and provide additional information. Once you register, you will get a confirmation e-mail as well. After the tour, I received a survey about our experience. When you are done inside the building, take a walk outside around the complex, including by the Veterans' Memorial Fountain.  If the weather is nice, prepare for some amazing photo opportunities.  This is most certainly a worthy visit when in Pennsylvania's capital city.",
  "Visited the Pennsylvania State Capitol building as part of a museum tour group.  This is a must for fans of early 20th century American art.  I was totally blown away.  Some important art works to note include the Moravian tile floors on the first floor and the Violet Oakley murals in the Governor's Reception Room, Supreme Court Chamber, and the House of Representatives Chamber.  If you are unfamiliar with the work of Violet Oakley you will be amazed.  Even though I knew something about her I came away deeply impressed and wondering why she isn't more well known.  The Moravian tile floors have a strong PA connection have been produced in Doylestown PA.  They are excellent examples of the Arts and Craft movement.  This experience is definitely worth a special trip.",
  "When you visit the Harrisburg area, make the time to visit the Capitol Building. It's free. The rotunda with cascading marble staircase is absolutely amazing! Check out details as tours are given of the building. They don't build them like this anymore! I have traveled all 50 states and this is the most beautiful Capitol outside of the Nation's Capitol in Washington, D.C. Entrance in the front is stairs only. For easier accessibility and ramps use the rear entrance on Commonwealth Avenue.",
  "Free tours of this lovely building offer views of our government's inner workings and also gorgeous design and artwork.  Just the rotunda has beautiful murals and sculptures and is worth a look if you can't make a tour.  A security check is required to get in, so leave your pocket knives at home or in the car.  Oh, and you will pay to park, unless you are willing to walk a ways.  I have been to numerous state capitols and this is one of the nicest (Alaska's is one on the opposite end ;-)  ).",
  "The building is impressive both inside and out, from the dome modeled after the dome of St. Peter's Cathedral at the Vatican in Rome to the statue of Lady Commonwealth that tops the dome, to the mosaic frescoes throughout on the floors  and original paintings and murals in nearly every room. One caution: wear comfortable walking shoes. Slim heels for women can be trouble on the somewhat uneven tile surfaces!",
  "This is second PA Capitol as the first one was destroyed. This one took 4 years to build and is much the other brand building from the gilded age. 23 carat gold covers a lot and the mosaic tiles that make up the floor are true art. The senate and house chambers are beautiful and make sure to see the Governor’s Reception room for a pictorial story of William Penn. The inside and outside are simply beautiful and truly a historic landmark and priceless work of art. The stained glass, French marble, chandeliers, and art work are worth the free tour for sure. Make sure to visit the welcome center for some interactive fun for the kiddos. ",
  "My husband and I took a guided tour of The Pennsylvania State Capital. We were shocked and pleasantly surprised how beautiful it was. The Capital tour guide was wonderful as she explained the Capital’s history. The Capital is more beautiful then our United States Capital.\nThat is quite a statement because our United States Capital is beautiful. However the workmanship and the design of the PA. Capital is breath taking. The designers spent many years working on finishing it. The materials are like no other state building in the United States. The tour is senior friendly. Definitely a must see for everyone of all ages.",
  "I have been to many state capitals and this is obviously the most beautiful I've seen. Roosevelt officially opened the building in the early 1900-s and the workmanship is not seen in any of today's buildings. The tour is free and on weekends had limited hours. We took the last one of the day and felt the tour guide wanted the tour to be over sooner rather than later. She offered just the basic information and did not ask for questions at every stop. However, the tour was still worth it and highly recommend it.",
  "If you are in Harrisburg, PA don,t miss to visit this capitol state building, very beautiful inside and they provide a free house tour aswell",
  "It's such a beautiful building and going there and learning about history was wonderful!!! The architecture and the stained glass are magnificent and the tour was very impressive. They offered much information. The tour guide was very knowledgable.\n"
 ]
},{
 "name": "Fort Hunter Mansion and Park",
 "address": "5300 N Front St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/27/e7/3e/fort-hunter-mansion-and.jpg",
 "tags": [
  "tour",
  "historic",
  "tour",
  "knowledgeable",
  "family",
  "free",
  "music",
  "food",
  "free",
  "music",
  "food",
  "free",
  "music",
  "food",
  "performance",
  "history",
  "tour",
  "historic",
  "tour",
  "family",
  "walking",
  "tour",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d3249738-Reviews-Fort_Hunter_Mansion_and_Park-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "A very pleasant historical house in a lovely setting - right on the Susquehanna River with views across the Rockville Bridge, the longest stone masonry arch railroad bridge in the world.\n\nIt's the staff that really elevate Fort Hunter above similar historic properties, however. Our guide, Steve, met us at the door, got us our tickets and took us around the house himself (it was a quiet afternoon so it was just us on our tour). He was incredibly friendly, welcoming and engaging and had a great sense of humour. \n\nAs nice as the house, furniture and other items inside were, Steve's level of enthusiasm and friendliness really went above and beyond to create a thoroughly enjoyable and memorable visit.",
  "Really enjoy the home and House tour was given by Susan.  Very knowledgeable and enjoyable to ask questions concerning the period of living at Fort Hunter.  ",
  "We are lucky enough to live about five minutes from Fort Hunter and we have visited the park in every season. We have had family portraits taken there (the covered bridge is a popular site for photos) and when our daughter and her friends attended their senior prom, we drove to the mansion to take pictures on the front porch (gorgeous!) and along the riverfront. We enjoyed taking our children to the Maple Festival every winter when they were little (sadly, they have outgrown that) and our son's play group met at the playground many, many times. His scout troop also held their annual picnic at the park. You really can't go wrong with Fort Hunter. It's a wonderful place to visit.",
  "The 2019 Maple Sugar Festival took place on Sunday, March 3rd between 12:00-4:00 pm. While parking is available on both sides of N. Front Street, the recommendation is to park on the side where the barn, stable, and tavern are located. This event is FREE. The bathrooms are modern and clean. The event is well-staffed with friendly volunteers who are eager to share the area with you. This event is kid-friendly. Food is available and the proceeds financially assist the park. A vendor sold maple products in the tavern. Roaring fires were going.There is a mixture of indoor and outdoor activities with hands-on a tivities for people of all ages. The mansion is open seasonally. The visitor may view the Susquehanna River and the nearby bridge. Located minutes from the PA Turnpike and Interstates 81 and 78, Fort Hunter Park is easily accessible. Watch for upcoming events including the egg hunt, garden faire, and music & wine festival. What’s not to like? This is a hidden gem.",
  "The 2019 Maple Sugar Festival took place on Sunday, March 3rd between 12:00-4:00 pm. While parking is available on both sides of N. Front Street, the recommendation is to park on the side where the barn, stable, and tavern are located. This event is FREE. The bathrooms are modern and clean. The event is well-staffed with friendly volunteers who are eager to share the area with you. This event is kid-friendly. Food is available and the proceeds financially assist the park. A vendor sold maple products in the tavern. Roaring fires were going.There is a mixture of indoor and outdoor activities with hands-on a tivities for people of all ages. The mansion is open seasonally. The visitor may view the Susquehanna River and the nearby bridge. Located minutes from the PA Turnpike and Interstates 81 and 78, Fort Hunter Park is easily accessible. Watch for upcoming events including the egg hunt, garden faire, and music & wine festival. What’s not to like? This is a hidden gem.",
  "The 2019 Maple Sugar Festival took place on Sunday, March 3rd between 12:00-4:00 pm. While parking is available on both sides of N. Front Street, the recommendation is to park on the side where the barn, stable, and tavern are located. This event is FREE. The bathrooms are modern and clean. The event is well-staffed with friendly volunteers who are eager to share the area with you. This event is kid-friendly. Food is available and the proceeds financially assist the park. A vendor sold maple products in the tavern. Roaring fires were going.There is a mixture of indoor and outdoor activities with hands-on a tivities for people of all ages. The mansion is open seasonally. The visitor may view the Susquehanna River and the nearby bridge. Located minutes from the PA Turnpike and Interstates 81 and 78, Fort Hunter Park is easily accessible. Watch for upcoming events including the egg hunt, garden faire, and music & wine festival. What’s not to like? This is a hidden gem.",
  "We stopped in for the May Day Festival. Lots of interesting dispkays as well as living history. Performance of the Maypole Dance by a local medieval organization was a great bonus!\n\nWatch for upcoming events throughout the year to plan your visit!",
  "A very pleasant historical house in a lovely setting - right on the Susquehanna River with views across the Rockville Bridge, the longest stone masonry arch railroad bridge in the world.\n\nIt's the staff that really elevate Fort Hunter above similar historic properties, however. Our guide, Steve, met us at the door, got us our tickets and took us around the house himself (it was a quiet afternoon so it was just us on our tour). He was incredibly friendly, welcoming and engaging and had a great sense of humour. \n\nAs nice as the house, furniture and other items inside were, Steve's level of enthusiasm and friendliness really went above and beyond to create a thoroughly enjoyable and memorable visit.",
  "Three generations of our family (teens to 80's) and a couple other folks took the mansion tour with Steve today. He tailored the tour to our interests and brought the story of the three families who lived there - and the people who worked there - to life. The artifacts and decor are beautiful and instructive. Really well done, worth the small fee. \n\nThe one weakness of the mansion is its lack of indoor waiting area and bathroom facilities. There are facilities, but they're cold. And if you don't arrive when a guide is ready, you have to wait outside. It worked out great for us, but others might not be so lucky. Maybe Black Friday is especially tricky this way?\n\nIf your clothes and/or the weather work together, walking around the grounds would be both beautiful and educational. I love the riverside location with views of the surrounding hills.",
  "My wife and I enjoyed this tour very much. Lot's of authentic items in the home and well explained by our guide, Paul. The home is beautiful without being over the top. Always interesting to learn about families who were well to do but also good to the community they lived in.",
  "Pretty stretch along the Susquehanna River. We enjoyed watching the trains cross the looooong stone arch bridge. House is interesting from the outside (we didn't go in). Would have given this a higher rating, but it is a narrow stretch with cars whizzing close by, and it was busy with folks even on a late October evening - a little too much humanity for our taste in a park."
 ]
},{
 "name": "Wildwood Park",
 "address": "100 Wildwood Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/83/89/3c/trail.jpg",
 "tags": [
  "kids",
  "nature",
  "knowledgeable",
  "kids",
  "nature",
  "nature",
  "free",
  "nature",
  "walk",
  "free",
  "nature",
  "walk",
  "free",
  "walk",
  "walk",
  "nature",
  "walking",
  "nature",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d270634-Reviews-Wildwood_Park-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went to the recent Wetlands festival, must have been many hundreds of people.  Lots of activities and knowledgeable naturalists.  Fun for all, and no cost!  Kids had a great time communing with nature, and getting away from their electronics for a few hours.  May spark some real interest in the outdoors.",
  "We took 4 kids (8 and 12 year olds) and 2 dogs. There was a main trail that was paved and several boardwalk style paths. We found more of a nature trail. It was muddy but lots of fun!",
  "Wildwood Park really is a hidden gem of a find in Harrisburg, PA with so many gorgeous waterfront trails where lots of Snowy White Egrets and Blue Herons can be spotted as well as turtles basking in the sun on logs, bunnies in the grassy fields and a ground hog or two near the bird feeders behind the Nature Center! There's lots of easy flat trails to enjoy along the water's edge for those who might want to get out in nature but not be challenged to severely. Perfect park for all ages to enjoy! For those who want a good hilly workout, Wildwood offers the 2.1 mile Wildwood Way Trail that is mostly paved but has very steep hills through nicely wooded terrain! My Hubby and I enjoy this park in every season with the ever changing scenery and beauty! There's plenty of picnic tables and pavilions for comfy picnicking! Be sure to stop by the very well done Nature Center with lots of gift items and nature displays; perfect for homeschoolers!",
  "Conveniently located off I-81 near HACC and the PA Far, Show Complex, Wlidwood Lake offers the chance to take a great walk and see some fascinating flora and fauna.\nThe loop around the lake is probably about 3 miles. It is mostly flat, although there are a few moderate grades. Since there are benches and other resting spots along the walkway, it is possible to take it very easy. You should see many species of birds, especially during migratory seasons. The nature center has some pretty standard exhibits. The real attraction is the area itself. Parking is convenient and the paths are open to bike riders, too. This is a wonderful resource...and it is FREE!",
  "Conveniently located off I-81 near HACC and the PA Far, Show Complex, Wlidwood Lake offers the chance to take a great walk and see some fascinating flora and fauna.\nThe loop around the lake is probably about 3 miles. It is mostly flat, although there are a few moderate grades. Since there are benches and other resting spots along the walkway, it is possible to take it very easy. You should see many species of birds, especially during migratory seasons. The nature center has some pretty standard exhibits. The real attraction is the area itself. Parking is convenient and the paths are open to bike riders, too. This is a wonderful resource...and it is FREE!",
  "So, you want to see some pretty scenery while exercising? This is a great place for this and it's free! Folks walk, run, ride their bikes, walk their dogs, take pictures...I believe one \"lap\" is about 3 miles. There is one big hill, so you can definitely work up a sweat. I am perhaps a bit more cautious than most, so I would not go alone, especially when it appears there is no one else at the park. There is a restroom if you need one and plenty of parking.",
  "This is a great place to walk and enjoy the pond and wooded areas.  There are some hills on the backside so you can gets some good cardio.  It is part paved and part gravel.  Strollers wouldn’t be a problem.  There is a decent amount of parking at the entrance and also up by the visitors building.  There is a restroom at the entrance.",
  "Wildwood park has the best nature experience as well as relaxation for the mind. You’ll see birds turtles and even might see a snake!",
  "For me, I love coming here to photograph birds. There are so many different types. On top of that, there are other animal species. \n\nThe trails are also nice for walking.",
  "Beautiful and relaxing park, where you can walk or just sit under a tree to readand enjoiy nature.......",
  "A fine place for a walk along a well maintained trail, with nice views of the lake,\nthe birds, and other wildlife."
 ]
},{
 "name": "State Museum of Pennsylvania",
 "address": "300 North St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/6a/27/98/caption.jpg",
 "tags": [
  "history",
  "history",
  "free",
  "family",
  "learn",
  "field",
  "history",
  "kids",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d123131-Reviews-State_Museum_of_Pennsylvania-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Excellent museum in downtown Harrisburg: staff were great and you get to cover both the history/wars affecting Pennsylvania, the natural history of the area from the time of the dinosaurs, up to modern day economic and cultural contributions of the State.  Very well presented, with different topics on each floor.  Well stocked gift shop for mementos of your visit.",
  "Pretty much everything you'd want in a state museum. Starts with geology (ancient times), moves into dinosaurs (pre-historic times), then native Americans cultures, and finishes with Colonial through modern history. Even covering so many different areas, it felt coherent. Exhibits were well done. Only suggestion is that it's hard to keep track & see everything, as the layout is a bit complicated: it would be nice to have arrows on the floor to follow for visitors who want to systematically see the whole place. Other than the planetarium, we walked through the whole place, & found many items which piqued our interest.",
  "I appreciate the wide variety of exhibits.   Any visitor should find something to interest them and to stimulate them to learn more about the topics.  My family especially enjoyed the mammal hall.  I found the Restoring of Mammal Hall exhibit to be very informative and have a greater appreciation for how the Mammal Hall has been curated.  If I lived closer I would visit regularly to see the changing exhibits and to bring out of town friends to visit.  The museum offers free admission with a military ID.  I'm pleased that they recognize our service men and women in this way.  It's a museum that Pennsylvania should be proud of.",
  "Love going here because it reminds me of being young and going on field trips (in the 90s). It's super nostalgic because nothing has changed and they could really do with a makeover. ",
  "This museum has been here for many years but still offers an excellent overview of all things Pennsylvania. Spread out over three floors in a circular pattern, it’s easy to navigate with exhibits spaced out in a comfortable manner. Overall the museum is very clean, nicely maintained, friendly/helpful staff with the exhibits professionally done. Our favorite was the Pennsylvania Turnpike exhibit. \n\nAdmission is reasonable ($6 senior) plus $3 additional for the Planetarium show. Disappointed in the constellations planetarium show as it was too complex/detailed for most attendees. Kids next to us were talking amongst themselves the entire show as they had zoned out the first 5 minutes. Recommendation:  keep it simple. Like others, I thought the museum was lacking in Revolutionary period history when you think how pivotal Pennsylvania was in our nation’s founding. The vending area cafe wasn’t adequate - items missing in machines, lack of adequate choices and no Coke products.  If driving, recommend the South Street parking garage - only 3 blocks away. Very nice museum and a great way to spend 3+ hours while educating yourself on all things Pennsylvania. \n\n",
  "I very nice informative place, I wish I allotted more time to take in more, very friendly staff, and wonderful exhibits ",
  "My wife another added another state history museum to our ever greater list.  We appreciate the states having these museums as it helps understand its history, culture, and geography.  Pennsylvania's did just that.  My only surprise was the lack of any Revolutionary War presentations.  With the state's position with the founding of our country, I thought there would be more.  But three floors of displays, it took most of the afternoon to get through the museum.  Worth the stop, keep up the great work.",
  "Excellent museum in downtown Harrisburg: staff were great and you get to cover both the history/wars affecting Pennsylvania, the natural history of the area from the time of the dinosaurs, up to modern day economic and cultural contributions of the State.  Very well presented, with different topics on each floor.  Well stocked gift shop for mementos of your visit."
 ]
},{
 "name": "City Island",
 "address": "10 N 2nd St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5d/53/5b/city-island.jpg",
 "tags": [
  "free",
  "walk",
  "family",
  "field",
  "food",
  "free",
  "eat",
  "walking",
  "walk",
  "art",
  "nature",
  "free",
  "eat",
  "walk",
  "art",
  "pets",
  "kids",
  "unique",
  "walking",
  "walk",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d138193-Reviews-City_Island-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have come to Harrisburg for over 20 years to visit family in Harrisburg. We absolutely love City Island. It is a must do when visiting the city. \n\nThe main feature is the home field of the AA baseball team Harrisburg Senators. This is a beautiful ball field. City Island also has professional soccer, too. \n\nYou can walk the entire island, have a picnic, play in an old fashioned arcade, enjoy a fabulous ride on the famous riverboat Pride of the Susquehanna, ride a mini train and our favorite is to play mini golf at the course called Water Golf. This course is on the far side of City Island and you can drive there, but be sure to follow signs as it is one way around the island. Drive slowly as there are many walkers enjoying the Island. \n\nWater Golf is a spectacular course and beautifully landscaped. It is right on the river with beautiful views. Get a hole in one on the last hole and you will receive a voucher for a free game in your next visit. Holes are fun and challenging with a few Par 4 holes as well. Par for this course is 49. Enjoy ice cream and great food in the snack bar at Water Golf, too. \n\nTake time to walk over the foot bridge and take in the views of the beautiful Susquehanna River. \n\nMake City Island a stop on your visit to beautiful Harrisburg, PA.  ",
  "City Island really is a \"must experience\" place when in the Harrisburg area! SO MUCH to do on and see on this island and close by! You could easily make a day of it with all the things to do from catching a Senator's baseball game with beautiful fireworks after the game at night, a gorgeous waterfront mini golf course, take a train ride around the island (perfect for children!), batting cages, a very nice merry-go-round, kayak rentals for touring the many island nearby (perfect for nature lovers and bird watchers!) I would highly recommend taking a ride on The Pride of the Susquehanna, which is a very pretty paddle boat that offers dinner cruises, hour boat rides and free Sunday worship services aboard the boat during summer months! There's several concession stands for bites to eat or you can pack a picnic and enjoy their very nice waterfront pavilion! If you have your own boat or jet ski, bring it along! Water entry is available and very popular! You'll makes lots of new friends while relaxing on your boat! There's 3 riverfront restaurants nearby that you can dock your boat right there too and grab a bite to eat! Also, you'll definitely want to walk over their very nice 1/2 mile pedestrian bridge leading you to downtown Harrisburg! On the Harrisburg side of the bridge is a LONG riverfront bike/walking path, perfect for viewing the gorgeous sunsets over the water, checking out the many flower gardens, artistic statues and creations! Restaurant Row is on 2nd street, offering TONS of dining options too! There's often art shows, musical festivals or other special events going on, on the island or on the river front, right over the pedestrian bridge during summer months! If you decide to stay for the night and enjoy the island the next day there's plenty of very nice inns and hotels super close in walking distance as well! Once you experience City Island once, you'll be sure to add it to your \"must visit' locations on a regular basis! Perfect for EVERY budget!",
  "City Island has lots to do: catch a Senators baseball game, ride the Pride of the Susquehanna Riverboat, mini-golf, batting cages, a walk or run, pets welcome, enjoy the peace and quiet of the river, eat from the vendors. Kids can run, it is wheelchair accessible, everyone can sit and relax. And it's free admission. :-). Can walk from Harrisburg (across the old iron bridge) or drive easily. Sometimes there are special events such as 5K's and art festivals.",
  "The city tries to make this location something more than it is.  The walking bridge, from the island to the city, is unique.  The walking bridge from the island to Wormleysburg, has been washed out for years.  The paddle boat is docked here and is a unique experience however, has limits as the river is shallow and the boat is very small.  At the end of the day this is simply the location of the baseball stadium and its parking lot.  ",
  "I love all of this, I invite all of you to come to see it this beautiful place and all entertainment ",
  "City island is an easy walk from downtown over a bridge.  The island is in the middle of the Susquehanna river.  The Senators, Harrisburg's AA Baseball team, have an excellent stadium in the middle of the island and although we were there after baseball season, our son confirmed the games are excellent in the summer months.  The island also hosts other events, although not during our visit in November.  Definitely check the calendar.  Also saw lots of paddle boats and party boats docked for the winter, which can be rented in the summer.",
  "Nice ride on boat  Good food at snack bar. Need more direction signs for parking and to boat office..",
  "We took kids on our mission trip to City Island for a \"night out.\"  It is a fun place to go.  we treated them to ice cream and putt-putt golf.  There was a lot of life on the island as there were volleyball games going on as well.  I recommend visiting it.   "
 ]
},{
 "name": "Pennsylvania Farm Show Complex and Expo Center",
 "address": "2300 N Cameron St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/44/3a/e8/only-the-section-where.jpg",
 "tags": [
  "free",
  "walking",
  "food",
  "free",
  "food",
  "walking",
  "kids",
  "family",
  "walking",
  "food",
  "food",
  "walk",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d3738194-Reviews-Pennsylvania_Farm_Show_Complex_and_Expo_Center-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place is HUGE!!  must wear some comfy walking shoes. Farm show was amazing and great for all ages. You can literally spend the ENTIRE day here and not be board. Food wise, they have many many many options for all tastes/preferences. Try to avoid the food court by lunch hour - it can be JAMMED. Parking can be crazy. Dont bother parking at the actual center. You will end up waiting 15-20 minutes to get in, and then they will turn you around if you dont have a handicap sign. Also, avoid parking at the lots 1-2 miles away and taking the free shuttle. Why? you will end up waiting an hour or more to get on one of those shuttles. BEST TO PARK at the college ACROSS the street from the expo, and walking distance. Parking will run you $15-20 depending on the lot.",
  "This was the first time my husband & I every went to the farm show it was very enjoyable they had good food and many things to do lots of animals a whole lot of things for kids to do. If you go make sure you have on a pair of walking shoes because there is a lot of walking. They do have buses to and from parking lot also there are  buses for people in wheelchairs. Because it's in January it is cold so dress warmly. I'm ready to go again. You've got to try the chocolate covered bacon Yum Yum & the milkshakes!!! Free admissions pay for parking",
  "We are lucky enough to live five minutes from the Farm Show Complex and we attend the PA Farm Show every year (weather permitting). While the cost of parking is rather annoying, we have been lucky enough to get a parking spot in the lot pretty much every year. We highly recommend doing so and not riding the buses - having to wait in line is a royal pain, especially when it's really cold and rainy and/or snowy. We also recommend using the coat check if you aren't able to park close enough to leave your coats in your car. It's well worth the cost to not have to lug your coats around with you. Also, bring and use backpacks for each member of your family. You will want them to carry home all of the stuff you buy - especially the fantastic potato donuts - you will want a dozen (or more) to take home to enjoy :) The building is huge and you will probably get lost, so if you have to the chance to get a map, definitely get one. Also (and most importantly) go early in the day or (if you can't go early) try to go no later than around 4 p.m. if you want to get a parking spot in the lot and still have time to do everything you want to do. I highly recommend getting food first - and hit the milkshake line right away - it will be the longest. After you have eaten, go enjoy seeing whatever animals/displays your heart desires. Wait until you are ready to leave to pick up anything you really want to take with you so you aren't stuck carrying it around for hours. You will do A LOT of walking and you will be exhausted, so the lighter your load, the better. We always stop back in the food section to pick up potato donuts (and sometimes second milkshakes) on our way out the door. Can you tell that the food is the most important part of the Farm Show to us? ",
  "Be prepared to walk and most likely get lost. Farm show is in January and runs for a few weeks each year. We get lost every time. Parking was across the street and they shuttle you over. Tons of fair like food options. You can see a baby cow be born! Worth spending the day.",
  "Very nice facility.  Attended the world horse expo.. the buildings are large and interconnected.  We arrived early and had great parking.  Others were not as prompt and parked a good distance away!",
  "I have attended the Great Ameriacn Outdoor Show at this venue for several years and have to say that they do a great job hosting the show.  The facility is clean, there are plenty of places within the facility to get food, and the layout is spacious enough that walkinf the isles is not a problem.",
  "Visited the farmshow complex 2/6 for the outdoor show. Lots of outfitters to book hunting/fishing trips. Smith and Wesson, Henry, Rossi, Remington, Mossberg all had displays. Food was good. Nice way to get out of the cold and move around.",
  "I came to Harrisburg PA for the Great American Outdoor Show which was held here. The buildings are huge and endless. Plenty of parking for vendors."
 ]
},{
 "name": "Riverfront Park",
 "address": "Front Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/45/08/59/sunset-on-the-susquehanna.jpg",
 "tags": [
  "walk",
  "free",
  "walking",
  "art",
  "music",
  "nature",
  "free",
  "walking",
  "art",
  "music",
  "nature",
  "walk",
  "walk",
  "historic",
  "historic",
  "walking",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d5888217-Reviews-Riverfront_Park-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "I walk in this park just about every work day.  I love it because the river always looks a little different, so it is never the same walk.  I usually go the same route, but there are plenty of diversions all along the path, which goes several miles.  A great idea for weekend afternoons is lunch at Passage to India at the southern end and a walk through Shipoke to look at all the colorful houses.  ",
  "Riverfront Park has a very nice paved path along the Susquehanna River, perfect for romantic walks hand in hand with your Honey, especially during sunset times.....absolutely gorgeous! The path is VERY popular for dog walking, bike riding, strolls with children and picnicing! There is something wonderful to be enjoyed by everyone and its absolutely FREE! You'll definitely want to see the lovely flower gardens along the river and the latest art sculptures and displays...there's lots of them!! Again super fun! There's even a fitness area for structured exercises with equipment provided! This path is totally wheelchair friendly too!! So everyone really can enjoy this gorgeous riverfront path/park! You'll also find picnic tables and comfy benches for dining and resting a spell. Nature lovers will absolutely love all the Blue Herons and Snowy White Egrets! The river views are breathe taking, lots of islands and natural vegetation to see.....shade is no problem for those who need it. Many majestic trees line much of the trail! Summer months are a ton of fun with really nice art and music festivals! You'll just love them! Lots of good food/beverages are available with plenty of waterfront seating!",
  "Riverfront Park has a very nice paved path along the Susquehanna River, perfect for romantic walks hand in hand with your Honey, especially during sunset times.....absolutely gorgeous! The path is VERY popular for dog walking, bike riding, strolls with children and picnicing! There is something wonderful to be enjoyed by everyone and its absolutely FREE! You'll definitely want to see the lovely flower gardens along the river and the latest art sculptures and displays...there's lots of them!! Again super fun! There's even a fitness area for structured exercises with equipment provided! This path is totally wheelchair friendly too!! So everyone really can enjoy this gorgeous riverfront path/park! You'll also find picnic tables and comfy benches for dining and resting a spell. Nature lovers will absolutely love all the Blue Herons and Snowy White Egrets! The river views are breathe taking, lots of islands and natural vegetation to see.....shade is no problem for those who need it. Many majestic trees line much of the trail! Summer months are a ton of fun with really nice art and music festivals! You'll just love them! Lots of good food/beverages are available with plenty of waterfront seating!",
  "Awsome place to walk/excercise, and relaxing, you can walk to city Island............You can also ride a bike or rollerblade...",
  "Had a wonderful time.  A nice walkway to walk along the river.  The grounds are well kept.  If you go take your lawn chairs, blanket and your cooler with snacks.",
  "They're making the best of the space between the town and the river, but it honestly isn't really a park - think more of an urban 'trail'. It benefits from the pleasant aesthetic of the river and some historic homes along the street, with plenty of signs to let you know what you're looking at. However, I'd say this space is best suited for runs and bike rides. They've definitely invested in it as a physical recreation space, with workout stations along the path. It's pleasant and flat and definitely an ideal place to go on a run if you're visiting Harrisburg.",
  "Hello!  We traveled east and stayed at a beautiful Airbnb on the historic North street in Harrisburg.  Just a short walking distance from the riverfront, we couldn't have been happier. We attended the fireworks here and enjoyed all the yummy food and wines.  We met some nice couples and enjoyed a beautiful fireworks display.  Will definitely return to this quaint capital city!  Loved our stay!",
  "When an event takes place along the Riverfront, an option for parking is located at City Island. We were charged $5.00 to park here on the 4th of July. Walk across the open-grated bridge to access the event. There is a lot of historical architecture along this route. Many plaques help to orient you to the name and significance of the selected buildings."
 ]
},{
 "name": "Broad Street Market",
 "address": "Third and Verbeke Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/66/1f/95/photo1jpg.jpg",
 "tags": [
  "food",
  "eat",
  "kids",
  "walk",
  "food",
  "delicious",
  "food",
  "food",
  "delicious",
  "art",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d270715-Reviews-Broad_Street_Market-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Broad Street Market has enjoyed a resurgence in the last year; it's now a hopping, fun sort of open-air INSIDE market in two buildings. If you like noisy, bustling places to eat and watch folks go by, this is the place. Lots of fresh meat, veggies, fruits, Amish food products and take-out food, some home-made ravioli, spices, candies, limited seafood, Korean, soul good, fried chicken, etc. NOT really much arts-and-crafts. Its exciting for kids, but not handicapped-friendly because of the crowds and narrow aisles. I rated it good, but not great, because of limited seating and high noise level in parts of it. Restrooms are easy to find and OK. Parking close up is limited, but find a curb space, use a debit card and Smartphone to feed the meters and WALK off the food calories!!!",
  "Stopped by here and was pleasantly surprised! The one building doesn't have much because I think it's being remodeled but the other building is awesome! There are tons of venders that are selling all kinds of food. It all looks delicious! This market is more urban and has a lot of locals so if that kind of things scares you then don't come, but it you don't mind then definitely stop on by!",
  "This is a good quick stop for food if you can find a parking space. There's just about something for everyone. Korean, Mexican, pierogis, donuts, seafood, a little hipster beer bar, etc. \n\nBeware it gets crowded for the lunch rush as you would expect. ",
  "We went to lunch at the Millworks (see separate review) and I noticed the Market - my first time in Harrisburg.  There are two buildings: the first one had a range of lunch counters, with interesting food, from Caribbean, to BBQ, etc. But the second building was like opening Pandora's box: what a superb range of vendors: quality meat and fish sourced locally, various bakeries, cheese counters, chocolate, jams/honeys, you name it: it is ALL here and looked wonderful.  We bought amazing pork chops, baked goods and cookies - all delicious.  HIGHLY RECOMMEND buying local and fresh from Broad Street Market.",
  "We come every Saturday. I always get a seasonal latte at Elementary Coffee. Sometimes I’ll get a crepe from Bon Appetite, a fish taco from El Compadre or ramen from Yami’s. All good, excellent portions. They really have turned this place around! Only opened Thursday to Saturday. ",
  "This is a great place to go for produce or lunch. One part of the market is all food stalls featuring fresh food from all over the world. It is very close to the Susquehanna Art Museum and across the street from the great bookstore, Midtown Scholar. Highly recommend.",
  "I love markets and was delighted to see that Harrisburg has such a fine market. We stopped in for breakfast and had several options to choose from. We had a breakfast roll/made with pretzel dough as well as some donuts from one of the other stalls. We loved the pickles that we bought.  Would love to return sometime for lunch.",
  "Two buildings house farmers market and restaurants/food stands. Both are diverse and boast fresh offerings. Love the feel of an urban market. Nice fall day found folks eating in nice bricked area between buildings, folk singer strumming and singing, Brew Pub across the street with a smoker going, great bookstore nearby. Great vibe!"
 ]
},{
 "name": "Pride of the Susquehanna",
 "address": "City Island",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/04/a2/56/the-pride-of-the-susquehanna.jpg",
 "tags": [
  "free",
  "food",
  "tour",
  "music",
  "history",
  "food",
  "tour",
  "music",
  "nature",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d1486727-Reviews-Pride_of_the_Susquehanna-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Traveled with my husband.  Totally loved this riverboat. Snacks and beverages are available on board or you can pack a light lunch.  There is space to sit inside and outside.  Bring along a light jacket since it can be cooler on the water.\n",
  "Like traveling on the water? Well, you just might like the idea of jumping aboard the Susquehanna river boat. There are daily tours in the summer, and the ride is very relaxing. You can see a great view of the city as you travel slowing up the river. There are also reservations you can make, if you're hosting special festivities of any kind. ",
  "Traveled with my husband.  Totally loved this riverboat. Snacks and beverages are available on board or you can pack a light lunch.  There is space to sit inside and outside.  Bring along a light jacket since it can be cooler on the water.\n",
  "My husband and I have now taken two murder mystery dinner cruises on the boat. What an enjoyable time of food and entertainment! The boat is cozy, comfortable and clean. Staff is helpful, pleasant and friendly. The cast is delightful, enegetic and funny. Both times we also had interesting conversations with fellow \"travelers!\" Unfortuantely, we were unable to leave the dock due to high winds. However, we were given complimentary tickets to take a free 45 minute boat ride at a later time. We will happily visit again!",
  "On a beautiful Saturday morning, we took the boat tour as a way to get an overview of Harrisburg.  The boat is a beautiful restoration of an early riverboat with elaborate furnishings.  While the theme fro that day was music on the river, we enjoyed more talking about the history of the river and area.  The boat even had a modern head on board.",
  "These entertainers were once in Baltimore and I am so glad we found them again.  This affair is non-profit.   The show (as always) was entertaining, the ferry is stunning and in beautiful shape, I had the chicken dinner and my husband the crab cake both were excellent.   We went Memorial Day and traffic was a nightmare with some streets closed.  I strongly suggest that you take the phone number & cell phone.   We called and were guided around the maze to closer parking for handicapped.  There is a little food stand right across from the dock where the food was also good (we arrived early and had a crab bowl to enjoy what watching for the ferry to arrive.  The ferry dining/show room is small and cramped. However, After the show there is time to go above deck, stretch  and enjoy the ride and sunset.",
  "We were already on City Island for a festival when we decided the diversion of a ride on the river sounded nice. They had sailings leaving on the hour that day, so we were able to catch a tour easily.\n\nThe boat itself has seen better days but did not feel unsafe. We rode on the top deck, which had very limited seating. There seemed to be a bar on the main floor; we didn't explore there.\n\nThe ride was enjoyable, as time on the water often is. There was a pre-recorded informational spiel that played during the first half of the tour; it was difficult to hear it over the talking of other guests. It was primarily historical in nature; there was no pointing out of landmarks or interesting sights.\n\nWe were lucky enough to have a Groupon to use that day - $13 for the two of us. I would have been unhappy had we paid the full price for a ho-hum tour on a beat-up little boat.\n\nThe Pride also hosts dinner cruises, music cruises, and more. Keep your expectations low, get a deal on the price, and just enjoy being on the water for a while.",
  "My family and I just love riding the Pride! Its a very peaceful and exciting 45 minutes on the Susquehanna!"
 ]
},{
 "name": "Whitaker Center",
 "address": "222 Market St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/7f/10/fb/whitaker-center.jpg",
 "tags": [
  "kids",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d1972143-Reviews-Whitaker_Center-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's all indoor so it is great for cold weather or rain.  There were SO MANY things to see and do, and they were all suited to kids of all ages.  Even my 3 year old engaged in 90% of the exhibits.  My 9 month old even had a little place to play.  We were grateful our hotel staff directed us here.  My husband and I had as much fun as the kids!",
  "It is a kid-friendly place to spent time on the weekends.  It teaches you and keeps you entertained.",
  "our son (18 months) loves it here. be prepared w/ a change of clothes as the water table is his main source of delight here! ",
  "We took our niece to the Science Museum about 3 years ago and she loved it.  Took her again over the holiday.  It'll be our last visit, unless we're absolutely desperate to entertain a child.  They reduced the exhibits and the amount of space.  Several exhibits were not functioning. This facility has definitely seen better days. ",
  "We took three young girls to the Center and they had a great time. They especially liked sock skating.  There was a variety of activities and hands on experience.  They had fun with the various weather experiences.  We had a great day.",
  "Recommend using the Parking Garage @ 258 Walnut St, Harrisburg, PA 17101. ($6 pr hr) Hilton is off Elevators at level A, also shared by Whitaker Center, dropping you in at the Mezzanine level of concert venue (access to steps/elevator inside Whitaker, for Orchestra level seating) \n(Whitaker Center for Science and the Arts address, although it's attached to the garage: is\n222 Market St, Harrisburg, PA)",
  "Short and sweet. Good show terrible time after show. Two parking kiosks for the mass of people leaving show. We were all packed together! $15 to $30 for parking!\n\nOne elevator working. Again, mass of the crowd pushing to get on. We got smooshed when we got on. 18 people on one small elevator. We were like sardines. Could not move. Elevator got stuck. Took an hour to get us out. My wife has health problems. Difficult to stand that long. Many others having high anxiety. Fire personnel helped us out since we were between floors.\n\nOnce off had to get to car on 9th floor. No help from parking personnel to get me up to that level. Had to walk the steep steps. 70 year-old out of breathe and heart hurt. Finally made it.\n\nNever again to Whittaker Center. Civil action warranted. ",
  "Saw a concert with my daughter here and it’s a great, intimate venue.  Sound system was fabulous, looked like not a bad seat in the house!  I wasn’t happy with the parking situation, parked at a garage and ended up being a $30 stay for a few hours at a concert.  That part sucked.  Also a lot of homeless in the area of the garage so didn’t feel like the safest place to be.  \nOverall the Whitaker center(what we saw of it) was very nice.  I will return hopefully and see the science center with the kids, in the daylight hours"
 ]
},{
 "name": "FNB Field",
 "address": "1 Championship Way City Island",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/0d/4f/ce/views-from-the-third.jpg",
 "tags": [
  "family",
  "kids",
  "food",
  "family",
  "field",
  "family",
  "kids",
  "family",
  "food",
  "food",
  "family",
  "kids",
  "field",
  "family",
  "field",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d1857518-Reviews-FNB_Field-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don’t miss out on seeing professional baseball in a stadium where no seat is bad! The AA affiliate of the Washington Nats means that they often rehab here! Add on great fireworks, giveaways, close parking with no traffic, and inexpensive ticket prices. They even have jumping inflatables for the younger kids. Don’t miss a great family fun event!",
  "It may not be the major leagues, but sometimes there is an advantage to that.  It’s good baseball to watch in a nice environment and the small stadium lets you get close to the action.  Parking is relatively easy and you can get out in a reasonable amount of time.  There is always something going on between innings; the staff work hard to keep you entertained.  Sure, food and drinks can be pricey...but I’ve yet to go to a stadium where I’m pleasantly surprised at the quality and value of the items on the menu.  My one minor complaint is the “discounted” tickets you can order online.  The inclusion of a\nConvenience Fee, yes they call it that, removes a good chunk of the discount.  Other than that I think it’s one of the better ways to spend a summer evening in the Harrisburg area.",
  "This ballpark has been beautifully renovated - located on City Island, which lies in the midst of the Susquehanna River, Metro Bank Park (now First National Bank Park) is the home of the Harrisburg Senators. Great place to spend a casual evening with friends and family. Just be cognizant of the Mayflies, which are ever present in the early summer months. ",
  "FNB Field is the home of the Harrisburg Senators (AA Affiliate of the Washington Nationals).  Great family entertainment with a budget.  Lots of between innings entertainment to keep the kids interested.  Great concessions and micro brews.",
  "I used to live in the area - long before there was a team - but always want to take in a game here when I come back to visit family. Great sight lines from all seats, good food (and local beer!) selections and just a very nice feel to the park. On top of that, it's located on n island with a walking/biking bridge from Harrisburg. Park like setting in the middle of the Susquehanna River.",
  "We always enjoy going to a Senator's game.  Seats are comfortable with backs!  No bench seating.  Food is good and the drinks are too!  Take the entire family.  The have  an elevator to get you to the level you are on as well.  Great for the kids with games that they can play on the ground floor near 3rd base.",
  "The FNB field is a minor league baseball of the Washington Senators.   Tickets $14 and entertainment was great.  A four year old boy sang the National Anthem.  If you go early the parking is close and a nice park around it that you can enjoy ice cream and other foods while waiting for gate to open.   Great family fun. ",
  "Have been at FNB Field a number of times in the past few years. It's a beautiful minor league park and lots of activities, great scenery and food."
 ]
},{
 "name": "Appalachian Brewing Company",
 "address": "50 N Cameron St 50 North Cameron Street, 17101, Harrisburg, Pennsylvania",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/17/34/eb/appalachian-brewing-company.jpg",
 "tags": [
  "food",
  "delicious",
  "food",
  "free",
  "food",
  "brewery",
  "food",
  "brewery",
  "food",
  "food",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d270635-Reviews-Appalachian_Brewing_Company-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Brewing Company is a worthwhile stop for casual dining that features a good selection of beer and food options and a friendly staff in the interesting atmosphere of a refurbished factory.  They get busy so call ahead to put your name on the waiting list; doing so saved my group at least a 45-minute wait.\n\nI also visited the Abbey Bar (located upstairs from the Brewing Company) to see a concert after dinner.  There are a couple of problems if one sees a show here that is at all crowded: there are iron support pillars throughout the general admission standing area which lead to lots of obstructed views (and increase the danger of a concussion if the crowd starts moshing).  Additionally, because the stage is not centered between the two side walls, the crowd gets pushed up against the wall that abuts the stage.  Again, not an issue if the audience is small or docile, but with a packed house of dancing fans, it leads to an unpleasant experience for many in the crowd.",
  "All of the beers are delicious here!\nI suggest getting the taster where you can sample 8 5oz beers, then you can order a pint of your favourite. I ordered the Mile High meat loaf and it wasn't bad. Nothing spectacular but not terrible either. I regret not getting the chicken though. The wait was very long. It looked like they were heavily under staffed because there were 16 empty tables and a lot of people waiting at the door. The bar was full so there was no chance of waiting there. The wait was about 40 minutes long, so if you visit you should make a reservation.",
  "The Brewing Company is a worthwhile stop for casual dining that features a good selection of beer and food options and a friendly staff in the interesting atmosphere of a refurbished factory.  They get busy so call ahead to put your name on the waiting list; doing so saved my group at least a 45-minute wait.\n\nI also visited the Abbey Bar (located upstairs from the Brewing Company) to see a concert after dinner.  There are a couple of problems if one sees a show here that is at all crowded: there are iron support pillars throughout the general admission standing area which lead to lots of obstructed views (and increase the danger of a concussion if the crowd starts moshing).  Additionally, because the stage is not centered between the two side walls, the crowd gets pushed up against the wall that abuts the stage.  Again, not an issue if the audience is small or docile, but with a packed house of dancing fans, it leads to an unpleasant experience for many in the crowd.",
  "Brewery just on the outskirts of downtown Harrisburg with decent beer and very good food. There is a parking lot directly behind the brewery with plenty of free parking. Based on all the security and video surveillance signs, I figure the area may be a little suspect, however we had no issues. From the outside the building don’t look like much, however the inside is very attractive, great atmosphere. My wife and I arrived for lunch around 12:00 and were promptly seated, as it was not super busy. Within about 30 minutes customers were coming in and the place got very busy. We shared the house made chips as an appetizer, followed by the grilled romaine salad and the beef on wek sandwich with fries. All the food was very good as was the service. The beers a decent and enjoyable, we would definitely return some day.",
  "They have a great staff, a wide selection of good food, and offer it in a nice atmosphere.  Do not be shy - if there is a line, you can sit at the bar!",
  "Impressive menu. Great beer. Cool old building that was transformed into a brewery. That's it. That's the review!",
  "This is like our 10th visit to this restaurant when we go to Hershey Park for Christmas.  The food & beer are good, but the menu does not change.  I think I've ordered Rockfish tacos the past 4 out of 5 visits.  Maybe an update is due?",
  "The beer was delicious, and so was the food. We sat in the bar area, and the bartender/waitress could not have been any nicer!!  Even gave my husband a half a glass of another beer while he waited for her to go change the tap on the beer he requested a refill on.  That was very nice and greatly appreciated (I mean, he was parched😀)\n\nWill definitely return the next time we are in the area."
 ]
},{
 "name": "Pennsylvania National Fire Museum",
 "address": "1820 N 4th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a9/7e/37/station-10.jpg",
 "tags": [
  "unique",
  "kids",
  "tour",
  "history",
  "history",
  "kids",
  "tour",
  "history",
  "theatre",
  "tour",
  "family",
  "history",
  "knowledgeable",
  "learn",
  "unique",
  "kids",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d270714-Reviews-Pennsylvania_National_Fire_Museum-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have no particular affiliation with fire fighting & have been to MANY museums throughout the US & Europe; hence, we had no particular reason to love this place and a tendency to be pretty critical of most museums. However, we loved everything about this one. A huge collection of all things related to firefighting, thoughtfully arranged, beautifully displayed, with excellent descriptions. Kids from 2 to 102 will love this place. We planned to spend an hour, stayed for 3 hours, & could have stayed longer. The volunteer staff members are so enthusiastic. Be sure to get a demo of the call system upstairs (sounds boring, but is unique). The museum is almost totally supported by visitors, so be as generous as you comfortably can.",
  "We visited here with an organization that we belong to. The staff talked to us about the museum and its history and the history of the Harrisburg Fire Dept. If you went by yourself it is a self guided tour with plenty of signage and videos. They have staff on duty who will answer any questions. Some of the old motor trucks they will use in local parades. They also have horse drawn trucks. Very interesting even if you have no background in firefighting. the length of the tour depends on how long you want to spend.There are 2 floors with a nice elevator to take you up/down. They also have a flight of stairs",
  "This museum is a great place to visit when in Harrisburg, PA.  Great displays, interesting articles and items from around the area. Kids would enjoy the displays, store, and history of the Fire Service.",
  "We visited here with an organization that we belong to. The staff talked to us about the museum and its history and the history of the Harrisburg Fire Dept. If you went by yourself it is a self guided tour with plenty of signage and videos. They have staff on duty who will answer any questions. Some of the old motor trucks they will use in local parades. They also have horse drawn trucks. Very interesting even if you have no background in firefighting. the length of the tour depends on how long you want to spend.There are 2 floors with a nice elevator to take you up/down. They also have a flight of stairs",
  "This is a great event.  We have attended two years in a row now.  Lots of great demonstrations and seminars.  Tons of vendors with really good prices on everyday horse items and lots of vendors sell unqiue items.  The Theatre Eques show is absolutely wonderful...don't miss it!",
  "Everyone on our five family, three generation trip found lots of things to appreciate.  We ranged in age from nearly 3 to nearly 67 and there was plenty to grab our different perspectives and interests and be appreciated from our different respective elevations!  \n\nThe volunteer docents are knowledgeable and articulate.  Our guide, a third generation firefighter, was able to connect well with all in our group pointing out items of interest to all of us.  A good storyteller, he wove his personal history appropriately and reinforcingly into his narrative about the displayed items.  \n\nOperated in a beautifully restored fire house, the everyday life of a century-ago firefighter is on full display.  An “audio diorama” gets the docent-directed tour just inside the main doors off with a galloping start.\n\nThe sharp clang of an alarm bell starts the minutes long and sometimes raucous narrative of horses being quickly harnessed for a mad dash down Fourth Street to a years-ago extinguished pseudo-blaze.  The museum mannequins - human and equestrian - with expressions of excitement, anticipation and urgency draw visitors further into the action. Only one thing is missing – the olfactory impacts of the horses, steam-pumps and hopefully simulated horse exhaust lying on the stall floor.\n\nThe rest of the tour is less boisterous, but no less interesting!  \n\nWith regularly changing display photos from local fire companies and an extensive compliment of surplus items that can be cycled into various areas of the museum, there will always be new things to see.  \n\nThe quality of the equipment and apparatus on display, the attention to accuracy and detail and the pride of participation shown by the 100%  fire service connected volunteers on staff make this experience worth the trip.  This museum reflects well on the thousands of volunteer firefighters who serve across the Commonwealth of Pennsylvania and the Country. Whether in station or on scene, these people have my respect.",
  "Enjoyed learning about how they handled fires years ago and the different things that were used. Very informative and so much to learn! I just started on a learning journey and am enjoying every moment!!!!",
  "We have no particular affiliation with fire fighting & have been to MANY museums throughout the US & Europe; hence, we had no particular reason to love this place and a tendency to be pretty critical of most museums. However, we loved everything about this one. A huge collection of all things related to firefighting, thoughtfully arranged, beautifully displayed, with excellent descriptions. Kids from 2 to 102 will love this place. We planned to spend an hour, stayed for 3 hours, & could have stayed longer. The volunteer staff members are so enthusiastic. Be sure to get a demo of the call system upstairs (sounds boring, but is unique). The museum is almost totally supported by visitors, so be as generous as you comfortably can.",
  "It was a rainy day and I was looking for something to do and I came across this wonderful old building. The volunteers staffing it did a terrific job welcoming me and explaining their exhibits. ",
  "The PA National Fire Museum is one of our favorite Harrisburg places.  Beginning with an exciting life-size reenactment of a real fire call with the sounds of men yelling, bells, horses and running, it's truly fun.  Loads of artifacts and information, and hand-on opportunities to try out and watch how calls were routed from neighborhood fire boxes through the phone system to the correct station; interesting videos, fire trucks for kids to play with; oh, and you get a personal guide, and it's never ever crowded.  Great to do with kids!",
  "If your in Harrisburg take a couple hours stop at the Broad St Market and just down the road is this hidden gem\n Very informative with lots to see and interact with. You won't be disappointed and you might even get a free poster."
 ]
},{
 "name": "Spring Gate Vineyard",
 "address": "5790 Devonshire Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/71/f5/94/spring-gate-farms-and.jpg",
 "tags": [
  "winery",
  "music",
  "food",
  "food",
  "tasting",
  "drink",
  "brewery",
  "tasting",
  "kids",
  "eat",
  "tasting",
  "music",
  "winery",
  "food",
  "music",
  "food",
  "winery",
  "tasting",
  "winery",
  "music",
  "food",
  "winery",
  "food",
  "tasting",
  "food",
  "brewery",
  "winery",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d6555008-Reviews-Spring_Gate_Vineyard-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great winery and attraction to visit, plenty of wines & craft beers. In door and out door veneus and music, food trucks. Fire pits, cozy atmosphere and good time",
  "Looking for something to do on our last day in PA and my boyfriend stumbled across this place. We saw they had wine slushies so we were sold. Headed there, and saw it had plenty of parking, lots of space, different food truck options, and a tasting area. There was a live band playing in the general area where there's seating and shade. We had the wine slushies, the tropical mango is amazing. Got some steak and cheese from one of the food trucks and got some mini donuts from another food truck to go. They had plenty of wine to purchase and plenty of seating to enjoy whatever you get to drink on site. The live band wasn't too loud or anything, everything was pleasant and perfect. I wish this place was closer to home. Definitely worth checking out.",
  "Upon arriving at Spring gate Vineyard I was not overly impressed by the parking area. We entered the Vineyard tasting room and immediately my opinion changed to a much more positive view . We found out shortly there after they had a brewery in the rear of the building. The brewery has an enclosed area for the cooler months with a huge patio with picnic tables outside. Beside the picnic tables is a huge area of open seating in grassy areas with large trees, lots of seats and a fenced in area that looks to be an old riding arena. We were told this place holds 2000 to 3000 people and it looks like it would be a lot of fun on a warm sunny day. Kids are welcome here so note that. The only downfall to the brewery I found was the flights are pre-selected and some of the beers are not included on a flight and you cannot get them in sample sizes. Overall I highly recommend this place.",
  "This is a very beautiful venue with the barn converted into the winery and the pastoral views (including sheep). A tasting is a reasonable $5 to taste 6-7 varieties. For an additional $5 you can buy a souvenir wine glass. \n\nThe staff are friendly and the wines good quality. Good enough that I would make repeat visits here to stock up on several bottles of my favorites. I love that they have a patio with tables and chairs for sitting and enjoying the afternoon. We were there on a Sunday afternoon and they had live music as well. \n\nThe only reason they lost one star: they do not allow outside food nor do they offer food for purchase on Sunday other than the chocolate truffles. If you have a venue where you expect people to stay for several hours sipping wine, either provide little plates (cheese, crackers, meats, etc.) or allow them to bring a picnic basket. We brought cheese and crackers based on the recommendation of one of our group who had been there previously but the rules must have changed since she was last there. Nowhere is it posted on site \"no outside foods\" although looking on the website after our visit I did see where it states they offer ala carte catered food Thursday, Friday, and Saturday. You may however bring a birthday cake and snacks if you have small children or babies.\n\nOverall, it was a pleasant experience and I would definitely go back... but eat your Sunday dinner elsewhere before you go!",
  "We have been to this venue a few times but this time we were joined by our 3 year old great grandson. They had toys and games to occupy him while we enjoyed the wine, beer, and music at this laid back winery/brewery. Plenty of comfortable seating including Adirondack chairs and tables, high tables and benches. Included are ice buckets, trucks for purchase of food, and even blankets you can borrow for colder weather. Love this place for a quick get away.",
  "We have visited here twice and both times we absolutely loved the winery because it is so pretty.  It's a renovated barn and they did a fantastic job with it, we visited during a wine festival for Valentine's day so it was really crowded and they didn't have as many wines on selection as the normally do.  But we still got 2 bottles to take with us and enjoyed the day there as a whole.  The tasting isn't expensive but the wines are on the more pricey sides as a heads up.  Even with all that still one of my favorites in the area.",
  "Great winery and attraction to visit, plenty of wines & craft beers. In door and out door veneus and music, food trucks. Fire pits, cozy atmosphere and good time",
  "This winery is beautiful! And the prices are very fair IMO despite the reviews- the tasting is only $9 and they still give you a wine glass to take home! The wine was great and so was the staff. They have an outdoor covered seating area with little fire pits that kept the place very toasty. The food trucks were great but did give small portions- but that’s pretty much what you sign up for with eating at a food truck. My only complaint is that they don’t ship to NJ- guess I’ll have to go back! ",
  "A guy playing guitar, hubby, me and food and drinks.  Had a wonderful time.  Food truck only so be aware of that, but it was a fun time!",
  "This is a very nice winery and brewery.  There is ample seating inside and outdoors which is great for a fall day.  There are occasions when food trucks are there as well. There are also wine slushies and wine cream! I would recommend this place!",
  "Not handicapped friendly. When we got Spring Gate Vineyard, parking attendants were directing traffic into parking lots that were not near the vineyard, even though there were several empty parking spaces in the two parking lots closest to the vineyard. Our driver has a noticeable physical disability with hand controls on the vehicle, and we were told to park in the farther lot because we didn’t have our handicap placard. We explained we didn’t have the placard because we were in a rental vehicle. He suggested we drop the driver off there and then park the vehicle in the farther lot, even though no one else could drive the vehicle because no one else knew how to drive with hand controls and because no one else was on the rental contract. We offered to get out of the car and display the physical disability, and his response was “I’m not a doctor. Next time, I recommend you bring the handicap placard.” I recommend that Spring Gate Vineyard require their  employees go through some type of diversity and inclusion training and show a little more sensitivity and understanding to those with disabilities."
 ]
},{
 "name": "Downtown Harrisburg",
 "address": "",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7e/4b/46/downtown-harrisburg.jpg",
 "tags": [
  "art",
  "affordable",
  "eat",
  "walking",
  "kids",
  "walk",
  "historic",
  "walk",
  "affordable",
  "walk",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d3167844-Reviews-Downtown_Harrisburg-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "OK, let's be honest: This is not a tourist destination city, but the local are generally so polite, helpful and kind that navigating spaces here is low stress. Don't confuse that with gregarious, outgoing or lively. It's not that folks are unfriendly, they are just not as socially outgoing as many other buzzy tourist spots. But steer clear if you are looking for a high-energy, hopping urban area. This ain't it. But 9 out of 10 folks will go out of their way to help you, guide you or try to please you. If you can slow down and meet them at their own pace, you will enjoy your stay. Aggressive drivers, rigid service folks and impatient service staff are rare here. Now, the tricky part: Points of interest are spread out. Check out City Island, the Riverfront Park along the Susquehanna, the streets around Strawberry Square and the Capitol Complex grounds. The Whitaker Center and its Imax Theater are fun. Passage to India is beautiful and affordable and Cafe 1500 is a great Saturday or Sunday brunch spot If you like books, hang at Midtown Scholar Bookstore and then check out Broad Street market across the street. Midtown Cinema is a great art house movie theater without the artsy attitude. And remember: If you ever need help, guidance or directions, most of the locals will be glad to help. A 36-hour stay should be enough time, but any longer than 48 hours is pushing it. ",
  "Front Street, Second and Third Street offer a lot to see, specially good.  The Capitol is beautiful and the Susquehanna River is impressive.   If you have a car or rental, you can venture to Hershey close by.",
  "The city is located along the Susquehanna River and has a great walking path along the river. The downtown area is easy to access and has great places to eat and fun things to explore. Kids will like the dinosaurs that are currently on display throughout the city that were part of a fund raising campaign. The Whitaker Center is a great place for kids and families.  The capitol building is beautiful and is right downtown. The State Museum is right next door and is fun to see. ",
  "Harrisburg Is the state capital city that struggles with being mid sized.  There are a number of restaurants on second street which offer outdoor seating (summer).  Problem is homeless / low income city dwellers constantly walk by and pan handle. Same thing occurred with a walk along the river front.  Perhaps my experience was not typical. However, it was my experience on more than one occasion.  City island struggles to be something other than a ball park with parking...that is all it is.  ",
  "Downtown is compact and very walkable.  Great museum (PA State Museum), impressive City Hall and historic buildings close by.  Plenty of restaurants and coffee shops along your walk.  Shopping has largely left the downtown City Hall area, unfortunately, with a partically vacant mall that didnt seem used given most stores are now outside the central core.  easy walk to the Susquehanna river and City island with its baseball, concerts and events in the warmer months.  We still enjoyed a walk downtown on a crisp November day.",
  "First it is a lot of great restaurants at there, affordable housing, a lot of work (job), good neighborhoods, great supermarket, a huge hospital, a lot of great school, Walmart, Home Depot, ALDI, Macy’s, great  pharmacy, great law enforcement, fire fire awesome, Like 4 or more huge mall with a lot of entertainment and good price. Many diversities, Awesome Church, downtown are awesome  Beautiful view at there. Driving everything is close, and more and more great place to live. ",
  "Downtown Harrisburg has a lot of restaurants to partake in and the River walk. You can walk across the pedestrian bridge at Market and Front street and go over to City Island. There's quite a few things to do during the day.\n\nIn the evenings on the weekends it's usually a hot spot for the bar scene. A lot of the restaurants moonlight as bars/clubs. Over the years the dancing aspect of it has seemed to have died down. As a female i also would not go downtown at night alone. Do not venture too far past second street.",
  "Parking at City Park Island costs $5.00 per vehicle. Bring tip-money if you plan to use the Port-a-potties along the street. While there were more than 40 food trucks, there weren’t any paleo food trucks like they have in Portland, OR, so I did not eat anything. We encountered some street people who  acknowledge you at one of the main entry points. Bring your own chair if you want to watch the live bands. Much of the architecture along the Riverfront could use some renovation. Also, let’s power-wash the areas around the State Capitol Building."
 ]
},{
 "name": "Cathedral of Saint Patrick",
 "address": "212 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/f5/05/f6/cathedral-of-saint-patrick.jpg",
 "tags": [
  "art",
  "history",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d3807292-Reviews-Cathedral_of_Saint_Patrick-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Magnificent old cathedral which has recently been renovated. It is large,  with beautiful stained glass windows. Masses are Saturday evening at 5:30 and Sunday at 7:30. 9:30 (interpreted for the deaf) and 12:30 PM.",
  "We attended mass here on Saturday night.  The cathedral is stunningly beautiful!  Even if you are not catholic you should stop in when the cathedral is open just to take a peak.  The stained glass windows are gorgeous, especially with the sunlight shining through.",
  "I have walked past this church hundreds of times but finally visited last week for Ash Wednesday Mass. I'm sorry it took me so long to go inside!\n\nThis is the kind of gorgeous architecture and interior that isn't built in churches anymore. From the dome to the stained glass windows, the entire building is a work of art. The church's website is also a great resource. They have a self guided tour posted there to give visitors more background information. \n\nIf you are visiting the Capitol up the street, definitely add a visit to St. Patrick's to your itinerary. You will get a double dose of beauty and history that will leave you awestruck!",
  "Every time I enter this cathedral, the word \"splendid!\" comes to mind over and over again.  It's a remarkably beautiful church, inside and out.",
  "Last visited this church 20 years ago. I live 125 miles away and made a visit while in town. The cathedral is well kept and the stain glass windows are beautiful.   ",
  "This place is beautiful- my husband and I spent about 45 minutes before noon service on a Friday just sitting and looking around- everywhere you look there is something magnificent.  The only downer of this visit was when we were leaving it was pouring down rain and it was only about 40 degrees and a woman who worked at the church was kicking out a homeless man and threatened to call the cops.  This really bothered me as the man was just looking to get out of the rain and it didn't seem like a very \"Christian\" think to do to threaten the cops.  Now I admittedly don't know the issues the church may have with homeless people but it didn't sit well with me.  Other than that visiting this architectural wonder of a church was the highlight of my trip!",
  "I love visiting Cathedrals on trips and this one was on my list.  It was easy to find and I was able to park on the street close by with paid parking.  I believe they have a lot but wasn't sure where it was.  I stopped in around noon on a weekday and was surprised to find they were having a mass service.  So I quietly went in and sat in the back to take in the beautiful surroundings.  It is well worth a stop in but if you want to walk around you best check to see when masses are as you can't walk around with them in progress.  I was still glad to be able to see if though.",
  "Always look for catherdarals or church's when travelling. Some are really nice while others are simple\nThis place was not overly large but very beautiful in side for sure. Really glad we took a look"
 ]
},{
 "name": "Strites Orchard",
 "address": "1000 Strites Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/15/d2/1e/strites-orchard.jpg",
 "tags": [
  "active",
  "delicious",
  "delicious",
  "knowledgeable",
  "family",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d8505726-Reviews-Strites_Orchard-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "We know Strites primarily as a Community Share provider, and have been customers for multiple years now.  Good variety of vegetables, and the big plus is the addition of fruit to the weekly 'boxes' of produce.  They even throw in some cider and applesauce along the way.  A visit to the premises if you can go is bonus.  They have also been active in farm to table type activities and so are worthy of support.",
  "Always have great picks of fruits and vegetables in the little shop. Some things can be kind of pricey, but definitely a good value! They also sell some baked goods within the shop... and have little recipes available if you're looking for something to make with the fruits and vegetables you've picked up! The honey is good, too! I love watching the bees.\n\nMy favorite part though is picking my own fruit. Last time it was $12 for a half bushel, which isn't too bad depending on the fruit. We got peaches and the selection was WONDERFUL... but the ground does get covered in fruit people have decided they \"no longer want.\" Which is pretty wasteful. I've seen people just dump their fruit on the ground. \n\nI'm hoping to go apple picking this fall, as well as peach picking again! Definitely delicious and well worth it, in my opinion.",
  "Always have great picks of fruits and vegetables in the little shop. Some things can be kind of pricey, but definitely a good value! They also sell some baked goods within the shop... and have little recipes available if you're looking for something to make with the fruits and vegetables you've picked up! The honey is good, too! I love watching the bees.\n\nMy favorite part though is picking my own fruit. Last time it was $12 for a half bushel, which isn't too bad depending on the fruit. We got peaches and the selection was WONDERFUL... but the ground does get covered in fruit people have decided they \"no longer want.\" Which is pretty wasteful. I've seen people just dump their fruit on the ground. \n\nI'm hoping to go apple picking this fall, as well as peach picking again! Definitely delicious and well worth it, in my opinion.",
  "I went to buy nine half bushels of apples for member gifts at the gym.  As we were loading them into my vehicle, one of the guys noticed that there were a few apples in one bag that didn't look too good, so he sent his helper back in for replacements.  I expected him to come out with six or eight apples, but he brought another entire half bushel!  \nTheir produce is excellent and they are very knowledgeable about the products.  I'm also a member of their Consumer Supported Agriculture (CSA) program and would highly recommend that as well!",
  "My friend and I visited on June 29. Purchased lists of fresh, ripe fruits and veggies; the apricots are always a favorite. I was excited to try their peach Melba pie. The first two pieces were yummy but by July 3 (only 3 days after purchase) it was moldy. \n\nWhen I called today to inquire if a pie’s lifespan is 3 days, the orchard rep I spoke with said it was unusual but it could have sat out for 1-3 days before I purchased. She offered no compensation, so my $13.19 and the pie, was put in the trash.",
  "Strike's Orchard is a nice family owned orchard. Everything sold there is grown on the farm. The staff is very friendly and knowledgeable. I believe they are in the 3rd generation of owners. ",
  "Do you want to pick your own or purchase fresh from the farm already on display? The choice is yours at Strites and their service is friendly and helpful. A pleasant experience whatever the reason you're there!",
  "We love Strites Orchard store, and visit often.  It's a local gem.  They grow excellent fruits and vegetables, make baked goods, apple cider, even hand dipped ice cream  They also have gift baskets and potted plants, hanging baskets etc.  Christmas trees in the winter too.  You can pick your own strawberries etc.  Go there!"
 ]
},{
 "name": "The Forum Auditorium",
 "address": "500 Walnut Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/7e/45/ca/picture-of-the-ceiling.jpg",
 "tags": [
  "art",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d8012185-Reviews-The_Forum_Auditorium-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "The acoustics can be challenging at times  but the building itself is about as perfect an art deco example as you could want to see, so find out if you can get in and be prepared to be amazed.\n",
  "We have been there many times for concerts and to see the Harrisburg Symphony. Acoustics are great. Parking can sometimes be a problem if you don't get there early  ",
  "This is a beautiful building offering great shows, but the line to use the tiny restroom facilities is a problem for anyone suffering an \"urgency.\" Like every place in Harrisburg, parking is a problem, even evenings and weekends.",
  "Last weekend in April included a season-ending extravaganza performance: The Harrisburg Symphony's season-ending Pops Concert.  Calling it THE BEST concert we've seen hardly does it justice.  The headliner, David Bennett, is an extraordinary musician. He plays a mean clarinet like Benny Goodman, his guitar \"sang\" along with his Elvis impersonation.  But, his Jerry Lee Lewis piano was out of this world - and had everyone in the audience on their feet!!  He followed up with a \"duet\" drum exhibition.  He and his drummer played a segment of \"When The Saint's Come Marching In\" that just astounded. The finale encore was a beautiful rendition on clarinet: \"Witchita Lineman\". Of course, all of this was backed up by the extraordinary Harrisburg Symphony lead by Maestro Stuart Malina, who could ANY orchestra in the country. We have never been disappointed by any of the Pops Concerts at The Forum, and we've seen many, over many, many years.  This was one for the ages. I would highly recommend subscribing to the Harrisburg Symphony's Pop Concert Series at The Forum for next season--you will be glad you did!",
  "I went to see Temple Grandin a well respected autism author & presenter she was giving a lecture at the Harrisburg Forum auditorium it was the first time I have ever been in the building.  It was a big auditorium a good place for a concert or lecture.  I loved the ceiling of the auditorium with the stars in their constellations.  I would recommend it as a place to see a concert of some kind",
  "Great facility across the street from the state capital building.  Home of the Harrisburg Symphony; it has great acoustics.  The ceiling is an ornate dome of celestial signs and something to see.  A great venue with nearby garage parking.",
  "We have been there many times for concerts and to see the Harrisburg Symphony. Acoustics are great. Parking can sometimes be a problem if you don't get there early  ",
  "I went all last year and am looking forward to this year for my season Pops concerts.  The forum is beautiful and the sound quality is wonderful no matter were you sit.  My only complaint is a lack of leg room if you are tall or long legged like me.  "
 ]
},{
 "name": "Susquehanna Art Museum",
 "address": "1401 N 3rd St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/89/13/e7/the-museum-mural.jpg",
 "tags": [
  "art",
  "art",
  "free",
  "art",
  "creative",
  "art",
  "walk",
  "art",
  "free",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d7976200-Reviews-Susquehanna_Art_Museum-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Someone does need to tell Garvin Nuvi that the museum moved from Market Street to North 3rd quite some time ago... And that new locale is simply marvelous. And old bank, complete with vault, has been transformed into a series of spaces and classrooms. The  design is of the highest quality and when one walks in, the elegant rooms and open spaces would do any museum proud.\n\nActually it isn't really a museum as it is not a collecting institution. But it is clearly an organization with a worthy vision. The \"Van Go,\" a mobile art classroom and gallery was parked out back by the shiny new loading dock. The building next door has an enormous mural. An excellent Philip Pearlstein exhibition filled the large upstairs gallery. A small but simply GORGEOUS photo show, \"Relics,\" by Steven Althouse impressed me mightily. The vault is also used for small exhibitions, although at that moment it was empty, except for comfy chairs. Apparently works on paper are install with magnets to the steel walls. How cool is that?\n\nThere is a nice small gift shop full of shiny fun things, jewelry, books, doo-dads, the usual. And we actually found something we wanted to buy.\n\nDon't be put off by such descriptions as \"changing exhibitions by local artists.\" The Susquehanna Art Museum is so, so, so much more than that.",
  "Excellent museum!  The new facility in midtown Harrisburg is in an old bank building that was beautifully renovated with a new addition  (that includes a second floor gallery & educational spaces) attached to it. The staff and volunteers are helpful and informative.  The exhibits change periodically throughout the year and there is always something new to see.  Check their website for special events.  Free Off street parking in a parking lot behind the building.  Highly recommend a visit (or multiple visits) to this first rate art museum.",
  "The SAM is in an old bank building, and has a constantly rotating series of exhibits.  Most recently there was an amazing collection of African-American art that was moving, beautiful and disturbing, and sometimes all these!  The bank vault is an unusual venue for art, but the museum curators are very creative and I loved the magnet art that was brick- (or is it safe deposit box-) sized.  Also if you need a gift for an artsy friend, their small gift shop is worth a visit.  ",
  "The Susquehanna Art Museum is a wonderful place to visit. I go every time I visit my parents in Harrisburg. The exhibitions vary widely from paintings to photographs to sculpture by all kinds of fantastic artists. Don’t miss this beautiful art museum!",
  "I've been wanting to get to all the nearby museums that are in my reciprocal membership back home.  Since I was traveling to the Harrisburg area, I finally had the opportunity to add this one to my trip.  It was amazing!  The shows were absolutely wonderful--thought-provoking, artfully exhibited, and wonderful in themselves.  \nCheck the website for the hours and maybe to anticipate what you might see, but be assured that you can walk in anytime, and it will be great.\nThe museum is in an old bank building just north of downtown and a block from the market and Midtown Scholar book store.  There are remnants of the vaults that were in the bank, that add to the architecture and floor plans.  \nI loved all the exhibits/shows.  I will go again.  Do go.  This is an absolute bargain as museums to.  ",
  "This museum is in a beautiful repurposed bank building and is a quick stop for any art lover. The exhibits change throughout the year so no visit is quite the same. There's convenient parking in the back parking lot, making a short visit worthwhile. I'd definitely recommend this museum!",
  "SAM has rotating exhibitions throughout the year, check out their website for what's currently on view when you plan you visit. FREE parking lot directly behind the museum. Lots of discounted admission options, kids 12 and under free. Currently there's a Picasso exhibition on view through Sep 22, 2019. Check it out while you can!",
  "The museum - known locally as \"SAM\" - has converted a former bank to exhibit space: the vault on the 1st floor adds to the viewing experience. The 2nd floor is large and provides in-depth exhibitions. For museums of this size, what's on exhibit, IMO, is critically important -  it's likely there are not 4-5 shows but 2-3. During my visit, the 2nd floor featured Picasso prints - certainly top quality with excellent information at the prints."
 ]
},{
 "name": "Midstate Distillery",
 "address": "1817 N Cameron St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ac/fc/e2/tastings-tours-and-happy.jpg",
 "tags": [
  "knowledgeable",
  "tasting",
  "knowledgeable",
  "art",
  "drink",
  "food",
  "tasting",
  "knowledgeable",
  "free",
  "tasting",
  "delicious",
  "tasting",
  "knowledgeable",
  "art",
  "drink",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d10755983-Reviews-Midstate_Distillery-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Megan the bartender was very knowledgeable on all their products, she also made wonderful mixed drinks. Their fruit infused and vanilla flavored vodkas were tasty.  Shakey Jakes coffee liqueur is out of sight mixed with vanilla vodka over ice.  I am still a beer drinker but if you like distilled products this is up your alley.",
  "I visit friends in the area at least annually and this is a must stop spot for us. We’ve been numerous times and are never disappointed. Knowledgeable and friendly staff always make for a great time. We always stock up on bottles to take home or ask our friends to ship us the shakey jakes coffee liqueur when we inevitably run out. Every time we go there we end up talking about how much we wish someone would set something like this place up back home. The year round drinks are great and the seasonal creations are always worth it too. They have food trucks setup for when you need something a little more substantial than the snack cooler they offer. Cool art on the walls by local artists coupled with locally sourced ingredients in everything they do is such an impressive commitment to the community. I could not recommend this place more. Stop in for a tasting, a drink after work, or a night out with friends. You won’t regret it!",
  "We stopped over the holidays, bringing visiting guests. We had a great time, it's a industrial setting but it works. They offer a tasting sampler of their distilled spirits, which allows you to pick your favorite. I enjoyed the chocolate martini made with their Firehouse Vanilla Vodka. The Prohibition made with their white rum was a group favorite.",
  "Best Bloody  Mary's in Town on Sunday.\nI have sat at the same bar stool for 3 hours talking and eating.\nWonderful new people I have meet over the years there . They have a bar set up to  fix your own  bloody mary. \nWonderful prices as well !",
  "Megan the bartender was very knowledgeable on all their products, she also made wonderful mixed drinks. Their fruit infused and vanilla flavored vodkas were tasty.  Shakey Jakes coffee liqueur is out of sight mixed with vanilla vodka over ice.  I am still a beer drinker but if you like distilled products this is up your alley.",
  "They hosted an event for Nobody's Cats Foundation and while I mainly went to support the event - I was pleasantly surprised by the atmosphere and the selection.  Will probably return",
  "My girlfriend planned a surprise night out in Harrisburg for some friends and I and we began our night at Midstate Distillery. It was an awesome start! \n\nThe \"free tasting\" included several shots of good tasting liquors and even came with a delicious soft pretzel. We stayed for some beers after the tasting and all were local and tasted good.\n\nWe happened to visit on \"small business Saturday\" so everything (even our drinks) were 20% off. \n\nThe bartender Megan was absolutely enjoyable to be around and also helped us pick out 3 christmas gifts from their homemade liquor collections and gifts.\n\nOverall would suggest anyone who visits Harrisburg to make sure you stop by MidState Distillery and ask for Megan!!",
  "I visit friends in the area at least annually and this is a must stop spot for us. We’ve been numerous times and are never disappointed. Knowledgeable and friendly staff always make for a great time. We always stock up on bottles to take home or ask our friends to ship us the shakey jakes coffee liqueur when we inevitably run out. Every time we go there we end up talking about how much we wish someone would set something like this place up back home. The year round drinks are great and the seasonal creations are always worth it too. They have food trucks setup for when you need something a little more substantial than the snack cooler they offer. Cool art on the walls by local artists coupled with locally sourced ingredients in everything they do is such an impressive commitment to the community. I could not recommend this place more. Stop in for a tasting, a drink after work, or a night out with friends. You won’t regret it!"
 ]
},{
 "name": "Zeroday Brewing Co.",
 "address": "250 Reily St Suite 103",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/44/0c/a8/zeroday-brewing-co.jpg",
 "tags": [
  "brewery",
  "kids",
  "food",
  "brewery",
  "food",
  "brewery",
  "food",
  "brewery",
  "food",
  "brewery",
  "brewery",
  "delicious",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d7937388-Reviews-Zeroday_Brewing_Co-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "I went for a date night with my husband while we waited for our movie next door at Midtown Cinema.  \nZeroday is a small brewery.  Maybe 25 people were here on this evening.  We took the last seats. \nOn our night at Zeroday, there was a live band playing.  We enjoyed the set and ambiance.\nThe place is clean.  Bright.  Inviting.\nWe ordered pretzels, chips & hummus.  The serving size was huge and shareable.  I had two beers.  The salted sour beer and a jalapeno beer.  Both very good.\nMy husband had a chocolate sweet stout and another beer.  Both were very good according to him.\nWe would definitely return.",
  "I have been to quite a few breweries and this one is excellent. They were really busy due to an event with HACC they were doing but the staff was still friendly and considerate. We loved all their beers. Even being only two years old, their brew master seemed much more experienced. They were flavorful and well balanced. I would recommend this place to anyone in the area.",
  "We stopped in Zeroday with our two kids 12 and 7 and we all loved it!  The vibe is cool and upbeat.  The IPA was fabulous and the kids loved the \"fancy\" sodas and Big A** Pretzel (that is the actual name on the menu).  Staff was cool, helpful and fun.  Will definitely return!",
  "Stopped by on a Saturday for the first time.  Note that it is a bit difficult to find since the brewery is in the back of the building.  But, once you find the door, it's a good place to stop for a beer.  They have a good selection of their own brews to choose from, so enjoy your favorite kind.  There is some food available, but not a huge menu...still you won't go hungry.  The staff was friendly and the beer was very good.  Give it a chance, we think you'll like it.",
  "Stopped by on a Saturday for the first time.  Note that it is a bit difficult to find since the brewery is in the back of the building.  But, once you find the door, it's a good place to stop for a beer.  They have a good selection of their own brews to choose from, so enjoy your favorite kind.  There is some food available, but not a huge menu...still you won't go hungry.  The staff was friendly and the beer was very good.  Give it a chance, we think you'll like it.",
  "Stopped by on a Saturday for the first time.  Note that it is a bit difficult to find since the brewery is in the back of the building.  But, once you find the door, it's a good place to stop for a beer.  They have a good selection of their own brews to choose from, so enjoy your favorite kind.  There is some food available, but not a huge menu...still you won't go hungry.  The staff was friendly and the beer was very good.  Give it a chance, we think you'll like it.",
  "Zeroday is a small brewery with some very good beers and a small food menu. Located in an old building off Reily street, you enter the brewery from a side door located toward the rear of the building. There is a medium size parking lot off Reily street. There was about 10-12 beers on tap, with many styles, porters, stouts, IPA’s, red ales, etc. I enjoyed a flight of 6 beers and also purchased a Crowley. Try the NE IPA Galaxy God Buzz (very good).",
  "The only reason I can't give this place 5 stars is because the bartenders, are just not always there. They just aren't friendly or welcoming. Can't say they are rude, but they certainly aren't nice. \n\nWhen the pizza shop, Knead, is open located inside of the brewery, the Honey Badger pizza is delicious!!",
  "Been on multiple occasions, I always give a place a \"2nd chance\" if I had a bad experience..but of all the breweries in the area (and there are many) this is the worst, the beer quality here is very subpar.",
  "Stopped in for a beer. Cool place. Friendly people. Nice selection of beer but out of stout. Food served as well. Good vibe!",
  "This is the 2nd. time I've been here.And they didn't disappoint.I love their beer. The Mango Habinero is still my favorite.But their sour is great and I love the stout. The staff is really nice and it's a great place to hangout."
 ]
},{
 "name": "Harrisburg Symphony Orchestra",
 "address": "5th & Walnut at the Forum",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/32/dc/00/harrisburg-symphony-orchestra.jpg",
 "tags": [
  "walk",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d5462118-Reviews-Harrisburg_Symphony_Orchestra-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Harrisburg Symphony is a diamond in the rough.  Filled with incredible players from the area this orchestra is really fantastic.  The conductor( Stuart Malina) is beloved by the musicians and the community. Do your best to attend as many concerts as possible, you will not be disappointed.\n",
  "Great evening listening to the Harrisburg symphony perform South Pacific with a phenomenal cast of singers.  We were able to purchase tickets two days before the event for $35 each in a great section with great views.  The Forum is a great venue to enjoy an event and the symphony does not disappoint.  We parked at the lot across the street for $5 and had a short walk to enter.  Great way to spend the evening in Harrisburg!  Highly recommend the Forum and the symphony to all!",
  "There's no better way to experience the HSO than on July 4th at the outdoor bandshell in Reservoir Park in Harrisburg.  It's a great venue with views of the city and the musical program superb - a mixture of classics, Americana, Broadway tunes and more.  Stuart Malina, the conductor, does a fabulous job.",
  "My daughter and I have been doing a father-daughter date for the past ten years or so for the January, Saturday night show.  We ALWAYS enjoy the evening.  The Strauss Waltz was exquisite and the 11th symphony was especially powerful and incredibly done!!  We'll be back next January!",
  "I admit I am a classical music snob. I worked for the Cleveland Orchestra in its Glory Days. I love the Berlin Philharmonic and the Israel Philharmonic. So, Harrisburg? I was not prepared for what I heard. Awesome concert. And performing in the Forum, such an interesting building. So, I bow with humility. Snobbery be gone! Thank you, Harrisburg Symphony Orchestra. Thank you!"
 ]
},{
 "name": "Boyd Big Tree Preserve Conservation Area",
 "address": "Fishing Creek Valley Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/8b/c3/5c/boyd-big-tree-preserve.jpg",
 "tags": [
  "hike",
  "walk",
  "walk",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d7134536-Reviews-Boyd_Big_Tree_Preserve_Conservation_Area-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Just a few minutes north-east of Harrisburg.  Decent trail system where you can hike for a few minutes or a few hours. \n   Trails range from somewhat steep and a little rough & rocky to mild & well maintained.  Nice views of Fishing Creek Valley and the opposite ridge once you get up high on the mountain.  It's not particularly high, but can offer a pretty good workout.  Wear hiking boots as it can be a little rocky and muddy. \n   Beautiful anytime of year, especially spring and summer.",
  "Boyd's is a great place if you want to walk in the woods near to Harrisburg.  Laid out on the north side of a mountain, it has a number of trails that are well marked, with a variety of terrains-flat versus hilly.  It's dog-friendly, and if you make it to the top of the mountain, there's a nice view of the Susquehanna valley.  Other than a bathroom at the trail head, there are no facilities there, so bring water.  Also, there are hunters there, so bring something blaze orange if you're there in season.",
  "Just north of Harrisburg is a surprisingly expansive grove of very big trees with good hiking trails. Hunting is allowed so be vigilant about the day you visit during hunting season. NOTE: No hunting on Sunday in PA. ",
  "Boyd's is a great place if you want to walk in the woods near to Harrisburg.  Laid out on the north side of a mountain, it has a number of trails that are well marked, with a variety of terrains-flat versus hilly.  It's dog-friendly, and if you make it to the top of the mountain, there's a nice view of the Susquehanna valley.  Other than a bathroom at the trail head, there are no facilities there, so bring water.  Also, there are hunters there, so bring something blaze orange if you're there in season.",
  "A lovely network of trails, some with elevation changes, but many easy flat hikes, too.  Large paved parking area.  Easy access to the trails from the parking lot.  Reminds me of the carriage trails at Acadia National Park!",
  "This is my favorite hiking area in the mid-state. Great place to get out in nature. They have a lot of different trails but my favorite is the one that goes to the top of the mountain.",
  "On Blue Mountain are several trails 1-2 miles long, some difficult and not advisable in rainy conditions.  Hunters are allowed so you may want to avoid on some days!  Huge trees!",
  "If you want a nice walk in the woods, this is the place for you.  There are a variety of trails of various lengths and difficulties.  It is very well maintained but occasionally you have to go around a downed tree.   As mentioned by other reviewers, wear bug spray.  I went in shorts and sandals and got a lot of bites.   Highly recommended!"
 ]
},{
 "name": "John Harris-Simon Cameron Mansion",
 "address": "219 S Front St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/a0/4e/59/the-mansion-has-stood.jpg",
 "tags": [
  "wander",
  "tour",
  "eat",
  "knowledgeable",
  "learn",
  "history",
  "family",
  "drink",
  "tour",
  "family",
  "history",
  "food",
  "wander",
  "tour",
  "eat",
  "knowledgeable",
  "learn",
  "history",
  "family",
  "drink",
  "tour",
  "historic",
  "tour",
  "family",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d3374582-Reviews-John_Harris_Simon_Cameron_Mansion-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband's workplace hosted its holiday event at the John Harris Mansion on Front Street in Harrisburg.  Neither he nor I had ever been there, so we were excited to see this venue.  We  enjoyed hors d'oeuvres and wine downstairs and were then able to take a short guided tour of the upstairs rooms.  Our tour guide was very knowledgeable about the artwork, history of the house, family, and Harrisburg history, in general.  It was a relatively short tour -- approximately 15 minutes -- but that was the perfect amount of time to see the upstairs and learn a little bit about the history of the house and area.  \n\nAs a reception venue, it was lovely.  The main room downstairs had plenty of room to accommodate us, and we were able to wander the downstairs rooms at our leisure to eat, drink, and socialize.  The waitstaff was extremely efficient, and they went out of their way to please us and accommodate any of the guests' wishes.  We would definitely consider booking this venue for another type of event, and we had a great time!",
  "Our family was there for the Bar Mitzvah of my dear friend's son last year and I completely fell in love with the place. It is absolutely beautiful and the history of the place is fascinating. We were able to enjoy a short tour during our time there, which was wonderful - the inside and outside of the building are equally beautiful. I would recommend a tour to anyone who loves history and beautiful old buildings. I would also recommend booking the mansion for your event because the food was outstanding and the staff did an excellent job. I was really impressed with everything. My only complaint was that there was only one bathroom for all of the guests - yikes! ",
  "Our daughter held her wedding here, vows only. The mansion is absolutely beautiful!  Taking a step through time and enjoyable every step of the way!  Definitely worth a look!  The wedding was in April 2000, this site wouldn’t let me pick any date past this year.  ",
  "Just touring through this mansion gives you a fantastic feel of how life was \"way back when!\"  ?Try to get there every July 4th for the reading of the Declaration of Independence by period correct actors dressed as John Harris and Benjamin Franklin.  Very inspiring!",
  "My husband's workplace hosted its holiday event at the John Harris Mansion on Front Street in Harrisburg.  Neither he nor I had ever been there, so we were excited to see this venue.  We  enjoyed hors d'oeuvres and wine downstairs and were then able to take a short guided tour of the upstairs rooms.  Our tour guide was very knowledgeable about the artwork, history of the house, family, and Harrisburg history, in general.  It was a relatively short tour -- approximately 15 minutes -- but that was the perfect amount of time to see the upstairs and learn a little bit about the history of the house and area.  \n\nAs a reception venue, it was lovely.  The main room downstairs had plenty of room to accommodate us, and we were able to wander the downstairs rooms at our leisure to eat, drink, and socialize.  The waitstaff was extremely efficient, and they went out of their way to please us and accommodate any of the guests' wishes.  We would definitely consider booking this venue for another type of event, and we had a great time!",
  "I would love to give this beautiful historic home a good review, it is well maintained and truly lovely.  However, the guide, Rick, was the worst guide I have ever had at an historical location. (And I have traveled extensively to all manor of historic houses all over the world)\n\nHis tour started off by his informing us that it might rain and that we would be spending some time outside so if we wanted to get our raincoats we should do that... It took him 5 minutes to explain this to us... I knew we were in trouble.\n\nAfter about 10 minutes of being outside and hearing about the additions to the original home, we entered through the front door.  The entry hall was magnificent.  However, there was not much information given it, instead we were ushered into an equally lovely parlor which held rows of chairs set up for an event.  Rick asked us to sit down because he had a few things to tell us.  \"Ok, what should I tell you about?\" What?  What should you tell us about?  Are you kidding me? You are the guide! You should know what you should tell us about!\n\nRick then asked us what we thought of the parlor and what period we thought it was from.  Then he launched into a diatribe about the people who lived there.  He talked for 25 minutes.  His facts were uninteresting.  (The tour had now lasted for 35 minutes... this was to be an hour tour and we had only made it to the first room on the first floor). \nBasically, the entire point of the 25 minute lecture was to let us know that the owner had spent some time in Russia and there fore the room had some Russian influences.  25 MINUTES!!!\n\nWe then went into the rest of the first floor.  Where he talked more about the decor but then stopped to have an 8 minute conversation with the workers who were doing some renovations.... we are at 47 minutes now and had not made it upstairs.\n\nUpon arriving at the 2nd floor, he stopped in the upper hallway.  As he was talking my 18 year old daughter and I wandered around just trying to see a bit more before we needed to leave.  Now, we have toured extensively and are very respectful of our surroundings and of the guides.  We were quiet and even kept our hands clasped behind our backs so at to not touch anything.  However, Rick suddenly stopped his talk to yell at us.  Yes, he yelled at us.  \"This is a guided tour! You have to stay with me.\"  By then I was done,  I politely informed him that we needed to move on soon and that we were just trying to see the rest of the upstairs before we had to leave.   He said he would be finished in 10 minutes... 48 minutes down stairs and 12 up....  He got into one of the bedrooms filled with victorian furniture, historic clothing and artwork and said, \"There isn't much to talk about in here, it is a bedroom.\"\n\nWe soon after departed.  A few more people on the tour suddenly had to go as well.  \n\nI do not recommend this sight unless they give you a different guide.  It is not worth the money or time.  It is truly too bad as the home is lovely.",
  "So, this house is a very old house with generations of history involved. Great. But that doesn't mean that we need to take all of the interest and excitement out of it in the tour.\n\nOur tour guide was obviously very knowledgeable about the place, but the tour itself was not good. It was dry and uninteresting, and many of the things he brought up had little to do with the rest of the tour. The guide spoke quietly so we couldn't even hear a lot of what he said.\n\nAt one point, my family stepped in to the next room to take a peek. The guide felt the need to reprimand us for it rudely, instead of just politely asking us to stay with the group.\n\nIt was long and rambling and the talk never got to the point. The tour of only part of the house lasted over an hour! This length would have been great if the talk had been engaging and all about relevant facts, but it was not.\n\nThat being said, the house itself was interesting and would have been great if the information had been portrayed differently.\n\nI think there are other historical sites more worth the time."
 ]
},{
 "name": "Harrisburg Mall",
 "address": "3501 Paxton St",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/98/c4/88/harrisburg-mall-main.jpg",
 "tags": [
  "eat",
  "theatre",
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d11800547-Reviews-Harrisburg_Mall-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Macy’s was the store to go to. They had great sales especially the children’s department. I was able to buy gifts for babies for $2.56 a piece. The mall didn’t have many good stores when you are from NY and have everything other state stores don’t really impress you. They had many closed down stores but they had Pink, Rainbow, footaction, bath and body works and a huge Regal movie theater",
  "We enjoy browsing the new and used books at the 2nd & Charles store.  After that, we head over to Bass Pro.  If we have any money left over for a bite to eat, it's onward to the Capitol Diner.  The mall isn't anything special, but worth a visit once or twice a year.",
  "Like many malls throughout the United States, the Harrisburg Mall is dying like the rest. The parking lot is a bit tricky to figure out, as there are dead-ends and the  lack of  access points to nearby retail. The surrounding highways are DANGEROUS, as lead lanes are lacking. This makes it challenging to exit from the PA Turnpike and merge into the exit lane for the Mall. If it weren’t for the Bass Pro Shops, there would be very little foot traffic. ",
  "Like most brick and mortar malls in this era, this 1969 era mall has had its challenges. In 2004, A $77 million revitalization of the mall which, in addition to renovations to the mall's decor, included the addition of a 14-screen Great Escape theatre; not all the planned improvements occurred. The mall went through a bankruptcy in 2009. Considering the history and the market, the mall is doing relatively well, and offers some bargain shopping and larger name brand retailers. The Bass Pro Shop has a loyal and enthusiastic following. For me, Macy's had a great sale going and I got a few polo shirts, and then being close to Father's Day, I got another $10.00 off - so count me in the happy customer category.",
  "Wow what a dump, we went to Bass Pro Shop and ended up walking into the mall from the second floor, it was as if I walked into another world.  Run down, stores closed, junk stores.  It's a shame that the online shopping has put malls like this pretty much out of business.  \n\nStay away! unless your going to Bass Pro Shop which is great!"
 ]
},{
 "name": "Harrisburg Holocaust Monument",
 "address": "Front St & Sayford St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/0f/8b/4e/photo2jpg.jpg",
 "tags": [
  "history",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d10429926-Reviews-Harrisburg_Holocaust_Monument-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "History repeats itself. It is important to stop an remember those who were killed during World War II.",
  "Amazing area. I believe there’s an area in which you can rent a bicycle and ride along the water front ",
  "Amazing place to visit. We learn a lot and also amazing people at there. Plenty are to see out there, in the future I love to live there. I recommend 100%. ",
  "I remember first seeing this monument and I had to take in a deep breath and grab a tissue for the tears flowing!  It has a profound effect on everyone who sees it.  Recently Pittsburgh had a tragedy at a Synagogue so this struck us hard although we are not Jewish.  Allow time to see this one.  It is tragic and beautiful all at once.",
  "Beautiful grounds and magnificent memorial  to commentate the holocaust. It has a beautiful setting near the river. And is very photogenic\nYou really can stand back and think about what it represents.  Just stunning",
  "Amazing area. I believe there’s an area in which you can rent a bicycle and ride along the water front ",
  "The design told the story of a people rising to the sky in spite of being trapped by the Nazis. The granite stars of David and the names of the camps and sayings added to the dramatic sculpture. Really sorry I hadn't been to sooner"
 ]
},{
 "name": "Newfangled Brew Works",
 "address": "8001 Union Station Blvd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/ea/83/17/photo0jpg.jpg",
 "tags": [
  "music",
  "kids",
  "drink",
  "food",
  "food",
  "drink",
  "drink",
  "walk",
  "food",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d15676528-Reviews-Newfangled_Brew_Works-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "Stopped in for drinks, to many kids running around. Don't mind kids but keep them under control. Service was great, drink selection was adaquet. Live music a plus. Couldn't get a Cornhole board as a group had it all night, even if they weren't playing they said they were about to start. Annoying. 🌟 🌟 🌟",
  "We stopped by hoping to try food and beer. We sat at seats at the bar for 30 min and never even got acknowledged. Apparently you need to be a regular to get service here. Will never go back. Shame on you newfangled!",
  "Taco style food from an 'indoor food truck.' Prices are ok.  Tacos (small) are 3 for $11. Taco salad $8. Chips & queso $6.  Drink menu is local beers, Mexican soda, some cocktails and wine.",
  "This place is hip with cool beer selection, folksy musicians and things to keep a person with attention deficit content. Husband doesn't like all these new IPA beers with their bitterness value ratings but there are 2 beers here which I will drink which doesn't give me bitter beer face. Wife loves the selection and the cool games which are placed at various tables. We once had a game of Jenga giant blocks going on so intense i think we distracted the musicians, which by the way, have always been great. You're not gonna run into Taylor Swift here but you will have a good ol time. If you don't want the tasty taco's there's a very nice restaurant attached, don't even need to get yourself all worked up about a long walk cuz it's a short hallway away.",
  "This brewery is located in a residential area, with new townhouses and single homes still under development. The brewery is in a large building shared with a restaurant next door (Koda). The brewery has a large bar, games such as ping pong, Jenna, etc, a nice patio area, snack food and a Small food choice designed to look like a food truck that serves tacos. I had three tacos, pork, chicken and fish (the fish taco is served chilled), my wife had a taco salad. Beers were decent, they also serve alcohol slushy drinks. We were there for about an hour and really enjoyed our time."
 ]
},{
 "name": "West Hanover Winery",
 "address": "7646 Jonestown Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/9a/0c/78/photo0jpg.jpg",
 "tags": [
  "tasting",
  "unique",
  "history",
  "tasting",
  "knowledgeable",
  "knowledgeable",
  "food",
  "tasting",
  "walk",
  "unique",
  "history",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d11797177-Reviews-West_Hanover_Winery-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited one afternoon the owner was holding a wine tasting for a group of 6 people so we visited with his assistant and learned the process and tasted several wines. We enjoyed it so muck we called and scheduled a wine tasting with the owner Tues afternoon what a treat. Walked through his vineyard, learned the aging process, sampled several types and flavors, enjoyed cheese & crackers etc. most of all we enjoyed the conversations. By the way we purchased several bottles of our new found favorites. Plan to return if we get back in the area. Stop in and enjoy the several hours you will spend.",
  "When you pull up here, you think you are driving into someone's home driveway. You are. And the tasting room? His garage. It is. But keep going. It's a labyrinth underneath the house, through the caverns of wine making machines and equipment, until you spy a lone door... go through it. It's nothing fancy, kind of small, but there are two tasting bars... and herds of different wines to try.\n\nThe vintner has ions of experience, and knows his craft, yet can be so darned entertaining with his stories as well. Several other small groups were there, all enjoying the experience in the \"I'm inside someone's wood paneled basement\" kind of tasting room, but you hardly even care once you start tasting the great and sometimes unique flavors. I had to try the pineapple wine - yuck - but unique. We then ended up choosing two nice sweet wines from a huge selection. And he had a vast selection in every wine category. Don't plan to rush through this one. The owner - an old hippie gone wine wild - lets you sample liberally as he explains the history and the process of each wine. Kind of like a mad scientist who's cool! Don't miss this stop. The funnest stop of the day.",
  "Great little place- unsure about it at first, as you have to meander through the garage and basement among the wine barrels and fermenting carboys.  Owner is a lot of fune to talk to- ask him about his hockeying pplaying grandson.  Great wines also.  Gives a generous military discount.",
  "Very nice Gent who is very knowledgeable. I like dry red . Found my all time favorite there. It is a Cabernet Franc. Words can not describe the taste of this wine!",
  "Got the Groupon and read it and call ahead. He will be ready and set up for ya. The wine was awesome and we were able to try a lot of them. He was knowledgeable and shared a lot about his craft. We purchased two bottles and seriously I could of purchased a half dozen but my wife and I visit a lot of wineries and usually limit to 1 or 2 bottles. Absolutely loved the experience we will be back. ",
  "After reading reviews on TA we decided to give this place a try knowing it wasn't exactly a standard type tasting room by the descriptions.\nThe sign is visible in the yard as you pass a fire station on the left.\nThere was limited parking but it wasn't busy and we were glad we had read the reviews regarding the location/entry as it is a home with a side enclosed looking garage with a single door entrance that isn’t very appealing.  \nYou enter and walk through a metal utility type door and walk through a wine and storage room with wine barrels and through another door before you get to the tasting room.\nWe sat at the tasting bar and were acknowledged as the owner, George, finished with another customer.  Generally we spend 30 min. or so doing a small tasting but this experience took much longer than expected as George was very talkative and outspoken.  He had lots of stories (some quite colorful bordering on crude) on many different subjects from traveling countries to politics.  After listening to an hour of stories we asked about beginning the tasting which took another hour with stories filtered in.\nThere were several tasting options at different price ranges in your choice of wines from the list.  You can share the tasting but they are in tiny plastic sample cups and it was a sip a piece.  We did the $6 tasting.\nAlthough he pointed out award winning wines, in our opinion, two bottles of red were “corked” and we were unable to take more than a sip even though he indicated they were stellar wines.  He mentioned he had just opened the one the other day so we think it was open too long and the pour was from the bottom of the bottle.  The others we tasted were just okay and not appealing to our palette. There is no food to purchase that we observed or were told about.\nIt was an interestingly different wine tasting experience to say the least and no other customers came in while we were there.",
  "Great little place- unsure about it at first, as you have to meander through the garage and basement among the wine barrels and fermenting carboys.  Owner is a lot of fune to talk to- ask him about his hockeying pplaying grandson.  Great wines also.  Gives a generous military discount.",
  "When you pull up here, you think you are driving into someone's home driveway. You are. And the tasting room? His garage. It is. But keep going. It's a labyrinth underneath the house, through the caverns of wine making machines and equipment, until you spy a lone door... go through it. It's nothing fancy, kind of small, but there are two tasting bars... and herds of different wines to try.\n\nThe vintner has ions of experience, and knows his craft, yet can be so darned entertaining with his stories as well. Several other small groups were there, all enjoying the experience in the \"I'm inside someone's wood paneled basement\" kind of tasting room, but you hardly even care once you start tasting the great and sometimes unique flavors. I had to try the pineapple wine - yuck - but unique. We then ended up choosing two nice sweet wines from a huge selection. And he had a vast selection in every wine category. Don't plan to rush through this one. The owner - an old hippie gone wine wild - lets you sample liberally as he explains the history and the process of each wine. Kind of like a mad scientist who's cool! Don't miss this stop. The funnest stop of the day."
 ]
},{
 "name": "Art Association of Harrisburg",
 "address": "21 N Front St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/8f/77/87/beautiful-architecture.jpg",
 "tags": [
  "art",
  "historic",
  "free",
  "art",
  "unique",
  "walk",
  "art",
  "historic",
  "art",
  "art",
  "unique",
  "walk",
  "art",
  "historic",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52787-d10234430-Reviews-Art_Association_of_Harrisburg-Harrisburg_Pennsylvania.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Art Association of Harrisburg is a membership organization founded in 1926. Its galleries in the historic Governor Findlay Mansion across from Riverfront Park exhibit the works of regional and national artists. During our visit there in April 2016, we saw multiple pieces each by about 10 artists, ranging from traditional to quirky modern. Touring through the galleries on three floors is free; they are open Monday through Sunday at varying hours.",
  "We visited last month for the exhibition of the Seven Lively Artists and had a wonderful experience. Go for a visit if for no other reason that to see the incredible building. This is a real gem.",
  "The Art Association of Harrisburg is the city's oldest arts organization. Located in the converted Findlay mansion along Front Street, AAH boasts a unique gallery space hosting several exhibits throughout the year. As a membership organization, AAH offers classes, lectures, and other events throughout the year. AAH is also the central figure in Gallery Walk, which is a city-wide event with a plethora of arts organizations participating by showcasing a wide variety of art forms. As an arts lover, you would be remiss if you missed out on visiting AAH.",
  "Great art gallery in a old historic townhouse. There are different galleries on each level. Good variety of art and show artwork of artists living outside of Pennsylvania.",
  "We visited last month for the exhibition of the Seven Lively Artists and had a wonderful experience. Go for a visit if for no other reason that to see the incredible building. This is a real gem.",
  "In a multi-story Victorian mansion along the riverfront, the Art Association of Harrisburg is a wonderful site to showcase the work of national and local artists. Spread over three floors and multiple rooms, the works are displayed well. The building has extremely high ceilings and interesting staircases. The Association welcomes hosting functions.",
  "The Art Association of Harrisburg is the city's oldest arts organization. Located in the converted Findlay mansion along Front Street, AAH boasts a unique gallery space hosting several exhibits throughout the year. As a membership organization, AAH offers classes, lectures, and other events throughout the year. AAH is also the central figure in Gallery Walk, which is a city-wide event with a plethora of arts organizations participating by showcasing a wide variety of art forms. As an arts lover, you would be remiss if you missed out on visiting AAH.",
  "The Art Association of Harrisburg is a membership organization founded in 1926. Its galleries in the historic Governor Findlay Mansion across from Riverfront Park exhibit the works of regional and national artists. During our visit there in April 2016, we saw multiple pieces each by about 10 artists, ranging from traditional to quirky modern. Touring through the galleries on three floors is free; they are open Monday through Sunday at varying hours."
 ]
}]
