[
{
 "name": "Gates of the Mountains",
 "address": "3131 Gates of the Mountains Rd.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d4/fe/d6/gates-of-the-mountains.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "tour",
  "history",
  "history",
  "unique",
  "hike",
  "history",
  "family",
  "kids",
  "tour",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d319136-Reviews-Gates_of_the_Mountains-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful area made famous by the wonder-struck Lewis and Clark expedition and the tragic Mann Gulch Fire,  If you have the time to explore it when in the Helena area, I highly recommend!  Access by tour boat, private boat, canoe, or via trail from the Big Belt Mountains and Gates of the Mountains Wilderness Area.",
  "Our travels to Montana were largely to trace the path of Lewis and Clark, and this boat tour of the canyons on the Missouri River just north of Helena were a perfect fit for our purposes and didn't disappoint. The 90-min. boat ride down the river was piloted and narrated by a young fellow who's probably a teacher during the year, and his lessons on the history, geography, geology, and flora and fauna of the canyon were lively and informative.",
  "Excellent boat Capitan with wide knowledge of the geographical and natural history of the place kept us entertained during this tour of one of Capitan Lewis's important encounters on his way up the Missouri River on his way to the Pacific. Enclosed boat with good views kept us warm on a cool day. Eagles dominated the wild life viewing. Kudos to our Capitan-Narrator on his telling of the Mann Gulch wildfire documented by Norman McLean. Nice trip!",
  "Always love bringing visitors to 'the gates'.  Surrounded by beauty and history.  The boat ride is so worth the trip.  The guides can spot all the wildlife and historical features of the canyon.  Bring your binoculars if you have them and a jacket because it is sometimes cool on the water.",
  "Super outdoors area provides boat tours, campsite stops, historical interpreter guides that talk about the unique geological features, Mann Gulch fatal wildfire disaster, Lewis & Clark exploration, wildlife viewing, etc.\nIf you are a camper/hiker, check out the Gates of the Mountains website regarding overnight drop off stays along the boat tours rest stops.  Also, be aware of back country hazards before attempting to camp, dangerous thunderstorms strike fast/hard, rattlers, large predators, rough terrain and extreme temps can flux quick in the Rockies.\nThere's local rivers and obviously large bodies of water to enjoy floating, fishing, and boating recreation.  It's also about 40 mins North of Helena. Not terribly far from basic civilization.",
  "During this boat trip you will enjoy the beauty of this area, see wildlife, and enjoy learning about some of the areas history.  If you are up for a hike take an early boat so you can get off, enjoy wildlife and catch a ride back later.  How long it takes is really up to you.",
  "The boat ride to the gates is a very pleasant and beautiful trip.  I have been many times and every time I see things from a new perspective.  If you are just visiting or have gone many times like I have, be sure to go this spring after the thaw and see it again for the first time.",
  "Great experience even though it was pouring rain. 9 family members went including 3 small children and 2 bigger kids. Saw great sights a couple goats and several eagles. Heard amazing stories of this area and saw the moment for the firefighters of the gulch fire (a very sad story and something that changed the way this type of fire is fought through the entire USA) \nHighly recommend this trip and so does my mom she has been 5 times now.",
  "Highly recommend taking the time to take this boat ride and see the absolute pristine scenery and wildlife along with the story regarding the Lewis and Clark expedition. Talk about an incredible experience!!!!!!",
  "There is a seasonal tour boat service that takes you down the river that Lewis And Clark traveled. You should see some wildlife and beautiful scenery. You will learn about why they are called Gates of the Mountains. They offer several tours during the day and a dinner cruise in the evening during the summer months. Very worthwhile.",
  "Awesome sights, great guide and great price.  Would recommend for anyone visiting the area. We were there 2 years ago and had to bring our friends this summer, who really enjoyed it!"
 ]
},{
 "name": "Cathedral of St. Helena",
 "address": "530 N Ewing St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/c3/58/ca/cathedral-of-st-helena.jpg",
 "tags": [
  "art",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d319138-Reviews-Cathedral_of_St_Helena-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a very spiritual place, speaking volumes about the commitment of the people of Helena and their love for the Church. The stained glass windows tell stories from salvation history, and they are exquisitely executed. The windows are true works of art, and are worth a careful walk around the cathedral to understand their stories. The acoustics are great, as are the sight lines. This is a very special place, both inside and out, as it stands high on a hill overlooking the entire city. ",
  "One of the most beautiful cathedrals I have seen!  We were there 2 years ago and had to bring our friends who also thought it was wonderful.  The stained glass is awesome!",
  "We went to the church for a visit. It started to rain really hard. The cathedral was full.\n\nOur car was several streets further. We stayed inside the Cathedral. I was looking at the beauty of this cathedral.\n\nThere were so many beautiful stained-glass windows.\n\nThe wooden benches were very comfortable.\n\nThere were beautiful lamps.\n\nAt the entrance was the baptism for babies.\n\nEverything I saw was beautiful!\n\nThey even have an organ.\n\nWhen the rain stopped, we took pictures from the outdoors.\n\nThe cross was at the highest part of the cathedral.\n\nThis is a must see!",
  "This is a must see when visiting Helena.  You feel as if you are in a cathedral in Europe.  Opened to the public on Tuesday so plan ahead.  Definitely worth your time.  One of the most beautiful churches I’ve ever been in.  ",
  "The Cathedral of St. Helena is a surprising piece of architecture set in one of the highest areas of town. It is amazing that a town of such small size would have such a cathedral. Inside there are Bavarian stained glass windows depicting the old and New Testament. "
 ]
},{
 "name": "Mount Helena",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/2f/e4/19/looking-north.jpg",
 "tags": [
  "walking",
  "walk",
  "hike",
  "kids",
  "hike",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d103654-Reviews-Mount_Helena-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Mount Helena is one of the best to see hikes around Helena ( although there are many)  The views are well worth those final steep walks.  In the summer  it is advised that you wear a hat and bring plenty of water!!!",
  "Mt. Helena has various hiking trails and views from a variety of directions.  But no matter which direction the views are beautiful!",
  "There are few places in the US where one can access mountain hiking and biking trails very close to downtown restaurants (or, in our case, from our home).  That's the appeal of the South Hills trail system in Helena, which includes Mount Helena and Mount Ascension, along with Rodney Ridge and other areas.  \n\nLet's say you're staying in a hotel in downtown Helena, or one of the bed and breakfast places near downtown.  After breakfast, you can either ride your bike or walk to the Mount Helena trailhead.  And after some hiking or cycling, you can then drop into downtown and grab lunch.  Mid-afternoon, you can drop into town again for a beverage.  And so on.  It's common to see mountain bikers (in their gear) downtown or in the nearby bars and restaurants.\n\nOne of the coolest things is to be hiking on Mount Helena and hear the bells ringing at St. Helena cathedral.  More like Europe than the US.  \n\nAnd if you don't feel like cycling or walking to the trailheads, you can drive there very easily from anywhere in Helena in just a few minutes.\n\nThe trails on Mount Helena are varied.  I've hiked each one, in each of the four seasons.  Be sure to get a trail map (you can buy them at The Base Camp in downtown Helena for around 8 dollars).  Trail junctions aren't always marked on the ground.  \n\nIn addition to hiking and mountain biking, you can also sport climb on Mount Helena.  There's a new sport climbing area with bolts set, so that sport climbers can attach their ropes.  Check at The Base Camp for details.  \n\nIs Mount Helena safe?  Yes.  99.99 percent of the folks I meet on the trails are law abiding and decent.  I've hiked the Mount Helena trails probably more than 150 times, and never had a problem.   There tend to be quite a few folks around, and most trails are out in the open where there's good visibility.  Be aware, however, that some miscreants (probably meth heads) have recently broken into cars occasionally at the Mount Helena trailhead.  Don't leave anything valuable in sight.  And keep in mind that occasionally mountain lion or bear are sighted on Mount Helena trails.  There haven't been any problems with them so far, but stay alert.",
  "If you are up to this hike it will not disappoint, also, you can go up the back side and ride on horses!",
  "We went hiking for at least 5 hours. It was fun and we were soaked as well.\n\nWe could see the cathedral perfectly.\n\nAt times it rained and then the sun started to show its warm weather.\n\nHowever, we were surrounded by mountains and what a beautiful view we had!\n\nSome kids were bicycling. Wow!\n\nWe did end at the highest part of the mountain. We had a beautiful view on the town of Helena. We also found purple flowers.\n\nWe were tired when we went back to our campground, but we had fun!\n\nA must see!",
  "We didn't have time to hike here -- we drove up to the park after visiting Reeder's Alley before we left Helena. However, even at the full parking lot, you can see quite a lot. I imagine that the hiking trails are everything others have raved about.",
  "This mile high mountain is visible from my different spots in Helena and is designated as a city park.  There are hiking trails galore some very easy and others more difficult but many afford the hiker with spectacular views of the valley below and the city itself.  There is a kiosk with maps in the parking lot that prepares you for your journey.  Very pleasant way to spend a day.  The mountain is such a symbol of Helena itself.",
  "If you want a hike which is a little challenge with quite a few shady trails. This is your ideal hike.  When you reach the top you will get a fabulous view of the Helena valley and it’s surrounding mountains.  You can then go on back side of Mount Helena and walk through some gorgeous meadows.  It is worth every step."
 ]
},{
 "name": "Montana Historical Society Museum",
 "address": "225 N Roberts St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/63/68/8a/montana-historical-society.jpg",
 "tags": [
  "learn",
  "food",
  "unique",
  "history",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d481541-Reviews-Montana_Historical_Society_Museum-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a remarkable museum. Lots of great things to see and learn. If you are in a Helena, it is well worth the time. ",
  "There were two attractions outside: A cowboy with his horse and metal head of a bison.\n\nWe found out that this museum was about the American Indians and cowboys.\n\nAt one time, the American Indians had a depression. They received food.\n\nWe could see how the American indians lives. Every tribe was different.\n\nThey also showed the white men lived in homes.\n\nWe also learned about the railroads, guns and pistols.\n\nIn the 1830, Flathead indians invited missionaries in 1841\n\nWe also learned about the Buffalo stampede\n\nThere were beautiful painting  about the American Indians.\n\nThere was even an albino buffalo.\n\nWe learned a lot here and everything was well explained.\n\nWorthwhile to see!",
  "The price was reasonable.. Interesting things of Montana and settlers... worth the money... very nice giftshop.",
  "We spent over an hour in the museum and found it to be highly interesting. The gallery that displays Charles Russell’s works was impressive. We found the different exhibits to be interesting and well planned. Instead of random collections, the curators carefully selected unique items so that it did not appear cluttered but informative. This would be interesting for families as well as anyone interested in Montana history.",
  "We were really pleased that we decided to visit the MOntana Historical Society Museum.  Straight ahead as you walk in on the left are many Joe Schuerele works of native Americans in the early 20th century. They are fascinating to look at. Then at the end of the hallway is the Charles M. Russell collection. What a treasure! You can tell that the people and landscape of the West were really important to him. Be sure to see the juxtaposition of a Blackfoot warrior forty years apart with the once proud man reduced to selling trinkets.\n\nThen there is a whole historic section about the people who came to Montana to settle and their early lives.  There are many large scenarios to look through. Finally don’t miss “Big Medicine” a stuffed white bison on the second floor."
 ]
},{
 "name": "Montana State Capitol",
 "address": "Montana Ave. and 6th St Montana Ave & 6th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d9/5d/08/montana-state-capitol.jpg",
 "tags": [
  "art",
  "free",
  "tour",
  "free",
  "tour",
  "art",
  "learn",
  "history",
  "wander",
  "free",
  "tour",
  "walk",
  "history",
  "free",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d319338-Reviews-Montana_State_Capitol-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This isn't the most impressive capitol building in the nation, but it isn't bad.  Very nice stained glass, especially the barrel vault. Murals are located throughout the building, and some are quite nice. Charlie Russell is well-represented, as is Paxon. There is a good informational display of the Montana Constitution on the 2nd floor. Always, always look up in this building--the ceilings and upper walls have some good art displayed.\nPerhaps the best thing about the tour is you can cover the entire building in less than an hour.\nParking is awful, however, unless you hit in on a summer Friday afternoon (although it is free anytime). Parking is impossible during the legislative session (winter, during odd-numbered years).\nDon't skip viewing the grounds. In addition to several statues, there are information signs on many trees and each summer features a lovely floral display (making the state outline and spelling out \"MONTANA\") on the front grounds.",
  "I had the pleasure of having a tour of the Montana State Capitol Building guided by a history teacher named Dallas.  Tours are given every hour or so, check locally for hours and details.  The tour was free and educational.  It was fun to learn a little about Montana history and government, local art and literature, as well as notable Montana leaders. I would do this again!\n",
  "If you are in our State Capital, Helena, you must go through the State Capitol Building. It is free to enter and you can wander around at your leisure or join one of the free tours offered during the summer months. If you go to the Governor's Office you will be treated to a tour of that part of the building any time of year. Don't miss the marble stairs, stained glass, rotunda, or Senate Chambers. If you go to the House Chambers you will see the Charles M. Russell mural that is valued at more than the entire building. If you're not on a tour just peek through the windows in the doors to view the mural. This building has wonderful views of the Helena Valley, Cathedral, and the Sleeping Giant. A new treasure is around every corner. The restrooms are elegant. The Capitol is one of the first places we take guests who visit us in Helena.",
  "This beautiful building was erected in 1902 and is decorated in brass, marble and works of great American artists. DeCamp, Paxton and Montana’s own Charles Russell have murals, paintings and sculpture throughout the building. Be sure to visit the House chambers to see the incredible Lewis and Clark Meeting Indiana at Ross’Hole. \nThere are no more guided tours but you can pick up a self guide at the visitor’s desk.",
  "We took a walk over to the capital to check it out.  We found a sheet that had information about the building and toured it on our own.  It's interesting and worth a stop.",
  "Our state capitol is exceptionally beautiful, and contains history down every corridor and on every level. You can even drop in on the Governor if he is in his office and say hi!  My California friends cannot believe that one does not go through security to visit. Just come on in!",
  "When we went to the Montana State Capitol, there were no ones there. We found out that we can go wherever we want. There are no limits. Wow!\n\nFirst we saw the 10 commandments. \n\nThe Capitol is attractive. \n\nThere are a lot of parking places.\n\nInside the Capitol is gorgeous!\n\nThere was a lot of light from the ceiling. It doesn't cost anything. I like that!\n\nThe stairs were attractive as well.\n\nWe saw many statues that were renowned here.\n\nIt is very colorful!\n\nWe saw the Montana Statehood Centennial Bell, 1889- 1989.\n\nWe were able to see the Supreme court chamber.\n\nThe house of representatives, the senate chamber.\n\nWherever we looked it was beautiful.\n\nI even liked Helena at the top of the Montana State Capitol.\n\nWe had learned a lot and we enjoyed the beauty of the capitol.\nThere were workers preparing flowers. There is also a statue outside of a man on a horse: Thomas Francis Meagler.\n\nI really liked our visit to the Montana State Capitol.\n\nThis is a must see!",
  "The State Capitol building is beautiful inside and out. Every detail is kept up. The building is open to the public and displays Montana history and highlights people who have made an impact in the state and nationwide. Be sure to walk around the grounds and see the landscaping and statues and landmarks outside. And, there was even free parking available right on the Capitol grounds."
 ]
},{
 "name": "Montana Blue Jewel Mine",
 "address": "5582 Four Cees Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/ef/2a/3f/sapphires-and-couple.jpg",
 "tags": [
  "history",
  "food",
  "knowledgeable",
  "tour",
  "tour",
  "family",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d2080013-Reviews-Montana_Blue_Jewel_Mine-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a fantastic day we had. Bruce and his sun in law were sooooo knowledgeable and helpful.\nThey told us tons of history and stories about mining. We were blessed to see many of the beautiful sapphires they have found. \nWe spent the day mining and came home with a handful of sapphires.\nWhen we visit Montana again, we will definitely return.\nI wish I can give it more stars.\nFyi...wear sunscreen,  layers, and bring water/snacks/ food.",
  "The Four Cees (Color, Carat, Cut & Clarity) are all to be found at MBJM and Bruce, Nina, And Eric graciously taught me the mining basics and provided a nice tour of their operation and explained a lot about sapphire mining on the Missouri River.  Quite an experience and so exciting when you find your gems. Be prepared (hat, water, snack, and perhaps rubber gloves), but they provide everything else.  It is an authentic outdoors setting at an operating sapphire mine and you will need to work if you want to find them.",
  "What amazing and inexpensive fun! As I had three teenagers, a twenty-somethinger, and me, this wonderful experience was less than the cost of a movie. AND WE BROUGHT HOME SAPPHIRES! \n\nBruce was wonderful, very patient and helpful, and he spent time with us to make sure we could find sapphires. AND WE DID! We had so much fun there, all of us wanted to go again tomorrow, but as we drove from Bozeman, probably not so much. We will go again!\n\nBeautiful drive, really sweet people, and did I mention WE GOT TO BRING HOME SAPPHIRES?! Beats the heck out of a movie! Well worth the drive and the cost of a first-run movie.",
  "Fantastic experience!  Got to keep everything I found and even took a container of sifted rough home with me and I'm still enjoying the fun of finding sapphires!  Bruce was extremely helpful and very nice.  Loved talking with him and can't wait to go back!",
  "Bruce and his family here on site are so much fun! Loved the 'show and tell' and tour of the mining operation. Took lots of time with us to go over history of the area. Easy hands on experience and a beautiful drive on an early fall day. Could not have been better!\nCALL AHEAD FOR RESERVATIONS - space is limited!",
  "This was our first trip to the Blue Jewel Mine.  Bruce was so enthusiastic about sharing his knowledge of mining. It was a great set up, not only do you find sapphires but garnets too.  Just an FYI, bring water, sunblock and snacks.  You will work and get dirty, but it's all part of the experience. Overall GREAT time !!!!  Thanks Bruce and Eric you made this so much fun.",
  "We were the only customers at the mine,  and totally green at that.  But the owner,  Bruce,  and his son Eric, could not have been better.  We spent the entire day digging and separating and sorting,  and left with a nice handful of sapphires and one garnet.  The long,  bumpy drive down the road was well worth the results. ",
  "By far one of the most fun adventures.  You get to dig, wash, and sort the rock to find lots of sapphires.  Bruce knows every rock on the place.  Eric helps with everything.  We had such a great time and we found lots of sapphires.  Definitely we would do it again.  Thanks for a great time!"
 ]
},{
 "name": "Great Northern Carousel",
 "address": "989 Carousel Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/e6/d3/88/great-northern-carousel.jpg",
 "tags": [
  "free",
  "delicious",
  "delicious",
  "free",
  "kids",
  "tour",
  "walking",
  "kids",
  "history",
  "music",
  "kids",
  "tour",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d601127-Reviews-Great_Northern_Carousel-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Has an ice cream shop also along with the carousel and a small gift shop it is beautiful and fun for all who are a kid at heart. Who doesn’t like carousels\n",
  "We were in the area for 2 nights and both nights stopped here for delicious ice cream and to watch the carousel. The ice cream was, rich creamy and absolutely delicious. We have been on a 28 day road trip and this ice cream topped the list.  The carousel had many unusual animals on it including an otter and a bison. Free ride coupons were given to us on the train ride we took. One day a week they had concerts outside.",
  "Our 4 year old and 2 year old grandkids loved this. At only $1.50/ride, it's a great place to visit. And the ice cream is delicious (try their Huckleberry!). It's an old-fashioned carousel, with unusual animals (bear, fish, bobcat) as well as beautiful horses. You can also try for a brass ring. Fun!",
  "This was a fun carousel. We had to pay on a machine to get our tickets.\n\nThere.  When the carousel ended, we could go at the carousel.\n\nDuring the carousel, they threw messages. One was for a free  ride carousel. My wife gave it to a girl. She was so happy.\n\nWe felt we were kids again!\n\nWorthwhile to see!",
  "I stayed at the hotel in the complex and loved walking around the self-guided history tour, carousel, kid's garden and experiential museum. Take your kids and have some fun!",
  "This is not an historical carousel although it does have carved animals and jaunty music. This would be a fun place to take kids for a ride and an ice cream. Many of the animals are carved to look like animals indigenous to Montana.",
  "tour on the Helena historical society train (Now closed for the winter)  and receive a ride on the carousel.     In as much as our carousel reading are past us, we decided to order a single dip waffle cone of ice cream and which others ride. \n\nSize of the single dip was very generous.\n\nThey also have space for kids parties.",
  "This is currently ranked as the #6 thing to do in Helena, which, if true, is not a great sign. It is nice enough, it's an indoor carousel with neat carved animals. There is a ring game with the carousel, and there's a small cafe there. The rides aren't real expensive. But at the end of the day, this is the sort of thing you usually do because it happens to be where you are, not a destination in its own right."
 ]
},{
 "name": "Archie Bray Foundation",
 "address": "2915 Country Club Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/3b/2f/0c/hugh-ceramic-sculpture.jpg",
 "tags": [
  "wander",
  "walking",
  "tour",
  "wander",
  "historic",
  "history",
  "art",
  "historic",
  "free",
  "walk",
  "wander",
  "walking",
  "tour",
  "art",
  "tour",
  "free",
  "historic",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d481533-Reviews-Archie_Bray_Foundation-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a wonderful place to visit and wander around and to think it had been within a few miles of my home all along! Great walking tour to see at your own leisure. Lots of talented artists have left their work for you to enjoy!",
  "The Bray has a fascinating history and ridiculous (well-earned) cred in the Ceramic Arts Community. Even if you're not a potter, you'll appreciate this \"campus\" with a variety of hot spots to view ceramic creations and huge historic beehive kilns, wander the grounds and search for hidden artistic treasures, visit the galleries and the resident center and just breathe in the air of creativity. Stick around at sunset time and catch some amazing open views of the structures as the Big Sky shares its ever-changing beauty with you. There are workshops and lectures and exhibits going on year-round - be sure to check their web site in case you can catch one of these extra special events!",
  "This place is fun for exploration, from the historic \"bee hive\" brick kilns to the state of the art ceramic studios (where you can see artists at work) to the many outdoor sculptures.  There are two shops on the premises, one that sells ceramic art work which is very high quality (but also high priced), and another that sells clay, glazes, and the biggest variety of pottery tools I have ever seen in one place.",
  "I liked that walk amidst the ceramics. The first thing we saw was that the roof had fallen apart, but it was not dangerous at all.\n\nWhile we walked we could see all kinds of ceramics. Modern ones, and attractive ones.\n\nThere were several people enjoying what they do, like us.\n\nIt was amazing that all of this was for free. We had nothing to pay for the walk.\n\nWe had fun and we enjoyed the ceramics.\n\nWorthwhile to see!",
  "What a wonderful place to visit and wander around and to think it had been within a few miles of my home all along! Great walking tour to see at your own leisure. Lots of talented artists have left their work for you to enjoy!",
  "Stopped by the Archie Bray because I've heard so much about it. I was hoping there might be a guided tour, but I had to tour myself, which was fine. The grounds are amazing and I don't consider myself a huge art person. ",
  "This place is so full of artistry, inspiration and discovery!  You are free to roam the grounds and discover the cast offs of artist as they work their gifts.  It has expanded over the years, but the historic old brick kilns are still there.  It is a must see!  There is also a gallery to purchase works from current residing artists.  Artists that come from all over the world!",
  "Whilst in town with friends, they suggested a visit to Archie Bray and as I was out-voted, I begrudgingly tagged along.  I'm so glad that I did.  This place isn't just for artists and potters, it's for folks who, like me, get bored at galleries, have no talent or interest when it comes to crafts and who bah humbug art museums. \n\nThe grounds are walkable and filled with all sorts of random pieces that may or may not fit the idea of \"art\" or \"pottery\" to folks. It was like a feast for the senses. I really had a blast here and would recommend it as a place to visit while in Helena."
 ]
},{
 "name": "Last Chance Gulch",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/94/cd/b5/last-chance-gulch.jpg",
 "tags": [
  "tour",
  "library",
  "walk",
  "art",
  "music",
  "history",
  "walking",
  "kids",
  "library",
  "walking",
  "free",
  "historic",
  "walking",
  "walking",
  "tour",
  "historic",
  "library",
  "food",
  "historic",
  "walk",
  "walking",
  "food",
  "art",
  "drink",
  "historic",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d103652-Reviews-Last_Chance_Gulch-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "In 1864, down on their luck and about ready to give up their quest for fortune, four miners discovered gold in a stream that later became known as Last Chance Gulch in Helena, Montana. They established a mining camp, dubbed the new settlement Helena after the Minnesota hometown of one of the miners, and pursued their destiny. In the first four years, the Gulch produced $19 million worth of gold. By the 1890s, Helena's spectacular architecture and cosmopolitan ambience won the city the nickname \"Queen of the Rockies.\" Today, visitors can walk through the meandering Last Chance Gulch, meandering because it was originally routed between mining claims, and experience a wide variety of merchants from restaurants to apparel stores to gift shops to custom art galleries to entertainment venues to bars to sporting goods stores to micro breweries and take a tour of the historical sites, the many buildings that date to the 1880s. For example, see the pioneer cabin that was built by Wilson and Jonas Butts in 1864-65, the oldest house in Helena with a documented construction history. It was restored in 1938 as one of the first preservation efforts in the West. Visit Reeder's Alley, a collection of tiny row apartments that once housed miners, and Anchor Park, next to Lewis & Clark Library, which memorializes the USS Helena, which gave its name to four ships that served their country, including one that was sunk at Pearl Harbor in 1941. There are many commercial buildings that are architectural masterpieces, including the Windsor Hotel (1888), Montana Club (1905), First National Bank (1886), Placer Hotel (1913), Colwell Building (1866), Masonic Temple and the Ming Opera House (1880), which once hosted Marie Dressler and Eddie Foy and still uses original hand-painted scenery of the 1880s and a spectacular $10,000 pipe organ that was installed in 1915. In addition, Last Chance Gulch is the scene of music festivals and craft fairs and concerts on weekends throughout the summer.",
  "I grew up in Helena, and back then Last Chance Gulch (or Main Street, as we called it) was dead. It has been hugely revitalized as a walking mall, and it is wonderful! There are great little shops, a tap room, the legendary Parrot (go there for chili and chocolate), several galleries, the library, an ice cream shop, and other things to see and do. Parents were playing cornhole with their kids outside on the mall, and we sat in a bench, ate ice cream, and watched them. Love to see this in my home town! ",
  "I have to encourage Helena visitors to park the car and stroll through downtown Helena.  There are a variety of shops, breweries, wine bars, restaurants and mini-parks.  Helena has one of Montana’s rare walking malls through several blocks of Downtown.  It can be a bit chilly in the winter, but it truly comes alive in the summer.  The entrance to Downtown is best via Last Chance Gulch, where you can enjoy the fun and funky 400 block full of the best mixed-use around.  Coffee at the General Mercantile is an experience not to be missed - don’t be in a rush, it is to be savored.\n",
  "Just looking to catch a glimpse of Helena's past.  No better place for a stroll down Last Chance Gulch, the mining gulch, for a great collection of historical facts, and  old shops.  Don't miss the Parrot, it's only been there for 92 years.  Great Candy and awesome chili, the newspaper boy statue, or great quick eats. Love this place.",
  "We really fell in love with this area of Helena. The buildings, walkways, stores, sculptures, statues and historic items really add charm to this area. We enjoyed walking through here with our dog and like that there is plenty of free parking available. Bird & Beasleys is a must for anyone visiting this area as they carry many itmes handcrafted by local artists and the owner and staff are exceptionally friendly and nice. There are also a lot of geocaches hidden in this area and due to the area's popularity with locals and tourists, retrieving the caches without getting spotted can be quite a challenge. If you go anywhere in Helena, make sure it's here!",
  "I have to encourage Helena visitors to park the car and stroll through downtown Helena.  There are a variety of shops, breweries, wine bars, restaurants and mini-parks.  Helena has one of Montana’s rare walking malls through several blocks of Downtown.  It can be a bit chilly in the winter, but it truly comes alive in the summer.  The entrance to Downtown is best via Last Chance Gulch, where you can enjoy the fun and funky 400 block full of the best mixed-use around.  Coffee at the General Mercantile is an experience not to be missed - don’t be in a rush, it is to be savored.\n",
  "I like visiting historic downtown Helena.\n\nI liked that old tram.\n\nWe saw shopping, food, a mural, performances and a museum.\n\nThere was even a shelter and a library.\n\nThe cathedral  was The best and the library as well.\n\nWe enjoyed our tour.",
  "The Last Chance Gulch was settled by four down in their luck miner in 1864 when surprisingly gold was found. The area was stripped and in the first two years, it produced 19 million dollars of gold.  Helena sprung from this area.  There are tours which we skipped, but we took our our self guided walk around the buildings, alleys and past the sculpture of the miners.  Interesting historic section of Helena.",
  "After hearing the hype of how wonderful this place is we were quite disappointed. The walking mall is run down, unkempt and dirty. The shops were not much to talk about and the food was barely “ok”.  Wish we had stayed in Pray longer and skipped this part of our trip to Montana. Definitely won’t come again. ",
  "I love the art decco buildings that still stand along the gulch.  There is lots of parking all around and the parking is only $1 an hours.  Take time to enjoy a drink or a meal right along the pathway.  Lots of interesting shops along the area.",
  "Love the old building's, especially the Atlas Block always enjoy walking thru a ton's historic area. had time for a beer, and back to exploring the area, beautiful city"
 ]
},{
 "name": "Missouri River",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/8c/1c/4e/missouri-river.jpg",
 "tags": [
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d108385-Reviews-Missouri_River-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Missouri River is one of the largest and most important rivers in the United States and here in Helena it is just Beautiful.  There are views and vistas of mountains and beautiful scenery along its banks.  There are also striking rock formations and the chance to see local wildlife and wild flowers in bloom.  Just a treasure not to miss.",
  "Anyone who appreciates the history of this country and the explorations of Lewis and Clark needs to explore the Missouri River here is Montana.  From Three Forks headwaters, though the Gates of the Mountains and the Great Falls, the river is beautiful, sparkling and inspiring.",
  "We entered the Mighty Mo via the town of Craig. The scenery and wildlife are spectacular.  It's  a great river for fly fishing and/or a raft float. The staff at Cross Currents Fly Shop were super helpful in renting us our raft and running our shuttle. Cannot say enough about our great fishing guide Taylor. For the first timers he gave wonderful lessons and was very patient....even on a very windy day we all landed a fish!  We will be back in 2017 to this beautiful place.",
  "I like the Missouri River. It is one of the biggestrive and I liked the mountains nearby while we were in a boat.\n\nI stood outside the whole time. Naturally, the Missouri River is way attractive with sunshine.\n\nThis is a must see!",
  "The Missouri River is one of the largest and most important rivers in the United States and here in Helena it is just Beautiful.  There are views and vistas of mountains and beautiful scenery along its banks.  There are also striking rock formations and the chance to see local wildlife and wild flowers in bloom.  Just a treasure not to miss.",
  "Take a trip down here and be near the start of one of the worlds great rivers.  scenery and wildlife abound.",
  "This river is absolutely majestic.  We drove around and over this beautiful river.  It is large and extremely clear.  Lots of boats and ramps and tours along the Missouri.",
  "We have been on the Missouri river is several states and its always one of my favorites.  This area on Montana leaves no shortage of quality views from the mountain glaciers to the great wildlife.  If you get the chance, take a ride on the Big MO !!!"
 ]
},{
 "name": "MacDonald Pass",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/9f/d6/42/macdonald-pass.jpg",
 "tags": [
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d126653-Reviews-MacDonald_Pass-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The MacDonald pass is located west of Helena and we passed through it on our way out to Missoula.  It crosses the Continental Divide at an altitude of 6,312 feet and was originally a toll road operated by a Mr. MacDonald.  This highway affords the traveler another view of the spectacular scenery Montana is known for:  majestic mountains and beautiful plains along the way.  You see so much of this beauty along the way that sometimes you have to remind yourself to slow do, top and soak it all in.",
  "     Wife and I left north side of Helena on Lincoln Rd., traveled west to Hwy 200 and followed it to Lincoln, MT where we had lunch and visited their flea market.  Then continued east on 200 to Hwy 141 were we turned back south to Hwy 12 (at Avon) then north over MacDonald Pass to Helena. \n     Great ride in a car (or our Jeep) and many turn outs and off road opportunities.  MacDonald Pass is a 8 mile 8% grade assending and 8.5 miles 8% grade desending.  If in an RV without lots of horses, consider driving the toad detached until you are pass the grade.",
  "The drive over friday was perfect.. the views are beautiful..On friday night it snowed.. so the drive back home could have been slippery but the road was clear and wet.. the fresh snow made the views even better.. ",
  "Macdonald Pass is just plain beautiful.  I have been there in the spring and summer and loved it each time.  Make sure you bring your camera as the shots are awesome from the top of the pass.  There is a small path that you can take for a hike that is good for those of us who typically do not hike.",
  "We drove through MacDonald Pass in July.  The roads are good and without construction. Winter can be rough because of snow, ice, and blowing snow.  Just go prepared and have a great drive!",
  "I did not have time to hike the trails, but I drove over the pass and back to Helena. The view from the MacDonald Vista point was awesome. If you have an hour for the drive, it's worth it. I'll go back up when I can do some of the hiking. One warning, if you make the drive all the way to the top be prepared for a very rough road.",
  "We decided to explore the MacDonald Pass. We saw beautiful trees and gorgeous mountains.\n\nI saw an eagle flying above the clouds. Wow!\n\nWe had crossed the Continental divide.\n\nIn the olden days, people had to pay toll to enter into the Continental Divide.\n\nFor more info, look at the pictures. It is really interesting.\n\nA must see!",
  "The drive over friday was perfect.. the views are beautiful..On friday night it snowed.. so the drive back home could have been slippery but the road was clear and wet.. the fresh snow made the views even better.. ",
  "The MacDonald pass is located west of Helena and we passed through it on our way out to Missoula.  It crosses the Continental Divide at an altitude of 6,312 feet and was originally a toll road operated by a Mr. MacDonald.  This highway affords the traveler another view of the spectacular scenery Montana is known for:  majestic mountains and beautiful plains along the way.  You see so much of this beauty along the way that sometimes you have to remind yourself to slow do, top and soak it all in.",
  "At an elevation of 6,312 feet, the pass is located on the Continental Divide west of Helena. It was used in 1870-1880 for travel between Helena and Deer Lodge, and was originally a toll road over the Rocky Mountains. It is named for R. Alexander MacDonald who operated the toll road.\n\nLong-time friends we were visiting in Helena in early May drove my spouse and I out of town to the divide where one can stop at a pull-out to enjoy the scenery. Unfortunately for us, the pull-out was covered in snow. After a very brief stop, we returned the way we had come. Disappointing not to be able to stop longer. However, we did enjoy the short drive.",
  "THis is a spectacular drive across the mountains with the meadows so green and the mountainsides all different shades of green."
 ]
},{
 "name": "Lewis & Clark Brewing Company",
 "address": "1517 Dodge Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/a2/6a/21/lewis-clark-brewing-company.jpg",
 "tags": [
  "art",
  "music",
  "brewery",
  "historic",
  "food",
  "wander",
  "eat",
  "art",
  "music",
  "brewery",
  "history",
  "music",
  "food",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d3609788-Reviews-Lewis_Clark_Brewing_Company-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Lewis and Clark Brewery and Sleeping Giant Taproom are housed in a historic (1885) building in Helena.\nThe brewery's six \"flagship\" beers and a number of seasonal beers are brewed there and served on draft in the taproom. There is live music three or four evenings a week. Since 2016 the taproom has had a State of Montana cabaret license, which permits sale of beer and wine, food, and live entertainment as well as off-sale beer by the six-pack, case, or growler (jug). For those customers who don't want to buy beer, they also serve wine, nonalcoholic beer (Clausthaler) and soft drinks. Snack bar food consists of locally-made bratwurst and pizzas cooked in-house.\nThe taproom has a game room (shuffleboard, pinball, etc.), an outdoor patio, a gift shop, and a small art gallery.  There is live music 3 or 4 evenings a week.\nThe brews are good, and wine, non-alcoholic beer, and soft drinks are also available.  The place gets crowded at times, but the atmosphere is always mellow.",
  "Great beer--Friendly Staff=A Great time had by all!!! Really enjoyed trying all the brews that they have put together. Wish that they were open longer in the evening.",
  "This place is fantastic! The building is steeped in Helena history. The lure of the Lewis & Clark Tap Room is the great beers brewed on site in a building that has been transformed from an old paint factory. \n\nOnce you enter the building you are surrounded by historical references, great architecture, and a relaxed atmosphere with group and private spaces. \n\nThere are multiple areas to enjoy the brews on tap. Be sure to wander around the two level bar area as well as the outdoor patio. Musicians frequent this establishment with a schedule usually available ahead of time. There is an outdoor stage as well as an indoor stage. \n\nYou can grab a bite to eat off a limited menu and that's all you really need since you really came for the popular beer! I had a bratwurst with an amazing homemade mustard that only Lewis & Clark has been making for years. \n\nThis place is for everyone- beer lovers, art lovers, music lovers, history buffs, architecture and design lovers, and anyone interested in enjoying a tasty craft beer in an unusual setting. \n\nThey just underwent a $9 million expansion and it shows. Be patient as they continue to grow. Plenty of parking and annex parking around the building. \n\nThere's a grand re-opening scheduled for this weekend (Fri-Sat) and it will include limited backroom tours. \n\nA gift shop and cooler to purchase canned beer to go is also on site. \n\nCheck out this establishment. It's the best tap room and brewery in town and all of Montana. \n\nBe sure to pick up their beer at Costco too. Gotta have some for home! ",
  "Although we have many good breweries in Helena, Lewis and Clark is our favorite.  The beer, servers, and building are outstanding.   The beer selection and quality is superb.  They have many flagship beers, as well as excellent rotators.  Their food selection is excellent also, and very reasonably priced.  On occasion we have enjoyed their live music selection, which was very enjoyable.  The building and patio are large enough that you never have to hunt for a table.",
  "We love stopping in for lunchtime pizza and a beer. The people there have always been very friendly. We enjoy the music and relaxing atmosphere.",
  "Wonderful eclectic group of people fundraising for ACS CAN. People who came for the ACS CAN fundraiser and others who were there because it is a fun place to be.",
  "Recommended for the beers, they have 12 on tap that are awesome. Small tap room menu,  pizza and nachos.  It's great for the beer but not a meal.",
  "We stopped in while visiting Helena Montana in very early June.  We ordered IPA’s and pizza.  The pizza was excellent and the micros were great.  The service by both the waitress and the bartender were outstanding."
 ]
},{
 "name": "Original Governor's Mansion",
 "address": "304 N Ewing St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/16/1d/40/exterior.jpg",
 "tags": [
  "history",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d775253-Reviews-Original_Governor_s_Mansion-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is the original Governor's Mansion. It used to be a private home. It was built in 1888. It became the original governors' mansion.\n\nI like the pillars outside.\n\nThey have huge trees as well. \n\nInside the house is very attractive as well.\n\nWorthwhile to see!",
  "The original Governor's Mansion has a long history to it.  It was built in 1888 by an affluent businessman who built it to impress the population of Helena.  Then between 1913 and 1959, it served a the governor's mansion for 9 governors and their families.  It is open for tours by the local historical society, but is closed on Sunday when we visited.  The capitol is open though.  We spent the time we would have used touring the mansion to ride around through the neighborhood admiring the really beautiful Victorian and Edwardian houses.  Many of them were painted in very handsome color combinations.  That made for a very pleasant morning.",
  "This stately 3-story, red brick mansion was built in the Queen Anne style in 1889 by William Chessman as his private residence. Two other affluent families owned it until it was acquired by the state in 1913. From then on, it served as the home to 9 governors of Montana from 1913-1959.\n\nUnfortunately, it was not open for tours on the day that our friends drove my spouse and me around Helena to see the sights. They did, however, tell us that it has 20 rooms and 7 fireplaces. Since we could only view the exterior, I found that its most striking feature was the graceful wraparound porch that invited one to visit. Perhaps next time...",
  "This is the home of the first governor of Montana. It is open for tours a few times a day. Unfortunately I showed up at a time when I would have to wait a couple hours for the next tour. :( ",
  "Very interesting and nicely restored historical gov mansion. The tour was sliw and tedious but much to see!"
 ]
},{
 "name": "Holter Museum of Art",
 "address": "12 E Lawrence St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/a4/3e/f4/museum-entrance.jpg",
 "tags": [
  "art",
  "art",
  "free",
  "art",
  "unique",
  "art",
  "music",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d319135-Reviews-Holter_Museum_of_Art-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "As we had time, we saw that the Holter Museum of Art was open. They welcomed ro enter.\n\nOutside there was a huge red contraption on the grass. We cannot miss it!\n\nThere were pictures, interesting monument and paintings as well.\n\nI liked exploring paintings. That was cool.\n\nWorthwhile to see!",
  "This museum which is free to enter (although a donation is recommended) has some interesting things in. There is a room full of interactive art to sit on or talk into.  Favorite area is the room full of trees and birds. There are also some ceramics and paintings. Worth an hour if you’ve already seen all the Helena high points.",
  "The Holter Art Museum is a small museum but this actually is a positive.  It is filled with very unique artwork and because the space is smaller in size, they need to utilize it to it greatest advantage.  They do.  The front galleries art filled with wonderful contemporary artwork, thoughtfully displayed.  The back section of the museum was filled with an installation by Cathy Weber called Understory/Overstory which utilized hundreds of ceramic black birds among limbs and branches that the artist reclaimed from her own property.  Very visually impressive.  I would highly recommend it.  There is no entry fee, but donations are welcomed.  There is a parking lot across the store that we used (on the weekend).  We stayed about 2 hours.  I did not purchase one of Weber's birds here, but did at the Missoula Art Museum, where the piece was first installed.  Well worth seeing! Loaded in the downtown area with lots of cafes, coffee houses and restaurants.",
  "Another small museum but it has some great displays.  We enjoyed the bird display toward the back of the museum.  Lots of trees and birds and very nicely done.  ",
  "The Holter prides itself in featuring upcoming artists in all mediums. They often have openings and provide music and food to create a great art experience. Nice gift shop as well."
 ]
},{
 "name": "Broadwater Hot Springs & Fitness",
 "address": "4920 W US Highway 12",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/dc/20/bb/broadwater-hot-springs.jpg",
 "tags": [
  "food",
  "eat",
  "kids",
  "family",
  "food",
  "music",
  "kids",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d9709570-Reviews-Broadwater_Hot_Springs_Fitness-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I and friends of ours were there in early June.  We used the hot springs and ordered a couple of beers; later we had lunch and a beer.  The service was excellent; the food was very good and we enjoyed.  Be sure to take sunscreen.",
  "All I can say is this place is a must to stop at. What ever body part that hurts : back ,muscles,neck or even your whole body , spend an hour or stay longer  you can tell the difference.  My husband and I stayed two and a half hours and we felt amazing when we left. I loved that they had lockers to store your belonging in. But you do have to purchase a lock from them or bring your own. They have showers to use after you get out. If your hungry they do have a great little place to eat on site to. While you are soaking in the springs they do have wait staff to bring you a alcoholic beverage or other drinks if you prefer. Love this place. Kids are welcome here also. We will be stopping in again if we are ever in town. I would suggest this place to anyone 100%.",
  "Love the atmospheres. Fantastic food. Great staff. Loved our time. Will definitely be back and send family.",
  "Drinks on the edge!  Hot water surrounding us and  2  outdoor TV's to watch NFL playoffs.  Pretty good day.  \nI'd like to be there on a night with music!\nFacility seemed clean and  easy to  navigate.\nAlso nice to  have the  food/bar very close",
  "Clean, updated, good sauna and outdoor hot pool for the price - I think it was $9 for adults. Did not visit the fitness area, but spent about 2 hours in the pools and sauna area. Women’s changing room is well maintained. Hint: bring your own lock for a locker and save 5dollars.",
  "We went late morning on a Saturday with our kids and it was great, the pool wasn't too busy so the kids - ages 7 to 14- could act like kids (well behaved and with good manners) with out bothering other people soaking.  Evenings are much busier and better for relaxing with a beverage with adults. Women's locker room was clean but smelled bad, showers and bathrooms were clean, the swimsuit dryer was broken.",
  "Stopped for a drink with six friends. It was happy hour( which we had to remind the waitress) . There were 12 other people and the five of us. There were three waitresses/ waiters. We got water right away and were then forgotten for 20 minutes. Finally had order taken for drinks. About ten minutes later a second waitress tried to take our drink order. \nAfter another eight minutes our drink came. Appetizers did arrive in a more timely manner. \nNice location but very poor service"
 ]
},{
 "name": "Reeder's Alley",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/03/91/96/reeder-s-alley-2017.jpg",
 "tags": [
  "unique",
  "eat",
  "walking",
  "history",
  "free",
  "history",
  "historic",
  "walk",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d108387-Reviews-Reeder_s_Alley-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Reeder's Alley was built in the 1870s by Louis Reeder, a Pennsylvania brick and stone mason who knew a good thing when he saw it. When he arrived in Helena, the first miners and gold seekers had already staked their claims along Last Chance Gulch in 1864. Reeder was among the other newcomers who came to Helena for opportunities beyond prospecting. He showed up in 1867 and immediately signed on to help build Helena's firsts brick courthouse. The gold camp continued to offer many other building projects and Reeder began to invest in property and development. By 1872, he owned a number of lots on West Cutler Street where he constructed a series of small tenements and bunkhouses that catered to single miners. By 1884, the collection of brick and stone buildings that today are nestled along the steep slope of Reeder's Alley were in place. The neighborhood hasn't changed much since Reeder's time. Below the hilltop structures along the slope are Reeder's distinctive red brick tenements. The Stonehouse Restaurant at the top of the hill was originally three separate buildings, the largest of which was once partitioned into four small apartments. Another building, now a private dining room, was once a two-story dwelling. Reeder, an immigrant who traveled to this country in search of a new beginning and became a true entrepreneur, is associated with building Reeder's Alley, which has become one of Helena's most popular tourist attractions, as well as many other buildings in the Helena area.",
  "I really enjoyed walking by the little cabins and reading plaques about the history items inside. It amazes me what wonderful buildings people could build in the side of a hard hill. Walking all around the small area was fun and if you go up top you can have a bite to eat or maybe a beverage in a very rugged, unique place.",
  "This is a beautiful neighborhood. It started with four hungry miners. They decided to take a \"Last Chance.\" They went to find gold. That was their last chance. They became rich: 19 million dollars. This is why these neighborhood is do beautiful.\n\nMost of the homes have red bricks. There are nice flowers as well.\n\nIt is attractive and the Morelli bridge still stands.\n\nThis is a must see. It is for free.",
  "You've got to stop by this place. The history is so cool! Don't pass this by. A good reminder of how spoiled we are with modern conveniences and comforts. ",
  "This is a very short jaunt up one side and down in the middle of this historical Reeder's Alley. Brick buildings look to be in fairly good shape, so glad the city saved this historical area. Well worth your time in Helena.",
  "This seems like a perfect date-night kind of a place. Dinner at Karmadillos, walk through a picturesque alley of historic row houses,  and pretty scenery to snap a few pictures--albeit on your phone ;) Love it! \n\n",
  "Unless you’re needing the specialty shops for something, you walk up Reeder’s Alley and you walk down. That’s about it. There are a couple food options depending on the time of day."
 ]
},{
 "name": "Blackfoot River Brewing Co",
 "address": "66 S Park Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/ce/a1/40/blackfoot-river-brewing.jpg",
 "tags": [
  "brewery",
  "free",
  "family",
  "brewery",
  "brewery",
  "brewery",
  "free",
  "eat",
  "food",
  "walking",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d3398779-Reviews-Blackfoot_River_Brewing_Co-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "A nice variety of brews, I'm always happy when Steamboat lager is on tap. Interesting cask conditioned beer is always offered. I am greeted by name when recognized. Blackfoot sets the standard for what a local brewery should be!",
  "Would highly recommend to anyone coming through town. Great building with an outdoor patio and the availability of the taster flights makes it a place you shouldn’t skip. Really enjoy their cream ale and the Scottish Ale. ",
  "Great little place downtown with a great bunch of beers brewed on site. Roof top deck over the street. Family friendly with free popcorn.",
  "Really nice brewery. Have a very good section of local brews with seasonal options. I always get my growler fills here.",
  "When in different cities, I always like to hit as many breweries as I can and sample their beers. So, while in Helena for one day, I stopped in here after visiting another brewery. Great selection of beers and the staff was awesome. If I had to pick a favorite, would have to go with their red......",
  "A nice variety of brews, I'm always happy when Steamboat lager is on tap. Interesting cask conditioned beer is always offered. I am greeted by name when recognized. Blackfoot sets the standard for what a local brewery should be!",
  "Had a couple of beers with co-workers recently and a variety of beer was consumed at the table. Everyone had positive comments to make about their selection. I had the cream ale and absolutely loved it. Would go back again just for that beer. No food offered just free popcorn. You can run next door to the pizza place to get something to eat and bring it back but I wasn't impressed by the pizza place.\nWould be super nice to have food available, maybe even a food truck outside  or even a variety of trucks on a rotating schedule.\nFast and attentive service, no complaints there",
  "This brewery has been around for 20 years or just over and certainly has been in the microbrew game for a while. They are a well-established beer in the area and have some great beers on tap. We started with a flight and worked our way to the pours. On top of having a great logo, the staff is friendly and they had some of my favorite beer in the area. They are within walking distance from the city center which makes it an even easier place to try out when you are visiting. I enjoyed their darker beers but they have a great range to try."
 ]
},{
 "name": "Ten Mile Creek Brewery",
 "address": "46 N Last Chance Gulch",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/65/f7/9a/bar-nov-28-2017.jpg",
 "tags": [
  "walk",
  "brewery",
  "music",
  "food",
  "free",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d9569947-Reviews-Ten_Mile_Creek_Brewery-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Was in town for business and made the walk to this brewery.....pretty cool place! Since I am from out of town I tried their flight of beers and was not disappointed. Their blonde was probably average to me, their red was above average......BUT, their \"Wee Heavy\" sour was outstanding. Just a great, great beer. When I come back to Helena, I will certainly be back!",
  "Good, friendly service. Nice atmosephere. A place, solo or with friends, that would be nice to linger. A wide variety of I.P.A was offered, I espescially enjoyed the Wood Knocker.",
  "This is clearly a busy and popular place in the downtown city center area. They have a long and narrow location that can get packed in pretty quickly. The service was friendly and we did a few different samples but nothing struck our fancy for a full pour. If you are able to get a table outside that is a bonus. I think that if you are in the area and looking for a brewery you should certainly swing by and give this place a try to see what you might like on the list.",
  "My wife and I met some of her colleagues for beer and what we thought would be appetizers.  It turns out the only food they had was pretzels. I had 2 beers, an ipa and a pale ale (summer time). Both beers were average at best compared to other Montana microbrews. We did enjoy the live music and company but probably won't make a special effort to come back.",
  "Stopped in during a huge storm with family. Super friendly service - we were allowed to try before getting a full pint. We didn’t have kids in our group, but there were folks who had kids and there’s a little play area set in the back. I’d definitely go back - if you sign up for the free WiFi, you get an email offering you a free pint on your next visit!"
 ]
},{
 "name": "Helena National Forest",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/a9/ce/89/helena-national-forest.jpg",
 "tags": [
  "hike",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d108386-Reviews-Helena_National_Forest-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This area provides beautiful vistas of plains with sagebrush and grass and evergreen trees like lodgepole pine and Douglas fir.  It is home to a large variety of wildlife native to Montana like:  Grizzles, black bear, wolves, bobcats, deer, elk big horn sheep. and antelope.  There are hiking trails available.  We crossed through it on Route 15.  It is a beautiful drive.  Along the way we saw mule deer and some hawks but not much else as the wildlife is pretty elusive. We took our time and enjoyed the beauty of the Forest.",
  "I really thought we'd see more wildlife but Mule deer, butterflies,  hummingbirds,  and cows were it for me.  Nonetheless a really scenic place.  Dirt roads.  Changing terrain.   Streams, Missouri River.  Hiking.  Quiet!  Loved it.",
  "It’s April 25, 2020 and my kids and I just returned from the Trout Creek Canyon hike! Thank you for the recommendation! What spectacular geology! One section of the trail was like a fairy forest, in which the trees were draped in hanging moss. A large part of the trail had thick green moss covering the rocky cliffs alongside, which is pretty special to see in Montana, east of Helena. The entire trail follows an interesting stream that meanders amusingly every which way. I love water and moist forests, so I was in my element! We did have to cross the stream multiple times that required balancing on rocks and wet logs, or just leaping and getting wet shoes.  I'm a not-so-in-shape 58-year-old and there were a couple of funny moments of stream crossing for me (got on video, of course, for repeated humiliation far into the future!). My daughters, especially my 18-year-old, navigated the stream and the hike much better.  The only wildlife we saw was a rock climber :). No flowers yet, but there was a lovely pussy willow bush! We made it to the end (3 miles each way) in a total of 4 hours, but the trail ends anti-climatically, at a corral with bad energy, in my opinion. We all agreed that the first half of the hike is the best. If you turn around just before the path veers upward to the left and turns stony, you've won't have missed much unless you’re the kind that can't pass up a challenge. The first 1/2 mile or so would easily accommodate a wheelchair. When I got home, I crawled into a hot epsom salt bath, relieved that it was over, but grateful that I went.",
  "We had fun in the Helena National Forest.\n\nThere were lots of trees and we even found a river.\n\nWe also found a camping site.\n\nWe felt small compared with the forest.\n\nWorthwhile to visit!",
  "This area provides beautiful vistas of plains with sagebrush and grass and evergreen trees like lodgepole pine and Douglas fir.  It is home to a large variety of wildlife native to Montana like:  Grizzles, black bear, wolves, bobcats, deer, elk big horn sheep. and antelope.  There are hiking trails available.  We crossed through it on Route 15.  It is a beautiful drive.  Along the way we saw mule deer and some hawks but not much else as the wildlife is pretty elusive. We took our time and enjoyed the beauty of the Forest.",
  "We attempted to visit the National Forest but found most of the roads closed.  The campgrounds have had most of the large trees removed and are pretty bleak.",
  "I really thought we'd see more wildlife but Mule deer, butterflies,  hummingbirds,  and cows were it for me.  Nonetheless a really scenic place.  Dirt roads.  Changing terrain.   Streams, Missouri River.  Hiking.  Quiet!  Loved it."
 ]
},{
 "name": "Spring Meadow Lake State Park",
 "address": "2715 Country Club Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/eb/b3/a6/watch-the-bobber.jpg",
 "tags": [
  "walking",
  "walking",
  "walk",
  "hike",
  "nature",
  "kids",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d7184493-Reviews-Spring_Meadow_Lake_State_Park-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Spring Meadow Lake State Park is truly beautiful, thanks to the lake and the mountains.\n\nThere is the opportunity to use a boat on the lake.\n\nI liked the geese with its new youngs.\n\nThere are restrooms and parking.\n\nThe trees are really high.\n\nI enjoyed my time here.\n\nWorthwhile to see!",
  "We spent about two hours walking around the park, beautiful park! Really close to downtown, lots of parking. Really easy walking, lots of birds to see.",
  "Spring Meadow is located west of Helena and is a very nice park to visit and to hike around.  It is hard to believe that this area was once a gravel pit and the site of a factory.  It now has a man made lake used for fishing, boating, and picnicking.  The lake is very deep and very clear and home of a good variety of fish.  Nice to see kids fishing.   We enjoyed the short nature walk on the walking path.  There are no lifeguards, no dogs allowed, and glass bottles are not allowed also.  Very restful spot.",
  "The park is gorgeous with a nice pavilion for family gatherings, well maintained and clean waters. Gorgeous views.",
  "We birded our way around the lake.  It's just less than a mile but paved most of the way as it wends though willows and across bridges.  Fishing, swimming for kids, picnic tables, a large lawn with nice restrooms throughout.  "
 ]
},{
 "name": "Holter Lake",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/18/38/f3/montana-skies-at-holter.jpg",
 "tags": [
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d630128-Reviews-Holter_Lake-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The campground is beautiful and well maintained but the camp hosts are the rudest we’ve ever encountered. They harassed us non stop all weekend. All we wanted to do was have a place to camp at night and fish during the day. The hosts harassed us saying we didn’t stay the first night at the campsite, which we did. They harassed us about the location of a tent in one of the campgrounds. The woman even told us they didn’t want our kind there. We are middle aged and were not causing any problems and we always leave a clean campsite. These camp hosts need to be replaced with hosts who aren’t power playing!",
  "Had fun relaxing and watching my daughter play campfire mornings hot coffee and breakfast. Great campsite. Maybe on the spending side but all in all it's not bad.",
  "We've lived in Montana for over 20 years. We go once a year for a day or two. \nWe went to our family favorite camp spot. 8am, was greetd by two elderly people who told us 5$ per-day, per-person.\nWe told them no it's never been like that. Instead of explaining the new rules and the fact the state came in.\nWe were insaulted with \n\"You city folk wouldn't know\"\nCity? We're from a small town. Looking to get away from work and family.\n10$ for two people staying for the \"DAY\"....\nWish we knew that.\n   But you didn't tell us it's 15$ for a night. \nWe left as you asked and found an ATM and got the \"\"10$\"\"\nCame back set up camp. Relaxed. \nWho rolls up? The elderly couple. Did you pay? Fill this out. Did you know?\nBy the way it's 15$ to camp.\nWell you got no information from us and 10$\nIt got worse.. they drove though every hour&half to harass people and tell us about this or that.\nWorst part, My husband and I work everyday a week non-stop. Do you think we want to talk to you? Or deal with people?\nWe knew it was annoying, but when our dog started growing at the arrival of you two..... really?\nShe is a quite wonderful, no barking dog who loves everyone.\nBut she sure didn't like the harassment either.\nWhen they wern't around we had a Great Time! \nSun. Views. Hiking. Watching people catch fish. Swimming. Cooking. <3\n\nFYI. Bring 20-60$ for \"fees\" \nExpect- Watching harassment lake Holter Jerry Springer from your tent or RV.",
  "Camp host extremely  rude and obnoxious stating that we had not occupied our trailer while it was in the campground as some other had done to save the spot for the weekend.  We made it clear to him that we had stayed there each night and fished the river during the day, but it was apparent he didn’t believe us thus ruining our last night there.  He proceeded to mow our area as we sat in our lawn chairs and watched this arrogant little man continue to promote his authority over us!   I hope he is not there next year!  Other than that, it truly is a great campground.",
  "Beautiful, peaceful location. Great for boating. Clean campground and restrooms. Would have given it a five but there were limited hiking trails."
 ]
},{
 "name": "Snow Hop Brewery",
 "address": "665 Barney St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/f3/22/f2/flagship-beers.jpg",
 "tags": [
  "tasting",
  "brewery",
  "pets",
  "brewery",
  "delicious",
  "tasting",
  "brewery",
  "pets",
  "brewery",
  "delicious",
  "unique",
  "brewery",
  "brewery",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d14007759-Reviews-Snow_Hop_Brewery-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Snow Hop is the fourth of Helena's five breweries.  It's a small brewery with a very nice tasting room located at the northern edge of Helena in the Cottonwood Corners commercial area.\nWe visited on a Sunday afternoon.  There were some families with children and some adult couples and singles.\nThe atmosphere is quiet but not dead.  Children can be a bit boisterous, but we saw and heard no rowdy adults.  Conversation is the activity of choice, and board games are also popular; watching sports on TV is not.  The clientele at the time we visited consisted mostly of adults in their thirties and forties, some with and some without children.  Soft drinks are available.\nThe beers are very good.  Their IPA is excellent, but their signature beer is a Polish-style grodziskie -- a beer made from oak-smoked wheat malt.  Some people go out of their way to find it; I found it a bit too smoky and preferred the IPA.  The brewery also offers several other brews, including a Koelsch, an amber, and others.\nNote: On Mondays, growler fills are $1 off.\nThis is not a romantic rendezvous, but it can be a good refreshment stop for couples.",
  "We went to snow hop brewery tonight for a local artists album release.  This is a really nice brewery with a great selection of yummy beers.  I had the Munich Helles which was smooth and delicious.  The place was packed for the album release but the service was great and root on.  Miles of smiles!  They've got tons of inside seating and a great outdoor patio where pets are welcome.  We can't wait to return. ",
  "Snow Hop is the fourth of Helena's five breweries.  It's a small brewery with a very nice tasting room located at the northern edge of Helena in the Cottonwood Corners commercial area.\nWe visited on a Sunday afternoon.  There were some families with children and some adult couples and singles.\nThe atmosphere is quiet but not dead.  Children can be a bit boisterous, but we saw and heard no rowdy adults.  Conversation is the activity of choice, and board games are also popular; watching sports on TV is not.  The clientele at the time we visited consisted mostly of adults in their thirties and forties, some with and some without children.  Soft drinks are available.\nThe beers are very good.  Their IPA is excellent, but their signature beer is a Polish-style grodziskie -- a beer made from oak-smoked wheat malt.  Some people go out of their way to find it; I found it a bit too smoky and preferred the IPA.  The brewery also offers several other brews, including a Koelsch, an amber, and others.\nNote: On Mondays, growler fills are $1 off.\nThis is not a romantic rendezvous, but it can be a good refreshment stop for couples.",
  "Best Ipa in MT in my opinion.  Best red beer I've ever had as well.  Sorry to hear they are closing.  Cheers.",
  "We went to snow hop brewery tonight for a local artists album release.  This is a really nice brewery with a great selection of yummy beers.  I had the Munich Helles which was smooth and delicious.  The place was packed for the album release but the service was great and root on.  Miles of smiles!  They've got tons of inside seating and a great outdoor patio where pets are welcome.  We can't wait to return. ",
  "I love this brewery! They have a unique modern style with a great deck, located just south of a Helena neighborhood. Snow Hop has the best craft brews in Helena. And their service is top notch!",
  "Had a hard time finding it as it is tucked intp a small industrial like area on the north end of town but once you are there its a great little brewery-modern, friendly with European inspired beers you make not find anywhere else in town-my favorite being the smoke wheat Polish beer . The Steller IPA is awesome as well. Have been back several times.",
  "This is a really fun new Brewery in Helena. Their Stellar IPA is so delicious. I love the fruity finish. But the weissbier is also delicious! My husband is crazy for the dark porter. \nThey have great seating and the taproom design is so nice."
 ]
},{
 "name": "Great Divide Montana Ski Area",
 "address": "7385 Belmont Drive",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/13/e1/b4/night-skiing-at-great.jpg",
 "tags": [
  "kids",
  "family",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d481544-Reviews-Great_Divide_Montana_Ski_Area-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "I'll never go back to this place again.  Drove to Helena with the kids to spend the weekend with my sister and we went to Great Divide.  I hadn't  planned on having the kids take a ski lesson but when we got to the ski area my sister suggested it.  So, I mentioned to the girl working in the ticket office that I was from Belgrade and had some questions regarding lessons for the day.  I was then shocked when the girl said in a real snotty voice, \"why don't you just take your kids to Bridger.\"  Needless to say we decided to ski for the afternoon but skipped the lessons.  Now I should say that when we walked out of the ticket office a real nice older lady who told us she was an instructor basically apologized and said that the only reason the girl has a job at the ski area is because her dad owns the place.  Like I said I won't be back to this little ski hill.  Instead, my husband and I will take our kids to Bridger Bowl where they know how to treat people right. ",
  "We live in Helena, and love Great Divide.  I'm a telemark skier, and my wife is a snowboarder.  We're retired, and have flexibility to go to Great Divide during the weekdays.\n\nIf and when the snow is good (it can be spotty), it's a great place for a relaxed day on the snow.  Old lifts, limited facilities.  But a true Montana experience.\n\nOne of the best things is that Great Divide's lift prices are pretty much unbeatable these days.  When we feel like skiing/boarding only a short time, we can buy lift tickets for just two hours (they sell by the hour, 10 dollars per hour).  Perfect.  Compare that to $140 at Big Sky.  \n\nThe vibe at Great Divide is friendly and relaxed.  Rarely any lift lines.  Few of the skiers or boarders have bad attitudes.",
  "It is better to ski all day than to stand in lines!  Try out the fun smaller ski slopes in Montana!  I love to cross country ski - no lines ever!",
  "Nice little gem with enough terrain for all!  Excellent area for lunch (we bring our own) to avoid lines which really aren’t bad.  Excellent snow all winter",
  "Great place for a family to learn to ski.  Bring your own picnic lunch or buy hamburgers or hot dogs in the lodge."
 ]
},{
 "name": "Hauser Lake",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/a1/8b/24/filename-img-3595-jpg.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d126581-Reviews-Hauser_Lake-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a beautiful Houser lake. Many come here on boat to enjoy.\n\nThe dam goes into the Hauser Lake as well.\n\nI like Montana. They have lots of lakes, but this one is even more attractive.\n\nWorthwhile to see!",
  "We crossed the dam and took the trail down to the river below the dam. It was beautiful and clean. The dam looked amazing and it was just a wonderful experience on a very gorgeous day. The campsites on the lake looked so nice too! We may come back and camp another time!!",
  "Everything the Missouri River is about, just and extension of the series of lakes along the Mighty MO.\n",
  "This is a beautiful Houser lake. Many come here on boat to enjoy.\n\nThe dam goes into the Hauser Lake as well.\n\nI like Montana. They have lots of lakes, but this one is even more attractive.\n\nWorthwhile to see!",
  "I want to write just a note here that this lake is not accessible by a paved road. One can get to Lake Helena, but after that is gravel road. No one wrote on any review how long that gravel road would be, so I did not visit even though it was on my list to see. ",
  "This is a very beautiful area, and probably most enjoyable if you have your own boat.  Fishing from shore not very successful in summer due to congestion of people.  Close to Helena.  Suggest best for day use unless you enjoy camping with tons of other people all around you.",
  "We crossed the dam and took the trail down to the river below the dam. It was beautiful and clean. The dam looked amazing and it was just a wonderful experience on a very gorgeous day. The campsites on the lake looked so nice too! We may come back and camp another time!!",
  "Everything the Missouri River is about, just and extension of the series of lakes along the Mighty MO.\n"
 ]
},{
 "name": "Spokane Bar Sapphire Mine & Gold Fever Rock Shop",
 "address": "5360 Castles Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/15/11/08/the-cutter-cutting-the.jpg",
 "tags": [
  "free",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d481542-Reviews-Spokane_Bar_Sapphire_Mine_Gold_Fever_Rock_Shop-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was Enjoyable if it wasn't so dang Hot we Dug gravel and sorted and decided too take the rest home",
  "I've gone to this mine for 45 years. I haven't been there in 10 years give it take. Always was fun and took for hours to where we brought the rest of the sack home to finish going through the rocks. Now I know that when one is either gold or sapphire mining it is a gamble. With that being said, I would never return to this establishment again. A bag of rocks cost us $100.00 and was done in two hours! I questioned the owner that the rocks were different, the flakes of the rubies, to there used to have tons in a bag as well as many different colors. There was only clear. I was told a different cut in the mountain. But mind you one of the other owners was in the employee room sapphire mining. The whole thing was just fishy/off from 40+ years that I knew. There is other places in Montana I would advise checking them out.",
  "I have visited several places in Montana that offer bags of pebbles you can sift through searching for sapphires.  This one is the very best.  We took our friend there so she could experience doing something distinctly of the beaten path and really fun.  It is an old cabin out in the middle of nowhere (but still fairly close to Helena).  You will talk about this experience for a long time and you probably will find some cool stones.",
  "This is a great spot to take out of town visitors or children. The staff will help you with everything and show you what to look for in your precious gravel. Everyone always finds something; often real treasures. The ride out and the scenery there are beautiful and just a short hop from Helena . The best part is you can go again and again and still enjoy the exoerience",
  "I took my kids and their cousins out there while on a trip to Helena for a Family Reuinion. I got the $75 bag for them to share. I think they each came away with maybe one or two sapphires, none of them big enough to cut or of any quality. Plus, when the guy showed us how to do it and what to look for, he picked out a clear stone from the gravel, which my son put in his little bag. That got us all excited to get to work and in the end it wasn't even a sapphire. It was just a piece of quartz.The kids went away very disappointed. It's a fun family activity, but DON'T WASTE YOUR MONEY HERE! Go to a different mine. It's not that the kids didn't know what to look for, either. We had been down near Virginia City and they sifted through some sand off the side of the road and came away with a handful each of little garnets for free."
 ]
},{
 "name": "Black Sandy State Park",
 "address": "6563 Hauser Dam Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/50/47/66/black-sandy-state-park.jpg",
 "tags": [
  "food",
  "food",
  "parks",
  "kids",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d7134674-Reviews-Black_Sandy_State_Park-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Black Sandy State Park is for boating on the lake. The lake is beautiful! What a great fun to be in the lake.\n\nHowever, there are picnic tables and people stay there st the lake and at the mountains.\n\nI liked the mountains that surrounded us and the beautiful lake.\n\nWorthwhile to see!",
  "Black Sandy is located about 15 miles from Helena, to the North in Lewis and Clark County.  It is located along Lake Hauser which was formed by the Hauser Dam.  It is more or less an area for camping with camp site after camp sight, but the lake is beautiful and a great spot for boating and fishing.  There really are no concessions for food or water, so we walked a bit and moved on.",
  "Rangers are amazing, beautiful area, well maintained! We were so pleased with how well they take care of the park",
  "It's a nice lake, frequented by people with their own boats. I didn't see any services there: no food, water or boat rentals. And it was *HOT*. ",
  "I'm sorry to say that this park was a huge disappointment.  We arrived anticipating trees and semi private spaces, like most national parks.  The sites are side by side with no separation, and not many trees.  There was no feeling like being in a national park at all.  Proximity to the lake would, I suppose make it good for people with kids, or those fishing.  For people who are thinking that this park will give them a sense of being 'in nature', perhaps consider finding another location."
 ]
},{
 "name": "Helena Valley Reservoir",
 "address": "Helena Regulating Reservoir Road",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/e3/1f/b8/helena-valley-reservoir.jpg",
 "tags": [
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d12641373-Reviews-Helena_Valley_Reservoir-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We decided to go the Helena Valley Reservoir. It was a bit far from the city, buy it was worthwhile.\n\nWhen we arrived, we were greeted with lots of yellow flowers.\n\nThere was a shelter there as well.\n\nHowever, the best part was the Helena Valley Reservoir. It was gorgeous!\n\nWe had lots of reflections in the reservoir.\n\nThere were mountains nearby.\n\nBefore I left, I saw an antelope.",
  "In riding around the Helena area we visited Helena River Reservoir which is about 4 miles out of town to the west of the Canyon Ferry Dam on the big Missouri.Even though it provides Helena drinking water and water for irrigation, it is used for recreation like fishing and boating.  Nice place for our picnic lunch.",
  "Access is somewhat limited but there are picnic tables for those brave enough to face the mosquitoes.",
  "Even out of summer or migration season the varied habitats seem to be good for birds.  It’s quite a long walk all the way around, with quite a long section away from the water’s edge (maybe 5-6 miles in all?), but definitely worthwhile for interested birders.",
  "I enjoy walking the short trails that lead around the reservoir. The reservoir attracts many waterfowl, resident and migrating, throughout the year. \n\nMotorized boats are prohibited on the water as are swimming dogs. Fishing, kayaking, and just watching the beautiful sunsets across the Helena valley are reasons to visit."
 ]
},{
 "name": "ExplorationWorks",
 "address": "995 Carousel Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0b/57/12/explorationworks.jpg",
 "tags": [
  "kids",
  "learn",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d3673861-Reviews-ExplorationWorks-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Would definitely recommend to families with young children. The water area is my nephew’s favourite place in exploration works and he would spend all day there if he could. ",
  "After a long week of traveling this was a great place to stop with our kids.  It's reasonably priced and has two floors of activities.  The best feature is the giant water table that my kids spent a good hour playing in.  There's a great area for having lunch, a great lego playing area, and a great area for smaller kids to play.  We would visit here again if we come back to Helena.",
  "The Exploration Works is a great stopping point with the kids. They have a number of fun items for them to play with, and to learn from. I highly recommend it as an educational/fun place to go with kids.",
  "What’s the best way to start children toward a future in Engineering and Science?, make it FUN, they will never know that they are learning.  The center is super involving for kids, many action based exhibits and helpful personnel. FANTASTIC!!!",
  "Not as great as I thought it would be. Only 2 floors with very little to do. An okay way to burn an hour."
 ]
},{
 "name": "Last Chance Ranch",
 "address": "2884 Grizzly Gulch Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/d9/7f/df/last-chance-ranch.jpg",
 "tags": [
  "family",
  "knowledgeable",
  "eat",
  "food",
  "delicious",
  "music",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d2091097-Reviews-Last_Chance_Ranch-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Gals were helpful, knowledgeable and caring.\nHelped our family and dog choose a family friend and playmate.",
  "What a beautiful scenic ride to the wagons and then more beauty in the horse drawn wagon along the dirt road. While seated we enjoyed being serenaded by Bruce. we enjoyed the most delicious sit down meal of the absolute best prime rib i have had... more food than i could eat! I did save room for the huckleberry cheesecake. Finishing up with more music..The service and experience was excellent and had a true feeling of a Montana experience.",
  "The food is excellent and plentiful. The wagon ride is fun. Finally the original music by the owner/guide/ entertainer is something you have to experience!",
  "An excellent journey to western hospitality. Prime Rib dinner and western campfire entertainment from your host. Country stories and country songs. Your evening starts with a bus ride to the gates of Last Chance Ranch. From there you board a horse drawn bus to your dinner in the woods in the ranch. Your dinner is served in a beautiful pavilion made of wood with a wrap around deck. After dinner and desert you adjourn to the campfire for song and stories by your host and ranch owner. Guaranteed you will love your evening and look forward to returning. Make reservation way in advance and plan this evening with friends and loved ones. ",
  "I had the pleasure of going on the wagon ride dinner with my boyfriend and friends! The prime rib was the best I have ever had!! \n"
 ]
},{
 "name": "Memorial Park",
 "address": "1203 N Last Chance Gulch",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/5b/fe/fb/road-trip-god-send-beautiful.jpg",
 "tags": [
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45212-d17753820-Reviews-Memorial_Park-Helena_Montana.html",
 "source": "TripAdvisor",
 "reviews": [
  "There were many different memorials.\n\nThese are the ones I saw: First Special Service Force\n\nWWI and WWII\n\nLewis & Clark County Veterans Memorial\n\nThey wrote a part of the Bible: \"I will lift up mine eyes unto the hills, from whence cometh my help.\"\n\nThere were lots of pine trees and a path.\n\nAt the end of the park, there was a beautiful 3d attraction about the soldiers who died.\n\nNext to it was a swimming pool and there was also a playground, quite big.\n\nWorthwhile to see!",
  "This park is excellent! The playground is enviable-spacious enough that it didn’t feel crowded with 20+ people and a separate area for 2-5 year olds. It’s surrounded by a huge open field, a public pool, and of course, beautiful mountains. We were on a road trip with a toddler and stopped here for a bit to let her get her energy out and it made all the difference. It’s even across the street from Starbucks, so its location is great for adults too. "
 ]
}]
