[
{
 "name": "Diamond Head State Monument",
 "address": "18th Ave. Waikiki",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/b4/3f/55/diamond-head.jpg",
 "tags": [
  "walk",
  "hike",
  "walk",
  "history",
  "hike",
  "walk",
  "hike",
  "hike",
  "walk",
  "hike",
  "walking",
  "hike",
  "walk",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d107673-Reviews-Diamond_Head_State_Monument-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Diamond head park has excellent hiking trails that wind on the inside of the extinct volcanic crater, wind through WW2 tunnels and fortifications, and emerge on the crater rim to afford amazing views of Waikiki and the surrounding areas. Not strenuous hiking, but it iki s a healthy walk to the top.",
  "This hike was definitely brutal but doable.  The heat during the hike made it tough but we prevailed.  The views at the top are worth the hike.  At a point in the hike, you can either go right and walk up 99 steep steps which leads to a spiral staircase and small hole to climb through to get to the top or you can go left for an easier, gradual climb to the top.",
  "Totally Enjoyed this Great Hike up Diamond Head! Gorgeous views with ocean blue beautiful scenery & Learning a bit of history on the way! So Much Fun! I highly recommend early mornings! ",
  "We took the bus here and had a bit of a walk to get to the entrance.  It was a nice easy hike up the crater as there is a trail and stairs.  It didn't take too long to get to the top.    It had rained earlier in the day so there were many puddles and mud.  I wouldn't recommend going if it was raining.  It was a good hike to the top and seeing the bunker was interesting.  The view was great as you get a panoramic view.  I believe we paid $1 or $2 per person.  Bring a hat and sunscreen if you're going up when it's hot and sunny as there is no shade.  And make sure you go to the bathroom before you head up (there are bathrooms at the entrance) as there are no facilities once you start the ascent.  Wear sturdy shoes as it will be easier to hike up the parts that are just a dirt path and uneven surface.  And if it has been raining because there will be mud and puddles.  I saw people in flip flops and you could easily twist your ankle.",
  "This is a challenging but well worthwhile \"hike\". Wear the proper shoes as there are many slippery spots. Bring water ! If you take the public bus, there will still be a bit of an uphill walk to the entrance area, where you begin your hike up to Diamond Head. Taxis are available to and from the entrance. ",
  "One way up and one way down. Just a great experience if you are looking to get that one great picture in Hawaii. Do it early as it does get crowded and the climb is steep. wear boots or sneakers",
  "Nice hike, mildly challenging. My wife doesn't hike at all and had no problem with the trail. The views that you get at the top are completely worth the trip. I'd go earlier in the day before the bigger crowds show up. This is now on my to-do list for every future Hawaii trip I take.",
  "Go early - a lot of visitors come to this attraction so it can be very busy as the day goes on! We went mid morning and the path was pretty busy going up and going down, but it was still a very enjoyable hike! It was beautiful at the top and the 360 view was AMAZING! There is a steep stair portion, but also a longer flatter route to the top which is great for all hikers! Tasty treats at the bottom when you finish! Bring water and sun screen and solid walking shoes! We enjoyed the top for about 30 minutes, so I would factor at least 2 hours for the hike from start to finish!",
  "We walked to the crater from our hotel in Waikiki and then did the crater walk. It is very popular but it is still comfortable on the track. The walk can be strenuous towards the top of the crater, but we saw people of all ages on the track. Take water and take sun protection. Looking out over Waikiki and Honolulu with the ocean beyond from the top is well worth the effort. Get yourself a pineapple on the way home.",
  "This 1.8 mile round trip hike gains 452 feet and has various lookout points offering sublime 360-degree views of Honolulu and the East Side. However, it is the view from the summit that is the most rewarding – a nearly unobstructed view of the Waikiki Beach coastline and its endless collection of high rises. Check out the Hawaii blog in my bio for planning your next trip!",
  "We hiked to the top of Diamondhead midmorning. Lots of people but not overly crowded. The view is unforgettably beautiful."
 ]
},{
 "name": "Pearl Harbor National Memorial",
 "address": "1 Arizona Memorial Place",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/a6/07/e4/ww-ii-valor-in-the-pacific.jpg",
 "tags": [
  "kids",
  "history",
  "tour",
  "free",
  "walking",
  "tour",
  "history",
  "family",
  "walking",
  "food",
  "free",
  "historic",
  "tour",
  "tour",
  "history",
  "eat",
  "history",
  "food",
  "history",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d104662-Reviews-Pearl_Harbor_National_Memorial-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a memorial every American visiting Hawaii should not miss.  Even though I read complaints posted on TripAdvisor about not being able to visit the memorial itself, it still doesn't take away from the SIGNIFICANCE.  They show a movie about what led to the attack on Pearl Harbor which was well presented before going onboard a boat that takes you briefly around the harbor.  There is a lot to see here.  You can visit a museum detailing the history of the events happening in the Pacific at that time and what led up to the attack.  You can also visit both the World War II submarine, USS Bowfin and it's accompanying memorial to lost submariners and the submarine museum; next you can visit the battleship USS Missouri and excellent museum and where the Japanese surrendered.  There is also an air museum which we didn't have a chance this time to visit.  Kids 12 and up would get more out of this than young children and they should be exposed to this history and never forget it.\n\nI was lucky to meet a Pearl Harbor survivor, Sterling Cale.  He signed his book for us and I had my picture taken with him (no charge), so don't miss this and thank him for his service to our country.  ",
  "This is an almost sacred historical site to me.  Admission was free.  They do not allow any bags inside, including purses and fanny packs.  They have lockers where you can leave them during your tour.  There is a beautiful interpretive museum you can see along with historical markers and memorials, followed by an interpretive film and a boat ride to the USS Arizona Memorial.  The boat ride is operated by the US Navy.  The site also has a nice gift shop which is well-maintained and staffed.  There are several other related historical sites in the vicinity.  This is a “must-see” when visiting Hawaii.",
  "A very humbling experience being here. So much to be thankful for.  Thank you to our Roberts Hawaii tour guide, Jake \"From State Farm\", for sharing his wealth of knowledge and making the day special and interesting for all of us.\n \nI booked the tour through American Express about 1 month in advance.  We paid $160 per person which included the door-to-door service, the bus tour of Honolulu, walking exploration of Pacific History Park which included the USS Arizona Memorial, USS Bowfin, USS Battleship Missouri, and Pacific Aviation Museum. Lunch at the Pacific Aviation Museum was just under $60 for our family of 4.\n\nKeep in mind when you go it is going to be a full day, around 10 hours and worth every minute.\nThe Arizona Memorial was everything you would expect and you are limited to about 30 minutes there so spend your time wisely. Also, opt for the guided tour when you board the Battleship Missouri. You still have plenty of time to explore on your own.\n \nYou are not permitted to carry any type of bag or purse into the park or museum or leave them behind on the bus, so bring cash in case you need to rent a locker. Also, paying up front for reserved movie and shuttle tickets for the USS Arizona Memorial was a wise investment.\n \nThis is an experience my family will never forget.",
  "This was a priority destination and we enjoyed the whole day. Apologies for the long review but there were a lot of things good to know to make the most of this fantastic site. Here goes:\n\nTickets: After much confusing research we prebooked  the Passport to Pearl Harbor day pass $65US pp at Recreation.gov which gave us access to all 3 paid historic sites (submarine, battleship, aviation) and let us book a time for the free USS Arizona Memorial including audio tour ($7.50 each if purchased separately). When we collected our Arizona ticket on site (you may need ID) it had a \"P\" on it and became our Passport. The advantage to the Passport was that you could upgrade to a second day's visit (to be used within the next 7 days) for only $10 on site. We didn't do this, but could easily have spent another day. \n\nTransport: We knew that a commercial half day bus tour would not provide enough time, and feedback from fellow tourists was that they felt ripped off paying so much once they realised the memorial was free to visit. Public buses #20 or #42 went from Kuhio Ave in central Waikiki; we caught 42 next to our hotel Vive at around 5.50am, arrrived at PH at 7am  right to the door ($2.50pp one way, correct cash required). For the return we walked up out of the carpark to the main road and to the left on the PH side of the road. Bus #20 took us home leaving PH around 5pm. Easy peasy.\n\nSecurity/belongings: Check any backpacks etc for $3 each at a \"cabin\" to the right of the entrance before joining the entry queue as security checks come before the ticket counters. You can bring food and water, but use see through plastic bags, pockets and even straps to carry larger items like water bottles. Avoid opaque containers, even camera bags. (Tip:you can get plastic bags at the counters or gift shop once through security if you need to).\n\nOrder of visit: If you are doing everything in one day, it is important how you schedule your visit. Arizona and Bowfin are walking distance on the mainland, but Missouri and the Aviation Museum are on Ford Island which is a secure area visited only by a bus which operates in one direction outbound, last one returns 5pm from Aviation Museum back to mainland, and any time a bus is full you need to wait for the next one. Best bet is to visit Arizona asap, then Bowfin, before bussing to  Missouri, and Aviation Musum last. We saw people miss the Missouri because there was not enough time to go back from the Aviation Museum, to the mainland, then back to the Missouri (one way, remember!).\n\nUSS Arizona Memorial: after security, line up for your Arizona ticket first to get the earliest session possible (if you have not pre-booked). Earlier sessions are desirable because if weather turns bad, boat trips can be cancelled, which is more likely later in the day, plus later visits make visiting the other sites problematic.  11am was the earliest we could prebook, but BIG TIP: because it's a free booking sometimes people don't turn up, so you can line up at the Arizona waiting area in a special cordoned queue for standby entry from 9.30am. We went there at 7.30, asked the guard nicely, and we were lucky and got in for the 7.45 session. The 30min video was excellent, the boat ride calm, and the site very moving and beautiful.  Take the time to read the plaques, and to explore the related items back on land like the survivors area \"why them and not me\".\n\nUSS Bowfin: Claustrophobic but amazing and beautiful in parts. Well worth it. \n\nBattleship Missouri: Awesome: the Mighty Mo was a highlight. We spent a couple of hours there, and did the 35min guided tour, plus there were special displays on board like the Kamikazi display. Could have spent all day just here.\n\nPacific Aviation Museum: This is so very worth visiting - the range of aircraft in nearby hangars being repaired, information, displays etc was boggling. I can not stress enough how glad we were we allowed enough time for this, especially as it seemed very \"undervisited\" being the furthest attraction probably missed out by many people. My husband even used a coupon for a free flight simulation exercise that we found in a tourist brochure, which was a blast. Find the free photo booth where you can email yourself a good pic without selfie awkwardness. Left here on the 4pm bus but could have stayed for many more hours.\n\nOVERALL: Pearl Harbor is a must see. If your time allows: spend the day, get out to the Aviation Museum, don't forget to collect any checked bags on the way out, and have a great time.",
  "Our visit to Pearl Harbor was part of a tour package.  While we did spend 2-3 hours there, I could have easily spent 1/2 day!  So much to see - so much history or absorb - so much to take in.  It is a very moving tribute to those that served.  \n\nThere are no bags allowed and it's not advised to leave them in your car or on the bus.  They do have lockers available for a small fee.  You may take cameras but not the camera bag, so just be aware.",
  "They have you watch a 25 minute video prior to taking the ferry over to the Arizona. Very moving & really does offer some more history. While some may call Pearl Harbor a \"tourist attraction\" it truly is more than that, despite the presence of the gift shop. They honor those lost in a very respectful manner. If you have time plan to spend the day so you can see all the sites, AZ, Bowfin, Missouri, and go over to Ford Island. They do open at 7am. If you go & get on line early you will have time for everything. We arrived at 0700, the line was already a decent length, but were still able to obtain a pass for 0830. \n A few suggestions:  eat before you go & if you need caffeine in the morning get it prior to arrival. Food choices are limited to hotdogs, nachos & soup. There are vending machines that sell cold beverages only. Leave the large bags at home. Backpacks & large bags are not permitted, including camera cases. They do offer lockers for storage of these items for a $3 fee.",
  "Really enjoyed our visit here, could have probably done with longer, took in as many things as we could, it is well laid out and very well organised",
  "Loved it! Dive into one of the most pivotal moments in US history that dragged the United States into World War II. \n\nI strongly recommend making reservations in advance or you can find yourself struggling in a long queue on a busy weekend. Depending on your interest, you can spend from 1-3 hours exploring the memorials and museums. You can check my Oahu blog (link in bio) for more details on planning your Honolulu trip.",
  "If you are on Oahu, you have to check out this puiece of history, pay your respects to our fallen sailors, and support this memorial to a bitter past",
  "The memorial was so impactful to me and addd so much clarity as to how devastating the attack was to the harbor. to actually stand in the spot where the Arizona was and still is, is something that evryone should experience.",
  "The memorial at Pearl Harbour should be on everyones bucket list. \n\nWhilst sad its a memorial to the death of 2,335 military personnel, and 68 civilians during the bombing of Pearl Harbour on December 7 1941.\n\nThere are come great free museums as well as some great paid activities.\n\nWe enjoyed visiting the USS Bowfish Submarine and the USS Arizona Memorial."
 ]
},{
 "name": "Iolani Palace",
 "address": "364 S King St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/62/e4/18/iolani-palace.jpg",
 "tags": [
  "tour",
  "history",
  "learn",
  "knowledgeable",
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "family",
  "tour",
  "history",
  "nature",
  "history",
  "kids",
  "tour",
  "creative",
  "tour",
  "tour",
  "history",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d131980-Reviews-Iolani_Palace-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The guided tour of Iolani Palace built by King Kalakaua (Kamehameha V) was an excellent way to learn and appreciate the history of the Hawaiian monarchy before being annexed by the United States and the tragic imprisonment of the last Hawaiian monarch Queen Liliuokalani.  The docents are well-trained and very knowledgeable about the palace and its history, and appreciated the detailed look into the lives of Hawaiian royalty.  It was also fascinating in understanding King Kalakaua's relationship with Japan and why and how the Japanese Emperor and the King came to reach an agreement to bring Japanese immigrants to the islands 150 years ago.",
  "this is guided tour of a palace with very good background on the Hawaiian royalty... very interesting and our guide was wonderful and very passionate about the history and palace.  you tour the palace and then the bottom is like a museum and you can leisurely go thru a museum like experience......you must reserve in advance, I did about 3 weeks in advance.......parking is the only issue and is limited and you must have quarters for the meters and they do check very often.........we both enjoyed this tour very much but you really minimally need 1.5 hours and best for 2 or so hours",
  "A delightful peek into Hawaiian history and royalty - from the beautifully shaded and manicured grounds one enters the palace on the ground floor and takes a self-guided audio tour (my chosen option) or can be led on a tour of the building that has been lovingly restored and and continues to be furnished with original items as they are found at auctions and in collections around the world.\n\nThe incredible history of Hawaiian royalty and the legacy of the palace is palatable and the tour as detailed or simple as each user would like.\n\nI highly recommend a morning here as a nice counterpoint to shopping at Ala Moana or surfing Waikiki! ",
  "For anyone that appreciates history and would like to know more about how Hawaii came to be i would strongly encourage checking it out! This being the only Royal Palace in the US i was very intrigued to see what it was all about. We did a guided group tour and we pretty much went from room to room to look at all of the beautiful artifacts that have been recovered over the years. They do a good job of explaining what life was like then and what the royal family was like by providing ample context.\n\nTour was about 2 hours and was probably one of coolest things i did during my visit",
  "Thoroughly enjoyed the tour and the stories told by the docent. So much history both good and bad revealed. Palace treasures included much more than furniture dinnerware jewelry and dresses. I hope they can continue to find more items. I love to visit and discover more about the island royalty and history.",
  "Very interesting.  Great old building.  Fabulous old furniture.  Wonderful lesson on the history of HI.  Great stories about the creative nature of the HI people when their Queen was under arrest.  The tour guides are really great!!  Beautiful grounds and great places to sit and have a snack or lunch.  Esp when the Royal Hi Band is playing outside of the Palace on the grounds.  Plan to bring a picnic lunch and toss it in a locker while you take the tour.  Easy to get to by public bus.  Buy a ticket in advance (they are sold on line) and pay attention to the dress code.  No sandy feet, swim suits, nor wet shorts.  Not suitable for little kids.  They will be restless and bored.",
  "Went there on the city tour hop on hop off bus. It is so recognizable. It is a must see. The red bus is the one that goes by there.",
  "Extremely interesting if you want to learn more about the history and culture of Hawai'i. We had the guided tour and could not have had a better experience. She provided lots of details and anecdotes and answered all of our questions. The palace is beautiful and not to be missed! I do not recommend for young children however."
 ]
},{
 "name": "Hanauma Bay Nature Preserve",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/85/e0/34/hanauma-bay-nature-preserve.jpg",
 "tags": [
  "family",
  "educate",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d261241-Reviews-Hanauma_Bay_Nature_Preserve-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place takes your breath away with its beauty , what a stunning beach , perfect for snorkelling as there is many reefs there , also lots of people, its a great tourist attraction , and would definately go there again , had an amazing day at Hanauma Bay .",
  "We love snorkelling and every time we come to Hawaii we go snorkelling at this beautiful bay with its wonderful variety of fish and coral beautiful clear water, our granddaughters find it very easy to have a snorkel in this beautiful water  I recommend this for family and friends can’t wait to visit again.",
  "Reasonably priced secure storage (small) lockers for valuables and snorkel gear hire, make this an easy stop with some amazing sea life to see! Everything you need onsite - a must stop.",
  "A beautiful and peaceful beach to snorkel and relax. There is a special emphasis on teaching visitors about respecting the space via required intro video and exhibit. Humanana Bay also has the basics such as changing areas, restrooms and rental snorkeling equipment. I visited in the end of January so I was able to get in and find a parking spot during the early afternoon. During high season arriving earlier is better especially if you are driving as a limited number of visitors are permitted per day. Overall, I will definitely return! ",
  "We arrived by taking the BUS from right infront of our hotel.\nIt was an easy ride.\nThe park was wonderful and just a bit crowed. we had to watch a short video about the park and what to do. We were upset to see alot of families NOT adhering to the rules of no standing on the corals. \nWe snorkeled for a very long time.  a great  deal of life underwater. It was really fantastic. Made me very sad as this was our last day in Hawaii. I ALMOST Tore up my ticket to go home because of the  beauty of this day",
  "I hesitate to write a review about this place because I love my peaceful place and prefer less crowds. This is probably my favorite place to go on Oahu. Amazing fish and beautiful scenery. I love that they take time to educate visitors about protecting the reef. Note: if you stand on the reef, I will go Karen on you.",
  "Very beautiful with water that I have never seen before. Well maintained and a credit to the Islands echo management teams. ",
  "Great fish.  Lots to see.  Rent snorkel gear there or bring your own.  Lockers to store your valuables so you do not have to worry about the keys to the rent a car or your wallet.  Showers, rest rooms, and changing rooms.  Naturalists to help you tell what that cool fish was that you saw.  Life guards to help keep you safe.  Bring a lunch and snacks and drinks in a cooler (no glass). It is a long way back up the hill to get a snack.  The afternoons can be crowded so you might be happier if you made this a morning outing.  Spend the money and take the little shuttle bus down the hill and back up if you have a lot of stuff, little kids, or bad knees.  It is worth it!  "
 ]
},{
 "name": "Makapuu Lighthouse Trail",
 "address": "Near the Hawaii Kai Golf Course on Kalanianaole Highway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/73/49/45/makapu-u-lighthouse.jpg",
 "tags": [
  "hike",
  "hike",
  "walk",
  "hike",
  "hike",
  "hike",
  "hike",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d2664518-Reviews-Makapuu_Lighthouse_Trail-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "I would recommend doing this beautiful hike early in the morning or later in the evening (before or after the sun goes down). We ventured out and did this during the hottest part of the day. The trail is paved from the parking lot to the top, with NO shade (trees or other coverage) along the way. Don’t forget to apply a lot of SunBlock, comfy shoes, and bring A LOT OF WATER WITH YOU. There is a parking lot, by the looks of it has a total of less then 30spots, you can park on the side of the road too. It’ll take you a total of 30min to reach the top, take your time and enjoy some great Viewing Points along the way, the Beautiful Coastal Views, Makapuu Point, military pillboxes, giant tide pools, blowholes and Makapuu lighthouse.",
  "At the most easterly point of Oahu, Makapu'u Lighthouse and trail is a great, fairly easy hike, that rewards you with gorgeous vistas along the path - including Koko Crater, the Windward Coast and islets from Waimanalo to Kalua and beyond...\n\nIt's a fairly steep, paved trail that doubles back on itself, ascending nearly 500 feet over the course of roughly a mile. It is exposed, and dry (driest part of the island), so you need to have a hat, lots of sunscreen and plenty of water. It's also windy, so hold on to that hat! \n\nThe lighthouse itself is on a notch, blasted out below the peak, but you get a few different vantage points of it. It makes for some striking photos.\n\nOnce at the top, you are treated to additional views of the Windward Coast, as well as back toward Koko, with Diamond Head and Honolulu in the distance.\n\nDepending on breaks for photos, roughly 30-45 mins round trip.",
  "My husband and I loved this scenic walk which is all on a paved pathway making it accessable to everyone: wheelchairs, children, slight mobility issues, etc.  there are many places to sit and rest if needed but bring water as it can get very hot as the day goes on.  One tip I have is go early before 9 as parking can be a challenge and also the heat of the day as there is no shade.",
  "This trail is absolutely stunning. It is quite a climb but so worth it as the views from every angle of the glistening Pacific are amazing. During the months of December to April, the Humpback whales are making their anual journey from Alaska to breed in the warm Hawaiin waters and if you're lucky enough, you can see them everywhere. We were so close to them that we heard them spouting through their blow holes, which was magical.\nGet there early though as it gets very busy & bring water!",
  "It's a short and not challenging hike to the lighthouse where you have a panoramic view from Koko Head to Waimanalo.  In whale season (Nov-March) you may be lucky enough to see some humpbacks.  Easy to get to plenty of parking.  As always, wear sunscreen as it's hot an sunny most days.",
  "This hike was our favorite in terms of ease and for it’s spectacular views. We went during whale season and saw a humpback whale jumping out of the water several times in succession close to the shoreline! Also saw a turtle from far. The hike is uphill and in direct sunlight so bring sunscreen/hat/plenty of water but I was able to do it easily at 20 weeks pregnant. Can become highly trafficked through the day which can mean difficulties getting parking so go early if possible! Definitely a MUST do in Oahu! ",
  "This is a great \"hike\" to take to see the shore of Oahu and catch some glimpses of whales. It is a paved walkway with many outlook points. You can take it as fast or as slow as you want. We were lucky, there was quite a breeze and it was a bit cloudy. I think this could get very hot on a sunny warm day. But just soooo beautiful. Not to be missed.",
  "I am 61, have asthma, and due to several non-stop decades of martial arts training I need both hips replaced.  I hiked this path all the way to the top with relative ease.  I did take advantage of the provided benches to sit and rest my hips but in general I found this hike pretty easy and well worth the effort.  Go for it!",
  "This is a well-maintained, paved walking trail with wonderful views at times. It took us about 45 minutes to get to the top, and we took several short breaks along the way. There is almost no shade on the trail, so bring a hat and sunscreen and water. Parking is a problem and you may have to park on the side of the highway.",
  "I and my wife took 13/67 bus from Waikiki which took us all the way to sea life park. From there the light house trial is only half a mile of may be a mile away. Easy walk with amazing views of the ocean. We thoroughly enjoyed the walk from Sea life park to the lighthouse trial parking lot. We went there early in the morning by 7 am, the trial was easy and must do for all kinds of people with diff fitness levels. Incredible views on top. While coming back down I did notice that the parking was over crowded and people started parking on roads. I highly recommend people to take. One day “THE BUS” pass for 5.50$. You can use this on any bus / any route in Oahu. The bus also offers rides to most remote destinations you won’t imagine. ",
  "Although it is a paved path it is very steep so be aware that it takes some exertion to get up the hill. It was cloudy the day we went and we were still hot. The views going around the corner or excellent and some were watching for whales"
 ]
},{
 "name": "USS Arizona Memorial",
 "address": "1 Arizona Memorial Place",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/53/3d/12/20170519-080256-largejpg.jpg",
 "tags": [
  "active",
  "tour",
  "active",
  "tour",
  "history",
  "free",
  "eat",
  "wander",
  "food",
  "family",
  "parks",
  "tour",
  "walking",
  "eat",
  "history",
  "free",
  "tour",
  "walk",
  "learn",
  "history",
  "theatre",
  "active",
  "free",
  "historic",
  "tour",
  "tour",
  "history",
  "free",
  "tour",
  "tour",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d104386-Reviews-USS_Arizona_Memorial-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Pearl Harbour complex is well set out. Even though the entry fee seems expensive you do get value for money. The entry includes a boat tide to the USS Arizona, exploring the Bowfin submarine, a bus ride to Ford Island (active Naval Base), exploring the Missouri (battleship) and entry into the aviation museums. Very moving and memorable.",
  "Bought passport to Pearl Harbour which can be bought for US$72 online through recreation.gov\n\nThis provides admission to 4 partner sites and is well worth the money \n\nThe ticket included the audio tour headset, film and boat ride to memorial \n\nVery organised, well maintained, moving and informative. ",
  "Worth while and very humbling experience especially if you are history buff. At the Pearl Harbor National Memorial Visitor Center there are plenty of things to do. There’s the memorial of course but also 3 museums (which are amazing), 2 gift shops, a snack shop and a hot dog stand, the USS Bowfin submarine, the Pearl Harbor Aviation Museum and the USS Battleship Missouri.  There is also audio tours with a variety of languages and a virtual reality experience. Keep in the mind the only thing that is free is the Arizona Memorial tickets and also the Navy controls the ferry. \n\nWhen you go to the visitor center NO. BAGS. SERIOUSLY. Just don’t bring a bag. Look up Pearl Harbor Bag Policy.  There is bag storage but save yourself some money because they charge you PER bag\n\nHere is what you need:\n✅ Phone, wallet (with a photo ID of some kind- you are going to an active military base), camera, and water (Highly recommend water!!)\n\n✅ Jackets, hats, sunscreen, glasses cases, medical items, phone chargers/cords, strollers, wheelchairs, and other basic necessities are good\n\nGot baby stuff? Get a clear bag or just bring what you need for the time that your are there and put it at the bottom on the stroller but NO baby bag. \n\n✅ PRO TIP: Wear something with POCKETS or have a relatively see-through bag (Like a plastic bag, Zip-Loc bag or a stadium bag). Anything you can put in your pockets or hold in your hands. \n\nTo take a tour or not to take a tour: \n\nTickets for the AZ Memorial are free but LIMITED. Only 1300 a day and once they’re out, that’s it. You can go early, like 6:30am, before they open and stand in line to try and get early tickets or you can, say for example, get there around 9am and get 2PM tickets (or there may not be tickets at all depending on how busy it is). If you don’t care about waiting, then cool but the tour companies will pick you up in Waikiki at your hotel, drive you out, grab the tickets, explain things and take you back to waikiki all the while giving you a tour along the way about things you maybe didn’t know about about Hawai’i. They practically do everything for you. \n\nDO YOUR OWN RESEARCH, I can’t emphasize this enough.  Pick the company that best suites you in terms of what’s included, timing and price.  Check tour websites and the Pearl Harbor website for more info. Busy times of the year Summer and Winter and those times, you, 100%, will want to book a tour unless you don’t mind getting up early. Depends on your personal preference and what you want to do. \n\nAlso when booking through a travel agent, find out WHICH TOUR COMPANY is picking you up and find out the color of the vehicle. Tour company and travel agent companies are 2 very different entities. \nI would even suggest further to CALL the tour company yourself to confirm your reservation with them, confirm the amount of people in your party, pick up location and time of pick up. The company can give you more specific information. Again, do your own research because this will make a difference when it comes to peace of mind and don’t assume everything will work itself out. Just trust me on this because there can be miscommunication. \n\nI’m here to give you tips and also because i think it’s important to be informed. The rangers and ambassadors (the visitor center workers) are fantastic, extremely helpful and informational and they will gladly assist you and answer your questions.\n\nMy only real complaint is the bathroom locks.  When people slam the doors, it jiggles the lock open and then the door opens on you while using the restroom and someone walks in on you doing your thing. It’s happened several occasions. One of the bathroom stalls I have to use my foot to lift the door so it will lock properly.",
  "At the recommendation of family, we booked this tour through a tour company instead of journeying there on our own. In hindsight, we easily could have managed this on our own. The tour company really didn't do anything other than provide transportation and secure the tickets.\n\nThat said, we arrived there mid-morning on an overcast day. Immediately we were told we couldn't carry anything - including purses - on to the grounds so we had to check our backpack. We kept a wallet, a cell phone and a camera (without its case). We walked around the park area reading the signs and envisioning the chaos and distruction of the day. We didn't realize that you needed a separate ticket to board the submarine so we skipped that. \n\nYou must see the video before boarding the boat for the short ride to the Arizona memorial. We had been advised by our guide to line up early for our 10:30 video. He told us to sit in the auditorium as close as possible to the exit so that we were among the first to exit and board the boat. He also said to sit on the dock-side of the boat for the best photo options and he was right.\n\nThe boat ride is roughly 5-10 minutes and was chilly - I was wishing I had brought a jacket with me. We disembarked at the memorial and were ushered into the memorial as another group was lined up to leave on the boat we had arrived on. It is a very orchestrated scene. A very knowledgable National Parks guide welcomed our group and provided a great description of what we were seeing. He then gave us a few minutes to look around on our own. Then our group was instructed to line up for departure as another boat of visitors approached. There was not a great deal of time for reflection before we were politely ushered back to the boat. Our group was respectful and reverent though - something I appreciated greatly.\n\nUpon return, we had time to wander around the grounds and the requisite gift shop before our guided tour departed for the USS Missouri battleship. We spent the rest of the day touring almost all of it. I was worn out but this was right up my husband's alley as a former reservist in the Navy. So I perservered! \n\nI was disappointed in the very limited food options all along the way. I eat healthy and had literally no options at any of the food vendors along the way. On top of that, I had packed my \"healthy\" lunch in my backpack, which was still locked in storage back at the national park service. \n\nWhile I have deep appreciation for what was represented by the memorials and the Battleship tour, I think this could have easily been done in half a day versus the whole day that we had scheduled. However, this was the whole reason my husband wanted to spend time on this particular island so I was perfectly happy to indulge him. Afterall, he was the one who brought me to this beautiful place!!\n\nTip - if you're not part of a tour group where the tickets have been purchased for you, I'd highly recommend purchasing your tickets in advance. There were people who were at the park who could not get tickets for the Arizona because they were all sold out. Also, eat before going and don't bring extraneous items with you as you won't be able to keep them on your person. It is very windy so have a sweater or jacket handy if you get chilled easily.",
  "Word to the wise...Reserve your tickets online in advance or you might not see it. The tickets are free, but the www.Recreation.Gov website charges $3 for the convenience of reserving in advance (on credit card). We arrived on Oahu and thought we could just show up down there and get tickets and I was wrong!!! I jumped online to get the address and directions the morning we planned to drive over there and discovered it was booked for the next two days of our vacation. I was lucky to see two tickets available and reserved them. If you only have a day or two on Oahu, book in advance. Actually you should book in advance no matter your situation. NOTE: You have to arrive NO LESS THAN one hour before or they say you will lose your tickets. Oahu traffic is not as bad as everyone cries about, especially if you're from a large city back on the mainland. From Kaneohe it took us 40 minutes (Windward side to Pearl Harbor using a vehicle GPS). \n\n1. Parking is easy and free. There are USNP personnel cruising the lots on bicycles to help you, correct you if you forgot how to park, etc. They don't say anything about your clothing but you should dress appropriately for a memorial, which includes maybe wearing pants or nice shorts (no swimsuits), no crazy tshirts, etc. Sandals are okay...you're in Hawaii.  I wore sandals and nobody said anything.  \n\n2.  No bags will be allowed on the attractions, so leave everything at your lodging, or the trunk of the car. You can bring a camera and your wallet, and that is it. If you arrive carrying a bag, there is a bag check service for a fee in a trailer nearby. There are two snack bars I saw. One that sold hot dogs / drinks, another that sold bottled drinks and snacks. If you arrive and you're hungry, I suggest just sticking it out there and not leaving for a bite to eat. The snack bars will hold you over.   \n\n3. Once you pick up your tickets you need to be in line no later than 10-15 minutes before your scheduled time. I only wanted to see the USS Arizona so they make you line up at the USS Arizona Theater, go inside and watch a 10-15 minute video, and then you board the boats for the Memorial. Everything is free. To find the the theater just look left about 500 feet from the ticket booth when you pick up your tickets. To get a good seat on the boat you need to plan ahead and grab a good seat in the theater first. Sit in the front row of the theater...everyone starts filling up the back for some reason. Walk straight to the front row and sit nearest the exit doors at the bottom of the ramp. You'll be glad you did because it's kind of stuffy in the theater and your normal gang of coughing idiots without covering their mouths will happen and you'll be first out the door for fresh air. You will literally be the first one to board the boat when the 10-15 min film is done. The film is the history of the events leading up to the surprise attack on Pearl Harbor, the USS Arizona, other nearby ships, and subsequently our declaration of War. \n\n4. The boats are awesome, very clean, flat running with no sea-sick motion whatsoever. The crew is clean cut and make very quick work of getting you over to the USS Arizona. I sat on the right side (starboard side) nearest the ramp and had a halfway decent view of the USS Arizona Memorial during the boat ride. They kind of head straight for it but I could see it from my side. If you get seasick don't sweat this ride it is like you never left land. Very smooth, no wake, no diesel fumes. The exit will be on the port side, opposite from where you boarded. Too easy. Unloading took two minutes so if you hate boats this will be painless.\n\n5. Upon walking onto the memorial you will be greeted by a huge line of people who were on the boat before you. They are waiting to leave. take note of their position and once you see everything you want on the Memorial, work your way over to that location along the railing and enjoy the view before leaving. NOTE: The Memorial is not floating and has no motion if you're concerned about motion sickness.   \n\n6. If you notice oil bubbling up from the USS Arizona that is normal, and a USNP ranger can give you more information if you ask about it. I looked everything up online and did not need to ask any questions. One thing I verified is the officer who got the call from the radar position the morning of the attack WAS NOT INCOMPETENT. In the movies they make him out to be an idiot who says \"don't worry about it.\" In fact an investigation revealed he had no training and was placed in that office to answer calls without any knowledge of the threat or radar system. He did have information about the US bomber planes arriving from California and told the radar techs to simply not worry about it because he did not want to violate Operational Security and divulge info about the planes because there was intelligence the Japanese were monitoring our communications. He did nothing wrong, and served an entire career in the military and retired honorably. The investigation ruled he was not at fault or failed in his mission to act accordingly. Another example of why a basic level of training is important.  \n\n7. I did not see a toilet on the Memorial so hit that before going into the theater.\n\n8. There are two gift shops with tons of junk you can buy after you tour the USS Arizona. One shop is located in the USS Arizona area, and the other (smaller one) is located near the Submarine Memorial area. NOTE...if you buy something, that will result in you acquiring a bag, and bags are not allowed on the Memorial or boat ride. Shop afterward. A nice thing happened when I returned from the USS Arizona. We disembarked and saw three Pearl Harbor veterans in Aloha shirts signing books from the gift shop. Buy a book, they sign their pictures. Too easy. We also took photos with them and they were cool. Giving the hang loose signs with their hands, etc. I heard they are regulars at the Memorial staging area.\n\nI hope my review helped. Cheers",
  "Today the world remembers the U.S. Naval Base Pearl Harbor for the devastating attack suffered by its anchored battleships and naval ships and aircraft, by Japanese naval planes on Dec. 7, 1941. Thousands have been coming to Hawaii to see and learn of the amazing history there and learn how that very destroyed fleet eventually recovered to return to battle and defeat the Japanese Navy in key naval battles that helped win WWII in the Pacific. It has been Hawaii's most visited visitor site for decades.\n\nPeople enter the main Pearl Harbor Visitor's Center at the' USS Arizona Memorial' entrance to Pearl Harbor  --  well over 1 million each year-- to view the numerous static warship, aircraft and historic artifacts displayed in several interesting exhibits.  The Center helps visitors to Pearl Harbor to know and experience up close what happened there over 74 years ago. The trip across the harbor to the famed USS Arizona Memorial, flashpoint in the Pacific Ocean port where WWII in the Pacific began\nis the most highly sought experience while at the Visitor Center.  \n\nThe US National Park Service offers free passes to visit the offshore USS Arizona Memorial; these must first be obtained at the U.S. National Park Service desk at the entry desk on a first come, first serve basis.  (Passes are sometimes limited and closed\ndue to high demand; it's best to go early or inquire as to availability.)\n\nVisitors bearing passes to visit the USS Arizona Memorial are given a brief personal introduction by staff and then shown a documentary movie with vintage clips of the series of events leading to the attack.  Upon exiting the theatre, visitors board a U.S. Navy ferry boat for a brief voyage across the channel to the USS Arizona Memorial itself, located along what was once 'Battleship Row' next to Ford Island. Once upon the Memorial, a central viewing platform allows visitors to see both the fore and aft sections of the sunken ship.  At the far end of the memorial, one may enter a separate, enclosed shrine with a marble wall inscribed with the names of all 1,177 military servicemen who lost their lives while trapped onboard during the bombing attack by Japanese naval planes. Droplets of oil from the ship still bubble to the surface nearby, referred to as \"tears of sadness.\"\n\nThe special Memorial was erected in 1961 by presidential approval  and funded by Congress to honor the ship and her crew. \n\nThe return voyage to the Visitor's Center runs every half hour from the USS Arizona Memorial. The USS Arizona retains her name by order of the U.S. Navy and is given the perpetual right to raise the U.S. Flag - attached to original ship's mainmast -  as if she were an active commissioned U.S. naval vessel.  She is under control of the National Park Service.  As a courtesy she is given a salute by all passing vessels entering Pearl Harbor.  \n\nThe USS Arizona remains in Hawaii as a memorial to those who perished aboard-- a remembrance of that fateful \"Day of Infamy\" never to be forgotten. \n\nOPERATING HOURS\nOpen Sunday through Saturday 7:30 A.M. to 5:00 P.M. Tours begin at 8:00 A.M. (7:45 A.M. in summer). The last tour begins at 3:00 P.M. Closed Thanksgiving, Christmas, and New Year's Day. \n\nDIRECTIONS Via Honolulu/Waikiki area best to take either Ala Moana/Nimitz Highway or H-1 freeway West. If going on H-1 proceed past Airport exit and look for the USS Arizona/Stadium exit, #15a. The USS Arizona Memorial can be seen looking toward Pearl Harbor off  State Highway 99 (Kamehameha Highway). It is a 45-minute drive west of Waikiki. \n\nTRANSPORTATION by bus: Honolulu public buses stop regularly at the visitor center and can be boarded in Waikiki. The #20 bus is the most direct line. Various commercial tour bus operators from Waikiki also include the USS Arizona Memorial on their tours. Call for information: (808) 422-0561. \n\nIt's best to plan 3-4 hours including waiting time and viewing both exhibits and the USS Arizona Memorial.  It would pay to check ahead of time for heavy traffic and visitor to the USS Arizona Memorial site availability.",
  "One of the most moving memorials I've ever witnessed. To say it's a must is an understatement. This is where you go when visiting the island of Oahu. It's been almost five years and the memory of this day is still vivid.     \n\nMy wife and I had planned our visit well in advance and the trip was part of a shore excursion on our Princess Cruise. The tickets for the tour are free, however you must plan ahead as this is an extremely popular attraction. \n\nThe attack on Pearl Harbor occurred December 7th 1941. Long before most that were preparing to board and view was born. By the restrooms and gift shop were a few men that willing to share their own stories of that tragic day in U.S. history. \n\nOnce the ferry arrived at the USS Arizona Memorial our guide provided us additional information beyond what we heard in the film on shore. Visitors are free to ask questions. There are also headphones that can be purchased which we did and felt it was worth while. You may also bring flowers, I saw others toss in the water grave of the ships just mere feet from the surface, \n\nThere were probably around 35-45 on our tour. Once we entered the tube of the memorial it was silent. Names of the fallen are lined on the interior. The smell of oil is a sad reminder of the wreckage that lays beneath the clear water. Yes you can see the ship which shook me to the core. \n\nThe tour last approximately 30 minutes. If you want to stay longer you can join the next ferry. For me it was enough time and I could bare stand it any longer. It is one of the saddest places I can ever think of touring. Over 2,300 killed on that Sunday morning raid just before 8 AM. Over 1,100 were wounded. \n\nI saw the memorial once and I do not care to return. This is something every American should see in there lifetime.",
  "USS Arizona tour was very well thought out. Didn’t have to wait too long for boat ride to site. I was very moved to hear our guide’s comments on what we were about to see. Upon arrival, it was hard not to get testy eyed seeing all the names who were lost that fateful day. Overall, it is worth seeing but two things disappointed me. I felt people did not show proper respect by talking loudly, laughing when we at the memorial. The grounds I felt were in need of serious attention. Trash and gum wrappers were on the ground. Some of the plaques of monetary donors appeared to have been pried off on a sign near the gift shop. Overall appearance saddened me.",
  "This is a must see tour when you visit Hawaii. Very educational and full of artifacts and movies of the attack. Also USS Missouri and a submarine tour.",
  "We didn't book tickets but showed up on the day and got tickets easily. The museum is full of interesting information about the events of the attack and is quite moving. The short ferry ride out to the USS Arizona Memorial gives a chance to see the harbour. The 15 minutes you get on the memorial structure are a bit short, but it is understandable why they do it. This is a very popular place to visit but is not crowded. The wall of names of the people who lost their lives on the USS Arizona is very moving, and the addition of a smaller wall for those who survived the attack, but have since passed is a stark reminder. The memorial structure is built over the USS Arizona and oil can still be seen on the water. This is a must. It marks the entry of the US into WWII. The whole experience is very respectful.",
  "A must see . Very moving and beautiful. Very well organised . The surrounding area is breathtaking. Take your time and soak in the atmosphere "
 ]
},{
 "name": "Manoa Falls",
 "address": "End of Manoa Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/1a/ed/41/manoa-falls.jpg",
 "tags": [
  "hike",
  "walk",
  "walk",
  "walking",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d561035-Reviews-Manoa_Falls-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "This hike truly was beautiful and falls were great - major jurassic park vibes. However I would not do this hike again for the following reasons: \n\nTourists. There were SO many people. We were in a single file line having to stop often. When we finally made it to the falls EVERYONE needed a photo of course and no one was abiding by the signs to stay behind. This made it impossible to get a photo without people in it. Very frustrating. \n\nMuddy. The hike was incredibly slippery - like nearly impossible to do without falling. It rained the whole time, which I don't mind at all it was the slippery mud. I did fall and had to throw out my tennis shoes.\n\nIt was January and I get that the hike is muddy, but wow. Just the people and the mud made the hike much less enjoyable.",
  "We were fortunate that the rain this day eased off and left us with a warm mist that did not deter from a pleasant walk to the falls and do the \"selfie thing\".  On a sunny day the easy walk will be wonderful",
  "This was literally just down from our VRBO rental house. We went there several days. Unbelievable. And the drive in is great",
  "we walked up to the falls it was a relatively easy walk, you do need good gripping shoes as it is wet and so easy to slip.  its like a rainforest in the middle of a concrete jungle, it is beautiful walk and view",
  "Very muddy. They are working on it so make sure to check the open schedule. We went on a Friday, got there around 8am. Glad we started then as it was pretty busy when we were coming back down. There are some beautiful views around along the hike. Honestly I don't think it matters what shoes you wear, they will be so caked in mud that you'll have no grips anyways. I would actually not recommend heavy hiking boots as you'll likely lose them in the mud. There is a steep section that is tough with wet muddy conditioned. We didn't have a stick when walking up but were sure glad to have one for the way down. It's a small area near the falls but it's pretty.  It is a very busy hike though, if you're looking for a quiet hike this is not it. But it was quick. Luckily the bugs weren't too bad when we went but I can imagine they can get terrible. Took us about an hour with the muddy conditions. In dry conditions this would be an easy peasy walk."
 ]
},{
 "name": "Koko Crater Railway Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/a8/1d/25/koko-head-crater-trail.jpg",
 "tags": [
  "hike",
  "hike",
  "walking",
  "hike",
  "walk",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d1913806-Reviews-Koko_Crater_Railway_Trail-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "This trail follows an old railway that used to bring supplies to the pillbox on the top of the mountain. \nYou can reach the trail by public transportation, although signs to find it once you get off the bus are not very clear, so ask around. \nThe climb up is pretty demanding and it took us about 45 minutes to complete. The climb down will take you about 20 minutes and will not go easy on your knees. \nIt gets pretty crowded and the sun hits down hard, so go early if you can. ",
  "I'll admit, I'm not exactly a paragon of great fitness - however, I do like to do this hike once in a while. \nIt is a challenge, with over 1000 railroad ties--ladder steps straight up. \nThe halfway point is an old railroad trestle, which can be tricky to negotiate for a number of reasons; one is that there is a bee's nest underneath it at the top end, and some folks are allergic to/afraid of bees. Two is that it can be vertigo inducing, and three is the real danger of falling through. There is, however, a solution ... if you so desire, you can take the pathway to the right (upward) of the bridge. Right behind the rocks where people sit when they are resting at that spot.\nOnce at the top, don't forget to see the back side of the mountain ... on a clear day you can easily see Molokai.\nFor those of us who are a bit longer of tooth, the trip down can often take nearly as long as the trip up. For me, up is usually about 45 minutes, and down about 30. \nThe more in-shape (round IS a shape!), the entire round trip can be done in 30-35 minutes. \nIt can be HOT out there, so bring plenty of water. Enjoy.",
  "I would consider this hike as a medium challenge for avid hikers.  A nice hike to the top and very scenic once you get there.  Do it early in the day as it gets hot in the afternoon.",
  "I live here in Oahu and this is my favorite hike/workout in the island. I always take my friends here visiting from the mainland and most of the time they question me why, why, why I’d take them here but I always tell them, it is so worth it when we get to the top (and I love seeing their smiling faces when we reach the top). Most of my friends that I bring here had the hardest time at the bridge, this is the infamous drop off. You will be walking over a 40-foot drop. So what I usually recommend if you decide to carry on, go on all 4’s and bear crawl it. There is also an alternative path around to the right side if you are scared of heights.\n\nThe trail itself does not have a lot of shade so bring plenty of water to hydrate and for cooling off. Go early in the morning or late in afternoon to avoid mid-day heat. I prefer sunrise hike, less crowded and weather’s perfect. Once on top, the views are amazing, 360-degrees view of water, mountain and coast. ",
  "To quote City Slickers (and date myself)...it was both the worst and best day of my life (or at least our recent trip to Oahu).  The climb was physically & mentally challenging, especially in the afternoon heat.  The descent was good until the rain made the railroad ties slick.  My wife took a nasty fall in the section without earth beneath it (hint: take the side trail for that section).  With an immense view and sense of personal accomplishment, it was worth the agony.   ",
  "This is the second time I tried it. The first time I made it to the trestle. \nThis time there was no stopping me. Made it to the top in just under 37 minutes. Very tough hike but the reward at the top with the stunning views is so worth it.\nBe prepared. Bring water. There is virtually no shade either so time your walk up accordingly.\nEnjoy. It is something else.",
  "My wife saw this interesting hike while we were recently in Hawaii and decided to do it with our friends. It was more Difficult than we expected and some of us did not finish. However those that did enjoyed the view from the top and the satisfaction of completing it.It was a great challenge to us and I would recommend if you have a reasonable fitness that you do this one!",
  "We are so glad we did this! It was a lot of fun but pretty tough. I wouldn't recommend it if you aren't used to hiking, and definitely do it early in the day because of the heat! :)"
 ]
},{
 "name": "Waikiki Beach",
 "address": "Kalakaua Avenuue",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/de/e0/f7/photo0jpg.jpg",
 "tags": [
  "sightseeing",
  "cheap",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d254540-Reviews-Waikiki_Beach-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "First visit to Hawaii only went to beach twice as we had a jam packed 2 weeks of sightseeing. Next time we go will spend more time at the beach so hubby can take a surf lesson. Water is so clear & calm no rubbish left around on the beach. Sand is so nice & soft not course like other beaches. Just delightful to sit & people watch & do nothing.",
  "Absolutely beautiful, must see. Words cannot even explain or do this beach justice. The locals are super friendly, well worth the trip. Enjoy! ",
  "Waikiki Beach is just beautiful, the water is so clear and warm, you can just float all day in it. The sand is soft but make sure you wear something on your feet as during the day especially 11-2pm the sand is HOT. Wear lots of suncream and the sun and heat is powerful. If you are lucky enough you can see the big sea turtles swimming around, the poke their heads up and come close to shore. You can buy cheap floaties from the ABC stores and can just float around in the water. Lots of people around but everyone is very friendly and minding their own business. Love wakiki beach.",
  "My husband and I were on a cruise and this was one of the attractions that was on their excursion list. I wanted to go to just relax and take in some sun as well as see what this beach looked like, we were there for about 3 hrs. It was nice to be able to just sit on the beach and do some reading. I went in the ocean twice and my husband went in once. I found out after the first time in that there were a lot of big rocks, so it was very hard to walk, so the second time I went in I had to wear my water shoes, my husband didn't have any so that's why he only went in once. Overall it was not too bad of a day.",
  "Many tourists, the locals like to prey on tourists so dont leave purses or wallets alone to go in the water."
 ]
},{
 "name": "Battleship Missouri Memorial",
 "address": "63 Cowpens St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/bd/3c/ce/battleship-missouri-memorial.jpg",
 "tags": [
  "tour",
  "tour",
  "free",
  "tour",
  "history",
  "tour",
  "free",
  "tour",
  "eat",
  "tour",
  "free",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d105445-Reviews-Battleship_Missouri_Memorial-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Amazing ship and wonderful to be able to explore alot of the ship, could easily spend a few hours here as so many things to see and defiantly take the 30min guided tour of the top deck as they give you alot of information",
  "We did Passport to Pearl Harbour which was booked through the recreation.gov website, was USD$72 and booked about 1 month in advance. This included entry to all 4 partner sites: USS Bowfin submarine museum, Battleship Missouri, Pacific Aviation Museum, USS Arizona narrated tour and the new PH virtual reality centre. Again you do not need to book a tour, it is very accessible on your own. \nThere is a bus from Pearl Harbour to fire island that drops you off firstly at Battleship Missouri and then to pacific aviation. There was a free 35 minute guided tour from a volunteer which was really helpful to set the scene re Japanese surrender, and then you can see the surrender documents and go inside the ship which was fascinating.\n\nTip: concealed bags are not allowed - I took a clear plastic bag instead. \n\nWe were there for 6 hours and even then ran out of time as there was so much to see",
  "The Mighty Mo (Missouri) was awesome\nI loved every moment, the History, the Pictures of the signing of the Peace Treaty in WW11\nThe tour of the ship below, showing how the Sailers (Soldiers) live when away from home\nAlso showing how the ship was commissioned, decommissioned and also brought back and updated to todays standard to fight in many wars\nHighly recommend for everybody with and without families",
  "WOW What an amazing day we had. Very informative especially for us Aussies who don't know a lot about what happened in the war. We did a free guided tour which was very interesting & guide certainly knew her knowledge. You can take your time to explore the ship like we did & took plenty of photos too. You certainly do look after your heroes in U.S.A.",
  "Taking the shuttle bus to the Battleship Missouri Memorial was fun, and arriving at the site was exciting. The guides are friendly and have loads of information about the memorial and the ship. The USS Missouri is well presented and getting around it is fun. There is a serious side to the tour when you get to the surrender deck. This is where the Japanese signed the surrender documents, and there is a disk in the deck to mark the location of the desk used. From the deck you can see the USS Arizona Memorial which is where the attack marked the entry of the US into WWII. There are areas below decks where there is much information about \"Mighty Mo\", and seeing the sleeping quarters of the sailors is interesting. There are places to eat and shop there as well. Try the Loco Moco or a plate lunch with a shave ice.",
  "A very interesting place to visit, there are many people to give you a free guided tour full of interesting information, took plenty of photos on my mobile as you cannot take a bag unless you put it in a locker.",
  "A group of us took the basic tour, not the upgrade. It was very informative. After the tour we wandered around, following the arrows and viewing the many exhibits.",
  "Mighty Mo'...While this is not technically part of the Arizona Memorial (it is right next to it), to be able to explore and walk around the ship and view the artifacts throughout the ship is incredible.\n\nif you have made it to the Arizona memorial...you have to set time aside to visit the USS MIssouri also."
 ]
},{
 "name": "Bishop Museum",
 "address": "1525 Bernice St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/93/22/67/bishop-museum.jpg",
 "tags": [
  "history",
  "history",
  "learn",
  "structure",
  "history",
  "walk",
  "learn",
  "kids",
  "walking",
  "history",
  "history",
  "eat",
  "history",
  "tour",
  "history",
  "family",
  "knowledgeable",
  "walking",
  "history",
  "walk",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d131986-Reviews-Bishop_Museum-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Bishop Museum has a fascinating history and collection of artifacts dating back to the earliest contacts of the Island people with the white explorers.  The feather capes and headdresses worn by the Hawaiian chiefs and kings retain their beautiful colors, and the intricate detail work and construction is lovely. \n\nThe history of the Hawaiian people, and their interactions with people of other island nations is documented and explained in great detail, and serves as a wonderful education in Hawaiian history.",
  "The Bishop Museum showcases a remarkable selection of cultural and natural history exhibits about Hawaii and all of Polynesia!  The beautifully landscaped museum grounds and buildings are expansive, so you'd better allocate an entire day to enjoy this properly!\n\nThe Castle Memorial building features a rotation exhibit, which is currently devoted to Rapa Nui (Easter Island).  Make sure to plan your visit, because there are a number of planetarium experiences (we didn't realize this until we'd missed all the shows for the day).  \n\nThe Hawaiian Hall is a beautiful, 3-story castle-like structure with amazing woodwork interior decor.  With exhibits and displays on topics such as beliefs, legends and life (pre-European contact), as well as recent human history, life at sea, clothing (such as past royalty's bird feather capes) and much more!  \n\nThe Pacific Hall had 2-floors devoted to the origin and migration of the Polynesian peoples (there were maps, archaeological artifacts, and various transcribed oral stories/traditions.\n\nThere is also a sports hall-of-fame, library/archive, cafe, Native Hawaiian Garden, the Science Center (where you can learn about magma/lava - among other things) and a fantastic gift-shop with a phenomenal selection of Polynesian literature.\n\nThis is a MUST DO!",
  "The main building of Bishop Museum called Hawaiian Hall Complex comprises a wonderful display of Polynesian history and culture and in particular, the history of Hawaii and its people from the time of migration from the Pacific to the present day. Well worth a visit.  We visited the Museum on the same day as Iolani Palace.  Continue on the No. 2 TheBus to School Street.  The audio on the bus will tell you when to get off as School Street is a very long road.  Cross School Street and walk along KapaIama Street to Bernice Street. It is a short 5 minute walk Signage to the Museum is very good.",
  "Understanding that you're probably on an island getaway to enjoy the beach, if you have the time, the Bishop Museum is a cool place. You get a little taste of the multi-cultural experience that is Hawaii from the clothes they wore and the weapons they used and learn some fun things about volcanos and indigenous plants and animals. Don't waste time from the beach on a short trip, but if you have time and interest, check it out.",
  "Most of the reviewers recommended setting aside 3 hours to view the entire museum.  We agree - that seems to be the perfect amount of time to spend there.  We learned a great deal about Polynesian Culture and enjoyed all of the artifacts. Call ahead to make sure the museum cafe is open, unless you don't mind wasting time going offsite and returning afterwards (nothing within walking distance).  \n\nWe purpusely went early in our vacation so that every other place we visited would have more meaning.  It really did have that effect.  We had a greater appreciation for the places we went and the people we met!  \n\nWe saw a lot of bored-out-of-their-minds kids, so if you're planning to visit during your vacation, you may want to reconsider if you have kids or teens with you.  It's probably much different if you live on Hawaii or are of Polynesian ancestry.  In those cases, you should make it a point to take your kids to the museum.   \n\nResearch the weather ahead of time -- this is a perfect rainy-day excursion!",
  "Discover the culture and history of Hawaii in the bishop museum.  Three floors of exhibits   give you plenty of information.    This is well done.   Catch one of the docents giving tours to enhance your visit.   \n\nAn elevator is available for those with difficulty climbing stairs.",
  "The volcano display was not working the day I visited. However, there are films on volcanoes in the one pavilion’s basement. The surfing exhibit was interesting even with duke’s board on display. The hall with Hawaiian culture and giant models of sea life were informative.",
  "This museum is well worth a visit to get a greater insight into Hawaiian history and culture, and the grounds are lovely. You can easily spend half a day here as there are over five exhibition buildings in the grounds (including a planetarium) as well as a garden with native plants. Check out the gift shop too if you're interested in books on Hawaiian history - they had a number that I didn't see anywhere else during my trip, including major bookstores.\n\nTry and time your visit to see the wayfinders show at the planetarium. I was really impressed by this - not only how interesting it was but the interactrive elements as your group is taugh how to navigate back to Hawai'i using the stars using traditional navigation methods. Give yourself twenty minutes or so to look around the pre-show area beforehand as the planetarium shows exit back outside (you can reenter the pre-show area without another ticket, it's just to save you doubling back.\n\nIf you're visiting without a car the best way to get there is probably the Waikiki Trolley purple line. It runs every 1 hour and 10 minutes and the last trolley back to Waikiki leaves before the museum closes - so be sure to check the timetables before your journey. It's over an hour each way but the journey is scenic and takes you through some residential areas which was a nice change from the usual tourist sites.",
  "There are many different buildings on the site and they are all very interesting. There is much to see so allow plenty of time to enjoy everything. There is a place to eat so you could be there all day. There are regular presentations and a gift shop. The history of Hawaii presented here is so interesting and an insight into the island. We really enjoyed our time here.",
  "For anyone that appreciates history and would like to know more about how Hawaii came to be i would strongly encourage checking it out! This being the only Royal Palace in the US i was very intrigued to see what it was all about. We did a guided group tour and we pretty much went from room to room to look at all of the beautiful artifacts that have been recovered over the years. They do a good job of explaining what life was like then and what the royal family was like by providing ample context.\n\nAfter a lunch of Kalua Pork we went over to Bishop Museum.\n\nAn Absolute Jewel of Hawaii!! Where we saw hundreds of artifacts that detail the life and history of ancient Hawaiians. Our tour guide was really knowledgeable and definitely was a major part of what made the tour go smoothly!",
  "Spend several hours at this wonderful museum. Beautiful walking grounds to explore the different museum buildings. \n\nThe planetarium is small, but has an actual and very knowledgeable lovely lady explaining the night sky. She also answered guest questions after the show. Kudos to her. \n\nThe city bus stops about three blocks away. The walk is easy. After getting off the bus, a lady from across the street said to us, “you are going in the right direction; the museum is only two blocks away.” Wow.\n\nThe Bishop Museum is a must do to understand the culture and history of Hawaii. \n\nThe staff we met were so helpful and answered all our questions. They were courteous, thoughtful, and definitely enjoyed their jobs. \n\nWill go ago. Enjoy the wonderful views too. "
 ]
},{
 "name": "Pearl Harbor Aviation Museum",
 "address": "319 Lexington Blvd Historic Ford Island",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/1b/b0/9e/dauntless-dive-bomber.jpg",
 "tags": [
  "wander",
  "walk",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "history",
  "walking",
  "tour",
  "history",
  "kids",
  "tour",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d634758-Reviews-Pearl_Harbor_Aviation_Museum-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wander around the museum which is self explanatory then a short walk to Hangar 79 which includes B-17 Swamp Ghost, P-40 Flying tiger, helicopters, jets, and bullet holes from the Dec 7 attack.",
  "We took the Aviator's Tour as part of our time at the Pacific Aviation Museum and thoroughly appreciated it.  The only problem we had was that our schedule did not permit us to make the 1:00 tour so we took the 3:00 pm tour and simply ran out of time.  Give yourself as much time as possible!  Our tour guide had been with the Museum since its start and was extremely knowledgeable about both the Museum and the History of Aviation in WWII.  If you love airplanes, this is a must, if you love history, this is an excellent part of the Pearl Harbor experience and if you can take the Aviator's Tour, you will love it.",
  "Briefly, this aviation museum has aircraft that even the Smithsonian's 2 Air and Space Museums lack.  They are adding more aircraft every year and expanding to 3 hangars. For aviation enthusiasts, I strongly recommend purchasing the extra docent's tour, given by retired military pilots, who share their vast experience and knowledge about the planes on display and the background stories. Our tour was led by  a retired USAF pilot who had riveting stories of his experiences flying during the VietNam conflict.  The discovery and restoration of these rare aircraft is an ongoing project and makes for a fascinating morning or afternoon, 3+ hours",
  "Wow,  this place is great and a total labour of love by the many docents that work here.  Took the tour with fantastic guide Laughlin Tanaka and was rewarded with a detailed and very animated tour of the museum's star attractions.  Do take your time to not just look at the planes but also the original WW 2 hangars,  bullet holes and all.  Highlights were the Japanese zero ( including the wreck from Ni'ihau), the Flying Tigers warhawk, the liberator, and the B-17 Swamp Ghost).  Go early as it gets busy later in the day.  Good place for lunch.  Nice gift shop.",
  "Really enjoyed this museum and the planes and history inside.  It gets a little hot outside, so hit it early.  The best part was the bullet holes in the glass of the hanger from Dec 7, 1941.  I stood and stared at them for quite awhile.  And, standing out where the original flight line was, and knowing what happened there.... you could almost hear the planes flying.",
  "My wife, my dad, and I did the Aviator's tour. It was a great tour! Besides keeping your distance from the planes, and giving your attention to the guide part of the time, it is child/family friendly. With the Aviator tour, you are given special access to another hangar full of different planes, each of which have their own story. \nI do suggest that you get to the Pearl Harbor Visitor Center about at least 45 min. before your tour time, if you do any of the tours on Ford Island, as a bus ride is required for these tours. Between loading, unloading , and travel time, you will spend about half an hour on the bus. We 15 minutes prior to our booked tour time, and ended up half an hour late for the tour. \nWe were on our feet and walking around for about two hours, so keep that in mind if you or the people joining may find this difficult. There is about a twenty minute period when you are outside a hangar touring planes. The rest of the time is inside two different hangars, one of which is air conditioned.\nI highly suggest doing this tour if you enjoy museums, history, planes, or learning.\nKeep in mind that the Aviation Museum, and tour, is, as it says, a museum. Therefore, at no point throughout the tour will you be given permission to tour inside any of the planes.",
  "Our tout stopped here for lunch, but we had time to explore the museum also.\n\nThere are two inside showrooms, along with an outdoor display. One showroom with older(WWII) era aircraft, the second, a hangar adjacent to the first showroom, has a variety of aircraft from over the years.",
  "A terrific tour through history. Pearl harbor, aviation, and the part planes have had on our history. We took the tour with a docent and lucked out it was a very small group. It was absolutely extraordinary and filled with information. Highly recommended. They have a new interactive building that is great for kids, and adults!",
  "You can't come to Oahu without visiting Pearl Harbor and you can't come to Pearl Harbor without visiting the museum.  Many people just visit the Arizona and feel that they have visited Pearl Harbor.  There is so much more to this visit back in History.  Very educational and well worth it.",
  "As a former Air Force guy, it has been a long time since I've seen many of these planes; this was an unexpected pleasure as part of our day trip to Pearl.  This was a treat for me and my my 18 year old grandson, who has never been around anything to do with the military.  To see the actual tower that was there during the attack on Pearl and was in the recent movie, was a plus.   It has aircraft from WWII, Korea, and Vietnam wars.  Would love to see this museum, which I think is privately funded, grow and be much more comprehensive.  But I highly recommend making the trip.",
  "There were a nice variety of older planes but compared to many aviation museums it was small even using 2 hangars! Coolest part was being at the actual airfield where the attach on Pearl Harbor took place and see buidlings litke the tower from the movies still standing and looking quite good!"
 ]
},{
 "name": "US Army Museum of Hawaii",
 "address": "2131 Kalia Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/dd/e5/17/us-army-museum-of-hawaii.jpg",
 "tags": [
  "history",
  "active",
  "field",
  "free",
  "structure",
  "free",
  "history",
  "learn",
  "free",
  "walk",
  "history",
  "tour",
  "history",
  "free",
  "history",
  "free",
  "walking",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d154266-Reviews-US_Army_Museum_of_Hawaii-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Let's face it - one doesn't expect to find a military museum at one of the most famous beach destinations in the world, yet that's exactly what you'll find here at Waikiki. However, once you visit the museum, its location makes a lot of sense. Although it isn't obvious, the museum is actually on an active U.S. Army base. Fort DeRussy is mostly green space with no perimeter fences to keep people out, indeed it is mostly open to the public to enjoy, so it is pretty well camouflaged in plain sight. \n\nThe museum itself is housed in what was originally Battery Randolph, a coast artillery installation completed in 1911. It is a massive reinforced concrete structure that originally housed two 14-inch guns designed to defend Honolulu from battleships. Following the rise of bombers over battleships during World War II, coast defense forts like Randolph were shutdown, their guns removed and the concrete bastions mostly demolished. The adjacent Battery Dudley here on Waikiki Beach was successfully removed in 1969, but Battery Randolph proved impervious to the wrecking ball and blasting would have been too dangerous for the surrounding city already rising up around it, so it was converted into this museum instead.\n\nThe museum consists of two floors of exhibits inside the old fortress along with displays of tanks, artillery, and even a helicopter gunship outside on the roof of the battery and the adjacent grounds by the museum entrance. The galleries on the first floor provide a generally chronological history of Hawaiian defense starting with the feudal society of native Hawaiians that Captain Cook found when he first visited the 1780s through the military campaigns of Kamehameha that ultimately unified the islands in the early 19th century. The growing trade and military influence of the United States in Hawaii during the 19th and into the 20th century is also covered. Of course, being in an intact coast defense fort, the history and operation of Army's coast artillery branch in general and specifically the construction and operation of this and other coast defense installations in Hawaii are covered in great detail, although other specialties within the Army (cavalry, field artillery, aviation, etc.) are not left out. Naturally, the rise of Japanese militarism culminating in the attack on Pearl Harbor and World War II is another key topic.  Coverage then extends through later Pacific wars in Korea and Vietnam.  \n\nThroughout, much coverage is also given to the contributions of Hawaiians, particularly its Japanese Americans, in American military history. This is particularly true as the exhibits move to the second floor and the Gallery of Heroes which covers the Hawaiian recipients of the Medal of Honor and Army Distinguished Service Cross. Also on the second floor is a separate gallery devoted to the Army Corps of Engineers and their work not only in Hawaii but around the country in general.\n\nThe exhibits are quite well done, combining artifacts, models, photos, ephemera, and even interactive displays to tell the story. Audio tours are also available. Admission is free (although donations are gratefully accepted), and they even validate parking. Once you get finished looking at the exhibits, you can stop by their gift shop for souvenirs, history books, etc. We spent the better part of two hours here and had a great time.",
  "Located adjacent to Fort DeRussy park on Waikiki beach you’ll find the impressive US Army Museum of Hawaii.  Entry is free, although donations are gratefully accepted.  The museum has a good array of exhibits, and tells the story of Hawaii’s involvement in various military conflicts including the Pearl Harbour attack and participation of local soldiers in the Vietnam War.  Our young sons found it highly educational, and particularly enjoyed seeing the range of artillery plus army tanks and helicopter.  A fitting tribute to Hawaii’s military past, and the residents of Hawaii who have achieved distinguished honours in various battles.  There’s a really good gift shop on site where you’ll find an assortment of well priced memorabilia.  Definitely worth a visit.",
  "The US Army Museum is a really cool place to learn the history of how Hawaii fit into the various wars. The museum is open to the public and free of charge. They don’t even ask you for a donation. After touring the museum, you should feel compelled to drop something in the box on the way out. Especially since, the attendant validated your highly expensive Waikiki parking stub. Back to my story. The attention to detail in the artifacts was uncanny. The U.S. Army Museum of Hawaiʻi is housed inside Battery Randolph, a former coastal artillery battery, located at Fort DeRussy Military Reservation. Take your time to walk around. There’s so much to see, do and feel. Paying tribute to locals who made huge sacrifices during times of war. We spend over 1.5 hours and didn’t make it to the 2nd level because we were hungry. We’re definitely going back. So much more to see. Maybe we’ll run into you. ",
  "We have walked by the Army Museum for years, but this year we took the time to go through it.  Take a sweater, as it's air conditioned but very worth while to view US's history.  Very well done!",
  "Older museum with lots of great information and exhibits that span pre World Wars to current era.  No cost but please pass along a donation - it looks like they may be in need of some funding to keep things going.",
  "This Museum is located right next to the Outrigger Reef Resort in Waikiki.  It is free so please bring some cash to donate at the end of the tour.  We found the exhibits fascinating and a great job was done to preserve the history of Hawaii, the US involvement in Hawaiian history, and how all of it came to play during the war with the US and Japan.  Great experience all around.  Note that if you are unsteady on your feet be cautious as the floors are not exactly even in this place.  I highly recommend this museum and would go again.  ",
  "From the outside it looks like an old military building and we didnt expect much when we wandered in today to get out of the rain.  Inside was a hidden gem that we felt rivaled the exhibits at Pearl Harbor.  It's much larger inside than it looks from the outside.  The exhibits offer military history beginning with early Hawaiians and continues past Vietnam.  There are weapons, uniforms, models, historical photos and a vast amount of information.  Must see in Waikiki!",
  "Interesting displays and a chance to dodge the mid day sun. Allow about 1 hour. No fee but they do accept donations as it is a non-profit.",
  "A gem and the cost is free. Fantastic exhibits inside of this old bunker. Good for the young and old.",
  "The U.S. Army Museum of Hawaii is housed inside Battery Randolph, a former coastal artillery battery, located at Fort DeRussy Military Reservation. The museum's collection contains some World War II armor pieces, an AH-1 Cobra helicopter, and small arms indoors, as well as the battery itself. The battery's main guns were scrapped prior to the inception of the museum. \n\nMuseum exhibits cover the military history of early Hawaii and the post-annexation history of US Army warfare in the Pacific hemisphere including World War II, Vietnam, and Korea. The museum also includes a \"Gallery of Heroes\" honoring recipients of the Medal of Honor and the Distinguished Service Cross. \n\nThe admission is free, but check their hours of operation prior to attempting to visit.  This is a great activity to do if weather is bad and you can't go to the beach.  Great for all ages and is easy to navigate if you have walking issues.",
  "Visited this museum on a Saturday in early February when it opened at 10am. Spent about an hour. One part was under renovation. Very interesting, especially wrt the Army and coastal defense of Hawaii. Worth seeing if you have the time."
 ]
},{
 "name": "Honolulu Museum of Art",
 "address": "900 S Beretania St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/30/01/5a/honolulu-museum-of-art.jpg",
 "tags": [
  "eat",
  "art",
  "tour",
  "art",
  "art",
  "tour",
  "art",
  "food",
  "art",
  "delicious",
  "tour",
  "art",
  "tour",
  "art",
  "eat",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d132003-Reviews-Honolulu_Museum_of_Art-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you need some quiet time with culture and even a bite to eat this is a wonderful place to visit...........there is always something interesting to see on display with a first-class permanent collection of art and antiques.......in a setting of beautiful gardens and interesting architecture...",
  "Most art lovers know what it's like at many art museums:  fighting to see a painting when a dozen or more other's are standing in front of it.  At the Honolulu Art Museum, you can be virtually alone in a room with Monet or Van Gogh, and gaze to your heart's content.  This is not a large museum, but it has a respectable amount of good art, especially the Chinese, Japanese, and Buddhist collections.  \nI highly recommend that you visit the Art Museum in conjunction with Shangri La, Doris Duke's private collection of Islamic art, which is located in what was her private residence during her lifetime.  The cost for the Shangri La tour is $25 and includes admission to the Art Museum that day, while admission to the Art Museum alone is $20.  Be aware though that you will need to book Shangri La ahead of time.",
  "Gorgeous building, filled with exquisite art, and beautiful fresh floral arrangements.\nThe museum has a wonderful oriental collection, contemporary work, fun family/children activities, fabulous restaurant, and two incredible and breath taking off-site venues - the Spalding House and the Shangri La Museum of Islamic Art, Culture, & Design.\nA treasure trove of delights!",
  "Beautiful collection of art and artifacts from all over asia.  Could spend hours in here.  Good food in cafeteria and great gift shop. Get tickets to Shangri La tour from here and museum entry is included.  Great deal.  ",
  "Take a little time in the heart of Honolulu and examine some of the wonderful world art set in a wonderful venue. Go in the morning, experience the art and then have a wonderful lunch in the museum's open air cafe. A really refreshing way to spend a few hours.",
  "We only visited for a short time but had a delicious lunch in the cafe and saw the modern art and impressionist galleries. The staff were very friendly and helpful. Unfortunately we were not able to join the Shrangrila Tour. There should be more tours to this place as going via the Gallery is the only way to see this now.",
  "We went to take a tour of their Shangra La Museum which included the Museum of Art also.  What a fabulous place that is passed by so many people looking at only the sun.  The exhibits and architecture are wonderful.  It is worth the time.",
  "If you need some quiet time with culture and even a bite to eat this is a wonderful place to visit...........there is always something interesting to see on display with a first-class permanent collection of art and antiques.......in a setting of beautiful gardens and interesting architecture..."
 ]
},{
 "name": "Ala Moana Center",
 "address": "1450 Ala Moana Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/97/59/27/walking-through-the-mall.jpg",
 "tags": [
  "kids",
  "walking",
  "walk",
  "food",
  "food",
  "food",
  "eat",
  "walk",
  "food",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d108854-Reviews-Ala_Moana_Center-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Kids loved coming here (11/8) they enjoyed walking around exploring - my son loved seeing his car show room (Tesla) while my daughter found lot of shops with Squishys..\n\nFood court is great with a large variety of food available.\n\nTook us 3 trips here to explore most of the stores.  Took the kids and I 30min walk from Waikiki\n\nDefinitely the best for shopping",
  "Whether you are looking to quickly stock up on basics such as groceries and household items at the Target store or you want to browse high-end stores like Coach and Nordstrom's, this mall has it all.  It also has multiple food courts and restaurants for your dining pleasure.  We spent several hours here to use up time before our evening flight.  As we drove from the mall to the airport, we were able to easily find a gas station to refuel the rental car, and the trip to the airport took less than half an hour.  This mall is worth a visit.",
  "Beautiful high end stores for the most part.Nice shopping.Great food court with everything you would want.Good food.Nice coffe shops.Right on the beach.Walkable from Waikiki.Known as the largest outdoor mall in the world.A pleasure to shop there",
  "Great place to people watch, eat, shop, or just hang out. There is a shop and eatery for every taste. The mall is exceptionally clean and typically every time you enter the public restroom, the janitorial staff is cleaning. \n\nWe spent several hours over several days taking advanced Apple training classes at the Apple Store. The screen is huge with plenty of seating. \n\nEvery high end shop is available and the food court is so large you might get lost. \n\nEast to get to from the Honolulu Trolley and city box. You can even walk there, a good exercise walk from Waikiki.  But if you walk the entire mall, you’ll plenty of exercise. \n\nGreat enjoyable mall.  I agree, more of a Center. Oh, you can even buy a Tesla. ",
  "This mall was fascinating at how large is was as an open air mall. Then I found these stats: Ala Moana is the ninth largest shopping mall in the United States and the largest open-air shopping center in the world.",
  "The Ala Moana Centre was just a short walk from the second floor of our hotel (Ala Moana Hotel) and across the car park into the mall. \n\nThis mall is the worlds largest open-air shopping mall and the ninth largest shopping mall in the United States.\n\nThis mall offers upscale retail shopping, a large food court, a large Japanese only food court and beer garden, a supermarket and lots of bars and restaurants.\n\nIf you dont like shopping like myself, I spent time in one of many bars offering happy hours whilst my wife had some retail therapy.\n\nThe mall has something for everybody.",
  "Excellent modern shopping mall worth visiting while in Waikiki - beautiful “outdoor” style mall that’s clean It’s got all the big brand department stores, all the chain stores, and loads of designer shops too - something for everyone. Great cafes/ coffee shops too. Really close to Waikiki so very convenient. \n",
  "Massive mall...goes on for years. You can spend a whole day here if not more. The selection of stores is probably one of the best in the USA. It is on par with some of the best, biggest malls in Southern California and probably better quality. It’s just crazy how many high end luxe stores are here. The shopping in Waikiki is off the hook anyway, but this seals the deal. I love Honolulu shopping. "
 ]
},{
 "name": "Tantalus Lookout Puu Ualakaa State Park",
 "address": "Round Top Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/82/06/0d/20160810-140015-largejpg.jpg",
 "tags": [
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d4295521-Reviews-Tantalus_Lookout_Puu_Ualakaa_State_Park-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "We made a quick drive up the hill and were glad we did.  You can see WAY more than I can describe here.  Parking is limited, so go early or just be patient.  You can park a little down the hill and walk to the lookout.",
  "What a view! A short drive up the mountain results in a vista beyond compare. There's not much parking, so be prepared for the possibility that there will be not parking spaces available when you arrive. We drove up on a Thursday afternoon and had no parking issues. \n\nWe stayed about fifteen minutes and took quite a few photos. There are informational signs indicating what you are seeing and providing some historical background.\n\nThere is no charge for this spectacular attraction. Be sure you don't miss this!",
  "Highly recommend driving to Tantalus Lookout Puu Ualakaa State Park for its spectacular view of Honolulu.  Only takes about 90 minutes or so but be careful due to the somewhat winding road going up and down the mountain.  Use low gear coming down hill to help slow your vehicle along with your brakes.  No need to rush.  Just take it easy and enjoy the natural beauty all around you.",
  "We visited this state park as part of the \"Book 'em Danno\" tour and the view is breathtaking. Looking out over Waikiki, Honolulu and Diamond Head is spectacular. We were treated to a rainbow while we were there.",
  "The drive up is a perilous twisty road through a tawny neighbourhood. This alone makes it a site to visit, if you're not the one driving. The view from the top is fabulous. The entire South half of Oahu is visible on a clear day. I only wish we couldn't have stayed to watch the sunset.",
  "Make sure you have a good map when you go up Tantulus. There is no straight way up and the road twists and turns but it is a fun drive and at the top you have a view of Honolulu and Waikiki that is breathtaking.  If you continue down the road you will end up on Punchbowl and that leads you to the Pacific Cemetery. \nDo this on a clear day with the sun shining although some clouds would make it interesting especially as sunrise or sunset.",
  "Make sure you arrive early as labor clouds ofter come in to cut the views. This is also a real great location for those great night-time lights shots.",
  "Very pretty drive and a nice view. I don't know if we would go out of way to do this, the weather wasn't great for hiking that day so were looking for something else to do. I feel like the loop too us 15-20 minutes to drive?"
 ]
},{
 "name": "Shangri La",
 "address": "4055 Papu Cir",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/b9/36/ec/shangri-la.jpg",
 "tags": [
  "tour",
  "art",
  "tour",
  "family",
  "historic",
  "art",
  "tour",
  "art",
  "knowledgeable",
  "tour",
  "art",
  "walking",
  "tour",
  "tour",
  "art",
  "walking",
  "tour",
  "history",
  "knowledgeable",
  "unique",
  "tour",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d261244-Reviews-Shangri_La-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The tour of the Doris Duke mansion, called Shangri-La, begins and ends at the Honolulu Museum of Art. Even if you are not particulary interested in Middle Eastern and Islamic art, this is a must-see! Room after room in this spectacular mansion just filled to the brim with art and artifacts that Duke either brought back from her travels, or had custom-made for her from pictures she took while abroad. The guides are extremely knowledgable and ever so gracious and you literally need to go more than once, to take in everything that there is to see. \nSince the reservation to be bussed to Shangri-La includes same-day admission to the Museum of Art and to Spalding House, we made a point to make reservations at the Museum Cafe for lunch when we returned. We then spent a couple of hours touring the Museum and the Spalding House, which are both delightful.",
  "I had recently been to Rough Point, Doris Duke's Newport, Rhode Island mansion when Shangri La was mentioned. Knowing I would be visiting family in Honolulu, I planned on visiting Shangri La during my stay. I made a reservation through The Honolulu Art Museum in advance and joined the tour of this marvelous mansion that the museum oversees. Like Rough Point, Duke made it possible for her homes to be open to the public. This mansion contains a large and beautiful collection of Islamic art, culture, and design in every room of this home. The siting is breathtaking...be sure to take in the dining room extension that overlooks the ocean. The tour guide was thorough and unrushed, something that is most appreciated and that seems to be disappearing from many historic home tours. Your fee also gets you a day ticket at the Honolulu Museum of  Art ( a fabulous museum itself) back in the center of Honolulu from where your tour group departs via Museum shuttle buses. Parts of the house are handicap accessible. You need to contact the Museum of Art way in advance to schedule this kind of tour of Shangri La. Visit the Art Museum website for more information. It is closed for annual cleaning and maintenance until December 18, 2018. ",
  "Formerly the summer home of American heiress Doris Duke, this mansion overlooking the Pacific hosts the second largest collection of islamic art in the US, only surpassed by the Met, and ahead of the Smithsonian. The house and grounds are just gorgeous, as are the furnishings and interior decoration, and our guide was extremely knowledgeable and informative. You must reserve tickets ahead of time, and the tour leaves by mini-bus from the Honolulu Museum of Art, as the mansion is located in a residential district. Whether or not you know anything about islamic art, we highly recommend this visit as part of exploring Honolulu. For us this visit was on par with other private mansions which are now open to the public, be they Hearst castle in California, mansions in Newport, RI, or Villa Kerylos and Villa Ephrussi in Villefranche-sur-mer in the south of France.",
  "No traveler to Honolulu should miss the Doris Duke estate, an architectural marvel in a hilly, residential area of the City with spectacular Islamic Art and gardens reminiscent of the Alhambra. Book tickets online through the Honolulu Museum of Art well in advance, since numbers are strictly limited. A shuttle takes you there and back from the Museum, and the tour guide we heard was well informed about Ms. Duke's life and collecting passions. No air conditioning there, so dress lightly since it gets warm in the interior rooms.",
  "Unbelievable, this home perched on the edge of the water West of Diamond Head. The glass wall...took the prize for most stunning. There is so much to see, the historical pieces on display are museum quality, and Miss Duke had more moola than any museum. \nYou must see it for your self. Make reservations early, wear comfortable shoes as there is lots of walking.\nEnjoy!",
  "Go early before scheduled tour or stay late to enjoy museum. Charming little restaurant at museum to have lunch. ",
  "Tickets through Honolulu Museum of Art, which shuttles you to site near backside of Diamond Head.  Includes ticket to Honolulu Museum of Art exhibits after you tour.  Tickets sell out quickly with around 30 at a time split into 2 groups for 90 min tour.  A very nice collection of islamic art and furnishings/decor and house dating from 1920s and 30s. $25 per person.  Great views of coastline.  Beautiful grounds.\n\nHonolulu Museum of Art is also a large, fantastic collection of asian art from all ages.  Well worth it.",
  "My wife and I went to Shangri La in October. When the entrance door in the parking area opens to the view of the long lake bordered by trees with geometric designed water aspects, all you can think of is \"This is just like the Taj Mahal!\nReally great docents keep the information coming.  \nThose interested in architecture, design and things middle east will be thrilled!",
  "This is a must see for everyone.  Doris Duke's collection is mind blowing and the architecture of her home that was built in the 30's is breathtaking. Our guide was so lovely, kind and knowledgeable of everything on the tour.  When we first arrived the outside of the home is so plain and our guide said that once we entered, it would be like walking into a jewel box and she was right on!   Such history and the largest collection of its kind.  This was my favorite part of my trip to Oahu.",
  "See what money and good taste could buy and create in the '30s.\nArt and architecture of the mid-East brought to California. A unique and very interesting tour.",
  "Doris Duke built  Shangri La in the 1930’s near Diamond Head. Most of us will never travel to Iran, but this home, now a museum , gives us beautiful examples of tile work & furniture from Iran. A must see when you are in Honolulu!"
 ]
},{
 "name": "USS Bowfin Submarine Museum & Park",
 "address": "11 Arizona Memorial Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/92/a6/d5/photo0jpg.jpg",
 "tags": [
  "historic",
  "walk",
  "history",
  "tour",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d153923-Reviews-USS_Bowfin_Submarine_Museum_Park-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is part of Pearl Harbour. Keep in mind that you are not allowed to take any kind of bag inside Pearl Harbour. However, you can load up your pockets with whatever you want and there are lockers available. \n\nYou get to walk all the way through and on top of this historic WWII submarine. There is a memorial for WWII submarines there as well.",
  "There is a lot to see here besides the Pearl Harbor USS Arizona. The Bowfin Submarine is one amazing piece of machinery and history. I know it is expensive to visit everything, but pick wisely, if you don't think you'll be back, do try to cram it all in. ",
  "I skipped visiting the Bowfin at my last visit to Pearl Harbour and opted to visit the Arizona memorial in addition to the Missouri and the Naval Air Museum. The Arizona memorial was closed on our currentvisit and we were pleasantly surprised by the quality of the Bowfin exhibit. Touring the submarine  is not recommended for people with mobility issues or suffer from claustrophobia. \n\nIt is impossible to visit all four major museums in one day as the dismal bus service has long lineups and wastes about 2 hours of valuable time. This long delay is unacceptable when very steep admission fees are charged.\n\nThe Bowfin was launched exactly one year after the Pearl Harbour attack and was stationed there. It had a stellar fighting record. The submarine is meticulously preserved and maintained and the audio guide that is provided is excellent. The visitor gets a good idea of the rigors and danger aboard a World War 2 vintage submarine.\n\nIt is a tough call as to which of the four major museums to skip if pressed for time. I would skip the Naval Museum next to the submarine, get a ticket for the Arizona Memorial, visit the submarine while waiting to go to the Arizona then take the dreaded shuttle to the Missouri and save time for the Air Museum at the end of a long day",
  "This attraction is at Pearl harbour and incurs additional charge.\n\nThis was our first trip ever on board a submarine.\n\nWe really enjoyed the experience and Im glad its not us as I would feel far too claustraphopic.\n\nIts a must experience at Pearl Harbour after the # 1 attraction the USS Arizona Memorial.",
  "Hats off to the sailors who served aboard these boats. The cramped quarters make you feel claustrophobic, and you're not even submerged. An excellent experience as part of your Pearl Harbour day. Try and go here early when crowds are smaller.",
  "I have been in a German Submarine on display in Chicago and a Russian Sub in San Diego. The Bowfin is in Pearl Harbor and is at the Arizona Memorial. off to one side. If you have never been in a sub you should go just to see how compact the boat is. You get a headset and recorder for your tour.",
  "It is amazing how so many people can fit in these submarines in such a confined space.  Sleeping quarters where the torpedoes launch.  Very brave men!",
  "This tour is done with an audio piece, they hand you the equipment, that you wear around your neck, and they give you ear buds that you keep after the tour. this was very interesting to see how submarines were and how compact everything was in there, have to hand it to the people that are in the Submarines. the tour was informative, as you  switch Compartments in the Sub the Audio changes, so you may not want to walk to fast through, you may miss some of the Audio. we had a 11 am viewing of the Arizona but had arrived at the Memorial site when they 1st open, this gave us enough time to take the tour of the USS Bowfin and walk around the park beforehand."
 ]
},{
 "name": "Dolphins and You",
 "address": "307 Lewers St Ste 401",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/19/85/1b/dolphin-swim-tours-tend.jpg",
 "tags": [
  "food",
  "unique",
  "free",
  "tour",
  "music",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d1939947-Reviews-Dolphins_and_You-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "All crews and staffs are great. I had a great time with them. I wanna join this trip again some day.",
  "I expected this to be fun, but this experience was amazing! We were able to spot dolphins right away and with them were 2 whales! We had to wait till the whales separated for safety, but it was so cool to see! We saw the dolphins lots of times under the water and above. Then we went to a spot to go snorkeling where we saw a massive turtle, schools of fish, an eel, and octopus! The giant water slide was a hit! The food was great. The best was the attitude of the crew, so great and made the experience! Be sure to book the photo package James was great at getting the right pictures! Thank you Dolphins and You! ",
  "Had a great time. We saw dolphins, a whale and a turtle! The entire crew was fantastic (Yogi, James and Eddy), and did a great job taking care of us. They had a gluten free burger option which was much appreciated and drinks for purchase. The water slide was a fun and was entertained from the moment we stepped onto the bus and boat. We also got a brief luau dance show, so all and in all, an unforgettable experience. It was definitely unique from other snorkeling experiences we have had in Bali and Mexico.",
  "Fun trip just a short distance off shore from dock and saw dozens of dolphins and and a few turtles, some schools of fish.   Had a veggie burger and chips and and some pineapple slices.    Drinks for purchase with water free.  Slide for the young at heart.   A little hula demo and music.  Wife loved the snorkeling.  Crew was great and kept a close eye on everyone.   Shuttle picked us up at our hotel as part of price.\n\nWe purchased a USB stick with most all photos taken by tour photographer.   If there is any chance you will buy this package, get the bracelet so the photographer pays attention to you.  USB stick is a striped down stick with exposed prongs in keychain type case.  Must figure out how to put in a older style USB port the right way.  No documentation with the chip mailed to us so email the company for instructions.  USB chip contains photos taken on day, set of nice photos taken at other times, movies taken the day of the trip and a promo movie, as well as a video by owner of the company.  Lots of stuff in hires.",
  "Such an amazing experience!! We got served lunch and got to watch the crew on the hula!! 10/10 would recommend "
 ]
},{
 "name": "Ala Moana Beach Park",
 "address": "1201 Ala Moana Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3a/54/e1/lots-of-wedding-pictures.jpg",
 "tags": [
  "walk",
  "active",
  "walking",
  "walk",
  "walking",
  "free",
  "free",
  "kids",
  "walking",
  "walk",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d255184-Reviews-Ala_Moana_Beach_Park-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "You can walk from Waikiki to here about 20 minutes nice beach 🏖 park and big shopping mall right there too !! Be careful with your personal thing at the beach 🏝",
  "Ala  Moana beach park is a hidden gem in the heart of Waikiki the activity the people the vistas the walking is all the best it’s a very active place and many wonderful events take place there on holidays and special days  including floating 7000 Legger candles on memorial day in honor of loved ones I highly recommend if you’re in Waikiki",
  "This beach park has it all.  A beautiful sea wall for a nice walk or run at anytime of day, calm waters for a swim or paddle boarding and a huge green space for sports, a relaxing picnic or nap under a tree.  We managed to do all these things upon a few visits here.  We even stopped by Friday evening and had an amazing view of the fireworks display from the Hilton Hawaiian Village.  \nA nice escape from the busier Waikiki Beach.",
  "Great beach with lifeguards, a small L&L walk-up restaurant, showers/restrooms and plenty of parking. Water is very calm and great for swimming or paddleboarding. Come early to avoid the crowds and grab a parking spot in the lot. Otherwise you'll have to park in the mall.",
  "One of the things that always fascinates me is the multitude of cultures and ethnic groups here. This is reflected most notably in the variety of cuisine and emphasis on a healthy lifestyle. If you want to see this firsthand, look no further than Ala Moana Beach Park, located 5 minutes from the heart of Waikiki! You will observe folks of all ages and cultures walking, jogging, stretching, swimming, standup paddling, surfing, frisbee throwing, biking, and even playing softball, lawn bowling, kiting, and radio controlled toys. This is their secret to long lives - play hard and reduce stress! Bring your own water as the nearby concession stands are pricey! Parking is also FREE but fills up quickly before late morning! Alternative parking is available across the boulevard at nearby Ala Moana Shopping Center. Weekends are packed so plan a very early start to access parking and premium park spots near showers and restrooms and shady trees.",
  "If you want to explore this park, do it during the week because weekends the park is packed with activity, and there is no place to park your vehicle.  The west side offers a nice lifeguard-monitored beach, the east side has amazing views of Diamondhead.  Across the street is Ala Moana Park, which is one of the largest malls in the US.  Consider parking there and explore the mall's wonders before or after the park.",
  "Ala Moana Beach Park is a free public park a short stroll from Ala Moana Center.\n\nThis park is located between Waikiki and downtown Honolulu. \n\nIt also has a pleasant sandy beach.",
  "We have visited Waikiki three times but this was the first time we went to this park.  Don't miss this park. Next time we will  go to this park instead of Waikiki beach.  There are benches to sit on, grass or beach to lay on.  There are way less people that Waikiki beach, and it's a beautiful location with a great view of Diamond Head.  This park would be great for small kids to swim at as it is calmer.",
  "We felt safe in the Park, with all the other people picnicing and walking to view the fireworks.  The area was lit up enough for us. We found our way to view from the Ala Moana Park the Hilton Friday Night Fireworks.  The park is situated across the road from the Ala Moana Shopping Centre where we had dinner before seeing the fireworks.  Then after the Fireworks we were able to cross the road to go back to the Ala Moana Hotel where we were staying.",
  "My wife and I visit this beach park a couple of times each holiday.  We walk from out condo up near the zoo, and it takes us about 45 minutes to get there.  We take a change of clothes so after the swim we walk across to the Shopping Centre and have lunch, the get the $2 trolley back to our place.\n\nAlways relaxing and never busy, mainly locals.  Usually see a couple of turtles as well which is nice.\n\nGreat spot to have a picnic too.",
  "Although not totally \"back to nature\" at this park, we do enjoy the setting and the friendliness of those that come to hang out at the park..\n\nWe enjoy the time here with some of the areas that provide some escape into shade.. cant be in the sun all the time!\n\nWe will return to enjoy some time at this park on the west end of Waikiki.."
 ]
},{
 "name": "Magic Island",
 "address": "1201 Ala Moana Blvd At the end of Ala Moana Beach Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ab/0b/a7/beautiful-spot-to-bike.jpg",
 "tags": [
  "walk",
  "walking",
  "tour",
  "family",
  "walk",
  "walking",
  "free",
  "family",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d561036-Reviews-Magic_Island-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "A beautiful area to walk or jog around. Has a sidewalk that goes around it. Have to go early for parking as Ala Moana Beach Park gets full fast. The beach is so nice.",
  "This is the place that folks go to exercise, morning, noon or night.  Walking, running, swimming at Ala Moana Beach Park, surfing outside the reef, body boarding on the west side of Magic Island, body fit classes, yoga, yoga on SUP boards, stand up paddling, even cyclists on indoor trainers training outdoors, it is all here.   It gets crowded at times...patience is a virtue.\n\nOn weekends, this is a gathering place for family and friends to get together for camaraderie, celebrations, or even special sports events.  In the mornings there could be running events, triathlons, or SUP/outrigger events.  Fishermen will also fish usually on the western side of the island.  It is about a mile in circumference, add another 2.5 or so if including Ala Moana.\n\nIn the evenings, the smells from BBQ is in the air, and sunsets can be pretty spectacular.  Many folks including tour buses arrive on Friday evening to check out the fireworks which can be seen from the eastern end of the island looking towards the Hawaiian Hilton Hotel.  Come about 30 minutes before the fireworks are due to go off as many tour buses arrive with about 10 minutes to go.   The show usually lasts 4-5 minutes.  Not long but pretty entertaining.\n\nThere are some homeless folks in the park...pretty harmful, never a bother, spare some change or help if you can but they usually never ask here.\n\nIt is a park for locals, if you surf be respectful, don't asset yourself until you prove you belong and you'll have no problems or issues.  The local surfers are friendly if you are...ask questions about where to paddle out, there are some places to paddle out, places to walk across the reef, some places to avoid.  \n\nOverall, Magic Island deserves its name...it is magic.\n\n",
  "Very popular beach park for locals. Only crowded on weekends and holidays. Beach is a bit stony, recommend sand shoes, but plenty of space for swimming, barbecues, picnics, walking and jogging. Great views of Diamond Head, Marina and the ocean. Plenty of free parking, except during special events. The annual floating candle event takes place here, well worth a visit. Very popular for weddings and scenic wedding photographs. Don't be surprised if you spot five of six brides in formal white wedding dresses, jumping in the air with their grooms for that special photo!",
  "A lagoon out in front of the Island park offers calm waters for your family along with nice picnic areas spread out throughout the park",
  "We happened upon this park / beach as it's directly across from the mega Ala Moana mall. There were barely any people there which was a treat after all the busyness of Waikiki beach. The \"lagoon\" is an awesome place to swim and the waves pounding the break wall was amazing to watch. There was a lifeguard so it's a safe area for families. We thoroughly enjoyed our afternoon there. ",
  "Beautiful location just next to west end of Waikiki with great beach, grass, trees, view of Waikiki, and lagoon for quiet swimming.  Visited on bicycle tour. ",
  "I'll always stroll here \nLocals fill in, the culture is awesome\nSend the wife to Al moma shopping mall and hang out here",
  "we went and did some mermaid swimming and snokeling here it was a great little beach with plenty of room to swim and relax "
 ]
},{
 "name": "National Memorial Cemetery of the Pacific",
 "address": "2177 Puowaina Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/12/d7/a0/picture-of-the-cemetery.jpg",
 "tags": [
  "tour",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d131531-Reviews-National_Memorial_Cemetery_of_the_Pacific-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "our driver from the Pearl Harbour tour took us to the Punchbowl cemetery.Of any cemetery I have visited it is the most impressive .The bowl which is a long ago volcanic crater provides a feeling of seclusion and the trees are so perfectly manicured they provide a true feeling of privilege for those who are buried here . The monuments are impressive as well. The view of the city on the trip down the outside is also nice. At first I thought a cemetery was not on my agenda but I'm glad I seen this one .\n\n",
  "In addition to being the Arlington Cemetery of the Pacific, with all of the history and reverence that entails, the views from the top of Punchbowl crater, where the cemetery is located, are phenomena!  There are amazing views that span all of Honolulu and Waikiki beach, along with the lush, green volcanic mountains to the north, and Diamondhead to the east. We swore you could almost see to Ko Olina in the west - the views were that expansive!  It's a short drive from Honolulu (about 10 minutes from Iolani Palace and the statue of King Kamehameha), and worth the trip.  There are rest rooms on site but this is a place of remembrance, so it's not meant to be a bustling tourist hub.  It has not been busy with tourists the three times I have been there, so plan for a short, serene trip to remember our fallen heroes and take in the fabulous views.",
  "This cemetery is a must see if you enjoy history. It is one of the largest military cemeteries outside of Arlington. Most of the graves are from the Pacific wars and you see Pearl Harbor graves as well as Ernie Pyle- war correspondent and the Challenger astronaut who was from Hawaii. These graves are located in the main area as you drive in go towards the climbing stairs and as you come around the big loop they are located on the front row on your right side if you are exiting. You can also go on their web page for a detailed map. Climb to the top of the stairs to see the amazing maps of the wars made out of crushed glass/stone. We were there Memorial Day and they had tons of flowers from all over the world that were brought in. So moving to remember their sacrifices. This is inside of a volcanic crater and has amazing views to the city below. ",
  "A friend recommended we go to the \"Punchbowl\" during our visit to Honolulu.  I expected a regular military cemetery but the location of this cemetery is awesome.  Especially after touring Pear Harbor the day before.  Very somber.",
  "This was closed this visit but I had been there before. We could go to the eternal flame but not the the cemetery. Touching. A must go",
  "This is a very well kept, clean, calming place to stop. It's immense and incredible. It gives a bit of a sense of awe here.",
  "I have been to Arlington and The Normandy Cemetery. This one is just as awesome as those two. The cemetery is located in Punchbowl which is the inside of an extinct volcano. The headstones are all laid flat so no crosses like in the other two but just as sacred ground as they are. \nThere is a memorial that shows maps of the wars.- WWII, Korea, and Vietnam. Information is given at that memorial. \nThere is a map that give locations of Ernie Pyle the writer, Ellison Onizuka from the Challenger explosion, Sen Danial Inouya and his wife, and the first Unknown from the USS Arizona.",
  "This cemetery is in a old crater and it has great 360 degree views. The interior marble floors has where all the Pacific battles were fought during WWII. There are also columns on the wall of all of the missing. I have a couple of cousins on these columns. This is one spot where I would like to join my cousins. "
 ]
},{
 "name": "Fort DeRussy Beach Park",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/35/10/56/fort-derussy-beach-park.jpg",
 "tags": [
  "affordable",
  "kids",
  "eat",
  "food",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d1813657-Reviews-Fort_DeRussy_Beach_Park-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The park is well maintained with the Hale Koa being the main attraction.  Good affordable restaurants and well located parking make this worth the stop.",
  "A lovely oasis right on Waikiki beach. With all the hotels and tourists lined up along the beach it was wonderful coming across this park in which to relax and get away from the busyness. ",
  "This is a beach north of Waikiki down to the boat harbor. There is a large park that is inland of the beach which is quite nice and shaded for those hot summer days. The park also includes the Army Museum.",
  "This has to be one of the best beaches in Waikiki, if for no other reason than the amount of spacious sand to hang out on.  You really have everything at this beach:  Water and Beach rentals (discounts if you have your military ID) - Volleyball Courts - Food Concessions - Nice safe low water for kids - Deeper water for adults; and now for my favorite part:  Sea Turtles, yes - just offshore about 3/4 of the way out to the white buoys you can see the Hawksbill Sea Turtle.  This area has whats called Sea Lettuce on the bottom about 15 feet down, which the Sea Turtles love to eat.  So because they have to come to the surface for a breath about every 10 minutes, you can see them surfacing and hanging out for 10 to 15 seconds (as long as you stay clear and they do not feel threatened) before diving back down for more Sea Lettuce.  If for any reason you are not able to enjoy viewing the Sea Turtles and would like to see them, just google:\nthomas filming sea turtles and all of my youtube videos will come up - I freedive and film them both on the surface and on the bottom - this is accomplished only after special care is taken to allow them to acclimate to my presence - you should never lunge at or attempt to touch them, this scares them and they will dart away from you immediately!\nSo yes, I highly recommend this particular beach over any other in Waikiki.\nHave a safe blessed vacation - Aloha ",
  "Fort DeRussy is a nice place to get away from the hustle and\nbustle on Honolulu . A lot of shade for a long walk and also\nsome pockets of history located throughout . A good place to take the little ones to run around"
 ]
},{
 "name": "Aloha Stadium Swap Meet & Marketplace",
 "address": "99-500 Salt Lake Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/4c/7e/93/wandering-through-the.jpg",
 "tags": [
  "unique",
  "cheap",
  "eat",
  "cheap",
  "walk",
  "food",
  "tour",
  "walk",
  "food",
  "family",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d595643-Reviews-Aloha_Stadium_Swap_Meet_Marketplace-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Since they’ve transformed the International Market into an upscale shopping mall, this is the best place for souvenir shopping and interfacing with the locals. I keep seeing posts saying to get there early but I don’t know If that’s necessary as there’s plenty of junk to go around. What I would recommend though is getting there before noon since some vendors start breaking down their booths to go home after lunch. But make the lap around the Stadium at least once before you buy to make sure there’s not a better deal or something else you like better before you buy since all sales are final with most vendors.",
  "GREAT DEALS, this is your typical flea market setting, with great souvenir prices, something for everyone, we were on a time schedule and was able to see all it had to offer, came home with souvenirs for everyone",
  "Open: Wednesday, Saturday, Sunday (closed during Football games)\n\nIf you’re looking for cheap souvenirs, this is the place, I compared the prices to the ABC stores and Dukes Lane but Swap is still the cheapest, approximately half the price or less especially if you are buying many gifts. The stalls are situated around the Stadium which is very large, but many of the stalls become repetitive eg, t-shirts, jewelry, magnets, soaps but there were some unique ones, prices can vary by stalls and bargain if possible.\nBus 42 or 20 from Waikiki and will take approximately 1 hr, it’s 1 stop after Pearl Harbour, there is an entry fee of $1 per person. I went 2 days during my stay as the saving adds up for my bulk purchases.\n\nNote: There are not much food/drink stalls and it can get very hot as it’s outdoors.",
  "Worth going to on Wed, Sat or Sun - I think 10-3pm.  Get there early if possible as it will be cooler and give you lots of time to go through it.  It's very close to Pearl Harbor stop if you want to do both, but you need to reserve well in advance if you want to ride the boat at Pearl Harbor. Great place to find all your Hawaiian deals and souvenirs in one location for reasonable prices.",
  "This is my favorite place to shop for all things Hawaii!  Allow ample time and you may want to leave unwilling parties at the beach or hotel because who wants to ruin a fun shopping experience.  It can get very hot as this takes place in a parking lot so wear a hat and bring water.",
  "Get there early if you can because parking fills up fast.  We arrived at the Swap Meet at 8:00am and picked up a prime parking spot.  We got there so early that some vendors were still setting up or haven't even arrived (empty stalls).  Buy all your cheap souvenirs here.  This is the largest Swap Meet in Hawaii.  The vendor stalls are located on the outside of the stadium parking lot and goes on and on and on.  We only covered about 50% of the area because we started noticing a repeat of products - TShirts 7 for $20, magnets 10 for $10, bags and hats and aprons, and fresh cut fruits.\n\nTIPS:\n- don't buy at your first stall, walk around and find the best price.  I bought one bag of fresh cut mangos for $5, but a few feet away they were selling at 2 for $5\n- eat your breakfast or lunch before you arrive because they don't sell much prepared food, just shave ice, coconut water, fruit, and bread.  We were desperately looking for coffee and had no luck (just samples).\n- we paid $2 for admission before we entered the parking lot, with in and out privileges.",
  "The Swap Meet is basically a lot of vendors set up in the parking lot of the arena, all the way around.  It takes a long time to do the full circuit.  Don't count on food or drinks or washrooms.  It's worth spending a couple of hours, especially if you want souvenirs.  I saw the same bags being sold for 2 to 3 times the price at other shops, and regretted not getting more at the Swap Meet.  And folks, no need to book a tour to do this!  We got there easily by bus and then you just walk around on your own at your own pace.",
  "Visited the Flea Market on a Saturday...and it is big. My wife and I went a little later in the morning and found some of the vendors already closing up. But there were still plenty of vendors left. \n\nThe Marketplace wraps completely around the stadium. If you are looking for souvenirs...this is the place. After visiting a luau earlier in the week, and purchasing a souvenir there, we saw the identical item here at a 1/4 of the price. Oh Well.\n\nThat being said...THIS is the place to do your souvenir shopping.",
  "I go to the Aloha Stadium swap meet/ flea market every year. It is absolutely huge  and although I walked around for about 2 1/2 hours I only covered half of the stadium. the market is open to the public on Wednesday, Saturday and Sunday. It closes at 2:30 PM. I would highly recommend going in the morning while it’s still relatively cool. It can be very hot in that enclosed space so please take a hat, sunscreen,  sunglasses and make sure you bring a bottle of water. The items are all new which is something that is different from the  usual swap meets .You will find a variety of clothing,  Hawaiian crafts, food and all sorts of interesting, unusual things. It is a great place to buy souvenirs and to pick up T-shirts for the family and friends back home. It is absolutely great fun and I highly recommend it for you and your friends providing you’ve got the time. However if it’s your first trip to Hawaii, And your vacation is limited to a week, in my opinion there are other things that might be more important such as the Bishop Museum or the Polynesian cultural Centre. I took a shuttle from Waikiki Beach cost $16 return.",
  "This is a huge marketplace and yes many of the tents are repetitive items but that also gives you a choice in variety as they are not always the same exact items. Prices on items such as t-shirts, Hawaiian shirts, etc are MUCH better and ABC store or even Duke's Marketplace in Waikiki, so dont be fooled! Another thing is that we wanted a wooden mini surfboard to take home that was carved in Hawaii. Many of those items we saw in the shops had \"made in Indonesia\" on them. We got one done and actually watched the man carve it so we know for sure where it was done. There IS food and restrooms available it is just not with the vendors but at the entrace of the stadium so again, dont be fooled. We were even told by a local Firefighter that this is the best place to shop for souveirs!",
  "Had a great day at the swap meet market place. Prices were great, people very friendly. If you want things to bring back for an awesome price this is the place to go. We went early so the weather was great, started to get warm later in the day."
 ]
},{
 "name": "Waikiki Beach Walk",
 "address": "Lewers Street Between Kalakaua Avenue & Kalia Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/eb/96/92/caption.jpg",
 "tags": [
  "walk",
  "walk",
  "walk",
  "music",
  "walk",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d637236-Reviews-Waikiki_Beach_Walk-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Waikiki Beach Walk is a street in the center of Waikiki which has great restaurants.  The main block includes Yard House, PF Chang's, Cheeseburger in Paradise, Ruth Chris Steak House, Giovanni Pastrami, Taormina Sicilian Il Tappo Italian Restaurants.\n",
  "Very nice walk from the harbor all the way to Diamond Head\nPlenty of different things to see and do along the way while ocean is always along side you",
  "A simple stroll along the Waikiki Beach will give you plenty of opportunity to watch surfing, volleyball, and other beach activities on some of the prettiest white sand beach you've ever seen.\n\nVery picturesque, with plenty of benches and shady areas to take a break from the heat.",
  "This is an amazing walk with views to the ocean and Kapiolani Park with palm trees and salt in the air. After dark the lights of Honolulu reflecting on the ocean is a good reason for an evening walk. ",
  "We did the famous Waikiki Beach Walk many times during our stay in the area.\n\nThis area is where visitors  come to shop and dine and just have fun.Its an open-air promenade that is the hub of live music, nightlife, dining, bars  and  shopping.\n\nIts in the evenings when the place is really buzzing with people.",
  "First trip to Oahu and I was able to experience pretty much the entire island since I drove to North Shore and back a few times. This is by far my favorite area, not only are the shores laid back it is beautiful with a fun atmosphere. Even staying at a 5 star resort on the north side of the island, I missed Waikiki.",
  "The walk is nice in the morning before people get on the beach but once there it is too crowded. Not a relaxing fun time really as this could be LA beaches with all the people. Leave Waikiki to find better beaches unless you like people watching.",
  "A great place to watch people, but has a lot of homeless and is pretty sketchy at night. Although I never felt unsafe because there's SO MANY people/tourists walking around. "
 ]
},{
 "name": "Kapiolani Park",
 "address": "3840 Paki Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/64/ba/e0/all-ombra-delle-palme.jpg",
 "tags": [
  "walk",
  "parks",
  "kids",
  "art",
  "history",
  "walk",
  "walk",
  "music",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d131397-Reviews-Kapiolani_Park-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Kapiolani Park is an older park on the east end of Waikiki. It is a lovely large  park with beautiful trees and flowering bushes. It is right off Waikiki Beach, so a delightful, relaxing place to sit and enjoy the ocean waves coming in. Many sit, walk and run throughout this park. All the parks are so beautiful with palm trees!! Favorite part of the warm, sunny visit to Honolulu!! ",
  "We walked through this park several times. It is very pretty and lots going on with yoga and kids soccer and picnics etc. It is a nice break from the city and there are lots of Banyan trees to admire.",
  "King Kalakaua gave this Park to his Queen Kapiolani ! Beautiful place with Showers , toilets , picnic tables , tennis courts , exercise area , very well kept and police patrolled",
  "Nice park area with lots of birds, close to Waikiki Beach.\nKeep an eye out for the Green Parakeets, best seen at dusk.",
  "Kapiolani Park is the place to go for gentle walks and shady (or sunny) picnics. It's also a hub for sports, cultural events, entertainment, art festivals, and concerts. -Check their event calendar for the latest.- The park is also home to a mix of Rainbow Shower Trees that explode with color in the summer. It's a wonderful place for a getaway when you're tired of having all of that Waikiki sand collecting in your shoes.",
  "It's a big park with an ugly history.  Gets hot in the summer so go early in the morning.",
  "Beachfront with Lush green grass, towering Banyan trees, public restroom. Open air showers. Perfect place to spread out and enjoy a Hawaiian day soothed by a symphony of bird songs and breaking waves in the background.  Never seems crowded- even on weekends.  Little cafe there—Barefoot Beach- serves great lunches and smoothies.  Can walk across to the Honolulu zoo or aquarium.  Plenty of metered parking with 4 hour time limit. ",
  "Just a short walk from the hectic bustle of Waikiki, Kapiolani Park is a place to walk, sit and have a picnic, go for a run or play tennis, bird watch or just sit and enjoy the serenity of Hawaii.",
  "We walked through Kapiolani park a couple of times while visiting Waikiki. Close to the Zoo and the Aquarium.",
  "a must  to walk along beach or go swimming  . lots to nsee  . there were people playing hawaiian music and doing the hula  not sure they are there every day",
  "We had been to the park previously, but had not explored the tennis courts.. in fact we were looking for pickleball courts.. and we did find one .. we enjoyed a couple of hours of play.. only one pickleball court but two sets of tennis courts...\n\nThe park is home to all kinds of activities depending upon what is going on at the time. A fairly large band shelter as well.. the park is great for locals and tourist alike..\n\nGreat spot to walk, jog, or hang out.. some pretty impressive trees too... Also home to the zoo .."
 ]
},{
 "name": "Royal Hawaiian Center",
 "address": "2201 Kalakaua Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/6d/42/2e/open.jpg",
 "tags": [
  "free",
  "art",
  "eat",
  "free",
  "walk",
  "food",
  "music",
  "free",
  "walk",
  "food",
  "learn",
  "cheap",
  "food",
  "music",
  "free",
  "walk",
  "food",
  "cheap",
  "eat",
  "food",
  "learn",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d316692-Reviews-Royal_Hawaiian_Center-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful shopping center in the middle of O’ahu. The center of the building has a tree in the middle, ponds, and walkways. You can sit on one of the benches and just relax in the atmosphere. Check their website for events as well.  Lots of different eateries in these open concept buildings. Lots of Asian fusion type restaurants. One of the stores as free cookie samples. Stores of note: Apple store, Forever 21, Hawaiian Island Art, Honolulu Cookie Company, Island Fashion, Island Slippers, Island Soap and Candle Work, Island Vintage Coffee, Island Vintage Shave Ice, The Lei stand, Mali Kai Chocolates, Organic& Natural (coming soon I am excited!), Sunglass Hut.",
  "We drove by this a couple of times while touring Honolulu and finally made it over one afternoon.  We had lunch at The Cheesecake Factory and enjoyed the shopping.  There is an attached garage with 10 floors of parking and its pretty easy to navigate.  Elevators take you to whatever floor you're interested in and there are signs with store details and maps everywhere.  Many high end designer stores but merchandise for all.  We enjoyed it.  We were there about 2 hours.",
  "I went to the center and saw a sign my first day in Wakiki. It is an easy 5 minute walk from almost all the hotels in the Wakiki area. The day I went, the center was advertising all kinds of cultural classes. I was able to attend the lei making class and the hula dancing class. Honestly, I thought it was going to be a cheesy class that not many people attend (as they are all free). However, I was pleasantly surprised. A beautiful, Hawaiian native taught about 200 people how to hula from her standpoint on the stage. I still remember it and love all the Hawaiian culture/words I learned from the hula, something I wasn't expecting to take from that class. I was also able to attend the lei making class (**this class is capped at 25 people so make sure you show up a bit early to save yourself a spot). This was also fun. We were taught the symbolism of the lei, about the flowers we were putting on our lei and obviously how to make a lei. The class was very fun and you obviously get to keep your lei! It's nice to see the work that goes into a renown symbol in Hawaii culture. This class was also taught by another Hawaiian native. She was just as kind and entertaining. On top of these classes, there are others that didn't fit into my schedule but I truly wish they did! Some include: basics of Lomi Lomi (the Hawaiian massage), a ukulele class, a weaving class and many, many others. Another thing I am super disappointed that I missed out on are all the free entertainment that they have at night at the center. I believe these included a hula show and maybe even a fire show. People often think of shopping at the Hawaiian cultural center, which is does offer an impressive amount of luxury shops, BUT it has so much more than shopping! Also, I didn't eat at the food court but everyone loves it there. Also get the best Acai bowl and cappuccino from Island Vintage Coffee, you won't be sorry. Anything you buy in the center gives small proceeds to schools in Hawaii- so you can feel even better about spending your money there. Bottom line: great for free cultural classes and events. I would definitely recommend it for all ages. I put the visit as friends, as I was with a friend but it can really be enjoyed by anyone.",
  "First, let me start by saying that The Royal Hawaiian Center was a great place to hang out especially if you stay in the hotels surrounding it.  From the quiet, peaceful atmosphere of The Royal Hawaiian Hotel, this is a very convenient shopping, dining, and activity center.  There is a huge parking lot in this place so parking is not a problem either.\n\nThis is the first place that my husband and I hit when we arrived in Honolulu from a long plane ride.  We wanted quick and ready-made food and we \"discovered\" the food court which met our immediate need to be fed.  After exploring the next day, we also discovered a lot of mid-range restaurants as well as high-end restaurants in the Centre.  \n\nThis place is made up of 3 buildings connected by bridges.  You are essentially trekking on 3 blocks of Kalakaua Avenue.  We usually walked on the first level going in one direction, then take the second level to go back to where we came from. \n\nThere is so much to explore, you will not want to bring too much stuff to carry with you.  Use a sling for your camera, a small wallet for your credit cards, or a light shoulder bag.  Be as hands-free as you can, you might be carrying more bags by the time you're done shopping.  There's high-end shopping places such as Hermes, Cartier, Salvatore Ferragamo, Rolex Boutique, to name a few.  Or you can always venture to the Luxury Row for more high-end shopping.  \n\nBut, don't worry, there's always an ABC Store for virtually anything you would need from a bottled water, to anything you might want to munch on at the Royal Hawaiian Center.  They're still pricy because you're in Hawaii, but it's the cheapest (kinda like a General store) you will ever find here.\n\nDecember was a good time to be here because of the tall Christmas trees and beautiful decorations that abound.  There's always Hawaiian music wherever you go and there's also the more familiar Christmas songs.  There's constant activities going on.  My husband and I noticed that every night we walk back to our hotel, there's always a concert, which was free, at the Royal Grove.  \n\nThe Aloha and Christmas spirit mix so well and there's a lot of smiles being shared around, both from tourists & visitors and the natives of Oahu.",
  "check our the calendar of daily activities - you can learn how to make leis and play ukeleles. the food court offers great cheap and fast alternative to fancy restaraunts. We really enjoyed the burgers there. ",
  "First, let me start by saying that The Royal Hawaiian Center was a great place to hang out especially if you stay in the hotels surrounding it.  From the quiet, peaceful atmosphere of The Royal Hawaiian Hotel, this is a very convenient shopping, dining, and activity center.  There is a huge parking lot in this place so parking is not a problem either.\n\nThis is the first place that my husband and I hit when we arrived in Honolulu from a long plane ride.  We wanted quick and ready-made food and we \"discovered\" the food court which met our immediate need to be fed.  After exploring the next day, we also discovered a lot of mid-range restaurants as well as high-end restaurants in the Centre.  \n\nThis place is made up of 3 buildings connected by bridges.  You are essentially trekking on 3 blocks of Kalakaua Avenue.  We usually walked on the first level going in one direction, then take the second level to go back to where we came from. \n\nThere is so much to explore, you will not want to bring too much stuff to carry with you.  Use a sling for your camera, a small wallet for your credit cards, or a light shoulder bag.  Be as hands-free as you can, you might be carrying more bags by the time you're done shopping.  There's high-end shopping places such as Hermes, Cartier, Salvatore Ferragamo, Rolex Boutique, to name a few.  Or you can always venture to the Luxury Row for more high-end shopping.  \n\nBut, don't worry, there's always an ABC Store for virtually anything you would need from a bottled water, to anything you might want to munch on at the Royal Hawaiian Center.  They're still pricy because you're in Hawaii, but it's the cheapest (kinda like a General store) you will ever find here.\n\nDecember was a good time to be here because of the tall Christmas trees and beautiful decorations that abound.  There's always Hawaiian music wherever you go and there's also the more familiar Christmas songs.  There's constant activities going on.  My husband and I noticed that every night we walk back to our hotel, there's always a concert, which was free, at the Royal Grove.  \n\nThe Aloha and Christmas spirit mix so well and there's a lot of smiles being shared around, both from tourists & visitors and the natives of Oahu.",
  "We visited the Royal Haiwaiian Center several times during our stay in Waikiki.\n\nIts attached to the Royal Hawaiian Hotel, the second oldest  luxury hotel in the area. Its not hard to miss as its coloured pink and next door to the oldest hotel in Waikiki which is the Westin Moana Surfrider.\n\nThe mall is  a quiet expansive mall with lots of greenery surrounding.\n\nWe enjoyed a meal there at Noi Thai Restaurant",
  "We wandered through this and noted the shopping and restaurants.  This will be a higher end mall so you won't find cheap t shirt shops. At least we didn't but it was nice to stroll through and window shop.",
  "Nice outdoor mall. Some interesting stores that you don’t find elsewhere (hello Royal Hawaiian Golf shop) and some of the usual suspects. Nice selection of restaurants. A good place for some less pricey  places to eat. Just if you really want to get some crazy shipping done, go down the street to Ala Moana. ",
  "Many high end shops, but it also has an upstairs food court with coffee shops and Asian food etc.Undercover so you can keep out of the sun.",
  "The free cultural activities are great. We did the hula lesson and show as a group and it was really fun. There are shops as well. We went to the bakery and it was great. We had our bachelorette party here and it was a great choice. We got there early for the class sign-up and it was good that we did since it was pretty crowded. The lesson was fun and informative. Great to learn about the dance and language."
 ]
},{
 "name": "King Kamehameha Statue",
 "address": "417 S King St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/44/ab/1b/caption.jpg",
 "tags": [
  "tour",
  "history",
  "history",
  "learn",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d1895383-Reviews-King_Kamehameha_Statue-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Statue of King Kamehameha sits outside the Hawaii Supreme Court building, across from the Iolani Palace on South King Street in Honolulu, The statue is just a short 20 minute city bus trip from the Waikiki area. \n\nThe Statue is a popular photography location amoung Oahu tour groups, and often featured on Hawaii related TV shows, such as Hawaii 5-0.  \n\nThe Hawaiian Supreme Court building contains static and video displays which relate to Hawaiian legal history, are well done, and open to the public.\n\nThe Iolani Palace is also a recommended site when visiting the statue of King Kamehameha.  \n\n \n\n",
  "Wonderful statue great dimensions \nColorful full energy with the perfect surrounding stop by inside the building \nYou will learn some Hawaiian history there.",
  "Beautiful tribute to King Kamehameha!  Beautiful grounds and a beautiful location.  For anyone visiting Honolulu, this is a definite stop.  I feel it's a moving tribute to Hawaii's great King and all that he did for the Beautiful State of Hawaii.  Parking can be limited but we parked across the street and walked over.  Beautiful picture that I'll make into a note card for the holidays to commemorate my visit here!",
  "Very nice looking statue of the King in front of the State House and in a huge park downtown.  I took a long walk around this area and found this place a pleasant green space to break up the sea of downtown skyscrapers.",
  "The statue is located in front of the Aliiolani Hale building and across the street from the Iolani Palace. This was the third one that we have seen in the Islands. All of them look alike.",
  "If you remember the beginning of Hawaii 5 0 show, you will want to take a picture of yourself in front of this statue.  It is right across the street from Iolani Palace.",
  "This site is beautiful and explains the history of the islands very well. What was not so great was the amount of mustiness in the air inside the palace. We both have allergies and could not stay more than 15 minutes so some of the value of this experience was lost. There does not seem to be any ventilation and both of us were affected within minutes. Sadly we missed some of the history and hope we can get more information on line.",
  "Every photo I’ve ever seen of the statue of the great man had him covered with leis. But not when we visited. Guess that’s reserved for special times. Sill a very impressive sight. "
 ]
},{
 "name": "The Bus",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/8c/47/35/the-bus.jpg",
 "tags": [
  "cheap",
  "knowledgeable",
  "cheap",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d500858-Reviews-The_Bus-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "When visiting the Honolulu/Waikiki  area we never rent a car, we use The Bus.  Convenient, clean, with numerous stops, buses that come often, and it is a cheap way to get around.  Bus drivers are knowledgeable, helpful, and usually very accommodating.  A bonus: if you're 65 or older, show your Medicare card and you'll get a day pass for only $2! If you've just been swimming, the bus can be a bit chilly. The ubiquitous ABC Stores have maps of bus routes. Helpful hint: at each bus stop there is a number, use this,  rather than street names to find where you are standing.",
  "I purchased a Senior Bus Pass for $35 for a year.  You can go on any bus at any time using the pass.  Occasionally if the bus is convenient, I will jump on and ride for a couple stops.  With a smart phone, you can call a designated number and put in the bus stop number (easily visible at every stop) and you can get an estimated time of arrivall of busses at the stop.  It will give you information of the route number and estimated time of arrrival  in minutes nor time.  From my experiences, the estimates are very accurate.  Overall, I have found the bus drivers on Oahu to be very considerate and friendly.  It is not an easy job to drive in heavy traffic, inclement weather, late at night and calmly and respectfully answering questions, probably the same questions every day on routes with many tourists.  Senior citizens with a Medicared Card can show the card and ride the bus for $1 one way.",
  "One of the most wonderful things about Honolulu is that you can get anywhere on the bus, or as locals say, Da Bus. Download their app, called: Da Bus, where you can access route maps and schedules. It is one of the BEST DESIGNED public transportation systems I've experienced, and that is coming from a traveler who lives in a city with great public transport, and has taken public transport in over 20 countries. Tip: buy a \"day pass\" for the price of a round-trip ticket, and you can get on and off anywhere, any time for 24 hours - the best deal ever!!!",
  "We used the bus every day from Waikiki.  (rented a car for longer trips otherwise)  Worked well for us and felt more like travelers than tourists.  Go with the day pass and explore beyond the tourist spots.",
  "Used the day pass while visiting there.  We had the Google Map App and it was great!  Told us where and when bus is coming to the bus stop.",
  "We got day passes for 'The Bus' on several days while we were in Honolulu. Good value as the day pass is just double the one way fare.",
  "A daily pass took me from the airport to Waikiki area around noon then I could use the pass so many times in the afternoon to go to AlaMoana Shopping Center then to International Market Plaza and finally back to Ilikai",
  "When visiting the Honolulu/Waikiki  area we never rent a car, we use The Bus.  Convenient, clean, with numerous stops, buses that come often, and it is a cheap way to get around.  Bus drivers are knowledgeable, helpful, and usually very accommodating.  A bonus: if you're 65 or older, show your Medicare card and you'll get a day pass for only $2! If you've just been swimming, the bus can be a bit chilly. The ubiquitous ABC Stores have maps of bus routes. Helpful hint: at each bus stop there is a number, use this,  rather than street names to find where you are standing."
 ]
},{
 "name": "Lyon Arboretum",
 "address": "3860 Manoa Rd University of Hawaii-Manoa",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c6/96/c4/lyon-arboretum.jpg",
 "tags": [
  "unique",
  "hike",
  "free",
  "walk",
  "walking",
  "knowledgeable",
  "free",
  "hike",
  "walking",
  "nature",
  "family",
  "free",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60982-d255185-Reviews-Lyon_Arboretum-Honolulu_Oahu_Hawaii.html",
 "source": "TripAdvisor",
 "reviews": [
  "I discovered this place with my Go Oahu pass and I'm so glad that I did. If you have any interest in plants, trees, or mountains do this activity one day! It only costs a suggested donation of $5.00. You hike through their gardens into the mountains and at the end of the trail is a small waterfall. It is absolutely beautiful and the views are stunning. The gift shop is cute with unique, customized Lyon Arboretum gifts I didn't see anywhere else. I bought a t-shirt and some artsy kitchen towels. I spent six days on Oahu and this was one of my favorite afternoons! The trail to the waterfall is not too bad to hike, though there are some definite steep side trails.",
  "You absolutely need to visit this place while you're in Oahu. Most people will go in that area you visit the Manoa Falls, and you totally should, but on your way back from the falls make a quick stop at the arboretum. You won't regret. The entrance is right beside Manoa falls entrance. It's free but the common donation is 5$. \n\nYou can walk and explore for hours. It really feels like you're alone in the jungle.\nThe views are incredible. \nI am confident to say that this was the most beautiful view that I had during my stay in Oahu.  Yes it's a strong statement, because Oahu is so beautiful and has an incredible scenery all over the island. However, the Lyon Arboretum inspiration point is just breathtaking. The pictures don't do justice. \n\nAt the inspiration point, you can literally just sit there for hours, admiring the Manoa Valley mountains.\n\n",
  "A wonderful afternoon spent here, walking through the various gardens. Make sure to take your insect repellant and apply it frequently though! The staff at the Lyon Arboretum were knowledgeable, friendly and gave wonderful suggestions based on my interests in native plants. Highly recommend a visit here, worth the time, and the mozzie bites :)",
  "Very well maintained arboretum. Maintained by University of Hawaii. This was a free hike and at the end was a waterfall. However the fall wasn’t to abundant but the foliage along the was was great. Hike is about a mile but there are many paths (not as well maintained) that you could take. Nice outing",
  "It is a bit of a drive  from Waikiki and closes at 4PM so try to get there early.  The trails are still under construction but much of it is open to the public.  There is a visitor center and gift shop.",
  "When visiting Oahu if you like nature and being alone like myself to meditate and get away from the hustle and bustle of the city streets. This place is excellent to visit beautiful nature flowers, trees, and amazing walking paths. A must-do for people who love nature and serene laid back peaceful atmospheres.",
  "Both botanical garden and waterfall visit in one. Pleasant staff. Even gave us a spray of bug repellent since we were not prepared for biting bugs. Parking lot available.",
  "Maybe my family and I were confused, but we thought we would see a lot more flowers and plants than we did. It's free, but they ask you to give $5/person to get in. There's a lot to do here, but we wanted to see the falls. It's quite a hike up to the falls, and it's not paved. I wouldn't suggest doing the hike if you have mobility problems. We also did this on a day after it rained, so it was quite muddy too. However, once you get to the falls it's worth it. They are absolutely beautiful and provide a great photo opportunity. We were tired after the hike, so we didn't see anything else. I'm not sure if they have flowers and plants like a typical botanical garden/arboretum, but they do have a lot of beautiful scenery."
 ]
}]
