[
{
 "name": "The Houston Museum of Natural Science",
 "address": "5555 Hermann Park Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/24/03/0c/dinosaur-exhibit.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Luckily we visited the Museum on a Thursday when it is free entry for anybody after 2pm! There were no queues and the exhibits inside weren't that busy. There was plenty to look at and for a free experience it was very good, however I don't think it's worth the usual entry price. Nevertheless there is still lots to do and the exhibits are well maintained and detailed. We didn't attend any of the 'extra' exhibits, and in total we spent around 2 hours there. If you can go on a Thursday I would thoroughly suggest a visit.",
  "Great place to take the family. Butterfly’s everywhere. Lush landscaping. A wonderful learning experience.",
  "Museum was great.Is good for all age,very educational. They only think  I didn't like is there is no food court,they just have some table to sit at the lobby.",
  "We enjoyed an annual family membership to HMNS. It has a convenient parking garage, lots of general admission exhibits and interesting special exhibits as well. It is an especially good venue during the summer, when the weather is hot outside, and the kids can spend the day inside, exploring different specimens and cultures.",
  "What a shock 20.00 to park! The museum is wonderful! To do the “special exhibits “ it is very expensive! If you do just 2 of them it is 200.00 extra and there are more than 2! Not for budget minded families"
 ]
}{
 "name": "Minute Maid Park",
 "address": "501 Crawford St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/e1/e3/c9/0411161737-largejpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I live here in Houston but originally from NY, so i have 2 favorite baseballl teams. I must say of all the baseball parks I have been to around the country, Minute Maid is one of my favorite. Very clean and great food selection and many bars and restaurants in walking distance of the park. I also love the train that goes around the top of the park when the Astros hit a homerun. Cant wait to go back.",
  "Parking was easy with a quick shuttle to the field.  No problem walking up to buy tickets.  Just watch out for drips from the AC unit - we would definitely choose another section but options were limited that day.",
  "Take me out to the ball game. Such a great venue. It is clean and bright. The atmosphere is festive and fun.",
  "This is a great baseball venue. The seats are great and it is clean and well cared for.\nThe best thing is to take in a Astro's game whether it is during the day or at night.  They have a couple of tasty restaurants and of course snack bars. Their sport's shops have lots of great Astro memorabilia and sportswear. You don't need to worry about the weather because if it is too hot, they close the roof and keeps thing cool or if it rains, you stay dry.",
  "You must get here as soon as possible. Even if you aren’t a baseball fan there’s something for everyone"
 ]
}{
 "name": "Museum of Fine Arts, Houston",
 "address": "1001 Bissonnet St Add Parking Locations, Prices",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/0d/e8/2c/museum-of-fine-arts-houston.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I loved roaming the many galleries of European art, from the Medieval to contemporary. I  was also amazed at the amount of East Asian, Indian, and Islamic art they had as well. This might be a two day trip though, it's easy to get \"visual fatigue\" in a place like this.",
  "We went to Norman Rockwell exhibit.  was amazing and enjoyed the history lesson from early days, thru wars and peace.",
  "Our first trip to the Museum of Fine Arts was a most enjoyable experience.  We were thoroughly impressed with the way we were introduced to a few works and were immediately directed through a striking and sobering photo exhibit of the Great Depression and World War II that gave great insight to Rockwell’s work and caused us to study the remaining pieces even closer than we would have.  \n\nSince we only saw his nostalgic and humorous works when we were children, it was wonderful to see the serious subject matter toward the end of the exhibit.  It is not that human behavior changed from 1930 to the 1970s; how he was allowed to paint it changed dramatically. That man really laid his emotions on the canvas and the museum did a fine job of showing us why.  ",
  "We are members and went to see the Rockwell exhibit  and the Spanish treasures exhibit.  Both were very good.",
  "Went here by chance as the natural history and science museum was closed for the day. Lovely place. Had some heat paintings but also exhibits from Italian furniture to Egyptian, Japanese,  Indonesian exhibits. WEL worth a few hours of your time "
 ]
}{
 "name": "Children's Museum of Houston",
 "address": "1500 Binz St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/bc/e9/1e/children-s-museum-of.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of fun things to do - great learning experience for all. Innovative with a good verity off children learning experiences.",
  "This plase I reconmend for all families. The games were awsome for the kids to play. We had a wounderfull time.Be prepared to stay for a while.",
  "I was very surprised at all the hands on activities for the children. Our grandchildren, ages 10 - 18, LOVED it!",
  "There are 3 floors with about 20 different sections. Most are best for ages 4-7 Although the toddler area upstairs was good, there isn’t much to do fur small kids like our 2 year old daughter so I think it should be cheaper for 2-3yr olds. Good activity for a rainy day. ",
  "Depending on your view I tend to think of Museum as about the past but this children's exploratory uses gadgets galore to teach kids physics, chemistry, motor skills with careers and STEM guidance dotted around for good measure.  The huge climbing net at the back of the building I'd not seen before but created a great space for physical development, there were exhibits and try outs on physics, chemistry, visual holograms where staff helped to create your own hologram and Kidtropolis virtual city to try out different careers and act out different roles with your souvenir Kid Card also acting as your ATM card.   So much to do at a surface level we only had three hours and it really wasn't enough but you do get three hours free parking at the neighbouring park and their annual passes are good value.   We went on a regular school day for the US so it was lively but not really busy and that probably improved the experience as we could try everything without waiting for exhibits.   I'd happily go back again and again because each section deserves its own concentrated time, my only suggestion to the really very friendly staff would be perhaps to consider producing a guide sheet, even online for parents to help them get the best for their children from the visit - there are some who just want a place to burn off excess energy but if you want to look at STEM careers or develop curiosity the place has so many options,  Houston's a lucky city to have this place."
 ]
}{
 "name": "Houston Zoo",
 "address": "6200 Hermann Park Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/ff/07/3f/photo3jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We had a great time.We felt in love with the gorilla.They have giraffe and elephant. The only thing was that I was a little sad to not see water for the elephant and the skin was very dry but besides that all the animals look very well take care.",
  "I Am Bruce the zoo guy and I've been to around 120 zoos and aquariums around the country. This is my review of the Houston Zoo. First off this zoo has one of the greatest elephant exhibits. it has 3 parts and is very large. i like that they also updated their primate section. they have a section on texas wetlands too.\n the gorilla section is very well done. admissiin is $23 for adults. parking is free, though fills up early. easily traversed paths  with lots of shade. cool n unique lion exhibit with cool tunnel. lots of places to eat. sea lion exhibit is sad as they only have one sea lion, poor fella. see pics of my experience",
  "I have visited many zoos across the country and I was very disappointed in many aspects of this zoo. Limited parking full early. Police of no assistance in directing us to other options. Finally saw a sign for additional parking but it cost $10 and required a shuttle. Upon leaving we waited for 45 minutes to board a shuttle and eventually called Uber. Upon entering, the only restrooms were port o potties with no where to wash your hands. Did find a hand sanitizer station. Exhibits were OK but extra charges for one exhibit. $7 charge for 3 lettuce leaves to feed the giraffes. $5 charge for  a medium size soft drink. Directional signage was poor. Not worth the money and hassle.",
  "We had a great time! A lot of new/redone exhibits were opened so we were able to see a lot. They seem to have even more plans of redoing things as some areas where the birds were had been closed. The elephants were probably our favorite and we got some great photos. The food wasn’t too expensive and was pretty good. \nParking is difficult so get there early. \nThis was included in our Houston CityPASS!",
  "Great day event for children. A wide variety of animals - very informative for young and old. Food/Beverage good for snacks. Well maintained and exciting for all."
 ]
}{
 "name": "Space Center Houston",
 "address": "1601 NASA Parkway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/c6/ad/e3/20180113-124313-largejpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I spent the entire day there and did not get a chance to see everything. I highly recommend an early start to your day.  The entire space center was amazing to see. History does come to life (my wife and I were in grammar school when the space race was occurring). \nHere is how we rated what we saw:\nOrion tour - excellent \nMission control - excellent \nAstronaut training - good\nSpace shuttle transport- excellent \nMuseum - excellent \n\nWe did not have the opportunity to see most of the movies since the tours are all very lengthy \n\nThis is a MUST if visiting Houston ",
  "As a huge fan of anything space related, particularly the early Mercury-Apollo missions l, this was a superb visit and I wished I’d had longer\n\nThe first thing to do is get on the tram which takes you on a tour of mission control, the training facility and the Saturn V rocket.  A word of warning the Apollo Mission Control is on a separate tour so allow yourself time if you want to see this - I didn’t and I’m still kicking myself\n\nThe shuttle carrying 747 with mock-up shuttle is great as is the indoor displays where you can touch a price of the moon and Mars!\n\nAs the title says, don’t pass through Houston without visiting ",
  "To get to the Space Center we had to use public transport from downtown Houston. Despite the Space Center being a main attraction there is a very infrequent bus service to the location, however this must be because demand is low as the bus wasn't actually that full. We got the 249 which took about 1 hour and was very cheap; just $1.25 each, one-way.\nWe bought tickets for the attraction online to avoid any qeues but also because you can generally find a discount of around 5-10% online so it is worth a look. We walked straight in without a problem and were greeted by a large exhibition hall. There was so much to do here that we could've spent half a day just looking around, this included talks and shows. We visited the Cinema show which was good and got pictures with the lectern used in JFK'S infamous \"We choose to go to the moon\" speech. We didn't have anytime to eat anything at the food court which was in the main area as there was so much else to do.\nWe went on the tram tour which was a highlight. Despite having to wait about 45 minutes to board it was certainly worth it as the tour is highly detailed and you get to see awesome locations like Mission Control. We stayed all day right until closing and then got the last bus back.",
  "We went inside the mission control area which was dark and quiet. I was sitting in the front with several family members and a sleeping toddler on my lap. A  woman with a microphone came and stood right in front of me and yelled at all of us in a very mean voice about how we need to be very quiet. This scared the crap out of all of us and woke and scared my child who began to fuss. She then raised her voice and increased the nastiness of her tone and repeated the warning. I comforted and silenced my child in less than three seconds and still this woman went on screaming. Beyond that I found everything about the place relatively boring and we had been to the zoo and the museum the day before which were enjoyable.",
  "We took the VIP tour. It was great. We arrived  1 hour before an went in as soon as they opened.  We went through the turnstiles and to the right.  This is where we picked up our badges.  Then we went exploring until our tour.  We saw the plane and the shuttle.  you can go into both.  We saw he moon rock and touched it.  We looked at may other exhibits and listened to a talk.  Then we got with our group for the VIP tour.  They loaded us onto and air conditioned van and off we went.  We toured building 13 and the swimming pool (an astronaut and divers were in it).  We had lunch at the normal cafeteria (they give us a $16 voucher each).  We went to 2 mission control centers.  Then we stopped to see the Saturn 5 rocket.  Along the way we saw the Longhorns.   I am so glad we did this tour.  I feel I have a better understanding of our space programs past and current.  Thank you Dave!"
 ]
}{
 "name": "The Galleria",
 "address": "5085 Westheimer Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/ae/42/c0/the-galleria.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Being from big town we have the same kind of malls but totally enjoyed the Galleria.  Had lunch at Salatas which we have in our town but love it there",
  "My daughter and I enjoy going to the Galleria to shop, eat and get haircuts.  There is lots of variety and price points. There is something for everyone in the Galleria.",
  "Galleria is huge mall,you can get easily lost.I visited this mall several times during my stay in Houston.Its really nice experience to shop here,specially Macy's shop.The prices for clothing items are rock bottom and the quality is premium.The mall also has all the premium Watch stores and they have a wide variety,This place is really good for shopping with affordable prices.The food court has good selection of various types of food,I tried Daily Grill which is worth every penny,",
  "The mall is huge butt has an abundance of great stores... Traffic around the galleria is not good. But it was a good mall experience overall. ",
  "First time at the galleria and I went ice skating! Fell a couple times but worth the experience. It was so much fun and lots of food choices to choose from."
 ]
}{
 "name": "Cockrell Butterfly Center",
 "address": "1 Hermann Circle Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0e/82/f4/houston.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Great place for all ages. Lots of butterflies and the educational material was very good. No people there  so we got our pandemic social distancing taken care of as well.",
  "We really enjoyed our visit here.  The butterflies were amazing and beautiful.  One landed on the coat of one of our group and seemed to like the color, so stayed for awhile.  The museum part was also very interesting.",
  "So excited when we went in to see so many butterflies.  They also had a longevity study going on which request you to take pic of a butterfly if you saw a number and post it to Instagram.  My husband and I both had a lot of fun looking at the butterflies and also trying to find the numbered ones.",
  "Part of the Natural History museum, with separate entrance fee, but very worth it. We spent about one hour. ",
  "Cockrell butterfly center is located in the Houston Museum of natural science. It's a beautiful center where you can not only see butterflies but also different insect species and a caged iguana and small turtle. It was nice, I just wish there were more variety of butterflies I kept seeing the same type of butterflies throughout the center. And like the museum, I highly recommend going during the week where there are less crowds."
 ]
}{
 "name": "Toyota Center",
 "address": "1510 Polk St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/41/e7/b0/nba-the-toyota-center.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We attended this venue for the Eagles concert. I was a little disappointed that the big screens weren't used, but just being in the house was enough. The seats were arranged so that we didn't have to peek over anyone but I highly recommend bringing a stadium seat cushion for comfort, they are not padded that well and sitting made us numb",
  "Very organised entry with some security but still quick. Some food and beverage retail inside with limited choices and fixed prices. Our seats were on 480 and it’s narrow and fairly steep and the seat leg room is short, everyone managed ok though. Restrooms were clean and plentiful. There was a family room which was locked. The exit procedure was pretty smooth and quick and outside the police moved cars very quickly.\nThe acoustics were amazing and the lighting, we had a great time watching and listening to the eagles.",
  "One of my highlights for the duration of my stay in Houston!\n\nBooked a tour and game, it did not disappoint. Unfortunately because I was outside the US I was not able to book on their website, with just a quick email to the Toyota Centre, Ryan, the Group Event Executive got in touch and sorted it all out for us. Excellent service. Within a couple of days, we had paid and confirmed our place on a tour of the Toyota Centre and a ticket to the Rockets v Knicks game. \n\nWhen we arrived for our tour, we were in a small group of about 7-8 people. The tour lasted about an hour and a half (if I remember rightly) and we were taken to pretty much all backstage areas as well as the court. After the tour we were given passes to the pre-game warm up and tickets to our match.\n\nWe came back at 5.30pm for the pre-game warm up, entry was quick and organised. Just before the game started we walked around, there were lots of competition and give aways, the event is well organised and the atmosphere is fantastic. The game was brilliant with lots going on in breaks. It was my first basketball match and will always remember it. All for just $40.\n\nBig shout out to Ryan and the team for a fabulous day! To top it all off, The Rockets beat the Knicks that night!",
  "Never been to a live basketball game before, and this was definitely the place to start. It wasn't even basketball season but it was amazing to watch and experience. Everyone was really friendly and even though we were up high you can clearly see the whole court. We booked our tickets on stubhub and they were only $14 USD each.",
  "I have been there for Joe Rogan's Stand Up Special and UFC 247 both times events were organized in very spectacular fashion and I really enjoyed to be there."
 ]
}{
 "name": "Rodeo Houston or Houston Livestock Show and Rodeo",
 "address": "3 Nrg Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/a2/a2/ec/bull-riding.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I spent the entire day here and were truly impressed. Plenty of food vendors so you can get anything you want to eat. Tons of vendors so you can shop to your hearts content. GreaT shows ongoing all day - we loved the dog agility show and all the animal judging contests. Since we live in the city we really enjoyed seeing all the animals. Free Wine tasting the day we were there was an added benefit. Rodeo was great and the it was followed by a show from Becky G ( we didn’t stay for that because it was not our type of music). Overall great value for a phenomenal time. ",
  "This is a must attend event if you are in Houston in March that raises money for student scholarships.  It is similar to a State Fair up north but with Rodeo entertainment in addition to nightly concerts, carnival attractions, livestock, art, shopping and of course food!  The wine garden is a must if you are over 21.  \n\nMy favorite rodeo event was the Mutton Bustin' where crazy parents put their preschoolers on the back of a big sheep that then dashes across the ring with the child holding on for dear life!  The kids actually seemed to be having a blast.   \n\nDisappointing that they had to end the Rodeo early this year due to the nasty Covid-19 virus.  So thankful I went on opening night so I was able to experience this wonderful event.   I hope to be back next year.",
  "It was the first time that I visited Houston so I decided to go to the rodeo - it was fun and it is worthed! A lot of rides, carnival atmosphere, kids friendly environment. The artist that performed on the day I went was Chance the Rapper and the show was amazing - almost 62.000 tickets sold - great performance! It was for sure a once in a lifetime experience!",
  "Here is a letter I sent to Goode Co. BBQ: \nI took my daughter to the Houston rodeo yesterday to see a KPop band. We spent the whole afternoon at the rodeo and needed to get something for her to eat before the concert. She has Celiac Disease and gets very sick within hours of eating anything that is contaminated with wheat. The Goode Company BBQ booth took care of us by changing gloves, cleaning the knife, and preparing her food on a different surface. We ordered brisket for her (no sauce) and she was able to enjoy the concert to celebrate her birthday. Thank you so much!! Please pass this message along. This attention to detail made our day, and kept the birthday girl from getting very sick. As a parent, I appreciated the caring attitude and attention this group showed our family.",
  "I actaully made it for the cook-off competition, and this was my first time.  I was overwhelmed by the action, tents, cooking, activities.  It was like nothing I have ever attended before.  I was in the Pitmaster tent and the food was amazing.  the tent had so much action, just like the rest of the tents. It was my first time having a fried twinkie and fried oreo.  If you ever get the chance to end of with VIP passes, do not pass this up.  You will not regret it."
 ]
}{
 "name": "Water Wall",
 "address": "2800 Post Oak Blvd near the Galleria",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/66/dd/6d/water-wall.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Yet, a concret structure, but found it impressive! Kids were amazed. Beautiful construction. Thing is, we had a hard time finding parking around.",
  "It was a cool view. You will get wet if you get close to the wall especially if the wind is blowing. The park surrounding the wall is nice and comforting. ",
  "Fascinating structure that towered over us with water continously flowing down, creating a mist in the middle of the semi circle. Note there is no roadside parking but you can park at Galleria shopping mall nearby. It's a short visit, 20 minutes enough, but fun.",
  "The Waterwall is becoming a Houston landmark.  The wall is located in a small park near The Galleria.  Parking can be an issue; if you don't mind a short walk some parking is available at the shopping center parking garage (The Galleria is another nice visit).  Be prepared to take many photos.",
  "I really debated between and 3 and a 4.  I was disappointed that the only parking we could find was the $3 for 15 minute parking.  The area was super busy (we were there on a Friday evening) and we didn't want to drive in circles looking for the supposedly free Galleria parking.\nThe area right in front of the feature was extremely muddy due to the spray coming off of the wall.  I'm glad we went and walking all the way around the back of the wall was worth it as well.  There were several people doing photo shoots with lighting and all, so it was hard to get photos without people or equipment in the photos.\nOne other warning, use Waze or something that keeps up to date with construction changes with your GPS because we ended up being forced onto a freeway when the way we wanted to go was closed. Luckily, we didn't have to be anywhere, so we took it as an excuse to explore another area."
 ]
}{
 "name": "NRG Stadium",
 "address": "1 Nrg Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c4/f9/24/view.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Went for Monster Jam on 25th Jan and had a great time with my son. Thankfully we had ear protection with us. It was a great first time experience of such event. Not many options for food/beverages and too costly.",
  "well I was here in September 2018 for the OTR Concert now I am back here again as a speaker in the GasTech Conference exactly 1 year after to the day.",
  "Like any large sports venue, there are lots of pizza, sandwich, beer places abounding, but some local gems too.  I love finding great Texas BBQ or artisan ice cream too.  ",
  "I am very dissatisfied with all of the performances tonight wasted my money I've been coming to theses events for years this one sucked only 1 truck really did anything my family was very unhappy",
  "We came to see the Texas bowl. A little drizzly outside but with a enclosed stadium it didn't matter. Had great seats on lower level. Easy to navigate. "
 ]
}{
 "name": "Discovery Green",
 "address": "1500 McKinney St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/77/71/5f/discovery-green.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Discovery Green is a great area to spend quality time with your loved one. They have amazing different attractions that represent the heart and soul of Houston. It is often filled with art exhibits, live music, and other city events. Discovery Green even has a skating rink in the center of the park. There is plenty of room to walk or ride bikes with the family. There also have a dog park so that everyone in the family can have a good time. It is a fun and vibrant experience with uplifting community events and the amazing Houston scenery. Discovery green is located in the center of Houston, downtown and is located around a lot of delicious restaurants along with other great Houston attractions. \n",
  "I have been there for a concert.Listen the music sitting on the grass and looking downtown’s buildings is an experience that I strongly suggest",
  "Wandered through the park, great sculptures and open space within the city.\nWill be great to see once has been upgraded",
  "A relaxing downtown park which is hidden away. There is equipment for kids to play on and enough room for them to run around and burn off some energy. There are also art installations to view.",
  "Not too crowded on a Sunday afternoon.  THey have a football field sized green space,  A nice (large) raise wooden platform with seating and beautiful Oak tree shade.   There is a coffee cart,  A good sized indoor cafe.  Goo playground for kids.   If you are downtown at a hotel, take a stroll down there"
 ]
}{
 "name": "National Museum of Funeral History",
 "address": "415 Barren Springs Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/7c/26/8e/national-museum-of-funeral.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This was our third visit, still love the place! Not as macabre as you would think. There is a lot of history and super interesting exhibits. We learn something new each time and will continue to visit. Love the affordable gift shop too!",
  "It may not seem like something you’d be dying to see when you come to Houston, but it is actually a really interesting stop! It is broken down into different sections that feature different aspects of funeral history. My favorite is seeing the old vehicles and hearses, including one used for a past president. Highly recommend if you’re looking for something a little different to do.",
  "I really did not want to go here, but this was actually one of the most interesting museums ever. between the old instruments history, the old funeral vehicles, and all the exhibits, it was really enjoyable experience.",
  "My husband thought I was crazy wanting to go here, but we ended up spending over 2 hours here. Unique, amazing, and beautiful displays of hearses, funeral carts, and funeral associated memorabilia. Displays were very informative. Very surprised in the size of the building. Every corner we turned, there was more!!! Enjoyable afternoon.",
  "I highly recommend a visit to this unique museum.  My friend an I were super impressed with the quality of the displays.  I have never seen anything like this museum, perhaps it is the only one dealing with Funeral History in the entire US.  Check it out!"
 ]
}{
 "name": "Bayou Bend Collection and Gardens",
 "address": "1 Westcott St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/85/00/2e/bayou-bend.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Nice quite area, well kept and a lovely place to walk around and enjoy nature. Many volunteers were cutting off dead flowers and were friendly and willing to answer questions while we were there. Lovely little gift shop.",
  "Visit to lovely mansion includes free self-guided audio tour.\nBeautiful gardens\nGreat restoration  of mansion. Each room is from a different period of history.",
  "An amazing gardens, house and property with lovely walking paths.  Beautiful decor inside with excellent workmanship.  Highly recommend.",
  "My friend and I decided to explore this place. For about $13, we were given access for a self guided tour of the house and gardens. There is a lot to explore and you need maybe 3 hours to explore the majority of it if you walk at a decent pace. On the third Sunday of every month, it's free admission. Enjoy!",
  "The Christmas decorations were extensive and delightful.  Staff were very helpful.  The play that was going on in the house was fun. Children were having fun. Music and trains were in a large tent."
 ]
}{
 "name": "The Menil Collection",
 "address": "1533 Sul Ross St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/7f/04/e7/the-menil-collection.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Good size museum and free! The outside area is nice so it’s perfect for a beautiful day. They have a wide range of art and you could spend 20 mins there or 2 hours!",
  "Great place, but not open last I visited.  Major remodeling work going on.  Can’t wait to see how it comes out.",
  "The Menil is free to the public and has free parking, so it is definitely worth checking out. That being said, it houses a wide, odd assortment of 'art', including unsettling depictions of the human form. I visited with my husband and our youngest child, and I decided to steer our 5 yr old away from the photography and toward the more traditional pieces.",
  "This is a small museum and everything is top quality.  It's free and they absolutely are vigilant about stopping you from taking photos--there is a guard in every single room and their main activity is catching folks who want to take photos!\n\nIt's amazing to think that the place is free but they pay about 40 room monitors.   \n\nNonetheless, the exhibits--especially the african art--are top quality.   If you are interested in basketweaving skills, you won't find a better selection than this place.   It isn't baskets, it's the hair and other features on the African displays that use this craft.",
  "This was a great visit. There was a wide variety of modern art. The collection of ancient artifacts was very well- curated.  We were only able to visit the main building, but will visit the others on our next visit into the city. "
 ]
}{
 "name": "The Music Box Theater",
 "address": "2623 Colquitt St Parking available in the parking garage across the street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/10/48/ef/20170728-213923-largejpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I had a great time at Music box Theater on Friday, March 6.\nAs usual, great music and fun.  Music and laughter therapy.  Does not get any better.",
  "The talented founders of the Music Box Theatre provide an exceptional place to enjoy both their comedic and vocal prowess. Intimate cabaret seating and a full bar enhance the total experience.",
  "Five very talented singers performing Broadway songs. Their 7 minute review of West Side Story is hilarious. All songs are accompanied by a skilled group of musicians.",
  "It's a shame.  Good customer service, good vocal talent, but the show was bad, mostly because the humor was really bad.  Having one performer sing beautifully while the rest of the company does intentionally cheesy gestures as backup singers was annoying, not humorous.",
  "We have come to Houston a number of times on weekend getaways. This is our choice when the theater is not dark. We have enjoyed every show! Great entertainment! Dedicated vocalists, musicians, and staff! Get your tickets, you won’t be disappointed! If you live in Houston or nearby, you are missing out if you haven’t been there yet! 🎭❤️🎭"
 ]
}{
 "name": "Buffalo Bayou Park",
 "address": "18-3600 Allen Parkway and Memorial Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/a8/75/3b/all-time-favorite-park.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Here you can relax and enjoy the fresh air, from bringing that book you are reading with you, as well as coming to talk to someone in a relaxed and healthy way.  everything around you is conducive to clear your mind and enjoy a moment of this wonderful open space of gardens and others",
  "We went to the park to enjoy a pretty day, get fresh air, get some exercise.  We were pleasantly surprised!  It was fun to see the tall buildings close by yet be away from the hustle and bustle.  We felt safe and enjoyed our time there.  We ended up walking about five miles through and around the park.",
  "This was a nice little stop along our trip to get a view of part of the skyline. We took a stroll around the park, and there were numerous runners about. ",
  "Took the time to go see this park. It has so much to offer.\nWe did the water building first which was an eye opener.\nAfter spending time underground listening to the history of the water of Houston we then started on our walk of the park. We first went on top of water building then took the track south of the riverside. So much to see and photograph. After 3 hours or so we had only gone half way. So we still need to do the rest.\nThe negative was no access to a drink or bite to eat at the location. Has so much to offer for both the locals and tourists.",
  "Allow a few hours to really enjoy this beautiful waterside walkway. The view are lovely, and it is refreshing to see so much green inside a city."
 ]
}{
 "name": "Houston Museum District",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/ac/64/54/mfa-facade.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We had a pleasant day, and we recommend arranging your visit so you stay in an area that is on the red line tram, $1.25 per ride. Very convenient and stress free way to get to the museum district. ",
  "I come to this area quite regualry to walk and enjoy the museums. Right now there is a lot of road work and a new wing to the fine art museum going up so it is a bit noisy with all the construction but it is still a lovely place to visit.",
  "No matter what type of art you’re drawn to, you’ll enjoy wandering the museum district. Such a variety: fine arts, a children’s museum, the Holocaust, science, contemporary arts, the Menil and so much more. Some are relatively close to each other, others are a short drive away. Take the time to visit the area and expose yourself to our wonderful museums. ",
  "What a great place to wander, learn, and explore.  Google this area and determine which museums and/or parks you'd like to visit.....there's something here for everyone!",
  "This area can easily take several days to explore.  Houston has many great places all over the city, but this area is a true world class gem.  Get there early and park by the zoo and start exploring and see whatever draws your interests.  "
 ]
}{
 "name": "Saint Arnold Brewing Company",
 "address": "2000 Lyons Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/45/85/ec/saint-arnold-brewing.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "In this period of “stay at home” they offer just food to go.They are super organized.After you ordered online ,there is a guy who tells to the kitchen that you are there.after few minutes another one brings you your order.It is like a drive trough but nicer...They have special menu and are really convenient.",
  "Visiting friends in Huffman and we decided to trek an hour south to the brewery for lunch.  Shrimp n grits was over the top delicious, Texas size portion!  One of our group ordered a pizza, again delicious.  My wife and I had the crawfish roll, amazing flavor, fresh brioche roll, highly recommended.  Now for the beer, I had a coffee stout and a couple of the orange beers, wife had a cider, had to sample the root beer all delicious, wish an Uber ride was an affordable option to and from I would have enjoyed trying more of the beer.  Great atmosphere good service, excellent food an beer.  Meals & Beer about $150 with tip.  A very memorable experience.",
  "First time visiting.  Got there a little before noon on a Saturday.  It was already busy.  Planned on taking the 1pm tour which we did and recommend.  While waiting we ordered a appetizer and a pizza.  Both were well worth it.  Plan on visiting again for sure!",
  "Even if you don't drink a lot of beer the facility is amazing and the tour is very good. You must be 21+ to do the tour and you need to pre-register but it is really worth it,",
  "Our first time in the new biergarten did not disappoint. The beer, as always, was excellent. This new space is light and airy outside, lots of places to sit. BUT, we won't share space with vape and it was chilly, so we welcomed the ability to dine inside. The art was fun to study and we enjoyed the menu. Bro in law says the CFS was great, sister liked her club. I was all about the brat with sauerkraut and brown mustard and hubs had a crawfish roll. I wasn't especially fond of their entry into the world of Fried Green Tomatoes, but hey, each to his own. We'll be back!"
 ]
}{
 "name": "Lone Star Flight Museum",
 "address": "11551 Aerospace Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/97/90/ae/republic-p-47-thunderbolt.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "While some museums are static examples of aircraft, the coolest part about this museum is most of the planes either do fly or are capable of flying. If you always wanted to fly in a bi-plane...you can sign up for a ride in the one you’re looking at. I’ve gone for several rides in old warbirds throughout the country as a member of the CAF and this place offers similar amazing experiences. You are literally able to view and fly history. The location is great too since NASA has its training aircraft housed nearby. I would recommend this museum for all ages. We’ve seen kids loving life walking around the planes, senior citizens reminiscing, folks bringing their parents in to have them show which planes they helped build during WWII, and people like myself who just love the history and beauty of the exhibits. If you’re from out of town or a local, stop by...it’s a great experience!",
  "Had last visited the Lone Star Flight Museum when it was still based in Galveston and it has fairly recently moved to Ellington to be more protected from hurricane damage. Their collection of flying warbirds is impressive and should not be missed if you are anywhere around Houston. The new premises are well laid out and you can still be up and close to these beautifully maintained aircraft. Noticed that the museum does a lot of STEM work with the local schools which keeps the love of aviation alive! ",
  "The museum has free  parking. When I visited, admission was paid in the gift shop. There are several aircraft on exhibit. There is a good history of aviation in general and Texas aviation in particular. There is also a \"hall of fame\" of Texas aviators which has some recognizable and surprising members. There are conference rooms within the facility for special events.",
  "You need to check on which Mondays as it is not every Monday.  Great displace of planes in 2 hangars.  Check it out.",
  "We visited this museum after it was moved from Galveston to Ellington Field and we can tell you the museum managers did an awesome job. So much history combined with wonderful exhibitions and nice souvenirs store makes a unforgettable visit.\nplease make sure to try the simulators, you will love the experience!!"
 ]
}{
 "name": "Rice University Campus",
 "address": "6100 Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/b3/24/d1/rice-university-campus.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Directed a workshop on campus.  Having been doing this for 10 years.  I definitely recommend the school for quality of faculty and curriculum. While there check out the cute French café!",
  "We had a tour of the campus. The architecture is beautiful and there are a lot of open spaces. Lots of people take wedding photos here. ",
  "I walk through here quite often to get to MD Anderson.  It is a beautiful campus.  There are nice walking and running trails throughout the area.",
  "We parked up near the sports stadium and did a short walk of this amazingly structured and beautiful campus before catching an Owls game.  There is an interesting light exhibit to see at dusk where you can sit and watch the sky under a changing colour light canopy.  Impressive to see new buildings going up replicating the original style I'd imagine at some great expense but keeping a coherence to this very tranquil spot in the center of Houston",
  "Beautiful campus in nice area of Houston.  Really nice southern Oak trees on the streets around the campus."
 ]
}{
 "name": "Houston Arboretum & Nature Center",
 "address": "4501 Woodway Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/da/54/a9/meadow-pond.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This was a nice area to walk and enjoy outside nature.  The nature center was not open, so we can't comment on that.  The area was quite and we saw a row of turtles sunning themselves on a log.",
  "I attended a class for children & parents (grandparents) to learn how to fish with a pole and 'bobber'. It was so much fun for my grandson and me to share this activity. He even caught a fish.",
  "We spent 90 minutes walking the outer loop trail, including a detour to the bayou overlook.  This is a popular place on a sunny Saturday in February, the 610 parking was filled, but there were plenty of spaces at the Woodway parking lot.  The restroom is in the nature center building, which is adjacent to both parking lots.  This is not a botanical garden, just a forest with meadows, there are interpretive exhibits here and there and we caught wildflowers in bloom.  Dogs are welcome on a leash and you will see many.  Visiting is free but there is a small charge for parking.  Highly recommended.",
  "Nice place to escape from the city. Several trails to walk or jog. Lots of nature,  lots of wildlife, but ultimately not an attraction or zoo. So if you enjoy hiking and bird watching, it's a nice place to go. ",
  "We wanted a bit of nature on our trip to Houston and this place fit the bill perfectly.  There is a lot of construction going on there currently and it had rained, so things were a bit muddy but still it was absolutely beautiful. We went to the nature center and met with a wonderful woman (did not catch her name) who went over the map of trails with us and let us know which trails would be best for our family's needs.  We went on a mixture of 6 different trails.  We got so many beautiful pictures and we saw tons of turtles.  We were advised to seek out the Owl bridge, it was pretty cool but we couldn't get a good pic of us with it in the background.  Great visit, small slice of heaven in middle of a bustling city."
 ]
}{
 "name": "Houston Graffiti Building",
 "address": "1503 Chartres St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/16/b4/54/20190408-085254-largejpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "My family and I really enjoyed the art at Graffiti Park.  We just wished there was an online map or signs to show where they were all located. You have to drive around and search, and we may have even missed some.  But we had a great time viewing the amazing talent!",
  "it's so vibrant and pretty. the paintings wrap around the building and it was fun to look at and take pictures with my boyfriend.",
  "Just blocks from the convention center. Worth a stroll in the daytime. Cross under a freeway with some homeless nearby or drive to the site. Some other buildings nearby have similar murals but this is the best display. Nearby area is mix of industrial and vacant.",
  "Walk around and see beautiful detailed walls. People always on sight, a lot of people doing photo shoots.",
  "Interesting neighborhood with outdoor art gallery. Worth to visit and stop to take some good pictures. I enjoy it a lot."
 ]
}{
 "name": "Smither Park",
 "address": "2402 Munger St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/78/78/cf/lindley-fish-amphitheater.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This is a hidden gem you don't want to  miss!  Incredible detail and talented creativity! My family had a lot of fun here.  Look close, look inside, under, and all around!  Fabulous experience!  We were amazed that the checkers on the checkerboard were removable, and they were all there! Respect! You can take a little or a lot of time here, but you don't want to miss it.  We stayed about an hour.  Great photography opportunities!",
  "Simply put Smither Park is a beautiful art park comprised of “junk.”  Imagine broken bottles, old dishes, hub caps and road signs assembled into sculptures, statues and mosaics. The park is not very large but is continuing to be added to.",
  "If you're going to be in the area, visit this park. The mosaic exhibits are fascinating.\n\nThe neighborhood feels a little scary, but we went on a weekday. It's probably more populated on the weekends. ",
  "What an inspiring little art park right next to The Orange Show. Fantastic mosaics on a wall along one side of the park, mosaic walkways and tables with many works in progress. Fun little stroll, plenty of street parking, picnic tables, and benches if you want to stay a while. ",
  "The park has plenty to keep people of all ages entertained for quite a long time. Broken tile art in the most unique designs will make you smile! Sit and have a picnic, swing in some large seats or play I Spy. Some projects are in the process of being completed. This is a must see! "
 ]
}{
 "name": "Memorial City Mall",
 "address": "303 Memorial City",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/44/34/65/memorial-city-mall.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This is a large indoor mall anchored by Macy’s, Dillard’s, Target and Sear’s, with the usual array of smaller stores throughout. Large variety of food court eateries, a popular Starbucks and lots of kiosks with the typical offerings. One thing I greatly appreciate about this mall is that it’s open early in the morning for walkers to use as an exercise track. It’s air conditioned, the music’s on and it’s perfect for those rainy or hot days when you don’t want to be outside. And if you walk before the stores open at 10, you beat the crowds and have plenty of easy parking. Thank you to the mall management for making this available. ",
  "The hotel is wonderful and the service is outstanding! The coffee trips to the Starbucks inside was superb! Elois, Esai, Martha and Gab were very pleasant and you are always guaranteed a smile! Everyone behind the counter was very helpful.",
  "We absolutely LOVE this mall! GREAT stores and restaurants. It's a wonderful atmosphere with a huge fireplace and comfortable chairs located right by the ice rink.\n",
  "It is a hard mall to get to due to being located right off of the Katy freeway and traffic at the intersections trying to get to it. Parking is almost impossible to find so expect to walk a ways if you are lucky to find a spot. Houston doesn't have many indoor malls so it seems to be busy all the time. The stores are standard chain stores with the exception of a few such as the American Girl store.",
  "Walked through the mall and enjoyed the many store fronts. The escalator took us up to the second level but the down escalator was not functioning. The mall is linked to the sky bridge to the Westin hotel and a Hospital. They had a very nice children's playground and an ice skating rink. "
 ]
}{
 "name": "Holocaust Museum Houston",
 "address": "5401 Caroline St Lester And Sue Smith Campus",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/7c/09/0b/holocaust-museum-houston.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Great for kids who are interested to know more about it. I, too, learned a lot from this place. I just wish they have more up to all floors.",
  "The museum has its own parking lot. If you only visit for 1/2 hour or less it is free. Over the half hour and up to 4 hours costs $8. It goes up from there. Four hours should be plenty of time to visit the museum. After you pay your admission, the short orientation film is recommended. It recycles every 20 minutes and there is a countdown clock outside the theater. The museum has guided tours and audio tours available. It is a detailed history of the Nazi holocaust in Europe, There are several recorded interviews of local residents who were survivors of the holocaust. It is something that everyone should be reminded of, lest we allow it to happen again. There is a gift shop.",
  "Just walking into the museum and passing by the reconstruction of one of the chimneys from the ovens where so many people's bodies were put to death, put me in a somber mood.  To see the mementos and read the stories of the people that lived (and died) through this dark part of history, is to grasp in a small way the pain and suffering they went through.  When I read or hear about someone saying that the Holocaust did not happen, I weep, for I have been to this museum and believe what I saw.",
  "I haven't been to any of the Holocaust Museums around the country so this was my first experience. Beginning in the beautiful theater room and hearing their voices and stories was an excellent introduction. Of course the entire museum is a moving and powerful experience. They have made it personal and brought it to life. I was struck by the use of he railroad car as a bridge to another section. The size and time spent are about right for the gravity of the topic. Don't miss the area outside the main doors with the stone blocks beside the sidewalk.",
  "A thoughtful museum to learn about the events leading to the Holocaust as well as the horrors, and those who resisted and aided.  A lot to absorb. Video on 2nd floor was good if you have energy. Two hours was plenty for us.\n\nMuseum is well organized for visual and auditory learning. If you enjoy reading, I would skip the audio tour.  Food options very limited there.  Lucilles nearby is a good alternative."
 ]
}{
 "name": "Glenwood Cemetery",
 "address": "2525 Washington Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/86/09/2a/mourning-angel.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We spent hours in this Cemetary looking for Howard Hughes grave and then with our cemetary list that we got from the office, we found many other gravesites that had interesting stories. Such beauty in this Cemetary!",
  "Beautiful cemetery and interesting history.  Didn't find Howard Hughes grave though!  The rolling hills and view of the downtown was lovely",
  "Lots of the big names are here. From Howard Hughes, to the famous mayors of Houston, to various founding people of our town.",
  "This is such a beautiful, peaceful, and historic cemetery. Many of Houstons rich and famous (Howard Hughs) are buried here. The grave markers and sculptures are amazing. Its close to downtown and the Heights. Great place for pictures!!",
  "I had some free time, so I thought it would be interesting to see where Howard Hughes was buried.  Google maps gave me the coordinates, but it wasn't clear how to get to it.  It turns out it is on the west side of Greenwood Cemetery, alongside the graves of many famous figures from Houston history.  Once you find the entrance (it's on the north side, make your war to the cemetery office, where you can get a map.  It took some time to find the Hughes' grave, which is surrounded by a steel bar fence.  Howard is buried alongside his parents."
 ]
}{
 "name": "Karbach Brewing",
 "address": "2032 Karbach St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/5d/46/d3/karbach-brewing.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Ok so I will definitely be going back to Karbach every time we are in Houston. My husband had been before but this was my first time and it was awesome. The  Brussels sprouts were by far the best I’ve ever had. I ordered a flight of beer which was nice to be able to try a variety. For my meal I got the pizza and my husband got the shrimp.  We also had dessert. I had the pecan pic, amazing! My husband had the creme brûlée. ",
  "We dined inside on a Saturday afternoon. The beer flight, choice of five different beers brought out on a board, was an excellent choice because it was our first time trying their beers. The salad was very good and also the burger/fries/onion rings. The price was about 20% higher than a lot of places ($10 for a basic vegetarian salad and $15 for a burger) but location/environment have to also be taken into consideration. It was a good meal but next time I would like to try the Biergarten area around back.",
  "Service is awesome! Venue is great! Bands are amazing! Great day for a concert! Looking forward for next time!",
  "Dined with family.  Our bill was $87 for three of us.  Karbach burger ($14) was delicious.  Chili made with Crawford Bock Beer ($12) was awesome!  My son’s ribeye was expensive ($33) and had a lot of fat on it ... disappointing.  Hot, fresh pretzel ($8) was a great appetizer!  We had two beers, which our mixologist suggested - they were good choices.  Our server was Ashley - she was very attentive and friendly.  We will definitely go back again ... but won’t order the ribeye again.",
  "accept concert  was great on Oct 10... hope they got some great bands for next year\nFoamhenge 2019 well done... Next day flew to Bangladesh, what a great  1. 2 punch\nBangladesh mohilas and accept\n"
 ]
}{
 "name": "Downtown Aquarium",
 "address": "410 Bagby St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/66/30/c5/photo0jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Is a small aquarium but with cool exhibits. You can touch and feed the stingrays. The have a beautiful white tiger.",
  "Looking at the prices compared to what you actually get for it, I definitely don’t think it’s worth it. We went because it was included in our CityPASS. What we saw was nice but this is a “for profit” aquarium. Most of them are in tanks too small for them. Their poor bengal tigers hardly have space to live comfortably. The inside area is a decent size but the outside is terribly small. I’m not sure why they have tigers at all as this is supposed to be an AQUARIUM. But also a gift shop, restaurant and carnival??? It’s just a very odd combination of things that don’t fit well together. You have to pay extra for everything as well, they need it to be a more inclusive price. ",
  "I would not waste my money coming to this aquarium. It is super small super fast from start to finish last about ten minutes . Have been to the one in Corpus and San Antonio this rates way at the bottom .  Waste of money and they really need to expand . The tanks are very small for the fish displayed even my two kids we had made comments how little space the fish had in the tanks . The Tiger which was not on  display. Very disappointed when asked if I could come back later to see it when it was I was told no since I didn’t purchase the wristband . So beware if you buy the city pass this does not include the only other exhibit worth seeing the sharks . You have to purchase separate ticket or upgrade . I think that is really ridiculous considering that the aquarium is so small then to see the sharks it’s extra . Why would you charge extra if that is part of the aquarium.  Not complaining and completely understand to charge more for the rides but not the shark exhibit. Might  be fun if you have kids five and under only . Other then that do not waste your time like we did .\n\nDisappointed ☹️",
  "This is the smallest aquarium I have ever seen. Cool exhibits, but where is the rest? They were doing construction, so I am hoping that they are planning to expand. The exhibits they did have were good, but the white tiger looked like he was sedated. I was wondering why the gift shop was near the beginning of the walk when I realized that was the end. The only thing after the gift shop is the stingwrays, which you can feed if you like. There is a restaurant if you want to dine there. I definitely would have been mad if we had paid to park.",
  "Nice, lots of fishes, just little be overpriced, extra fee for train to see the sharks, you can touch the stingrays. "
 ]
}]
