[
{
 "name": "The Houston Museum of Natural Science",
 "address": "5555 Hermann Park Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/24/03/0c/dinosaur-exhibit.jpg",
 "tags": [
  "walk",
  "free",
  "experience",
  "family",
  "experience",
  "food",
  "educational",
  "family",
  "kids"
 ],
 "website": "http://www.hmns.org",
 "source": "TripAdvisor",
 "reviews": [
  "This is an absolutely great museum. We visited on a wednesday and thankfully they were open late. They were open till 8 PM for holiday hours. Parking is available right in the museum complex itself. The museum itself is huge - we spent about 5 hours there and yet couldn't complete the whole museum. Awesome exhibits on carving and ornament animals in stone. They have an entire floor on Texas Model Trains. The screen with animation was super fun for children. The huge pendulum is mesmerizing. \n\nThe Paleontology hall is phenomenal - the dinosaurs and creatures are created by era and the recreation, art work and pictures and the amount of knowledge and information is absolutely spectacular. This is one of the best dinosaur halls I have ever seen. \n\nWe also watched an IMAX 3 D movie - walking with T-Rex which was super fun and very educative. We also spent a bunch of time in Chemistry exhibit - which was especially super fun for my 7 year old. In-spite of spending almost 5 hours, we couldn't do a lot of the exhibits on the 2nd and 3rd floor. \n\nHighly recommended. One of the best",
  "Another mandatory visit while in Houston, is the Natural History Museum.\n\nYou will need a complete day (or even more) to really check everything on display, since there are 4 floors full of interesting items:\n\nFull body dinosaurs skeletons, phosils of all sort, trilobites, scientist working in labs opened to visitors, an impressive collection of cristal minerals and jewels, sculptures and a great collection of ancient Egypt items, including three real mummys. Also great the butterfly interior garden.",
  "Whether you've got your children with you, or it's a day of adult exploring, the Houston Museum of Natural Science is always a great place to visit. It's located at 5555 Hermann Park Dr. The usual hours of operation are Monday through Sunday from 9am - 5pm. You can walk through the halls of the Dinosaurs, at the Hall of Paleontology,  visit the Hall of Ancient Egypt, Earth Forum, Gems and Minerals, Hall of African Wildlife...there is so much to see and do, everyone will be happy.",
  "Luckily we visited the Museum on a Thursday when it is free entry for anybody after 2pm! There were no queues and the exhibits inside weren't that busy. There was plenty to look at and for a free experience it was very good, however I don't think it's worth the usual entry price. Nevertheless there is still lots to do and the exhibits are well maintained and detailed. We didn't attend any of the 'extra' exhibits, and in total we spent around 2 hours there. If you can go on a Thursday I would thoroughly suggest a visit.",
  "Great place to take the family. Butterfly’s everywhere. Lush landscaping. A wonderful learning experience.",
  "Museum was great.Is good for all age,very educational. They only think  I didn't like is there is no food court,they just have some table to sit at the lobby.",
  "We enjoyed an annual family membership to HMNS. It has a convenient parking garage, lots of general admission exhibits and interesting special exhibits as well. It is an especially good venue during the summer, when the weather is hot outside, and the kids can spend the day inside, exploring different specimens and cultures.",
  "What a shock 20.00 to park! The museum is wonderful! To do the “special exhibits “ it is very expensive! If you do just 2 of them it is 200.00 extra and there are more than 2! Not for budget minded families"
 ]
},{
 "name": "Minute Maid Park",
 "address": "501 Crawford St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/e1/e3/c9/0411161737-largejpg.jpg",
 "tags": [
  "food",
  "walk",
  "food",
  "walk",
  "food"
 ],
 "website": "http://houston.astros.mlb.com/hou/ballpark/index.jsp",
 "source": "TripAdvisor",
 "reviews": [
  "I always sit on the third-base side as the main video screen and scoreboard are in right field. Food is changing with the new owner. I hear there's a real salad bar behind centerfield - no more excuses for me. You are now allowed to bring in food - up to a gallon-size clear bag and up to one-liter of water. Nice change - the previous owner made me throw away the empty water bottle I had in my purse.\n\nIt's a retractable roof so weather is not a concern; however, in the late afternoon, the sun can be in your eyes on the first-base side. Like I said, \"Sit on the third-base side.\"\n\nParking is all around in city and private lots. Come early, start up by the park and drive away until you see a price that's worth it. I've never been early enough to park on the street.",
  "It's easy to get around, friendly help everywhere, great concessions, and not a bad seat in the place.  Very comfortable spot to watch a game, tremendous screens and graphics.  Top notch place!!!  Parking not too expensive if you don't mind a short walk.",
  "Much of this review is only pertinent because it was opening day. Parking prices were ridiculous. My husband is handicapped, so we were on the top row of the field box seats behind the Astros dugout. The problem with these expensive seats is twofold: 1) people are standing right behind you throughout the game. 2) you can’t see the large screen from these seats. The food was good, we had loaded nachos. They don’t skimp on the meat or cheese. We have been going to Minute Maid Park for years. There are plenty of better seats in the stadium. If you can walk several blocks, you can find cheaper parking.",
  "I live here in Houston but originally from NY, so i have 2 favorite baseballl teams. I must say of all the baseball parks I have been to around the country, Minute Maid is one of my favorite. Very clean and great food selection and many bars and restaurants in walking distance of the park. I also love the train that goes around the top of the park when the Astros hit a homerun. Cant wait to go back.",
  "Parking was easy with a quick shuttle to the field.  No problem walking up to buy tickets.  Just watch out for drips from the AC unit - we would definitely choose another section but options were limited that day.",
  "Take me out to the ball game. Such a great venue. It is clean and bright. The atmosphere is festive and fun.",
  "This is a great baseball venue. The seats are great and it is clean and well cared for.\nThe best thing is to take in a Astro's game whether it is during the day or at night.  They have a couple of tasty restaurants and of course snack bars. Their sport's shops have lots of great Astro memorabilia and sportswear. You don't need to worry about the weather because if it is too hot, they close the roof and keeps thing cool or if it rains, you stay dry.",
  "You must get here as soon as possible. Even if you aren’t a baseball fan there’s something for everyone"
 ]
},{
 "name": "Museum of Fine Arts, Houston",
 "address": "1001 Bissonnet St Add Parking Locations, Prices",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/0d/e8/2c/museum-of-fine-arts-houston.jpg",
 "tags": [
  "free",
  "interactive",
  "interactive",
  "history",
  "experience",
  "history"
 ],
 "website": "http://www.mfah.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Houston can be proud of its many museums and this one does not disappoint in any way.  If you've never visited a fine arts museum, this one is a great place to begin as it's very accessible and can be easily seen in one day. It showcases works by many of the great artists: Botticelli, Tintoretto, Caravaggio, Veronese, Goya, Sir Joshua Reynolds, Van Dyck, Rembrandt, Van Gogh, Reni, Morisot, Pissarro, Turner, John Singer Sargent, Pollock, etc. There are also some very nice decorative arts pieces, statues, an impressive Phoenician sarcophagus and an even more impressive Roman one, plus some beautiful mosaics like those we saw in Spain and Italy. I appreciated that there were plenty of benches throughout this lovely building. All the art is clearly marked. Enjoyed the tunnel.  Nice cafe, very nice staff, and inexpensive parking nearby.  Well done, Houston!",
  "The Museum of Fine Arts Houston is a gem in this city.  The special exhibits compare to any you will see in the world, and the permanent collection is varied and fascination, with collections from antiquity to modern and contemporary.  A great addition to your visit to Houston. Admission always free on Thursdays.",
  "I've been to MFAH twice in the past few months and I have discovered why it's one of the best museums in the USA.  Large (fills 2 separate buildings connected by a wonderful underground light tunnel) and offers great exhibits, especially the traveling exhibits that are temporarily on display.  This is a museum that is clearly worth repeat visits and I will return soon. ",
  "We were in Houston for a few days, and had to check out the museum, especially for the Vincent Van Gogh: His life in art Exhibit. The exhibit was extremely crowded and made me question the museum etiquette of most Americans. They're extremely loud, DO NOT move when listening to their audio guides or on their phones crowding around pieces, talk on their phones, and like robots they need to do see it all in one order creating massive queues instead of entering a room and spreading out!\n\nAnyway, the exhibit was alright. I expected a lot more of Vincent Ven Gogh's iconic pieces - his sunflowers, more of his self portraits, Starry Night (since it's already in a US museum (MoMA)), bedroom in Arles, more of the olive trees, ... but I was disappointed. The exhibit is divided into different rooms, almost chronologically. The first room has only \"reproductions\" and all his diaries and postcards were not originals and mere reproductions. The exhibit had some interesting paintings - one of his self-portraits, that of his brother, Theo, his irises, and numerous other works. The exhibit ended with an interactive room, where you can \"live\" art - pose for pictures in life-size recreations of his paintings like his room in the Yellow House at Arles, the street cafe at Arles, his studio, ... That was pretty cool.\n\nApart from that, the museum has a vast collection of art - spread over 2 separate buildings connected by an underground tunnel. It was a little confusing to be honest. I saw some of the other rooms (not all, was a little short on time). There were classical pieces, paintings by European painters, and American artists too - Edward Hopper, Jackson Pollock, Constance Mayer, William Merit Chase, and others.\n\nThe museum has a nice collection and one can easily spend an entire day there. Get in there early, as queues get really long, especially for the Van Gogh exhibit. The docents and staff are very kind and helpful, and rather informative. You could save yourself time and buy tickets online and head straight for the entry. It opens late on Sundays, so keep that in mind.",
  "We were in Houston for a few days, and had to check out the museum, especially for the Vincent Van Gogh: His life in art Exhibit. The exhibit was extremely crowded and made me question the museum etiquette of most Americans. They're extremely loud, DO NOT move when listening to their audio guides or on their phones crowding around pieces, talk on their phones, and like robots they need to do see it all in one order creating massive queues instead of entering a room and spreading out!\n\nAnyway, the exhibit was alright. I expected a lot more of Vincent Ven Gogh's iconic pieces - his sunflowers, more of his self portraits, Starry Night (since it's already in a US museum (MoMA)), bedroom in Arles, more of the olive trees, ... but I was disappointed. The exhibit is divided into different rooms, almost chronologically. The first room has only \"reproductions\" and all his diaries and postcards were not originals and mere reproductions. The exhibit had some interesting paintings - one of his self-portraits, that of his brother, Theo, his irises, and numerous other works. The exhibit ended with an interactive room, where you can \"live\" art - pose for pictures in life-size recreations of his paintings like his room in the Yellow House at Arles, the street cafe at Arles, his studio, ... That was pretty cool.\n\nApart from that, the museum has a vast collection of art - spread over 2 separate buildings connected by an underground tunnel. It was a little confusing to be honest. I saw some of the other rooms (not all, was a little short on time). There were classical pieces, paintings by European painters, and American artists too - Edward Hopper, Jackson Pollock, Constance Mayer, William Merit Chase, and others.\n\nThe museum has a nice collection and one can easily spend an entire day there. Get in there early, as queues get really long, especially for the Van Gogh exhibit. The docents and staff are very kind and helpful, and rather informative. You could save yourself time and buy tickets online and head straight for the entry. It opens late on Sundays, so keep that in mind.",
  "I love going to this Museum when interesting exhibits are in town. Do not recommend bringing younger children to the more sophisticated and serious exhibits as they will probably fall asleep. I bring my older teenagers here but not the younger ones as I prefer to enjoy this gem with less interruption.",
  "I loved roaming the many galleries of European art, from the Medieval to contemporary. I  was also amazed at the amount of East Asian, Indian, and Islamic art they had as well. This might be a two day trip though, it's easy to get \"visual fatigue\" in a place like this.",
  "We went to Norman Rockwell exhibit.  was amazing and enjoyed the history lesson from early days, thru wars and peace.",
  "Our first trip to the Museum of Fine Arts was a most enjoyable experience.  We were thoroughly impressed with the way we were introduced to a few works and were immediately directed through a striking and sobering photo exhibit of the Great Depression and World War II that gave great insight to Rockwell’s work and caused us to study the remaining pieces even closer than we would have.  \n\nSince we only saw his nostalgic and humorous works when we were children, it was wonderful to see the serious subject matter toward the end of the exhibit.  It is not that human behavior changed from 1930 to the 1970s; how he was allowed to paint it changed dramatically. That man really laid his emotions on the canvas and the museum did a fine job of showing us why.  ",
  "We are members and went to see the Rockwell exhibit  and the Spanish treasures exhibit.  Both were very good.",
  "Went here by chance as the natural history and science museum was closed for the day. Lovely place. Had some heat paintings but also exhibits from Italian furniture to Egyptian, Japanese,  Indonesian exhibits. WEL worth a few hours of your time "
 ]
},{
 "name": "Children's Museum of Houston",
 "address": "1500 Binz St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/bc/e9/1e/children-s-museum-of.jpg",
 "tags": [
  "educational",
  "kids",
  "kids",
  "run",
  "food",
  "family",
  "learn",
  "kids",
  "food",
  "kids",
  "educational",
  "kids",
  "experience",
  "kids",
  "kids",
  "energy",
  "free",
  "kids",
  "experience"
 ],
 "website": "http://www.cmhouston.org",
 "source": "TripAdvisor",
 "reviews": [
  "Where do I start!? This place was wonderful. There were multiple areas that integrated a wide array of educational experiences. There was a little ropes course, a lab where kids and parents could do science experiments, a “kids town”, an outdoor water area and so much more. \n\nMy 8 year old’s favorite part was the water area and science lab. \n\nWe were there for around 2.5 hours and still didn’t see everything!",
  "Houston's Children's Museum is a place where dreams really do come true! Not just for the kids but you, too! With a separate ultra fun place for babies and toddlers, and oodles of awesome \"play make believe\" and learn areas for the kids, you and your family can easily spend the day here. Immaculately clean (sacks are handed out in the baby/toddler area to collect and turn into staff all those toys that go in the mouth or any place else they get dirty), extremely well organized, engaging for children of every age (that includes parents, grandparents, and other family members), and fantastical beyond even the wildest imaginations, Children's Museum is a family must-do for both Houston visitors and Houston area residents. There is a cafeteria in the building with food appealing to all ages and a paid covered parking garage right across the street. Children's Museum is centrally located in the Houston Museum District in the Inner Loop near our world famous Medical Center and provides for family memberships, multi-museum passes (Fine Arts, Science Museum (look for my reviews of these two fabulous museums), etc.). Included in  the kids' exhibits are a working play grocery store with cash registers and play food, baskets, play money, all run and frequented by the children, a ice cream/shake/burger spot all with play foods, food \"machines, locale-accurate tables and chairs, an ambulance with all the toy medical devices with a full open doored ambulance where your children can try out their practice of medicine on you, climbing devices, and plenty more. On the basement level is a whole spy play area that was a huge hit with the 8 year old I was with. The 15 month old I was with was thrilled with all the colorful, safe toys in the baby/toddler area including the climb up and slide apparatus, the multiple climbing through tunnels, baby balls gym that are changed out for a new set and the gym completely wiped down during the hour I was there with him. His favorite, however, was the size-appropriate 50's style wood car complete with two steering wheels, back seat, and 50's music coming from the \"radio\" operated by a push of an inquisitive toddler. What fun! If I were only young enough to play! ",
  "We've lived in 15 U.S. states and seven other nations, from the Philippines to Israel, and CMH is the most engaging children's museum (and the museum most engaging for children of all ages) that we've experienced.  We visited with a number of children and a small flock of adults from 19 to 70+ in age.  CMH is truly a feast and festival for the young and young at heart--and on a human scale (in that respect, more like the Prado than the Louvre :-).",
  "The Children's Museum is a great place to bring kiddos, but it can get really crowded, which can make it hard to keep track of them. The water play area outside is fun when it's warmer outside, and the new engineering area is really fun for kids and grownups. It's great for a rainy day because so much of it is indoors, but it's best to get there early because it can get so crowded.",
  "One of the best things to do in Houston if you have Kids under 15. Lot of hands-on learning activities that can keep the Kids engaged. Setup of Grocery store that lets Kids play Cashier or Shopper roles is great. Make sure you go outside and checkout the whole Hydro theme. Of course, you have to let the kids get lost in the Spiral Net Maze. And there is a beginner rock-climbing area. There is a whole area dedicated for the littler ones. Spend some time in the lower level where you can help Kids build Rockets and other contraptions.\n\nGo early in the Day - allows more time for Kids at the popular activities. Gets very busy as the day goes. There is paid Parking Deck next door - easy access. Plan to spend at least 4 to 6 hours. There is a decent onsite Restaurant if you need food. If you are local and have Kids, best to get an Annual Pass and visit as much as possible, This is in the Museum District - close to Museum of Natural Science, Hermann Park and is close to the Metro Rail.",
  "I have been bringing my son here since he was 2 years old he is now 7! There is just SOOO much for them to do!! They have a toddler area which is great with lots of activities to keep your little one busy and you don't have to worry about getting stomped on by the bigger kids. They have lots of crafts, science and physical activities for the bigger kids. there is a make believe grocery store, restaurant, vet, news broadcasting room, an ambulance and lots and lots of hands on and educational activities. Also there is a water tower outside and a playground. Make sure you bring an extra pair of shoes and clothing because they will get wet. An added plus is they have FREE FAMILY NIGHT on Thursdays from 5pm-8pm but just fyi it does get pretty crowded but your kids will still enjoy themselves!!",
  "Lots of fun things to do - great learning experience for all. Innovative with a good verity off children learning experiences.",
  "This plase I reconmend for all families. The games were awsome for the kids to play. We had a wounderfull time.Be prepared to stay for a while.",
  "I was very surprised at all the hands on activities for the children. Our grandchildren, ages 10 - 18, LOVED it!",
  "There are 3 floors with about 20 different sections. Most are best for ages 4-7 Although the toddler area upstairs was good, there isn’t much to do fur small kids like our 2 year old daughter so I think it should be cheaper for 2-3yr olds. Good activity for a rainy day. ",
  "Depending on your view I tend to think of Museum as about the past but this children's exploratory uses gadgets galore to teach kids physics, chemistry, motor skills with careers and STEM guidance dotted around for good measure.  The huge climbing net at the back of the building I'd not seen before but created a great space for physical development, there were exhibits and try outs on physics, chemistry, visual holograms where staff helped to create your own hologram and Kidtropolis virtual city to try out different careers and act out different roles with your souvenir Kid Card also acting as your ATM card.   So much to do at a surface level we only had three hours and it really wasn't enough but you do get three hours free parking at the neighbouring park and their annual passes are good value.   We went on a regular school day for the US so it was lively but not really busy and that probably improved the experience as we could try everything without waiting for exhibits.   I'd happily go back again and again because each section deserves its own concentrated time, my only suggestion to the really very friendly staff would be perhaps to consider producing a guide sheet, even online for parents to help them get the best for their children from the visit - there are some who just want a place to burn off excess energy but if you want to look at STEM careers or develop curiosity the place has so many options,  Houston's a lucky city to have this place."
 ]
},{
 "name": "Houston Zoo",
 "address": "6200 Hermann Park Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/ff/07/3f/photo3jpg.jpg",
 "tags": [
  "kids",
  "energy",
  "interactive",
  "run",
  "family",
  "free",
  "walk",
  "interactive",
  "walk",
  "free",
  "unique",
  "experience",
  "drink",
  "food"
 ],
 "website": "http://www.houstonzoo.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Whenever I visit the Zoo, of which I am proud to say I am a member, it feels as if I am visiting several countries in one day.  The variety of well-cared for animals is outstanding.  I particularly love how the animals interact with us.  During the season of Christmas lights, we visit the animals and then as it darkens and we return for the Christmas lights, it is great to picture where the animals are sleeping and resting.",
  "I've been to the Houston Zoo many times over the years since I was a little girl and it keeps getting better and better. Once a fairly small zoo has turned into a huge place filled with animals and lots of extra fun activities including a carousel at the children's section and giraffe feeding. Even as an adult the children's zoo is my favorite part. There are lots of interactive exhibits for the kids and a play area to run off some energy. My 2 year old son had a blast here and didn't want to leave. The price has risen significantly over the years but with all there is to do its worth the money we paid for admission. Be sure to have your picture taken by zoo staff as you enter so you can buy it before you leave. It's a great way to remember your family time at the zoo. If you have small children there are wagons available for rent and are a life saver when your child's little legs get tired. \n\nDon't miss stopping at the gift shop on your way out. There are lots of souvenirs to choose from. Also, a trip to the Houston zoo isn't complete without a ride on the train. The train is located outside the zoo and is an extra charge but it's worth it. The train takes you around Herman park so you can check out the scenery and maybe decide to visit the park after or another day. Plan to spend at least half a day at the zoo and you should be able to see and do everything the zoo has to offer ❤\n",
  "This zoo is great but be prepared to do some serious walking if you plan to see all there is to see. The cost was $18 per adult. \nParking was free if you are lucky to find a spot. It was packed and cars were circling to find a space. \nThe zoo is next to many other attractions so that makes it a bit harder.\nThe zoo has great variety of animals to see. All the best. Giraffes were contained for some reason but still able to view.\nGreat Kiddie petting zoo area too\nThey have a reptile house and aquarium as well.\nI rank this zoo very good for size, maintenance and variety. Park grounds are very nice.\nSnacks are ok to take for the kiddos.\nThey close at 6 but allow people in only till 5- opening times may vary.\nMy advice is to go early, take your time, devise a plan and have fun with your loved ones",
  "I have lived in the Houston Metropolitan Area for 25 years and did not realize that the Zoo offered Free First Tuesday events. When I became aware of it, I ordered tickets for myself and my grandson; his Dad and uncle decided that they wanted to come too! \n\nWhile there was a bit of a line to get into the venue, everything else was delightful! We calculated that our group of four would have cost $72.00 on a normal day.  That is a deal!\n\nI ordered the tickets in advance online and showed them to the ticket agent. And we were in!\n\nWe spent four to five hours meandering the zoo and got to see everything that we wanted to see with extra $ to buy souvenirs and snacks.\n\nGo early! The gates open at 11:59 AM. Parking is not an issue then, but it becomes more complicated the later you go. \n\nWe really enjoyed ourselves and we hope that you do, too! Wear comfortable shoes as you will be walking a lot!!",
  "If you like seeing different kinds of animal and walking at the same time, this zoo is for you.  It's an all day activity so eat what you want and walk it off there. The different types of species are separated in sections.  So if you like one particular kind of animal you may visit that section.  Going there while they are feeding the animals is the best time to see the animals, being there during nap time is not as amusing.  Take comfortable shoes and a sun hat and sun glasses.",
  "We go to the Houston Zoo pretty regularly! It's very well kept and they have shows every so often. The children's area is especially fun for the kiddos, but if you're planning on visiting that area, bring extra clothes! Kids can't walk past the splash park without dying to go in! :) My 5 year old son's favorite thing to visit is the Komodo Dragon enclosure, even though they don't do anything but lay there. lol He likes that there is only a few inches of glass between him and the animal, especially since it's one of his favorites. My personal favorite is the new Chimp area in the Africa Exhibit - So interactive! I would definitely say to make your way to the new addition in the back/west area of the zoo - so many new, exotic animals to see! We enjoy every visit (especially when the dinosaurs come to town!) and look forward to next time every time we leave.",
  "I took my cousin and sister to the zoo. My four-year-old cousin's mind was blown. She loved all the animals and the train ride. Including the part when the train's wheel went off the track. Everything was open, and the winter lights were still up. My one regret was that we couldn't stay to see the show. The only problem was the limited parking.",
  "We had a great time.We felt in love with the gorilla.They have giraffe and elephant. The only thing was that I was a little sad to not see water for the elephant and the skin was very dry but besides that all the animals look very well take care.",
  "I Am Bruce the zoo guy and I've been to around 120 zoos and aquariums around the country. This is my review of the Houston Zoo. First off this zoo has one of the greatest elephant exhibits. it has 3 parts and is very large. i like that they also updated their primate section. they have a section on texas wetlands too.\n the gorilla section is very well done. admissiin is $23 for adults. parking is free, though fills up early. easily traversed paths  with lots of shade. cool n unique lion exhibit with cool tunnel. lots of places to eat. sea lion exhibit is sad as they only have one sea lion, poor fella. see pics of my experience",
  "I have visited many zoos across the country and I was very disappointed in many aspects of this zoo. Limited parking full early. Police of no assistance in directing us to other options. Finally saw a sign for additional parking but it cost $10 and required a shuttle. Upon leaving we waited for 45 minutes to board a shuttle and eventually called Uber. Upon entering, the only restrooms were port o potties with no where to wash your hands. Did find a hand sanitizer station. Exhibits were OK but extra charges for one exhibit. $7 charge for 3 lettuce leaves to feed the giraffes. $5 charge for  a medium size soft drink. Directional signage was poor. Not worth the money and hassle.",
  "We had a great time! A lot of new/redone exhibits were opened so we were able to see a lot. They seem to have even more plans of redoing things as some areas where the birds were had been closed. The elephants were probably our favorite and we got some great photos. The food wasn’t too expensive and was pretty good. \nParking is difficult so get there early. \nThis was included in our Houston CityPASS!"
 ]
},{
 "name": "Space Center Houston",
 "address": "1601 NASA Parkway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/c6/ad/e3/20180113-124313-largejpg.jpg",
 "tags": [
  "history",
  "learn",
  "experience",
  "practical",
  "walk",
  "kids",
  "history",
  "low",
  "cheap",
  "food",
  "family"
 ],
 "website": "http://spacecenter.org",
 "source": "TripAdvisor",
 "reviews": [
  "Amazing tour of the original mission control, be prepared to spend a whole day in the museum if you want to visit all tours,\n\nHighly recommend the 3 tram tours around the site and the astronauts talk",
  "The Space Center is a great place to learn about the history  of our space program.\n It was great to see the Mission Control room that we saw so may times on TV in the past.\nThe facility has great exhibit, lots of hands on areas, plenty of space exploration history displays and good tours'\nThe huge hanger with the Saturn V rocket is amazing.\n{t is a lot to see, so take some breaks during the day.",
  "We loved the Saturn at Rocket Park,Independence Plaza, the two different trams to simulations and Mission Control, (timed tickets on line), and going on a week day when schools are in sessions is a plus. Worth the money! Makes you feel patriotic!",
  "it is so amazing to see the eyes of a child standing next to Saturn V rocket or navigating the miniature lunar exploration rover.  Place is packed with science, fun and of course everything related to space travel.  \nThere are two tours starting from JSC main building.  One to the Mission Control Building and the other to the Astronaut Training Facility.  Get in line early, cause it can easily get crowded with wait times over an hour. \nBesides space stuff, NASA acts as a animal refuge for some deer, Texas Longhorns and other wild animals that can be seen during the tour(s)",
  "We decided to visit the Space Center and did not regret it. We took the long tram tour which I definitely recommend as it gives the possibility to see the control room of the Apollo program, the robonauts and the full size Saturn V rocket. We also had time to visit the Independence Plaza shuttle. \nThroughout the museum there are many areas to experiment or movies to see, all making it a great and impressive learning experience. Weekdays the museum closes at 5pm and I recommend arriving the latest at 12:00-12:30 to secure time for these.\n",
  "Space Center Houston is a must see for visitors. Below are some helpful hints for your visit.\n\nBasic Tips/Info\n- It's always busy so show up earlier in the day and get on the tours first thing.\n- Large strollers are allowed but aren't really practical so I recommend bringing the carrier\n- Anything less than a half day here and you'll be missing out.\n- While there is technically a line to get into the space shuttle outside, it moves very fast so don't worry about the wait.\n- The displays in the center of the space center change a couple times a year so it's worth a second trip if you live in the area.\n- Everything is kid friendly (changing tables, cafeteria, exhibits, even a playground inside)\n- Houston gets hot in the summer and you'll be outdoors for the majority of the tours. Dress appropriately.\n\nTours\nThere are two tours and visitors always ask, which one is better. If you only have time for one, go on the one to the space station training building, not the mission control one. Both tours are great but there isn't as much of the \"wow factor\" on the mission control tour so if you only have time for one, go see the space station.\n\nThe main difference between the tours is where they go first. You can either choose the International Space Station training building or mission control You will spend approximately 30-45 minutes there and then head to see the building housing the Saturn V rocket aka \"Rocket Park\". Personally I think rocket park is just as neat as the first half of the tour since you get to see the most powerful rocket ever built by the USA up close an personal. Also, there are a lot of signs telling you the history of manned space flight. Very neat. Once you are done here, you can hop on the next tram back to the main space center.\n\nLastly, the trams are open to the elements so if it looks like its going to rain, you might want to hold off until later. If you decide to tough it out though, they do hand out ponchos!\n\nIf You Have All Day\nThe first thing you should do when you get there is go get in line for a tour. The line gets longer throughout the day so it pays to go early. Once you've knocked out one (or both tours), you can easily spend another couple hours walking through the space shuttle, reading the history and watching the demonstrations (mostly for kids). The Space Center has 2 shuttles that you can go in, one inside and on on top of the 747 sitting outside (it's hard to miss, trust me). \n\nIf You Have Half A Day\nI'd still recommend doing the tour and walking through the space shuttles. You'll probably have to pass on reading all the history but how often do you get to walk in something that spent time in outer space?\n\nIf You Have 1-2 Hours\nTaking a tour isn't really practical so you'll be limited to seeing the shuttles and looking around inside.",
  "My wife and I spent the entire day there and did not get a chance to see everything. I highly recommend an early start to your day.  The entire space center was amazing to see. History does come to life (my wife and I were in grammar school when the space race was occurring). \nHere is how we rated what we saw:\nOrion tour - excellent \nMission control - excellent \nAstronaut training - good\nSpace shuttle transport- excellent \nMuseum - excellent \n\nWe did not have the opportunity to see most of the movies since the tours are all very lengthy \n\nThis is a MUST if visiting Houston ",
  "As a huge fan of anything space related, particularly the early Mercury-Apollo missions l, this was a superb visit and I wished I’d had longer\n\nThe first thing to do is get on the tram which takes you on a tour of mission control, the training facility and the Saturn V rocket.  A word of warning the Apollo Mission Control is on a separate tour so allow yourself time if you want to see this - I didn’t and I’m still kicking myself\n\nThe shuttle carrying 747 with mock-up shuttle is great as is the indoor displays where you can touch a price of the moon and Mars!\n\nAs the title says, don’t pass through Houston without visiting ",
  "To get to the Space Center we had to use public transport from downtown Houston. Despite the Space Center being a main attraction there is a very infrequent bus service to the location, however this must be because demand is low as the bus wasn't actually that full. We got the 249 which took about 1 hour and was very cheap; just $1.25 each, one-way.\nWe bought tickets for the attraction online to avoid any qeues but also because you can generally find a discount of around 5-10% online so it is worth a look. We walked straight in without a problem and were greeted by a large exhibition hall. There was so much to do here that we could've spent half a day just looking around, this included talks and shows. We visited the Cinema show which was good and got pictures with the lectern used in JFK'S infamous \"We choose to go to the moon\" speech. We didn't have anytime to eat anything at the food court which was in the main area as there was so much else to do.\nWe went on the tram tour which was a highlight. Despite having to wait about 45 minutes to board it was certainly worth it as the tour is highly detailed and you get to see awesome locations like Mission Control. We stayed all day right until closing and then got the last bus back.",
  "We went inside the mission control area which was dark and quiet. I was sitting in the front with several family members and a sleeping toddler on my lap. A  woman with a microphone came and stood right in front of me and yelled at all of us in a very mean voice about how we need to be very quiet. This scared the crap out of all of us and woke and scared my child who began to fuss. She then raised her voice and increased the nastiness of her tone and repeated the warning. I comforted and silenced my child in less than three seconds and still this woman went on screaming. Beyond that I found everything about the place relatively boring and we had been to the zoo and the museum the day before which were enjoyable.",
  "We took the VIP tour. It was great. We arrived  1 hour before an went in as soon as they opened.  We went through the turnstiles and to the right.  This is where we picked up our badges.  Then we went exploring until our tour.  We saw the plane and the shuttle.  you can go into both.  We saw he moon rock and touched it.  We looked at may other exhibits and listened to a talk.  Then we got with our group for the VIP tour.  They loaded us onto and air conditioned van and off we went.  We toured building 13 and the swimming pool (an astronaut and divers were in it).  We had lunch at the normal cafeteria (they give us a $16 voucher each).  We went to 2 mission control centers.  Then we stopped to see the Saturn 5 rocket.  Along the way we saw the Longhorns.   I am so glad we did this tour.  I feel I have a better understanding of our space programs past and current.  Thank you Dave!"
 ]
},{
 "name": "The Galleria",
 "address": "5085 Westheimer Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/ae/42/c0/the-galleria.jpg",
 "tags": [
  "family",
  "affordable",
  "food",
  "food",
  "affordable",
  "experience",
  "experience",
  "food",
  "experience"
 ],
 "website": "http://www.simon.com/mall/the-galleria",
 "source": "TripAdvisor",
 "reviews": [
  "The mall is located in the Galleria area which is full of great shopping and restaurants. Within the mall itself, there is a plethora of  stores to suit a range of budgets - from high end stores, like Burberry, Chanel and Christian Louboutin, to more affordable stores like Zara, Forever 21 and Claire's. Restaurant choices are also varied to suit a variety of tastes from family oriented restaurants, like Chick-Fil-A, to more expensive restaurants, like the highly rated Nobu and Yauatcha. An added bonus is the ice skating rink that is located within the Galleria. ",
  "he Galleria is the seventh-largest shopping mall in the US by retail space. 375 stores. The development consists of a retail complex, as well as the Galleria Office Towers complex, two Westin hotels, and a private health club. Can't imagine shopping here and not finding what you are looking for! There's a full-size ice rink for recreational and figure skating, a state of the art children’s play area, two swimming pools, three full-service national and international banks, two tailor shops, several beauty salons, and a post office.",
  "Huge mall, with lots of shops, clean and beautiful\nI recommend the visit\nFound everything I needed and did window shopping as well\nGreat food and cafes as well\n",
  "Being from big town we have the same kind of malls but totally enjoyed the Galleria.  Had lunch at Salatas which we have in our town but love it there",
  "My daughter and I enjoy going to the Galleria to shop, eat and get haircuts.  There is lots of variety and price points. There is something for everyone in the Galleria.",
  "Galleria is huge mall,you can get easily lost.I visited this mall several times during my stay in Houston.Its really nice experience to shop here,specially Macy's shop.The prices for clothing items are rock bottom and the quality is premium.The mall also has all the premium Watch stores and they have a wide variety,This place is really good for shopping with affordable prices.The food court has good selection of various types of food,I tried Daily Grill which is worth every penny,",
  "The mall is huge butt has an abundance of great stores... Traffic around the galleria is not good. But it was a good mall experience overall. ",
  "First time at the galleria and I went ice skating! Fell a couple times but worth the experience. It was so much fun and lots of food choices to choose from."
 ]
},{
 "name": "Cockrell Butterfly Center",
 "address": "1 Hermann Circle Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0e/82/f4/houston.jpg",
 "tags": [
  "kids",
  "kids",
  "learn",
  "kids",
  "family",
  "experience",
  "educational"
 ],
 "website": "http://HMNS.org/butterflycenter",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I visited the Cockrell Butterfly Center on a visit to Houston. When you enter, the center has a room of informational exhibits about butterflies and other insects, good for both adults and kids. Then you enter the three-story sunny space that contains the live butterflies, descending a ramp into a warm and humid tropical forest with tree-mounted orchids and free-flying tropical and sub-tropical butterflies everywhere around you. We have been to many exhibits like this around the world and we rate this one quite highly for the plants and the variety of butterflies. I had never seen Glasswing butterflies in an exhibit like this, but I saw several on my visit. The butterflies come to the museum as chrysalises (pupae) from all over the world. In the exhibits room you can see where they hang them and watch some new butterflies emerge right before your eyes! Morning is usually best for that.",
  "This is a great part of the Museum of Natural Science and has the most beautiful butterflies you can imagine.  Great walk-through exhibit on 3 levels, like a tropical rainforest.",
  "The Cockrell Butterfly Center at the Houston Museum of Natural Science is a must-see. Everyone from kids to adults will enjoy the beautiful garden filled with beautiful butterflies of all sorts. There’s also a waterfall and some exhibits to learn more before you step inside the butterfly house. So beautiful and always warm that it’s hard to describe. ",
  "Bring your kids, bring your significant other, bring your grandparents, just don't bring your dogs. This place is so beautiful and it's a heck of a fun time. Bring a camera!",
  "The Cockrell Butterfly Center is a must see when you go to Houston.  If you are a lover of nature and want an up close look at gorgeous butterflies in their natural habitat you won't be dissapointed.  There are hundreds of live butterflies showcased in a natural rainforest setting.  It is extremely hot and humid inside the center so be sure to dress accordingly.  The Butterfly Center is located inside the Museum of Natural Science and the tickets are rather expensive.  The prices include $8.00 for adults and $6.00 for children.  It doesn't sound bad but when you have a large family it can get pricey.  Not only do you get to see butterflies the center also has an insect zoo that displays some of their more creepy relatives.  All in all the Butterfly Center is worth a visit.",
  "To really enjoy this experience takes time and patience. My son knelt to observe some butterflies and eventually others landed on and near him. He was transfixed. By summer afternoons the humidity and heat are stifling so try to go early and when it's less crowded so you can move at your own pace.",
  "Great place for all ages. Lots of butterflies and the educational material was very good. No people there  so we got our pandemic social distancing taken care of as well.",
  "We really enjoyed our visit here.  The butterflies were amazing and beautiful.  One landed on the coat of one of our group and seemed to like the color, so stayed for awhile.  The museum part was also very interesting.",
  "So excited when we went in to see so many butterflies.  They also had a longevity study going on which request you to take pic of a butterfly if you saw a number and post it to Instagram.  My husband and I both had a lot of fun looking at the butterflies and also trying to find the numbered ones.",
  "Part of the Natural History museum, with separate entrance fee, but very worth it. We spent about one hour. ",
  "Cockrell butterfly center is located in the Houston Museum of natural science. It's a beautiful center where you can not only see butterflies but also different insect species and a caged iguana and small turtle. It was nice, I just wish there were more variety of butterflies I kept seeing the same type of butterflies throughout the center. And like the museum, I highly recommend going during the week where there are less crowds."
 ]
},{
 "name": "Toyota Center",
 "address": "1510 Polk St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/41/e7/b0/nba-the-toyota-center.jpg",
 "tags": [
  "food",
  "family",
  "experience"
 ],
 "website": "http://www.houstonarena.net/",
 "source": "TripAdvisor",
 "reviews": [
  "We attended this venue for the Eagles concert. I was a little disappointed that the big screens weren't used, but just being in the house was enough. The seats were arranged so that we didn't have to peek over anyone but I highly recommend bringing a stadium seat cushion for comfort, they are not padded that well and sitting made us numb",
  "Very organised entry with some security but still quick. Some food and beverage retail inside with limited choices and fixed prices. Our seats were on 480 and it’s narrow and fairly steep and the seat leg room is short, everyone managed ok though. Restrooms were clean and plentiful. There was a family room which was locked. The exit procedure was pretty smooth and quick and outside the police moved cars very quickly.\nThe acoustics were amazing and the lighting, we had a great time watching and listening to the eagles.",
  "One of my highlights for the duration of my stay in Houston!\n\nBooked a tour and game, it did not disappoint. Unfortunately because I was outside the US I was not able to book on their website, with just a quick email to the Toyota Centre, Ryan, the Group Event Executive got in touch and sorted it all out for us. Excellent service. Within a couple of days, we had paid and confirmed our place on a tour of the Toyota Centre and a ticket to the Rockets v Knicks game. \n\nWhen we arrived for our tour, we were in a small group of about 7-8 people. The tour lasted about an hour and a half (if I remember rightly) and we were taken to pretty much all backstage areas as well as the court. After the tour we were given passes to the pre-game warm up and tickets to our match.\n\nWe came back at 5.30pm for the pre-game warm up, entry was quick and organised. Just before the game started we walked around, there were lots of competition and give aways, the event is well organised and the atmosphere is fantastic. The game was brilliant with lots going on in breaks. It was my first basketball match and will always remember it. All for just $40.\n\nBig shout out to Ryan and the team for a fabulous day! To top it all off, The Rockets beat the Knicks that night!",
  "Never been to a live basketball game before, and this was definitely the place to start. It wasn't even basketball season but it was amazing to watch and experience. Everyone was really friendly and even though we were up high you can clearly see the whole court. We booked our tickets on stubhub and they were only $14 USD each.",
  "I have been there for Joe Rogan's Stand Up Special and UFC 247 both times events were organized in very spectacular fashion and I really enjoyed to be there."
 ]
},{
 "name": "Rodeo Houston or Houston Livestock Show and Rodeo",
 "address": "3 Nrg Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/a2/a2/ec/bull-riding.jpg",
 "tags": [
  "food",
  "food",
  "kids",
  "experience",
  "kids",
  "experience",
  "food",
  "family",
  "food"
 ],
 "website": "http://www.rodeohouston.com/",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I spent the entire day here and were truly impressed. Plenty of food vendors so you can get anything you want to eat. Tons of vendors so you can shop to your hearts content. GreaT shows ongoing all day - we loved the dog agility show and all the animal judging contests. Since we live in the city we really enjoyed seeing all the animals. Free Wine tasting the day we were there was an added benefit. Rodeo was great and the it was followed by a show from Becky G ( we didn’t stay for that because it was not our type of music). Overall great value for a phenomenal time. ",
  "This is a must attend event if you are in Houston in March that raises money for student scholarships.  It is similar to a State Fair up north but with Rodeo entertainment in addition to nightly concerts, carnival attractions, livestock, art, shopping and of course food!  The wine garden is a must if you are over 21.  \n\nMy favorite rodeo event was the Mutton Bustin' where crazy parents put their preschoolers on the back of a big sheep that then dashes across the ring with the child holding on for dear life!  The kids actually seemed to be having a blast.   \n\nDisappointing that they had to end the Rodeo early this year due to the nasty Covid-19 virus.  So thankful I went on opening night so I was able to experience this wonderful event.   I hope to be back next year.",
  "It was the first time that I visited Houston so I decided to go to the rodeo - it was fun and it is worthed! A lot of rides, carnival atmosphere, kids friendly environment. The artist that performed on the day I went was Chance the Rapper and the show was amazing - almost 62.000 tickets sold - great performance! It was for sure a once in a lifetime experience!",
  "Here is a letter I sent to Goode Co. BBQ: \nI took my daughter to the Houston rodeo yesterday to see a KPop band. We spent the whole afternoon at the rodeo and needed to get something for her to eat before the concert. She has Celiac Disease and gets very sick within hours of eating anything that is contaminated with wheat. The Goode Company BBQ booth took care of us by changing gloves, cleaning the knife, and preparing her food on a different surface. We ordered brisket for her (no sauce) and she was able to enjoy the concert to celebrate her birthday. Thank you so much!! Please pass this message along. This attention to detail made our day, and kept the birthday girl from getting very sick. As a parent, I appreciated the caring attitude and attention this group showed our family.",
  "I actaully made it for the cook-off competition, and this was my first time.  I was overwhelmed by the action, tents, cooking, activities.  It was like nothing I have ever attended before.  I was in the Pitmaster tent and the food was amazing.  the tent had so much action, just like the rest of the tents. It was my first time having a fried twinkie and fried oreo.  If you ever get the chance to end of with VIP passes, do not pass this up.  You will not regret it."
 ]
},{
 "name": "Water Wall",
 "address": "2800 Post Oak Blvd near the Galleria",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/66/dd/6d/water-wall.jpg",
 "tags": [
  "free",
  "peaceful",
  "walk",
  "free"
 ],
 "website": "http://www.uptown-houston.com/news/page/water-wall-park",
 "source": "TripAdvisor",
 "reviews": [
  "great architecture and very smart, looking at the falls and the water seems to be running up instead of falling down, fun place to hang-out located at a park and few steps to the Galleria Mall.",
  "Hidden in the Galleria area by the Williams Tower (Art Deco Style) is this enormous Fountain on the prairie.   Marvel at the soothing sound and site.   Great place for a partial day out in the outdoors.  Social interactions with the people.    ",
  "It is a mesmerizing huge waterfall right near the galleria shopping mall..it’s hypnotic and delightful to see ..it’s free to all..fun for all ages both young and old and in between \ngreat place to take photos..",
  "As a college student at U of H, we would go and hang out on the lawn of this water wall and stare at it in awe. 25 years later it's still fun to see and yes you will get wet if you get too close. We went on a Sunday morning and had it all to ourselves and got great photos. Parking is not easily available so start looking as u get close. ",
  "Interesting architecture in a park setting.  What is it?  11,000 gallons of recycled water falling over a semi-circular shaped  concrete wall, 64 feet tall.  On one end of a small open park area.  Who's it for?  Anyone.  When to go?  During the week it wasn't busy at all.  How long to stay?  Pack a lunch, and stay for a couple of hours.  Overall, we enjoyed it, and standing beside it was loudly peaceful. A wonderful mist/breeze came off the water, and I was VERY pleased that with recycled water it did not smell at all.  There were some people taking pictures and having lunch--it was a nice atmosphere of rest in the middle of the city.  The wall area is not shaded, so wear a hat, but the tree groves around it provide shade and there are some benches to have a seat.  Lovely place.",
  "The Wall of Water is actually a part of the cooling system for Williams Tower.  That is why the spray from it is so refreshing!  Be careful on windy days as you may get more wet than you planned!",
  "Yet, a concret structure, but found it impressive! Kids were amazed. Beautiful construction. Thing is, we had a hard time finding parking around.",
  "It was a cool view. You will get wet if you get close to the wall especially if the wind is blowing. The park surrounding the wall is nice and comforting. ",
  "Fascinating structure that towered over us with water continously flowing down, creating a mist in the middle of the semi circle. Note there is no roadside parking but you can park at Galleria shopping mall nearby. It's a short visit, 20 minutes enough, but fun.",
  "The Waterwall is becoming a Houston landmark.  The wall is located in a small park near The Galleria.  Parking can be an issue; if you don't mind a short walk some parking is available at the shopping center parking garage (The Galleria is another nice visit).  Be prepared to take many photos.",
  "I really debated between and 3 and a 4.  I was disappointed that the only parking we could find was the $3 for 15 minute parking.  The area was super busy (we were there on a Friday evening) and we didn't want to drive in circles looking for the supposedly free Galleria parking.\nThe area right in front of the feature was extremely muddy due to the spray coming off of the wall.  I'm glad we went and walking all the way around the back of the wall was worth it as well.  There were several people doing photo shoots with lighting and all, so it was hard to get photos without people or equipment in the photos.\nOne other warning, use Waze or something that keeps up to date with construction changes with your GPS because we ended up being forced onto a freeway when the way we wanted to go was closed. Luckily, we didn't have to be anywhere, so we took it as an excuse to explore another area."
 ]
},{
 "name": "NRG Stadium",
 "address": "1 Nrg Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c4/f9/24/view.jpg",
 "tags": [
  "food",
  "free",
  "delicious",
  "food",
  "walk",
  "food",
  "food",
  "family",
  "free",
  "kids",
  "food",
  "drink",
  "kids",
  "experience",
  "family"
 ],
 "website": "http://www.reliantpark.com/",
 "source": "TripAdvisor",
 "reviews": [
  "We just attended the WSU/U of Houston football game and we were impressed with the stadium and personnel.  They had free ice cream that was delicious as we entered the stadium.  There were people continually cleaning the public areas and the food was good stadium food.  We appreciated the air conditioned stadium. It was a pleasant evening!!",
  "Attended a Houston Texans preseason game; it was a lot of fun.  Plenty of restrooms, seats easily found with good labeling.  Shops, food, and beer all around stadium.  Before you go, make sure you check the website for bag restrictions - you need a clear purse or backpack within certain dimensions.  A tailgater tipped us off because I had a regular non-see-through crossbody purse and luckily we were able to walk back to our hotel (Holiday Inn NRG, separate review) to return it.  I made hubby carry my phone and stuff in his cargo shorts and then purchased a cute Houston Texans clear crossbody purse at the stadium for $20 :)  Will definitely visit again when we can go to a regular season game!",
  "This stadium is amazing, we came here to see the Texas Bowl. The views, atmosphere, interaction with fellow patrons was amazing. The size of food was great (every thing in Texas is bigger). \nWhat an amazing night.",
  "Great to visit on the weekend or during spring break!  If you have time, park in mid-town or the museum district/zoo area and take the train down.  Many free parking opportunities and the kids love riding the train.  I usually take a backpack full of little snacks as the kids will be hungry.  Alot of food good food choices.  There is alot of walking, so be prepared but a great family time by all!  Get there early as the crowds are much smaller before lunch!",
  "Many things happen at NRG Stadium/complex.  Home of the Houston Texans, the Houston Livestock Show and Rodeo, car and boat shows.  Check regularly to see what is going on at NRG stadium or arena or exhibit halls.",
  "Love going here for the Houston Livestock Show and rodeo! The food and prices are TOO EXPENSIVE! Its ridiculous. You cannot bring anything to eat or drink in. You can bring empty water bottles and fill it at the fountain. Yep, I've done it, especially with kids. It saved enough to pay for a meal! if you're not on a budget, bring a thick wallet!",
  "Went for Monster Jam on 25th Jan and had a great time with my son. Thankfully we had ear protection with us. It was a great first time experience of such event. Not many options for food/beverages and too costly.",
  "well I was here in September 2018 for the OTR Concert now I am back here again as a speaker in the GasTech Conference exactly 1 year after to the day.",
  "Like any large sports venue, there are lots of pizza, sandwich, beer places abounding, but some local gems too.  I love finding great Texas BBQ or artisan ice cream too.  ",
  "I am very dissatisfied with all of the performances tonight wasted my money I've been coming to theses events for years this one sucked only 1 truck really did anything my family was very unhappy",
  "We came to see the Texas bowl. A little drizzly outside but with a enclosed stadium it didn't matter. Had great seats on lower level. Easy to navigate. "
 ]
},{
 "name": "Discovery Green",
 "address": "1500 McKinney St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/77/71/5f/discovery-green.jpg",
 "tags": [
  "family",
  "drink",
  "kids",
  "unique",
  "family",
  "walk",
  "experience",
  "delicious",
  "experience",
  "energy",
  "kids",
  "run",
  "kids"
 ],
 "website": "http://www.discoverygreen.com/",
 "source": "TripAdvisor",
 "reviews": [
  "Walked through here on the way between my hotel and the Grotto Italian Restaurant.  It was 10 at night, and it was busy, but not overly so.  Kids were playing, people were walking dogs, families were out for an evening stroll, there was ice skating, music, fun art installations, manicured landscaping. benches, well-trimmed pathways - and it was very clean and almost entirely devoid of sketchy characters, vagrants, and rats.  \n\nReally weird, I thought I'd slipped through some sort of time warp back to an earlier day.\n\nYes, I know - this is a rather well-heeled part of Houston.  But a lot of Manhattan is also  pretty upscale, and you won't find a park like this.",
  "How nice to have an urban green space with many things to do for an entire family .. you can eat you can drink you can watch a movie you can watch kids having fun .. when you are in  downtown Houston make sure you go",
  "The park offers such unique views of Downtown Houston, and is really the hub for the various spokes reaching out to Houston mainstays including the Convention Center, Toyota Center, Minute Maid Park and House of Blues...just to name a few.",
  "Discovery Green is a great area to spend quality time with your loved one. They have amazing different attractions that represent the heart and soul of Houston. It is often filled with art exhibits, live music, and other city events. Discovery Green even has a skating rink in the center of the park. There is plenty of room to walk or ride bikes with the family. There also have a dog park so that everyone in the family can have a good time. It is a fun and vibrant experience with uplifting community events and the amazing Houston scenery. Discovery green is located in the center of Houston, downtown and is located around a lot of delicious restaurants along with other great Houston attractions. \n",
  "I have been there for a concert.Listen the music sitting on the grass and looking downtown’s buildings is an experience that I strongly suggest",
  "Wandered through the park, great sculptures and open space within the city.\nWill be great to see once has been upgraded",
  "A relaxing downtown park which is hidden away. There is equipment for kids to play on and enough room for them to run around and burn off some energy. There are also art installations to view.",
  "Not too crowded on a Sunday afternoon.  THey have a football field sized green space,  A nice (large) raise wooden platform with seating and beautiful Oak tree shade.   There is a coffee cart,  A good sized indoor cafe.  Goo playground for kids.   If you are downtown at a hotel, take a stroll down there"
 ]
},{
 "name": "National Museum of Funeral History",
 "address": "415 Barren Springs Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/7c/26/8e/national-museum-of-funeral.jpg",
 "tags": [
  "knowledgeable",
  "unique",
  "history",
  "educational",
  "history",
  "affordable",
  "history",
  "learn",
  "history",
  "history",
  "experience",
  "unique"
 ],
 "website": "https://nmfh.org/",
 "source": "TripAdvisor",
 "reviews": [
  "This is an absolute must-do in Houston. Fascinating and well put together displays with lots of excellent information. They also have a wonderful haunted house in October and lovely gift shop. The staff are so nice and the day we went (Halloween) there was a volunteer who was so knowledgeable and really genuinely enriched our visit. ",
  "The National Museum of Funeral History is a very unique museum presenting a history of funerals from Egyptian to today's modern practices.\n\nThere are a large variety of very professional exhibits from casket making, the funeral of a Pope, hearses as well as examples of funerals from a variety of cultures.  The exhibits are tastefully done, focusing on the the practice of the funeral with several examples on the passing of former presidents of the USA to Pope John Paul the Second.  There are beautiful examples of the variety of transportation methods including horse drawn carriages and numerous vehicles used through the century.\n\nI would highly recommend this museum as it is not atypical of museums out there. ",
  "Once you've been to the Space Center not much else UNUSUAL to see in Houston, etc for the National Museum of Funeral History! The papal exhibit on the death snd post-death rituals of the Romans Catholic pontiff were more informative than a display I saw at the Vatican!\nThe history of Egyptian embalming was fascinating. The tributes to the deceased PONTUS and the \"Unknown Soldier\" were very educational. Well worth the 30 minutes drive outside of town, we ubered for $22 each way and admission is only $10...extremely unusual gift shop, to boot!!!",
  "This was our third visit, still love the place! Not as macabre as you would think. There is a lot of history and super interesting exhibits. We learn something new each time and will continue to visit. Love the affordable gift shop too!",
  "It may not seem like something you’d be dying to see when you come to Houston, but it is actually a really interesting stop! It is broken down into different sections that feature different aspects of funeral history. My favorite is seeing the old vehicles and hearses, including one used for a past president. Highly recommend if you’re looking for something a little different to do.",
  "I really did not want to go here, but this was actually one of the most interesting museums ever. between the old instruments history, the old funeral vehicles, and all the exhibits, it was really enjoyable experience.",
  "My husband thought I was crazy wanting to go here, but we ended up spending over 2 hours here. Unique, amazing, and beautiful displays of hearses, funeral carts, and funeral associated memorabilia. Displays were very informative. Very surprised in the size of the building. Every corner we turned, there was more!!! Enjoyable afternoon.",
  "I highly recommend a visit to this unique museum.  My friend an I were super impressed with the quality of the displays.  I have never seen anything like this museum, perhaps it is the only one dealing with Funeral History in the entire US.  Check it out!"
 ]
},{
 "name": "Bayou Bend Collection and Gardens",
 "address": "1 Westcott St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/85/00/2e/bayou-bend.jpg",
 "tags": [
  "history",
  "walk",
  "walk",
  "free",
  "history",
  "free",
  "walk"
 ],
 "website": "http://www.mfah.org/a/christmas-village-at-bayou-bend",
 "source": "TripAdvisor",
 "reviews": [
  "Comparing the Bayou Bend American furniture rooms to DuPont's Winterthur Museum is unfair, as they both have excellent collections of American furnihings but Bayou Bend has a less comprehensive view of 18th and 19th century furnishings than Winterthur. It is still high on my list of National \"must see\" Museums. Its grounds are enchanting and the Museum feels more like a visit to a wealthy friend's home (a la Marjorie Merriweather Post's Hillwood in Washington, DC) than to a major Museum of American furniture (Winterthur in Delaware)",
  "Learn American history through arts and crafts. Highly recommend the 90 minute house tour to enjoy all the rooms. Stroll the lovely gardens at your leisure. Not crowded in late April but the flowers would have better earlier in spring.",
  "What would you see in a person's home in America during the colonial period or the revolutionary period or during the industrial revolution or before and right after the civil war?  Visit Bayou Bend to see the house and the decorative arts inside and also take the time to walk the grounds and see an oasis of green and color all during the year.  During the azalea trail in early March each year, the grounds are specular.  This is a true treasure in Houston that should not be missed if you live in Houston or come for a visit. ",
  "Nice quite area, well kept and a lovely place to walk around and enjoy nature. Many volunteers were cutting off dead flowers and were friendly and willing to answer questions while we were there. Lovely little gift shop.",
  "Visit to lovely mansion includes free self-guided audio tour.\nBeautiful gardens\nGreat restoration  of mansion. Each room is from a different period of history.",
  "An amazing gardens, house and property with lovely walking paths.  Beautiful decor inside with excellent workmanship.  Highly recommend.",
  "My friend and I decided to explore this place. For about $13, we were given access for a self guided tour of the house and gardens. There is a lot to explore and you need maybe 3 hours to explore the majority of it if you walk at a decent pace. On the third Sunday of every month, it's free admission. Enjoy!",
  "The Christmas decorations were extensive and delightful.  Staff were very helpful.  The play that was going on in the house was fun. Children were having fun. Music and trains were in a large tent."
 ]
},{
 "name": "The Menil Collection",
 "address": "1533 Sul Ross St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/7f/04/e7/the-menil-collection.jpg",
 "tags": [
  "unique",
  "family",
  "free",
  "educational",
  "free",
  "free",
  "free"
 ],
 "website": "http://www.menil.org/",
 "source": "TripAdvisor",
 "reviews": [
  "The eclectic collection of art is AMAZING!!\n Including early to mid-twentieth century works of Yves Tanguy, René Magritte, Max Ernst, Man Ray, Marcel Duchamp, Henri Matisse and Pablo Picasso, among others. I DIDN'T make it to the other side of the museum. My main interest was the  Aboriginal Art exhibit  Also included in the museum's permanent collection are antiquities and works of Byzantine, Medieval and tribal art.\nI really enjoyed the space of the tribal collection. It is a must to see the art aspect of Houston....I took my adult daughter here for the first time and it did not disappoint. The art, paintings, and sculptures were very interesting. There is also a nice little park across from the gallery. Parking is FREE!!!!  French expat Dominique de Menil, heiress to the Schlumberger fortune, came to Houston after World War II and began amassing an impressive mid-century art collection. Dominique befriended and collected many of the biggies: Ernst, Magrite, Johns, Rauschenberg, Warhol, and others. This intimate museum within a quaint residential section of Montrose/Museum District showcases. A museum in the middle of a residential neighborhood is a surprising delight. The René Magritte, \"The Meaning of Night\" is so thought provoking. His unique surrealist work moved me in such an surprising way!!",
  "The Menil was a labor of love of Dominique d’menil\na member of the Schlumberger family. The museum's holdings are diverse, including early to mid-twentieth century works of Yves Tanguy, René Magritte, Max Ernst, Man Ray, Marcel Duchamp, Henri Matisse and Pablo Picasso, among others.The museum also maintains an extensive collection of pop art and contemporary art from Jackson Pollock, Andy Warhol, Mark Rothko, Robert Rauschenberg, Vija Celmins and Cy Twombly, Jr., among others. Also included in the museum's permanent collection are antiquities and works of Byzantine, Medieval and tribal art.\n\nIt is a must to see the art aspect of Houston .",
  "This is a knockout among museums, easily one of the top five out of the many I have visited all over the world.The early 20th Century modern art collection contains a huge number of works by Max Ernst, a sizable number of works by Man Ray and a few particularly unusual and outstanding pieces by Picasso.The African art collection is hands down the best I have ever seen.Generally, the exhibits here are like nothing you ever see in any other museum and seem to have been well chosen for their accessibility, appeal and educational value.The staff, including the guards, are very friendly and admission is free.",
  "Good size museum and free! The outside area is nice so it’s perfect for a beautiful day. They have a wide range of art and you could spend 20 mins there or 2 hours!",
  "Great place, but not open last I visited.  Major remodeling work going on.  Can’t wait to see how it comes out.",
  "The Menil is free to the public and has free parking, so it is definitely worth checking out. That being said, it houses a wide, odd assortment of 'art', including unsettling depictions of the human form. I visited with my husband and our youngest child, and I decided to steer our 5 yr old away from the photography and toward the more traditional pieces.",
  "This is a small museum and everything is top quality.  It's free and they absolutely are vigilant about stopping you from taking photos--there is a guard in every single room and their main activity is catching folks who want to take photos!\n\nIt's amazing to think that the place is free but they pay about 40 room monitors.   \n\nNonetheless, the exhibits--especially the african art--are top quality.   If you are interested in basketweaving skills, you won't find a better selection than this place.   It isn't baskets, it's the hair and other features on the African displays that use this craft.",
  "This was a great visit. There was a wide variety of modern art. The collection of ancient artifacts was very well- curated.  We were only able to visit the main building, but will visit the others on our next visit into the city. "
 ]
},{
 "name": "The Music Box Theater",
 "address": "2623 Colquitt St Parking available in the parking garage across the street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/10/48/ef/20170728-213923-largejpg.jpg",
 "tags": [
  "unique",
  "drink",
  "walk",
  "experience"
 ],
 "website": "http://themusicboxtheater.com",
 "source": "TripAdvisor",
 "reviews": [
  "This little theatre and its performers are fantastic.  I have never seen a show that I did not like.  Of course, I've had my favorites, which are usually the Year in Review, the Beatles/Christmas show and Feelin' Groovy shows.  The Broadway shows are typically not my favorite as I don't really enjoy that kind of music but even with that show, I knew all the songs because they make sure to do stuff that people know.  I would highly recommend a visit to the Music Box.  It is well worth the money and the performers get to know you and make you feel like a part of their Music Box Family.  My friends and I attend every performance which changes every couple of months.  It is always something we look forward to and will continue to visit every time there is a new show.",
  "I had the pleasure of viewing \"Songs From The Silver Screen\" this evening and thoroughly enjoyed myself. Hailing from the U.K. (and being an entertainer myself), I am somewhat of a critic when it comes to live performance. This venue, the band, and the theater group are exceptional - with a capital 'E'. Having happened upon this lovely establishment that is absolutely bursting with phenomenal talent (think London West End quality), I will most certainly return and highly recommend The Music Box Theater!",
  "You must go to a performance at The Music Box Theater. A great and talented group of singers and actors that are so entertaining. If you live in Houston or happen to be visiting put it on the list of things you must do!! Charming and intimate theater. They will have you singing along!!",
  "We were planning a visit to Houston for vacation and decided to look for a reasonably priced evening of entertainment. This locale met all criteria. Good price for the level of entertainment, friendly people, a wide selection of restaurants within a block (we chose the Sushi King, which was excellent and had happy hour till 6:30!). Parking is a bit tight, but get there early for dinner and there's no problem. Seating is also a bit tight, but it's nice to have a table for drinks and dessert. Band was excellent, song choice was unique and the entertainers were very talented. Looking forward to our next Houston visit to see what this group is offering!",
  "The Music Box Theater is a Houston treasure. It is great musical entertainment for couples and groups. They have several enjoyable shows during the year.The staff is kind, considerate and welcoming. The performers are accessible and friendly.  If you visit once you will come back again. Go early to get the best general seating and a good parking spot.",
  "I can't praise this place enough.  The Music Box is a small venue, and wherever you sit, you are close enough to feel that the show is being put on just for you.  When you walk in, one of the performers may even serve your drink, and another may show you to your table/seat.  They are funny, with incredible voices - all of them - and I LOVE the band leader, Glen Sharp (a/k/a G Sharp).  He adds so much to the atmosphere with his great keyboard playing and infectious personality.  This place is a must for anyone visiting Houston.  Get there early and have dinner at one of the restaurants surrounding the place.  My current favourite is Crave Sushi.  And the Dessert Gallery.",
  "I had a great time at Music box Theater on Friday, March 6.\nAs usual, great music and fun.  Music and laughter therapy.  Does not get any better.",
  "The talented founders of the Music Box Theatre provide an exceptional place to enjoy both their comedic and vocal prowess. Intimate cabaret seating and a full bar enhance the total experience.",
  "Five very talented singers performing Broadway songs. Their 7 minute review of West Side Story is hilarious. All songs are accompanied by a skilled group of musicians.",
  "It's a shame.  Good customer service, good vocal talent, but the show was bad, mostly because the humor was really bad.  Having one performer sing beautifully while the rest of the company does intentionally cheesy gestures as backup singers was annoying, not humorous.",
  "We have come to Houston a number of times on weekend getaways. This is our choice when the theater is not dark. We have enjoyed every show! Great entertainment! Dedicated vocalists, musicians, and staff! Get your tickets, you won’t be disappointed! If you live in Houston or nearby, you are missing out if you haven’t been there yet! 🎭❤️🎭"
 ]
},{
 "name": "Buffalo Bayou Park",
 "address": "18-3600 Allen Parkway and Memorial Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/a8/75/3b/all-time-favorite-park.jpg",
 "tags": [
  "drink",
  "walk",
  "history"
 ],
 "website": "http://www.buffalobayou.org/parks.html",
 "source": "TripAdvisor",
 "reviews": [
  "Here you can relax and enjoy the fresh air, from bringing that book you are reading with you, as well as coming to talk to someone in a relaxed and healthy way.  everything around you is conducive to clear your mind and enjoy a moment of this wonderful open space of gardens and others",
  "We went to the park to enjoy a pretty day, get fresh air, get some exercise.  We were pleasantly surprised!  It was fun to see the tall buildings close by yet be away from the hustle and bustle.  We felt safe and enjoyed our time there.  We ended up walking about five miles through and around the park.",
  "This was a nice little stop along our trip to get a view of part of the skyline. We took a stroll around the park, and there were numerous runners about. ",
  "Took the time to go see this park. It has so much to offer.\nWe did the water building first which was an eye opener.\nAfter spending time underground listening to the history of the water of Houston we then started on our walk of the park. We first went on top of water building then took the track south of the riverside. So much to see and photograph. After 3 hours or so we had only gone half way. So we still need to do the rest.\nThe negative was no access to a drink or bite to eat at the location. Has so much to offer for both the locals and tourists.",
  "Allow a few hours to really enjoy this beautiful waterside walkway. The view are lovely, and it is refreshing to see so much green inside a city."
 ]
},{
 "name": "Houston Museum District",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/ac/64/54/mfa-facade.jpg",
 "tags": [
  "kids",
  "walk",
  "history",
  "free",
  "history",
  "free",
  "walk",
  "wander",
  "learn"
 ],
 "website": "http://houstonmuseumdistrict.org/",
 "source": "TripAdvisor",
 "reviews": [
  "What exactly is the houston museum district? Museums included are.  Buffalo soldiers, children's museum of Houston, contemporary arts museum, Czech center museum, diverse works, the health museum, holocaust museum, Houston museum for contemporary craft, Houston photography, Houston museum of natural history, zoo, weather museum, Jung center, lawnsale art center, menial collection, museum of African American culture, the museum of fine arts, rice university and the Rothko chapel......this could take days to see them all.  If u have kids go to the zoo, if you want to meditate go to Rothko chapel, rice is great and there is a Turrell skyspace  that is super cool. Parking is difficult at rice so walk from museum, or it is close to zoo, just cross main street. Something for everyone in the district.  cHeCK out CITYPASs to see museums u can see5 attractions and save 47 percent $$.  Buy on line. Google ...Houston CITYPASs for info. Wear comfy shoes and bring a water bottle, enjoy!",
  "Many places in Museum district have free entry. Even the Museum of Fine Arts is free on a Thursday.\nEasily accessible via the Metro train, you can ride this for only $1.25 and you can pay by change or credit/debit card.\nLook out for a tourist leaflet dedicated to the Museum district.\nDefinitely worth a visit when you're in Houston.",
  "If you like science, art or history, this is the area for you! Plan on spending a day visiting the wonderful museums in Houston's Museum District. My favorite since I was a little girl has always been the Museum of Natural History. The Museum of Fine Art is equally as wonderful. If you have children, visiting the Children's Museum is a must!",
  "We had a pleasant day, and we recommend arranging your visit so you stay in an area that is on the red line tram, $1.25 per ride. Very convenient and stress free way to get to the museum district. ",
  "I come to this area quite regualry to walk and enjoy the museums. Right now there is a lot of road work and a new wing to the fine art museum going up so it is a bit noisy with all the construction but it is still a lovely place to visit.",
  "No matter what type of art you’re drawn to, you’ll enjoy wandering the museum district. Such a variety: fine arts, a children’s museum, the Holocaust, science, contemporary arts, the Menil and so much more. Some are relatively close to each other, others are a short drive away. Take the time to visit the area and expose yourself to our wonderful museums. ",
  "What a great place to wander, learn, and explore.  Google this area and determine which museums and/or parks you'd like to visit.....there's something here for everyone!",
  "This area can easily take several days to explore.  Houston has many great places all over the city, but this area is a true world class gem.  Get there early and park by the zoo and start exploring and see whatever draws your interests.  "
 ]
},{
 "name": "Saint Arnold Brewing Company",
 "address": "2000 Lyons Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/45/85/ec/saint-arnold-brewing.jpg",
 "tags": [
  "food",
  "food",
  "food",
  "drink",
  "kids",
  "free",
  "food",
  "food",
  "affordable",
  "experience",
  "delicious",
  "drink"
 ],
 "website": "http://www.saintarnold.com/index.html",
 "source": "TripAdvisor",
 "reviews": [
  "Packed and fun on weekends - bring food and games.  Quieter on weekdays.  Rootbeer for the non-drinkers.",
  "Make sure to get there early as a ling starts to form before the doors even open. You can bring your own food but there are food trucks outside for you to get food. The brewery also sells some food. You can also have pizza delivered but all in all its a great place to spend a few ours enjoying some good beer.",
  "We joined a group of our friends at St. Arnold's for a few hours of great craft beer and games last Saturday.  We have been there a number of times but this is the 1st review that I've written.  \n\nThis is a relaxed AIR CONDITIONED venue where you can visit with friends, drink great beer (free root beer), eat snacks, play games, then this is the place for you.  You can bring your kids, food, and games.  There is no cover.  You pay for the beer that you order in 2 oz, 4 oz, 8 oz, or a pint.  You can also order a flight.  One great thing is that they will give you a sample taste if you are unsure of a beer that you want.  They also have 3 tours (they are free) on Saturdays starting at noon.  You'll need to wear closed toe shoes if you want to go on the tour.  \n\nBy the way, they have an elevator.  Ample free parking.\n\nI had one of the seasonal beers (Spring Bock) and Amber Ale.  Loved them.\n\nSince the weather is getting warmer, this is a great venue for sipping a cold one on a Saturday afternoon.",
  "In this period of “stay at home” they offer just food to go.They are super organized.After you ordered online ,there is a guy who tells to the kitchen that you are there.after few minutes another one brings you your order.It is like a drive trough but nicer...They have special menu and are really convenient.",
  "Visiting friends in Huffman and we decided to trek an hour south to the brewery for lunch.  Shrimp n grits was over the top delicious, Texas size portion!  One of our group ordered a pizza, again delicious.  My wife and I had the crawfish roll, amazing flavor, fresh brioche roll, highly recommended.  Now for the beer, I had a coffee stout and a couple of the orange beers, wife had a cider, had to sample the root beer all delicious, wish an Uber ride was an affordable option to and from I would have enjoyed trying more of the beer.  Great atmosphere good service, excellent food an beer.  Meals & Beer about $150 with tip.  A very memorable experience.",
  "First time visiting.  Got there a little before noon on a Saturday.  It was already busy.  Planned on taking the 1pm tour which we did and recommend.  While waiting we ordered a appetizer and a pizza.  Both were well worth it.  Plan on visiting again for sure!",
  "Even if you don't drink a lot of beer the facility is amazing and the tour is very good. You must be 21+ to do the tour and you need to pre-register but it is really worth it,",
  "Our first time in the new biergarten did not disappoint. The beer, as always, was excellent. This new space is light and airy outside, lots of places to sit. BUT, we won't share space with vape and it was chilly, so we welcomed the ability to dine inside. The art was fun to study and we enjoyed the menu. Bro in law says the CFS was great, sister liked her club. I was all about the brat with sauerkraut and brown mustard and hubs had a crawfish roll. I wasn't especially fond of their entry into the world of Fried Green Tomatoes, but hey, each to his own. We'll be back!"
 ]
},{
 "name": "Lone Star Flight Museum",
 "address": "11551 Aerospace Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/97/90/ae/republic-p-47-thunderbolt.jpg",
 "tags": [
  "interactive",
  "history",
  "free",
  "interactive",
  "kids",
  "learn",
  "free",
  "educational",
  "kids",
  "history",
  "interactive",
  "affordable",
  "experience",
  "learn",
  "kids",
  "history",
  "experience",
  "free",
  "history"
 ],
 "website": "http://www.lonestarflight.org/",
 "source": "TripAdvisor",
 "reviews": [
  "As a huge fan of flight, airplanes, and history, I was completely enthralled by the assortment of planes and their history on display at the Flight Museum.  The B52 bomber was fascinating to see up close.  Loved the Continental Airlines plane, the various fighter jets and planes, as well as being able to read the history and accomplishments.  There was an excellent display of Texas' part in aviation history.   There was also an interactive display.  Thoroughly enjoyed my visit there.",
  "We took advantage of the Smithsonial Free Museum Day tickets where you can get free admission for 2 to many museums around the country. I took my 14 year old grandson, I figured he might have an interest and wanted him to know that air battles just don't happen in all those video games he plays! \n\nWe got there about 10:30 and  stayed for 3 hours. The displays are fantastic, so many old planes and jets restored as they were when they were brand new. The panels with photographs and stories were very interesting and they also have several interactive displays that kids can do to learn about the effects of wind and the physics of flight while having fun. \n\nAt one point we watched them wheel out the big bomber and it took off with guests who had purchased tickets for a flight around the Ellington Field area.  My grandson got to try flying in the flight simulators which was really fun, sadly he found out it isn't as easy as a video game and crash landed!",
  "Wow! What a nice experience. I consider this to be a must see when visiting the greater Houston area. For those that live here, you need to come. I arrived planning to stay for about an hour and a half tops. I wound up staying 3 1/2 hours on last Saturday afternoon. \n\nParking is easy with its own dedicated and free lot in front of the beautiful exterior of this museum. Walking into the large foyer is the admission desk with the nice gift shop on one side and a Mooney airplane in its own glass enclosed room on the other. At the admission desk check in was easy. Buy your tickets online and save $2 off of each ticket. My adult ticket online was $12.95. Seniors and kids are less. Beside the admission desk is a large room with several paintings of aviation milestones that I found interesting. \n\nFrom there you can enter into either of the two medium sized air conditioned hangars to view the aircraft on display. The aircraft in both hangars are in pristine condition and many of them are also flyable. You can identify the flyable propeller driven aircraft by the oil drip pans on the floor beneath the engines. While I was there, one of the aircraft was out of the hangar being flown that day. You could even go outside and observe it on the ramp as it departed and returned. Planes of special interest to me where a B-17, B-25, Beechcraft Staggerwing, DC-3, P-47, F-4, SBD, F6F, TA-4, A-1 and a TBM. If those designations don't mean anything to you don't worry as you will still enjoying viewing them.  I was impressed with the appearance of all of their aircraft. Also in each hangar are wallboards on the hangar sides to read about many interesting facts about aviation and in particular WW II. You can also go up to the second floor and overlook one of the hangars to give a different perspective.\n\nAfter leaving the hangars I found other rooms in the museum that have fun filled scientific hands on demonstrations of aviation principles that both kids and adults will learn from. They even have a section that teaches you how to make paper airplanes (they provide the paper) and then you can go up to the second floor overlook of the foyer and test fly them. Other rooms have interesting floor to ceiling wallboards showing facts about aviation history and in particular the contribution that Texas has made and still is making. \n\nOn weekends only, they open up a room off of the foyer that has flight simulators for you to practice your flying skills. The simulators have two seats in each one for the pilot (you) and an observer (guest). On Saturdays each 10-15 minute flight is $5 and on Sundays it's FREE. During the week the simulators are not open to the public and only used for the numerous school visits that occur during the year. I enjoyed my flight time and managed several takeoffs and landings without any mishaps. I recommend doing this even if you have to pay the $5 like I did.\n\nFinally, the gift shop is nice and large enough to provide all of your souvenir needs. I have to give 5 stars to this museum. It's very affordable, appeals to all age groups, educational, interactive and it's brand spanking new.",
  "A well presented museum offering a great insight in the origins of the ariport and flight in the USA. Wonderful to see so many different warbirds flying and offering rides. Get close up and personal to a B-17, B-25 or a ME262. The only disappointment was the lack of a cafe, just a vending machine. We would have gladly spent some dollars on a lunch.",
  "While some museums are static examples of aircraft, the coolest part about this museum is most of the planes either do fly or are capable of flying. If you always wanted to fly in a bi-plane...you can sign up for a ride in the one you’re looking at. I’ve gone for several rides in old warbirds throughout the country as a member of the CAF and this place offers similar amazing experiences. You are literally able to view and fly history. The location is great too since NASA has its training aircraft housed nearby. I would recommend this museum for all ages. We’ve seen kids loving life walking around the planes, senior citizens reminiscing, folks bringing their parents in to have them show which planes they helped build during WWII, and people like myself who just love the history and beauty of the exhibits. If you’re from out of town or a local, stop by...it’s a great experience!",
  "Had last visited the Lone Star Flight Museum when it was still based in Galveston and it has fairly recently moved to Ellington to be more protected from hurricane damage. Their collection of flying warbirds is impressive and should not be missed if you are anywhere around Houston. The new premises are well laid out and you can still be up and close to these beautifully maintained aircraft. Noticed that the museum does a lot of STEM work with the local schools which keeps the love of aviation alive! ",
  "The museum has free  parking. When I visited, admission was paid in the gift shop. There are several aircraft on exhibit. There is a good history of aviation in general and Texas aviation in particular. There is also a \"hall of fame\" of Texas aviators which has some recognizable and surprising members. There are conference rooms within the facility for special events.",
  "You need to check on which Mondays as it is not every Monday.  Great displace of planes in 2 hangars.  Check it out."
 ]
},{
 "name": "Rice University Campus",
 "address": "6100 Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/b3/24/d1/rice-university-campus.jpg",
 "tags": [
  "walk",
  "tranquil",
  "walk"
 ],
 "website": "http://students.rice.edu/students/Campus_Attractions.asp",
 "source": "TripAdvisor",
 "reviews": [
  "Directed a workshop on campus.  Having been doing this for 10 years.  I definitely recommend the school for quality of faculty and curriculum. While there check out the cute French café!",
  "We had a tour of the campus. The architecture is beautiful and there are a lot of open spaces. Lots of people take wedding photos here. ",
  "I walk through here quite often to get to MD Anderson.  It is a beautiful campus.  There are nice walking and running trails throughout the area.",
  "We parked up near the sports stadium and did a short walk of this amazingly structured and beautiful campus before catching an Owls game.  There is an interesting light exhibit to see at dusk where you can sit and watch the sky under a changing colour light canopy.  Impressive to see new buildings going up replicating the original style I'd imagine at some great expense but keeping a coherence to this very tranquil spot in the center of Houston",
  "Beautiful campus in nice area of Houston.  Really nice southern Oak trees on the streets around the campus."
 ]
},{
 "name": "Houston Arboretum & Nature Center",
 "address": "4501 Woodway Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/da/54/a9/meadow-pond.jpg",
 "tags": [
  "walk",
  "walk",
  "learn",
  "walk",
  "learn",
  "free",
  "walk",
  "jog"
 ],
 "website": "http://houstonarboretum.org/",
 "source": "TripAdvisor",
 "reviews": [
  "To escape Houston's crazy traffic and noise is a must do if you want to keep your sanity.  This nature park just inside the 610 loop, not far from the Galleria and feels a world away from everything surrounding it.  If you want a relaxing walk in the woods, then this is your place.  ",
  "Whether you’re with your best friend, children, or solo, you can walk at your own pace and enjoy the natural habitat, even learn about the flora and fauna. You can make it a short visit or easily spend a few hours. Please don’t mind paying $1/hr. for this self-sustaining natural delight.",
  "This green space near the Memorial Park offering nature walking trails in various habitats and ends at the Buffalo Bayou",
  "This was a nice area to walk and enjoy outside nature.  The nature center was not open, so we can't comment on that.  The area was quite and we saw a row of turtles sunning themselves on a log.",
  "I attended a class for children & parents (grandparents) to learn how to fish with a pole and 'bobber'. It was so much fun for my grandson and me to share this activity. He even caught a fish.",
  "We spent 90 minutes walking the outer loop trail, including a detour to the bayou overlook.  This is a popular place on a sunny Saturday in February, the 610 parking was filled, but there were plenty of spaces at the Woodway parking lot.  The restroom is in the nature center building, which is adjacent to both parking lots.  This is not a botanical garden, just a forest with meadows, there are interpretive exhibits here and there and we caught wildflowers in bloom.  Dogs are welcome on a leash and you will see many.  Visiting is free but there is a small charge for parking.  Highly recommended.",
  "Nice place to escape from the city. Several trails to walk or jog. Lots of nature,  lots of wildlife, but ultimately not an attraction or zoo. So if you enjoy hiking and bird watching, it's a nice place to go. ",
  "We wanted a bit of nature on our trip to Houston and this place fit the bill perfectly.  There is a lot of construction going on there currently and it had rained, so things were a bit muddy but still it was absolutely beautiful. We went to the nature center and met with a wonderful woman (did not catch her name) who went over the map of trails with us and let us know which trails would be best for our family's needs.  We went on a mixture of 6 different trails.  We got so many beautiful pictures and we saw tons of turtles.  We were advised to seek out the Owl bridge, it was pretty cool but we couldn't get a good pic of us with it in the background.  Great visit, small slice of heaven in middle of a bustling city."
 ]
},{
 "name": "Houston Graffiti Building",
 "address": "1503 Chartres St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/16/b4/54/20190408-085254-largejpg.jpg",
 "tags": [
  "family"
 ],
 "website": "",
 "source": "TripAdvisor",
 "reviews": [
  "My family and I really enjoyed the art at Graffiti Park.  We just wished there was an online map or signs to show where they were all located. You have to drive around and search, and we may have even missed some.  But we had a great time viewing the amazing talent!",
  "it's so vibrant and pretty. the paintings wrap around the building and it was fun to look at and take pictures with my boyfriend.",
  "Just blocks from the convention center. Worth a stroll in the daytime. Cross under a freeway with some homeless nearby or drive to the site. Some other buildings nearby have similar murals but this is the best display. Nearby area is mix of industrial and vacant.",
  "Walk around and see beautiful detailed walls. People always on sight, a lot of people doing photo shoots.",
  "Interesting neighborhood with outdoor art gallery. Worth to visit and stop to take some good pictures. I enjoy it a lot."
 ]
},{
 "name": "Smither Park",
 "address": "2402 Munger St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/78/78/cf/lindley-fish-amphitheater.jpg",
 "tags": [
  "family",
  "experience",
  "unique"
 ],
 "website": "http://orangeshow.org/smitherpark/",
 "source": "TripAdvisor",
 "reviews": [
  "This is a hidden gem you don't want to  miss!  Incredible detail and talented creativity! My family had a lot of fun here.  Look close, look inside, under, and all around!  Fabulous experience!  We were amazed that the checkers on the checkerboard were removable, and they were all there! Respect! You can take a little or a lot of time here, but you don't want to miss it.  We stayed about an hour.  Great photography opportunities!",
  "Simply put Smither Park is a beautiful art park comprised of “junk.”  Imagine broken bottles, old dishes, hub caps and road signs assembled into sculptures, statues and mosaics. The park is not very large but is continuing to be added to.",
  "If you're going to be in the area, visit this park. The mosaic exhibits are fascinating.\n\nThe neighborhood feels a little scary, but we went on a weekday. It's probably more populated on the weekends. ",
  "What an inspiring little art park right next to The Orange Show. Fantastic mosaics on a wall along one side of the park, mosaic walkways and tables with many works in progress. Fun little stroll, plenty of street parking, picnic tables, and benches if you want to stay a while. ",
  "The park has plenty to keep people of all ages entertained for quite a long time. Broken tile art in the most unique designs will make you smile! Sit and have a picnic, swing in some large seats or play I Spy. Some projects are in the process of being completed. This is a must see! "
 ]
},{
 "name": "Memorial City Mall",
 "address": "303 Memorial City",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/44/34/65/memorial-city-mall.jpg",
 "tags": [
  "food",
  "walk",
  "walk"
 ],
 "website": "http://www.memorialcitymall.com",
 "source": "TripAdvisor",
 "reviews": [
  "This is a large indoor mall anchored by Macy’s, Dillard’s, Target and Sear’s, with the usual array of smaller stores throughout. Large variety of food court eateries, a popular Starbucks and lots of kiosks with the typical offerings. One thing I greatly appreciate about this mall is that it’s open early in the morning for walkers to use as an exercise track. It’s air conditioned, the music’s on and it’s perfect for those rainy or hot days when you don’t want to be outside. And if you walk before the stores open at 10, you beat the crowds and have plenty of easy parking. Thank you to the mall management for making this available. ",
  "The hotel is wonderful and the service is outstanding! The coffee trips to the Starbucks inside was superb! Elois, Esai, Martha and Gab were very pleasant and you are always guaranteed a smile! Everyone behind the counter was very helpful.",
  "We absolutely LOVE this mall! GREAT stores and restaurants. It's a wonderful atmosphere with a huge fireplace and comfortable chairs located right by the ice rink.\n",
  "It is a hard mall to get to due to being located right off of the Katy freeway and traffic at the intersections trying to get to it. Parking is almost impossible to find so expect to walk a ways if you are lucky to find a spot. Houston doesn't have many indoor malls so it seems to be busy all the time. The stores are standard chain stores with the exception of a few such as the American Girl store.",
  "Walked through the mall and enjoyed the many store fronts. The escalator took us up to the second level but the down escalator was not functioning. The mall is linked to the sky bridge to the Westin hotel and a Hospital. They had a very nice children's playground and an ice skating rink. "
 ]
},{
 "name": "Holocaust Museum Houston",
 "address": "5401 Caroline St Lester And Sue Smith Campus",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/7c/09/0b/holocaust-museum-houston.jpg",
 "tags": [
  "history",
  "kids",
  "free",
  "history",
  "history",
  "experience",
  "energy",
  "learn"
 ],
 "website": "http://hmh.org",
 "source": "TripAdvisor",
 "reviews": [
  "I highly recommend everyone visit this museum especially if you have children in school.  Very Informative of what happened during the Holocaust.  They have a rail car that was like the one used to transport Jews. There is  also a boat that was like one used to hide Jews in to escape.  You can take a tour. The tour we took was led by a person that escaped the Holocaust, so he had first  hand knowledge of what it was like.",
  "The exhibits were outstanding!  We’ve been to several holocaust museums in the U.S. and in Europe, and this was one of the best.  Very few mementoes of the camps but the photos were spell-binding.  Photographic history from early Jewish community life to Hitler’s rise to liberation of camps to life as a displaced person (DP).  Also a 35-minute oral history film of survivors.  In Houston’s museum district.  We planned about an hour visit but ended up spending over 2 hours.",
  "I spent several hours at the Houston Holocaust Museum located on Caroline Street. The displays, pictures and stories located throughout this museum remind us of how we should not be towards other human beings. You find yourself asking, “How could we let things get so far out of hand?” \n\nThe museum is well designed and it forces one to think and to ponder. You can take a walking tour by yourself or be with a group with a guide.  No pictures allowed within the museum, but I will tell you, what you will see and read you will not forget.\n\nVery well done.  The museum is dedicated to educating people about the Holocaust, remembering six million Jews (men, women, children) and other innocent victims and honoring the survivors’ legacy.\n\nDr. Marc, PS 63:7",
  "Great for kids who are interested to know more about it. I, too, learned a lot from this place. I just wish they have more up to all floors.",
  "The museum has its own parking lot. If you only visit for 1/2 hour or less it is free. Over the half hour and up to 4 hours costs $8. It goes up from there. Four hours should be plenty of time to visit the museum. After you pay your admission, the short orientation film is recommended. It recycles every 20 minutes and there is a countdown clock outside the theater. The museum has guided tours and audio tours available. It is a detailed history of the Nazi holocaust in Europe, There are several recorded interviews of local residents who were survivors of the holocaust. It is something that everyone should be reminded of, lest we allow it to happen again. There is a gift shop.",
  "Just walking into the museum and passing by the reconstruction of one of the chimneys from the ovens where so many people's bodies were put to death, put me in a somber mood.  To see the mementos and read the stories of the people that lived (and died) through this dark part of history, is to grasp in a small way the pain and suffering they went through.  When I read or hear about someone saying that the Holocaust did not happen, I weep, for I have been to this museum and believe what I saw.",
  "I haven't been to any of the Holocaust Museums around the country so this was my first experience. Beginning in the beautiful theater room and hearing their voices and stories was an excellent introduction. Of course the entire museum is a moving and powerful experience. They have made it personal and brought it to life. I was struck by the use of he railroad car as a bridge to another section. The size and time spent are about right for the gravity of the topic. Don't miss the area outside the main doors with the stone blocks beside the sidewalk.",
  "A thoughtful museum to learn about the events leading to the Holocaust as well as the horrors, and those who resisted and aided.  A lot to absorb. Video on 2nd floor was good if you have energy. Two hours was plenty for us.\n\nMuseum is well organized for visual and auditory learning. If you enjoy reading, I would skip the audio tour.  Food options very limited there.  Lucilles nearby is a good alternative."
 ]
},{
 "name": "Glenwood Cemetery",
 "address": "2525 Washington Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/86/09/2a/mourning-angel.jpg",
 "tags": [
  "walk",
  "family",
  "history",
  "history",
  "peaceful",
  "historic",
  "free",
  "history"
 ],
 "website": "http://www.glenwoodcemetery.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Glenwood Cemetery is a lovely place for a walk. Towering trees and immaculately kept landscaping make for beautiful surroundings. Many of Houston’s founding fathers are buried here. Howard Hughes is buried here along with celebrities who are buried here or own elaborate burial plots , some with amazing structures on them. Highly recommended for a refreshing walk during the cooler months.",
  "This is an old Houston cemetery with many beautiful grave markers, some magnificently landscaped family plots and many, many recognizable names from Houston history.\n   Howard Hughes is buried here in a fairly simple setting.  The small car paths wind through the beautiful grounds with old trees and elaborate markers.  Late Spring is when the landscaping is at it's peak with seasonal blooms.. Great stop for photography.",
  "Another place we bring friends from out of town. Always loved by all. Besides some of the famous Houstonians buried there like Howard Hughes, the cemetery itself is beautiful wit some of the most majestic oak trees anywhere and the magnificent memorials everywhere. A must go too!!",
  "We spent hours in this Cemetary looking for Howard Hughes grave and then with our cemetary list that we got from the office, we found many other gravesites that had interesting stories. Such beauty in this Cemetary!",
  "Beautiful cemetery and interesting history.  Didn't find Howard Hughes grave though!  The rolling hills and view of the downtown was lovely",
  "Lots of the big names are here. From Howard Hughes, to the famous mayors of Houston, to various founding people of our town.",
  "This is such a beautiful, peaceful, and historic cemetery. Many of Houstons rich and famous (Howard Hughs) are buried here. The grave markers and sculptures are amazing. Its close to downtown and the Heights. Great place for pictures!!",
  "I had some free time, so I thought it would be interesting to see where Howard Hughes was buried.  Google maps gave me the coordinates, but it wasn't clear how to get to it.  It turns out it is on the west side of Greenwood Cemetery, alongside the graves of many famous figures from Houston history.  Once you find the entrance (it's on the north side, make your war to the cemetery office, where you can get a map.  It took some time to find the Hughes' grave, which is surrounded by a steel bar fence.  Howard is buried alongside his parents."
 ]
},{
 "name": "Karbach Brewing",
 "address": "2032 Karbach St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/5d/46/d3/karbach-brewing.jpg",
 "tags": [
  "family",
  "delicious"
 ],
 "website": "http://www.karbachbrewing.com",
 "source": "TripAdvisor",
 "reviews": [
  "Ok so I will definitely be going back to Karbach every time we are in Houston. My husband had been before but this was my first time and it was awesome. The  Brussels sprouts were by far the best I’ve ever had. I ordered a flight of beer which was nice to be able to try a variety. For my meal I got the pizza and my husband got the shrimp.  We also had dessert. I had the pecan pic, amazing! My husband had the creme brûlée. ",
  "We dined inside on a Saturday afternoon. The beer flight, choice of five different beers brought out on a board, was an excellent choice because it was our first time trying their beers. The salad was very good and also the burger/fries/onion rings. The price was about 20% higher than a lot of places ($10 for a basic vegetarian salad and $15 for a burger) but location/environment have to also be taken into consideration. It was a good meal but next time I would like to try the Biergarten area around back.",
  "Service is awesome! Venue is great! Bands are amazing! Great day for a concert! Looking forward for next time!",
  "Dined with family.  Our bill was $87 for three of us.  Karbach burger ($14) was delicious.  Chili made with Crawford Bock Beer ($12) was awesome!  My son’s ribeye was expensive ($33) and had a lot of fat on it ... disappointing.  Hot, fresh pretzel ($8) was a great appetizer!  We had two beers, which our mixologist suggested - they were good choices.  Our server was Ashley - she was very attentive and friendly.  We will definitely go back again ... but won’t order the ribeye again.",
  "accept concert  was great on Oct 10... hope they got some great bands for next year\nFoamhenge 2019 well done... Next day flew to Bangladesh, what a great  1. 2 punch\nBangladesh mohilas and accept\n"
 ]
},{
 "name": "Downtown Aquarium",
 "address": "410 Bagby St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/66/30/c5/photo0jpg.jpg",
 "tags": [
  "food",
  "delicious",
  "family",
  "food",
  "kids",
  "food",
  "family",
  "experience",
  "kids",
  "walk"
 ],
 "website": "http://www.aquariumrestaurants.com/downtownaquariumhouston/default.asp",
 "source": "TripAdvisor",
 "reviews": [
  "My husband, grandson, his friend, and I had a wonderful time at the Downtown Aquarium in Houston. We each used our own all day pass which allowed my teenaged grandson and his friend to visit their favorite attractions, while my husband and I rode the train, Ferris wheel, played games and toured the building aquariums. We all met to eat at the restaurant that serves delicious food and had such an awesome wall-to-wall aquarium that totally mesmerized us while we ate and took pictures. We definitely want to do this again in the near future.",
  "I brought my family here and we enjoyed the day. You can eat, see the nice aquarium, and your children can ride the rides they have spread out across the property right on the edge of downtown Houton.",
  "Came here today in the evening for a dinner. The kids wanted something different. We came to the Aquriam, they charge for parking g they also offer a valet service. The restaurant is upstairs no charge for entrance. They have a bar and a great seating area to eat, they also offer things to do u can buy a all day pass to access all mini adventures like train ride Thursday shark tank, white tiger area, sting ray area, Houston sized ferris wheel and rides thru out the location. They also have a mini water splash pad. Kids and adults can get wet, bring extra clothes, overall I enjoyed my visit relaxing in the heart of Houston downtown area it can get pricey since I have 3 kids, be prepared to spend couple hundred with food and adventures . Otherwise don't go! ",
  "I was a little hesitant at first about visiting after reading reviews about how small it was a how quick you could finish everything. \n\nFirst of all, it is small. My husband, son (age 2) and I went and paid $60 to get in because we bought the All Day Passes. Price was a little high but my son enjoyed himself! The Aquarium exhibit is a little small but my son loved seeing the big fish & alligators. The facility & tanks were clean.  The fish were beautiful & look well taken care of. It was crowded but manageable & we were able to wait our turn to get a closer look of tanks. We did go on a Saturday at noon so the crowd was expected. The variety of animals they had were great for my toddler. \n\nMy son was able to see the White Tigers at the end and got crazy excited. I did feel guilty knowing they had never been outside or seen sunlight. Their area & glass was clean and it wasn't crowded at all in that area so we got a lot of good pictures of just him & the tigers in the background. They had two White tigers out. \n\nOutside, we rode the train ride to the shark tank. There was a line but thank God the weather was great & was not too hot. It was a nice, short ride & great info. He did the Merry-Go-Round and did not want to get off! The ride is a little short. You go around about 4-5 times and that's it. Keep in mind it's not a big Merry-Go-Round so one cycle around is pretty fast. \n\nThe Stingray exhibit was pretty cool! It smells but once you get used to it you'll enjoy feeding & petting the them. They come up to you easily to get rubbed even without food. We didn't purchase food and they came up to us with no problems. We watched others feeding them. I say save your money on the food. They say to wash your hands before and after petting them but they only had sinks with no water so BRING SANITIZER or be prepared to wash your hands in the nearby restrooms right after.\n\nOverall, it was a great experience & day for my family and I. My son is 2 years old and had a blast but would recommend the zoo for children 6-7 years old or older. There's more to do & see there. It would also be worth your money. If you do the Aquarium, I would strongly recommend the All Day Pass and do a lot of activities and rides more than once to get some of your money worth. Everything is included with the All Day Pass. It would cost more to pay for each ride individually. \n",
  "The parking is limited and the area is VERY small...food & service is great. The Aquariums are really neat....Best time to plan for a visit would be Mon-Thurs. the weekends can get VERY packed and as I stated before, it is a VERY small area...If you go during the summer hours, beware of the HEAT! everybody trying to stay indoors to beat the heat with limited space can become too much. Best bet would be the Kemah Aquariam, more moving about space.",
  "I'm a Landry's Select Member, so I'm already a fan of their restaurants, but this location is certainly a treat with all of the attractions, water and tigers, oh my! Get the day pass, take the tour and ride the rides. Fantastic! Oh and get the lettuce wrap appetizers, YUM!",
  "Is a small aquarium but with cool exhibits. You can touch and feed the stingrays. The have a beautiful white tiger.",
  "Looking at the prices compared to what you actually get for it, I definitely don’t think it’s worth it. We went because it was included in our CityPASS. What we saw was nice but this is a “for profit” aquarium. Most of them are in tanks too small for them. Their poor bengal tigers hardly have space to live comfortably. The inside area is a decent size but the outside is terribly small. I’m not sure why they have tigers at all as this is supposed to be an AQUARIUM. But also a gift shop, restaurant and carnival??? It’s just a very odd combination of things that don’t fit well together. You have to pay extra for everything as well, they need it to be a more inclusive price. ",
  "I would not waste my money coming to this aquarium. It is super small super fast from start to finish last about ten minutes . Have been to the one in Corpus and San Antonio this rates way at the bottom .  Waste of money and they really need to expand . The tanks are very small for the fish displayed even my two kids we had made comments how little space the fish had in the tanks . The Tiger which was not on  display. Very disappointed when asked if I could come back later to see it when it was I was told no since I didn’t purchase the wristband . So beware if you buy the city pass this does not include the only other exhibit worth seeing the sharks . You have to purchase separate ticket or upgrade . I think that is really ridiculous considering that the aquarium is so small then to see the sharks it’s extra . Why would you charge extra if that is part of the aquarium.  Not complaining and completely understand to charge more for the rides but not the shark exhibit. Might  be fun if you have kids five and under only . Other then that do not waste your time like we did .\n\nDisappointed ☹️",
  "This is the smallest aquarium I have ever seen. Cool exhibits, but where is the rest? They were doing construction, so I am hoping that they are planning to expand. The exhibits they did have were good, but the white tiger looked like he was sedated. I was wondering why the gift shop was near the beginning of the walk when I realized that was the end. The only thing after the gift shop is the stingwrays, which you can feed if you like. There is a restaurant if you want to dine there. I definitely would have been mad if we had paid to park.",
  "Nice, lots of fishes, just little be overpriced, extra fee for train to see the sharks, you can touch the stingrays. "
 ]
}]
