[
{
 "name": "Children's Museum of Indianapolis",
 "address": "3000 N Meridian St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/02/60/b8/the-welcome-center-at.jpg",
 "tags": [
  "food",
  "kids",
  "art",
  "family",
  "kids",
  "food",
  "walking",
  "creative",
  "free",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d103671-Reviews-Children_s_Museum_of_Indianapolis-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great time wonderful place to take your kids.Big and clean.Staff is always very nice & friendly as well as helpful.Many different exhibits with stuff to keep all ages interested.They sell food and drinks.",
  " It is the largest museum in the world! They have a new permanent exhibit called The Sports Legends Experience. It’s an indoor and outdoor area filled with sports. We played many sports like tennis, hockey, golf, baseball, basketball and more. It was a great experience for my kids to play all different sports.\n\nInside they had interactive areas where you could be a play by play announcer, do a newscast, see how sports and art connect, and different historical sports figures.\n\nTIP – Bring a backpack with some water bottles. It gets hot outside!\n\nThe Sports Legends Experience at The Children’s Museum of Indianapolis is open from 10am-8pm. You can pay for admission to the Children’s Museum and have access to the whole museum plus the Sports Legends Experience. Or you can go from 5pm-8pm to experience just the Sports Legends Experience. The cost is about half of the regular admission, and it’s a much cooler time of the day. \nThis ticket will get you:\n12 outdoor sports experiences\n3 indoor sports exhibits, including the National Art Museum of Sport\nIf you make plans to visit, the whole museum buy your tickets in advance online. The prices fluctuate, and you will pay more the closer you get to the date you want to visit.",
  "Taking our two grandsons (3 and 1) to the museum gave them a full day of activity and wonder. The museum is so well thought out that we'll plan to go multiple times ahead. Great care has been taken in areas of safety and education, hands-on activities and entertainment--even for the parents/grandparents. It's a must-see!",
  "My children range in age from 26-4months.  The entire family has a wonderful time at the Indianapolis Children's Museum.  It is best to go during the week if possible because it can get very crowded on opening day of an exhibit and on Saturday.  I have taken my parents along with the children.  They all enjoy the museum.  ",
  "Went with my 12 & 14 year olds, who have almost (but not quite) aged out of the children's museum genre. This one is a gem, though, and believe me, we've been to about a billion of them. Everybody learned a lot. Go early before the stroller brigade (if your kids are older). There's somebody for everybody. We really liked the China exhibit. I thought I'd hate the  Power of Children, but left crying. Really enjoyed the space exhibit, too. Cafe has decent selection of semi-healthy food including some allergy-free stuff. Terrific place to spend a couple hours.",
  "I have been there many times over the years and it keeps getting better and better all the time!\n\nPROS:\n1.  Website - They have a marvelous website (www.childrensmuseum.org) that answers almost any question you could have.  It even had information about road construction going on the might confuse your driving.\n2.  Parking - Parking couldn't be easier.  There is a FREE parking garage right across the street from the museum.  There is an elevated enclosed walkway that connects the garage with the museum--don't have to worry about walking in inclement weather.\n3.  Wonderful Employees and Volunteers - Everyone we met couldn't have been more helpful and friendly.\n4.  Exhibits - are creative and interesting.  The exhibits are displayed in a way that will interest ALL AGES (children and adults!).  It is definately a hands-on museum.  We had a 3 year old on this visit and he had a smile on his face the whole time.  For his age group, I recommend the PLAYSCAPE.  He would have stayed in there all day.  He also loved the Dinosphere, as did my 79 year old mother, the train in the All Aboard Exhibit and, of course, the musical carousel.  \n\nCONS:  The only complaint I have is over the prices of the food in the food court.  To be fair, they are not any higher than any other museum or zoo, and the variety offered is amazing!  \n\nCOMMENTS: Be aware that they have a temporary exhibit that opens in May that should be a must see!  The Children's Museum is the only place in the United States where you will be able to view China's Terra Cotta Warriors this year.  Don't miss it!",
  "What a great museum to visit. So much to see and for all ages both inside and outside. The grandkids had a BLAST. ",
  "We had tons of fun at the museum.  It was rather pricey, but worth every cent if you come early for a full day entertainment.  My son particularly enjoyed the dinosphere!",
  "Fantastic fun and lots to do with the littles. The spaces are well planned and kid friendly. You can pack your own snacks and lunch for a price friendly visit.",
  "The perfect museum for children!\nDon't hesitate to become members, if you stay in Indianapolis for more than a few days.\nWe had a great time, it wasn't crowded, it was friendly, super interesting and respects the children that come to visit, but also their parents.\nIt looks like the museum had everything in mind.\nWe will come back really soon, since 1 visit is not enough.\n",
  "Taking 3 little people all the things to see and the interactive adventures for kids are amazing.   From the moment that we arrived, our children were intrigued and had a blast."
 ]
},{
 "name": "Indianapolis Motor Speedway Museum",
 "address": "4750 W 16th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/2c/45/8b/the-indianapolis-motor.jpg",
 "tags": [
  "tour",
  "history",
  "theatre",
  "historic",
  "tour",
  "history",
  "knowledgeable",
  "history",
  "walk",
  "food",
  "unique",
  "tour",
  "history",
  "historic",
  "kids",
  "family",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d103672-Reviews-Indianapolis_Motor_Speedway_Museum-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have visited the Indianapolis Motor Speedway only once before. I had a seat on the fourth turn, looking down the front stretch to the finish line, and saw Jimmy Clark win the Indianapolis 500 in 1965. The race was significant because it was run without a single accident, not a single yellow flag, only checkered. What amazed me most of all was how swiftly and efficiently all 250,000 spectators were moved in and out of the giant track. I didn't have an opportunity to visit the museum on that occasion. But I made a point of touring the facility on our recent visit to Indianapolis. Located within the famed 2.5-mile Indianapolis Motor Speedway oval in suburban Speedway, Indiana, the 37,000-square-foot museum houses one of the world's premier collections of automotive and motor racing vehicles and artifacts. It is linked to the Indianapolis 500 and the Brickyard 400 but also includes exhibits reflecting other forms of motorsports, passenger cars and general automotive history. It also is home to the Indianapolis Motor Speedway Hall of Fame. The original museum was established in 1956. This museum opened in 1976. It features 30 Indianapolis 500 winning cars, pace cars, the Borg-Warner Trophy and other trophies and plaques, racing paraphernalia such as helmets, gloves and driver's suits, model cars, photographs, toys and paintings. Displays include highlights of the history of the Speedway's ownership, evolution of the track and other memorabilia. Take a bus tour of the track, a lap around the oval and do what the Indianapolis 500 winners do, kiss the 1909-vintage paving bricks at the finish line. Stroll through Gasoline Alley. Also see a short film of the history of the Indianapolis 500 in the Tony Hulman Theatre. See the 1911 Marmon Wasp, the first Indianapolis 500 winner driven by Ray Harroun, all four of A.J. Foyt's winning cars, the 1965 Spirit of America that set a world land speed record, the 1931 Cummins Diesel driven by Dave Evans, the first car to complete the Indianapolis 500 without a pit stop, the 1977 Bryant Heating & Cooling Lightning/Offy driven by Janet Guthrie, the first female to qualify for the 500 and the 1965 Le Mans winning Ferrari 250 LM. Also see the picture wall featuring the drivers and cars of all Indianapolis 500 winners. Finally, visit the Auto Racing Hall of Fame, which dates to 1952 and highlights 155 inductees from Ray Harroun to Barney Oldfield to Eddie Rickenbacker to Mauri Rose to Fireball Roberts to A.J. Foyt to Mario Andretti to Al and Bobby Unser to Parnelli Jones to Roger Penske. The Indianapolis Motor Speedway was added to the National Register of Historic Places in 1975 and designated a National Historic Landmark in 1987.",
  "Went on a beautiful day, Did the 30.00 Pp VIP tour, Tour of the race track with a stop off at the BRICK YARD finish line where we took pictures, Went to the press boxes and winners circle, Then to gasoline ally, The tour lasted about 1 1/2 hours, The price includes the museum which was full of Indy race history including many of the winning cars past and present, Well\n worth the money and time, Tour guilds were great friendly and knowledgeable",
  "I've been to the track (as we call it in Indy) several times over the years. Started back in the party days of the old snake pit. Back then anything goes for a party nearly a month long. Historically one of the biggest Racing spectacles of the world. We love visiting there to this day. Our visit this year included a visit to the Speedway museum, the gift shop, the Grand Prix and a track invasion where fans could walk the race track after the festivities. We had a good time. \nThe museum has winning cars from races throughout history the engineering of some of these new and old are amazing. I highly recommend visiting. ",
  "The spectacle of it all.  Carb day is great and especially if you are in a suite.  Go for the cars, food and the people watching. Lots to see and do all around and get there earl for easier parking.  Leave early as it does get crazy the longer the day!",
  "We absolutely LOVE IMS and go whenever we get the chance. We are huge IndyCar fans and also live in Indy. We frequently visit IMS throughout the year. We love stopping by the museum, gift shop or attending any of the public events. The month of MAY is the penultimate event but it is fun to visit anytime: whether there are cars on the track or not. \nThere are tours to take anytime of year. You can ride around on one their buses and even kiss the yard of bricks like the winners. \nThe Christmas light display in Nov/Dec is not to be missed. You get to drive your car on the track for part of it!\nThe Red Bull Air Race in October is very cool as well. Part of the Grand Prix course is the runway!\nMany visitors to Indy do not realize that you can attend practice for the Indy 500 leading up to the race. The tickets are inexpensive and the sound is unparalleled when the cars are on the track! The drivers are accessible and you can get many great pictures. \nThe gift shop at the track has many unique items. The gift shop in the atrium of the Indianapolis Airport is also an extension of the track's gift shop. You can pick up that last minute souvenir. Keep on the lookout as it is not uncommon to see one of the drivers stop by for autographs here. \nMake sure to take the time to visit this iconic place if you visit Indy! It is close to downtown (15 min). You can also visit St Elmo's Steakhouse as well for another one of Indy's iconic places. The visit to IMS can be brief or extensive depending on the time of year that you visit.",
  "The speedway museum certainly has its charms if you're interested in history, but the real thrill here are the tours that take you around the 2.5-mile track. There are a few versions, depending on the day of the week and time of year, so call ahead to see what's being offered. When we went, we were able to get out of the tour bus at the start/finish line and stand on the historic row of bricks. If you're an Indy 500 fan, this is a must.",
  "When visiting the track grab a souvenir from the gift shop located in the museum. Located in the front of the museum. There is no charge to enter. \n\nThey have a lot of merchandise that will satisfy the entire family. Everything with Indy 500 or Brickyard 400 logos. Mugs, clothing, prints and nice jackets. Also nice die cast cars of different sizes. They have a track table for kids to play with cars. \n\nOverall good shop and staff was nice. We did not purchase anything. 3.5",
  "Took my friend from Boston to see it.  He was very impressed with all the cars inside the museum.  He even had me take his picture sitting in one that is set up for that.  We took a bus ride around the entire track and learned all about the history of the track.",
  "I've been here before but only during Indy 500 weekend so it was nice to visit without the mass crowds. If you're a race fan you need to go go. Nuff Said.\nMy only disappointment is that are no Penske race winners in the museum. He's won 18 of them and now owns the place so hopefully that will be rectified.",
  "Well worth the trip. Do the bus tour, it takes you around the track and stops at the finish line and you can get out and kiss the bricks.",
  "Nice one hour diversion while driving through Indy. This small museum is a must for Speedway fans. Has the Ford vs. Ferrari cars in display. Even saw the winning car on the year I was born! "
 ]
},{
 "name": "Indianapolis Museum of Art",
 "address": "4000 Michigan Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d7/9a/11/indianapolis-museum-of.jpg",
 "tags": [
  "family",
  "free",
  "art",
  "walking",
  "family",
  "art",
  "nature",
  "free",
  "library",
  "historic",
  "performance",
  "art",
  "family",
  "art",
  "walking",
  "art",
  "nature",
  "art",
  "art",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d103675-Reviews-Indianapolis_Museum_of_Art-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "I live in St. Louis, which has a world-class art museum with free admission.  That being said, paying $54 for a family of three to visit Newfields was a bit of a sticker shock.  However, the museum was well done and interesting.  My 6 year old, who is very interested in art, loved the motion sensored spring flowers in the foyer, the Robert Indiana LOVE sculpture, and spent time sketching the Georgia O'Keeffee Jimson Weed painting.  I was very impressed with the Samuel Levi Jones exhibit also.  The sculpture garden was still closed for the winter, which was disappointing, since it was late March.",
  "As you arrive, you see gigantic snails made of recycled materials sliding up the sides of the museum. There are more inside and through the museum. But the real fun is in the garden.\nThe garden is full of creatures that are all made from recycled materials. They were as big as adults and so colorful. Newfields has teamed up with the Italian art collective Cracking Art to welcome hundreds of animals to the Newfields campus this summer. These brightly colored sculptures are made from recyclable plastic and speak to the environmental issues that face our planet, as well as how the world is becoming increasingly artificial.\nSee snails in the Efroymson Family Entrance Pavilion and penguins inside the IMA Galleries, before exploring The Garden where you will have to watch out for giant alligators on garden pathways and elephants inside the Lilly House. My daughter loved doing cartwheels in between the line of foxes in the garden.\n\nWe spent about 2 hours walking through the art museum and the outside garden. Plan to go later in the day, so you stay cooler while outside. They don't close until 8 pm.",
  "It was an amazing experience visiting the Museum which has rebranded itself as Newfields in late 2017, a name that covers the entire 152-acre cultural campus, including the museum, its gardens and the Virginia B. Fairbanks Art & Nature Park and Lilly House. It features art galleries, lush gardens, a historic home, performance spaces, a nature preserve and sculpture park. Spread over an area of about 100 acres The Virginia B. Fairbanks Art and Nature Park now encompasses a diverse landscape, including wooded areas, wetlands, open fields, a 35-acre lake and a series of hiking trails. The permanent collection comprises over 54,000 works, including African, American, Asian, and European pieces and represents cultures from around the world and span over 5,000 years. In 2009, the IMA was awarded the National Medal for Museum and Library Service for public service. What we did see, we loved. We strolled outside and enjoyed the serene surrounding. Despite the payment of admission fee of $18 for adults and $10 for children ages 6 to 17, there are many facilities offered free like parking, Wi-Fi, lockers, wheelchairs, and strollers. The first Thursday of every month is free from 4:00-9:00. It remains closed on every Monday. Free admission dates are Jan. 14, Feb. 1, March 1, April 5, May 3, May 22 and June 7. In a nutshell, it is one of the nation's largest and oldest general art museums recording over 450,000 visits annually.",
  "For years we have talked about going to see the Winterlights at the Indianapolis Art Museum, now called Newfields, but have never taken the time to actually plan a night to visit, order the tickets, etc.  But this year, our daughter mentioned that they were going so we decided we couldn't miss this opportunity.  We picked the 8 pm time slot, which allowed us to meet in SoBro for dinner, and then it was an easy drive over to Newfields.  I'm sure from now on we will want to make this an annual winter time family event.",
  "Great way to spend a day!  Wonderful museum & lovely walking areas.  I was not familiar with this part of Indy and would highly recommend a day here.  I visited in the fall and the weather was lovely along with the blazing trees and the incredible art.  Also enjoyed the stroll to the Ely Lilly home.",
  "As native Chicagoans, it may sound sacrilegious to say that the Indianapolis Museum of Art is as interesting as the more celebrated Art Institute of Chicago. Or even the Metropolitan Art Museum in New York City. But after roaming its galleries for more than two hours, it made for an exhilarating and very entertaining experience. See for yourself. Located at 4000 Michigan Road, at the corner of North Michigan Road and West 38th Street, northwest of Crown Hill Cemetery, in the 152-acre Newfields campus that also houses the Lilly House, the Virginia B. Fairbanks Art and Nature Park and Gardens at Newfields, it is the ninth oldest and eighth largest encyclopedia art museum in the United States. Established in 1883, it covers over 250,000 square feet of exhibition space with a collection that comprises more than 54,000 works. Architect Ambrose Madison Richardson built four buildings on the site--the Krannert Pavilion in 1970, the Clowes Pavilion in 1972, the Showalter Pavilion in 1973 and the Hulman Pavilion in 1990. Significant areas of the collection include Neo-Impressionist paintings, Japanese paintings of the Endo period, Chinese ceramics and bronzes, sculptures and prints by Paul Gauguin, works by J.M.T. Turner, 20th Century modernism pieces by Pablo Picasso, Chagall and Matisse, American Impressionism and Modernism works by Georgia O'Keeffe, Edward Hopper, Winslow Homer and George Inness and 20th Century custom-designed costumes by Chanel, Givenchy and Balmain. Other pieces not to be missed include Aristotle by Jusepe de Ribera, Paul Gauguin's The Flageolet Player on the Cliff and Rembrandt's Self-Portrait. There is so much to see and you don't want to miss any of it.",
  "The museum ties to a large pharmasotical company has given them a larger acquisition budget than the Metropolitan Art Museum in NYC! You can see that evident fact in every inch of the grounds, the estate or the museum building with its vast and highly prized collection. \n\nWe have been members for nearly two decades - yet we live some 120+ miles away. Why? Because it is addective, the stroll through the grounds is mesmerizing, the museum's ever changing international exhibits are exciting, all while the special - or seasonal - festivals & shows throughout the year are top attractions. \n\nDon't take my word for it, see for yourself, a piligramage is a must, while annual membership is a bless (-:",
  "We love stopping by here every year.  Kids and adults will love the lights. Get your tickets online and you will save a lot of money. We love going here every year."
 ]
},{
 "name": "Lucas Oil Stadium",
 "address": "500 S Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/7a/54/14/gameday.jpg",
 "tags": [
  "family",
  "tour",
  "field",
  "walk",
  "tour",
  "field",
  "walk",
  "music",
  "food",
  "walking",
  "music",
  "food",
  "kids",
  "walk",
  "cheap",
  "food",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d1633438-Reviews-Lucas_Oil_Stadium-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "100% chance of fun! Did a colts game this year with the family and had a great time in the stadium and before tailgating. Make sure you go early to enjoy the pregame fun.",
  "Massive, clean and well kept, just all around great experience! Our tour guide, Mike was wonderful and informative. Had a subtle sense of humor and was enjoyable. Impressive that we saw the media press box area, quarterback lounge and suite, basement where 300 kegs are stored in a walk-in cooler for games, event room and walk on the field!!  Employee in the Colts gift shop was also friendly and helpful. Set aside our purchase so we did't have to carry it thru the tour. The grounds outside and everything inside are all kept up. Hard to believe this stadium is 11 years old. Many people inside cleaning something somewhere. A number of race vehicles also on display (motorcycle, tractor, boat, etc)  Also interesting story on how Mr Lucas got his start. Extremely positive experience and highly recomend.",
  "Enjoyed a wonderfully interesting tour of Lucas Oil Stadium on July 3rd.  Very easy ticket ordering on-line (a new feature), but you still have to take your receipt to the ticket booth to get actual tickets.  Would be nice if they could accept tickets on your phone.   The tour was great...we got to walk on the playing field, tour the Colts locker room, check out the Quarterback Suite, view the press area, and several other areas inside the stadium.  But be aware that if there aren't any events going on inside, the temp inside the stadium is in the high 80's with no air moving.  It is not heated or cooled when no events ongoing. Very warm and stifling.  If you have folks sensitive to heat, this might not be a tour for them.",
  "Very cool stadium for Football venues especially high school match ups but seating for basketball for the prices really does suck.  Unless you just have to go to a basketball game stick to the football in this venue.  Don't bring your pocket knife either because it is WMD at this location!",
  "Lucas Oil Stadium is definitely the place to be to enjoy all of the vitality that surrounds an NFL game.  Live music, lots of food choices and large hallways that are easy to navigate.  The seats are really really tight which makes getting in and out a struggle.  Don't leave the game early because you will crush a lot of toes! ",
  "I've been here once for a concert and once for a football game.  I really like the retractable dome.  Good game food.  Plenty of hotels surrounding.  Good parking options.  Wear your walking shoes because you do have to walk a little ways for restaurants but not too far.  Activities for the young kids.  Music.  Friendly and helpful staff.  I'm sure i will be visiting this stadium again in the near future!!",
  "The seating and sound system are great but their handicap accommodations need some work. Food was good but not cheap hamburger was $10 and plan on paying $20 to park. Also event i attended started at 11:30 and that is what time they opened the security gates outside with long lines of cold freezing families and wouldn't allow access to seats until 1:30 which i found odd because I'm used to NASCAR races where you can arrive early and sit in your seats for a couple hours if you want.",
  "We visit Lucas Oil Stadium a lot during the year because we attend and enjoy going to events. We are always pleased at Lucas Oil Stadium. When the weather permits and the retractable roof can be opened, it is really amazing. We were last the for the Big 10 game and had a great time. ",
  "This is a beautiful stadium! Love the layout; super clean; awesome tour as well; everyone was so nice to us; one good reason why I'm a Colts fan; love this place!",
  "Loved every minute of the football game. People were really great even to visiting fans. 7 year old with me had the time of his life. ",
  "Wow what a stadium. The facilities are amazing, every seat is a great seat. The Jumbotron are amazing. Great staff! Expensive as all other stadiums but excellent!"
 ]
},{
 "name": "Central Canal",
 "address": "337 W 11th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/78/98/e9/the-white-river-canal.jpg",
 "tags": [
  "walking",
  "family",
  "walk",
  "art",
  "walk",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d1682106-Reviews-Central_Canal-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don't miss a visit to the canal, especially on a pretty day.  Just walking along the water can boost your spirit as you see people enjoying the paddle boats, biking, visiting one of the museums, or just people watching. It has lots of lovely scenery to take in along the way. Relax and enjoy one of the prettiest places Downtown!",
  "Beautiful art along the canal with cute ducks in the water. What else would you want?! Its a great afternoon activity to take your family on with many opportunities to exit the canal to the street. If you need to get from one of the city to the next, check to see if you can walk along the canal. It's worth it!",
  "I ran the canal all the way from the White River State Park to the turn around at the IUP medical center on both sides of the water.  It felt like a safe place to run with a lot of places to stop and look at the ducks, the scenery, or the waterfall at the turn around.  There are a few restaurants along the way if you want to stop.  The pavement is a little tough for runners in some spots because it gets patchy (don't want to twist an ankle).  Otherwise, it's a great route.",
  "This is a very nice walk!   If you go on the weekend park at the \"canal head\" where the artificial waterfall is.  The IU health center has visitor parking for two hours.  Walk all the way to the end and spend some time at the medal of honor memorial.  There is a pedestrian only bridge across the river that takes you right to the entrance of the Indianapolis Zoo.",
  "The Indy downtown canal is an undiscovered beauty.   It's a 3 mile loop around business buildings, condos, the NCAA building, museums and White River State Park. Very peaceful to walk, run, or ride a bike.   Refeshments are limited in spots.",
  "I walked along here in mid August, which probably wasn't the smartest idea I've ever had. I'd like to go back and find more of the photogenic areas.",
  "Very nice set up for this place. A lot of hotels line the canal area. We were even able to watch the fireworks from our hotel balcony over the Fourth of July weekend.",
  "So nice to have the canal to walk in downtown Indianapolis. In nice weather, be prepared for more crowded sidewalks with walkers (lots of doggies!), runners and the occasional bicyclists. There are a few points with places to stop/eat (it'd be great if there were more!!), but look for those up in advance so you know where/when to go.\n\nGood for singles, couples and families.\n\nThere are paddle boat rentals and gondola rides available (research cost and availability).\n\nNice places along the route to sit and visit or take a breather. \n\nWould love to see this develop just a little bit more aesthetically (landscaping) and commercially... similar to San Antonio....EXCEPT wouldn't want boat tours. Indy canal is not suited for that commercial traffic.\n\nIf you have an hour or two to spare, definitely plan to visit the canal for a refreshing break and enjoyable walk in downtown Indianapolis."
 ]
},{
 "name": "Victory Field",
 "address": "501 W Maryland St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/82/ed/ec/filename-p1060313-jpg.jpg",
 "tags": [
  "walking",
  "kids",
  "field",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d2242259-Reviews-Victory_Field-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great venue to watch a game or just hang out.  Hotels and downtown are well within walking distance if you accidentally or intentionally over-indulge!  ",
  "This is the home of the Indianapolis Indians stop in and enjoy you some peanuts and popcorn and Cracker Jacks I'm pretty sure you will be back nice places downtown it's very well put together everybody is friendly and happy let's go Indians",
  "This ballpark is modern, clean and in the center of Indianapolis. Lots for the kids to do if not interested in the game. Great grass area for a picnic.",
  "Victory field started as the Indianapolis Indians Stadium Then became a small race track for several years and now has been reborn as a state of the art ball park.",
  "My Dad loves baseball and so do I, and he lives in the Indianapolis area and we went to a ball game here.  This is conveniently located and clean with good sight lines everywhere in the ball park.  Yes, okay, it is not the major leagues but AAA is a pretty good level of baseball and plenty entertaining!  Worth making an effort to see if you are in the area, or if you are a local, you should be going often."
 ]
},{
 "name": "Indianapolis Zoo",
 "address": "1200 W Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/9c/33/08/indianapolis-zoo.jpg",
 "tags": [
  "free",
  "kids",
  "kids",
  "tour",
  "walk",
  "free",
  "walk",
  "walk",
  "kids",
  "family",
  "food",
  "learn",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d103676-Reviews-Indianapolis_Zoo-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We always enjoy the Indy zoo, but it has been several years since we last visited.  The new orangutan exhibit is fantastic, and the little extras like feeding birds, taking the train ride, or feeding giraffes are reasonably priced.  Admission price is maybe a little high, so if you live near the city it's definitely worth it to buy a membership.  As always, the free dolphin show was great too.",
  "My husband and I took 3 of our kids here during summer break. We had a really good time. This is one of my favorite zoos. The bird room was one of our favorite spots. We also loved the Polar Bear and the Orangutan. So much personality! ",
  "You can tour the Zoo in 3-4 hours. We loved the Flamingo Mingle, Dolphin Show, Orangutans, Sea Lions, Shark Petting and Education, Exotic birds, Cheetahs, Lions, Zebras, Baby and Mamma African Elephants, and the Lemurs.  There is a lot to see in this small, privately-owned Zoo tucked away along the river park.   It's a short walk from the downtown stadium area and state Capitol building and very reasonably priced even if buying tickets at the door.  Don't miss this attraction.  There are comfortable dining areas and a great sprinkler play area for the kids when it's warm. ",
  "We had a nice time.  There were some exhibits closed, but if you look on the website it did tell you that.\nDon't take the train ride - doesn't show anything you can't walk around and see - should be free.\nDolphin show was great - it is free, we saw 2 shows - enjoyed it very much, go downstairs at the dolphin show and see them swimming around !  Very cool.  Penguins and other kritters in that hall very nice - we had a nice day - clean, etc.  would recommend.\n",
  "This isn't a huge zoo but there's plenty to see and do. Don't miss the orangutan exhibit or Oceans where you can see dolphins, penguins and you can pet small sharks. The other nice thing is that the zoo is located right on the edge of downtown so it is easy to get there. If you're staying at one of the downtown hotels you might even be able to walk. If you go in December, go at night. The whole zoo is decorated with lights. It's beautiful!",
  "Fabulous place to go anytime of year! Buy the annual family pass and enjoy all year long. Always different activity and face painting not to mention the animals. This is not a huge Zoo but it is a really nice one. We go very often! There are play areas and plenty to keep the children engaged. Make a day if it and bring the grandparents. Try and catch the butterflies exhibit, just that is worth a trip and there is also a small roller coaster the kids love.",
  "We went during a slow time (beginning of Covid-19), but they were still open.  Summer must be a great time once all the rides are open (train, sky ride, carousel...)  Great porpoise show which is worth your time!",
  "We have discovered a new gem at the zoo--The FLAMINGO MINGLE. This is a great opportunity to see the Flamingos up close and personal. As in they will nibble on you!! This and the Orangutangs are usually the highlights of our visit to the zoo. This year they also had a new Sloth that you could get up close with. There are so many great things about this zoo. We look forward to going every year we go to Indy.\n",
  "This Zoo is smaller than other, better known Zoo's (think San Diego) however it is well laid out well and for its size has a very nice selection of animals.  Make sure you see the seals and the tigers!",
  "Had a nice day at the zoo in Indy. Although it was a bit cold, the animals were all lout and seemed to be enjoying the sunshine.  The employees were friendly and the prices on food and drinks were reasonable. Typical \"zoo prices\".",
  "The more you travel, the more you see, the more you learn. For example, while visiting the Indianapolis Zoo, my wife and I became accustomed to the concept of biomes, something we weren't aware of while touring other zoos from across the country. Located at 1200 West Washington Street in Indianapolis' White River State Park, the 64-acre zoo was opened in 1964 and organized around the concept of biomes, which are areas of the planet with similar climate, plants and animals. At the Indianapolis Zoo, animals are clustered in groups with similar habitats. There are five biomes--Ocean, Forest, Desert, Plains and Flights of Fancy. Originally housed in George Washington Park on East 30th Street, the zoo was closed in 1987 and the current zoo opened i 1988. It attracts more than 1 million visitors a year. The highlight is the St. Vincent Dolphin Pavilion with its underwater viewing dome and one-million-gallon pool. And don't miss the $21.5 million International Orangutan Center, which opened in 2014 with nine orangutans, a 90-foot-tall viewing atrium and an aerial cable ride. What else is there to see? The Ocean biome features California sea lions, green moray eels, Pacific walruses, grey seals and smooth dogfish sharks. At Forest, see Amur tigers, Alaskan brown bears, bald eagles, red pandas and ring-tailed lemurs. In the Desert, you'll find 20 of the largest and most dangerous snake species in the world, including boas, pythons and vipers. The Plains features an African elephant, African lion, cheetah, white rhinoceros and reticulated giraffe. Flights of Fancy highlights flamingos, superb starlings, hornbills, cresta coua and crested wood partridge. All told, there are 3,800 animals in the zoo, aquarium and botanical garden. In fact, the Indianapolis Zoo is the first zoo in the country to be accredited for all three habitats."
 ]
},{
 "name": "Benjamin Harrison Presidential Site",
 "address": "1230 N Delaware St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c3/8e/26/benjamin-harrison-presidential.jpg",
 "tags": [
  "historic",
  "library",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "history",
  "tour",
  "history",
  "parks",
  "tour",
  "knowledgeable",
  "tour",
  "knowledgeable",
  "unique",
  "tour",
  "family",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d274423-Reviews-Benjamin_Harrison_Presidential_Site-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Benjamin Harrison was the 23rd President of the United States and, although he was committed to voting rights for African-Americans and signed the Sherman Anti-Trust Law, his four-year administration from 1889 to 1893 was rather uneventful and historians rank him among the bottom half of U.S. Presidents. However, his home in Indianapolis, Indiana, is a must-see, an architectural masterpiece and a treasure trove of historical relics. Located at 1230 North Delaware Street, north of I-65, in the Old Northside Historic District, the 16-room Italianate mansion with its red brick exterior was built from 1874 to 1875 by architect Herman Brandt. It features bracketed cornices, a three-story bay window, an oak-trimmed walnut staircase, butternut woodwork and parquet floors. Before the front porch was constructed in 1896, Harrison highlighted his 1888 Presidential Campaign by speaking from the front of his house to crowds in the street. He died in the second floor master bedroom in 1901. Today, the house is open for tours throughout the week. Ten of the 16 rooms are open to the public, all decorated in the Victorian style typical of Harrison's time in the residence. Seventy-five percent of the 3,700 pieces of memorabilia belonged to Harrison. There are 2,440 books in the library. The front parlor appears as it did when Harrison brought his new bride to the house. It was designed a National Historic Landmark in 1964 and added to the National Register of Historic Places in 1966.",
  "We have been to many Presidential homes over the years from Washington, Adams, Lincoln, Pierce, Arthur, Coolidge,Roosevelt’s....and this is among the best. Knowledgeable guides, beautiful architecture, nice original furnishings it was an excellent tour and well worth the visit. I would however increase the size and variety available in the gift shop as it was too small and didn’t have a great variety of items to select from. If you are a history Buff I strongly recommend the Harrison House.",
  "From the beginning in the carriage house, to our fabulous tour guide Robin, to the amazing gardens this experience was exceptional.  They were very accommodating for a person with an Aircast boot and he was able to use the ramp and elevator to access the upper levels.  The home is absolutely beautiful; the tour was well paced and full of information; the grounds and gardens were well maintained and gorgeous.  Easy to access and to leave.",
  "While traveling home to Alabama from Wisconsin after my mother's funeral, I took a detour/break in travels to take my 32 year old Presidential history buff son (who happens to have Down Syndrome) to the Benjamin Harrison Presidential Site. Unfortunately, we arrived after the last tour had started. The young man working there graciously granted us permission to make a \"quick tour\" of the home. As it turned out, he gave us a personal tour, interacted with my son throughout our time touring and made it a MOST MEMORABLE experience for both my son and I! \nI highly recommend visiting the Benjamin Harrison Presidential Site for reasons beyond the excellent staff they have working. The home and it's contents has so much to share, historically. Definitely worth the visit!",
  "This isn't a Parks Service museum.  It's a private foundation, and all you see is an accompanied tour of our 23rd president's private home with a docent (who knows a TON about him) pointing out certain things and telling you the history of him.  Nothing to explore privately and no signs on anything.  A bit of a let down.",
  "We visited in early February. No crowds, just us on tour. The house is incredible, 10,000 square feet with almost all original furnishings. Very knowledgeable guide who let us ask a lot of questions. Only one negative, the house is not in s great area. The signage telling you where to get tickets was not prominent, so we went around front where we were accosted by a man begging for money. Not pleasant, but still a great place to visit.",
  "Tour was exceptional and our guide was very knowledgeable and interesting. The staff were all friendly and helpful. The house has been kept up extremely well and is still almost entirely original. A wonderful gem in the city of Indianapolis.",
  "This home has been rated as one of the top President's homes. You must go and visit to learn about President Harris, his family and home. The docent has given the most educational tour about the family and everything unique about his presidency home here."
 ]
},{
 "name": "Monument Circle",
 "address": "100 Monument Cir",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/7f/31/dc/img-20180614-110355-largejpg.jpg",
 "tags": [
  "history",
  "food",
  "walk",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d7038008-Reviews-Monument_Circle-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you haven't experienced the Circle of Lights in person, and if you live in Central Indiana, I'd suggest you do it at least once.  Get there early and stand so you can see the top of the Regions Bank tower, otherwise you'll just hear the fireworks.  If the weather is bad, getting a room facing the circle at the Sheraton Hotel is a solid idea, but be advised that the \"live\" TV broadcast is several seconds behind real life.  We were watching the countdown on TV and the tree was already lit.  So there's that...",
  "We thoroughly enjoyed our stay downtown Indy, and the monument and fountains were beautiful on a sunny day!  Don't miss the opportunity to step into the chocolate shop and buy yourself a treat!!",
  "Lots of history at this spot.  Interesting facts about events from the early 1800's to the last great war.  There is lots to see and do with a large number of food choices in the immediate area.  Parking may be an issue in the circle, but there is plenty of parking available in the area.  In warmer weather it would be a great spot to have an urban picnic!",
  "Absolutely worth checking the area. The largest outdoor memorial in the United States to be dedicated to the common soldier. Surrounded by restaurants and shopping.",
  "You have to experience the lighting ceremony at least one time in your life. What a way to to get into the holiday spirit!\nWe get downtown early and just spend the day shopping, eating, maybe catch a movie, and then  walk to the circle for the lighting ceremony.  \nIt doesn't matter if it's the holidays or the middle of the summer.  You can take a carriage ride, or just sit on the steps and people watch......Monument Circle is just a neat place to hang out.",
  "We went to the Christmas Eve Light Show which they had advertised. Absolutely NOT worth it. Lasted 5 minutes and just flashed lights on buildings. BORING.",
  "An impressive traffic circle. I was there during the summer, when standing near the fountain feels nice if there is a breeze.",
  "The place is really special with lots of memories written and sculptures all around and within the four sides of the monument. . The music was nice and relaxing but there is something missing; there are no enough seating chairs or stools around and too little green spaces as well."
 ]
},{
 "name": "The Eiteljorg Museum",
 "address": "500 W Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/33/9a/f3/eiteljorg-museum.jpg",
 "tags": [
  "music",
  "art",
  "food",
  "educate",
  "history",
  "free",
  "art",
  "tour",
  "history",
  "art",
  "family",
  "free",
  "art",
  "learn",
  "active",
  "field",
  "art",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d110141-Reviews-The_Eiteljorg_Museum-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Eiteljorg has a great collection of Indian and western art; paintings, statues, crafts, etc. Usually there is a special exhibit, right now there is a special exhibit on dogs and the west.  There is a permanent exhibit upstairs on the different Indian tribes.  The Sky Cafe has very good food; soup, sandwiches, salads.  In the summer there is music on Wednesday nights.  Just a nice and interesting place to visit and it is on the Canal in downtown Indianapolis.",
  "My wife and I have driven through Indianapolis on several occasions but we never have spent much time there. Mention Indianapolis and I immediately think of the Indianapolis 500, which actually is run in neighboring Speedway, not Indianapolis, and St. Elmo Steak House, the city's iconic restaurant. Oh, there are the Colts and the Pacers and a world-class zoo. And the NCAA moved its headquarters from Kansas  City to Indianapolis a few years ago. As an aside, Indianapolis is the capital of Indiana, a basketball-crazy state that made the movie \"Hoosiers\" famous and coach Bob Knight infamous. But wait a second. There's more. How about the Eiteljorg Museum of American Indians and Western Art? It is the only museum of its kind in the Midwest. Located at 500 West Washington Street on the western edge of downtown Indianapolis, in White River State Park, the Eiteljorg was built in 1989 by businessman and philanthropist Harrison Eiteljorg to house his extensive collection of Native American art as well as Western American paintings and sculptures, including one of the finest collections of Native contemporary art in the world. Eiteljorg's mission was to educate, inspire and promote better understanding of art from the western part of the United States. His other objective was to build a museum that paid homage to Native American culture, art and history. A new contemporary art wing was added in 2005, adding three new galleries, the Sky City Cafe, an education center and outdoor gardens to double the public space of the museum. The architecture is stunning. Designed by John Hess, the museum leaves visitors awestruck with its massively carved wooden doors, wide aisles, high ceilings and large open stairway leading to the second floor exhibition halls. There are three main collections: Native American Collection, Western Collection of works from 1820 to present and a Contemporary Collection of art related to the west and Native American cultures. Included are works by T.C. Cannon, N.C. Wyeth, Andy Warhol, Georgia O'Keefe, Allan Houser, Frederic Remington, Charles Russell and Kay WalkingStick. There are special exhibitions that cover such diverse subjects as the artistry and history of pistols and motorcycles, the intersecting experiences of African and Native Americans, Jewish life in the West and the work of iconic artists Ansel Adams and Georgia O'Keefe. The Eiteljorg has even explored GLBT representation in Western film and celebrated the contributions of women in the West. Don't miss the bronze \"White Tail Deer\" sculptures designed by Kenneth R. Bunn on the front lawn. Or \"The Greeting\" sculpture near the entrance of the main building, an impressively large statue of a Blackfoot Indiana with outstretched arms and feather created by artist George Carlson. As a bonus, the museum offers free parking in the White River State Park Garage.",
  "The jewel on the near west side of downtown Indianapolis should not be overlooked when planning a visit to Indy. While we came specifically for a special event--the Jingle Rails model railway exhibit, the regular galleries and special exhibits hall are always a pleasure to tour. We especially enjoyed a display on the Taos artists' colony artists. If you're especially interested in learning more about Native American history and culture, Mihtohseenionki (The People's Place) on the second floor includes information specifically about Native Americans in Indiana as well as representative art works from across North America's native cultures. If you're hungry, the museum features a cafe with some very interesting choices. Find a memento of your visit at the museum gift shop. This may not be the best choice for very young children, but there are some interactive exhibits that will help keep older children engaged.  (Some special exhibits, such as Jingle Rails are more family-friendly.) ",
  "We really enjoyed our afternoon visiting this museum, it holds a range of permanent displays and temporary exhibitions. I especially loved seeing the photography of Horace Poolaw and the display of quilts showing how women used them to tell their stories and as a means of protest. Highly recommend a a visit!",
  "Very interesting museum.  Ran out of energy before running out of things to see.  It's one of those museums that would interest any age individuals.  Highly recommend it.",
  "A very nice museum that is a great place to go to spend a couple of hours and learn about Native American art and culture. Admission is very reasonable. They had a membership special going on. For $45 our family of four received an annual membership. This was $1 CHEAPER than buying four admission tickets without a membership. A no-brainer decision to buy a membership, LOL. They validate parking so this is free. A very good lunch restaurant and gift shop.",
  "Until I began to research our trip to Indianapolis, I wasn't aware that Indiana's capital city was home to so many outstanding art museums. Like the Eiteljorg Museum of American Indians and Western Art, an art museum you might thing would be more likely to be found in Denver. Located at 500 West Washington Street, in the downtown area, it is part of Indianapolis' White River State Park, which also houses the neighboring Indiana State Museum, Indianapolis Zoo, White River Gardens, NCAA Hall of Champions, Victory Field and Military Park. The Eiteljorg Museum, established in 1989, contains an extensive collection of visual arts by indigenous peoples of North and South America, as well as Western American paintings and sculptures collected by businessman and philanthropist Harrison Eiteljorg. In fact, it features one of the finest collections of Native American contemporary art in the world. Visit the George Gund Gallery, which displays paintings and bronze sculptures by Frederic Remington and Charles Russell, two of the giants of Western American art. Also paintings by George Winter, Thomas Hill, Albert Bierstadt, Charles King and Olaf Seltzer. In another gallery, there are paintings by New Mexican artists Georgia O'Keeffe, Joseph Henry Sharp, William Victor Higgins, Ernest Blumenschein and John French Sloan. In 2005, the museum doubled its public space by adding three art galleries, an education center, outdoor gardens, event space and the Sky City Cafe, which offers Southwestern-style cuisine. The new galleries display the museum's extensive contemporary art collection, which includes works by Andy Warhol, T.C. Cannon and Kay WalkingStick. For locals, there is a fascinating exhibit on the Indianapolis Motor Speedway. And don't miss Wilson Hurley's grand oil painting of the Grand Canyon. Interestingly, many of the works in the museum are contributions from recipients of the prestigious Eiteljorg Contemporary Art Fellowship, which is offered biennially to recognize some of the most innovative and influential contemporary Native American artists active today, including Kate WalkingStick, a Cherokee Nation painter who was honored in 2003.",
  "Excellent exhibits on Native Americans culture; history in Indiana; lifestyle and their ART.\nA great exhibit on paintings and sculpture depicting the great Out West. "
 ]
},{
 "name": "Indy 500",
 "address": "4790 W 16th St Indianapolis Motor Speedway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/67/b2/1d/indianapolis-motor-speedway.jpg",
 "tags": [
  "history",
  "family",
  "history",
  "walk",
  "food",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d8820259-Reviews-Indy_500-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Definitely well worth it if you are an Indy fan! It's a must to do on your bucket list. Just be prepared for many, many people and serious traffic after the race. All in all, I would go again!",
  "Behind basketball, Hoosiers love their Indy Car racing. Here, at the Indianapolis Motor Speedway, visitors can see and experience the modern-day coliseum. There is so much history and tradition inside the IMS oval that it would be a crime not to stop by the track if you were visiting Indianapolis. The sheer size will knock your socks off. If you are lucky enough to be in Indy for Memorial Day weekend, I highly recommend going to the Indy 500. It will be an experience you will never forget. There is nothing else like it in the world. When cars aren’t speeding around the track at 200 mph, the speedway hosts golfers on several golf holes inside the track. ",
  "Yes, you have to go at least once just to see that many people gathered together all at the same time. It is incredible. My wife and I live about 45 minutes from the track and have been a couple times. If you like open wheel racing you will naturally love this. \n\nSome tips\n\n1. If you drive yourself to one of the parking areas you will be in traffic, a lot of it, and allow yourself at least 1.5 extra hours to get there no matter where you come from.\n2. There are quicker ways to get to the track but it usually involves knowing someone important or making a donation to the local Police Dept. Seriously, you can get a Police escort.\n3. If you want to sit someplace of your choosing you will have to go to some resale outlet otherwise if you get tickets through IMS then you will likely be on the front stretch ...... which isn't bad and you would probably be under cover and out of the sun. I would just prefer to be up high in the first turn but then most people would which is why those tickets are so expensive.\n4. Pack a small backpack cooler with your fav drinks, snacks, damp washcloth in a baggy, maybe some earplugs, binoculars if you like. Pay attention to the weather cause this year it was kind of cool in the shade and my wife shivered in her sleeveless shirt and shorts........ so you may also take along a light jacket.\n5. It will take you the same length of time to get out as it did to get in so make sure to relieve yourself before you get to your car.\n6. You can park in peoples yards who are open to that and it will be cheaper than using one of the designated lots but it will still take you about the same amount of time to get to your seat.",
  "It's experience you will never forget. It's a family tradition I been going since 1968. My grandkids love going to the track and enjoys all the activities they have.",
  "Something everyone should experience at least once in their  lifetime.  There is nothing like the roar of the engines as they get going behind the pace car.  When they wave the green flag and they make it through turns one and two....there is nothing like it in the world until they wave the checkered flag.\nUndeniably the largest and best sporting event in the world.",
  "I’ve been to over 30 Indy 500’s, my wife over 25 and my youngest boys, about 10! It is an Amazing event with so much history. You need to get there HOURS early to find a place to park and expect to pay for parking and walk a bit to your seats. I would recommend being in your seats about 30-45 minutes before the race starts to see the activities before the race. So much fun! The tickets are a little pricey, but worth it. Sit as high as you can, to get a better view. Buy directly from IMS to get better prices. It can be hot, so if you’re not in the shade, bring sunblock. You can also bring your own cooler with food and drinks. No glass. It’s usually a packed house, so be prepared to be cozy with your neighbor. Lol Please goto this race and experience what it’s all about. If you can get there the day before, take a walk down Georgetown Road and experience some of the craziness that goes on before the race and enjoy some track food!",
  "We are so grateful to Brian and Steve for our golf cart tour!  What a great experience, wonderful information and excellent views of everything the speedway has to offer.  We spent several hours at the speedway between the tour and the great museum.  Would definitely recommend!",
  "We opted for the museum and trolly tour of the raceway. The museum is filled with former cars along with riding gear. It is pretty awesome to view some of these things up close. The tour was great, bringing you to see behind the scene things you would never get to see."
 ]
},{
 "name": "Eagle Creek Park",
 "address": "7840 W 56th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/50/b7/58/docking-rick-s-visitor.jpg",
 "tags": [
  "walk",
  "nature",
  "kids",
  "nature",
  "family",
  "nature",
  "parks",
  "walk",
  "family",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d274124-Reviews-Eagle_Creek_Park-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place is a nice place for a lake view, walk, or a picnic. The discovery center is cute but more of a place for children to go to programs and do projects. Not many exhibits but very pleasant to explore besides. It is a relaxed environment. There are lots of trails. It's a large place...keep an eye on small children. Good for families, bikers, or hikers.",
  "Our favorite park in central Indiana, we love it so much, we were married there.  Great hiking trails, a cozy nature center, superb bird-watching.  Nice beach and great boating.  Hard to believe it's just minutes from Downtown--you're in the countryside before you know it.  Lots of picnic shelters--take a lunch and stay the full day--sunsets are great from many areas around the reservoir.",
  "Eagle Creek is a great place to get a lot of the outdoors close to the city.  The ornithology center located on the north end of the park offers a great overlook of the reservoir and great place to check out local birds.  If you time it right in the morning you can get a chance to see some of the birds of prey up close when they move some of the caged birds to the outdoor pins.  My young kids loved this.  They also have a new nature center on the south end that has lots of hands on experiences.  The best attraction is the park itself.  Lots of deer and waterfowl to see, and scenic overlooks to admire the veiws.  Its a great place to recharge your bateries.",
  "Lots of fun to run the trails here, and lots of wildlife including birds of all kinds. There's a great ornithology center worth a stop for sure.",
  "We just loved it!\nIt was a beautiful sunny sunday, and the park wasn't so full. We hiked around one of the lakes and had a wonderful family time.\nWe are sure going to be back soon to explore other areas of this beautiful park. ",
  "Eagle Creek Park is to Indianapolis what Central Park is to New York and Lincoln Park is to Chicago, a vast wonderland for hikers and boaters and picnickers and bird watchers and dog walkers and anyone who yearns to get away from the hubbub of urban life. Located at 7840 West 56th Street, it covers about 1,400 acres of water and 3,900 acres of land, including about 10 miles of paths, making it the largest park in Indianapolis and one of the largest municipal parks in the United States. Did you know the NCAA Rowing Championships were held in Eagle Creek Park in 2003, 2014 and 2015 and the World Rowing Championships were held there in 1994? And the 1987 Pan American Games used the park for rowing, canoeing and archery events? Created in 1962, the park serves primarily as a nature reserve. Deer are observed grazing in the park. And pelicans visit the park's bird sanctuary. Locals use the park for fishing, cross-country skiing, boating, kayaking, golfing on the 36-hole course, bird-watching, hiking, swimming, rowing, sailing, picnicking, jogging, canoeing, meditating, even shooting at the pistol range. It certainly makes for a wonderful way to get away from the downtown traffic.",
  "Just a flat out great park.  Many different types of trails with great scenic views. There is a myriad of outdoor activities to enjoy. Ornithology center ( bird sanctuary place) is awesome and a good place to park if you want to do the 2 mile walk on a popular trail. Fantastic park on MW side of Indy. We go there often. Marina is great as well. OH - and if you like kayaking you can rent there or bring your own. There is a great kayak drop off area with a kayak launch ramp. Get the year long pass. Crazy value. We go all the time.",
  "With my husband and i being avid hikers, we sometimes run out of new locations being in Indiana. With this park being a hour and half away we decided to try it.  I was really impressed with not only the massiveness of this park but the trails are legit. The Red trail really delivered the hike that we were looking for. A great park. plenty of bird watching, and just that open land that everyone needs. we really respected that the majority of the dog owners kept their pups on leashes. As a dog lover, i cant help but to see that rules are being followed when it comes to dogs and their safety. \nThe tree top adventure looked to be a great activity for a family. This is a true metro park that over delivers and not to be underestimated.  I could only imagine how busy it is in the summer."
 ]
},{
 "name": "White River State Park",
 "address": "801 W Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/8d/ac/cf/white-river-state-park.jpg",
 "tags": [
  "historic",
  "field",
  "theatre",
  "art",
  "field",
  "walk",
  "walk",
  "walking",
  "historic",
  "field",
  "theatre",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d278809-Reviews-White_River_State_Park-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "White River State Park is a 250-acre urban park located on the western edge of downtown Indianapolis that features many attractions, including the Indiana Central Canal and cultural, educational and recreational points of interest that make the park a go-to destination for one and all. Located at 801 West Washington Street, it also is a luscious piece of green space, trails, trees and waterways that provide locals and visitors with an opportunity to take a leisurely stroll through the park. Along the way, you can visit the Historic Pumphouse that opened in 1870, the Indianapolis Zoo, White River Gardens, the NCAA's Hall of Champions, the Indiana State Museum, the IMAX 3D Theatre, the Congressional Medal of Honor Memorial, the Historic Washington Street Pedestrian Bridge that opened as part of the National Road in 1916, Military Park, the Indiana Historical Society, the Indiana State Capitol building, the Eiteljorg Museum of American Indians and Western Art, Victory Field and the Farm Bureau Insurance Lawn, named one of the top 100 outdoor concert venues in the world. Over 3.5 million people visit the park annually. For trivia buffs, it is noted that one of the proposed focal points of the park, the Indiana Tower, was never constructed.",
  "This state park is a little different - it is located in downtown Indianapolis on the banks of the White River. It has no obvious borders, but appears to bounded to the north by IUPUI, to the west by the White River (although it extends across the river to encompass the Indianapolis Zoo and White River Gardens), to the south by Washington St and the railroad tracks, and to the east by West St. Besides the Zoo, it also encompasses Military Park, Victory Field, Indiana State Museum, Eiteljorg Museum, NCAA Hall of Champions, Concert Lawn, and the west end of the Canal Walk. There is also a visitor center where you can get information on upcoming events and even buy some souvenirs in the gift shop. Now, it should be noted that while there is no admission to use the park, you will have to pay to visit the attractions like the museums, etc. Besides the Canal Walk, two marked trails also pass through the park - the White River and Cultural Trails.\n\nWe visited on a sunny and surprisingly warm early December morning and walked through the Military Park down past the back sides of the State Museum down along the White River and back up along the Canal Walk to get back to our vehicle - pretty much the perimeter of Park except for crossing the foot bridge to the Zoo and Gardens on the other bank of the river. This took about half an hour so a nice little walk. \n\nAbout the only downside was that the canal was drained for some maintenance so it wasn't at its best, but kind of interesting to see what it looks like without the water. This is the first time its been drained in over a decade, so there's quite a bit of mud and a few curious bits of junk that people have tossed in over the years.",
  "There's lots to do at the entrance of the park. Rent bikes or paddle boats or just walk along the canal. There are several sculptures spread out here and there. Pretty cool set up.",
  "This park is great for walking, bicycling, and more! This park has a long, wide, paved pathway to explore, and most of it is along side a man-made waterway. You can rent surry bikes that seat 2, or 4, as well as other types of bikes, as well as segways. They have a concert venue. There are museums to see there. I was impressed with this park, that is in the middle of Indianapolis!",
  "White River State Park is a 250-acre urban park located on the western edge of downtown Indianapolis that features many attractions, including the Indiana Central Canal and cultural, educational and recreational points of interest that make the park a go-to destination for one and all. Located at 801 West Washington Street, it also is a luscious piece of green space, trails, trees and waterways that provide locals and visitors with an opportunity to take a leisurely stroll through the park. Along the way, you can visit the Historic Pumphouse that opened in 1870, the Indianapolis Zoo, White River Gardens, the NCAA's Hall of Champions, the Indiana State Museum, the IMAX 3D Theatre, the Congressional Medal of Honor Memorial, the Historic Washington Street Pedestrian Bridge that opened as part of the National Road in 1916, Military Park, the Indiana Historical Society, the Indiana State Capitol building, the Eiteljorg Museum of American Indians and Western Art, Victory Field and the Farm Bureau Insurance Lawn, named one of the top 100 outdoor concert venues in the world. Over 3.5 million people visit the park annually. For trivia buffs, it is noted that one of the proposed focal points of the park, the Indiana Tower, was never constructed.",
  "The weather was perfect at the beginning of October. We had a nice stroll in the park. It is a beautiful place in downtown Indianapolis.. White River State Park boasts greenspaces, trails, trees, and waterways co-mingle alongside cultural, educational, and recreational attractions across 250 beautiful acres.\nWe did not attend all the attractions. But we could testify for the beautiful greenspaces and waterways.",
  "Driving around on a rainy day, wanted to stop at the visitor's center, but couldn;t find the parking for it",
  "Parking was easy ($8 for 3 hours) and the park was lovely to stroll through.  for those that are interested you can rent bikes, pedal boats and scooters.  "
 ]
},{
 "name": "Bankers Life Fieldhouse",
 "address": "125 S Pennsylvania St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/8e/b3/88/view-from-200-level-seat.jpg",
 "tags": [
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d616522-Reviews-Bankers_Life_Fieldhouse-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Older facility but updated over the years.  Lots of concession stands with great service. Seating a little tight (knee room).  Well run.  ",
  "Because the Big Ten Men's BB was cancelled we were only there twice for games.  Staff were helpful getting through security and finding seats.  Concession staff were also helpful.",
  "Always a great experience at the field house. Not a bad seat in the place. Get a jumbo hot dog and a Pepsi. Mmm good! Midwest hospitality at its best every time we go.",
  "We enjoyed seeing an NBA game they played the NY Nuggets. There was a lot of entertainment during the breaks in the game. We have been here before and will definitely go again.",
  "I enjoy Pacers and Fever games at the Bankers Life Fieldhouse. Hoosiers love their basketball and this venue is a beautiful and nostalgic place to visit.  The Fieldhouse recreates the small high school basketball gyms I attended during my high school days. This venue has  hosted large events like concerts and Big Ten championship games. First class in my opinion"
 ]
},{
 "name": "Indiana Convention Center",
 "address": "100 S Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/76/dc/d5/entrance.jpg",
 "tags": [
  "art",
  "food",
  "unique",
  "walking",
  "free",
  "walk",
  "organized",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d1419413-Reviews-Indiana_Convention_Center-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place is huge, which is important for hosting a convention of the magnitude of the NRA Annual Meetings & exhibits, with over 80,000 in attendance. It is clean, handsome and state-of-the art, with room for all of the functions of a present-day major event. It has an excellent skywalk system to connect you to the Hyatt Regency, JW Marriott or Westin, as well as a tunnel to the Lucas Oil Stadium, which can be important in case of inclement weather and adds a measure of safety and security as well, not having to cross any streets or even be on the streets.",
  "Been here twice to attend PASIC conference. Great, reasonably priced food, large conference rooms, and large shared rooms for trade show. The walkways connecting the conference center to hotels, Lucas Oil Stadium and downtown indoor mall were awesome, especially in winter months.",
  "I really enjoy going to the Indiana Convention Center. It's always clean, has friendly staff, is easy to get to & has plenty of room for a 2-day cheer competition. I recommend parking behind the building, in the pay-lot by Lucas Oil. Parking structures in the area are much more expensive & not much closer.",
  "The hotels nearby are nice but book in advance or oyu'll misss the good rates. They have street car vendors weather permiting. Parking can be tricky to find so call around or google paring options prior to events.",
  "We were there for the Probation Officers Annual Conference. A meal was provided but it was bland as usual for a conference. Take a jacket even if it's July, they keep it cool in there all the time.",
  "I loved the central location of the complex. The parking can be a little expensive depending on the events that are being held; but the convenience factor is what makes this place so unique. The center is connected to a huge mall, and a hotel with pubs and restaurants surrounding the area within walking distance. Very neat, definitely one of a kind place. ",
  "This is the home of the NFL combine on the first day. They're kind of grandmas are they meet sign in and all that stuff but only one main room where they have some combine activities that you can try as well as the arena area 4 that invitees to do their bench pressing. First day is a free event. You do have to go through metal detector security. They set up some temporary stand so you can watch the weightlifting show. They have all the radio stations from the NFL cities they're doing some interviews. They don't allow you to ask for autographs. It's okay but it definitely wasn't what I expected. They have an NFL store off site across the block that is a temporary store they set up a but it doesn't sell very much combine gear it's just your regular NFL stuff.",
  "My daughter has a gymnastics meet here and this is one of the better venues we have been to. Location is easily accessible, plenty of places to park and also stay and be right by the convention center. It's very clean.  ",
  "Come here every year for a very large convention.  Definitely one of the biggest, nicest convention center's we have ever been in.",
  "Attended the AWA show for the first time and was delightfully impressed with the convention center and its skyway hook up to my hotel. You can walk through the mall on the way which offers a plethora of dining options.",
  "Located in the city center and connected to several hotels and a mall by over head walkways.   The facility is large and well organized.   The food options are typical for a convention center.   "
 ]
},{
 "name": "Indiana War Memorial",
 "address": "51 E Michigan St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/7f/27/38/img-20180614-115040-largejpg.jpg",
 "tags": [
  "historic",
  "history",
  "history",
  "organized",
  "tour",
  "free",
  "free",
  "historic",
  "history",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d103677-Reviews-Indiana_War_Memorial-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Perhaps no city outside Washington DC does more to honor our nation's veterans than Indianapolis, Indiana. The Indiana World War Memorial Plaza, originally built in 1924 to honor the veterans of World War I, is a plaza that covers five city blocks that includes the Indiana World War Memorial, the Soldiers and Sailors Monument, Cenotaph Square, Veterans Memorial Plaza, Depew Memorial Fountain, University Park, American Legion Mall and a don't-miss military museum. Located at 51 East Michigan Street, bounded by St. Clair, Pennsylvania, Vermont and Meridian Streets, the centerpiece of the plaza is the Indiana World War Memorial, which is modeled after the Mausoleum of Halicarnassus, one of the Seven Wonders of the Ancient World, and contains \"the Altar of the Flag\" in the Shrine Room. The memorial was added to the National Register of Historic Places in 1989 and designated a National Historic Landmark in 1994. The War Memorial, whose cornerstone was laid in 1927 by General John Pershing, is 210 feet tall or 75 feet taller than the original Mausoleum. Made of unrelieved ashlar Indiana limestone with six Ionic columns on each side, it is one of the most imposing neoclassical structures in the country. There are several sculptures. Most notable of all is Henry Hering's colossal male nude bronze Pro Patria, which is 24 feet high and weighs seven tons, the largest cast bronze sculpture in the United States. Also impressive is the 100-foot-tall black granite obelisk in the Veterans Memorial Plaza. Be sure to visit the Indiana World War Memorial Military Museum, which honors Hoosier soldiers in a timeline from the American Revolutionary War to modern conflicts. World War I and World War II are featured most prominently. Among the exhibits are a replica of the radio room of the USS Indianapolis, which was sunk after delivering the first atomic bomb to Tinian in WW II, a Cobra helicopter, the USS Indiana's commission plate, 300 Civil War flags, firearms of all types and a replica of Indiana's Liberty Bell. Lots of history, lots of memories, lots of time for sober reflection.",
  "Indiana War Museum is very organized and have a lot of interesting facts about the military history of the United  States. Plan to spend at least 2 hours there to see everything.",
  "A real helicopter inside the museum - the Cobra attack helicopter is huge, I wonder how the took it inside the museum, A bust of Hitler with a bullet hole sneaked from Germany, a section of steel beam from the WTC in the 9/11 section, the USS Indianapolis radio room are some of the interesting artifacts. The gigantic US flag in the central dome is awesome. There are lot more things, one needs at least 1 to 2 hours to enjoy - and more if possible.",
  "Climb the stairs to the observation deck if you can, but there is an elevator for a nominal charge. Bring a water bottle if you hoof it up the 200-something steps!",
  "I have lived in Indiana all of my life.  I was shocked to go downtown over a school break and took the war memorial tour.  Its not guided but it is online.  It tells you where to start and what route to take of things to check out for the war memorials.  I am so glad we did. This museum is beautiful.  It is so large and it is filled with items from different wars.  The upstairs memorial room is nothing like I have ever seen.  Take some time and check it out.  It will make you and whoever is with you grateful for all of the veterans and touch your heart.  Another great thing about is venue is that is was free.  Make sure to check the times when it is open.  It usually closes by 5pm",
  "Climb the stairs to the observation deck if you can, but there is an elevator for a nominal charge. Bring a water bottle if you hoof it up the 200-something steps!",
  "The displays are for various wars the United States has been in.  Various equipment on display. Displays on 9-11.   Upstairs they have a shrine room. Free. ",
  "I grew up an hour away from Indy, but had never seen this memorial. It is quite nice, documenting the participation of Hoosiers in fighting many battles. There is also an auditorium with a lovely ceiling. ",
  "Perhaps no city outside Washington DC does more to honor our nation's veterans than Indianapolis, Indiana. The Indiana World War Memorial Plaza, originally built in 1924 to honor the veterans of World War I, is a plaza that covers five city blocks that includes the Indiana World War Memorial, the Soldiers and Sailors Monument, Cenotaph Square, Veterans Memorial Plaza, Depew Memorial Fountain, University Park, American Legion Mall and a don't-miss military museum. Located at 51 East Michigan Street, bounded by St. Clair, Pennsylvania, Vermont and Meridian Streets, the centerpiece of the plaza is the Indiana World War Memorial, which is modeled after the Mausoleum of Halicarnassus, one of the Seven Wonders of the Ancient World, and contains \"the Altar of the Flag\" in the Shrine Room. The memorial was added to the National Register of Historic Places in 1989 and designated a National Historic Landmark in 1994. The War Memorial, whose cornerstone was laid in 1927 by General John Pershing, is 210 feet tall or 75 feet taller than the original Mausoleum. Made of unrelieved ashlar Indiana limestone with six Ionic columns on each side, it is one of the most imposing neoclassical structures in the country. There are several sculptures. Most notable of all is Henry Hering's colossal male nude bronze Pro Patria, which is 24 feet high and weighs seven tons, the largest cast bronze sculpture in the United States. Also impressive is the 100-foot-tall black granite obelisk in the Veterans Memorial Plaza. Be sure to visit the Indiana World War Memorial Military Museum, which honors Hoosier soldiers in a timeline from the American Revolutionary War to modern conflicts. World War I and World War II are featured most prominently. Among the exhibits are a replica of the radio room of the USS Indianapolis, which was sunk after delivering the first atomic bomb to Tinian in WW II, a Cobra helicopter, the USS Indiana's commission plate, 300 Civil War flags, firearms of all types and a replica of Indiana's Liberty Bell. Lots of history, lots of memories, lots of time for sober reflection.",
  "We are so thankful we didn’t miss out on this museum during our visit to Indianapolis. We spent about two hours exploring the history and collections from various wars. The memorial hall is breathtaking and incredibly moving. We were very, very impressed. Admission is free, but donations are accepted. My guess is you’ll want to make a donation. Restoration is presently being done on the tower so we were unable to go up to the observation area. ",
  "The building is sizeable and a great tribute to the fallen heroes. Really interesting find in the heart of Indianapolis. "
 ]
},{
 "name": "Indiana State Museum",
 "address": "650 W Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/a8/54/b7/downtown-view-from-indiana.jpg",
 "tags": [
  "history",
  "walk",
  "walking",
  "history",
  "free",
  "theatre",
  "food",
  "tour",
  "walking",
  "history",
  "free",
  "theatre",
  "history",
  "knowledgeable",
  "food",
  "history",
  "learn",
  "art",
  "structure",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d274288-Reviews-Indiana_State_Museum-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is actually a really interesting museum.  The bottom floor is filled with natural history related exhibits, and since I’ve done about 3 of those within the last couple of weeks, I decided to just have a quick look through before moving on.  About half of those exhibits were getting work done to them as well so some weren’t even open.  \n\nThere’s a handful of galleries on the third floor but most are only open seasonally and so there’s nothing really up there at the time of year.  Luckily though, the second floor exhibits made up for it!  There’s 7 exhibits in total and the floor is designed so you walk around them in chronological order which is just heaven for someone with OCD like me.  The first exhibit is called Contested Territory and focuses on the conflict between the Americans, British, French and Native American tribes.  I didn’t realise how much of a big part Indiana played when it came to the Native Americans.\n\nThe second exhibit is called The 19th State which focuses on the pioneer villagers who came to settle in Indiana.  Next came the Crossroad and the Enterprising eras which, like with most western cultures, saw the advancement of technology.  There was also an exhibit highlighting all the famous people from Indiana; there’s not as many as Iowa!  There was quite a few but a lot were American broadcasters or other people who aren’t famous in the UK.\n\nI learnt a lot and thoroughly enjoyed my time there; it's definitely worth a visit!",
  "Excellent state museum with good exhibits to engage people of all ages in Indiana's history ranging from the Ice Age through today.  Rotating exhibits are particularly good covering a wide variety of topics from Abraham Lincoln, the history of corn and venomous snakes!  The large screen IMAX theatre is also great for shorter films and first run releases.  Free underground parking is good for distant visitors and it's within walking distance on the Cultural Trail for out-of-towners staying downtown.   In good weather stroll along the canal back toward downtown when you're done or rent a surrey bicycle in front of the museum.  ",
  "This is an excellent museum. For people who are from Indiana, they can reminisce. For people traveling through Indiana, this museum educates you about all of the amazing contributions that people from Indiana have made. So many interesting exhibits and an IMAX theater! The restaurant does need some work on food choices and layout.",
  "I was surprised with how much I enjoyed this museum.  There was a lot to do and see.  Avoid the cafe unless you are super starving or willing to spend a lot of money on overpriced snacks. I am looking forward to visiting again maybe next time we will catch an IMAX showing!",
  "The largest IMAX screen in the state. Amazing place to watch a movie. Sound effects and picture quality is wonderful. \n      Easy (paid) parking in underground attached garage. Good signage to direct to your destination. Helpful since there are several venues one can access from parking. \n      Museum is great too; not so large that it’s too challenging to tour in several hours. \n     Staff is helpful and friendly.",
  "Excellent state museum with good exhibits to engage people of all ages in Indiana's history ranging from the Ice Age through today.  Rotating exhibits are particularly good covering a wide variety of topics from Abraham Lincoln, the history of corn and venomous snakes!  The large screen IMAX theatre is also great for shorter films and first run releases.  Free underground parking is good for distant visitors and it's within walking distance on the Cultural Trail for out-of-towners staying downtown.   In good weather stroll along the canal back toward downtown when you're done or rent a surrey bicycle in front of the museum.  ",
  "I left Indiana/Indianapolis decades ago but was back in town for a friend’s party so stopped at the state museum on a Saturday.  It sure has improved since the old city hall location!   Gives a good overview of Indiana’s geological, native, pioneers and modern history. Flow through the museum isn’t real clear in fact is confusing, hence the 4 not 5 stars.  \nGood restaurant and with good view.  I had a club sandwich.  \nThis was at start of Coronavirus scare so it was rather empty place.  (My last visit to a public space.)\nIt was really special to see cabinets built by Abraham Lincoln’s father!   See photos.  \n\nMade me proud to be a Hoosier!",
  "Museum staff were readily available to assist visitors.  All we encountered seemed very knowledgeable about the museum.  Could have spent many more hours than we did.  Planned to come back again....soon!",
  "If your looking for something to do and have the desire to drive away the winter blues, this is the place. A great museum, educational and clean.  Our lunch at the cafe’ was excellent, very friendly staff and high quality food.",
  "I'm a history buff so it follows that my wife and I always make it a point to visit the history and art museums in all of the major cities that we visit from coast to coast to accumulate knowledge about the people and the area. In Indianapolis, the Indiana State Museum, which was founded in 1869, offers more than 40,000 square feet of exhibit space and more than 500,000 artifacts that cover the history of the natural world, Native Americans, cultural history and the future of Indiana. There are exhibits on the science, art, culture and history of the state from prehistoric times to the present day. It also is the site of the state's largest IMAX screen. Located at 650 West Washington Street, on the Indiana Central Canal within the White River State Park, this magnificent, glass-enclosed $105 million structure opened in 2002. Start with the \"Back Home Again\" steam clock outside the front entrance. Learn that Indiana is more than basketball and the Indianapolis 500. The journey begins with mastodons and Native Americans and continues with early settlements, farming, schooling and manufacturing. Meet inventors, statesmen, businessmen and other famous Hoosiers, all profiled in the American Originals exhibit. Also view the exhibits that highlight Indiana, including the 19th State, The Hoosier Way, the Crossroads of America, Enterprise Indiana and Global Indiana.",
  "The museum provides a good timeline of Indiana State History.  Ironically (and after visiting many other city and state museums), the State can’t lay claim to many original inventors, proud statesmen, businesses, etc.  It also has a heavy admission fee and paid parking.  But, it was on our list albeit last compared to our visits to the Chicago History Museum, Frazier Museum (Kentucky), New York State, Tennessee History Museum, Florida, and even Alabama.  Perhaps this review will spur a bit of friendly competition but I have to give a rating similar to the Bullock Museum in Texas (nice building,  so-so museum)"
 ]
},{
 "name": "Garfield Park Conservatory & Sunken Garden",
 "address": "2505 Conservatory Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ce/74/5a/the-conservatory-as-seen.jpg",
 "tags": [
  "history",
  "walk",
  "kids",
  "music",
  "walk",
  "learn",
  "walk",
  "walking",
  "library",
  "walk",
  "field",
  "theatre",
  "walk",
  "walk",
  "kids",
  "free",
  "walk",
  "active",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d2516904-Reviews-Garfield_Park_Conservatory_Sunken_Garden-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great little gem in the city.There's so many different types of exotic plants all in one location. Even if you don't have a green thumb or an appreciation of plants you'll still enjoy this.",
  "My wife really enjoys plants and flowers so we visit a lot of gardens and conservatories. We both enjoyed our visit. The conservatory is smaller than most we've seen, but it was very well maintained and filled with beautiful and interesting plants. At $2 for admission, you can't beat the price for a warm, peaceful oasis while waiting for spring.",
  "A gem of a tropical indoor  gardens with a long history of plants and volunteerism. Walk into the humid warmth and into a small yet striking pointsetta and O model train display thru the north pole and Christmas town. Looking forward to seeing other seasons and the outdoor displays.",
  "Old School.  Garfield park is just south of the city off of pleasant run parkway.  I am sure it was a great neighborhood many years ago and it appears to be coming back.  This area is a big wooded city park one that you would have gone too as a child to learn how to swim or some crafts or take your dog and run around.   When you pull into the park you see the old style Glass Conservatory that looks like it is from the 1940's.  It is not a very big building.  It is the old metal and glass that takes you back in time.  The building is situated on the property running North and South and directly in front of it (west) is a large sunken garden.  The conservatory is very well taken care of.  You have a small fee to the conservatory and you are immediately surrounded by a very tropical feel of plants and water and all the sounds.  The building is laid out such that you walk on either side and make a big loop.  You can pick up a pamphlet and it will list several things that they want you to spot throughout the building.  Take a camera and you can get a lot of nice shots. on the South end of the building there is a coy pond and water fall.  You can walk right up to the edge and watch the different species of fish.  The conservatory does an excellent job keeping it current.  They also have an open house where they showcase blooms by local individuals.  The conservatory is just as much fun for an elderly parent as it is for children.  You can go on a rainy day or a beautiful sunny day.  Once you have checked out the conservatory go outside and check out the gardens.  It is a few steps down and it is not overly large to walk around.  The gardens are well maintained.  The actual park is somewhat hilly and large.  There is an out door pavilion for music or speaking events.  In the past the Mutt Strut was held on the grounds.  It is a great place to simply take a blanket, a bucket of fried chicken and spend the afternoon.  And who knows, your kids just might pull out their phone to take a picture or two.",
  "There have been many changes at the conservatory to recommend it. It's a quaint atrium with lovely flowers and such, and a fun sunken garden. A nice place to walk the dog. Take time to stroll the entire park and have a picnic, if the the mood strikes you.",
  "The conservatory and sunken gardens are beautiful.  I have lived in Indianapolis a good chunk of my life and have not known another place like it.  Weddings are often held in the summer, so if you're going for a visit and it's a Saturday (big wedding day), you might want to keep that in mind.  The rest of the park is a great place to take a walk, as well.  There are tennis courts, multiple playgrounds, a nice newly renovated library, an outdoor amphitheater, and walking paths along the creek.  This park also hooks up to the Pleasant Run Trail which connects to the Cultural Trail.  You can bike or walk all the way downtown from the park without ever having to be on the road (when the Cultural Trail is completed on the SE side...which is VERY soon).  There is NOT a fee for the Sunken Gardens but there is for the Conservatory (very small...just $1 or $2 I think).",
  "I bring my dogs to walk at this park and we enjoy it very much. It is quiet and has several areas for sitting and enjoying the peace without being disturbed.  There are the Gardens which have been upgraded lately.  There is a small creek, many shelters, 2 playgrounds, a softball field, swim park, outside basketball court, and the outdoor theatre.  In the summer there is a Farmers Market.  There is a arts center as well.  ",
  "It’s not a large conservatory, but for a couple of dollars you can’t beat it. Great place to refresh in the winter months, a reminder that spring is just around the corner.  The park service staff was very friendly, enjoyable to talk with.",
  "just a wonderful place to experience. They have plants and beautiful vegetation from all over the world, small animals and insects to marvel at, and a lovely waterfall to enjoy. Also make sure to walk through the sunken garden.",
  "A very nice park.  Lots of open space to walk with your pet or kids.  Lovely area.  Safe.  Plenty of free parking.  Christmas exhibit opens the day after Thanksgiving.  ",
  "The outside gardens were very pretty.  Inside was nice to walk around, but we had something biting us, could just have been whatever was active due to the very hot weather & humidity.  Inside itself was small but worth the trip.  They had a lot packed into the small space.  Labels could have been better, but not a bad stop for sure."
 ]
},{
 "name": "Indiana State Capitol",
 "address": "200 W Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/b7/ac/3f/the-full-view-of-the.jpg",
 "tags": [
  "kids",
  "tour",
  "history",
  "family",
  "historic",
  "library",
  "structure",
  "tour",
  "tour",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d2494163-Reviews-Indiana_State_Capitol-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We enjoy visiting statehouses, which are a crash course in a state’s history, economy, politics, culture and geography in under an hour. Of the 20 we’ve visited, the Indiana State Capitol tour is near the top of our list for that purpose. Our group included a teenager and two grade schoolers, and a gaggle of adults, some Hoosiers and others, like us, out-of-staters. Our guide, Jim, cleverly engaged all of us in his interesting and informative tour. We learned a lot and had a good time; in fact, in a first for us, the adults, strangers at the outset, all shook hands and said good-bye at the end as if we’d shared a bonding experience. Talk about “Hoosier Hospitality”—well done, Jim! The grade school kids, our grandchildren, were still talking about the tour and the rotunda dome unprompted the next day. And did you know that Indiana limestone is used in 40 state capitols? An excellent outing for family and friends, even solo travelers. Highly recommended.",
  "I love state capitol buildings, this one lived up to my hopes. The rotunda has lovely stained glass, and there are grand staircases on both sides of the building. ",
  "The Indiana State Capitol Building in Indianapolis is a magnificent structure that was built from 1878 to 1888 on the site of the previous State Capitol Building that was condemned because of structural defects and razed to make room for the current statehouse. Obviously, the current building, designed by Indianapolis architect Edwin May, was built on a solid foundation and didn't repeat any of the mistakes made in the construction of the previous statehouse. Located at 200 West Washington Street, the interior is modeled in the Italian Renaissance style with doors made of Indiana oak and Indiana limestone used throughout the structure. The cornerstone is a ten-ton block of limestone quarried in Spencer, Indiana. The four-story building is designed in the shape of a cross. A large central rotunda with a glass domed ceiling connects the four wings. With the pinnacle of the building reaching 256 feet high, it was the second tallest building in Indiana at the time of its completion. The first floor houses the governor's office and the offices of the administration. Offices for the Indiana House of Representatives are on the second floor's east side while offices for the Indiana State Senate are on the west side while the Indiana Supreme Court resides on the north end. The 70,000-volume Supreme Court Law Library is on the third floor, which also holds the House, Senate and Supreme Court chambers. On the fourth floor is the Indiana Court of Appeals courtroom. The building was added to the National Register of Historic Places in 1984 and is open for public tours during the work week. Who's statue is in front of the State House? Oliver Morton, Indiana's governor during the Civil War.",
  "This is a very attractive Capitol Building.\nWe had a great guided tour from Mindy. She had great stories to tell, and she answered all of out questions.\nThe building is beautifully decorated with paintings, sculptures and architectural flourishes. The Representative's chamber has an amazing mural of the front was and an equally impressive chandelier. The Senate Chamber is called the fishbowl because it is surrounded by three floors of windows to office areas.",
  "We took a docent tour of the Capitol which is quite a structure built in 1888, having being fully restored for it’s centennial.  Of course, there was no shortage of high quality limestone to erect the original building but it was also very cool that all three branches of government still conduct their affairs in this building.  Our tour included the inner offices of a number of senior state officials including the Treasurer.  That office suite actually has safes that were used to safeguard the state treasury."
 ]
},{
 "name": "Holliday Park",
 "address": "6363 Spring Mill Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/e5/fc/5a/ruins.jpg",
 "tags": [
  "nature",
  "parks",
  "kids",
  "eat",
  "free",
  "nature",
  "kids",
  "walking",
  "nature",
  "kids",
  "nature",
  "walk",
  "parks",
  "nature",
  "hike",
  "walking",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d2572220-Reviews-Holliday_Park-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is one of our favorite parks in the entire city.  The playground is AMAZING.  We have a 5YO and a 1YO and there is plenty of equipment for them both to play on and burn off the energy.\n\nWe also love the nature center and the walks in the woods down to the White River.\n\nIt's a great place to picnic as well!\n\nTwo little downsides--1.  No \"real\" bathrooms at the playground--just port-a-potties.  2.  Do NOT leave any valuables in your car because we see a break in on almost every visit!",
  "10 minutes from me so I am there frequently with my camera. Usually check out the bird viewing room in the nature center first. Wide variety of birds come by to eat, not to mention squirrels and chipmunks. Speaker system so we can hear the birds inside. The Nature Center is great for kids. Good hiking trails by creeks and the White River. Really pretty in the spring & fall. The \"ruins\" were recently rebuilt and are neat. And it's FREE!",
  "I like this park, used to come by here on my way home from work or on the weekends sometimes. Especially great if you have kids, there's a nature center and walking trails as well as a big playground. The ruins are nice to look at as well as the river.",
  "Indianapolis is bigger than you think it is. Indiana's state capital covers 368 square miles with more than 2 million people living in the metropolitan area. But there is plenty of green space, lots of parks. One is Holliday Park. Located at 6363 Spring Mill Road, on the city's north side, it is a 94-acre park that features a 13,000-square-foot Nature Center, one of the city's finest playgrounds, more than 3.5 miles of hiking trails, the ruins of a late 19th century building, lush gardens, a rock garden and an arboretum with over 1,200 individual trees labeled by species. And walk along the banks of the White River. The park is part of the country estate of John and Evaline Holliday, who donated the land to the city in 1916. Today, during all seasons, hikers explore the trails looking for wildflowers, birds, deer and beaver, kids revel in the playgrounds, trying to scale the rock climbing wall or one of three slide towers, visitors relish the beauty and landscaping of the gardens and anglers fish for bass and bluegill. From a historical standpoint, I was most interested in the ruins of of the St.  Paul Building, which once stood at 220 Broadway in New York City. After it was torn down in the 1950s, a competition was held to find a new home for the facade of the building and three massive statues called \"the Races of Man\" made of Indiana limestone that were designed by noted architectural sculptor Karl Bitter. Indianapolis won, proposing to place them in Holliday Park.",
  "Excellent park to hike the trails that take you through the beautiful Fall colors of the trees down to the lake. Also, the ruins were fun to explore. We saw several photographers taking photos of families. Perfect place to capture some great pictures! There was a nice nature center, and a giant outdoor playground for children. The weather was cool, which was great for hiking.",
  "Much to do. Beautiful walking paths within the woods. Picnics, ball playing, picture taking of ruins from around the world. Safe, flowers of many, a good place to stargaze. ",
  "Really great place for couples or family outings. Playground equipment separated by age groups with plenty for pre-toddlers to pre-teens. Trails are well kept and beautiful.",
  "Visited Holliday park with a friend and her 2 toddlers. It's a gorgeous park with hiking trails, playground, and picnic areas. It's very easy to get to and just minutes from downtown Indy. Will definitely go back"
 ]
},{
 "name": "Soldiers & Sailors Monument",
 "address": "1 Monument Cir",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5c/1d/4c/it-s-like-a-postcard.jpg",
 "tags": [
  "historic",
  "history",
  "history",
  "free",
  "art",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d126367-Reviews-Soldiers_Sailors_Monument-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Designed by German architect Bruno Schmitz, built over a 13-year period from 1888 to 1901 and dedicated in 1902, the Soldiers & Sailors Monument is the iconic symbol of Indianapolis, the largest outdoor memorial and the largest of its kind in Indiana. The neoclassical monument, which is 284 feet, six inches tall, 15 feet shorter than the Statue of Liberty, was built on Monument Circle, a circular, brick-paved street that intersects Meridian and Market Streets in the center of downtown Indianapolis. Originally, its purpose was to honor Hoosiers who were veterans of the Civil War. But it also is a tribute to Indiana's soldiers who served in the American Revolutionary War, the War of 1812, the Mexican-American War and the Spanish-American War. It is the first monument in the United States to be dedicated to the common soldier. The obelisk-shaped monument is built of oolitic limestone from Owen County, Indiana. It rests on a raised foundation surrounded by pools and fountains. An observation desk is accessible by stairs or elevator from the interior. The basement contains the Colonel Eli Lilly Civil War Museum, which is devoted to Indiana's history in the Civil War. The monument also features several notable outdoor sculptures, including Rudolph Schwarz's two massive limestone groupings of War and Peace and John Mahoney's bronze statues of George Rogers Clark, William Henry Harrison and former Indiana governor James Whitcomb. George Brewster's 30-foot bronze statue of Victory crowns the obelisk. Since 1962, during the Christmas holidays, the monument is decorated as an enormous Christmas tree with 4,784 lights and 52 strands of garland and is popularly known as the \"Circle of Lights.\" The monument was added to the National Register of Historic Places in 1973 and has been recognized by the American Planning Association as one of the nation's \"great public spaces.\"",
  "The Indiana Civil War Monument was first conceived in 1887.  By the time of its dedication in 1902, The Soldiers and Sailors Monument had expanded to honor all Indianans who had served not only in the Civil War but also in every conflict before WWI.  As the monument avers, Indiana sent 210,497 soldiers and sailors to the Civil War with 24,416 killed.  Indiana belligerents are also listed for American Revolution, the Mexican War, the War of 1812, the Spanish War, and Mexican Border Service (think Pancho Villa).  Standing over 270 feet tall, Indiana claims it as one of the world’s outstanding monuments.  With the year marking the start of the Civil War near its summit, the Monument remains the official state tribute to its Union defenders.  You can still climb to the top for a great panoramic view of the city or just study the numerous monumental martial statues built overhead.  Both art and a lot of history are embodied here. A small Civil War Museum (free) sits below the base while a gift shop and elevator occupy the base. ",
  "Indianapolis’ monument to fallen veterans, located in the heart of downtown, is one of the largest and most expressive of its kind. Large engraved plaques testify to the dedication and patriotism of Indiana troops from the Revolution through the Civil War (where soldiers fought to preserve the Union) through the Mexican campaign of World War I. Evocative sculptures on the monument and its supporting plinth movingly portray both steadfast courage, and the pain of separation and death. Caught in the warm light and long shadows of late afternoon, the site is a gift for photographers. An interior observation deck offering birds-eye views is open from May to October.",
  "Nice views of the downtown area once you reach the top. The elevator was out of order when I visited. 20 flights of stairs later, it was finally over. Of course, the way back down was easier. Call ahead to see if the elevator is working otherwise don’t attempt on a hot day. ",
  "Recognized as one of the world’s outstanding monuments. It’s a great place to sit and relax. You can climb to the top for the breathtaking views. ",
  "A must see place if you're visiting downtown Indianapolis.\nI you're not afraid of heights, be sure to go to the observation deck at the top for a wonderful view of the city.",
  "This is right in the middle of monument circle. There is a fountain on one side that feels really good if there is a breeze. ",
  "Never imagined Indianapolis downtown would be as clean and nice as it was. Everything was nearby in walking distance. The Soldiers and Sailors Monument, The Mall, Lots of Restaurants and just a gorgeous place to walk."
 ]
},{
 "name": "Crown Hill Cemetery",
 "address": "700 W 38th St At the corner of 38th St. & Clarendon Rd.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0a/d2/e7/crown-hill-cemetery-s.jpg",
 "tags": [
  "walking",
  "historic",
  "family",
  "family",
  "history",
  "walk",
  "tour",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d103673-Reviews-Crown_Hill_Cemetery-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Even if you don't have a loved one interred here, you will still be moved by the beautifully maintained and laid out grounds. If you go online, you can find a map pointing out gravesites of many famous individuals: President Benjamin Harrison, Vice Presidents Fairbanks, Hendricks, and Marshall, Civil War Governor Oliver Morton, Civil War hero and pharmaceutical company founder Eli Lilly, machine gun inventor Richard Gatling, author Booth Tarkington, poet James Whitcomb Riley, etc. Several of these notables are located near the impressive gothic chapel and there are many other sculptures, memorials, etc. on the grounds as well, e.g., three of the eight \"goddesses\" that once graced the old Marion County Courthouse are now here (one, Themis, is standing near the high point of the cemetery where James Whitcomb Riley is buried).",
  "Crown Hill was dedicated on June 1, 1864 & encompasses 555 acres, making it the 3rd largest non-governmental cemetery in the U.S. It is the final resting place for President Benjamin Harrison, Vice Presidents Charles W. Fairbanks, Thomas A. Hendricks & Thomas R. Marshall & the notorious bank robber, John Dillinger. The gravesite of Hoosier poet James Whitcomb Riley overlooks the city from \"The Crown\" which also provides a beautiful view of downtown. Crown Hill is the burial site for Confederate soldiers who died at Camp Morton, a prison camp located north of Indianapolis. In 1931, when industrial development around Greenlawn Cemetery required the bodies of the Confederate prisoners to be moved, their remains were interred in a mass grave known as the Confederate Mound. There is a memorial with ten bronze plaques listing the names of the 1,616 Confederate soldiers & sailors who died at Camp Morton.",
  "Yes, its a cemetery but it's well worth a visit.  A number of prominent people are buried here such as James Whitcomb Riley who is buried at the highest point in the county so, when visiting his grave you get a great view of downtown.  You can also find John Dillinger, and other famous folks.  Grounds are huge so it's a great, peaceful place for walking.",
  "When it comes to cemeteries, it isn't Arlington or Graceland or Hollywood but Crown Hill Cemetery in Indianapolis is one of a kind. Located at 700 West 38th Street, at the corner of 38th and Clarendon Road, 2.8 miles northwest of the city's center, with its main entrance at 34th Street and Boulevard Place, it covers 555 acres and is the third largest non-governmental cemetery in the United States. It was established in 1863 and dedicated in 1864 on Strawberry Hill, whose summit was renamed The Crown, a high point overlooking Indianapolis. It features 25 miles of paved road, over 150 species of trees and plants and has over 200,000 graves with services for 1,500 burials a year. It was added to the National Register of Historic Places in 1973. Among the notables buried in Crown Hill Cemetery are Benjamin Harrison, 23rd President of the United States, vice-presidents Charles Fairbanks, Thomas Hendricks and Thomas Marshall, notorious bank robber John Dillinger, poet James Whitcomb Riley, 11 Indiana governors, 12 U.S. senators, 21 Indianapolis mayors, 10 Civil War generals, 1,616 Confederate soldiers, two Congressional Medal of Honor recipients, Colonel Eli Lilly, founder of Eli Lilly & Company, Robert Irsay, former owner of the Indianapolis Colts, two-time Pulitzer Prize-winning author Booth Tarkington, four Indianapolis 500 winners and Bill Garrett, the first African-American to play basketball in the Big Ten Conference. Not to mention the eternal flame memorial. In addition, the landscape features the High Victorian Gothic-style chapel and vault, the Subway bridge/underpass, the three-arched High Victorian Gothic gateway and Waiting Station at the main entrance, the three-mile-long brick and wrought-iron fence, several family and communal mausoleums and monuments, memorials and structures designed by noted architects, landscape designers and sculptors such as Diedrich Bohlen, George Kessler, Rudolf Schwarz and Adolph Scherrer. With a map or a guide, it is an exhilarating experience to roam the cemetery to view many of the notable grave sites, mausoleums and sculptures.",
  "My family was not excited to visit this, but I was. They quickly changed their minds after we arrived. This is a huge cemetery that you can spend hours in. It was freezing the day we went so, we loved that we could drive to the spots we wanted to visit. You have to go to see President Benjamin Harrison's grave and James Whitcomb Riley's grave. We also thought the eternal flame memorial was amazing. It was a great experience for my 8 and 12 year old. Also, both graves are on Waze and Google Maps to help you navigate through the cemetery. We will most likely visit again on our next trip to Indy. ",
  "Perfect for history buffs, even better if you like a good walk through changing colors of Fall. (Neighborhood surrounding some of the location isn't ideal.  I doubt that I'd go for long walks ALONE in this area.  But so worth the trip no less.)\n",
  "Wow!  What fun!  A beautiful evening in a beautiful chapel enjoying three amazing performers do songs from Phantom.  People in charge were so friendly and helpful as we were visiting Indy for the first time in years.  Thanks Marianne for kindness shown.  Cemetery tour was really neat.  Beautiful night time view of skyline.  Truly a night to remember!",
  "A business pal of mine stopped over and we decided to go on a cemetery tour (!) on his suggestion.  I thought it odd, but it was totally worth it.  This is a gem of a cemetery with a lot of conneciton to the local history.  It's HUGE. We had great weather and nothing else to do so if that sounds like your cup of tea, I'd suggest you call and see when they have special tours."
 ]
},{
 "name": "Rhythm! Discovery Center",
 "address": "110 W Washington St Ste A Suite A",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/89/50/47/rhythm-discovery-center.jpg",
 "tags": [
  "kids",
  "learn",
  "creative",
  "kids",
  "family",
  "music",
  "music",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d1682087-Reviews-Rhythm_Discovery_Center-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place would be easy to miss because it is located under Circle Centre Mall near a Panera Bread restaurant. I wasn't expecting much, and thought this would be at best a 20 minute walkthrough. I was amazed at the array of instruments both historical and modern. There is a lot to read up on and SO many opportunities to play a variety of drums, guitars, etc... I was amazed! There are even sound studios where you can actually play instruments with many acoustical sounds! Great for children of all ages, really worth a visit. Great fun!",
  "I love that we have this creative center available. I had no idea it was even downtown and I have lived here for 15 years. It wasn't until I was invited to a toddler birthday party, that I had the privilege to experience it. My daughter was 4 and she loved it. She was able to experience playing the drums without feeling like she could only listen and watch.  They had arranged activities for the kids to learn about drums and sit in a drum circle. The kids (and grown-ups) got to also practice playing drums in the special drum room. To see what kind of drums exist around the world, priceless! Again, another great spot for birthday parties!",
  "We took our 3 teenage boys here one Sunday afternoon.  We practically had the place to ourselves.  There are hundreds of musical instruments to play.  But my favorite part was the historical pieces from famous musicians (like Rush) and other cultures.  I practically had to drag them out after two hours!  Well worth a visit and very reasonably priced.",
  "This place would be easy to miss because it is located under Circle Centre Mall near a Panera Bread restaurant. I wasn't expecting much, and thought this would be at best a 20 minute walkthrough. I was amazed at the array of instruments both historical and modern. There is a lot to read up on and SO many opportunities to play a variety of drums, guitars, etc... I was amazed! There are even sound studios where you can actually play instruments with many acoustical sounds! Great for children of all ages, really worth a visit. Great fun!",
  "This is a hidden gem for all ages.  Incredibly interactive for kids.  It's a good 1-2-3 hour activity and well worth  your time.",
  "Our family had a great time here. Our 4 boys (2-12) had an absolute blast playing all the different drums.  It was so cool that they could touch and play so many instruments. Definitely worth seeking out - since it is hidden away.",
  "Not so big, but definately worth the visit. You can spend 30 minutes or 2 hours there.\nOur 4.5 years old son loves drums, rhythm and music in general, so if he could, he would have stayed there for days.\n\nYou can touch, play, listen, and dance and it is all part of the experience.\n\nI know for a fact we will come back soon.",
  "Very informative and fun. Well worth the visit and time. An especially valuable experience for people into percussion and music. ",
  "What a unique museum, a museum that is dedicated to percussion instruments. The displays are most informative and attractive. Some percussion instruments are display only but there is a variety of hands-on experiences with actual instruments and not just drums, but, for example, chimes and marimba. The museum features sound controlled booths for playing their drum sets with the ability to vary the sound. Plus there are displays of drum sets that belonged to famous drummers. You can enhance your learning and stretch your imagination right in the heart of downtown Indy. I suggest parking at Circle Center Mall parking garage.",
  "They encourage hands-on participation with many of their instruments which is refreshing in a museum. The 10 of us were outstanding at the drum circle. Go and have some fun!",
  "Pretty small museum and at a $12 admission not really worth it.  My son who is a musician liked it the most"
 ]
},{
 "name": "Fort Harrison State Park",
 "address": "5753 Glenn Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/4e/0f/f9/fall-creek-trail.jpg",
 "tags": [
  "history",
  "nature",
  "hike",
  "history",
  "pets",
  "hike",
  "family",
  "kids",
  "hike",
  "hike",
  "history",
  "nature",
  "hike",
  "history",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d274341-Reviews-Fort_Harrison_State_Park-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fort Harrison is a beautiful State Park, whether you go to hike, bike, picnic, or go for the military history, it's a lovely little place to spend an afternoon, a few hours, or a full day. \n\nThe natural beauty is just gorgeous. Everywhere was teeming with greenery and flowers, the pollinators were very happy! I reccomend hiking in the early day or late afternoon to beat the heat of the day, it can really tire you out quickly.\n\nAlong with the natural treasures, there's also the Fort's military history as well. There's an exhibit in the nature center dedicated to the Fort's war history.\n\nSpeaking of which, check out the nature center, and see if there's any special programs available. Generally there's always something going on, so just ask!\n\nIf you're in town, or If you're in the area, than yes, I would highly reccomend you spend at least a little bit of time at Fort Harrison!",
  "Always love coming here to do hikes.  We hike out here year round.  Several trails, well maintained.  On the former military base.  Interesting history with the fact that there was a detainment camp here during WWII.  Great place to spend a weekend day hiking or for picnic.  Only downside is the fact that on several trails you need to watch out for the mountain bikers. The majority are very cautious and respect that there are walkers, families and many times pets on leashes while out on the trails, but there are many who ride far too fast around blind curves on the trails, or come up on you too fast to be able to get yourself (and pet) out of their way easily.  ",
  "For Mother's Day, all I wanted was a trip to a state park and picnic lunch with the family. They surprised me with a morning trip to Fort Harrison. What a nice little get away in the middle of the city! We picked up some maps and brochures at the visitor's center and spent the morning hiking. Nothing *too* challenging for the kiddos, but still a good time. You'd never know you were in the middle of the city, until you hit the edges of the park! All in all, a great day!",
  "This is a nice park on the far northeast side of Indy.  We went here on Black Friday for a hike with the kids and the dog.  We hiked the fall creek trail which wasn't crowded and very pretty.  It went along Fall Creek most of the way.  It is fairly easy and has a lot of stairs on it too.  There are also plenty of paced trails in case its muddy or you need to push a stroller.",
  "This is a great place to take a picnic lunch from Goose the Market and finish it up with a nice hike to work off the calories. ",
  "This is a well tended park...hiking, biking, fishing or just hanging out.  Nice trails and a well tended Mountain Bike Trail.",
  "Fort Harrison is a beautiful State Park, whether you go to hike, bike, picnic, or go for the military history, it's a lovely little place to spend an afternoon, a few hours, or a full day. \n\nThe natural beauty is just gorgeous. Everywhere was teeming with greenery and flowers, the pollinators were very happy! I reccomend hiking in the early day or late afternoon to beat the heat of the day, it can really tire you out quickly.\n\nAlong with the natural treasures, there's also the Fort's military history as well. There's an exhibit in the nature center dedicated to the Fort's war history.\n\nSpeaking of which, check out the nature center, and see if there's any special programs available. Generally there's always something going on, so just ask!\n\nIf you're in town, or If you're in the area, than yes, I would highly reccomend you spend at least a little bit of time at Fort Harrison!",
  "I was amazed by this park and loved every hour of it! There are multiple trails, some short around a mile, some longer around seven miles. There's also a tiny visitor's center with a museum of the fort's history. In regards to the trails themselves I went through three trails in total, liking the first two I went on so much I went back a few hours later to hike through them again. Go, enjoy, be outside and enjoy your day.  Entry fee was $7 unless you are a member, if I lived here I would be a member for sure!"
 ]
},{
 "name": "Indy Racing Experience",
 "address": "2 Gasoline Aly",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/df/3c/ee/indy-racing-experience.jpg",
 "tags": [
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d1526497-Reviews-Indy_Racing_Experience-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Only had 4 hours to burn before I had to head out to the airport. I enjoyed my time, it was not expensive and it is very much in the spirit of racing and the city. ",
  "I had the pleasure of riding with Mario Andretti in May of 2018 at the motor speedway and it was quite a thrill.  As a police officer, I have been in high-speed vehicle chases, but this is a whole different level of speed.  You won't get to the full potential of the car, but you will get 75% there and you will most definitely be trying to help the driver find the brake pedal as you enter turns and you will be fighting the g-force that you have not experienced.  Imagine that for 200 laps!  Maybe you will luck out and get Mario.  You'll be amazed at how casual these driver's handle what is likely boring for them.",
  "I grew up and lived near when younger. the sounds of the cars are one memory you'll never forget. even if they're onlt doing tire testing it's very cool. ",
  "The two-seater IndyCar ride run by Jeff, Joe and Scott smooth and very safe operation has been providing thrills to thousands of speed fans for the last 15 years. Imagine going around the legendary Indianapolis Motor Speedway being driven by a top IndyCar driver, maybe Mario Andretti. Unforgettable.",
  "I did this and I got to ride with Mario Andretti.  It was on my bucket list and I will never forget it.  180 MPH+ for 3 laps around the world famous Indy 500 oval with Mario!!!  What more could a race fan ask for?!!  The personnel were very organized and made sure everyone had a great time.  An experience of a lifetime for sure.  DO THIS -- YOU WON'T REGRET IT."
 ]
},{
 "name": "Oldfields-Lilly House and Gardens",
 "address": "Indianapolis Museum of Art  4000 Michigan Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/be/e9/36/oldfields-lilly-house.jpg",
 "tags": [
  "nature",
  "sampling",
  "family",
  "library",
  "historic",
  "art",
  "kids",
  "walk",
  "history",
  "family",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d1182171-Reviews-Oldfields_Lilly_House_and_Gardens-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went here when we were viewing the Christmas lights in the grounds. The house was decorate with paper chains, paper ornaments, etc. Beautiful!!\n\nWe used to take our 3 girls to the grounds around the house on a regular basis. They loved running around the grounds and we had picnics in the grass around the Lilly pond. Highly recommend!!",
  "My wife and I love to visit old homes, especially antebellum mansions in the Old South. So we were pleasantly surprised to discover Oldfields, better known today as the Lilly House and Gardens, in Indianapolis. Located at 4000 Michigan Road in the Newfields campus, adjacent to the Indianapolis Museum of Art and the Virginia B. Fairbanks Art and Nature Park, it is a 26-acre historic estate and house museum, an extraordinary example of the American country house movement of the late 19th and early 20th centuries. Built between 1909 and 1913 by architect Lewis Ketcham Davis for the family of Hugh McKennan Landon, it was sold in 1932 to Josiah K. Lilly Jr., the late Indianapolis businessman, collector and philanthropist, who renovated and expanded the estate throughout the 1930s and 1940s. Today, the 22-room mansion is open to the public. It reflects the 1930s era when the Lilly family occupied the house. It includes a service wing, pavilions on the east and west sides with access to balconies from the second floor and a large terrace atop a garage and service area. Today, the house features eight furnished historic rooms on the main level, including the stair hall, great hall, game room, library, drawing room, loggia, dining room and kitchen. Nearly 90 percent of the furnishings and objects are original to the house and were used by the Lilly family. The upper level features historical and interactive exhibits detailing the American Country Place era, the development of a country estate and Indianapolis in the early 20th century. It also includes a sampling of Lilly's collections of books, gold coins, military miniatures and nautical items. The gardens and grounds, which featured a tennis court and greenhouse, are rare examples of a preserved estate landscape designed by Percival Gallagher. The estate was added to the National Register of Historic Places in 2000 and designated a National Historic Landmark in 2003.",
  "We come here to walk around multiple times a year with the kids.  The house is neat to walk around in and the garden is beautiful.  ",
  "Very nicely preserved and a lot more access than at some historical sites. Great family history. Nice decorations change throughout the year. Christmas is really special!",
  "The mansion is right behind the Indy art museum. It is beautiful on the inside and gives you a glimpse of life in the 1930s."
 ]
},{
 "name": "Indiana Historical Society",
 "address": "450 W Ohio St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e1/5e/3f/indiana-history-center.jpg",
 "tags": [
  "history",
  "music",
  "eat",
  "learn",
  "history",
  "historic",
  "walk",
  "history",
  "library",
  "delicious",
  "free",
  "kids",
  "history",
  "history",
  "family",
  "walk",
  "history",
  "music",
  "food",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d110138-Reviews-Indiana_Historical_Society-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Indiana Historical Society, founded in 1830, is one of the oldest and largest historical societies in the United States. Located at 450 West Ohio Street, in White River State Park, within the Eugene and Marilyn Glick Indiana History Center in downtown Indianapolis, it describes itself as \"Indiana's Storyteller\" and is the oldest state historical society west of the Allegheny Mountains. The museum's mission is to collect, preserve and share the history of Indiana, much more than basketball and the Indianapolis 500. Its collection includes 1.7 million photographs, 45,000 printed items, 14,000 pieces of sheet music, 5,450 manuscripts, 3,300 artifacts, 1,700 maps and 129 paintings. More than 70,000 digital images representing 61 collections are available through the society's website. Such as a 130-year-old Bible used in 2008 to swear in Mayor Greg Ballard of Indianapolis and an original glass-plate negative of an Abraham Lincoln photograph taken by Alexander Gardner just weeks before Lincoln delivered his Gettysburg Address. Other subjects include architecture, agriculture, Civil War, business, education, families, government, journalism and notable Hoosiers. Be sure to visit the Cole Porter Room, dedicated to the life and legacy of American composer and songwriter who was born in Peru, Indiana. See the Tony Award he won for Kiss Me, Kate, his most famous Broadway show, and listen to a singer perform a variety of Porter's songs, including Night and Day and Begin the Beguine. ",
  "We visited on a crisp weekend morning - the sun was shining brightly, the sky a cloudless blue, and the water in the canal a brilliant green (it was after all St. Patrick's Day weekend), so the perfect time to learn about Indiana history (okay, so we have a strange tastes in spare time activities).\n\nAnyway, we'd heard that the IHS had a new exhibit on the Angel Mounds archaeological dig in the late 1930s, so we thought we'd check it out. Angel Mounds was the site of a Native American village near present day Evansville that was occupied from roughly 1100 to 1450 A.D. When modern improvements to the area threatened to destroy the site in the 1930s, Eli Lilly made an endowment to the IHS to purchase the, then, farmland to preserve it (it eventually was passed onto the state and today is a State Historic Site and definitely worth a visit). \n\nThe current exhibit is in the \"you are there\" series that the IHS uses to immerse visitors in a historic event or period, in this case the aforementioned dig in 1939. The way this works is a door opens and the visitor steps into effectively a stage set complete with panoramic photos on the walls to show the site as it appeared at the time centered on the dig site in the foreground complete with props and actors portraying known individuals associated with the operation who converse and answer questions from the visitor in character. In this case, we were talking with Glenn Black, the archaeologist who led the dig, as well as a woman portraying the WPA, the New Deal public works project that provided the labor for the dig, case manager who supervised this labor force. As hokey as this sounds, this actually works to a reasonable degree.\n\nOnce the visitor is satiated by the conversation with these characters, they can go back to the museum proper and an exhibit with additional information panels, artifacts, photos, etc. on the dig and the culture it was studying. Combined, a pretty fair picture of the process of exploring this site and its historical significance emerges.\n\nNext door to the Angel Mounds exhibit was another looking at a completely different subject, the story of professional football, i.e., the Colts, in Indianapolis. This is not a \"you are there\" experience, but rather something more conventional, with photos, videos, and even hands on exhibits including a video game. We thought it was very well done, even though it covered pretty familiar ground for the most part. However, it is definitely very kid friendly, which may be what they were aiming for (doubt too many 10-year-olds would get that worked up about an archaeological dig in the 1930s, but let them play a video game featuring \"Blue\" and they probably will eat it up).\n\nOf course, the permanent exhibits are still here - the Cole Porter Lounge, etc. - and no visit here is complete without stopping in the gift shop/bookstore. We always walk out with an armful of new history books and today was no exception. Overall, we had a pretty good time and learned something too.",
  "We were recently invited to attend a special event in the Frank and Katrina Basile Theater at the Indiana History Center, a lecture by Prof. Peter Carmichael on the personal side of the Battle of Gettysburg and the Civil War in general. Carmichael, a noted Civil War historian at Gettysburg College and an Indianapolis native, discussed the letters of Capt. David Beem of the 14th Indiana and his wife. Beem's unit was heavily engaged at Gettysburg, most notably in the Union defense at Cemetery Hill. This was just the starting point as Carmichael expanded his discourse to examine the often opposing views of Beem and his wife throughout the war and the larger debate on the home front in general as the carnage mounted. \n\nThe lecture and the Q and A session afterwards with the capacity audience was very informative and enjoyable. The entire evening was quite nice starting with drinks and hors d'oeuvres before the lecture, as well as a preview of the new interactive \"you are there\" exhibit on the Beem family's Civil War experience, centering on the receipt of Capt. Beem's letter from Gettysburg. They even kept the gift shop open so we could pickup a couple of interesting new history books.\n\nSurprisingly, there was no charge to attend, other than our membership in the IHS which we've had for many years. While we're not always a big fan of their interactive exhibits, we do like their publications, research library, and, of course, special events such as this.",
  "This is a wonderful local museum with lots of character and interesting exhibits. They make full use of their large space and are right next to the canal. With a delicious cafe on the canal level, it's worth the trip! Has a parking lot too, with reasonable pricing.",
  "A nice looking building with some interesting exhibits. Not as much to see or do as other attractions in the city. Free entrance so worth going to see what's on when you're visiting. ",
  "If you are into history this is a great stop. There isn't much for kids to when its not the holiday season.  Older kids may like some displays.  The Christmas Story display was great!",
  "I love the interactive parts of the museum, that help make learning history more real. I've gone several times to the museum to walk through different rooms they've created, seeing different stories recreated, and acted out. I also love going to the Indiana Historical Society every year around the holidays to see The Festival of Trees, it's become a tradition with my family and some of my friends too.",
  "The Indiana Historical Society, founded in 1830, is one of the oldest and largest historical societies in the United States. Located at 450 West Ohio Street, in White River State Park, within the Eugene and Marilyn Glick Indiana History Center in downtown Indianapolis, it describes itself as \"Indiana's Storyteller\" and is the oldest state historical society west of the Allegheny Mountains. The museum's mission is to collect, preserve and share the history of Indiana, much more than basketball and the Indianapolis 500. Its collection includes 1.7 million photographs, 45,000 printed items, 14,000 pieces of sheet music, 5,450 manuscripts, 3,300 artifacts, 1,700 maps and 129 paintings. More than 70,000 digital images representing 61 collections are available through the society's website. Such as a 130-year-old Bible used in 2008 to swear in Mayor Greg Ballard of Indianapolis and an original glass-plate negative of an Abraham Lincoln photograph taken by Alexander Gardner just weeks before Lincoln delivered his Gettysburg Address. Other subjects include architecture, agriculture, Civil War, business, education, families, government, journalism and notable Hoosiers. Be sure to visit the Cole Porter Room, dedicated to the life and legacy of American composer and songwriter who was born in Peru, Indiana. See the Tony Award he won for Kiss Me, Kate, his most famous Broadway show, and listen to a singer perform a variety of Porter's songs, including Night and Day and Begin the Beguine. ",
  "We really enjoyed the Christmas trees decorated by various institutions throughout the museum. We also really enjoyed the Madam Walker exhibit. Definitely makes us want to read more about her life and career. Well done!",
  "Our 1st time at IHS and it was s great venue.\n\nI had read other reviews that mentioned the caterer being terrible but our event food was outstanding.\n\nThe chicken breast & the slider burgers were absolutely great. Cold sandwiches,  small veggies with dip were terrific. \n\nBeautiful venue, a classy bar area in the rear of the lower level was used for the event as well.\n\nAll in all it was a fine evening in a well planned & beautiful venue.",
  "Dad (78) & I stopped by & weren't sure what to expect even after the front desk staff tried to explain it.  We went to explore & found it VERY cool.  They have the story, very in depth with supporting documents and THEN you get to MEET the individuals.  They are in character & are amazing to talk to.  We were told that they rotate except for the Cole Porter exhibit.  In there is a wonderful singer who will regale you with songs & tell you his story.  My dad enjoyed that a lot.  It was great they had a place to eat there too, it is a bit pricey but was nice to have it there.  The clocks that go backwards are a set up for what you get inside.  Not your regular boring museum at all."
 ]
},{
 "name": "Indiana State Fairgrounds",
 "address": "1202 E 38th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/18/c9/70/indiana-state-fairgrounds.jpg",
 "tags": [
  "walk",
  "food",
  "family",
  "music",
  "unique",
  "family",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d7092430-Reviews-Indiana_State_Fairgrounds-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was an exhibitor at this show but also had the opportunity to walk the show . There was a good selection of exhibitors and\nfood vendors. Plenty of parking and shuttle service.",
  "Expensive to visit...8.00 just to park.  Add the admission prices to different events...hard to bring a family to enjoy the events.  Shuttle buses will pass people waiting at the stops...may not even slow down to pick them up...buses may only have 2 or 3 people on them.",
  "Fun for everyone involved.\nI sure am glad I don’t have to take those lights down after the holidays!!",
  "We did not know what to expect being the first time they did these. It was so awesome.  Everything was set to the music. It was a very long drive thru there. this is such a good deal for the money\n I highly recommend ",
  "Stewart flea markets operate in Indiana and Kentucky.  Entry to the flea marker is free, but the fairgrounds fee is now up to $8.  (Not worth it)  It's called a flea market, and that's pretty much all it is.  Years ago there were decent flea markets here every month.  Now, it's just this one, Thanksgiving weekend, and in only 1 building (was 3-4 for the holidays).  Contents were about 60% Dollar Tree or Family Dollar type merchandise.  Only about 3 rows of antique, collectible, or unique items.  You could buy most of this stuff on e-bay or dollar store and save the fairgrounds parking fee.\n Scott calls theirs an antique market - (same weekend in Columbus, OH) and worth the trip."
 ]
},{
 "name": "Indiana Repertory Theatre",
 "address": "140 W Washington St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/0f/13/c7/indiana-repertory-theatre.jpg",
 "tags": [
  "theatre",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d209352-Reviews-Indiana_Repertory_Theatre-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "Took 12-yo granddaughter to see Christmas Carol. We sat close to stage and could see very well.  She was totally enthralled with acting, singing and choreography.  Planning to return in Feb to see The Watsons.",
  "The best I've ever seen in Indianapolis they are the greatest, I will always go to see their  dancing, it is the greatest.",
  "Always a great experience, always consistent and well worth it. IT is very reasonable and well worth it. Beautiful Theater",
  "Surprised my husband on his birthday and took him to this theatre, first time for both of us, not only was it a surprise for him, but for me as well. We were very impressed, nice building, beautiful in side, great show.",
  "Architecturally a main theatre, a wonderful venue downtown. The staff does a great job. They have a wide range of drama and the actors do first rate performances."
 ]
},{
 "name": "The Fashion Mall at Keystone",
 "address": "8702 Keystone Xing",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c9/a1/4a/the-keystone-fashion.jpg",
 "tags": [
  "free",
  "food",
  "structure",
  "field",
  "art",
  "food",
  "eat",
  "walk",
  "food",
  "free",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g37209-d4492561-Reviews-The_Fashion_Mall_at_Keystone-Indianapolis_Indiana.html",
 "source": "TripAdvisor",
 "reviews": [
  "New York has Fifth Avenue, Chicago has the Magnificent Mile, Beverly Hills has Rodeo Drive and Palm Beach has Worth Avenue. Indianapolis has the Fashion Mall at Keystone. Opened in 1973, the 710,587-square-foot space is the premier luxury shopping destination in Indiana. The two two-story buildings feature 123 stores that are linked by a glass archway called \"The Crossing\" that also serves as a food court. Located at 8702 Keystone, off I-465 at 86th and Keystone, in the northeast section of the city, it is anchored by two high-end stores, Saks Fifth Avenue and Nordstrom. Other upscale retail stores in the mall include Tiffany & Co., Crate & Barrel, Burberry, Kate Spade, Ann Taylor, Gap, Coach, Chico's, Brooks Brothers, Talbots, Tommy Bahama, Vera Bradley, White House/Black Market, Michael Kors, Louis Vuitton, J. Crew, Banana Republic, Abercrombie & Fitch, Apple, Microsoft, Kendra Scott, Raleigh Limited, Allen Edmonds, Victoria's Secret, Pottery Barn, Papyrus, North Face and Johnston & Murphy. Hungry? Looking to take a lunch break from shopping? There are plenty of restaurant options, including Sullivan's Steakhouse, Maggiano's Little Italy, TFI Friday's, Shapiro's Deli, Seasons 52, Cheesecake Factory, Napolese Pizzeria, Public Green Urban Kitchen, Mimi Blue Meatballs, Chipotle Mexican Grill and Starbucks. Plenty of free parking and restrooms, too.",
  "Being old farts, we've been coming to this area since Keystone-at-the-Crossing was a lone award-winning wooden structure in an empty field. After it burned down, the area has remorphed numerous times to its present ongoing high-end incarnation. \nA great selection of upscale shops through which to browse and wish. We've enjoyed experiencing VR at Microsoft, discussing the art of Dr. Seuss,  admiring the craft of Tiffany,  wondering at multiple  clothing trends, wandering rooms at Restoration Hardware, comparing teas, chocolates, etc, etc, etc...\nAnd, if one cannot find a way to tempt oneself with a tasty indulgence; one simply is not trying.\nThere are healthy food options; but there is also a wonderful NY pastrami Reuben at Shapiro's Deli, dessert (or a meal) at Cheesecake Factory, chocolates at Godivas, on and on.\nAll and all, this is a great place to spend a few hours, or a few days (with plenty of places to just sit, rest and watch the great human parade--with their noses in their phones).\nFor those who enjoy upscale, retail shopping; this is one of Indy's best options. ",
  "No visit is complete without a trip to the Mall. The Keystone Fashion mall is new since I was last in this area. Lots of good stores, many places to get something to eat pleasant to walk around. ",
  "The Fashion mall is a nice mall. But just nice.\n1 thing I liked the most, is that it's very good when you visit with children, as they have things to do and play while hanging around.\n\n3 things I wish were better:\n1. Food court is big with many places to sit, and clean, but not many restaurants to choose from.\n2. Almost all the bathrooms were out of order!\n3. Variety of stores is nice, but still lacking some of the major popular companies and brands.\n\nAll in all, a nice, clean and children friendly but they need to have more brands and make sure that the restrooms are in order!",
  "New York has Fifth Avenue, Chicago has the Magnificent Mile, Beverly Hills has Rodeo Drive and Palm Beach has Worth Avenue. Indianapolis has the Fashion Mall at Keystone. Opened in 1973, the 710,587-square-foot space is the premier luxury shopping destination in Indiana. The two two-story buildings feature 123 stores that are linked by a glass archway called \"The Crossing\" that also serves as a food court. Located at 8702 Keystone, off I-465 at 86th and Keystone, in the northeast section of the city, it is anchored by two high-end stores, Saks Fifth Avenue and Nordstrom. Other upscale retail stores in the mall include Tiffany & Co., Crate & Barrel, Burberry, Kate Spade, Ann Taylor, Gap, Coach, Chico's, Brooks Brothers, Talbots, Tommy Bahama, Vera Bradley, White House/Black Market, Michael Kors, Louis Vuitton, J. Crew, Banana Republic, Abercrombie & Fitch, Apple, Microsoft, Kendra Scott, Raleigh Limited, Allen Edmonds, Victoria's Secret, Pottery Barn, Papyrus, North Face and Johnston & Murphy. Hungry? Looking to take a lunch break from shopping? There are plenty of restaurant options, including Sullivan's Steakhouse, Maggiano's Little Italy, TFI Friday's, Shapiro's Deli, Seasons 52, Cheesecake Factory, Napolese Pizzeria, Public Green Urban Kitchen, Mimi Blue Meatballs, Chipotle Mexican Grill and Starbucks. Plenty of free parking and restrooms, too.",
  "A great Mall if you like Shopping.  A destination in its own right with everything you want under the same roof.  \n\nGood parking, restrooms, etc. ",
  "This mall had a lot of great stores to explore but I didn't see any maps of the whole mall to get around.",
  "The shops at the Fashion Mall at Keystone all are high end stores. If you can't find it here, you can't find it. It is somewhat difficult to get in and out, but drive past Keystone east on 86th Street. There are lots of parking spaces, and the mall is handicapped friendly. There are plenty of good restaurants in this mall as well! Worth going and checking out!"
 ]
}]
