[
{
 "name": "Mississippi Civil Rights Museum",
 "address": "222 North Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/1e/a8/e5/mississippi-civil-rights.jpg",
 "tags": [
  "history",
  "free",
  "history",
  "history",
  "unique",
  "art",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d13382408-Reviews-Mississippi_Civil_Rights_Museum-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "This part of the two museums complex. One covers the civil rights movement with a strong focus on the events in Mississippi in the turbulent 1960s while the second museum covers the history and development of Mississippi from territory to state through to modern times. The civil rights museum is compelling and uses multiple story telling techniques. There is video from the time – used for example to tell the story of Medgar Evers a civil rights leader who was assassinated. Also lots of audio clips from people in the past and display after display with photos, storyboards, and newspaper clippings and other memorabilia and artifacts from the time. This is a violent story, not least being the Klan’s killing of three activists in 1964 and the subsequent national focus on local events. Fascinating, interesting, compelling and relevant still.",
  "FREE THIRD SATURDAYS\nAdmission to the Mississippi Civil Rights Museum and the Museum of Mississippi History is free on the third Saturday of every month. \n\nThis is a great place to start if you are arriving in Jackson. The collection is incredible and I recommend spending a couple hours here.",
  "This is a museum about the African American struggle in Mississippi.  Even as someone pretty well-read on African American History, this was eye opening. Every gut wrenching story or activity of the civil rights involed Mississippi,  from Emmett Till, Freedom Riders, the missing civil rights activists,  Medgar Evers, Fannie Lou Hamer,  Stokely Carmichael and so forth is here.The Museum features mini theaters which are the most powerful.  I want to re-read the entire civil right movement after visiting the museum . Many of attendees were children from school trips , it was interesting to watch their reactions.Its worth a trip to Mississippi",
  "The Mississippi Civil Rights Museum is one of four fabulous museums we visited over the past two weeks—-Birmingham, Montgomery, Memphis, and Jackson. All are fabulous and all are unique one to the other. The museum makes a valuable contribution to understanding a sad part of America’s past. Put it on your must do list.",
  "Spent 90 minutes at this incredible and moving exhibition. Quality of exhibits and the stories told were excellent. Don’t miss a visit to this facility.",
  "I had the wonderful experience of visiting the Mississippi Civil Rights Museum in downtown Jackson MS.  It was an overwhelming, moving, and educational experience.  The museum staff members were professional, cordial, and so friendly and helpful.  The exhibits are artistically presented with sound and other effects.  I really felt a real sense of actually living the historical moments that were visited.  This is far, one of the best civil rights museums I have ever visited.  Great job City of Jackson and the state of Mississippi.",
  "This was my second time through the Mississippi Civil Rights Museum in Jackson.  Once again, I walked away totally blown away at the impact it had on me.  I was moved emotionally...learned things intellectually...touched deeply....motivated to go out into the world and make a difference in response.  Brilliantly conceived and created to give visitors an experience that they will never forget.  I know I won't.  Two tips...1)  Allow a few hours+ to experience all there is there.  Don't rush through!  2)  Be sure and spend some time in the center of the museum. There you will find a beautiful space full of sound and lights and art and photographs and quotes where you'll be able to process and think through all you've seen and felt.  ",
  "Went to the museum on free Saturday, Although it is a great museum-it was very hard to see anything because the amount of people in there made it impossible to enjoy. We did not plan going on the free day - it just worked out that way and I wouldn't recommend it.But it is a very informative museum."
 ]
},{
 "name": "Mississippi Museum of Natural Science",
 "address": "2148 Riverside Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/84/fb/bb/explore-an-entire-wall.jpg",
 "tags": [
  "family",
  "walk",
  "nature",
  "walking",
  "kids",
  "walking",
  "family",
  "nature",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d109484-Reviews-Mississippi_Museum_of_Natural_Science-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had taken my students there and they enjoyed it so taking my family was even more fun. The exhibits are interactive and explain a lot about MS. There’s a swamp with live animals including alligators, fish, snakes etc. There are also multiple trails to walk on. The dinosaur room was incredible.",
  "A very nice and educational experience.  The exhibits are very well thought out and displayed nicely.  Some exhibits include fossils and dinosaur bones found in various regions of Mississippi. Other exhibits offer examples of the various wildlife and fish that exists throughout the state today. It is definitely worth the time and entry fee.",
  "We visited with our 5-year who has been asking to go to an aquarium for more than a year. The displays that showed all the different types of aquatic environments in Mississippi were well thought out. We happened onto the giant wall tank at exactly the time of their feeding. It was fascinating to watch. Even better the wildlife biologist who cares for the fish stopped by. We spent about 15 minutes chatting with him. He had so much knowledge to share and it was clear he loved the fish and his job. The nature trails were great and a lovely place to let our kid burn off some energy.",
  "Great place to visit with a lot of information in the museum.   Many displays and aquariums for the kids.  The trails outside are also fun, but be sure to wear good walking shoes and carry water and a snack, as some are quite extensive.",
  "My son (6) and I loved the exhibits. Lots of cool fish and little alligators and turtles. So much to see and do! \n\nIf it's nice out, I suggest wearing tennis shoes and walking the trails out back down to the swamp area. My son loved seeing the trees growing underwater and the moss.",
  "Very interesting.  May be best visited in the Spring when you can enjoy the outdoor trails.  Lots of interesting things inside though a bit dated.  Fun for a few hours and shares a parking lot with a super nice park.",
  "Great educational experience. My family comes here monthly to enjoy educational sites and experiences. The store is a plus and the admission price is worth it! ",
  "I wasn’t expecting much from a smaller museum, but ended up having a great time.  After enjoying the exhibits, there are hiking trails from easy to challenging.  ",
  "I’ve been here multiple times. There is always something new and exciting to see! I recommend doing the nature walk path to the park during the springtime. It is beautiful!",
  "The exhibits that they bring here are outstanding and well worth the trip. Excellent staff and facility!",
  "There were plenty of things to see and discuss with another adult on a date. Also cool just to get kids out of the house. I’d go again"
 ]
},{
 "name": "Mississippi State Capitol",
 "address": "400 High St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/f8/81/cd/capitol.jpg",
 "tags": [
  "tour",
  "historic",
  "drink",
  "tour",
  "structure",
  "historic",
  "history",
  "tour",
  "tour",
  "history",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d105887-Reviews-Mississippi_State_Capitol-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Having toured 35 statehouses, I will attest that Mississippi’s state capitol building is one of the best.  Upon entering, after passing through security, look up to see the gorgeous dome; then, look around to drink in the stonework, staircases, and elevators.  We were fascinated with the old water fountains.  At the tour desk behind the staircase, ask for a tour – the docents are very friendly and informative – we enjoyed a great tour!  Not only does the building have a beautiful central dome, each of the legislative chambers has a gorgeous ceiling of its own.  This building, built for a million dollars more than 100 years ago, was funded with tax dollars from the railway companies.  The beautiful building will continue to serve its state well for many years.  Don’t miss the portraits of the former governors – one of them is the great, great-grandfather of actor/comedian Robin Williams.  If you tour only one historic site in Jackson, this is the best one.",
  "When in Jackson, MS, spend a few hours touring the Capitol, an absolutely beautiful building (listed on the National Register of Historic Places) with its stained glass windows and domes, and sculpted marble. You can tour on your own or take a guided tour. Either tour details the State Capitol’s history, its magnificent architecture, and provides an up-close look inside the chambers of the Senate and House of Representatives. Don't miss this gorgeous structure!",
  "This is a beautiful capital building and if you have the time you can take the guided tour to receive a lot of great information. ",
  "Enjoy the beautiful tour, decor, and staff. The workers are focused, professional, and friendly.. good old Mississippians.",
  "One of America’s great state Capitol buildings. Full of history and a brilliant architectural achievement. \n\nIf you are in Jackson this is a must stop.\n\nGo enjoy!",
  "Lovely architecture and some interesting exhibits inside. Enjoyed it.Went on a Friday afternoon - parking wasn't bad and it wasn't very busy.",
  "Had read about the Capitol before visiting and so glad we did.  The pencil hanging from the ceiling in the Senate chamber from the 1970 bomb, bullet hole in column from Huey Long assassination were pieces of history we wouldn’t have known about.  The observation floor gave a wonderful view of the area.  The state employees were so friendly and helpful.  It was a great stop!",
  "We have traveled to a lot of cities across the country and seen a lot of state capitols.  The state capitol of Mississippi is also a marvel of architectural design and we loved riding by it and seeing the amazing people working for the state hard at work.  We decided not to take the tour due to time restrictions."
 ]
},{
 "name": "Medgar Evers Home",
 "address": "2332 Margaret W Alexander Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/2b/70/01/jackson.jpg",
 "tags": [
  "history",
  "tour",
  "tour",
  "history",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d286679-Reviews-Medgar_Evers_Home-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very moving to be on the site.  We just stopped by on the way to lunch on a random Sunday.  So glad to share this history lesson with my son. ",
  "The house was out of our way to visit, but we felt it was a necessary one.   You can make arrangements to have a tour, but we didn’t know that prior to visiting.  Another stop we are glad we made.",
  "I was very fortunate to have Tony Bounds as my tour guide.  He is an instructor at a couple of colleges and really knows the history on Medgar Evers, civil rights history and African American history.  He gave me great insights.  This visit was one of the major highlights of my entire trip.",
  "We only drove by here - it was not open.  Evidently you have to make arrangements in advance to get in.  I understand that the tour is very interesting but we were not able to do it.",
  "As far as I know, this is not a site open for tours. We just parked and took pictures. As I was standing there, I reflected on how brave this young family man was in his quest for freedom."
 ]
},{
 "name": "Mississippi Children's Museum",
 "address": "2145 Museum Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/ef/1a/63/mississippi-children.jpg",
 "tags": [
  "art",
  "theatre",
  "kids",
  "kids",
  "kids",
  "kids",
  "family",
  "kids",
  "walk",
  "family",
  "art",
  "theatre",
  "kids",
  "learn",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d2010240-Reviews-Mississippi_Children_s_Museum-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum is amazing!  I cannot day enough about how much we all enjoyed the exhibits. The whole museum is interactive and encourages play and learning. There was an Eric Carle exhibit there when we visited, along with a slide down the huge staircase. They have art rooms, a rock climbing wall, a giant scrabble board, a puppet theatre, a tug boat that children can climb through, water works where you race boats you make, tunnels, construction equipment the kids can use, legos, a car to fuel up and check the tires, renewable energy games, derby races, a rock query, human digestive play area, muscle man, skeleton they can move, and so much more.",
  "This is a small museum; but packed with fun things for kids to experience.  Good for toddlers to pre-teens.  Lots of hands on exhibits.",
  "Very well designed and thoughtful for children, with oodles of hands on activities, my 10 year old granddaughter spent most of two days there! Things to do for kids two and up.",
  "Love this museum! My child asks to go every week. They have a lot of things to keep children engaged. Keep in mind it gets very busy especially on the weekend. Overall great place for kids",
  "We became a member of the MS Children's museum after attending a birthday party there. We were so impressed, that we actually just celebrated my son's 3rd birthday there. You have to be a member to have a party. It is only $80 per year for a family of 3. Not bad at all. It is great for rainy days. Saturdays tend to be VERY crowded. The best time to visit is during the week or on Sunday, when they open at 1. The activities are really geared toward kids of all ages. If the child can walk, he/she will have fun here!",
  "This is an artistic marvel for the entire family!  And the gift Shop is reasonable.  Not to be missed - bring a lunch to enjoy in Lefleur’s Bluff Park!",
  "My seven year old loved the children's museum!! Will definitely be back. Could havw easily spent the day",
  "We had a good time. Wish they would change up some it would make it more inviting to revisit more. We would go more often",
  "This museum is amazing!  I cannot day enough about how much we all enjoyed the exhibits. The whole museum is interactive and encourages play and learning. There was an Eric Carle exhibit there when we visited, along with a slide down the huge staircase. They have art rooms, a rock climbing wall, a giant scrabble board, a puppet theatre, a tug boat that children can climb through, water works where you race boats you make, tunnels, construction equipment the kids can use, legos, a car to fuel up and check the tires, renewable energy games, derby races, a rock query, human digestive play area, muscle man, skeleton they can move, and so much more.",
  "I love this place so much!! You can easily be here for 4hrs and the child is completely engaged. There are so many interactive exhibits and things for the children to do as well as learn",
  "This beautifully planned museum provides a solid civil rights lesson while capturing the culture and harsh life of the African Americans living in slavery. The design of the exhibits is centered around a lighted ceiling sculpture which is a beautiful tribute to the spirit of the folks honored in this museum. Not only did I learn a great deal from meandering through the exhibits but the Curator, a young man who is very much prepared for the role, personally shared the details beyond the visuals. His passion and knowledge were quite inspiring. This is a must see requiring at least a half day to fully enjoy."
 ]
},{
 "name": "Old Capitol Museum",
 "address": "100 S State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/55/37/58/photo0jpg.jpg",
 "tags": [
  "history",
  "tour",
  "history",
  "organized",
  "free",
  "tour",
  "history",
  "free",
  "history",
  "history",
  "walk",
  "free",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d109481-Reviews-Old_Capitol_Museum-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "So much history packed into just 200 years. Great staff, well informed, happy to help Brits understand the way the Capitol worked and the set up of US politics, state and federal. ",
  "Self guided tour about Jackson's history.  Numerous displayes and narratives.Well worth the hour we spent there.",
  "The old capital museum is well organized and displays are meaningful with some hands on.  The senate and supreme court chambers demonstrated the conflicts that existed, A small tidbit was one of the governors was a great grandfather to the actor Robin Williams.  Well worth the time to visit.",
  "This is a free attraction. It is self-guided so you can travel through the museum at your own pace. There are several brochures that have questions about each exhibit so you really get the most out of your visit. The old capitol is beautifully restored and the architecture is a big part of the experience.",
  "We took a self guided tour through the exhibits and old senate and supreme court chambers.  They do a good job in explaining the conflicts, major events and milestones. \n\nIt is well worth the time to explore the history of this state. ... and get a sense of remaining challenges.\n\nEasy parking behind the building.  The tour is free of charge.",
  "This is a great place to visit for a bit of local history.  The friendly volunteers at the counter give you a useful map and welcome conversation.  There's not a massive amount to do around Jackson, so I certainly recommend a visit to the Old Capitol.",
  "The Old Capitol building and its restoration is interesting.  They did a nice job of identifying state historical figures, even fairly obscure ones.  To a native this is probably more meaningful than to a visitor.  A visitor can probably see what they care about in an hour.",
  "So much history packed into just 200 years. Great staff, well informed, happy to help Brits understand the way the Capitol worked and the set up of US politics, state and federal. ",
  "While the displays are average, the architecture alone makes this a great place to visit and walk around.  We went after going to the current capitol building and the governor's mansion, and it was fun to compare the styles.",
  "The Old Capitol is a beautiful Greek revival architecture building.   Worth the visit although the displays are a little weak.  It’s free so a good option if in Jackson. ",
  "I am not a big history buff, but my husband is. With saying that we both really liked visiting the museum! The layout was very well thought out and easy to maneuver. The architecture is breath taking. I love how they did all they could to bring back the original work of the building. They were still doing exterior work on the building, but it was still safe and easy to enter. The information contained in the walls is amazing and must have really taken some time to put together into one place. The buildings history is awesome in itself. I highly recommend this be a stop on your visit to Jackson! Admission was free."
 ]
},{
 "name": "Mississippi Museum of Art",
 "address": "380 S Lamar St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/74/4f/39/mississippi-museum-of.jpg",
 "tags": [
  "art",
  "free",
  "tour",
  "organized",
  "field",
  "family",
  "art",
  "free",
  "eat",
  "art",
  "unique",
  "walk",
  "tour",
  "unique",
  "knowledgeable",
  "art",
  "art",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d286673-Reviews-Mississippi_Museum_of_Art-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Toured the Mississippi Museum of Art with friends for a fun time at a beautiful facility.  There were several exhibits and we loved the interactive portions the best. We made silhouettes of each other for something to remember our tour. Best of all this gem of a tour is free. ",
  "It was spacious and well organized. I loved the quilt exhibit based on slavery times--very bold. Also featured was a MS born native American artist that was very interesting. Depending on your level of interest you can probably make it through thi exhibit in about an hour. ",
  "I have been to the museum a dozen times. By myself, with my family, with friends, and brought my class on a field trip. Something new and magical everytime!!! Amazing permanent collection and awesome changing exhibits",
  "The MIssissippi Museum of art has a very good permanent collection that contains: Pre-Columbian art, Mississippi folk art, Mississippi Quilts, Jacob Lawrence, Andy Warhol, Robert Henri, Mary Cassatt, and a special focus Mississippi artists. The building is only a few years old and is located in downtown Jackson. The museum is definitely worth a few hours for any art enthusiast or anyone just looking to stroll around for awhile.",
  "The property is beautiful and parking convenient but the permanent collection does not contain any major artists and it is small.  Check to see because a major artist's work could come through on a traveling exhibit. It's nice that major cities contain free museums such as this one. ",
  "found the exhibits fascination - well worth a visit . There is also a very reasonable café for light lunches , snacks, or coffee & a lovely garden to eat if the weather is fine. The gift shop was a little diasppointing - no 'tasteful ' bags or pens for sale - easy things to pack in a suitcase!!!",
  "We've been talking about going to the museum for almost 3 years now, and my boyfriend and I finally got to visit one afternoon. I would encourage anyone into everyone to go visit. The display of Mississippian's talent is wonderful. They have something for all ages to enjoy.  There's no entry fee, but they do have a box for donations. If you visit, please make any amount of donation you can so that the museum can continue the wonderful work they are doing. We plan on visiting at least a few times throughout the year, especially when they have exhibits come like the Van Gogh, Monet, and Degas which will be there from April until September. ",
  "We were recently celebrating our grandson’s birthday a few days early and were invited to join him and his parents for a visit to the Mississippi Museum of Art to see the present gallery exhibit . My first cause for being impressed was just as we entered into the spacious lobby. The furnishing were modern , minimalistic, comfortable seating in gorgeous colors. We took a quick walk through the nearby gift shop( the Museum Store) ; which was filled with a wide variety of wares. We knew we’d return to the gift shop after our tour of the Art exhibit. The gallery was spacious and clean. The exhibit was by the Artist Nick Cave. I found it to be interesting, unique and amazing. There were screens in some of the rooms and leather upholstered benches for comfortable viewing . I especially appreciated how they had small art stations in some of the rooms; where guests could interact with their own art contribution. The museum staff were not intrusive, but rather; courteous and helpful and I enjoyed getting to chat about the exhibit with one . Our return to the gift shop was very positive . I can highly recommend a visit to the Art Museum and look forward to returning.",
  "This place is full of beautiful, unique creations and artwork by various artists. The staff are knowledgeable, friendly, and helpful. Definitely go check it out!",
  "My boyfriend and I came here to kill some time when we visited Jackson. It was small but they had a lot of different types of art, and a lot of interactive parts that people of all ages could do. Would go again",
  "Found this place by accident, but am so glad we did! It is free to go in and look at all the exhibits. They seem to change, but the ones they had at the time we were there were awesome! Love the different types of art that were shown and the openness to the galleries they are set up in. The exhibit hall seems to be laid out depending on what is being shown and fits the atmosphere of the work. I would highly recommend stopping by if you get a chance! If you have little ones there is a nice water splash zone out front and plenty of seating for the adults."
 ]
},{
 "name": "Mississippi Agricultural & Forestry Museum",
 "address": "1150 Lakeland Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/8c/11/29/mississippi-agricultural.jpg",
 "tags": [
  "walking",
  "history",
  "tour",
  "historic",
  "kids",
  "learn",
  "walking",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d1028894-Reviews-Mississippi_Agricultural_Forestry_Museum-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great museum, lots of history and fun to see. Walking is comfortable and at your own leisure, no rush and can spend plenty of time in each building. Plenty of activities for little ones.. the old country store is always a favorite place to stop in and visit.  Make sure you play a game of checkers on the porch and pick up some molasses while there!",
  "We homeschool. During Spring Break, a friend and I took our children on an outing to this museum - two nine year olds and a five year old. When we walked into the museum, a museum professional, Mr. Grant Briscoe, walked up to us and offered to \"show us a few things\" - this kind offer stretched into a nearly 3 hour tour during which our children were pretty much enthralled the whole time. And we adults had a nice time, too. We toured the main building, with a lovely model train that had buttons to push to activate all sorts of fun features. The children were allowed to actually touch many (carefully selected) exhibit pieces. We saw a print shop, cotton gin, general store, old cars, airplanes, toys, farm tools, tractors, houses, school, Church - the list goes on and on. There was enough to interest everyone from the five year old to the fifty year old. The staff were exceedingly helpful and courteous and informative. And, to top it all, the ticket price is extremely reasonable. This is a must-see in Jackson!",
  "We were so surprised by how many exhibits are available at this site! We roamed over this place for over 2 hours and I still felt rushed (that's what happens when you have little kids). The central museum (I think it's called the Heritage Building) has wonderful exhibits of all the industries of the Mississippi region, from agriculture, to forestry, farming, livestock, etc! The outbuildings are a perfect extension to the learning, particularly the giant cotton gin in the back. We also loved the Fitzgerald collection in the back building. Incredible! The historic \"downtown\" was a wonderful experience for the kids. Their favorite: the doctor's office. The General Store came in second because they had candy! ",
  "A few hours here is well spent. There was much to see and learn about through out the exhibits. They have buildings which have been moved from various places in Mississippi forming an old town. I loved seeing the old gas station. One of the exhibit buildings has small airplanes used for crop dusting. This was a treat to see up close. ",
  "Very eye opening opportunity to go visit and see how things really were in the Old South. There were very, very, very few wealthy people, most folks had large families that were their work force. Lets people see how poorly the movies depicted Rich Plantations being the norm. Seldom was like that.",
  "This was a neat little experience. There are old and new pieces of farm equipment spread throughout the grounds. There is a short walking trail through a wooded area that has different trees and plants marked. There is also a small, mock-up, old time town that has a church, two room school house, general store, gas station, cotton gin, saw mill, print shop, several small log cabins along with a few other structures. You can walk through and see show life was during a simpler time. There is also a great little museum with several nice pieces and information. We really enjoyed this attraction.",
  "We took our kids to this museum on a beautiful day. The weather was perfect for the indoor/outdoor style of this museum. Sadly, it really didn't capture their attention, nor ours. There are no animals here, and the outdoor buildings aren't really brought to life. I'm sure an organised school trip would be fun, but we couldn't do this place justice. Staff were scarce and there were no other customers. The model villages and train sets were fabulous. I would not consider this value for money. The carousel and train were not in operation. ",
  "Visited during the Celtic Festival. We had a pleasent visit. The exibits are very well put together. If you like heavy machinery, this place is for you. Also enjoyed the model trains, which they have many. "
 ]
},{
 "name": "Eudora Welty House and Garden",
 "address": "1119 Pinehurst Pl",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/af/e6/83/home-from-street.jpg",
 "tags": [
  "tour",
  "family",
  "knowledgeable",
  "tour",
  "walk",
  "tour",
  "drink",
  "tour",
  "wander",
  "tour",
  "tour",
  "family",
  "free",
  "tour",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d609919-Reviews-Eudora_Welty_House_and_Garden-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had a wonderful tour of the house.  The tour actually starts at the house next door, where there are some nice exhibits and a great short film.\nAfter the film, the tour begins!  Our guide was very impressive and knowledgeable about  the author, her family and life.  It was a joy to see the rooms where Ms. Welty worked and lived, and the lovely restored gardens that she and her mother tended.\nThe house is a great memorial to a great writer who was ahead of her time in many ways.",
  "We very much enjoyed the guided tour of her home. The tour guide, Cindy, was excellent, and the house is wonderful. It was a pleasure to see her books, her workspace, and to hear more about her. The house next door, where the visitor's center is located, has some great displays, and the brief movie is well worth watching. The gardens were mostly dormant for the winter, but it was still nice to walk outside and see them. Incidentally, the car navigation system took us to the wrong location, but it was just a couple blocks away. A university security officer kindly gave us directions and led us there. Very disappointed that I wasn't allowed to take photos inside her home, but great experience overall!",
  "The house is as Eudora left it.  The docents are extremely knowledgable and entertaining.  The old English architecture is interesting.  The gardens are lovely year round; but in the fall and early spring when the camellias bloom it is outstanding.",
  "It's exactly what you'd expect as a place where Eudora Welty spent most of her life. In fact, it's so homey, you'd almost expect her to offer you a drink when you walked into the next room. All her books are there... scattered everywhere. And she read a lot more than she actually wrote. This is a MUST if you're in the Jackson area.\n\nThe docent tour is excellent.\n\n",
  "This is normally closed on Sunday, but I happened there when they were having an event so I was able to tour the home. It is filled with many of the original items belong to Eudora, including TONS of books! The awards she won are in the visitor center next door along with a wonderful photo display. I was not familiar with this writer and enjoyed seeing the house and learning about who she was. I would recommend the visit - as long as it isn't Sunday!",
  "The garden tour was part of the home tour. It was a cold, drizzly day but worth it to wander and see her lovely gardens.",
  "We stopped by this nice house on a visit to Jackson. It is in a wonderful neighborhood and it’s a beautiful home.\n\nWe also appreciated the yard.\n\nIt’s in a neighborhood so be polite and respectful but it’s a great stop in Jackson.\n\nGo enjoy!",
  "Start at the visitor's center next door. There you watch a very interesting and informative 20 minute video that helps the author come to life. The tour of her family's home and where she lived most of her life is casual and well interpreted by the guide. It is limited to 15, so be sure to make a reservation.\nAfter touring the house, you are taken on a stroll through the back yard and gardens. We were told that at anytime you are free to tour the grounds at no charge.\nI had two family members who were not familiar with Welty, even though they grew up in Mississippi (what can I say) and they also enjoyed the tour.",
  "Fantastic home and museum!  The docents are born story tellers, and it looks like Eudora just stepped out to lunch and will be back in a bit. If you’re into literary tours, do yourself a favor and go....it’s the most complete writer’s home you’ll see. Original furniture, artwork, hundreds of her books...it’s all here.",
  "We took a Deep South road trip last August and stopped by Eudora Welty House and Garden on the morning we were departing for New Orleans. It was hands down my favorite experience of the whole two weeks. You begin the tour in the welcome center, where we were met by the director and our two tour guides (one was training). They were very friendly and made us feel genuinely welcomed. After orienting yourself with the various items on display, you watch a short film and then proceed to the house next door. The house is kept in immaculate condition and our guides were very knowledgeable. Admittedly I'm biased as Ms. Welty is one of my favorite authors (and if you haven't already, please read The Optimist's Daughter before your trip, as it is her most autobiographical work and you will spots signs all around the house), but I found it probably the loveliest house museum I've visited. Hemingway Home, by way of example, is beautiful but overcrowded and guests are rushed in and out. At Welty House, visitors schedule ahead and are assigned a visiting time. As such, we had the entire house and garden to ourselves. A phenomenal experience and an absolute must for literate travelers!",
  "Nice stop but overrated! Old and showing its age. Great stop if you have nothing else planned. Peaceful stop too."
 ]
},{
 "name": "Museum of Mississippi History",
 "address": "222 North St Suite 1206",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/8f/c1/02/scenic-overview-of-museum.jpg",
 "tags": [
  "free",
  "free",
  "food",
  "history",
  "practical",
  "history",
  "free",
  "food",
  "history",
  "practical",
  "historic",
  "history",
  "free",
  "food",
  "history",
  "practical",
  "free",
  "tour",
  "history",
  "walk",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d13271835-Reviews-Museum_of_Mississippi_History-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "We stopped by the Museum on free Museum Day - it wasn't planned that way but that is how it played out. It is a nice museum and I like the way it is laid out in a timeline. It is connected to the Civil Rights Museum as well. They have a very nice gift shop as well with pottery and gifts made by <ississippi artists. Really enjoyed it.",
  "The Museum of Mississippi History and Mississippi Civil Rights Museum are worthy of making the trip to Jackson, MS, all on their own. Both museums opened in December 2017, and they are already being visited by people from all over the US and the world. These museums tell the history and stories about the people of Mississippi, including paleo-Indians, Native Americans, French and Europeans, enslaved people, and white and African American Mississippians. Both museums present historical facts using visual, audio, interactive, touch, musical, and lighting media. The Museum of Mississippi History focuses on One Mississippi, Many Stories, and includes topics from before Europeans arrived to present day. The Mississippi Civil Rights Museum focuses on the Civil Rights movement in Mississippi, and the story is presented without flinching at the violence and sorrow. I came away from both museums with a better understanding of Mississippi History and a much greater appreciation for the Civil Rights story...and I am a native Mississippian. \nHere are some practical tips - if you want to see both museums on the same day, allow ALL day. These museums are densely populated with galleries and exhibits, so allow enough time to see them all. Plan to see one museum in the morning, take a break at the cafe in the museum, and then see the other museum in the afternoon. Museums are open 9-5 Tues. through Sat., 1-5 on Sun., and closed on Mon. Weekends are busier, weekday mornings may include school groups, and weekday afternoons are less busy. The cafe food is really good and there is an excellent, very large and well stocked gift shop. Parking is available in a free covered parking garage or on nearby city streets. Tickets are available at the Museum for $8 for one museum and $12 for both museums per person, and discounts and memberships are available. ",
  "It is important that you understand that there are two separate museums, The Mississippi Civil Rights Museum and The Museum of Mississippi History -  I would highly recommend that you plan a separate visit for each if possible. If you are out of town and must visit them in one visit, you need at least 2 -3 hours for each museum.  The Museum of Mississippi History focus on Mississippi in whole, while the Museum of Civil Rights focus of the Civil Right Movement as it relates to Mississippi.  There is some overlap because both Museum cover Civil Rights in Mississippi.\n\nThere’s a host to tell you how the exhibits were set up, but you are pretty much on your own to take time to read and absorb everything.   It was amazing, very emotional and a bit overwhelming, a heartbreaking jouney.  The layout is a little confusing as to the direction you should go, so It is important that you follow the time line.  Get a map to follow the display outlay, otherwise you may find yourself wondering and revisiting the same displays.\n\nIt requires time and patience to go through the Civil Rights Museum because there will be some moments that you just can’t move through very quickly.  There may be something that cause you to reflect, or take you down memory lane, or something that may cause you to get caught up in the moment. \n\nI thought that I had a very good backgound in this movement but I was found so much that I had not heard about nor read about.  The collection of facts and data is amazing and very impressive. It requires lots of reading but there are some videos and some audio animation.  I appreciate the time spend in collecting facts and material for the displays, they are awesome.  \n\nParking can be a challenge but there is limited street parking.  Pricing is good, offering children and senior discount, and dual museum discounts.  Nice gift shop.   There is a small restaurant with sandwiches and baked goods.\n\nAlthough painful, Mississippi stepped up and took ownership of such a dark time in its history.  It is so important to recognize the pain and hurt of this time.  It will open the minds of those that do not understand the struggle that took the lives of both Blacks and Whites.",
  "The Museum of Mississippi History and Mississippi Civil Rights Museum are worthy of making the trip to Jackson, MS, all on their own. Both museums opened in December 2017, and they are already being visited by people from all over the US and the world. These museums tell the history and stories about the people of Mississippi, including paleo-Indians, Native Americans, French and Europeans, enslaved people, and white and African American Mississippians. Both museums present historical facts using visual, audio, interactive, touch, musical, and lighting media. The Museum of Mississippi History focuses on One Mississippi, Many Stories, and includes topics from before Europeans arrived to present day. The Mississippi Civil Rights Museum focuses on the Civil Rights movement in Mississippi, and the story is presented without flinching at the violence and sorrow. I came away from both museums with a better understanding of Mississippi History and a much greater appreciation for the Civil Rights story...and I am a native Mississippian. \nHere are some practical tips - if you want to see both museums on the same day, allow ALL day. These museums are densely populated with galleries and exhibits, so allow enough time to see them all. Plan to see one museum in the morning, take a break at the cafe in the museum, and then see the other museum in the afternoon. Museums are open 9-5 Tues. through Sat., 1-5 on Sun., and closed on Mon. Weekends are busier, weekday mornings may include school groups, and weekday afternoons are less busy. The cafe food is really good and there is an excellent, very large and well stocked gift shop. Parking is available in a free covered parking garage or on nearby city streets. Tickets are available at the Museum for $8 for one museum and $12 for both museums per person, and discounts and memberships are available. ",
  "The Two Mississippi Museums are fantastic. The Museum of Mississippi History and the Mississippi Civil Rights Museum. Both museums give a candid assessment of Mississippi's history. \n\nI cannot add much more than the other reviewers stated. These museums are worth the time, please take in both. The location and parking are easy. \n\nI want to add that the quilt exhibition on the top floor of the Museum of Mississippi History is fantastic. Many of these quilts are very early, exceptional examples. But there is also a number of great contemporary pieces. \n\nI do favor textiles and costumes. The historical exhibits contain wonderful historic costume examples. I hope they can continue to show more of their holdings in the special exhibition area. \n\n",
  "The Museum of Mississippi History and Mississippi Civil Rights Museum are worthy of making the trip to Jackson, MS, all on their own. Both museums opened in December 2017, and they are already being visited by people from all over the US and the world. These museums tell the history and stories about the people of Mississippi, including paleo-Indians, Native Americans, French and Europeans, enslaved people, and white and African American Mississippians. Both museums present historical facts using visual, audio, interactive, touch, musical, and lighting media. The Museum of Mississippi History focuses on One Mississippi, Many Stories, and includes topics from before Europeans arrived to present day. The Mississippi Civil Rights Museum focuses on the Civil Rights movement in Mississippi, and the story is presented without flinching at the violence and sorrow. I came away from both museums with a better understanding of Mississippi History and a much greater appreciation for the Civil Rights story...and I am a native Mississippian. \nHere are some practical tips - if you want to see both museums on the same day, allow ALL day. These museums are densely populated with galleries and exhibits, so allow enough time to see them all. Plan to see one museum in the morning, take a break at the cafe in the museum, and then see the other museum in the afternoon. Museums are open 9-5 Tues. through Sat., 1-5 on Sun., and closed on Mon. Weekends are busier, weekday mornings may include school groups, and weekday afternoons are less busy. The cafe food is really good and there is an excellent, very large and well stocked gift shop. Parking is available in a free covered parking garage or on nearby city streets. Tickets are available at the Museum for $8 for one museum and $12 for both museums per person, and discounts and memberships are available. ",
  "A must see in Jackson MS. Easy to find, easy to access and parking is plenty available. If you are in the area, go there!",
  "We stopped by the Museum on free Museum Day - it wasn't planned that way but that is how it played out. It is a nice museum and I like the way it is laid out in a timeline. It is connected to the Civil Rights Museum as well. They have a very nice gift shop as well with pottery and gifts made by <ississippi artists. Really enjoyed it.",
  "The museum staff is awesome, they are friendly and very informative.   I enjoyed the exhibit and the layout of the museum. It was a walk through Mississippi History very interesting.   Plan to stay at least 2 hours to sufficiently tour the museum.  The Civil Right museum in located in the same building I had toured it before.  If you decide to tour both museums plan for 4 hours at a minimum.",
  "As a visitor from out of state I learned so much about Mississippi but I think locals would love it too. There is much to learn about and the presentation is excellent.",
  "An absolute must-see for a comprehansive view of the state of Mississippi. Incredibly well-planned facility with excellent staff and exhibits. "
 ]
},{
 "name": "Cathead Distillery",
 "address": "422 S Farish St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/bf/91/85/cathead-distillery.jpg",
 "tags": [
  "tour",
  "music",
  "food",
  "tour",
  "history",
  "tasting",
  "tour",
  "tour",
  "walk",
  "tour",
  "tasting",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d9786783-Reviews-Cathead_Distillery-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great space for just chillin with friends and drinking a pint and for concerts or other events.  It's a big old warehouse that has been converted into a distillery and a beer bar.  By law they can't sell hard liquor, just beer, but you can buy a tour (5$, 15 minutes) and then enjoy small  samples of their spirits.  The space is big enough to rent for receptions; you can play corn hole or large table games.  They don't have food, unless the popcorn counts.  There is a decent selection of beers on tap; probably about 10-12.  Excellent people too--beer tenders have always been friendly, and Cathead is a great supporter of live music and bands.",
  "We visited Cathead on a Saturday and the two of us were the only ones on this particular tour. Along with the tour, they made us feel comfortable by offering drinks (fountain drinks, beer, etc), and there are several tables available to sit at. The tour provided the history of the country and an overview of their products. Aside from a few varieties of vodka, they also distill gin. At the end of the tour, there is a tasting which is limited by state law (they also cannot sell their products on the premises). But it gives you a chance to sample a few of the products. The warehouse is a very laid back and fun-looking work space, and the tour is highly recommended.",
  "This is a great place to visit if you are into a local distillery. Cathead was a great venue for our large group and the tour gives you an idea of how things are made. They have wonderful tastings of the alcohol they make and a small store to allow you to take some home. ",
  "I had read some reviews and wanted to come by and check it out since they allowed pups. Upon arrival we really were taken back by the space as the decor was awesome! We grabbed a beer and found out due to MS laws that they couldn't sell mixed drinks on property but they did have tours where we can taste. So after a short wait until the next tour we had a great walk through with Zack and ended with some tastings. My wife and I enjoyed the vodka and bourbon (we aren't gin fans). After the tour I stopped by the gift shop for a hat and a bottle of bourbon for home since not distributed in Ohio as of yet. If I'm ever back in the area I will def be stopping back by!",
  "We were invited by friends to take a tour of the Cathead Distillery. Much to our surprise, we stumbled upon this hidden treasure in downtown Jackson. When you first pull up to the building it definitely looks a lot different than the other buildings nearby. We were pleasantly surprised that the grounds of the distillery gave off a “hipster” vibe. Once in the building, we walked into the lovely gift shop. Our group has never visited this establishment before, so we were delighted to see that there was so much to do prior to the tour. While we waited, we grabbed a beer at the bar and walked around the warehouse to enjoy the many outdoor/indoor games. The facility was very clean and the staff was very friendly. Once the tour began, we were one of the lucky groups to have one of the founders give us the tour. It was very laid back and we were encouraged to ask questions. Our group had a total number of 10 couples, and it was a very intimate experience. It was like we were given our very own VIP tour. Not having a lot of knowledge of the product, other than knowing they made vodka, it was fun to ask about the idea behind Cathead and how it came into fruition. We learned that they had other products that were being introduced and in the making. The tour lasted about 45 minutes with the tasting. We definitely would come back and visit. It would be so much fun to bring a group of friends and enjoy some beer and play outdoor games in a warehouse setting. The venue also hosts wedding receptions and other events. ",
  "Wha great products and hospitality. The distillery has a mom & pop feel but has a decent size production. Excited for the third release of the Bourbon. Thank you for such wonderful Southern Hospitality and all you do for local musicians.",
  "We went with  the MS Magical Mystery Tour and stopped for lunch and tastings of all of their alcohol!! It was an interesting tour, they have been in business here about 4 years or so. We tasted gins, vodkas, bourbons to name a few. I didn’t taste any I didn’t like. It’s a short tour and there are plenty of games to play, like life sized Jenna!! There is a lovely gift shop including all of their alcohol.",
  "This is a great place to visit if you are into a local distillery. Cathead was a great venue for our large group and the tour gives you an idea of how things are made. They have wonderful tastings of the alcohol they make and a small store to allow you to take some home. "
 ]
},{
 "name": "LeFleur's Bluff State Park",
 "address": "3315 Lakeland Ter",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/6a/15/0a/on-the-banks-of-the-pearl.jpg",
 "tags": [
  "walking",
  "parks",
  "hike",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d9996404-Reviews-LeFleur_s_Bluff_State_Park-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited this park before setting off on our way to Vicksburg on a road trip from Nashville to New Orleans.\nIt really is a beautiful area and very tranquil. We parked up and walked for a while. We were following the purple trail but we had to turn back about a mile in as it was the season where spiders make their webs in the trees and I was nervous about walking into them. We saw many large colourful yellow and red spiders! Not a fan of them so we decided to sit on the benches and take in the scenery from the lake. We saw small black turtles in the water.",
  "We loved this park. Lots of space between RV sites.  incredibly quiet with serene setting on the water. There were a lot of empty sites when we were there. Cost was under $20/night. The showers are in need of updating and TLC. We would stay here again.",
  "We visited this beautiful park while spending a few days in Jackson, and it was a big highlight of our trip.  The park is beautiful, and the trails are very accessible.  We first visited the Museum of Natural Science, which is on the park grounds, and from there, took the trails out into the forest.  A chorus of insects and birds could be heard along the trail, and we even found some five lined skinks, anole lizards, and toads.  To think that this park is just off a busy highway in a very busy part of Jackson makes it all the more amazing.  The trail loop that went down to the bald cypress swamp was partially obstructed, as it had been smashed by a fallen tree.  However, the area was sufficiently marked and cordoned off to keep hikers safe.  We double-backed on the left side of the  trail and went up the right side of the loop, and from there, we were able to take the boardwalk down to the bald cypress swamp.  It was well worth the effort.  The swamp is truly stunning.  I'm so glad we spent some time at this park.",
  "This lovely park is right in the middle of Jackson MS, just off the highway. You’d never know it by the symphony of bird song and cicadas. The RV sites are spacious and shaded, many of them are right on the lake/pond. Water and electric only, but there is a dump station. Why don’t state parks have recycling bins??????",
  "If you live in or are visiting the Jackson area and enjoy hiking, this park is a must-see! It has a network of trails that take you through serene and well preserved landscapes that feel hundreds of miles away from the surrounding city. The trails take you from forests and hillsides down to the banks of the Pearl River, the main waterway through central Mississippi. \n\nThere is a smal entrance fee, but it is well worth it if you combine a hike through the park with a visit to the Mississippi Museum of Natural History. In total, you can make a whole day out of visiting the area, and it is worth the time!"
 ]
},{
 "name": "Smith Robertson Museum and Cultural Center",
 "address": "528 Bloom St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/e3/3d/c4/desks-from-the-original.jpg",
 "tags": [
  "art",
  "history",
  "walking",
  "history",
  "history",
  "learn",
  "tour",
  "learn",
  "history",
  "art",
  "history",
  "history",
  "kids",
  "walking",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d105886-Reviews-Smith_Robertson_Museum_and_Cultural_Center-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "This small museum is the school Richard Wright graduated from.   It was the first school building built for black children in Jackson in the 1890’s.  It is filled with rich exhibits of the history of the slave trade to the Civil Rights movement with art exhibits from local artists.   Well worth a visit!",
  "This building was once a thriving school for African American children. Author, Richard Wright, is one of their famous alumni. Displays include a brief history of slavery, the Great Migration, and Civiil Rights. For me the most powerful sights were the Medgar Evers exhibit and the Slave Ship. Seeing the bloody clothing of Evers's neighbor hanging on a fence really brings home the lack of justice available for African Americans. Walking through a cramped and darkened slave ship was eerie and impactful. The staff is rightfully passionate about their museum and their subject matter. Take the time to visit this hidden gem!",
  "This museum is a fantastic window into the Civil Rights Era and the history of African Americans. I loved the section about James Meredith, the first African American to attend Ole Miss (and his struggle to be allowed in). It has audio clips from President Kennedy and Mississippi politicians debating integration. It also is the home of a Smithsonian exhibit about the Great Migration in the early 20th century, where African Americans moved north to take advantage of factory jobs. The museum is inside Jackson’s first school for African-American children, which is famous for its alum Richard Wright, author of Native Son. Admission is less than 5 dollars and you could spend hours wandering around here. This is a top-notch museum and at must see for anyone visiting Jackson.",
  "Built in 1894, Smith Robertson Museum was originally Jackson's first public school for black students. It is a bit difficult to find & the doors are locked during the day, but it's well worth the visit. The first floor is devoted to the Civil Rights movement. You can hear conversations by Bobby & John Kennedy. No pictures are allowed here. The second floor has an amazing slavery exhibit. Among other things, it gives the slave ship routes from Africa. There is an amazing replica of a slave ship that brings home the deplorable conditions these people were forced to travel in. Small but interesting museum.",
  "This museum is one of Jackson's hidden jems! It is s little difficult to find, they lock the door during business hours, and it is cash only. However, once you do find it and make it inside, you will not be disappointed! There is so much to see and learn! The exhibits are very well put together. ",
  "Being a cultural center it does fulfill many valuable functions. There is a museum exhibit located here. One is very small that covers the very bare bones on slavery with a surprisingly effective, startling at first on the middle passage. The Medgar Evers exhibit is well done and would be a good starting point of a civil rights tour of Jackson. The location may make some nervous as it is located on a once thriving historically black community which has fallen on hard times post-integration. I may not have gone there on my own the first time, but now having been their I would be perfectly comfortable in going there. Parking is right out front and it should be easy to spot as it is located in the first public school built for blacks in Jackson. I put no below for a fee, but this may be because I was part of a group. They open at 9, but I would call in advance to check the hours.",
  "I really enjoyed my visit to this museum. The lady at the front desk was very friendly and helpful. I have visited several civil rights and african american museums over the years, and this is one of my favorites. Their displays and information often give a different perspective to the slave experience and history.  I learned a lot and encourage you to learn there as well.",
  "This small museum is the school Richard Wright graduated from.   It was the first school building built for black children in Jackson in the 1890’s.  It is filled with rich exhibits of the history of the slave trade to the Civil Rights movement with art exhibits from local artists.   Well worth a visit!",
  "We loved this small museum. We only had a couple of hours to spend in Jackson so we visited this museum instead of the Civil Rights Museum. It was perfect for my kids, aged 6 and 9. Not too small, not too big but filled with inspiring stories and history. Very educational and highly recommend!",
  "This building was once a thriving school for African American children. Author, Richard Wright, is one of their famous alumni. Displays include a brief history of slavery, the Great Migration, and Civiil Rights. For me the most powerful sights were the Medgar Evers exhibit and the Slave Ship. Seeing the bloody clothing of Evers's neighbor hanging on a fence really brings home the lack of justice available for African Americans. Walking through a cramped and darkened slave ship was eerie and impactful. The staff is rightfully passionate about their museum and their subject matter. Take the time to visit this hidden gem!",
  "This is a great museum that covers African American history and has great artifacts on display from when it was actually open. It definitely is a way to show the price of an education and progress. The staff is great and definitely loves to engage on African American history and artifacts.  Please stop by and visit if you are in the downtown area and support this activity."
 ]
},{
 "name": "The Jackson Zoo",
 "address": "2918 W Capitol St",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/8d/58/6a/orangutan.jpg",
 "tags": [
  "active",
  "kids",
  "knowledgeable",
  "family",
  "active",
  "walk",
  "walking",
  "kids",
  "family",
  "walk",
  "walk",
  "family",
  "kids",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d109488-Reviews-The_Jackson_Zoo-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great zoo. It has plenty of animals and it is well kept for the amount of funding they have. The animals were pretty active ,we were there around opening in the morning and they had just been fed. Would recommend visiting to anybody.",
  "I wanted to share a great experience that I had at the Jackson Zoo this summer with my 3 nieces; ages 7, 9, & 10 along with a few of my colleagues and their children (8 children all together).  All had a wonderful time there.  The kids loved the variety of animals, boardwalk area, and particularly the giraffe area.  This was greatly due to the zookeeper that was working in the area at the time.  The young lady zoo keeper, (Christina) took the time to talk to the girls and tell them all about giraffes.  She was absolutely wonderful.  We asked her about the other animals that she cared for..tiger, etc.  It was refreshing to see that such caring and knowledgeable zookeepers work with these animals.  I have been an educator for over 20 years, so I appreciate someone that is so enthusiastic and motivated.  I have been to the zoo several times, so glad she was there when I brought the girls with me.  We definitely will be back.  I am recommending a zoo trip for our 2nd grade for next year also.  Hopefully, we will see the girls favorite zookeeper again.  My 2nd grade class will love the special attention.    A++ to the Jackson Zoo!!   \nThank you Miss Christina!!! \n\nFrom,\nMSEA Leaders and Educators",
  "The animals are super friendly. If you go during the week, it's quiet and peaceful. The enclosures are more \"lifelike\" and less like a cage. Even the bears and tigers got up front and personal with us. \n\nOur little girls enjoyed their trip to the zoo, and loved the giraffes. ",
  "It's nothing in comparison to New Orleans, but it's a great attraction for Jackson Mississippi.  If you are visiting family and need something to do, check it out. If you are in rural Mississippi, come check it out.  Just don't drive here if you are closer to New Orleans.  They keep it up pretty neat.  Just make sure to lock your doors on the way in. The neighborhood that it's in is really bad. Lock your doors in the parking lot and don't leave anything visable.  It's safe inside as far as I know.",
  "We stopped by this zoo on a trip from Tennessee to Texas. The animals were very active a half hour before closing time. Took us about 2 hours to walk through. Had young adults traveling with us and they enjoyed it. The Rhino was huge! The zoo is not real big but well worth the money and side trip. ",
  "The Jackson Zoo used to be a gem in Jackson.  When I was a kid there were lions, and tigers, and bears...(like grizzlies and polar bears.)  However as time and zoos have changed this zoo hasn't been able to keep up.  Funding seems to be the major problem.  If you have kids they'll enjoy this park (because honestly kids have a good time looking at any animals and running through this smaller park)  The carousel is lovely. You'll also not have to worry about walking over a HUGE park because this zoo is relatively small and makes for a great day trip for toddlers. There won't be crowds and crowds of people to fight unless there is a special event scheduled.  Just know ahead of time that you're not going to see elephants and some other animals you'd expect to see at a zoo.",
  "My family and I absolutely love the Jackson Zoo. My five year old and two year old love all the animals and know many by name. They consider Knox, the giraffe, a close friend. It is an enjoyable walk for me and a great way to get everyone outside. After visiting our friends,the boys love to ride the beautiful carousel and meet L.C. for a ride on the train. In the summer months we can’t leave without playing at the splash pad. It is one of the best in town! Of course the zoo could use some updates and more attention to the landscaping but as it is underfunded, we appreciate that the money is spent on the animals. I personally love the beautiful old trees and the cool shade they provide as well as the mature lantanas that adorn Big Mike’s exhibit. We look forward to it opening again soon! We’ve missed our friends!",
  "I took a group of middle school students to this zoo. I had been to the Memphis zoo and was expecting natural looking habitats for the animals. The Jackson zoo does not have the diversity of animals that are present in most other zoos. It is not as nice and my students felt sorry for the animals that were kept in small enclosures.",
  "The Jackson Zoo is on the smaller side of attractions but has plenty of interactive things for young children to do! I was thrilled to find this zoo tucked off in the heart of Jackson to be well maintained and extremely comfy. There are not many things to buy as far as merchandise but my nephew had a blast!",
  "While it made for a nice walk, and it was easy to get around, the zoo is pretty run down and in need of some updates.  The website is a little out of date (it said the cafe was open through November, but it was already closed in September) and lots of stuff was not open or running.  We did see some animals we hadn't seen before, but there were a lot of empty cages.  Lots of potential in this little zoo!",
  "My family and I visited the zoo during the summer and despite the heat we stayed very cool because of the many shady areas throughout the zoo. The kids loved seeing the animals, though there weren’t very many. Most of them were just laying around and although there are many exhibits many of them are empty. Other than that we had s blast. There are tons of varieties of monkeys there, giraffes, and tigers.  They have many drink machines throughout the park that accept both cars and cash. The staff there are extremely helpful and kind. They make sure that everything is ok and ask if you need anything. The park is easy to maneuver and good for people with wheelchairs. The best part was the water park, the children spent hours there. They also have a train, however be sure it’s not raining if you want to ride it."
 ]
},{
 "name": "Mississippi Governor's Mansion",
 "address": "300 E Capitol St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/31/d5/e9/front-view.jpg",
 "tags": [
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "family",
  "free",
  "tour",
  "free",
  "unique",
  "knowledgeable",
  "structure",
  "tour",
  "history",
  "knowledgeable",
  "walk",
  "tour",
  "history",
  "tour",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563602-Reviews-Mississippi_Governor_s_Mansion-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Margeret Robeson gave a terrific tour of the Governor’s Mansion, complete with history of the building, residents, and garden. We went during off times, and had the incredibly knowledgeable Ms Robeson all to ourselves.  It is a beautiful building the people of Mississippi should be proud of.",
  "Excellent tour with excellent docent allows you to all the original rooms in the mansion. Check the website since the tours are not offered every day.",
  "Check the website for tour days and times; the tour of the Mississippi governor’s mansion is worth the time to visit, and it’s free.  Our docent was friendly, pleasant, and very informative.\n  \nSince the governor and family now live in an annex building out back, the tour of this mansion includes the second floor bedrooms in addition to the first floor formal rooms.  The colors, furnishings, and chandeliers are elegant and timeless.\n  \nIf visiting Jackson on a day when the mansion tour is available, make time for this stop.  My only disappointment was that non-flash photography was not allowed.\n  \nAs you exit the front door, be sure to look across the street to see the beautiful, tall white building with a clock on top.  The Lamar Life Insurance Company building was the workplace of the father of Mississippi author Eudora Welty.",
  "The most important thing to know is that there are no restroom facilities, so plan ahead.  This is a lovely, restored residence.  The tour is free and takes about 30 minutes.  Judy, our guide, did an excellent job.  Definitely a must stop.",
  "This sight is unique in that it is a historical building but also a home of the seated governor.  With on street parking, visitors must wait by the main gate to enter the grounds when tours are scheduled to start.  Tours are guided by knowledgeable docents and span the main and second floors.  This is a beautiful building that has been elegantly restored.  The flowers, colors, and appointments are lovely.  No pictures are allowed.  This is a gen in downtown Jackson.",
  "This beautiful pre-Civil War structure is a real beauty.  Tours are available with Christmas being the best time to visit.",
  "Margeret Robeson gave a terrific tour of the Governor’s Mansion, complete with history of the building, residents, and garden. We went during off times, and had the incredibly knowledgeable Ms Robeson all to ourselves.  It is a beautiful building the people of Mississippi should be proud of.",
  "We went on Christmas Day so it was closed. But we got to walk around the building itself and take some pictures. The building is beautiful and well maintained, the landscaping is immaculate. Very nice are to walk around, snap some good pictures and explore Jackson's downtown area.",
  "Touring the public rooms here reminded us of the White House - very impressive and historical, and our guide was full of stories for each room.  Beautiful place to visit, but tour times are limited, so check first!  More signs pointing to the right gate to enter would've been helpful.  We had read that the tour started at the front door, so we were waiting at the front gate ...but the actual check in point was around the side!",
  "This is a stunning home, and the guides here do a fantastic job of relating the story of the home's history and decor.",
  "A beautiful structure even if you just take a gander. The tour times vary so make sure you do the research and book a tour if you have time."
 ]
},{
 "name": "Old Greyhound Bus Station",
 "address": "219 N Lamar St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/c1/d3/4e/historic-greyhound-station.jpg",
 "tags": [
  "art",
  "history",
  "history",
  "free",
  "history",
  "walk",
  "historic",
  "history",
  "history",
  "free",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d13372713-Reviews-Old_Greyhound_Bus_Station-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located on Lamar Street, this building is important in the history of the Civil Rights Movement. \n\nFrom 1961 the Freedom Riders challenged the segregated arrangements for travel and facilities by riding interstate buses and seeking access to the 'whites only' facilities. Jackson was a stop on the Freedom Rides and more than 300 people were arrested in Jackson. \n\nThe art deco building is occupied by an architectural firm who respect its architectural and social history. It's worth stopping to read the sign giving detail about the Freedom Rides if you pass the building. It's stunning when lit up at night.",
  "This spot is a tribute to the great architectural history of America past. Very much worthwhile to stop by and admire this building.",
  "I’m not certain you can go inside as the location seemed to be the offices of a private company.  Nonetheless it was interesting to walk up the sidewalk and see the building where history happened.  The historical marker on the sidewalk gave a good summary of the significance of the arrests that took place. While old and missing the letters that spelled Greyhound, the building was in respectable condition.  It’s free to walk by and about 1/2 mile walk from the Civil Rights Museum.   If you’re up for the walk, take a while to walk over from the museum and where history happened. ",
  "Old style bus station building. But we were there for the trip to Nashville.  People winced when we mentioned going to Nashville by Greyhound but apart from anything else, there is no train so unless you hire a car and suffer the one-way drop-off fee, this is it.  Perfectly fine. We didn\\t bother reserving seats but had no problem sitting together even though the bus was three quarters full. On time, one stop, just under four hours, good way to see the countryside. I said the man in the gaberdine suit was a spy!",
  "It's great that they have saved this historic bus station.  It is now a private office BUT it's wonderful to be able to see the site of civil rights history.  It is also very interesting to view the beautiful architecture of the building.",
  "Modern greyhound station staff pleasent easy check-in updates available on all routes security staff onsite good inexpensive way to travel.we travelled from New Orleans to Houston Texas 7.30hrs then transfer to San Antonio which took 3hrs first bus was an older model our seats were near the back felt cold through the night so would recommend taking a blanket I'm so pleased I did next bus was a newer model sat nearer the front felt warmer but seats felt more squashed no where near as much leg room as we had on older bus and they didn't recline !!! Not good on a long journey through the night drivers were informative pulling in for plenty rest//toilet breaks toilet at back of bus but I never needed to use it Houston bus station a bit old needs refurbished San Antonio needs refurbished also but then do does s lot of public transportation places would definitely use greyhound again no problems (so far).",
  "This spot is a tribute to the great architectural history of America past. Very much worthwhile to stop by and admire this building.",
  "I’m not certain you can go inside as the location seemed to be the offices of a private company.  Nonetheless it was interesting to walk up the sidewalk and see the building where history happened.  The historical marker on the sidewalk gave a good summary of the significance of the arrests that took place. While old and missing the letters that spelled Greyhound, the building was in respectable condition.  It’s free to walk by and about 1/2 mile walk from the Civil Rights Museum.   If you’re up for the walk, take a while to walk over from the museum and where history happened. "
 ]
},{
 "name": "Mynelle Gardens",
 "address": "4736 Clinton Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/f4/29/21/the-gardens.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d286677-Reviews-Mynelle_Gardens-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visiting a garden in February once doesn't expect many blooms.  But we enjoyed the personalized layout and could envision the previous owner spending many hours enjoying her beautiful yard.  Unfortunately many of the plants have aged past beauty, groundcovers have escaped where they ought not be and the ever present weeds are more than the staff can control.  The roof of the porch on the office doesn't just leak, part of it is non-existent.  Still worth a visit and the price is fair for what one sees.  Go, Enjoy, but don't expect a well groomed public garden.  ",
  "Having lived in Jackson for over 20 years, I finally decided to visit Mynelle Gardens. Some reviewers mention safety of the area, but I never felt unsafe during my visit.\n\nThe gardens are maintained by the City of Jackson, so it is understandable that maintaining the property is not top priority when there's so many other issues needing addressing such as crime, water problems, infrastructure, etc...  However, the gardens were in bloom during my visit and I'm glad I chose to go. The pathways leading through the gardens were easy to navigate and it was nice to find markers indicating the types of trees, flowers, bushes, etc... throughout. There's plenty of benches to stop, relax and enjoy the surroundings. The statues throughout the gardens were a treat to see. \n\nThere's a large pond near the back of the gardens with fish, turtles and a fountain. Unfortunately, the pond needs a good bit of work. Again, the city is struggling with budget issues and I understand maintaining the property to a pristine condition is not a top priority. \n\nThe house on the property doesn't appear to be open for tours. It was locked during my visit. There's a lot of delayed maintenance on the house as well.\n\nWith admission being only $5 a person, it's definitely worth a visit.",
  "This is a beautiful little garden, and well worth the visit there!  Great place to take some lovely photos.",
  "Wow! What a difference a few years can make! We visited here several years ago and loved it. We just visited it again and sadly, this place needs a great deal of help and obviously new management and staff. How could anyone let this place go down? I realize gardens need constant attention but this is around to show off beauty of Jackson, which sadly it just shows the laziness and neglect of Jackson, MS.",
  "This place was clearly born of love and passion. Sadly this passion is lost. Staff is friendly and welcoming, but the gardens have fallen into disrepair. Jackson can either appoint leadership which displays the same love and energy that once made these gardens special or it can sell the property to someone who will bring them back to their past glory. The status quo will lead to the loss of this hidden gem.",
  "I have been visiting here for years, very reasonable entrance fee.  Beautiful at anytime of the year.  Places to leisurely stroll and relax, great place for photographs and the southern place for weddings.  ",
  "We came after more than 20 years of having not been here due to crime in the area. My niece is a budding photographer and wanted to take photos. They charged her $25 and my husband and I $5 each. The flower beds were riddled with weeds and vines. So sad. They had mowed and done weed eating but had not blown off any of the concrete walkways. I would call the City of Jackson and complain but they cannot even fix potholes so I think weeding Mynelle Gardens will not even make their list. Once a beautiful garden now an overgrown weed bed. ",
  "I feel that if I'd had visited during the spring I would have enjoyed myself much more. This is a small garden, but could be a beautiful place with a little work. "
 ]
},{
 "name": "Farish Street Historical District",
 "address": "Farish Street",
 "avg_visitor_review": "2.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/60/00/1b/farish-street.jpg",
 "tags": [
  "historic",
  "history",
  "walk",
  "historic",
  "history",
  "music",
  "history",
  "food",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d286681-Reviews-Farish_Street_Historical_District-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Going through the comments on this place is so disheartening. So much racism and prejudices, and you’ll see a lot of it is from people who are from MS. I’m from Mississippi so I know first hand what it’s like living there before moving. \n\nThis area is a very historic area that was an amazing place for Black people back in the day before integration. There are no “activities” and there is no entertainment here (much like the rest of Mississippi) but it’s rich in history. Blacks weren’t treated equally so we paved our own on this street... an amazing and thriving community. \n\nYou’ll have to have at least some common sense and appreciation for history to truly enjoy... small minded people should stay away. If you go be sure to stop by the Dennis Brother Shoe place for a history lesson, as he’s the third generation to own it since its opening in 1936. \n\nWhile the area is high in crime, use your common sense as you would any where else and enjoy seeing an area that has so much history.",
  "This is NOT the best area to walk around in, it can be very dangerous.\n",
  "I went to Jackson on a Mission Trip. We Will Go Ministries is working very hard on restoring Jackson.. At no time when I was in Jackson was I in fear, and yes I am a white woman whom slept in the Farish District.  Was there issues; with drug addicts, homeless, prostitutes Yes, there is. We as Children of God need to work together to help these people out, we need to come together and bring life to this area, so they will not be suffering and have to turn to live this way. Please pray for the people of Jackson, and if you can help them. There is some very nice people in  the Farish District of Jackson, please do not give up on them.",
  "Going through the comments on this place is so disheartening. So much racism and prejudices, and you’ll see a lot of it is from people who are from MS. I’m from Mississippi so I know first hand what it’s like living there before moving. \n\nThis area is a very historic area that was an amazing place for Black people back in the day before integration. There are no “activities” and there is no entertainment here (much like the rest of Mississippi) but it’s rich in history. Blacks weren’t treated equally so we paved our own on this street... an amazing and thriving community. \n\nYou’ll have to have at least some common sense and appreciation for history to truly enjoy... small minded people should stay away. If you go be sure to stop by the Dennis Brother Shoe place for a history lesson, as he’s the third generation to own it since its opening in 1936. \n\nWhile the area is high in crime, use your common sense as you would any where else and enjoy seeing an area that has so much history.",
  "The City has spent a lot of money on street , paving and lighting improvements.\nFrankly, there’s not at this stage a lot going on but we felt the history of the area in every step we took. The Big Apple Inn  has been featured, quite rightly on several TV food programs. $1.50 for a ‘burger or fried pigs ear sandwich & damn fine sandwiches they are too.\n\nThe cafe is in the building where Civil Rights Advocate Medgar Evers had his NAACP\n\nI can only write of our experiences- we walked the length of Farish Street and were only approached by a couple of harmless panhandlers.\nThis was during daylight hours.\nWe went back to visit an upmarket club and a live music venue at night and again walked without any dramas.\nWe are a white middle-aged couple.\n\nAs I say I write only  of our walks.\nPerhaps if Farish Street is as sketchy as others have written the City could install conspicuous CCTV which serves as a deterrent and to help visitors to Farish Street feel safer.\n\n",
  "Very High Crime Area plagued with drugs, prostitution, murder, and carjackings. The police do not actively patrol the area and everything is in disarray. The are has not been revitalized as it was promoted and it's an area people should just stay away from. Don't risk your life going into this area. We heard lots of gunshots very close nearby during our short visit.",
  "Not know the history until after the fact,  I drove through the Farish Street District after stopping for a snack at the Big Apple Inn.  After researching the history I read that Farish Street was the economic hub for the black community of Jackson, MS during the Jim Crow era.  Sad to see the area in disrepair but interesting to imagine what it was like in its prime.",
  "I really enjoyed this area.  I stopped in some shops and learned even more about the area.  The man in the shoe repair shop is a fountain of information, his shop has been there since the 1930s."
 ]
},{
 "name": "Jackson State University",
 "address": "1400 J R Lynch St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/10/75/08/jackson-state-university.jpg",
 "tags": [
  "walk",
  "library",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563594-Reviews-Jackson_State_University-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "The walk to graduation was a bit much at 5:45 in the morning but it was worth.the problem was the rain when the graduation was over.",
  "They have a great library  you will want to visit here and the professors  come with extensive backgrounds.",
  "The ballrooms in the campus Union are excellent facilities to hold meetings and accommodate large groups. Parking however is problematic at this building.",
  "The walk to graduation was a bit much at 5:45 in the morning but it was worth.the problem was the rain when the graduation was over.",
  "The campus has totally changed since I graduated in 1984! It was kind of confusing navigating the campus but we managed.",
  "Excellent higher education university with graduate studies. Diverse multicultural students and faculty! Home of the \"Sonic Boom of the South\"",
  "The campus was clean and orderly. We had an excellent tour and several students in the group submitted applications to attend the university.",
  "This school is loaded with constant failure and crime. The school is located in a High crime area to start with. Multiple crimes take place on their campus almost daily from Theft, robberies, auto burglaries, and assaults. The school misappropriates funding and I have personally seen multiple athletic coaches using Tax Exempt JSU Sam's Club cards to purchase personal items. Multiple years they have enrolled students for the beginning of the school year and not had enough housing for enrolled students. It does not take a Math Professor to figure out that you can only enroll students with housing when you have enough beds for those students, and they have Math Professors. Most staff are very Liberal and have very racist views towards anyone who is not black. Gatherings that are school related such as sporting events are usually plagued with alcohol and loud unruly people that may get violent."
 ]
},{
 "name": "Mississippi Sports Hall of Fame",
 "address": "1152 Lakeland Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/1f/67/8a/mississippi-sports-hall.jpg",
 "tags": [
  "knowledgeable",
  "knowledgeable",
  "family",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d278865-Reviews-Mississippi_Sports_Hall_of_Fame-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "5 stars across the board for a great experience even if you're not a giant sports fan like myself. Knowledgeable and friendly staff, cool exhibits, admission price is a bargain, and a room for private events. It would be great if it were larger, but it still rates 5 stars!",
  "Interesting displays. Stadium like architecture. If you like Mississippi sports figures, you will really enjoy this place.",
  "5 stars across the board for a great experience even if you're not a giant sports fan like myself. Knowledgeable and friendly staff, cool exhibits, admission price is a bargain, and a room for private events. It would be great if it were larger, but it still rates 5 stars!",
  "Stopped by for what I thought would be a quick stop and turned in to a short 2 hours. Great images and artifacts and displayed well. A lot of local heroes who also did well on the national level in their respective sport. Good family entertainment and easy to access. Not sure if the non-sporting audience would find it as interesting as I did but worth a stop.",
  "We had a couple extra hours at the end of the day, so decided to check out the Mississippi Sports Hall of Fame. It is nicely done for a local facility and well worth the five dollar entry fee. There is a well produced introductory video and then the museum collection is thoughtfully broken up into thematic displays.\n\nWe thought the experience could be enhanced by adding short audio or video clips, or more written word displays, with interesting or compelling stories about Hall of Fame members.  For example, they have a section on Dizzy Dean and I recall hearing so amazing and colorful stories about his time in the major leagues and barnstorming during the off-season. A couple of these stories would help people who don’t know about Dizzy Dean to get to know him better. \n\nAlso, many of the Hall’s members were involved in some amazing sports moments. It would be great to have short videos highlighting those exciting times.\n",
  "Nice looking museum, not all the activities were functioning.  Unfortunately, we discovered how little of a sports fan my son is, so we probably won't have a reason to return.  However, if you are a MS native and love sports, I would recommend a visit for you.",
  "I visited the sports hall of fame and came away very impressed. The displays and history are outstanding. I especially enjoyed the basketball scoreboard from the early 50s. Any sports fan will enjoy this museum."
 ]
},{
 "name": "Original First Baptist Church",
 "address": "431 N State St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5f/f2/ff/first-baptist-church.jpg",
 "tags": [
  "music",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563611-Reviews-Original_First_Baptist_Church-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you can get tickets to the Christmas production of Carols By Candlelight you have done a good thing. Awesome production by the members of the church. The choir is truly an experience. Sit back and enjoy Christmas to come in God house",
  "Although looking for a new pastor and minister of music due to life events, this is an incredibly friendly church and if you can sing, has an excellent choir!",
  "If you can get tickets to the Christmas production of Carols By Candlelight you have done a good thing. Awesome production by the members of the church. The choir is truly an experience. Sit back and enjoy Christmas to come in God house",
  "Although looking for a new pastor and minister of music due to life events, this is an incredibly friendly church and if you can sing, has an excellent choir!",
  "Being a Baptist from Missouri it was very nice to go to such a beautiful and uplifting service while on vacation. Everyone was very welcoming, even after they knew we were just passing through. ",
  "Takes up a few blocks with various buildings. I have not seen the entire facility, but well maintained. Allows you to see other downtown Jackson landmarks.",
  "This beautiful building is actually the third building that has housed first baptist church of Jackson. Great place to worship. ",
  "This church is truely a magnificent building. It is in perfect condition and looks like it has undergone a refurbishment in recent years. Worth a visit whilst in town. "
 ]
},{
 "name": "Mississippi War Memorial Building",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/c3/fa/6b/front-of-war-memorial.jpg",
 "tags": [
  "walking",
  "history",
  "structure",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d109489-Reviews-Mississippi_War_Memorial_Building-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "While walking around Jackson we decided to stop here. Nothing very special about the place but and interesting point of history.",
  "My husband is retired military and was very moved by the display. The architecture is breathtaking and the craftsmanship of the doors and display was very very good. A great piece of historical representation that I wish more would see and understand. ",
  "War historians should visit this before Vicksburg, another poinient lesson to the sadness of war, particuarly between brothers.",
  "How wars and war veterans are presented often tells us a lot about  how these events are regarded in contemporary times. Certainly they theme here is honour, and also gratitude for those who served. The monument is a large structure befitting the scale of the sacrifice that was made by those who served in the many wars that this country has been involved in. Worth a stop to pause and reflect on what others have given.",
  "A decent little structure giving honor to the Mississippi veterans which is great. The straight up design is OK but some of the inner details are very good. Worth it for a quick stop."
 ]
},{
 "name": "Cathedral of St. Peter the Apostle",
 "address": "123 N West St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/a5/5e/8c/sanctuary-of-st-peters.jpg",
 "tags": [
  "music",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563583-Reviews-Cathedral_of_St_Peter_the_Apostle-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Cathedral is just gorgeous.  It is one of the prettiest I have ever seen.  Stop by for a moment of quiet, you'll be glad you did.",
  "The cathedral is just beautiful. My husband and I were married here. Father Anthony is such a wonderful person, and we were blessed to hear from him during our time at this parish. The music at this church is beautiful and traditional as well. Finally, they offer a Spanish mass on Sundays as well.",
  "St. Peter's is just across the street from Smith Park which is right behind the Governor's Mansion.  All of the stained glass windows have recently been removed and totally restored.  The interior has been repainted and is beautiful.  This Roman Catholic Church serves the entire metropolitian area as well as the Hispanic Population in Jackson.  Worth seeing.",
  "The cathedral is just beautiful. My husband and I were married here. Father Anthony is such a wonderful person, and we were blessed to hear from him during our time at this parish. The music at this church is beautiful and traditional as well. Finally, they offer a Spanish mass on Sundays as well.",
  "I have toured, attended services here and been to weddings here.  The building is gorgeous.  The midnight mass on Christmas Eve is awe inspiring even if you aren't Catholic",
  "The Cathedral is just gorgeous.  It is one of the prettiest I have ever seen.  Stop by for a moment of quiet, you'll be glad you did.",
  "A very holy and architecturally ornate church.  I really like the Priest here, he is from Vietnam and is very understanding and close to God.  The security guard outside is really nice too.",
  "The cathedral is the \"Bishops\" cathedral, meaning it is where the Catholic Bishop for the Diocese presides during holy days of obligation and for some of the regular services.   As such, they are a little more \"formal\" in their services.. with a wonderful organ and cantors during the weekend services.    The members are diverse, with a separate hispanic service on Sundays as well.  The Cathedral itself is amazing inside.   While not as grand as you will see in major eastern cities, for Jackson, it it truly something to visit."
 ]
},{
 "name": "Belhaven University",
 "address": "1500 Peachtree St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "art",
  "history",
  "walk",
  "tour",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563582-Reviews-Belhaven_University-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Belhaven Is a great School that is constantly adding on and building new buildings. The campus is a little tuff to navigate and parking can be very difficult to find when classes are in session. Its also located in a very high crime and drug area. Use caution when you are in the areas on and surrounding campus. ",
  "Belhaven Is a great School that is constantly adding on and building new buildings. The campus is a little tuff to navigate and parking can be very difficult to find when classes are in session. Its also located in a very high crime and drug area. Use caution when you are in the areas on and surrounding campus. ",
  "There is so much history here.  A beautiful campus.  A must to go in a visit the class rooms.  My favorite is the Bitsy Irby Art and Dance Building.  Truly a work of art itself.",
  "We went to the University to walk around the lake.  Unfortunately the lake is no more than a pond now so they could add to the athletic fields.  ",
  "Rather too Christian for us but lovely none the less. Emphasis on  the arts and it had a BIG football stadium. ",
  "Belhaven Is a great School that is constantly adding on and building new buildings. The campus is a little tuff to navigate and parking can be very difficult to find when classes are in session. Its also located in a very high crime and drug area. Use caution when you are in the areas on and surrounding campus. ",
  "The focus of this review is on the aspect of touring the campus, rather than on the educational aspects of the school.  We were familiar with the campus since our daughter was graduated from the school and enjoyed a self-guided walking tour of the beautiful grounds and buildings on a lazy, pre-Thanksgiving Saturday.   The  buildings, both old and new, are interesting to see on this beautiful campus. We were able to Tour the arts building a see student projects displayed.  The campus itself is very nice. And, by the way, the education is excellent.",
  "Belhaven brought us to Jackson.  We loved the campus.  We loved the dance program.  All of the people who worked here were so friendly!"
 ]
},{
 "name": "Alamo Theater",
 "address": "333 N Farish St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5f/f2/fd/the-old-alamo-on-farish.jpg",
 "tags": [
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563581-Reviews-Alamo_Theater-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "When I was younger, I actually saw movies there. Since renovation, I attended several concerts and jazz events at the Alamo. Really enjoyable!",
  "I went to the Alamo as a child , admission price was 10 cents and 15 cents for Disney movies . They use to show 2 movies and a cartoon , sometimes a news reel between .\n\nThe Alamo was a Black only theater as Farish Street was booming back in the 50 ‘s ,60’s and , for Blacks .\n\nWith the coming times of integration , The Alamo  as well as Farish Street began to decline . \n\nI left Mississippi in 1969 , but I,still have fond memories of the \nAlamo Theater , and go by there when ever I’m in Jackson .\n\nMRM",
  "This building is located in an area that was supposed to be going through revitalization. The building looked like a fire trap and with it being in a High Crime Area and lots of homeless and undesirables in the area we decided to leave after seeing a drug deal go down.",
  "Historic theater operated by a not for profit board.  Yes we have movies and live shows based on the bookings.  We also have community events in the 200 seat theater.",
  "This a historically African American theater that has been restored located in the non restored Farish Street district of Jackson. The theater stays closed unless there is some very special event taking place, so there is really nothing to see unless they are open for a special event. "
 ]
},{
 "name": "Lamar Life Building",
 "address": "317 E Capitol St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/cf/6c/4a/lamar-life-building-once.jpg",
 "tags": [
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563596-Reviews-Lamar_Life_Building-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Perhaps I'm nostalgic or just enjoy a sense of history.  Throughout America, there are the Lamar Life Buildings, edifices that harken back not that long ago when America was much more entrepreneurial and local in it's opportunities.  Looking at the Lamar Life Building, one cannot help but think about the Jackson, Mississippi, and other American cities/towns that had a vibrant commercial existence.",
  "A really nice building. It has an art deco motif and dates from 1929.  There are some cool lofts on the upper floors.  On the ground floor there are some awesome fixtures from the past, such as the elevator, the old lettering, and a clock.  Very fascinating.",
  "This looks quite strange for a US city. Reminded me of the Houses of Parliament in London. A fine example of the beginning of the 20th century architecture.",
  "This is a historically significant, and valuable, office building built in the 1930s as the headquarters for Lamar Life Insurance. It has been practically empty for the past few years and renovation and restoration are planned by the current owner. The plan is to make it into both office space and apartments.",
  "Great architecture.One of most impressive buildings in Mississippi."
 ]
},{
 "name": "St. Andrew's Cathedral",
 "address": "305 E Capitol St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "music",
  "music",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d12274225-Reviews-St_Andrew_s_Cathedral-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "The architecture is gorgeous and the simple beaut of the sanctuary\nis inspiring.  A beautiful place to worship",
  "Not only is this a BEAUTIFUL venue, the folks are friendly, and it is an incredibly nice place to hear music!",
  "I have been a parishioner of St. Andrew's Cathedral since about 2002 and have served in various leadership capacities. I believe that we have a welcoming parish and excellent programs.  For this reason, I rate it excellent.",
  "St Andrew's has been around a long time and is well integrated into the downtown area.  The people and leaders of St A have worked hard to serve the city in ways.  If you are Christian and appreciate \"high church\" music and a great organ and have an open mind and compassionate heart, then this fine Episcopal church would be a great place to visit.",
  "Just across from the governor's mansion is St. Andrew's Episcopal Cathedral.  Not huge as cathedrals go, this lovely Gothic structure is a respite in the city.  Entering by the office building, we met a marvelous host and docent, Billy N., who showed us the various parts and was able to connect the major donors and vestrymen with historical names of the city.  With a grand organ and some important stained glass, this church has a lively ministry and is welcoming to the visitor.  Pictures are welcome and there is no charge."
 ]
},{
 "name": "Oaks Museum House",
 "address": "823 N Jefferson St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a8/f2/af/a-view-of-the-oaks-from.jpg",
 "tags": [
  "family",
  "history",
  "tour",
  "knowledgeable",
  "history",
  "family",
  "historic",
  "field",
  "tour",
  "family",
  "tour",
  "family",
  "walking",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d563609-Reviews-Oaks_Museum_House-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Oldest private residence in Jackson (1852).  Continuously owned by the Boyd family until sold to the Colonial Dames of America.  Some of the original furniture was made by inmates of the old State Penitentiary.  Close to other attractions including Old Capitol (1839), Governors Mansion (1842), State Capitol, Eudora Welty House, and the new Two Mississippi Museums (Civil Rights and History).",
  "There are many impressive things about The Oaks and I would encourage anyone to tour the home.  It is located in its original site, a rarity for historic homes of this age (1853).  As noted by other reviewers, this home survived the Civil War intact.\n\nBeth, the Director, was kind enough to arrange a tour for me the day of a lecture.  Cecile is a master gardener, who has invested a lot of time and love into painstakingly restoring the gardens to their original layout.  The museum is using old photos and consulting with several field experts to restore both the house and gardens to the original state as much as possible.\n\nA remarkable thing about this house is people HAVE begun coming forward with items belonging to the Boyds.  Family members and former boarders have returned artifacts owned by the Boyds to the home.  The docents are great about telling you the history of various pieces.  V.A. was extremely knowledgeable and I thank her for a delightful tour ($4.50 so I did not take my $0.45 AAA discount!).\n\nTruly a special \"peek\" into 1850s Jackson...",
  "After a week or so of visiting capitols, museums and grand old structures, a visit to Oaks House gave us an opportunity to better understand how a middle class family would have lived in the antebellum south. The home and garden tour were very nominally priced, the introductory video was helpful, and the information provided by the tour guide was helpful and informative. ",
  "But I was walking and knew the address. The front porch had just been painted so the docent told me..he did not put the flags out. It is not expensive to go in, but since I am in AAA, I got a 10% discount. The tour starts with a short film which tells you how the city of Jackson started and the citizens that made it happen. It was destroyed during the Civil War and the loyal citizens rebuilt the little city of Jackson again. This house received little damage when the Yankees were here. The Boyd family lived here for 3 generations until 1960..\n\nThe docent then proceeded to take me to every room and tell me how the family used the room and about the different furniture and articles. While I went to each room, I could visualize how the family lived at that time. My favorite room was the children's room because I liked the porcelain dolls there. After the inside tour, we went outside and I saw an original cistern and nice tended garden. There are books and postcards for sale. I bought a Civil War era book which comes with a CD!\n\nYou should really come and see this house if you are a history lover like me! But keep in mind that it is only open on TUesday and Friday!",
  "While in the area with my wife and daughter we wanted to see a few local sites. We stumbled across the Oaks House and hate that it was closed when we arrived. We took a self guided tour around the grounds and took several photos. There is no doubt that if we had been able to see the inside we would have enjoyed it. If we every get back to Jackson I would think we would try again. "
 ]
},{
 "name": "Russell C Davis Planetarium",
 "address": "201 E Pascagoula St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "unique",
  "field",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d109485-Reviews-Russell_C_Davis_Planetarium-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "When we walked in there were painting cloths, furniture moved overall a mess. Thought for sure the place was closed , it was not.  Since we were the only ones there, the manager let us pick the movie we wanted to see.  He was extremely nice.",
  "Like other reviewers, I have to say this place is in sore need for updating and it's a crying shame that the city doesn't support this adequately.  That said, our Grandkid's Spring Break was different from the local schools and we were the only one's there, but the staff treated us royally and turned what could have been an awful experience (because of a car-sick kid) into a fun, unique outing.",
  "First I want to commend all the employees. Our school trip was great. The employees were very nice and did a great job. The engineer that ran the equipment took time to talk about the equipment and the movie we were to watch. Now on to the average rating I gave. The facilities have not been updated since at least the very early 1980's. It is poorly lit, dingie carpet, and smelled bad. It is obviously under funded by The City of Jackson, MS. I do not understand why the City of Jackson will not invest money back into things that obviously make the city money. This is a popular school field trip location. Tens of thousands of children visit this location every year. There was no Security or Police precence in this high crime area. I say shame on you City of Jackson for not maintaining this facility better. The City and Visitors deserve better. ",
  "I didn't realize this place only showed movies. We just happened to walk in 10 minutes before a showing of Black Holes so we went in. It was our family and one other couple. The movie was alright but I thought this place would offer more learning experiences. The gift shop is non existent, don't let the sign fool you. 😀",
  "This planetarium is really small, but they make do with what they have, and really offer an exceptional educational experience."
 ]
},{
 "name": "New Stage Theatre",
 "address": "1100 Carlisle St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "family",
  "kids",
  "performance",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43833-d11773316-Reviews-New_Stage_Theatre-Jackson_Mississippi.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our family has gone to a Christmas Carol every year that they have it since our now grown kids were young. We always take new people with us so that they can enjoy the experience. My wife always gets seats on the front row so that we can really enjoy the quality production. We enjoy the very talented cast that we are fortunate to get in Jackson. The stage props are very well done also. I would recommend any of their other performances as well. You cannot go wrong here.",
  "We are season subscribers to New Stage, Mississippi's only professional theater company and have been for over 10 years. The productions are well done and generally thought-provoking.",
  "In town for one night and were lucky enough to see an outstanding performance of Tennessee Williams's Babydoll play.  Large theater and good quality productions seem to happen at this theater ",
  "New Stage just completed another \"season\", finalizing with its BEST performance this year:  \"Million Dollar Quartet\".  What a night!   What amazing performances!  Such an enjoyable season, but this, by far, was the best!"
 ]
}]
