[
{
 "name": "Missouri State Penitentiary",
 "address": "115 Lafayette St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/00/3e/a9/this-place-is-huge.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "knowledgeable",
  "tour",
  "tour",
  "history",
  "tour",
  "tour",
  "knowledgeable",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d2314490-Reviews-Missouri_State_Penitentiary-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I visited MSP for the 6PM 2 hour history tour. There were about 15 in our group, our hosts were Michael and Vern. The tour started right on time and Mike and Vern are a treasure trove of knowledge and experience ( Vern former guard) explaining history and real life stories of some of the inmates. A great snap shot of how past times were at the prison. Michael has a great voice, we never had difficulty hearing him. The hosts never seemed like they were simply “regurgitating” the information, they were very engaged with the material and that promoted guest engagement. \nThey recommend bringing a flashlight, and it IS required for your ‘solo’ explores....but don’t bring a high powered one, it kind of detracts from the experience. Buy your tickets at former warden’s home, which has a great little museum included in ticket cost. ENTRANCE TO PRISON is on Lafayette ST. Hugely enjoyable. ",
  "What a great tour!! Just wish we’d have gone on the night ghost tour!! Very knowledgeable tour guide!",
  "My wife and I took the tour and it was very informative and fun! Our tour guides were Mike and Aloha and both made our 3 hour tour an enjoyable experience by sharing a world of knowledge about the penitentiary. Mike being the main tour guide speaker, did a fantastic job with inflection, projection, and you really could tell he enjoyed what he did which I appreciated greatly. Aloha also played an important roll too not only answering questions when Mike wasn't but was also busy preparing the next place to see. She too had a lot to say which made a great pairing. Thanks for the experience!",
  "Q微信56300017澳大利亚UoN毕业证丨澳洲纽卡斯尔大学文凭成绩单（学历学位证）学生卡驾驶证回国人员证明留信认证雅思托福（Offer）The University of Newcastle, Australia diploma",
  "Some friends and I drove down here for a photography tour of this facility. Even though some of it was closed due to tornado damage we didn't run out of things to tour with our 5 hours. Our guide, Larry, was absolutely amazing. He showed us around, shared incredible stories, and was patient with us as we stopped frequently to photography. It was an exceptional experience that I would highly recommend if you enjoy abandoned places and history.",
  "The tour guide was amazing, he was able to be heard from any position in the tour (back of the group or front), his personal anecdotes were very entertaining, great personality, all around an amazing tour, very highly recommended!!",
  "Good tour.  Our guide was very knowledgeable and we were never rushed.  We stopped here on our road trip.  It was a little out of the way but well worth it.  Too bad one of the buildings we were not allowed to enter due to damage.  ",
  "My husband and I went on a 2 hour history tour of this facility and enjoyed it very much.  We had been on other prison tours but this was particularly outstanding.  Our tour guide, Michael, played a huge role in our enjoyment of the tour.  He was a talented and very interesting speaker.  It was obvious that he loved what he was doing.  The stories and history he shared greatly enhanced the tour.  Even though one of the buildings was not open at that  time due to tornado damage sustained earlier in May, it was still an excellent tour.  All of our tour group were given plenty of time to look into the prison cells and never made to feel like we were being hurried along.    The volunteer who assisted with our tour was friendly and gracious.  The price of the tour was also very reasonable.  I would highly recommend this tour to anyone who enjoys visiting old prisons and jails.  "
 ]
},{
 "name": "Missouri State Capitol",
 "address": "201 W Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8f/11/41/missouri-state-capitol.jpg",
 "tags": [
  "historic",
  "historic",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d1154039-Reviews-Missouri_State_Capitol-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very historic building with an awesome museum. Currently under significant renovations in preparation for Missouri's 2021 Bicentennial. August 10, 2021, will mark the two hundredth anniversary of Missouri's entry as the 24th state to enter the United States",
  "and complete the refurbishment, the outside will be as lovely as the inside. The rotunda with its murals is gorgeous. The majestic halls, massive wooden doors and the historic elevators punctuate the impressive marble throughout the building.",
  "I just love places that Rick of history in this one does. The Benton murals if you have never seen them are worth the trip alone but there’s a great deal of other artwork that is gorgeous too. The guides do an excellent job as well",
  "We enjoyed the tour and recommend it for anyone slightly interested in history. The Capitol has some beautiful areas that you only get to see with a guided tour (you can do the tour on your own but aren't granted access to a couple of things).",
  "Excellent tour guide who was very knowledgeable and had clearly been doing this for a number of years. Incredible mural \"A Social History of the State of Missouri\" by Benton which has to be seen to be believed.  Beautifully painted dome on the interior.  Outside was under major renovation when we were there sadly so mostly covered up, but didn't affect our enjoyment of the inside.  Slightly confused as to why there was a religious service taking place in the middle of this political building when we were there.  Well worth a visit."
 ]
},{
 "name": "Runge Conservation Nature Center",
 "address": "Hwy 179",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/22/4b/21/mossy-rock-trail.jpg",
 "tags": [
  "family",
  "walking",
  "hike",
  "walk",
  "hike",
  "walk",
  "hike",
  "kids",
  "nature",
  "hike",
  "walk",
  "nature",
  "walk",
  "walk",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d4071968-Reviews-Runge_Conservation_Nature_Center-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Runge center offers a great way to escape during the lunch hour, it is located in the middle of Jefferson City within minutes from most office buildings.  The trails are not paved, so make sure to pack your walking shoes.  The thing I love the most is watching the animals play.  You are likely to see deer, squirrels, chipmunks, and a host of other wildlife frolicking around the trails.  Bring a camera and snap some family photos!  The information center is great as well.",
  "This is a great place to take a quick hike. The trails are maintained very well and are easy to walk. These are not advanced trails, but if you want an easy stroll through a beautiful countryside, you'll love these trails. ",
  "This is a great place to take a quick hike. The trails are maintained very well and are easy to walk. These are not advanced trails, but if you want an easy stroll through a beautiful countryside, you'll love these trails. ",
  "Great spot for a lunchtime hike or quick getaway to Mother Nature.  Great inside museum/center for kids.  In the summer, might want to put on the bug spray and wear a hat.",
  "The trails are all really well marked.  This place is wonderfully close to the heart of the city and available for a quick walk or hike.",
  "Took granddaughter and she was fascinated.  She loved the presentations and viewing of animals, in addition to outside trails.",
  "We were in the area and had some time to spare so we went for a walk through the nature center. It was pretty neat. There were multiple trails, and we saw a muskrat in the little creek when we walked over the bridge. ",
  "We had visitors from Chicago with us.\nWe wanted to show them what was available to see as far as animals, plants, ect. in Missouri. We didn't walk the trails there, but I have heard they are wonderful. But it was very hot that day so we stayed in the air conditioning. The people are very knowledgeable there. Very helpful. Lots of displays."
 ]
},{
 "name": "Lewis and Clark Monument Trailhead Plaza",
 "address": "Corner of Jefferson Street and Capitol Avenue, Capitiol Complex",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/ac/0b/2a/lewis-and-clark-monument.jpg",
 "tags": [
  "historic",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d8549128-Reviews-Lewis_and_Clark_Monument_Trailhead_Plaza-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "I am so pleased to see that York is included in this monument to the brave souls who undertook this expedition. The omission of Sacagawea is a serious oversight.The location of the monument overlooking the Missouri River is poignant.",
  "Nicely landscaped area,displaying Lewis and Clark on their historical trek!  State capital building is close by!",
  "Lewis & Clark Monument Trailhead Plaza is a nice area for a leisurely stroll in the historic area near the Capitol building.  The monument and the fountain are beautifully made.  The Plaza serves as a trailhead for the trail going to Katy Tail at the North Jefferson Recreation Area across the Mississippi River or to the trail going to Cole County Park on the east side.\n\nI just wish there were more paths for walking around the monument like beneath the fountain plaza so that the sounds of the waterfall could be enjoyed more,  Anyway, this is a nice place and do not miss it if you are in the area.",
  "    If you're at Jefferson landing, the capitol or the governor's mansion make the extra 5 minute walk to see the monument and read the historical markers. \n    The park is small but beautiful. ",
  "L and C MTP is great if you're in the area, but i wouldn't make a special trip for it. there are some cool statues and a fountain. there are more in the capitol."
 ]
},{
 "name": "Museum of Missouri Military History",
 "address": "2405 Logistics Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/ce/6f/84/m551-sheridan-tank.jpg",
 "tags": [
  "unique",
  "historic",
  "knowledgeable",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d614333-Reviews-Museum_of_Missouri_Military_History-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Every visit is a unique and new experience. The changing displays are always amazingly well put together with real, authentic, historic materials. ",
  "We enjoyed the visit.  The first exhibit, the Lost 52 highlights and honors the 52 submarines lost in World War II.  There were a number of Missouri men on these marines.  There are some Civil War displays and Spanish American War displays.  We especially liked the WWII displays.  Great artifacts.  A number of items are removed, but there is still plenty to look at.  The Museum emphasizes Missouri veterans.  Takes about an hour and a half.",
  "This is really a great military museum. They have a number of really good examples of military hardware. Tanks, planes, guns, etc.\nThe gentleman that came out and told us about the various pieces was real nice and very knowledgeable. He gladly answered questions.",
  "The museum is run by volunteers and opened a few minutes after the scheduled time. So glad we waited. It was well worth it. Volunteer gave us a personal tour. Definitely check this museum out!",
  "Our Boy Scout Troop was in Jefferson City touring historical sites and we found out that there was a military museum close by  so we added it to our trip.  It is about 5 miles or so from the capital building.  We arrived at the gate about 3pm and were welcomed by friendly security staff after showing them our drivers license and issued our visitor badges we were allowed in.  This museum is located at the Missouri headquarter for the Missouri National Guard.  The museum is made up of two parts and indoor section that has items of history with displays and descriptions of items and events, the out door part has retired planes, tanks, artillery, with description of the equipment.  The museum is not large and we toured and felt like we had time and I would say we were there for an hour and half.  The guide that was working the museum was friendly and knowledgeable, he did not pressure us to leave even though the museum's closing hour was 4pm and we were the past that.  I would recommend touring the military museum if you are in Jefferson city and like to see historical places and things.  I am glad we toured the museum and will add this to our scout activities when in Jefferson city.  They do recommend if you are going to have more than 10 guests to let them know, we had more than 10 but as I said the guide was very accomidating."
 ]
},{
 "name": "Missouri State Museum",
 "address": "201 W Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/21/0f/ce/getlstd-property-photo.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "tour",
  "history",
  "learn",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d12524608-Reviews-Missouri_State_Museum-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Missouri State Museum was a surprise find for me when I went inside the State Capitol building to go on the Capitol Tour in Jefferson City.  Since I was there a little early for the tour, the Front Desk Staff told me that I could visit the museum on the first floor.  And, indeed I was so surprised at all the things that are presented in the museum that I spent a considerable time at the museum after the Capitol Building tour.  \n\nThe museum has several sections depicting several themes.  There is a section on Missouri contributions to the Great War (WWI) that children will enjoy, a section on the early inhabitants of Missouri has beautiful dioramas, and the section on resources has a large number of displays on how the Missouri River has influenced the State’s development.  At one end of the hall is an exhibit honoring Missouri Veterans which has large model of the battleship Missouri.  One can easily spend an hour or two going through the museum.   Do not miss the picture cutout of Ella, the more than 8-ft tall Missouri woman.  \n\nThis is a very good state museum.",
  "The museum is in two wings of the first floor of the State Capitol and a area at the southeast end of the southeast wing. It is divided into three sections: Resources, History, Missouri Veterans Gallery. It is about what you would expect, exhibits of artifacts, historical items, maps and labels, models, and graphics. The Veterans Gallery has a large model of USS Missouri. Being placed in the Capitol makes it a little inconvenient unless you are doing the Capitol tour or have other business there.",
  "The museum is lovely and accessible, and it's in the State Capitol. i also recommend taking the tour of the Capitol building. It's beautiful. The tour lasts about an hour and gets you into some place that you cannot access on your own -- like the senate lounge with the thomas Hart Benton murals. You can see a reproduction in the museum, but the room with the originals is really something special. The building is great, the tour is informative, and the museum is really nice",
  "The buliding is very nice and well kept.  The displays are interesting and informative.  Lots of Missouri history that I was totally unaware of.  The staff is helpful and very friendly.",
  "The museum was a wonderful place to learn (re-learn) my home state's history. The story is told in diorama, artifact displays, hand on kiosks and murals. ",
  "Take time to read...and enjoy noting the offices and the doorway decor of our representatives and senators. Interesting!",
  "Missouri State Museum was a surprise find for me when I went inside the State Capitol building to go on the Capitol Tour in Jefferson City.  Since I was there a little early for the tour, the Front Desk Staff told me that I could visit the museum on the first floor.  And, indeed I was so surprised at all the things that are presented in the museum that I spent a considerable time at the museum after the Capitol Building tour.  \n\nThe museum has several sections depicting several themes.  There is a section on Missouri contributions to the Great War (WWI) that children will enjoy, a section on the early inhabitants of Missouri has beautiful dioramas, and the section on resources has a large number of displays on how the Missouri River has influenced the State’s development.  At one end of the hall is an exhibit honoring Missouri Veterans which has large model of the battleship Missouri.  One can easily spend an hour or two going through the museum.   Do not miss the picture cutout of Ella, the more than 8-ft tall Missouri woman.  \n\nThis is a very good state museum."
 ]
},{
 "name": "Missouri State Penitentiary Museum",
 "address": "700 E Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/53/1f/42/the-museum-resides-in.jpg",
 "tags": [
  "tour",
  "history",
  "walk",
  "tour",
  "tour",
  "tour",
  "free",
  "tour",
  "field",
  "history",
  "tour",
  "free",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d12098435-Reviews-Missouri_State_Penitentiary_Museum-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "We enjoyed the two hour tour! Our tour guide knew a lot of the history of the prison because he worked there for many years.",
  "To visit, park on the street in front of the house and walk down the drive on the right hand side. Very interesting artifacts and information and the ladies who work there are lovely!",
  "Went here after our tour of Mo State Penitentiary.   A lot of pics, stories and jailhouse contraband as well as items made by inmates over the years the facility was open.  ",
  "Just across the street from the exterior wall of the prison, located in the lower level of a beautiful Victorian home, you will find this neat little prison museum. Lots of facts and figures. Lots of pictures and historical pieces. The museum puts the icing on a trip through the prison. This fills in a good many details that could not be provided because of time in the prison tour. It's a good stop. It's close by, and it's well worth the time.",
  "We enjoyed going here after visiting the Missouri penitentiary. It made what we learned at the prison even more interesting. The museum is free with a prison tour receipt.",
  "Had a great time on my son's 7th grade field trip. Very informative.  Great tour guides.  Tour last 2 hours. Lots of great history.  Great for home schoolers too",
  "The museum is in the basement of the warden's home.  It contains information about past inmates and some of the contraband that collected while the prison was open.  It is definitely worth a stop in and it is free if you take the prison tour. ",
  "We enjoyed the two hour tour! Our tour guide knew a lot of the history of the prison because he worked there for many years."
 ]
},{
 "name": "Governor's Mansion",
 "address": "100 Madison St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/3d/59/de/governor-s-mansion.jpg",
 "tags": [
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d279110-Reviews-Governor_s_Mansion-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Mansion is extra special when decorated for Christmas. The big tree in the yard and the holiday decorations give it a nice touch. It is nice to visit in all seasons but the Christmas holiday is extra special. ",
  "There's very little doubt the architect was a fan of Versailles, right down to the formal gardens and ironwork. The mansion's dark mansard is the finishing touch. The result is weird enough to be funny while managing to be attractive and even beautiful from some angles. If you cast about a bit you can probably even find free parking.",
  "Governor's Mansion near Capitol building. Well kept grounds with adjacent garden. When renovations completed the tours are limited to Tuesday, Wednesday and Thursday.",
  "You can get a little more detail about the prison here at the Mansion.  Several artifacts and pictures.",
  "Its being restored/renovated so you can only see the exterior. The exterior is beautiful and within view of the Capitol as well as right above the gardens."
 ]
},{
 "name": "Binder State Park",
 "address": "5840 Rainbow Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "parks",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d12878285-Reviews-Binder_State_Park-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is good for a quick stop, picnic, fishing, easy hiking, or overnight camping. The pavilion offers a covered spot for your lunch or dinner. There's also a large grassy area across the road with volleyball nets as well.",
  "This is a very nice park, and it is a great spot for local people to try out their camping skills before embarking on a long trip.  ",
  "This is good for a quick stop, picnic, fishing, easy hiking, or overnight camping. The pavilion offers a covered spot for your lunch or dinner. There's also a large grassy area across the road with volleyball nets as well.",
  "Had a blast camping at one of our favorite local parks over the weekend. It was just a quick shakedown but great to be out in the camper. Love all the outdoor activities at Binder. Plus the campground is open year round!",
  "This City of Jefferson City owned park is amazing. Located only 15 minutes from downtown. It can accommodate most size rigs. It has full hook-ups. Opened year round with heated/air conditioned shower house. Currently it is only $22.00/night. Park staff is very helpful and friendly. Only draw back is that sites are limited. We highly recommend reservations.",
  "I took my kayak out on the lake just a couple nights ago. I took my fishing rod but didn't even get a nibble. It was a really nice night though, so I had a great time paddling around and casting for fish.",
  "The park is nice to sit out and watch the water. People go there to fish and walk around the park. During the summer some people come and have picnics.",
  "This is good for a quick stop, picnic, fishing, easy hiking, or overnight camping. The pavilion offers a covered spot for your lunch or dinner. There's also a large grassy area across the road with volleyball nets as well."
 ]
},{
 "name": "Jefferson Landing State Historic Site",
 "address": "100 Jefferson St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f3/6c/9e/20190613-144928-largejpg.jpg",
 "tags": [
  "tour",
  "walking",
  "tour",
  "walking",
  "history",
  "knowledgeable",
  "tour",
  "walking",
  "tour",
  "walking",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d12718015-Reviews-Jefferson_Landing_State_Historic_Site-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Jefferson Landing is an interesting historical preservation area worth short trip to downtown Jefferson.  The State has done an excellent job in preserving the Lohman House as a general store museum.  Historical displays and artifact sin the museum are quite informative.  There is a movie theater in the museum, but the docent informed me that the movie is more about the Capitol Building, and since I had just completed the Capitol building tour, the movie would be quite redundant.   There is a small shelf-ful of novelty items for sale in the General Store also.  \n\nNear Lohman House is an arts gallery, the Carnahan Gardens and Lewis & Clark Monument Plaza all within short walking distance.  Of course, the State Capitol Building Is not too far away.  So one could make visiting all these attractions a worthwhile trip to downtown Jefferson.",
  "My Boy Scout Troop was in Jefferson City touring historical sites and we toured the Jefferson Landing.  The landing is close to the Capital building, with in walking distance.  We had scouts working on their Citizenship in the Nation merit badge and there a couple of Registered National places at the landing, and this is a great place to visit as part of an historical tour of Jefferson city.   While in Jefferson City I definenatly recommend visiting the landing, the buildings are interesting as well as the history behind them.  There a very nice guide that was very knowledgeable and helpful.",
  "Not Much to see here. Just an old Building next to the railroad tracks. Really don't waste Your time.",
  "The place is a monument to 19-th century architecture and a good place to observe how US landscape (amd Missouri in particular).",
  "Jefferson Landing is an interesting historical preservation area worth short trip to downtown Jefferson.  The State has done an excellent job in preserving the Lohman House as a general store museum.  Historical displays and artifact sin the museum are quite informative.  There is a movie theater in the museum, but the docent informed me that the movie is more about the Capitol Building, and since I had just completed the Capitol building tour, the movie would be quite redundant.   There is a small shelf-ful of novelty items for sale in the General Store also.  \n\nNear Lohman House is an arts gallery, the Carnahan Gardens and Lewis & Clark Monument Plaza all within short walking distance.  Of course, the State Capitol Building Is not too far away.  So one could make visiting all these attractions a worthwhile trip to downtown Jefferson.",
  "This is a worth a stop, and the good thing is you only have to stay about 15 minutes to take it in. It's interesting but pretty small. ",
  "Visited Jefferson Landing with a two year old.  The building stands right by the railroad tracks which thoroughly thrill 2 year old boys.  Informational inside with antiques.",
  "My Boy Scout Troop was in Jefferson City touring historical sites and we toured the Jefferson Landing.  The landing is close to the Capital building, with in walking distance.  We had scouts working on their Citizenship in the Nation merit badge and there a couple of Registered National places at the landing, and this is a great place to visit as part of an historical tour of Jefferson city.   While in Jefferson City I definenatly recommend visiting the landing, the buildings are interesting as well as the history behind them.  There a very nice guide that was very knowledgeable and helpful."
 ]
},{
 "name": "Cole County Historical Museum",
 "address": "109 Madison St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/ed/e6/c1/the-cole-co-historical.jpg",
 "tags": [
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d1157316-Reviews-Cole_County_Historical_Museum-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was in town with some friends who are really into history and thought this would be a fun place to stop in at. The admission is only $3.00 and it is a guided tour. The guide we had was so much fun and very informative about all the different pieces. We were the only ones on the tour so it made it easier to look around and move onto the next area as we wanted. They had dressed and paintings of some of the first ladies of Missouri. They also had a civil war room with relics and an \"attic\" sat up with different old items like baby dolls, and different toy and baby items. I highly recommend stopping in as it give you a new perspective of the area!",
  "This museum doesn't look like much from the outside, but it has a lot of interesting historical pieces inside. It's not far off of Main Street, but parking is pretty easy. The curators/docents/tour guides are very knowledgeable, and give great glimpses into the past of Jefferson City, Cole County, and Missouri.",
  "I went to the door only to find you enter at the back of the building.  I was greeted by two very friendly ladies and given a tour, the row house this museum is in is just beautiful, it has so much character and was a pleasure just to explore it!  But then add in the gown room featuring the dresses the governors wife's have worn, and all the other excellent displays and you just can't go wrong if you enjoy a bit of history. ",
  "This is an okay place to visit.  However, there are many more fun and historical places to visit in Jefferson City.  I have visited many large museums around the U.S. so I'm probably too much of a critic.  ",
  "If you have the time to spare, this is a well laid out interesting smaller museum.   It is across from the beautiful Missouri Governor's Mansion. "
 ]
},{
 "name": "Miller Performing Arts Center",
 "address": "501 Madison St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "performance",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d2266031-Reviews-Miller_Performing_Arts_Center-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "I went there when our local Helias Catholic High School did their performance of \"Footloose\".  This performance was excellent!  Tickets for students were $10 and $15 for adults (non-students).  The center has lots of events through out the year.  It is similar to going to the Fox Theater in St. Louis, Mo.  It is a more casual place and you will see people in business suits to blue jeans.  The events there vary in variety and in price.  Great local place for a wonderful experience.",
  "The Miller Center is a lovely refurbished auditorium.  Acoustics are excellent.  Great parking.  If you have time, look at the artwork in the Railton Art Gallery on the upper level of the building.",
  "The facility was at one time a high school and then later a jr. high school.  It has been renovated into a Performing Arts facility. The auditorium is beautiful with all seats having a good view of the stage.",
  "One of my favorite places I've performed or attended. Truly not a bad seat in the house, and there are a lot of both local and traveling acts that perform.",
  "I have performed in several shows here, and witnessed a number of others. The level of professionalism and effort to produce excellent entertainment exceeds my expectations. Every show has been a memorable experience."
 ]
},{
 "name": "Veterinary Medical Foundation Museum",
 "address": "2500 Country Club Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/80/15/ef/veterinary-medical-foundation.jpg",
 "tags": [
  "field",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d13948114-Reviews-Veterinary_Medical_Foundation_Museum-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Museum is small but has a lot of historical items used in the teaching and study of veterinary science. Is good for all ages.",
  "Way cool. Small inside one side of a working vet office. Donations accepted. Terrific insight to history of veterinary field starting in Europe first. Then it covers the US & MO how it came to be. Cool artifacts. Pet friendly, brought our two Yorkies with us. Lots of old pics, books & so on. Would recommend & wont take much time out of your days plans. ",
  "This is a small museum but oh so interesting. We took our grandchildren and they all found some things that interested them. It is definitely worth a visit.",
  "Loved this place but i thought it was small. I love animals and wished it was bigger. Very educational. make sure you bring a penny you can get one smached lol",
  "We always enjoy visiting this small museum when we are in Jefferson City. Our visit last Wednesday was both fun and educational. The museum does not charge an entry fee but does take donations, so you will want to have cash on you for the donation box. There are a number of interesting displays for those interested in veterinary history and/or animals."
 ]
},{
 "name": "Colonel Alvin R Lubker Memorial Safety and Education Center",
 "address": "1510 E Elm St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/e2/da/57/old-highway-patrol-vehicles.jpg",
 "tags": [
  "history",
  "free",
  "history",
  "free",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d10513721-Reviews-Colonel_Alvin_R_Lubker_Memorial_Safety_and_Education_Center-Jefferson_City_Missou.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located on the bottom floor of the Highway Patrol Headquarters building. Really interesting. Took about 45 minutes to go through.",
  "For the fans of the men and women in blue! This is a must see! It provides a lot of history! You will be able to look at the progress that has been made in the tools of the trade! ",
  "I'm a history nerd with an interest in Bonnie and Clyde, so when I learned my hometown had several artifacts from their crimes on display, for free no less, I decided to check it out. If you're in the area and want to kill a few hours, I'd check it out.",
  "The museum is free to go to.  Has wonderful information about the highway patrol and gives you a view from the other side of things. ",
  "I take a lot of out of town guests to this Highway Patrol Museum.  It is very interesting for all ages.  Lots of people who live in Jefferson City have never been here.  That is a shame because it is a great museum.  It is free and it only takes an hour to walk around the facility."
 ]
},{
 "name": "Missouri Supreme Court Building",
 "address": "207 W High St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/f9/09/af/img-20181004-135909-largejpg.jpg",
 "tags": [
  "library",
  "tour",
  "library",
  "kids",
  "tour",
  "library",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d10522562-Reviews-Missouri_Supreme_Court_Building-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Worth checking out if you are touring Missouri State buildings. You can view the law library, court rooms, and beautiful architecture.",
  "I was in Jefferson City for a conference at the Capitol Plaza, and I decided to make a quick visit to the Supreme Court building, which is just down the street.  The building is open to the public throughout the week.  You just go in the front door, and then you have to clear security.  Security was not a big problem, but they make you check your cell phone at the door before they allow you access to the building.  If you want a tour, you head upstairs to the law library.  The tour guide was out on the day I visited, but the state law librarian gave me a very informative tour of the building.  The experience was interesting, but if you are new to Jefferson City - or especially if you are bringing kids to Jefferson City - do the Capitol first, and maybe even the Governor's Mansion.  The Supreme Court building is interesting, but probably not as engaging or as important as those two places.",
  "Not sure if you can enter the building but we just took pics from the outside of the red building located across the capitol",
  "Very interesting. Tour guide was amazingly helpful and informed. Make sure you make an appt with someone. The law library was very interesting to see. ",
  "You should definitely stop by and check this out if you go see the capitol and governors mansion. History at its best..."
 ]
},{
 "name": "Scene One Theatre",
 "address": "619 E Capitol Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "theatre",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d12163273-Reviews-Scene_One_Theatre-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you love black box or small theatre venues, please visit when in Jefferson City. Theatre that's bully or theatre for adults. Very professional and well done always.",
  "A place for performers. directors, technicians, and audience members to experience intimate, edgy, and well produced theatre."
 ]
},{
 "name": "Ellis-Porter Riverside Park",
 "address": "300 Ellis Porter Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "family",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d15201619-Reviews-Ellis_Porter_Riverside_Park-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Always enjoy visiting this park. The park offers a large pavilion with kitchen, picnic areas, amphitheater, walking trails, a Missouri River overview, playground, baseball fields, basketball court, and a swimming pool. It is a great place for family and/or group activities.",
  "Pool, amphitheater, river overlook, covered shelter to rent, walking trails and to top it off there is a wonderful playground that my grandchildren loved.",
  "well maintained park with concrete surfaced paths for jogging or bike riding, scenic overlook, 3 walled racquet ball courts, large picnic pavilion, and individual covered picnic tables, bathrooms, playground and a seasonal activities such as swimming pool and amphitheater."
 ]
},{
 "name": "Jefferson City National Cemetery",
 "address": "1024 E McCarty St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/02/97/1d/jefferson-city.jpg",
 "tags": [
  "history",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d14109508-Reviews-Jefferson_City_National_Cemetery-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "The first eight days of November each year, visiting a cemetery and praying for the occupants, gains great graces and give one an opportunity to reflect on those who've gone before us.",
  "Being a history teacher and the son of a WWII veteran, I had the privilege of taking several of my US History classes to this cemetery to meet veterans and for them to speak to \"primary sources\"  instead of reading about the wars in a history book.",
  "I have friends buried here.  This is a quiet and serene setting.  It truly honors those veterans who gave their all.",
  "Historic cemetery for soldiers of American Civil War that became recognized as a National Cemetery in 1867. The cemetery has around 1,792 burial sites. It is an impressive memorial to bitter Civil War conflict fought in Missouri."
 ]
},{
 "name": "Capital Arts",
 "address": "1203 Missouri Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d1/5c/91/getlstd-property-photo.jpg",
 "tags": [
  "art",
  "affordable",
  "unique",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d8041283-Reviews-Capital_Arts-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Capital Arts is an awesome art gallery the offers affordable artwork by local artists.  The gift shop has unique items all year round and they stock up during Christmas season!  \n\nWe had about 10 girls meet at the gallery for a painting class.  We brought our own drinks and snacks and told the teacher what we wanted to do.  A great time was had by all! ",
  "The exhibits are interesting, rotate from time to time, sometimes local school submissions, some professional pieces as well.",
  "There is always featured artists displayed.  The most recent was artists that submitted paintings that fit the criteria for transportation.  One of my friends did an awesome watercolor. He does beautiful work.  I had an oil but unfortunately missed the deadline for entry.  There are other items throughout also.  Some of the works can be purchased.",
  "This is a very nice art gallery. It is clean and consistent. There is usually different dhows during the year that you should defiantly see. The art is sometimes for sale and is a semi-reasonable price. There are very good local artists who deserve to be recognized in this museum. I recommend you stop by and see it for a little. e",
  "This is a wonderful way to see works by local artist. Art is available for sale at reasonable prices for the quality.  Great place to appreciate the local talent and buy great art!"
 ]
},{
 "name": "Missouri Boulevard Antique Mall",
 "address": "1415 Missouri Blvd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/fd/e7/72/photo1jpg.jpg",
 "tags": [
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d16962782-Reviews-Missouri_Boulevard_Antique_Mall-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "I hit this antique mall 4-5 times a year but this is the first time I have been there since the ownership changed.  It is now a foo foo boutique type mall instead of good antique stuff.  The whole first floor isn't really worth walking through and the 2nd floor is only a little better.  Won't be going back any time soon.",
  "Loved this great antique shop. Lots of new vendors coming but not yet filled. Found some great treasures and everyone was nice and very helpful. Will come back next time I’m in town. "
 ]
},{
 "name": "Yellow Moon Antique Mall",
 "address": "508 Broadway",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/fc/4e/4e/photo0jpg.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d16948426-Reviews-Yellow_Moon_Antique_Mall-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don't bother with those other flea market/ garage sale places that advertise as antique malls. Tom makes an effort to keep our the garage sale stuff and it shows. The arrowhead collection on display is worth the trip by itself. They will also buy your grandmothers stuff if you are ready to part with it.",
  "Lots of legit antiques and cool retro collectibles here. Was actually pretty impressed with the quantity and quality of smalls here. A lot of pricey stuff too. Didn’t buy anything on this trip but I’ll be back thru next time I come to town. "
 ]
},{
 "name": "Jefferson City Museum of Modern Art JCMOMA",
 "address": "220A E High St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "art",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d15144517-Reviews-Jefferson_City_Museum_of_Modern_Art_JCMOMA-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": [
  "Took our third graders for a field trip.  Fantastic hospitality shown by owner and docents of the gallery.  Yes we had to make an appointment, but it was well worth it.  Learning about artists unknown to our students, their stories and how they told them through their art was engaging for students and adults alike.  Looking forward to making arrangements for next year!",
  "Virtually no hours, very few pieces to observe.  Hardly a mueseum, more like a private show on a very limited schedule."
 ]
},{
 "name": "Carnahan Memorial Garden",
 "address": "Corner of Capitol Avenue & Jefferson Street",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d18185394-Reviews-Carnahan_Memorial_Garden-Jefferson_City_Missouri.html",
 "source": "TripAdvisor",
 "reviews": []
},{
 "name": "Gracie Barra Jefferson City Brazilian Jiu Jitsu & Self Defense",
 "address": "1850 Route C Suite A",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/04/01/d6/caption.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g44526-d17649114-Reviews-Gracie_Barra_Jefferson_City_Brazilian_Jiu_Jitsu_Self_Defense-Jefferson_City_Misso.html",
 "source": "TripAdvisor",
 "reviews": []
}]
