[
{
 "name": "Mendenhall Glacier Visitor Center",
 "address": "8150 Mendenhall Loop Rd Tongass National Forest",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/1e/1f/af/mendenhall-glacier.jpg",
 "tags": [
  "tour",
  "hike",
  "tour",
  "hike",
  "tour",
  "hike",
  "walk",
  "learn",
  "tour",
  "hike",
  "hike",
  "walk",
  "walking",
  "walking",
  "walk",
  "tour",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d105339-Reviews-Mendenhall_Glacier_Visitor_Center-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Getting here.   If arriving on a cruise ship, you can get off your ship and take the MGT Blue Glacier Express bus.  This now costs $20 round trip.  If you ask for any other one, it will be much more expensive.   Do not take a private tour (taxi) - they will charge you a lot.   The only way this could work out is if you have a can full.  \n\nThe blue bus runs at intervals throughout the day and takes you from the cruise ship area (near the Mount Roberts Tramway) to the Parking lot of the Mendenhall Glacier visitor center.   \n\nGo inside the visitor center and look and read.   Then save plenty of time for the fairly level hike to get closer to the waterfall and Glacier.   Take this hike for beautiful pictures and scenery.   \n\nNote that there is a small walkway (hike) in the opposite direction near the parking lot.   As you are coming from the parking lot to the visitor center go back and there is a short trail with some informative information.   You may see salmon and black bear on this short trail.   Don’t miss this especially if the salmon are running.   \n\nI would come here again.   ",
  "We took the tour bus to the visitor center and then hiked to Nugget Falls.  We felt the $35 per person round trip was quite worth it.  It's a short ride on the tour bus and it is Akers you to the visitor center, or you can ride the city bus for an hour and then hike to the visitor center.  Personally we felt it was better to save the hiking for the park.  ",
  "Our hike with Gastineau guiding was the perfect combination of activity and education with the amazing backdrop of the Mendenhall glacier, forest, waterfalls, and sights.  Our guide Alice had an amazing fund of knowledge but also entertained our 9 year old daughter with lighter conversation.  This is a great tour if you want to get off the cruise ship, get into the woods and get some exercise.",
  "This is a review for a short trip to Mendenhall (90 min or less) and a long trip (4 hours plus). My goal is to provide some specific advice on how I would visit this area with varying amounts of time. My experience comes from having lived in Juneau and having spent hundreds of hours exploring the Mendenhall Glacier area.\n\nMost visits to the Mendenhall Glacier start at a cruise ship in downtown Juneau (about a 17 minute bus ride) so that is how I will start this review.\n\nAfter boarding your bus near the cruise ship docks it is a scenic ride through downtown Juneau along Gastineau Channel and into the Mendenhall Valley.\n\nOn a busy day there will be thousands of people visiting the glacier so it can get quite crowded right where the busses stop. However if you are willing to walk a little bit you can escape the most horrendous of the crowds. \n\nThis first itinerary is what I would suggest for a short visit to the glacier. (Less than 90 minutes) I would not book a tour or make a plan to be at the glacier for the less than 1 hour and really 90 minutes or more is best.\n\nUpon exiting your tour bus continue along the sidewalk until you come to an opening and your first great view of the glacier. (There is a roundabout behind you) This really is a spectacular view point but know that you will have more and better as your time continues. If you are capable of an approximately 45 round trip walk along a well maintained dirt and sometimes mud trail I would head directly for Nugget Falls. You can ask any of the rangers for directions or follow the signs but it really isn't to hard to find on your own. Essentially when facing the glacier you continue to the right along the base of the hill with the visitor center above you to the right. Quickly you will find a trail that you can follow that skirts the edge of the lake and the base of the mountain. This trail is really fun as it offers several great view points over the lake and out to the glacier. The culmination of the trail is Nugget Falls. This has to be one of the greatest places on earth. A very large and beautiful waterfall that falls directly into an iceberg filled lake with a glacier in the background. Stunning! This is as close as you can get to the glacier from this side of the lake. After spending time pondering the majesty of our planet you can retrace your steps back towards the visitors center and the busses. With any remaining time the visitor center is really well done and offers some great information about the area. If you are visiting in late July through September and would like the chance to see a black bear and salmon in the stream work to your left from the viewpoint with the roundabout behind you and you will find a series of boardwalks. Often times you will find salmon spawning in the stream, and if you are lucky black bears chasing the salmon! For the best opportunity to view wild life the evening hours are the best bet but really it's all luck.\n\n*WORD OF CAUTION* there can be black bears in the area anytime of the summer. The bears are generally VERY accustomed to being around people and pose little risk. However I would not allow small children to run far ahead of you and I would refrain from carrying very smelly foods such as peanut butter or beef jerky. Making noise just by talking with your group or singing can also help to make any bear aware of your presence.\n\nNow for my second itinerary. This should only be attempted if you have more than 4 hours and really it should be longer than that. This itinerary should only done from a cruise ship by booking a specific tour or by getting private transportation with a guaranteed pickup time. However if you are in Juneau overnight and have your own transportation this can easily be done on your own. \n\nTo arrive at the starting point turn from the Mendenhall Loop Road onto the Skaters Cabin Road. Follow this road to its end passing the campground and staying close to the lake. (This can easily be seen on Google Maps). At the end of the road there is a descent sized parking lot. From here you really have 2 options. My favorite is to rent Kayaks (which are available in Juneau just search it). Right next to the parking lot is an easy launch point onto Mendenhall Lake.The launch point is gravel and sand and really quite perfect. Kayaking on Mendenhall Lake ranks as one of the most outstanding things I have ever done in my life. If you are lucky there will have been a fresh glacier calving and the lake will be full of wild blue icebergs. Even without lots of icebergs you can still have a great trip. Head out in the middle of the lake roughly angling for the visitor center which is visible on the opposite end of the lake. Once you come around the point you will be treated to unobstructed views of the glacier and Nugget Falls. We generally kayak towards the falls and enjoy the power and spray of the falls. Then we point our kayaks towards the glacier and get a little closer. From here it is great to just sit back and enjoy the view. Then we will head back around the lake and back to the parking lot. \n\nIf you would like to continue your adventure there are a few places on the left side of the glacier where you can pull your kayak out and hike up right next to the glacier. These places vary greatly with the water levels in the lake. At the best it is slippery and difficult to take your kayak out and at its worst nearly impossible. \n\n*WORD OF CAUTION* Please heed this as it is very serious. Mendenhall Lake is not a good place to learn how to kayak without someone very experienced. The water is just slightly above freezing and the wind can pickup seemingly out of nowhere. If you are not confident in your kayaking skills I would strongly urge you to hire a guide service. Never get closer than ½ mile to the glacier edge. I have been on the lake during a calving and I was very very glad that I maintained a safe distance from the edge. The icebergs while amazing are melting and likely to roll at anytime use caution around them. People have died on this lake.\n\nIf kayaking isn’t your cup of Kool-aid then here is the other great option if you have a minimum of 4 hours.\n\nStart from the parking lot at the end of Skaters Cabin Road (the same one where you could launch kayaks) at the far end of the parking lot is a trail that is known as West Glacier Trail. This trail skirts the Western edge of Mendenhall Lake eventually leading you to the glacier. The first section of the trail can be navigated fairly easily. However once you reach the area where the vegetation is gone the going becomes somewhat more difficult often requiring some easy scrambling. The trail really disappears through this section and you basically just find your own route although often times people will have erected rock cairns to mark a path. From here you will have nearly continuous views of the glacier and waterfall. Many people stop here for some lunch or a snack check their time and then head back to the parking lot very happy. However if you follow along the rocks for approximately 1 mile you will arrive at the edge of the glacier. From here you can continue to explore along the edge of the glacier or even walk along the glacier if you are properly equipped with crampons. \n\nThe official length of this trail according to the forest service is 3.5 miles. However that only gets you to the overlook, to continue on to the edge of the glacier adds about an extra mile. So plan accordingly! \n\n* SIDE NOTE *If you are interested you can continue up a rough trail to the top of the mountain on your left when facing the glacier. That mountain is called Mount McGinnis and the view from the top on a clear day is spectacular! (allow 8-9 hours)\n\n*WORD OF CAUTION* This trail can become quite difficult if wet, which is often. I have done it many times in the rain just be careful! The section from the “end” of the trail to the glacier can be especially slippery. Always use caution on or near the glacier. Rock falls and glacier calving’s are not uncommon.",
  "At the moment the lake is still frozen, so you can hike across out to the glacier and check out those ice caves. Totally worth it! Take good footwear with grips, because it's very slick in the ice caves. Wouldn't recommend for people who aren't particularly mobile or sure-footed. ",
  "We had a great time walking to the glacier.  We were told that it would be a 45 minute walk each way. Well, it was about 15 minutes each way, so we had enough time to really look around.  This was our first exposure to glaciers.  The dark blue was great.  The walk was very nice and flat.  No hiking here.  On our way back, we were told that someone had seen a couple bears right where were on our walk to the glacier. We missed them.  The Glacier and lake are beautiful.  A picture moment for sure.  If you get off a cruise ship, don't think you have to stop at the first $8.00 bus ticket booth.  Do take the bus, it's cheaper and just as much fun. There is no charge to get to the glacier, but if you don't have a National Park Pass, you just might pay something to get into the museum and education center which is very nice.",
  "Alaska is by far one of the best trips I have ever taken. Mendenhall Glacier is immense, photo's do not give its majestic size a description worthy of its enormity. If ever in Alaska you should make this a visit on your itinerary. You may even see a bear under one the walkways catching Salmon during the salmon run.",
  "While in Juneau, Alaska we visited the Mendenhall Glacier Visitor Centre. This was the first time for me to see such a spectacular view up-close of a landlocked glacier. There are numerous walking tracks all in varying levels of difficulty and viewing areas. There is plenty of wildlife. The approximately 20km long river of ice definitely takes your breath away. After having spent four days working in the Tongass National Forest I especially enjoyed the short film back at the centre which explored the interplay in the whole natural ecosystem of the area and how the glaciers in the region are impacted. Needless to say, I now have a far greater appreciation and love for these incredible ice leviathans. Well worth seeing at least once in your life.",
  "Take one of the shuttles there and spend 1-2 hours there.  Be sure to walk to falls it is worth it.  If you are on the cruise ship, Hubbard and Glacier Bay will be 1000 times better.",
  "This is operated by the Forest Service and Ranger Ranger gives a talk often and leads a tour to the edge of the lake where you can see the Glacier very close. Also, there is a 15-minute film (see it first) explaining what you are seeing. No need to take an \"Excursion\" here; the city bus line passes by hourly.",
  "Saw some wonderful sights at this location. The center was very busy but had a video theatre, cafe and welcome toilets "
 ]
},{
 "name": "Tracy Arm Fjord",
 "address": "Tongass National Forest",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/56/3c/0d/photo6jpg.jpg",
 "tags": [
  "field",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d630993-Reviews-Tracy_Arm_Fjord-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Of course you will be travelling by boat, but within deep canyon walls and there is near total silence except for the sounds you and your boat make.  Lots of ribbon waterfalls cascade down to the water you are sailing on.  At the end of the Fjord you come to a huge wall of greenish blue glacier face - Sawyer Glacier.  Unfortunately you will not get much closer than 2-3000 yards from the glacier due to danger of ice \"calving\" and having to proceed through a floating field of ice chunks, some the size of small cars.  Wear your heavy coat and maybe gloves - it will be about 34 degrees !!",
  "This was a spectacular boat trip we did as an excursion on our Alaska/Inside Passage cruise. We got straight off our cruise ship onto a smaller boat which allowed us to get right up close to the Glacier. Fantastic scenery & wildlife along the way, inside a warm boat. Remember to take hat, gloves, warm jacket & even a scarf even in the month of July as it's extremely cold when you go outside to get great views & photos. A must see if you're in the area.",
  "Absolutely beautiful. We went in May on a cruise and loved it. We stayed out on the deck for most of the day to see this gorgeous sight. It was the only time we ever ate at the buffet on the cruise, since we didn't have to leave this sight and we could take our plates to some lounge chairs and enjoy. In May, it was still chilly, and yet, the sun was out and it was a gorgeous day. Despite being bundled in my parka because I was a little chilled, I still got sunburnt! Boy, were my boyfriend and I stunned when we looked in the mirror and saw how pink we were. We did not feel ourselves burn at all, in fact, were a bit chilled. I enjoyed seeing the mountains, and we even spotted some wildlife. We spotted lots of mountain goats with our binoculars all throughout the fjord. If you're planning a trip to come visit, always be prepared. Binoculars are a MUST, and the cruises sold them for expensive prices compared to what you can get locally. I had borrowed binoculars from my dad before the cruise, and they allowed me to see the details on the mountain goats up on the mountains. Other passengers could spot the mountain goats with the naked eye and watch them move, but they were awfully tiny in appearance being so far up the mountains. My boyfriends binoculars broke, so we shared mine with each other. His still worked, although had fallen apart so you had to hold both eye pieces up. We gave a nice couple from England both of his binocular pieces so they were able to enjoy a lot more on their cruise by seeing far into the mountains, too! It was a great day. We played a little mini-golf while viewing the fjord, and some chess on a giant, life-sized chessboard. Some passengers claimed to have seen a seal on an iceberg, but I missed that. The views in the Fjord were absolutely breathtaking, words cannot describe how overwhelming it was (in a good way)! I had never seen mountains before in my life. If I had a choice of going to the Bahamas or going back to Alaska, I would go back to Alaska in a heart beat to see this again. For safety reasons concerning icebergs, the cruise could only go so far, but we got an excellent view of the glacier at the end, and then got to backtrack through the amazing scenery again. Absolutely amazing.",
  "I spent the whole of June ‘19 travelling across Canada for 3 weeks followed by an 8 day Alaskan inside passage Cruise. I witnessed and experienced some amazing things including a flight over Niagara Falls and Dog Sledding on a Rockies Glacier.\nHowever, clear top (and that’s saying something !) amongst the numerous highlights was the Tracy Arm Fjord Cruise. The Cruise lasted 6.5 hours. It started with a switch from cruise ship to a smaller vessel (100 people ?) at 9am with a return to Juneau at 3:30pm. It was spectacular throughout. We cleared early fog to find ourselves on mill pond like water surrounded by magnificent snow capped mountains, valleys and tree lined rock faces, numerous waterfalls, mind boggling ice floes and jaw dropping glaciers. And then there was the wildlife ! As we travelled through the area every turn delivered yet another incredible view. So good was the spectacle any food time outs were very brief affairs ! There were early sightings of bald eagles, basking seals, brown bears at the waters edge and whales ! As we headed towards Juneau we came across a humpback whale crashing it’s fins on the water before submerging and a few seconds later performing a full breach right in front of us. Quite the spectacular finish to the cruise !\nResearching this excursion pre cruise it looked fantastic, but exceeded those expectations considerably. I was advised to pre book and was so glad I did as it had sold out when I boarded. \nIf you are doing one excursion make this the one if you possibly can. Truly magnificent.",
  "One of the most beautiful places I have ever been. It was an amazing cruise, at one time there must have been 50 to 60 whales along side our ship entering and exiting Tracy Arm Fjord. It is a place you can wear out a camera, every way you look is another perfect photo opportunity. This needs to be on every ones bucket list.",
  "We took the excursion to the fjord that was offered as part of the Disney Wonder cruise to Alaska. For my kids it was their first time viewing something spectacular like Tracy Arm. The view was breathtaking and we enjoyed every moment.",
  "Tracy Arm Fjord is something that you must not miss.  The ice floats and the glaciers were terrific.  We saw mountain goats and sheep. Also, we saw the glacier calving on a beautiful day.",
  "it was a greta stop on our excusion that day from the cruise line we used to see Alaska. the place was beautiful and the park rangers was great help.\n"
 ]
},{
 "name": "Nugget Falls",
 "address": "Photo Point Trail",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/07/50/85/20190607-114227-largejpg.jpg",
 "tags": [
  "walking",
  "free",
  "hike",
  "walk",
  "eat",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d4071203-Reviews-Nugget_Falls-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's free and walking distance and in minutes your literally there and beauty scenery and wlwziw it was ",
  "Next to the Mendenhall glacier. The hike is easy and leads along the lakeshore. There are viewpoints to see the glacier and the falls. Once at the falls, you have a full view of the many falling streams. Beautiful chutes with thundering sounds, beautiful surroundings.  ",
  "It's about 2 miles from the Mendenhall glacier visitor center on an accessible trail... definitely worth the walk and there's a lot of photo ops along the way!",
  "This is an easy 2 mile round trip hike to get you up and close to beautiful Nugget Falls.  You can feel the spray from the waterfall and have a great view of Mendenhall Glacier.  The rocks and a great place to eat you snack or lunch.  It was hard to leave.  We felt so peaceful here.  Don't miss this special place.",
  "The trail took us 1 hour (w/ return and photo stops). The trail is easily and accessible to all.\nIt is worth taking as you arrive at the base of nugget falls and it does provide you with beautiful pics and amazing views. Nice place to take group/family/couple photos."
 ]
},{
 "name": "Mendenhall Glacier",
 "address": "Mendenhall Valley",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/09/70/8e/mendenhall-glacier-viewed.jpg",
 "tags": [
  "walk",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d14078618-Reviews-Mendenhall_Glacier-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Not to be missed while in Juneau. Breath taking is the best description I really have for this natural wonder.",
  "This is a very pretty place to visit in the summer as well as the winter.  Highly recommend when you are in Juneau.",
  "We only walked the 10 minutes from the car parking area to the glacier viewing point because of the limited time we had for several shore excursions in one day.\nWell worth the walk and the glacier, lake and valley are very photogenic.\nIt would be good to visit again with more time and get up onto the glacier\n\nAllow 1 - 2 hrs if you include the visitor centre",
  "We took the Blue Bus from the cruise ships. Mendenhall is nice for walking. We did a few trails and they were easy. Did not see any animals but got up close to a waterfall. I kept hoping that the tourists taking 100+ selfies by the waterfall would fall in and let the rest of us have some access.",
  "It saddens me to see the amount the glacier has retreated from the visitor center area in the last 10 years or so. Everyone needs to experience the remarkable power and educational opportunity found here. I admit to being something of an introvert and rarely encourage people to throng to beautiful and fragile areas for fear of damage by ignorance and stupidity. A glacier must be seen and felt in person to appreciate its vital importance to the ecology and to understanding history and prehistory."
 ]
},{
 "name": "Mount Roberts Trail",
 "address": "1/2 Mile From Cruise Ship Dock",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/1c/fa/1f/mount-roberts-trail.jpg",
 "tags": [
  "walk",
  "walking",
  "free",
  "walk",
  "hike",
  "history",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d105338-Reviews-Mount_Roberts_Trail-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Power walking up this trail affords wonderful views through a beautiful forrest with few people to spoil your walk. Lunch at the top with spectacular views and a free tram ride down if you spend more than $10pp is a great way to spend a morning in Juneau.",
  "It took me approximately two hours to walk from the Visitor Center across town to Basin Road and up the trail to arrive at the gift shop/restaurant and return to town via the tram. I popped into Rainbow Foods on 4th Street to purchase a protein bar on my way through town and found a great local selection of cards to mail loved ones. I took advantage of the $10 or more purchase for a complimentary tram ride. Note: the trail was quite muddy and slippery on May 22nd, but it remained a fairly easy climb. ",
  "We thought it was an easy hike up as the beginning was pretty flat and easy. The more you hike up(at about 1.5 to2 mile point from the cable car station), it gets really steep althought the view is beautiful. If you don't have enough time or not enough energy to hike all the way to the Mt. Roberts' peak, do go to the Cross point. It is a beautiful hike.",
  "Went up the tramway on my cruise to Alaska this past summer.  Spectacular view of Juneau Harbor and the area.  Take a hike up the trail once you get up top for more great views.  Don't miss the museum and film for some history if the people.",
  "Easy to reach the base station from the cruise harbor and take the tram up the mountain to enjoy an excellent view of the town and harbor. You can see your cruise ship in the harbor and if you are early enough, there are short trails you can walk around the visitor center.\nThe price of the tram is expensive for $35 for a short trip up the hill but unless you want to try the vertical climb, there are no other choices.",
  "Even though it was raining we ventured out onto the trail. We did not go all the way to the top but did get to Father Brown's cross. Trail was well signposted and in good condition.",
  "Take Basin Rd out of town and you come to a parking lot of the right hand side. The trail is 2.5 miles to the tram station and it is a strenuous climb. Great views on the way up and if you keep going you get to Father Johns cross. Is almost harder coming down than going up. Worth the time.",
  "A short tram ride to get a just OK view.  The hiking trail not particularly interesting and not marked with information.\nWay too expensive for what it was"
 ]
},{
 "name": "Goldbelt Mount Roberts Tramway",
 "address": "490 S Franklin St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/6f/e5/90/photo0jpg.jpg",
 "tags": [
  "walk",
  "nature",
  "tasting",
  "walking",
  "hike",
  "tour",
  "history",
  "nature",
  "walking",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d144194-Reviews-Goldbelt_Mount_Roberts_Tramway-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Is it worth the price, for all day, yes. First visit walked to the tram on our own, an  amazing feat of engineering. Beautiful views. The raptor areas was open, was able to see the eagle that had been injured. There's a Nature Center, a Restaurant\nwith small Museum that shows a film. There are products from Alaska as well a some imported products.  Overall the selection is interesting.\nOn our Second visit, the tram was apart of a walking/w van tour of Juneau[Gastineau Guiding with guide Richard Stokes] the raptor area was closed, but we were guided on parts of the walking trails with narration about the history, flora and trees, the hike was challenging but beautiful and enjoyable, wear good shoes, they offer hiking sticks, great viewing points, even some carved totems - the various trails are dirt mixed with wooden steps. Our trail @50 min with stops of both natural vistas and viewing platforms, our guide had us loop our trail returning to the Nature Center where we had a tasting of various teas with jams from Alaska, nice ending to our walk.   \nAgain, take your time and enjoy the beauty at the top. Some viewing platforms are a short behind the Nature center.  Saw people trying out the trails on their own.\n They do have a totem pole carving area, unfortunately our tour ended @ 5pm, but   we were able to see what the carvers had been working on for the day.\nThe cafe is nice and is connected to a small museum which has a short movie presentation.  Waiting for the tram can have long lines, but time it well and the lines \ncan enable you to look down at the city of Juneau and the lines can move quickly as the tram return regularly.",
  "It was a very clear and sunny day when we arrived in Juneau.  The trip up the mountain had unobstructed views of the port and town. When we got to the top the view of the town area and river were fantastic and clear. When we were here about 15 years ago when we got to the top it was very cloudy thereby limited views.\n\nWe walked around the tracks for a while then visited the gift store which was good. The talk about the injured eagle (blind in one eye) was informative.\n\nWe were on a cruise ship and bought our ticket through shore excursion desk and it enables you to have unlimited rides all day.\n\nHighly recommend attraction.",
  "Goldbelt Mount Roberts Tramway is the main attraction in downtown Juneau.  Opened in 1996, this joint-venture business is coming up on its 21st anniversary.  It’s the only tramway in Southeast Alaska.  It’s located across South Franklin Street from the dock area.  Its cars make a steep vertical climb 1,800 feet up through the rain forest to the Mountain House.  On the way, passengers get spectacular views of Juneau and Gastineau Channel. \n\nWhen our ship arrived in port at 7:00 AM, I watched the tramway operate up and down from our verandah.  It was fascinating.  \n\nOn the day of our visit, it was overcast with periods of light rain when we went up.  We disappeared into the clouds quickly.  On the way down, the clouds were clearing, and we got the great views.   \n\nThere’s an entire complex at the top.  At the Mountain House level, one finds:\n● Raven Eagle Gifts – a gift shop with almost anything one would want for a souvenir, including native arts.\n● Chilkat Theater – shows an 18-minute video “Seeing Daylight” which is a documentary about the Tlingit people and their culture.\n● Timberline – a casual restaurant and bar\n● The Nature Center - run by Gastineau Guiding\n● The Juneau Raptor Center – shows a live bald eagle named Lady Baltimore\n● Hiking Trails – several – one ADA accessible\n\nWe especially enjoyed the video and the eagle.  \n\nWe spent over two hours up at the Mountain House.\n\nWe rate the Mount Roberts Tramway at 5.0.  \n\nWe recommend a prolonged visit. \n\nAnd, don’t let a cloudy day stop you. There are a lot of cloudy days with light rain in Southeast Alaska.  Why?  The terrain is temperate rain forest.  Mountains always make their own weather ~ no matter where they are.  And, it can clear up as quickly as it can cloud over.  \n\nIf you found this review helpful, please click THANK below.",
  "Mt Roberts Tramway – Oh how steep is this, a 6 minute ride on this aerial tramway in Juneau – 3,819 ft  great, unbelievable views.",
  "We are going to the Alaska region again for the 4th time and we will definitely ride the tram up....",
  "The tram is (or was) one price for a day, and take as many trips up and down the mountain as you want. On the way up you may spy an eagle’s nest! At the top you’ll find trails, a visitor’s center, coffee shop, theater with history of the area and people. Walking trails and beautiful views. It’s worth your time. \n",
  "Our cruise ship stops at the bottom of the mountain and even though the weather wasn't great, we enjoyed riding up the tramway. You get some spectacular views, specially of the cruise ships below. We ate a small meal and had drinks at the restaurant on top and took photos of the stuffed bear. We browsed around in the gift shop and the smaller souvenir shop. There's an auditorium that was presenting an Alaska history lesson. Behind the buildings down a walk, a bunch of us we played in the snow and took some photos as well. On the side of the building, there's a cool graphic showing the wing span of different birds and an eagle that you can compare your wing span to. The ride back down was cool as well and you can see different parts of the mountain and terrain if you switch side of the car. Don't recommend this if you're afraid of heights!",
  "We were making our way back to the Cruise ship but had enough time to go on the Tramway. The weather was not great but did not want to pass up a ride. The views were great despite the weather and was the best part of the adventure. There are much better options for eating and gift shops down in town so we did not go to the restaurant and just browsed the Gift shop. Since the weather was bad we did not have a great experience but in nice weather we could see this as a to do in Juneau."
 ]
},{
 "name": "Shrine of St. Therese",
 "address": "Mile 23 Glacier Hhwy 21425 Glacier Hwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/e1/69/95/img-20190609-160354045.jpg",
 "tags": [
  "nature",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d665891-Reviews-Shrine_of_St_Therese-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a place that exudes a very spiritual commitment to a coastal development. There is a very comfortable air amidst numerous religious displays and a quaint chapel hidden on an island copse. While it will take some time to make the drive from downtown, it is well worth a stop while taking in the sights of the short road trip available to the local community.",
  "If you're looking for a place to really experience the majesty of Alaska, this is it. No hiking or fees required to experience tranquility, amazing views and possible wildlife.\n\nWe saw sea lions swimming around and a whale puffing water in the distance.\n\nThis place is so peaceful. Truly a place to experience.",
  "About 30 mins north of Juneau, this place was a tranquil, albeit windy oasis.  So peaceful, it really facilitated a reflective space to just enjoy the beauty of nature in that region.  The chapel, and all of the ground, reflect St. Therese pretty well.  Simple, humble and simultaneously profound.  Worth the trek if you're in Juneau and have a few hours to spend.",
  "Stunningly beautiful and peaceful.  The shrine is about 20 miles out of Juneau and a world away.  The chapel is simple and beautiful, set amidst beautiful old spruce trees, and surrounded by the Stations of the Cross.  The grounds are meticulously maintained, with flowers growing everywhere.  Don’t miss Mary’s View, the Rosary Trail, the Merciful Love Labyrinth, the Stations of the Cross, or the chapel.  Stay there overnight if you have the time",
  "just a perfect place to spend some time - saw salmon, a seal, ducks and even saw a marmot. quite, peaceful and serene - a must stop in Juneau AK",
  "My sweetheart's cousin was our tour guide in Juneau, and he had done some work as an electrician at this site in the past.  It is located a few miles north of Juneau, right on the water. Such a peaceful and reverent place!  We were there in June, on a beautiful, sunny day, there were flowers and birds singing, it was very nice!  I would highly recommend this out-of-the-way shrine.",
  "If it were not for a suggestion from a local resident named Emma we would have missed the most important stop in our visit to Juneau. Please make your way to this heartwarming and peaceful island chapel. Take a few moments to reflect inside, light a candle and quietly reflect on thoughts and prayers. Truly a beautiful addition to your visit to Juneau.",
  "We rented a car one day and visited this as part of our journey to the End of the Road in Juneau. We saw whales and marmots here in addition to finding yet another beautiful and tranquil place in Alaska. It was after hours yet the gift shop was open on an honor code basis. You could buy a soda -- or an expensive religious momento. All at your honor. .When does that happen? What a treasure."
 ]
},{
 "name": "Alaska State Museum",
 "address": "395 Whittier St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e3/36/f3/interesting-displays.jpg",
 "tags": [
  "history",
  "art",
  "history",
  "art",
  "history",
  "library",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d105041-Reviews-Alaska_State_Museum-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a fairly new museum that does an excellent job of detailing the history of Alaska from indigenous people to Russian occupation through to the US acquisition and development. There was a special exhibit of a tragic steamship sinking that was also very well done. The gift shop has very nice options and the entry cost is reasonable ($11 for summer seniors). We are not big shoppers and so this was a great way to spend a couple of hours in Juneau off our cruise ship. I can't think of a better way to see AK artifacts and gain an exhaustive amount of information on our 49th state in a short amount of time. Even my guy, who resists visiting museums, was very impressed by this site.",
  "this museum is well worth a visit while in juneau.it is a beautiful building and has many items of alaska.",
  "We'd heard this was a terrific museum, and it sure is. From mammoth tusks to the present, excellent exhibits of \"first peoples\", as well as Russians, Americans and Japanese (during WWII), statehood, contemporary art. ",
  "Great museum with a large variety of displays.  There is of course, much about Alaskan history and the peoples in different points of time. There is info on the period when Russia owned Alaska, about 100 years, ending in 1867. An entire room tells the story of a grounded ship. Very sad. Modern exhibits, too. Worth it. ",
  "New beautiful building and big collection of artefacts. The primitive art of local tribes is impressive.   ",
  "The museum has a free parking garage under the museum. The admission fee covers all exhibits. If you go on the first Friday of the month, admission is free. The museum is on the first floor. There is a library and archives on a higher floor. The exhibits give excellent coverage of the history, wildlife, and geology of Alaska. There is a gift shop.",
  "So much to see here. Allow 2-3 hours. The museum hosted a Ray Troll exhibit, 'Crusin' the Fossil Highway', which was a delight. Several complete kayaks showing the different designs. Good balance of native and white influence and artifacts. Covered some atrocities inflicted by whites on the natives. A great intro to the state, \"Alaska 101\", for those from outside.",
  "Nice little museum about Alaska,  We spent a couple hours and learned a lot about the state and it’s history.  "
 ]
},{
 "name": "Glacier Gardens Rainforest Adventure",
 "address": "7600 Glacier Hwy 7 Mi From Downtown Cruise Docks, 1 Mi From the Airport",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/35/13/ee/juneau-rainforest-garden.jpg",
 "tags": [
  "history",
  "tour",
  "tour",
  "tour",
  "tour",
  "creative",
  "tour",
  "tour",
  "history",
  "history",
  "walk",
  "tour",
  "walking",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d144195-Reviews-Glacier_Gardens_Rainforest_Adventure-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Thinking we were just going to see some pretty flowers (arboretum type thing) and bore my husband to pieces, what a wonderful surprise to find out different!! \nFrom the entrance with upside down trees to the greenhouse, gift shop and, of course, the cart ride up the trail ( a little harrowing at times) it was amazing!! Learning the history of the land, the vision of the owner and seeing the beauty of it all! \nMy husband even said how surprised he was at how much he enjoyed it!! \nDo not miss it!!",
  "We loved the flowers on the upside-down trees; loved the hanging baskets and enjoyed our tea in the greenhouse.",
  "Going on a tour of the gardens with the upside down trees from landslides, and the creativity of the designers to produce beautiful flowers this time of year, was excellent. ",
  "Rain or shine, this is a must see place.  We enjoyed our tour even in the rain. LOVED the upside down tree planters. The view was gorgeous.  The staff is well informed and was able to answer all of the questions thrown at them.  They allowed time for people to take photos, ask questions, and generally take in the beauty of the area. There is a small gift shop and coffee shop to buy gifts or drinks. The flowers are beautiful.",
  "If you've been to Juneau before and seen most of the sights, try Glacier Gardens. Surprisingly beautiful and interesting gardens reclaimed after a landslide. Upside down trees are not to be missed. A peaceful and inexpensive tour!",
  "This stunning garden hidden in the Tongass Rainforest is well worth the trip. The guided tour through the elevations of the gardens are informative and fun. Even on a rainy foggy day it was a great adventure. Creative floral work. Great views. Loved the gift shop.",
  "This was a wonderful guided tour up the hill through the rainforest gardens. The work done to produce this place after a big landslide went through here many years ago is amazing. From the viewing platform at the top of the hill there are good views along the Juneau valley ( in both directions) Even saw a Bald Eagle soaring overhead\n\nWell recommended",
  "Thourghly enjoyed this tour offered by Royal Caribbean...interesting history on how these gardens came to be, so listen closely as your guide expertly drives you up the side of a mountain to a awesome view of Juneau and a channel far below...you don't really realize how far up you travel but the view is worth it.  Amazing what an emagination can create, these upsidedown tree gardens must be seen to truly be appreciated...",
  "This is a bit tricky to find if you are not familiar without the the area but a local gave us great directions. We had rented a car to get away from the crowds of the cruise ship which was a great idea and drove around visiting the attractions. \nThese gardens were worth the visit and it was interesting to hear the history of the place. The view from the top of the gardens where they drove us to is amazing. There has been a huge amount of work go into these gardens. Enjoyed the visit!",
  "Went to these gardens as part of a Princess excursion and was amazed at the beauty and imaginative creations ! The turnoff could be easily missed so if you’re driving, pay close attention. We were part of a 30ish group from the ship, so our driver knew exactly how to maneuver the small lane. Long story short , Steve the owner had rented an excavator after he bought the property. Not sure what he had originally planned but just say messing up the big man machine the day before he was to return it was bitterly disappointing. In his frustration , he picked up one of the felled trees and dumped it in the ground ! I think he must have done a few more that way before his anger at himself had subsided. But what happened much later, the tree tops were fed by the ground  and the roots developed plants on the root balls ! They added flower seed ( again later ) and the results are stunning. It was  thoroughly delightful and a bit nerve wracking as the open transportation maneuvered the single lane unpaved road straight up to a beautiful vista. Great experience. Fully recommend. Hope I got Steve’s story straight !",
  "This rainforest is lovely.  The tour consists of a tram ride to the top of the mountain where you get a breathtaking view of Juneau below.  The narration on the tour tells about the trees of the forest and the very interesting upside down flowering trees.  There is a small gift shop with some unique gifts.  The restrooms are clean.  One thing it is a difficult walk to begin the tram ride.  Pebble rocks line the walkway and if using a walker, wheelchair, or even have a little difficult walking on gravel, you may need assistance.  The staff is great and very helpful.  Our tour driver was Eugene \"Gino\" and was excellent.  Katie was so helpful with assisting with the walking.  "
 ]
},{
 "name": "DIPAC's Macaulay Salmon Hatchery",
 "address": "2697 Channel Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/98/94/15/dipac.jpg",
 "tags": [
  "free",
  "tour",
  "tour",
  "tour",
  "walking",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d144196-Reviews-DIPAC_s_Macaulay_Salmon_Hatchery-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very educational stop at the hatchery, where we learned about how the salmon population is boosted to stock the waters to feed other wildlife and facilitate the commercial fishing harvest, while also enabling replenishment of the stock for years to come. ",
  "Took a $14 cab ride here during our port day and so glad we did! Amazing sights - the fish ladder AND the salmon that have climbed it, the millions of baby salmon growing in the ponds, and the beautiful aquariums were all worthwhile. They have the nicest people working there ready to answer every question. And great facilities, free coffee, and gift shop :-)",
  "This actually was my husband's favorite attraction out of a little over 3 weeks of touring Alaska.  We did a behind the scenes tour and got to see the female salmon eggs being harvested and the male milt (sperm) being released as well.  I understand this is a rare thing to get to see live.  The film that is shown to all tours shows it but nothing like the real deal.  From beginning to end - the salmon life cycle and how the hatchery takes part in that.",
  "My wife and I were on a tour and one of the stops was the fish hatchery. It is set up very well for visitors to view the salmon ladders and holding tanks and also the hatch lings in huge tanks. There are some exhibits in the lobby area which are very interesting. They also have plenty of staff who narrate your visit and are able to answer all your questions. There were also seals hanging around down in the harbour which were fun to watch. Cool visit and memorable part of our trip to Alaska.",
  "It’s off season so we made a reservation and Amanda gave us a wonderful tour of the hatchery. We actually saw eagles and seals just walking up the ramp to the entrance. We walked inside and Amanda was so friendly and welcoming. Throughout the tour we could tell she enjoyed educating the public about the importance of the hatchery. We learned so much. ",
  "Stopped at the hatchery as part of a three part excursion. Learned a lot about how the salmon are raised and then restocked in the waterways. ",
  "The salmon return here to spawn.  You can see them in huge tanks by the thousands.  Then they are returned to the sea to continue their life cycle in the wild.",
  "Very informative on how the salmon are farmed. Just $5 to get in, which includes a short film and tour. Small museum with aquariums. There are two open aquariums where you can see sea cucumbers and starfish up close and even touch them.\nLearning about the salmon ladder was amazing and learning about how many eggs they store was an eye opener. \nThis is a great place to go and hang out to catch some views of bald eagles."
 ]
},{
 "name": "Alaskan Brewery and Bottling Company",
 "address": "5429 Shaune Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5f/cd/54/alaskan-brewery-and-bottling.jpg",
 "tags": [
  "tour",
  "tasting",
  "history",
  "brewery",
  "history",
  "brewery",
  "tour",
  "brewery",
  "art",
  "brewery",
  "sampling",
  "tasting",
  "knowledgeable",
  "tour",
  "history",
  "brewery",
  "tour",
  "history",
  "brewery",
  "drink",
  "tour",
  "brewery",
  "tour",
  "tasting",
  "history",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d144197-Reviews-Alaskan_Brewery_and_Bottling_Company-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "We booked this tour through Viator, and it couldn't have been easier.  We went to the Alaskan Brewery Depot on S. Franklin as the ticket instructed, and were picked up right on time.  The trip out to the brewery is quick and has interesting scenery.  \n\nOn arrival, we were met by our host, Will, and taken to the tasting room, which sits where the original bottling line was.  The brewery has a very interesting history, one of searching for authentic recipes, getting started with crowd-funding before there was an internet, and environmental and social responsibility -- and it was accompanied by fantastic beer!  \n\nWhile Amber is their flagship brew, some of the others we tried were excellent, and we really enjoyed learning about the \"crew brew\" program and getting to try the current version of that (pistachio milkshake on our visit).  Will was a great host and ambassador for the company.\n\nWe were picked up promptly on time after the tour and returned to the Depot.  I would recommend this tour for adults.",
  "I visited the brewery in February so the bus from the Alaskan Brewery store downtown out to the brewery itself wasn't running, but I took the public bus out there which was straightforward. I got a great overview of the history of the company and the brewing process from one of the staff, and they helped me pick out some samples to try.\n\nGreat way to spend a couple of hours.",
  "The tour from the Alaskan Brewery depot in downtown Juneau was the perfect length, with transportation, great Alaskan beer, and cool apparel. Only $20 including 7+ samples!\n\nShip your beer to Kansas City - will buy.",
  "Took a taxi from town ( 10 minutes) and settled in to enjoying a flight of beers.  We were there after a visit for lunch ffrom the Red Dog.  Love their beer and you can't beat the sampling variety and draft beer is out of sight.  They have all the souveniors to buy plus some great art work on wood boards.  We always visit the Alaskan Brewery when in Juneau!",
  "Our tour started at the Alaskan Brewery Depot in downtown Juneau which is only a couple blocks from the cruise ship pier. Buy your souvenirs here as the brewery doesn't offer nearly as much. A very friendly, knowledgeable driver picked us up for a ride to the outskirts of Juneau where the brewery is located. A tour guide met us and filled us in about the history of the brewery. He gave us three beers to try with an explanation of each one. We were then given 5 tokens each for them tasting room. Really liked their amber, smoked porter, oatmeal stout and white beers. The tour basically consists of two rooms and not the entire brewery,but it's worth it.",
  "We can't recommend this tour enough. My husband and I came to Juneau to drink beer and this tour fit the bill. There's so much awesome history to this place, you just have to go. Will told us the whole story of the brewery and we were captivated! Their beer is so good and it's awesome to see people so passionate about beer. 10/10 would do again!!! ",
  "This $25.00 tour included a shuttle to the Brewery which was about 10-15 minutes from down town. We tasted 7 beers and received LOTS of information about founding of the company and the owners, but never really went inside the Brewery, which was a disappointment. ",
  "We booked this tour through Viator, and it couldn't have been easier.  We went to the Alaskan Brewery Depot on S. Franklin as the ticket instructed, and were picked up right on time.  The trip out to the brewery is quick and has interesting scenery.  \n\nOn arrival, we were met by our host, Will, and taken to the tasting room, which sits where the original bottling line was.  The brewery has a very interesting history, one of searching for authentic recipes, getting started with crowd-funding before there was an internet, and environmental and social responsibility -- and it was accompanied by fantastic beer!  \n\nWhile Amber is their flagship brew, some of the others we tried were excellent, and we really enjoyed learning about the \"crew brew\" program and getting to try the current version of that (pistachio milkshake on our visit).  Will was a great host and ambassador for the company.\n\nWe were picked up promptly on time after the tour and returned to the Depot.  I would recommend this tour for adults."
 ]
},{
 "name": "AJ Mine Gastineau Mill Tour",
 "address": "151 Mill St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/77/a7/4b/alaska-gastineau-mill.jpg",
 "tags": [
  "walk",
  "tour",
  "tour",
  "learn",
  "tour",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d538178-Reviews-AJ_Mine_Gastineau_Mill_Tour-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "We came in October in the last week of the season.\n\nThe mine tour itself is very informal, the guide is a retired mine worker, and he did a decent job of explaining and demonstrating the workings in the mine.\n\nAfter the tour, we were able to pan for gold, which you get to keep. Near the gold panning, they also have some old mining equipment you can walk around and take a look at. It's not a formal museum, so some of the equipment is extremely dilapidated. It's a shame, would be nice to be able to preserve it.\n\nHad a pretty good experience, even for the last tour of the season the staff was upbeat and friendly.",
  "My husband is an avid Gold Rush can and couldn't wait to go here..it was grest.  John was a great guide.  Actually pain d some good for our grandsons.",
  "I did not grow up in a area with mining, so this was a very interesting tour to learn about mining.  Plus I learned so much about Alaska's mining industry in the process.",
  "John gave us a very interesting tour of one section of the mine, showing mining techniques of old and contrasting that with how mining is conducted today.  It was interesting to see the old equipment and machinery and to hear how concern for the safety of miners resulted in the vast changes in how mining is now done.  Bev demonstrated gold panning and helped us to pan for our own gold - that was fun and provided a great keepsake of this tour.",
  "Loved the underground tour and panning for gold. Great history and lots of amazing artifacts. Panning  for gold is fun, and you get to keep what you find."
 ]
},{
 "name": "The Whale Project",
 "address": "350 Whittier St #101",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/1b/bb/55/se-ve-impresionante-la.jpg",
 "tags": [
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d14976478-Reviews-The_Whale_Project-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great piece of art and it's excellent for taking pictures in front of,  I sent a selfie I took in front of it and someone thought it was real.",
  "The statue is amazing with great details showing a breaching whale with mountains and the town for the background. It seems like it is of real life size with fins open in the rotational fall of the humpback whale. Great artwork and great location to exhibit (next to the bridge connecting Douglas to Juneau).  ",
  "It is magnificent and so realistic.  It is a must see!  It is a treasure that Juneau has.  Be sure to put it in your itinerary. ",
  "The fountain goes off every 15 minutes and is a joy to behold. It looks like a Whale surfacing and is fascinating. There are nearby restrooms also. I would highly recommend.\n",
  "We stayed for 3 cycles of spray. What a treat.our Alaska friends told us about it and gave basic directions, It's a challenge to find, burt worth it."
 ]
},{
 "name": "Eagle Beach",
 "address": "26 Glacier Highway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/65/f8/4c/eagle-beach.jpg",
 "tags": [
  "nature",
  "walking",
  "food",
  "nature",
  "walking",
  "food",
  "walking",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d7112814-Reviews-Eagle_Beach-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are a hiker, photographer, or someone who just loves to commune with nature you must go here!  Be very careful if you're here during Spring through October as the bears love this place as well.  Hiking, picture taking or just walking around on the many level trails make sure to talk and make noise so as not to surprise any Yogis or Boo Boos.  Eagles are present but sometimes you need binoculars to find them in the tree tops.  Often there are seals in the river mouth, which are always a fun treat.  Bring a picnic lunch, or even bbq using one of their many set ups.  Again, make sure to not leave any food around for the wildlife, including the many bird species.  As always, feed no one but yourselves!  Such a lovely spot to enjoy.  Since we are residents we go here often, year around.",
  "This place is pretty far down the road from most of the sights you'll see in Juneau, but it is beautiful and worth the visit if you have time.",
  "If you are a hiker, photographer, or someone who just loves to commune with nature you must go here!  Be very careful if you're here during Spring through October as the bears love this place as well.  Hiking, picture taking or just walking around on the many level trails make sure to talk and make noise so as not to surprise any Yogis or Boo Boos.  Eagles are present but sometimes you need binoculars to find them in the tree tops.  Often there are seals in the river mouth, which are always a fun treat.  Bring a picnic lunch, or even bbq using one of their many set ups.  Again, make sure to not leave any food around for the wildlife, including the many bird species.  As always, feed no one but yourselves!  Such a lovely spot to enjoy.  Since we are residents we go here often, year around.",
  "We drove to this beautiful beach while staying in Juneau.  We timed to be there a little before sunset.  Enjoyed walking along the beach and it is great place for picnic.  We saw lots of eagles and that was great but the sunset was amazing.",
  "We were the only people here and there were no eagles.  It was pouring rain.  I wonder if it would have been better on a sunny day?",
  "Awesome scenery but no eagles. Beautiful drive from Juneau. Rented car in Juneau and drove out of town for an hour.",
  "We drove from the pier (about 30 minutes) on a self -guided tour. Once you arrive, you park near some picnic tables and walk out about 100-150 yards. Turn around, and you can see the Eagle glacier which we were told is not visible from anywhere else unless you take a helicopter excursion. Nice views - great photo ops. But after 30 minutes, you walk back to the car and drive on. BTW, we only saw one eagle at this location. We saw way more perched on highway light poles on the roadway on the drive back to the pier.",
  "We rented a car in Juneau so we could go to Eagle Beach at low tide to see the 100s of eagles I'd read about. We saw only two. In speaking with a park ranger we learned that it's been a few years since large numbers of eagles were seen here. There seem to be fewer salmon in the area which is believed to have decreased the eagle numbers. "
 ]
},{
 "name": "Amalga Distillery",
 "address": "134 N Franklin St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/cf/43/8d/the-tasting-room-at-amalga.jpg",
 "tags": [
  "walk",
  "drink",
  "delicious",
  "delicious",
  "unique",
  "delicious",
  "drink",
  "food",
  "knowledgeable",
  "tasting",
  "drink",
  "delicious",
  "tasting",
  "drink",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d12439172-Reviews-Amalga_Distillery-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "As we walked along Franklin Street further away from the cruise ship port, we happened upon Amalga Distillery. The service was great. We ordered a Juneaper Gin & Tonic which was so delicious. I love the decor with large windows, wild flowers in gin bottles, and the still located in the patron seating area. We sat for a while enjoying every sip of our drink and watched people walk by along the sidewalk.",
  "While there were other unique gin cocktails on the menu, we both went for the traditional gin and tonic. They certainly know how to make a delicious gin here! Plus, it has a great atmosphere. ",
  "When I'm in town, my friends and I go to the distillery to have drinks and to chat. Their drinks are delicious and the vibe is super chill and laidback, I recommend it as a must stop spot when visiting Juneau. ",
  "Amalga distils juniper berry Gin and occasionally vodka. The drink menu (no food is served but you can bring your own), is a nice selection of martinis, sweet drinks and Moscow Mules when they have vodka. It is noisy so don't plan for a quiet drink.",
  "New distillery with fantastic gin and cocktails. Definitely go! The hours are a bit erratic, so you may want to check on line before you go. The distiller and owner was behind the bar making drinks himself. The place hosts an eclectic mix of locals, hipsters, cruisers, etc. Part swanky, part down to earth. Check it out! ",
  "Hosted by Brandon and Maura (and often Amund), the new distillery on a downtown corner draws customers and compliments like a magnet.  Airy and upscale with the copper pot as a centerpiece, the ambience is warm and welcoming, whether crowded (the usual) or quiet, giving time for a fine conversation with the knowledgeable and cordial owners. Visit and get in on the ground floor--literally--of this new enterprise",
  "Great drinks! I normally am not a huge fan of gin but Amalga is such a fantastic place. Love the environment too!",
  "I had a chance in January to visit this Distillery on several occasions. I will tell you why in a minute. This place is still very new. It opened the year I first delighted Juneau with my presence. Ok, maybe not but it was there the first time I had been to Juneau. Better ? My understanding it opened in 2018. It only makes Gin at this point but had a Whiskey in the makings that should be ready later this year.\nNow for the delicious scoop. It has several concoctions of drinks on their menu that showcases what their Gin can do in a cocktail. They have several to choose from but it is limited and by liquor laws of the state they can only use the liquor they make. That being said they have come up with libations which uses natural ingredients and as close to locally sourced as possible to their area. Ok, enough of that what I want to say is important and that is while tasting several samples of their drinks which were all quite excellent my favorite was the Gin and Tonic. Wow, you have to be kidding you say. Nuh uh. It is the BEST Gin and Tonic I have EVER had from coast to coast and I have been coast to coast. What makes this drink that impressive is their Gin is locally sourced and they make their own tonic. It only cost $5.00 and that is a huge plus. This is why I went as many times as I could. Their hours are Monday through Friday 3 pm til 8 pm and Saturday and Sunday 1 pm to 8 pm. Please go visit them if you are in Juneau, Alaska. ",
  "We stopped in here on a short layover in Juneau.  Being gin lovers, we always seek out local distilleries when we travel.  The gin here is excellent and is great to drink all by itself on the rocks.  It also holds up really well in a G&T or other cocktails.  We were welcomed into the tasting room at a busy time and still got great service.  Thanks!",
  "Visit Amalga’s tasting room and enjoy wonderful cocktails, grab a bottle to go, or canned cocktails!  They do a wonderful job, and often sponsor events to benefit local nonprofits, artists, etc.",
  "We found this distillery while we  walked around the town, we tried the rhubarb juneauper gin ( new in the market)  was wonderful, the staff are friendly and service was great, they’re really passionate with the drinks they are making 👍"
 ]
},{
 "name": "Perseverance National Recreation Trail",
 "address": "Gold Creek Valley",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/d7/29/05/wide-trail-good-also.jpg",
 "tags": [
  "delicious",
  "delicious",
  "hike",
  "walk",
  "walk",
  "hike",
  "walk",
  "family",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d4071872-Reviews-Perseverance_National_Recreation_Trail-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Perseverance is by far Juneau’s most popular downtown local trail. With connections to the Flume trail, Granite Creek, Silver Bow Ruins, Gold Falls, The Glory Hole, Red Mill, Mt. Juneau, and Mt. Roberts it is no wonder. I run this trail almost daily through the summer and often use it to garner some late season spring skiing. \nFrom thick forest to raw high steep valley walls down to Gold Creek, Persy, as the locals say, is a highly stimulating trail just steps from the edge of town.\nIn the summer salmon berry patches are thick and delicious and in the Autumn the alpine blueberries are delightful as well.\nA small side trail can also bring you down to beautifully clear Gold Creek Falls. Be cautious if you venture down, the edges are steep and slippery, but can be safely viewed from a few sections.\nPersy is open for pedestrians and mountain bikers who both frequently use the trail so please be courteous and follow the signs so everyone can continue to use this incredible trail. It is often used through the winter to reach prime slope ski spots for everything from hill play to crazy. With more fat tire bikes around, expect to see more bike traffic through the winter as well.",
  "Perseverance is by far Juneau’s most popular downtown local trail. With connections to the Flume trail, Granite Creek, Silver Bow Ruins, Gold Falls, The Glory Hole, Red Mill, Mt. Juneau, and Mt. Roberts it is no wonder. I run this trail almost daily through the summer and often use it to garner some late season spring skiing. \nFrom thick forest to raw high steep valley walls down to Gold Creek, Persy, as the locals say, is a highly stimulating trail just steps from the edge of town.\nIn the summer salmon berry patches are thick and delicious and in the Autumn the alpine blueberries are delightful as well.\nA small side trail can also bring you down to beautifully clear Gold Creek Falls. Be cautious if you venture down, the edges are steep and slippery, but can be safely viewed from a few sections.\nPersy is open for pedestrians and mountain bikers who both frequently use the trail so please be courteous and follow the signs so everyone can continue to use this incredible trail. It is often used through the winter to reach prime slope ski spots for everything from hill play to crazy. With more fat tire bikes around, expect to see more bike traffic through the winter as well.",
  "This is a very secluded, quiet trail.  There are frequent bear and other animal sightings so go prepared.  One of the best trails in Juneau, and it branches off into several other trails that wind up into the mountains and into a basin, go with lots of time to enjoy.as well as one that leads to mine ruins.",
  "It was a really wet day in Juneau but we decided to do this hike. The waterfalls were spectacular and the raging river impressive. Well worth the effort.",
  "Above Juneau's old town is a the Perseverance trail, which evidently follows the path of an old mining road.  The trail is somewhat uneven in places (sturdy footwear would be best) and mostly uphill (going east from the trailhead at the east end of Basin Road).  But that said, it's not an especially strenuous three miles, and is graded \"easy\" -- we encountered numerous people running and biking up the trail, along with many other hikers.  The trail offers a variety of scenery along the way; it roughly follows Gold Creek and crosses it multiple times.  The trail is fairly well-signed at junctions with other paths.  For hikers wishing to carry a topo map just in case, your reviewer found the \"Juneau Area Trails Guide\" map to show the trail in adequate detail.\nNear the trailhead is an old mine entrance which produces a remarkably steady flow of cold air even during the height of summer -- it was great to stand in front of the mine shaft's \"air conditioning\" after returning from our afternoon trek on the Perseverance.\nNote that there's lots of parking at the trailhead, but it appears that many visitors either walk up from the waterfront, or take a taxi.",
  "This trail has amazing views of the surrounding mountains. You walk along a waterfall and river for most of the hike. From Perseverance you also have the option to veer up to Mount Juneau or up Granite Creek. It is possible to do a ridge hike from the top of Mount Juneau over to Granite Creek Basin then return on the Perseverance Trail. ",
  "Loved hiking this trail!  We did not do the entire trail because we walked to the entrance rather than take a cab which I highly recommend that you do.  Young adult family members also enjoyed this hike.  Remember, take a cab there and you can walk back through town.",
  "The trail is easy to get to and well maintained.  There is shade and plaques with information about artifacts from the gold rush. It parellels the water and you catch glimpses of it through the trees. You can walk down to the beach and walk back to your car via the beach."
 ]
},{
 "name": "Juneau Rainforest Garden",
 "address": "10445 Glacier Hwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/33/d8/7c/sphinx-moth-on-fireweed.jpg",
 "tags": [
  "tour",
  "walk",
  "history",
  "delicious",
  "tour",
  "walk",
  "learn",
  "walk",
  "learn",
  "history",
  "tour",
  "walk",
  "history",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d247671-Reviews-Juneau_Rainforest_Garden-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife & I went here as part of an excursion from the Regatta & it was really educational & totally interesting. The stroll thru the rainforest makes one appreciate the natural habitat we live in. There are markers & a written guide to help identify the different plants. The tour is completed with hot tea & cookies with a Q & A session with the directors. This was better than I had anticipated & would love to do this again.",
  "The owners have a love affair with Alaska and it shows in their heartfelt talks that cover everything from ethno-botany (study of the traditional knowledge and customs of a people concerning plants and their medical, religious, and other uses), to the natural history, history and geology of the state. As the owners give their presentations,  we get to sip their delicious orange spiced tea and devour the homemade cookies. Oh yes, the short walk that covers a miniature rain-forest plant and tree community has easy to read signage and is very photogenic. Lastly, the owners make lovely stone sculptures that make for a one of a kind souvenir.",
  "Visited here while on a tour from the Ruby Princess cruise line, last cruise of the 2016 season. The hosts offer a very informative tour. Their garden is mostly level, compared to other rainforest tours. Would recommend this for a person interested in botany. The hosts were very professional, and gave a presentation at end with hot tea and fresh baked cookie. I was so busy following the informative guide with markers in garden that I missed most of the presentation at end unfortunately.  Hostess told me she updates moves the markers around in the garden along with guide with the blooming and growth season in the Juneau Rainforest Garden.",
  "This is a nice garden, run by a couple who display a large amount of the flora typical of Juneau, Alaska. They move markers around weekly so you can easily see what is showing well for that week. At the end, they offered cookies! It was not high-powered, but fun.",
  "Juneau Rainforest Garden was a lovely place to visit. It is not a traditional garden but a loop walk in the natural forest canopy of Sitka Spruce and Western Hemlock with the plants along the way. It is a great way to identify the plants of South Eastern Alaska and their uses by the indigenous people and animals as there is information next to the plants. There are so many varieties of berries. Unfortunately the dreaded mosquitoes are prevalent so a leisurely stroll can become a brisk walk. The hosts kindly provide insect repellent to ward them off. The walk finishes with a talk and a refreshing cup of locally produced cinnamon tea (I bought some). They also give you a list of the plants so you can identify and tick off the ones you saw in the garden and out and about. We also enjoyed the sculptures. It is a very natural way to learn about the flora of Alaska.  I would very much recommend this lovely walk in the woods created by hosts who very much love their garden.",
  "Take a short, easy walk through an Alaskan rain forest and learn about the plants that grow there, from hosts Jane and Jeff Svinicki. Jane is extremely knowledgable about the botany of the area and Jeff is an expert in history and climate. They serve really good tea and cookies too :)",
  "My wife & I went here as part of an excursion from the Regatta & it was really educational & totally interesting. The stroll thru the rainforest makes one appreciate the natural habitat we live in. There are markers & a written guide to help identify the different plants. The tour is completed with hot tea & cookies with a Q & A session with the directors. This was better than I had anticipated & would love to do this again.",
  "The owners have a love affair with Alaska and it shows in their heartfelt talks that cover everything from ethno-botany (study of the traditional knowledge and customs of a people concerning plants and their medical, religious, and other uses), to the natural history, history and geology of the state. As the owners give their presentations,  we get to sip their delicious orange spiced tea and devour the homemade cookies. Oh yes, the short walk that covers a miniature rain-forest plant and tree community has easy to read signage and is very photogenic. Lastly, the owners make lovely stone sculptures that make for a one of a kind souvenir."
 ]
},{
 "name": "Statue of Patsy Ann, the Dog",
 "address": "Dock at Marine Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/7f/ae/d3/her-statue.jpg",
 "tags": [
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d12866714-Reviews-Statue_of_Patsy_Ann_the_Dog-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love dogs, and that is the reason the Statue of Patsy looks to me like the most significant tribute to a dog.  I recommend buying the book and take the picture with the statue. ",
  "A sweet story of a deaf dog, who  used to visit the water front, depicts this statue of Patsy Ann the dog.\nIt is mentioned that she used to come to the waterfront to welcome the ships, its an amazing thing  as she was supposed to be deaf.\nA nice tribute to a faithful  dog.",
  "Nice stop along the boardwalk. Interesting history on how the statue came to be. The town obviously loved this dog. ",
  "We have been Juneau before but we did not notice this statue of Patsy Ann, right on the waterfront.  It's a very nice, large statue of a dog that once lived in Juneau.  The plaque tells the story of how she loved to come down to the waterfront and welcome ships and passengers to the city.  She was deaf but somehow knew when the ships were arriving!  Very sweet story of this well loved dog and a very nice tribute to her.  You can take a picture with the very large statue!  It is within walking distance of the ship ports and city area.  We had some extra time as we were returning to our ship so we happened to notice it!  Glad we did!",
  "There is a lovely story behind the sculpture of this amazing deaf dog.  Take a few minutes to read about her and marvel -how did she know where the boats would dock - spooky"
 ]
},{
 "name": "Sealaska Heritage - Walter Soboleff Building",
 "address": "105 S Seward St Suite 201",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/7a/5e/0b/sealaska-heritage-institute.jpg",
 "tags": [
  "art",
  "art",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d8403677-Reviews-Sealaska_Heritage_Walter_Soboleff_Building-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This compact display space was worth a visit in downtown Juneau. While small, it depicts well the native art and culture of SE Alaska, including a modern lodge house, which is used for ceremonies today, and an exhibit on art, fishing and more in the area. The attached gift shop (which sells the tickets to the space), has a wide variety of native art. Worth a stop alongside the other museums and galleries in town. ",
  "The Sealaska Heritage Center is a delight to visit.  Beautiful and informative exhibits, a great reproduction of a Tlingit lodge, and a nice gift shop full of authentic, native-made items.",
  "Beautiful building with good exhibit and extensive gift shop, offering an array of Alaska Native/Native - themed items ranging from $15 - several thousand dollars.  An opportune chance to see Preston Singletary glass art--his museum quality work alone is reason to visit the gift shop!  I believe presentations are given on a regular basis during cruise-ship season during the summer, but not in the winter.  With regard to the gift shop, while selection may seem limited, realize that the metal, basketry, and glass pieces require years of skill-building to produce; and cedar/spruce root is a very labor-intensive process to harvest and weave.",
  "Very nice collection of indigenous arts, carvings and more. It has the shop section and the exhibition part. The building itself is nice and located right in downtown. Definitely worth visiting.",
  "It is beautifully done, the welcoming guide was a native Alaskan very interesting to talk to.  Juneau was having a heat wave - - - the museum is air conditioned.  This is a definite bonus!!\n",
  "Don't miss this small but significant museum exhibiting art and artifacts from SE Alaskan history and heritage.  The space is beautiful and very well laid out.  The exhibits are informative and well curated.",
  "This museum has a lovely collection that shows the life of a village. The gentleman who introduces this is simply wonderful as well. So worth the visit!",
  "This compact display space was worth a visit in downtown Juneau. While small, it depicts well the native art and culture of SE Alaska, including a modern lodge house, which is used for ceremonies today, and an exhibit on art, fishing and more in the area. The attached gift shop (which sells the tickets to the space), has a wide variety of native art. Worth a stop alongside the other museums and galleries in town. "
 ]
},{
 "name": "Gold Creek Flume Trail",
 "address": "Off Basin Road trail",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/ef/37/c9/the-trail-is-built-on.jpg",
 "tags": [
  "walk",
  "hike",
  "pets",
  "walk",
  "walking",
  "hike",
  "walk",
  "hike",
  "pets",
  "walk",
  "walk",
  "hike",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d10523990-Reviews-Gold_Creek_Flume_Trail-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whenever our cruise ship docks in Juneau, we head out for this heavily wooded and shaded little trail.  It's easy to overlook it since it is just off Basin Road, where many others are headed to the Perseverance Valley.  If you want a longer hike, by all means first do the challenging Perseverance Trail up and into those magnificent views of the mountains and waterfalls.  Then come back to enjoy this little gem for dessert.    \n\nGet to the Juneau's hiking area by taking a left from the cruise ship dock onto Franklin Street, past the downtown hustle and bustle of shops, a bit over half a mile.  Franklin becomes an uphill residential street.  When you spot picturesque blue-and-white St. Nicholas Orthodox Church, go around it to follow the signs to the Gold Coast trailhead on paved Basin Street.  You'll be on Basin Street just a short few minutes before spotting the little sign \"Flume Trail\" low on the left, before the bridge. This trail is a wooden walkway built over the water flumes which channel water from the mountains to the city.  Sheltered from the wind, we have often spotted bald eagles (high in the tree tops) and lingered at the waterfalls.  Although it's only .6 mile long, it's the most scenic little trail we've ever done.  You can retrace your route, or exit the trail through the neighborhood, down a flight of stairs to overlook a local cemetery.\n\nWe are not young, nor heavy-duty hikers, so this walk appeals to all ages.  Pets have to be leashed.  Bring water.  Don't go when there's snow as the wooden flume freezes and is slippery  Enjoy this secret little outing!",
  "Easy parking at the trailhead, otherwise its a good hike up the hill from the docks. Nice, short, level walk on old wooden boards.  The other end puts you well north of town, but if you're walking, it's an interesting walk through the backroads back into town.",
  "Whenever our cruise ship docks in Juneau, we head out for this heavily wooded and shaded little trail.  It's easy to overlook it since it is just off Basin Road, where many others are headed to the Perseverance Valley.  If you want a longer hike, by all means first do the challenging Perseverance Trail up and into those magnificent views of the mountains and waterfalls.  Then come back to enjoy this little gem for dessert.    \n\nGet to the Juneau's hiking area by taking a left from the cruise ship dock onto Franklin Street, past the downtown hustle and bustle of shops, a bit over half a mile.  Franklin becomes an uphill residential street.  When you spot picturesque blue-and-white St. Nicholas Orthodox Church, go around it to follow the signs to the Gold Coast trailhead on paved Basin Street.  You'll be on Basin Street just a short few minutes before spotting the little sign \"Flume Trail\" low on the left, before the bridge. This trail is a wooden walkway built over the water flumes which channel water from the mountains to the city.  Sheltered from the wind, we have often spotted bald eagles (high in the tree tops) and lingered at the waterfalls.  Although it's only .6 mile long, it's the most scenic little trail we've ever done.  You can retrace your route, or exit the trail through the neighborhood, down a flight of stairs to overlook a local cemetery.\n\nWe are not young, nor heavy-duty hikers, so this walk appeals to all ages.  Pets have to be leashed.  Bring water.  Don't go when there's snow as the wooden flume freezes and is slippery  Enjoy this secret little outing!",
  "My wife and I were on a cruise and Juneau was the first Port of Call. We had been to Juneau before and did Mendenhall Glacier, so we wanted to do something different this time the Gold Creek Flume Trail was not that far from the cruise port. The views were beautiful as the snowpack was starting to melt and we could see numerous waterfalls. It was nice because you didn't hear any traffic, but rather just the sounds of the waterfalls and the creek which now turned into a river due to the snow melt. The trail itself wasn't that long due to construction. We walked down a wooden path and then had to turn around due to the trail being shut down. Overall, it was a very nice walk.",
  "This was a nice easy walk. Practically no elevation. It was comfortable and safe. We brought spikes for our shoes which we only needed in a few areas. \n\nFrom there we walked through town and back to the parking area. We locked out with non rainy weather. It was a nice walk.",
  "We began in the flume trail, which was a very easy hike. Then followed others up the mountain. Found more trails and views!! Just go enjoy the outdoors and hike as long as you want. The views are fantastic, the gold creek flume is a step back in the past. Totally loved it ",
  "Gold Creek Flume Trail is an easy walk recommended for anyone.  It's property is privately owned by the utility company that provided the trail for public access.  Foot bridges are nice and easy to walk through, though in the winter there may be one  spot that can be hazardous of ice forming one a spot on the trail that may be safer to turn around than possibly slip and fall over the cliff.",
  "Enjoyable to walk. Beautiful and not too strenuous. Juneau is a place to spend an extra day and explore. "
 ]
},{
 "name": "The State Capitol Building",
 "address": "5th Avenue",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/04/7b/6d/state-capital-building.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "walk",
  "tour",
  "tour",
  "art",
  "tour",
  "unique",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d1466951-Reviews-The_State_Capitol_Building-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "My parents, my wife, and I visited the Capitol Building on our Alaskan Cruise. I found the tour very informative and love how they allow for those all over Alaska to participate in their government.\n\nAllow at least an hour for the tour, and ask questions. The tour guides are very informative, and will go into more depth if asked.\n\nMake sure to put this on you list of must visits.",
  "Although I live in Alaska I have never walked across the street to see the beautiful bronze statue of the bear and a statue and monument to Secretary of State Seward who purchased Alaska. He has a very interesting history in addition to \"Seward's Folly\", the purchase of Alaska from the Russians. He was supposed to be killed at the same time President Lincoln was killed but the shooter didn't go through with the assassination.  The Capitol does not have a beautiful dome like other states but it is worth it to go inside for a tour.",
  "Very solid looking building very much worth the walk to photograph it.  I didn't go inside but I understand you can.  Dont miss the bear sculpture just below in Main Street.  Walk a block further to St Nicholas Russian Orthodox Church, a beautiful little church.  While you are there visit the cathedral in the same street.",
  "At first it just looked like a regular government building until a tour guide mentioned that it was the state capitol and at the time they were doing some renovations. The tour guide did mention that it was in the top 50 for state capitols which was great for a laugh. I think most of the political decisions are made in Anchorage.",
  "Worth visiting. It is small, but a real Capitol in all ways. Interesting, that to gather representatives here is a problem, as the town situated on an island, so they mostly are flying from different places in Alaska. ",
  "While in the city museum next door, I was delighted to hear that a tour was starting up in half an hour (self guided also available). Ed, a former journalist shared many stories from his days covering the state legislature. This added a lot, especially as a non- Alaskan. The self guided tour would have been good too though so worth poking your head in either way. The guided tours seem only to be during tourist season though and only during the week. Also be cautious of the construction, there is a temporary entrance up the hill. Enjoyed seeing the legislative and committee rooms and the Alaskan art.",
  "While the exterior is an ordinary office building, the inside reflects the varied politics and elected officials over the decades.  Quite a few unique photos and artwork pre- and post- 1959 statehood. The building is very welcoming, no cost, no intrusive security. Join a tour (approx. 10-3, M-F) to get a first-hand story from a local. Interesting stories about staff and members getting to the Capitol on snowy winter days.",
  "Took a self-guided tour of this place on a rainy day in AK.  Glad we did.  Interesting and the price is right."
 ]
},{
 "name": "Steep Creek",
 "address": "Glacier Spur Road Mendenhall Valley",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/25/6b/07/the-mouth-of-steep-creek.jpg",
 "tags": [
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d8862894-Reviews-Steep_Creek-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Steep Creek runs right next to Mendenhall Glacier and is easily accessible from the same parking lot. The trail network is mostly a series of boardwalks that run next to and above the creek itself. There is only about a quarter mile of total trail, and it's all flat and accessible. When we visited in late August, there were some salmon coming upstream and spawning that we could easily watch in the shallow water of the creek. One of the major attractions of Steep Creek is the black bears that come to catch the salmon. They apparently visit most days, but although we came three different times on the two days we were in town, we missed seeing them. According to the ranger stationed there, though, it's an incredible experience to see them right there with only a waist-high fence separating you. Apparently the bears are conditioned to ignore people and all their cameras, and since the people stay on the trail, they aren't perceived as a threat. This was a fun visit.",
  "Steep Creek runs right next to Mendenhall Glacier and is easily accessible from the same parking lot. The trail network is mostly a series of boardwalks that run next to and above the creek itself. There is only about a quarter mile of total trail, and it's all flat and accessible. When we visited in late August, there were some salmon coming upstream and spawning that we could easily watch in the shallow water of the creek. One of the major attractions of Steep Creek is the black bears that come to catch the salmon. They apparently visit most days, but although we came three different times on the two days we were in town, we missed seeing them. According to the ranger stationed there, though, it's an incredible experience to see them right there with only a waist-high fence separating you. Apparently the bears are conditioned to ignore people and all their cameras, and since the people stay on the trail, they aren't perceived as a threat. This was a fun visit.",
  "We were so very fortunate to see a cinnamon colored black bear and her cubs that like to stay in this area.  The mother bear was racing back and forth below us trying to catch the silver salmon that had come to spawn in the creek.  The water was just a little too deep for her to be successful.  The walkways give you a great sense of security, as the bears, even though close, are down below you.  Even without the bears, the area is fascinating. We watched salmon building their nests by fanning their tails and what appeared to be couples pairing off.  The visitors center has an underwater fish cam in this area and you can see the spawning salmon along with last years hatchlings.",
  "The Creek, time of year depending may be full of salmon. We visited in September and they were there. The trails at Mendenhall are very well kept. You can take the trail to the Creek or just go to the end of the parking lot. :) ",
  "Away from all the tourists it is possible to get the real feel if this magical place.  Feels like going back in time.",
  "Walk along the Creek on a boardwalk elevated and fenced for easy close viewing of salmon spawning. Accessible from close parking areas for all abilities. Near Mendenhall Glacier Visitor Center. ",
  "After our observation of Mendenhall and Nugget Falls, we took the boardwalk not knowing where it led to or what it was even for. A small portion of it was open as the ranger said there are 2 female bears and their cubs living around this area. There was a small stream and near it were salmon. Along came a Mama Bear (all black) and her cubs, while the cinnamon bear laid up under some trees higher up the hill.",
  "I love wildlife.  I live in Alberta, so it's no stranger to me.  BUT, I've never seen wildlife from a bird's view!  It was amazing to stand on the board walk and watch Niki (?) and her twin cubs hunting, swimming and roaming and then walk right under us.  Twice!  What an amazing sighting!"
 ]
},{
 "name": "Chichagof Island",
 "address": "Icy Strait",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/8e/ba/d7/a-remote-beach-we-stopped.jpg",
 "tags": [
  "nature",
  "tour",
  "walk",
  "tour",
  "history",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d677184-Reviews-Chichagof_Island-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Chichagof Island is the fifth largest island in the United States. It is suppose to have highest population of bears in the world.",
  "It is one of the biggest islands in the USA and we were here on a cruise from Seward to Vancouver. Most cruises don't stop here (yet) and that is a pity, because this is a great place to enjoy the Alaskan wildernis. We were on a bear viewing tour with Hoonah Travel Adventures and we saw a lot of bears! Also bald eagles and black tail deers, nature is beautiful out there!",
  "Picked up and drooped off at hotel, flew by float plane to the island, short walk to benched by a river and falls to watch bears in their natural environment. Once in a lifetime experience!",
  "We were on a small vessel cruise. Just amazing views of mountains and forests, the occasional whale spout and bear on the shore. We saw jellyfish, otters and porpoises in some of the fjords, and lots intertidal life when the tide was low.",
  "Small tour, dedicated tour guide who is not only a local but was a community leader with a rich family history of this area. Went out of his way to show us the island, explain the beauty of the wilderness and made every effort for us to see brown bears. Which of course we did. Alaska is about the people, the wilderness, and seeing these bears is a highlight . Worthwhile."
 ]
},{
 "name": "St. Nicholas",
 "address": "326 5th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/0a/a1/02/st-nicholas.jpg",
 "tags": [
  "walk",
  "hike",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d2290084-Reviews-St_Nicholas-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "There were a lot of Russian settlements in the region, but this small orthodox church was built much later, as in Juneau there were no Russians ",
  "Cute little Russian Orthodox church, but not much to look at inside.  For me it wasn't worth the long, exhausting walk up hill.",
  "A bit of a hike up the hill, out of town, but worth the steps!! An authentic Russian Orthodox church. Tons of historical information in the side building!!",
  "Although the church was locked, despite being opening time, you did not need to gain entrance. You can see the charming little church completely  through the glass door.  A bit of a climb from downtown but the ambience of the area is worth it.",
  "Entrance to the church is free but it’s worth making a donation. It’s so small and quaint but immaculately and lovingly maintained.  There is a good amount of literature to read about the history and the construction, which has been well documented. "
 ]
},{
 "name": "Juneau-Douglas City Museum",
 "address": "114 W 4th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/65/48/e6/the-four-story-totem.jpg",
 "tags": [
  "walk",
  "history",
  "walk",
  "tour",
  "walking",
  "history",
  "unique",
  "walk",
  "history",
  "walk",
  "history",
  "walking",
  "history",
  "history",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d144193-Reviews-Juneau_Douglas_City_Museum-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a nice local museum with interesting displays.  It lays out the history of the Juneau area very well. An hour will do it unless you really get deeply involved in a particular piece of history.\nWell worth the ticket price, and an easy walk downtown.",
  "Meant to stop in the last time we were in Juneau but didn't have a chance. With bad weather canceling other plans, we took a walk and stopped in. Very interesting video on the history of Juneau as I never knew why and how it was founded or became the state capitol. Definitely worth a look if you want to get to know more about Southeast Alaska. Also, the volunteers manning the check-in desk were very informative and gave us even more suggestions on what to see on our self-guided walking tour.",
  "The Juneau-Douglas City Museum has a very informative video.  The museum is a block away from the state capitol.  Exhibits cover the native Alaskan culture, the gold mining industry, the loss of the USS Juneau in WWII (the Sullivan brothers), and the sinking of the Princess Sophia near Juneau (worst maritime disaster on the west coast - only the dog survived).  We spent about an hour at the museum and felt that it was very worthwhile.",
  "This museum is not overly large, but the staff is helpful, and the displays are unique and interesting. I had absolutely no idea that there was a controversy over the location of Alaska's state capitol, but there was a very interesting display discussing that very topic. Also some fascinating political cartoons on display in the restroom! Worth a quick detour if you have a few minutes to visit this museum!",
  "Interesting Museum on the history of Juneau. It is very small but worth taking the time to visit since its a short walk from the cruise ships. Great video and interesting artefacts on display.",
  "Don't miss the museum's video about gold mining in Juneau, but if you only have time for one museum spend it at the State Museum which is only a couple of blaocks from the City Museum",
  "Interesting Museum on the history of Juneau. It is very small but worth taking the time to visit since its a short walk from the cruise ships. Great video and interesting artefacts on display.",
  "Only one person to take admission fee and pay for souvenirs.  It's well laid out. It follows the history of Juneau especially Its mining history. Easy walking distance to Governor's mansion and Alaska State Museum. Parking is an issue.",
  "The city museum gave a comprehensive look at Juneau's history and that of the region. parts seemed a little dated compared to the newer museums in town but it was comprehensive and had a good movie about the history and tradeoffs of the extractive industry rushes and diversity of population. also a source of info about the adjoining state capital. ",
  "Offers a very informative history of Juneau that includes the Treadwell Mine cave in 1917 and a video \"Juneau, City built on gold\". Well worth a visit.",
  "Easy walk from cruise ship dock and located across the street from the capital building. Sad to find building not open until 1000 on Saturday."
 ]
},{
 "name": "Last Chance Mining Museum",
 "address": "1001 Basin Rd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/f1/47/c5/mine-d-or-abandonnee.jpg",
 "tags": [
  "walk",
  "history",
  "history",
  "walk",
  "nature",
  "knowledgeable",
  "free",
  "kids",
  "tour",
  "walk",
  "nature",
  "walking",
  "knowledgeable",
  "walk",
  "history",
  "walk",
  "history",
  "walk",
  "walking",
  "history",
  "history",
  "walk",
  "kids",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d144192-Reviews-Last_Chance_Mining_Museum-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I walked up to the museum from downtown Juneau. The walk was easy and beautiful! The museum itself is small but has many very interesting items. The owner was working in the yard and opened up for us. Well worth the $5 entry fee. The grounds and setting are nice as well. It gives a good perspective on the gold mining history of the area.",
  "The Last Chance museum is ins one of the original mine buildings, with much of the equipment used in the early 1900's left in place. We walked from downtown, and I guess it was a little over a mile, but you get to see real neighborhoods, and a couple trail heads as you near the mine. If you enjoy old machinery, or are interested in mining history it is a worthwhile visit. If you take a taxi it is a short gravel path up a gentle incline to reach the museum.",
  "Fun talking with the nice volunteer at this museum. The setting outside the museum might be the most beautiful setting ever in the mountains with little waterfalls in the background. Take a small walk up a nature path and foot bridge to get to it. $5 for admission (which helps keep this nice historical place with volunteers open-thank you volunteers). The kids were free by the way.\n\nThe knowledgeable volunteer (didn’t catch his name but originally from the Midwest) also gave us tips for planning for gold in the public creek just below the museum (you can buy a pan, or in our case we used our own little stainless steel camping pan lids). \n\nWe drove as it seemed to far to walk from downtown Juneau (but assume it’s a quick and reasonable cab/Uber).\n\nIf your cruise ship tour doesn’t include this museum, you may consider just going to this museum yourself to help support it. We enjoyed being on our own panning for gold in the public creek (you don’t have to pay for being on a tour to pan for gold since it’s a public creek, so unless you want someone like a tour guide by your side to explain what you are looking for which is usually little gold specs then it’s not really needed, since you can get that same information from the museum if you ask for some pointers at the museum); and the museum is self explanatory for a quick walk through. But if you like tours am sure it’s fun too. Have fun and may you strike it rich.\n",
  "The Last Chance Mining Museum is more than that - the museum is great, with lots of well-placed artifacts and a very knowledgeable staff.  Check times if interested in the museum - it may be closed during the lunch hour.  That said, you can take a nice walk from the parking lot at the end of Basin Road across the Gold Creek and up the hill to incomparable views of the mountains and valleys, the Perseverance Trail, and remains of mining equipment waiting for the forever miner to return.  Gold panning in the creek is a popular local pastime, let an expert show you how it's done!  A few steps and steep incline make it tough for some but there are many spots to sit and enjoy the view or take your time while walking.  Don't miss out - mother nature is slowly reclaiming these artifacts!",
  "Getting there is a nice walk. Take an umbrella or rain jacket just in case the weather isn't being cooperative.  We enjoyed this museum, as it is an original building to the mine.  Numerous pieces of equipment for the mining operation and the miners are displayed. Reportedly the air compressor housed inside the building and in its original location, is the largest ever built by Ingersoll-Rand.  The area is absolutely gorgeous and the museum well worth your time.",
  "The Last Chance museum is ins one of the original mine buildings, with much of the equipment used in the early 1900's left in place. We walked from downtown, and I guess it was a little over a mile, but you get to see real neighborhoods, and a couple trail heads as you near the mine. If you enjoy old machinery, or are interested in mining history it is a worthwhile visit. If you take a taxi it is a short gravel path up a gentle incline to reach the museum.",
  "My husband and I walked up to the museum from downtown Juneau. The walk was easy and beautiful! The museum itself is small but has many very interesting items. The owner was working in the yard and opened up for us. Well worth the $5 entry fee. The grounds and setting are nice as well. It gives a good perspective on the gold mining history of the area.",
  "We took a walk in Juneau and in a hillside neighborhood spotted a sign - 1 mile to the museum. So we kept walking. The road loses its pavement as it follows high above the creek. Salmonberries grow along the edge. The museum is across the creek and up the hill at the end of the road. When we arrived, we found the sign: the museum is closed for ?3 hours? midday. But there was a place to sit and rest and have a snack, so we stayed. The docent who arrived at opening time was a mine history enthusiast and meeting him and seeing the museum was well worth the wait.",
  "The Last Chance museum is ins one of the original mine buildings, with much of the equipment used in the early 1900's left in place. We walked from downtown, and I guess it was a little over a mile, but you get to see real neighborhoods, and a couple trail heads as you near the mine. If you enjoy old machinery, or are interested in mining history it is a worthwhile visit. If you take a taxi it is a short gravel path up a gentle incline to reach the museum.",
  "It's about 45 minites of mixing of walk and hike from cruise terminal to the museum with kids. It was cloudy and misty during the walk. It was a quite long uphill to the forest but there were interesting buildings and graffities to check out.  The forest walk was nice and relaxing but it was a bit long for kids. We wanted to see the exhabitions but it was closed.\nThere was a nice swing for kids and some of old machines to see. We found the place for the gold panning so we just had fun looking for gold. When we were there, it was the late August but it wasn't warm with light rain.",
  "Museum near cruise terminal but uphill trek. Rented a car for the day. Drove there. Interesting .25 mile walk from parking lot over bridge over Gold Creek, slight uphill to museum. Fascinating heavy machinery and equipment and tools displayed. "
 ]
},{
 "name": "Jensen-Olson Arboretum",
 "address": "23035 Glacier Hwy",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/c2/89/dc/so-lovely-along-the-fence.jpg",
 "tags": [
  "tour",
  "free",
  "wander",
  "free",
  "tour",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d10365412-Reviews-Jensen_Olson_Arboretum-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I stop by the arboretum a few times a month and take any guest there that visit me in Juneau. The gardens are spectacular.  Currently you simply do a self guided tour though there are usually staff on the grounds that can answer questions that you may have.  On a low tide it is also fun to go beach combing and find treasures from the sea.   When this was donated to the city for a park this was the hope of the former owner Caroline Jensen:  “The vision of the Arboretum is to provide the people of Juneau a place that both teaches and inspires learning in horticulture, natural sciences and landscaping – to preserve the beauty of the landscape for pure aesthetic enjoyment – to maintain the historical and cultural context of the place and its people.”  It is free to stop in here though I would suggest a donation to help keep the place as beautiful as it is now.  Lastly it is less than one mile past a very popular tourist spot, The Shrine of St. Therese, so if you visit there, make an effort to stop at the Arboretum.",
  "We were pleased we stopped at this garden nestled in a forest by the bay.  \nIt’s small and you will need to be a plant lover  to appreciate it.  It’s just past the shrine of St. Terese, so if you’re out that way I’d recommend you stop.  ",
  "Go see this beautiful garden! What a pleasant surprise, it is not a typical Alaskan tourist spot. Wander through flower-filled gardens, then take a moment to check out the great water view from the beach. It is free, but you can give a donation.",
  "We were here a little early in the season but what was blooming was just gorgeous!  I can't imagine how beautiful this place is at the height of the growing season!  The variety of plants was amazing!",
  "Some distance from town. Originally set aside for the pleasure of local residents. Not a commercial tour site.  ",
  "Very well maintained gardens and stunningly wonderful setting. Set next to a forest of trees with ferns growing widely. Quiet and a little out of the way. ",
  "Beautifully  landscaped  grounds with an area dedicated to a food garden which is donated to a local charity.  Volunteers and the caretakers spend many hours maintaining and everything was labeled with names of the plant.  Would love to live here in this awesome setting.",
  "I've gone twice this year and just love this place. Amazing variety of plants, flowers, vegetables, trees, and so much more. Looking forward to another visit to see changes and what else is blooming!"
 ]
},{
 "name": "Alaska Governor’s Mansion",
 "address": "716 Calhoun Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/aa/75/c2/alaska-governor-s-mansion.jpg",
 "tags": [
  "walk",
  "walk",
  "tour",
  "walk",
  "walking",
  "tour",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d8617045-Reviews-Alaska_Governor_s_Mansion-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "The State of Alaska Governor's residence (Bill Walker is current governor 2016) is specifically NOT called a \"mansion\" -- rather it is formally known as the \"Governor's House,\" as the people of Alaska did not want the governor to be royalty, but rather one of the people. It is a pretty house with a totem pole. You can go up on the porch and have your photo taken. Generally not available for inside tours, just viewing the outside, except upon special arrangements or during community open house at Christmas.",
  "Anyone can literally walk up to the door, no fence no gate. The building is way prettier than the Capitol. They use the side door as the entrance so don't miss seeing the real front...",
  "With time on our hands and not inspired by the tacky tourist shops and sidewalk drunks in downtown Juneau we took a short stroll up to the Mansion. It's just a nice house where you can walk up to the front door ( but probably not a good idea to ring the bell!). A pleasant stroll though the back streets there and back.",
  "We went on a tour of Juneau and saw the Governor’s mansion from a distance. It was pretty but hard to believe that it was so close to downtown.",
  "I enjoyed walking to the Governor's Mansion. Reminds me of the architecture from my home state Mississippi. The grounds and home are nicely maintained. The walk to the mansion is a workout but now I can say I've seen the Alaska Governor's Mansion.",
  "It's the governor's mansion.  Good for him.  Not sure why this is listed as an attraction.  If the Governor invites you to lunch here, go.",
  "We did a self-guided walking tour of Juneau sights and this was one of them. It is an impressive home from the outside though we were unaware of any possibility of going in the home.",
  "Don’t miss this stop along your walk around town.  Loved that it wasn’t overly grand and fits its location nicely.  Absolutely love the simplicity of Alaska.  "
 ]
},{
 "name": "Cathedral of the Nativity of the Blessed Virgin Mary",
 "address": "416 5th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/0e/7d/9e/outside-of-church-shot.jpg",
 "tags": [
  "walking",
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d8134447-Reviews-Cathedral_of_the_Nativity_of_the_Blessed_Virgin_Mary-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visited here for Sunday mass while we were on our cruise. They do offer a bus from the dock to the cathedral. The phone number is on their web site. Unless you are in great physical shape, I recommend taking the bus. The cathedral is perched on the hillside above the city not far distance wise but the steep incline could be daunting to someone not in good shape.Parishioners were friendly. Traditional Catholic mass",
  "This is the smallest Cathedral in the United States.  They have a very convenient Mass on Sundays at 5:30pm, which was perfect for when our cruise was in Juneau.  They have a bus that they use to transport guests from the cruise ship to Mass, which was very convenient and nice.  Very nice parishioners who are eager to get to know their brothers and sisters from the lower 48.  If you are Catholic and desire to maintain your relationship with God while on your cruise vacation, this is a must!",
  "When you dock in Juneau from the cruise ships you are quickly met with many shops and vendors trying to get you to take their tours. There are also bars and overall crowds, depending on how many ships are in port. The sales effort seemed particularly assertive since we were the second to last cruise of the season.\n\nThe decision to attend a daily Mass at the Cathedral of the Nativity of the Blessed Virgin Mary gave us an opportunity to discover a warm and welcoming environment away from the hustle and bustle. Daily Mass is at 12:10 pm and 9:30 am on Saturdays. The Saturday Vigil Mass is at 9:30 am. The Sunday Masses are 8:30, 11 and 5:30.\n\nBefore Mass even started the celebrant recognized us as new to the community and welcomed u warmly. Speaking to the deacon after Mass we realized that he was familiar with our area and knew other priests he knew. It was like being at our local Parish.\n\nThe setting of the Church is incredible with mountains all around, either covered with snow in the winter (from the photos I've seen), or flowing with numerous waterfalls, as when we were there. It is walking distance from the docks but it is not \"just down the street,\" and it's at the top of a hill. Furthermore, when we were there it was pouring rain so be prepared for the Alaska extreme weather ( we were there in early September). If you are looking for a massive, European-style Cathedral, this is not the place for you. It is perfect, however, for Alaska!",
  "Great little church in Juneau.  They provide a free shuttle from the docks to the church for visitors.  Patty, the bus driver is a local and can answer many questions about the area.  Mass at the Cathedral was beautiful.  The priest and the congregation were very friendly and welcoming.  The church itself was small and very simple, not what you expect at a Cathedral.",
  "The title is a lot grander than the size of the building!  It’s a tiny building and being honest not as pretty as St Nickolas across the road. Worth a few pictures but you won’t need to spend long here.",
  "Go here and help with the funding for building.  Deacon gave an outstanding Homily.   Summer crowd mostly from outside,  came from all over the planet.",
  "Cute little church , took some pics to send to a catholic priest friend of mind , he loved them . Cathedral title stretching it a bit lol ",
  "Went to Mass on a Saturday evening.  Very friendly congregation and a simple Mass.  The priest was friendly and greeted us (since we looked like tourists).\n\nThere is a free shuttle which will pick you up from the dock and return you at the end of Mass."
 ]
},{
 "name": "Empty Chair Memorial",
 "address": "521 Seward St Capital School Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/b3/49/1a/empty-chair-memorial.jpg",
 "tags": [
  "walk",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31020-d12580386-Reviews-Empty_Chair_Memorial-Juneau_Alaska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This very simple way of depicting the internment of Japanese during World War II is evocative of the era. This was a time when older and very young Japanese were interned while the young Japanese men were expected to fight in the US forces. As the grandson of an Italian who was interned in the UK while my father and his brothers were sent to war this was very poignant.",
  "I was able to attend the dedication of this memorial in July, 2014.   I was deeply touched by how the community came forward after all these years that have passed, to create this memorial out of respect for valedictorian John Tanaka's absence at his high school commencement.   It is also a powerful symbol of all of those Japanese American citizens in Alaska who were sent to the concentration camps by the US government because of their race.   The \"simplicity\" of the empty chair is a beautiful and impactful tribute.  The artist, Peter Reiquam, captured the significance of this tragedy.",
  "I saw a video documentary about the US Government unjustly removing American Citizens from their homes and businesses in Juneau Alaska, because they or their parents had come from Japan. It was heart wrenching to see actual footage of this thoughtless act of betrayal of American Citizens by their government. The student and many of the town's people were appalled at the treatment of their friends and neighbors. Because the students wanted to show respect and honor a fellow student taken away without cause, the senior class set an empty chair on the stage with the rest of the graduating class representing their interred friend! Former students as well as numerous towns people were finally able to get this monument dedicated in July 2014 to honor those victims of one of many dishonorable acts committed by the American Government in WW-II. After seeing that video I knew I needed to see the actual memorial the next time I was in Juneau. It's not Mount Rushmore, but it had an even bigger impact on me when I saw it. Take a moment of your time to check out this memorial, it's worth it!  ",
  "Wow! This is a very poignant and touching memorial.  The statement for it is: Honoring Juneau's Japanese community unjustly incarcerated during WWII - 1941-1945.  After the attack on Pearl harbor, people of Japanese ancestry were removed from their homes and sent to live in interment camps for the duration of the war.  This memorial speaks to the injustice they suffered.  At their graduation in 1942, senior students left an empty chair for John Tanaka, who was to be the valedictorian of their class.  The empty chair remember all 53 people who were displaced from their homes as well.  It also represents the feeling of loss felt by the community of Juneau after their friends and neighbors were taken away.  The name of all 53 are listed on the memorial.  It is a poignant lesson for future generations and a reminder of man's inhumanity to man.  Very thought provoking.",
  "We came across this simple yet profound memorial that made you think about those Japanese Americans interred as a consequence of WW2.\n\nIn my humble opinion one of the better memorials as the simplicity itself evokes a need to find out more. Easily found from where the cruise ships dock and just one of a number of historic related items to encounter on a walk through the 'old' town area of Juneau.\n\nInformation about the memorial is provided on an associated and co-located board.\n\nIf you do the walk do have a look at this memorial as it really isn't out of the way."
 ]
}]
