[
{
 "name": "Potter Park Zoo",
 "address": "1301 S Pennsylvania Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/70/c9/24/photo1jpg.jpg",
 "tags": [
  "walking",
  "walk",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282094-Reviews-Potter_Park_Zoo-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Took our 3 year old granddaughter to the Zoo and it was the perfect size for her. It kept her attention and didn’t ware her out. The zoo keepers are great with young children. Nice, friendly and clean. ",
  "I haven't been to a zoo in a long time and this zoo had everything. It took us 2 hours to walk around and see everything. The animals looked well  and clean. Everywhere you looked the peacocks were walking around. It was really neat. They had a train ride for the families and you could also rent strollers. We were out of towners so the cost was $11.00 per person. Well worth it. Would love to go again next year. Lots of families but it wasn't overcrowded.  Their is also a park and families were having a barbeque. Bring your walking shoes.",
  "great place to visit. lots of animals to see and well worth every penny. petting zoo is awesome and a must for small children. camel ride is very cool.",
  "This zoo is downright tiny, almost miniscule.  OTOH, their black rhino recently gave birth, which was worldwide news.  The miniscule size is actually a blessing for people with small children.  There are few really large animals and no great apes (my favorite), but this is a very pleasant place to visit and to stroll around.",
  "Potter Park Zoo is small but well organized and a great afternoon outing for young children, without being too tiring. My granddaughter enjoyed the little train ride, although it was $3 for 3 small circles that went nowhere, so wouldn't necessarily do that again. The petting zoo, and Reptile bldg is great. Plus there's a baby rhinocerous, tigers, and lions to see close up! The winter festival of lights was also enjoyed by all.",
  "Didn’t know what to expect. But for the greatly reduced price compared to summer it was totally a fun thing to do in the winter. No crowds and plenty of animals to see. Places to go inside and warm up.",
  "If you can afford it I recommend that you make the drive to the Detroit Zoo.\n\nThe potters Park zoo is not on my list of places to visit anymore. They are very lacking in animals and the place seems to have gone down hill since I was last there while I was in school.",
  "I visited this last summer for the first time. I plan to visit again over the holidays to see the light displays etc. Really a nice establishment. Easy parking and friendly staff. "
 ]
},{
 "name": "Michigan State Capitol",
 "address": "Capitol Avenue at Michigan Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/82/30/9b/michigan-state-capitol.jpg",
 "tags": [
  "walk",
  "free",
  "eat",
  "tour",
  "cheap",
  "history",
  "history",
  "eat",
  "tour",
  "cheap",
  "tour",
  "kids",
  "walk",
  "learn",
  "tour",
  "unique",
  "tour",
  "tour",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282093-Reviews-Michigan_State_Capitol-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "One must visit in order to appreciate.  Lots of photos and intricacies to see here - all free of charge, so you can simply walk about the Capitol on your own.  May take you 1-2 hours to see it all.  We visited while they were in session, so no photos allowed of the floor.   ",
  "You are able to hop on with a group tour (we toured with a group of 4th graders) or they have booklets at the best that give you the details for a self-guided tour.  Very pretty and impressive building on the inside.  Tour will take under an hour but is well worth it.  Parking via parking garage or street meters nearby and fairly cheap.  A few places to eat nearby too.  The grounds have a few statues to look at also.  Only open M-F during normal business hours.",
  "Lots to see. Beautiful building, Well worth a \"destination\" trip!! Tours provide great information about the history of both the building and of the state",
  "Outside the State Capital facing Michigan Avenue is a state historial marker giving a great short history of the building (see pictures). Note it is different on each side, so read both.",
  "You are able to hop on with a group tour (we toured with a group of 4th graders) or they have booklets at the best that give you the details for a self-guided tour.  Very pretty and impressive building on the inside.  Tour will take under an hour but is well worth it.  Parking via parking garage or street meters nearby and fairly cheap.  A few places to eat nearby too.  The grounds have a few statues to look at also.  Only open M-F during normal business hours.",
  "The Michigan State Capitol was beautifully restored in 1992 and worth touring.  It's fun to look up at the dome and then realize that you're standing on a glass floor!  The House and Senate chambers are well worth viewing.\n\nIf you're going to the Capitol, the State of Michigan Museum is a few blocks away and is a great place to take the kids (even big kids like it).  You begin your tour with the large map on the wall and the wilderness and progress from there.  I like the exhibit from the 1950s.",
  "One of the most interesting things about the interior design of our state capitol is that many of the finishes are faux paint effects. Years ago I used to walk through the capitol on my way to work, from the downtown Lansing bus stop. I could walk up the steps and open the enormous wooden front doors. Now, for security and preservation reasons, those entrances are no longer used. There are many unique characteristics of our capitol which you can learn from tour guides.",
  "Did a tour with one of the personable guides who was extremely friendly and informative. The dome area was the highlight of the tour with very few words to describe. Going into the chambers was extra special. The grounds were also impeccable. One weird thing is you can't bring placards or signs but you can bring a firearm (first time visiting a state capitol). Despite that it is well worth one's time to visit!",
  "Even after reading reviews and the Capital's website, the self guided tour far exceeded my expectations.  The building a amazing, and unlike anything you might see in any government building in the United State.  It is closer to what you might expect to see over seas, or maybe a building owned by Disney.  You can quickly go through the building in about 30 minutes if you read the guide (pdf) on the Court's website ahead of time.  It is full of some very good information that will greatly enhance your experience.  And best of all, everything is free, well, with the possible exception of having to pay to park at a meter or in a nearby parking garage.",
  "The Michigan State Capitol building is a must for any visitor to Lansing with its historical finishes and the Dome.",
  "We arrived in Lansing on a Saturday.  Since it was over a weekend we had to have a guide. A lovely lady who obviously loves history and people gave us full hour to three tiers of the dome. We had a Girl Scout Troop with the group and our guide directed\na special attention to the troop with observations and questions that were directed to them.  The building is rich with wood and ceilings in two places are the originals dating 1883. The dome magnificent with stars at its heavenly dome. Glass block floors throughout the rotunda areas. Etched ceilings for each state in Senate and House-of Representatives."
 ]
},{
 "name": "Michigan History Center",
 "address": "702 W Kalamazoo St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0c/0e/c0/michigan-historical-museum.jpg",
 "tags": [
  "music",
  "learn",
  "history",
  "family",
  "history",
  "free",
  "family",
  "free",
  "walking",
  "history",
  "free",
  "history",
  "free",
  "history",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282095-Reviews-Michigan_History_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "5-level venue featuring permanent & special interactive exhibits, artifacts & educational programs. Read, trek, and explore your way through the Great Lakes region's pre-history and history. Learn all about geology, and how glaciers formed the lakes & land and even influence how we live today. Learn about Native Peoples, hear their music & languages, see their tools and crafts. Experience how their languages influence us today in Michigan, with place-names like Okemos & Wacousta. Learn about wars, expansion, slavery and the Underground Railroad, Michigan's part in the Civil War, economy, copper mining, formation of unions, automobile manufacturing, Motown, sports, the Detroit Riots, and so much more! \n\nIn summer there are day-camps for children. Starting June 22: Dig Camp (Archaeology). Starting July 8: Future Historians, and more! \n\nThe \"Second Saturdays for Families\" Program features educational creativity. For example, Mid-Century Toys: Make a Lava Lamp. That is the second Saturday of every month.",
  "The Michigan Historical Museum takes you on a journey back and through time, with lots of well thought out exhibits to inform and entertain you. A family favorite for us is the replica of a U.P. copper mine from a 100 years ago. You could visit this museum twice a year and never be bored. ",
  "I go to a lot of museums around the world and this one was one of my favorites this year. Instead of just displaying the artifacts alongside informational panels all the rooms were designed to match the time period or topic displayed. Starting from 14,000 years ago to the 20th century the displays showcase Michigan’s history in chronological order. Another thing I liked is how the museum is laid out for one area to lead into another on an obvious pathway. While a lot of the things are relevant to USA history in general such as the Great Depression & WWII, there is a focus on the history specific to Michigan with such topics as the auto industry.\n\nParking is free on the weekends. Sunday admission and parking are free. If you have a Michigan state park past you can receive a discount. There is a small snack shop on the first floor, but I would recommend eating before or after visiting. Toilets are available on every floor. The staff are friendly and helpful.",
  "We visited from out of state with our son's family. Sunday afternoons are free, so you cannot beet the price. We had a one year old with us that loved all of the hands-on displays. The staff love to share stories about all on display. Very nicely done Michigan.",
  "one or two visits is enough - lots of walking - good if you have children along",
  "The Michigan Historical Museum is a beautiful  tribute to our state. The museum is full of rich histroy and meaningful, interesting artifacts. It is worth the trip and a place that needs to be visited many times to absorb vast history it holds.",
  "What a fun visit. Very well laid out. Parking is free and plentiful. Would recommend visiting on weekend when school groups are not there.",
  "One of the very best state museums in the country.  We visited on a Sunday when admission is free and guests are few.  Avoid during school trip visits.  I recommend two hours.  There is a rich history in Michigan.",
  "Saw this museum on TV and decided to travel to see it. Believe me it was worth the long drive. Plenty of parking. Floors 2 & 3 are fascinating . Allow plenty of time to look and see all the displays. History and education at its best. Visited on Sunday - FREE.",
  "This is a Hidden Gem downtown Lansing that everyone with any interest in history should experience. Whether you were born in Michigan or are a transplant you will enjoy it very much.",
  "Very good museum.  Would recommend for both adults and children. Great for Michigan.  One hundred characters!!!!!!!!!!!!!!!!!!!!!!!!!"
 ]
},{
 "name": "Impression 5 Science Center",
 "address": "200 Museum Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/46/25/99/impression-5-science.jpg",
 "tags": [
  "unique",
  "kids",
  "organized",
  "kids",
  "family",
  "family",
  "eat",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282150-Reviews-Impression_5_Science_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place for kids to have fun and get out of the rain. Worth the yearly membership for sure!  Something fun for all ages especially the little ones.  The staff was excellent and went out of their way to make sure everyone had a good experience.  Hands on learning in a fun atmosphere. Highly recommend. Very organized and the layout is in unique sections. Loved this place!!!!!",
  "Great place for children and adults to explore, lots of hands on activities to do. Our grandson loved spending hours there.",
  "My almost 2 year old loved it here. We were also visiting with my 8 year old niece and mother in law. There was enough to keep both girls busy sometimes together and sometimes separate. They have a really nice play area for birth-4 year olds with a smaller water area than the one downstairs and a few more activities that were perfect for smaller kids. It was kept up good too. We will definitely return.",
  "We’ve been to Impression 5 a handful of times with our eldest, but this was our first trip as a family of 4. At 2.5, our daughter is finally big enough (and tall enough) to enjoy the water area outside of the little kid room. Which speaking of, we love that they have thought of families with young children and they have a dedicated play space! AND as a nursing mom, I was beyond impressed that Impression 5 has a nursing room for those of us who prefer a little privacy while feeding our babies. FYI - the entire facility is nursing friendly. We’ll be back a couple more times this year, and for years to come. \nOur only suggestion is an increase in available parking for visitors and members.",
  "As a family this place is awesome! My husband and I took our 2 year old here and it was a blast. We were even playing with all the equipment.",
  "If you've got kids, take them here and just release them. There are 2 floors of children friendly science experiments. It's loud and there is always a lot of mayhem going on. It's better than letting them eat a Hershey's bar and it's more healthy. They'll probably learn a thing or two.",
  "It is big and open and there is a whole area dedicated to pretending to be a doctor, dentist, etc.  So may fin things I can't remember them all.  My son would have stayed five hours if I hadn't dragged him out after 3 1/2.  He is 7 years old.",
  "i took my grandson there we had a wounderful time. he especialy liked all the water activities. we will go back when he is a little older."
 ]
},{
 "name": "R.E. Olds Transportation Museum",
 "address": "240 Museum Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/51/0e/a9/excellent-very-cool-collection.jpg",
 "tags": [
  "history",
  "free",
  "family",
  "historic",
  "history",
  "historic",
  "family",
  "history",
  "free",
  "performance",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282224-Reviews-R_E_Olds_Transportation_Museum-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Get history of R.E. Olds and great history of the times.  Beautiful cars and other historical memorabilia.  If took us about an hour to peruse. ",
  "I may be partial to this place because the instrument panel that my dad designed for the Oldsmobile Omega is on display here!  Love to look at the cars and other items.  Very clean, people are pretty friendly and helpful.  A must see when you visit Lansing.",
  "A very nice collection of REO and Oldsombile memorabilia. The cars are also very impressive. Cost is only $5.00 for seniors and well worth it. Parking is free and it is close to downtown are.",
  "We saw this museum on a National TV show called American Pickers. We were planning a trip to this area and we love cars, so we included this museum in our itinerary. It was very interesting and informative. We enjoyed our visit. The cost is very reasonable, so you can afford to take the family. Not really recommended for younger children, as there are many beautiful antique cars that are not to be touched.",
  "A great variety of historic cars, easy to examine.  Nice exhibits. Located very close to the Capitol.  Oldsmobile is a part of the  history of Lansing, so check it out!",
  "If you are interested in learning more about the Oldsmobile brand and the history of R. E. Olds then you've come to the right place.  I would have to say that 70% or better of the collection features cars under the Olds and REO brands with a few GM offshoots and close cousin companies (such as the Dort Motor Co., for example). The remaining 30% of the exhibits feature artifacts relating to Old's other personal and family interests. For example R.E. Olds had interests in shipbuilding and had many yachts over the years.  The man did a lot of traveling all over the world and almost every picture of him depicts a genuine smile.\n\nOldsmobile was the branch of GM which had many innovations such as the first air conditioning system and front wheel drive car (Toronado). The \"rocket 8\" engine was one of the best that GM ever produced. The hydramatic transmission was way ahead of it's time in smoothness and performance.\n\nCheck out the one-of-a-kind vehicles such as the Hurst Olds with TWO ENGINES!  The oldest Olds car is located in this museum.  Also don't miss the leather license plate from the \"American Pickers\" TV show.\n\nMost people would spend one to two hours to go through this museum, but if you like to read all the place-cards and watch all the video programs you could spend all day.\n\nThis is a very good \"single brand\" automotive museum and is located in a historic building (musty smells included).   \n\nIf you are doing a museum road trip and are traveling between the \"Big Three\" in the area (Gilmore Car Museum in Hickory Corners, Mi., A.C.D. Museum, Auburn, In., and The Henry Ford in Dearborn, Mi.), this is a good midpoint stop.  The \"big\" museums are all within a two hour drive from this location.\n\nThis museum is located next to the Impressions 5 Children's Hand's-On museum so if you are bringing little ones who like to touch things, that is the best place for them to visit.  The R.E.Olds museum has it's own parking lot with free parking for visitors (on non-event days).",
  "One of the best small museums I've been to. Very nice overview of early American auto and truck industry. Nicely restored cars, and some fantastic unrestored gems.",
  "I found the museum, while small, is very good.  It has REO machines from the 1800s through the life of the last manufactured Oldsmobile engines, including a V-8, V-6 and double overhead cam engines.",
  "A Sunday stop looking back in time. Decided to visit after seeing R E Olds on tripadvisor. The displays are neat clean and well posted with info. Not to be missed is the Olds gas lawnmowers. Plenty to see so allow 1-2 hours.Parking lot right in front of museum.",
  "Amazing, astounding, outrageous place for anyone interesting in history, cars, or any type of technology. R.E. Olds started out making little STEAM ENGINES and they are all here. They have maybe 20 restored steam engines (which would probably work), from something that would fit in a wheelbarrow to giant ones for factories and sawmills. Speaking of factories, they have drawings and replicas showing the first auto factories, with the actual belt drives that transferred the power from the engines to the machines. There is an electric automobile from 1899, with pictures of women driving it--making me wonder if gas cars were considered more \"manly.\"  (I'm a woman who drives an electric car today). Also an EV1 from 1999. Meticulously-restored Oldsmobiles from all eras.  I can't imagine the Vista Cruiser station wagon or the Toronado on the road today. These are priceless autos that you won't see anywhere else. Just the group of curved dash Oldsmobiles, made from 1901-1907, is worth the price of admission. There is room for kids to circulate, and you can touch some of the exhibits.",
  "Small but PACKED museum! If you like engines/ motors, they have many from small to the the mighty V-8.  The antique cars take you from  the early day of the horseless carriage through the beautiful cars of the 30's  then the muscle cars of the 70's.  Some BEAUTIFUL machines!!"
 ]
},{
 "name": "The Michigan Princess",
 "address": "Grand River Park",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/da/97/c1/early-morning-on-the.jpg",
 "tags": [
  "history",
  "kids",
  "drink",
  "music",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d2228897-Reviews-The_Michigan_Princess-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were welcomed aboard on the lunch cruise by the chef, met the captain, had an amazing & hot turkey dinner. . .vegetarians would have been pleased by the meal. The banjo band asked for requests from each person at the tables & knew songs from the 40's to the present. . .they were unbelievable!  The captain shared a history of the boat and company. ..very interesting and humorous.  The cruise was multi-generational . . .a great way to spend the afternoon.  Would recommend this to anyone wanting to kick back, relax & enjoy the river.",
  "Their fall cruises are a must!  So beautiful on the Michigan Princess in Lansing and the Grand Ledge boat during the Island Festival in October are well worth the time and money.",
  "Awesome fun, great prizes, and excellent meal. It was nice they had two separate Halloween cruises, i.e. one for college kids, one for the little bit older graduated folks. ",
  "The captain is a funny guy, telling stories and keeping his patrons happy. An easy cruise up and down the river. We were there for a buffet with a company and it was very good. They have a small bar and I understand some cruises feature live music. Relaxing to sit anywhere on the deck with a drink. I would go for an event for sure.",
  "Wow! What a nice break from the usual afternoon lunch crowd. The lunch was very good and the paddle wheel boat ride short but sweet. The New Orleans band was a great addition.   ",
  "The cruise did provide wonderful views from the top open deck. Cannot see much from the dinner seating area. The boat is dated. Only one bar was open, the lines were long. Food was good, served buffet style. The lines moved well",
  "The boat is badly in need of maintenance. The stairs were very crooked, and in need of painting. Railings all along were showing wear and age. Restrooms were small and not very clean. From afar, its inviting, but not once you are on it. They could spend a little or a lot and bring it up to standards. The cruise was a bit silly going down the river and turning around a couple of times. They had to keep to the time allotted but it seemed forever to go such a short distance to finally dock and get off. Food, eh, about what you would expect from something like this. Will not be going back again. Someone told us we wouldn't be real happy and needless to say, they were correct."
 ]
},{
 "name": "Hawk Island Park",
 "address": "1601 E Cavanaugh Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/79/a8/79/hawk-island-park.jpg",
 "tags": [
  "parks",
  "walking",
  "kids",
  "walk",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d10378995-Reviews-Hawk_Island_Park-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place has a lot going for it.  For the low low price of $3-5, per car, you get access to a nice splash pad and swimming pond/lake and playground in the summer.  In the winter, they have a nice sled hill.  They also have a nice path around the lake and access to the River Trail.\n\nOnly real downsides are that they are a little over the top with rules in the swim area.  The lifeguards force people out of the water way more than any place I've gone.  They also don't allow any flotation devices that haven't been coast guard approved.  We tend to use a little ring for our 10 month old.  Can't use that here.  This makes playing in the water a much more difficult task, as you have to hold your babies.  Not a big deal, until her older brother is wanting assistance.  Obviously, a flotation device is not a sure thing, and we would keep either kid close even in such things, but it's a whole lot more peaceful.\n\nOther than that, they have a lot of broken devices on the splash pad.  It's really kind of sad.  Some don't have the water pressure they need.  Not sure what the issues are.  ",
  "The locals' reviews of this place are a little overblown. This is a nice county park in Ingham (Lansing) that has some amenities that go above and beyond other parks. It has a splash park in the summer and a snow hill for the winter, which are certainly cool -- but 4 or 5 stars for a county park? Let's calm down people. \n\nYou have to pay to get in, which is a minimal fee and cheaper for county residents. There's a nice enough lake with some wooded trails that connect with the city's larger trail network and there are some picnic areas as well. \n\nThe kid's playground is OK -- but the main problem I had is how it's designed. It is hard to watch your kid or to easily \"grab\" your kid if they are in a precarious position (obviously this has more to do with the toddler or little kid section). Other parks around the city or county don't have this problem.\n\nI enjoy Hawk Island. I've been there a couple times and I'm sure I'll be back, but with so many glowing reviews, I think it's important to remind everyone that this is a modest county park with some appealing amenities -- but nothing more.",
  "Love this park! Will purposely pack the car to stay for a few hours. I like to get there just before lunch so there's time to work up an appetite for the kids. With the splash pad, the beach, the playground....there's plenty to keep kiddos busy. Lots of areas for sunshine so bring sunscreen. There's a wooden walkway that you could fish from, a long path around the lake for walking or running, boats for rent, pavilions and a dog park. Small fee for entry or get a pass. ",
  "The snow tubing setup is really great. Nice professional people. Had a long wait time though. Snacks and hot coffee available.",
  "Hawk Island Park is an Ingham County Park located within the city of Lansing. It has a nice small lake, sledding hill, picnic tables, pavilions, and play ground equipment. It is well maintained. There is a small entrance fee.",
  "June 29th 2019. We thought to surprise my sister and bring her to Hawk Island for her birthday. All of us were excited to visit this place as pictures never seem to measure up. So, we drove out of my hometown, to this place. Paid at the gate to get in...which we knew ahead of time that we had to...no problem there. We asked at the gate where to go for handicap parking as myself and my mother are both handicapped and cannot walk a great distance. We were given vague directions. We then spent 30 minutes just to find the parking spots for the handicapped. Only to find numerous vehicles without the proper handicap plates or placards all parked illegally, and yet no one to monitor it to be sure they had the proper parking permissions. \nNot only that, the handicapped parking was quite a distance from the beach. My mother and I would have never been able to enjoy the beach, which is why we were even there in the first place. We ended up leaving without doing anything. Never even got out of our van. And while not expensive to pay to get through the gates, it was still a loss of money that many of us don't have to splurge with.\nAs we were leaving, two vehicles parked, nearly blocking the exit at the gatehouse. We had to creep around and partially into the grass because they had parked there. Owners of the vehicles were right there talking. Both seen we were trying to leave, never bothered to get in their own vehicles to move them. They then made their way down to the beach leaving their vehicles parked there instead of in a proper parking spot. Despite our excitement of all the possibilities of things to do at Hawk Island, we will NEVER return unless something changes and Handicapped parking is moved closer to the beach, as is monitored to be sure visitors have the proper plates or placard to park in the handicapped parking.\nI personally would NOT recommend this place for any who are disabled. It is NOT handicapped accessible!",
  "The park has activities for all seasons. \n\nIn the winter-\nThe sledding hill has a lift to take participants to the top and tube down. Trails suitable for cross country skiing or just hiking abound.\n\nIn the spring and fall-\nLovely walks through the woods are well marked and many are paved. They connect with the Lansing River Walk Trail and also connect to MSU. Wildflowers in the spring and bountiful colors in the fall.\n\nIn the summer-\nThere are numerous picnic and play areas for children. There is a splash pad with clean water spaying out of numerous toys. A great place to interact with smaller children or let older children play while parents can relax in the sun. There is a swimming area and a small beach. \n\nThere is limited fishing and boat rentals to paddle around the small lake.",
  "This is such a nice park for kids in the summer.  The splash pad is perfect for the hot summer months.  I have attended several birthday parties with my daughters here, and everyone has a great time.  Bathrooms are generally clean and accessible"
 ]
},{
 "name": "Cooley Law School Stadium",
 "address": "505 E Michigan Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/fd/1b/78/ball-field-view-from.jpg",
 "tags": [
  "food",
  "drink",
  "kids",
  "walk",
  "field",
  "food",
  "kids",
  "creative",
  "food",
  "cheap",
  "free",
  "walk",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d3443187-Reviews-Cooley_Law_School_Stadium-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nice stadium, lots of good seating...but stay away from 1st base line from any afternoon/early evening game....outfield (grass) or 3rd baseline (seats) are best, food is expensive. Decent gift shop.",
  "Great Place!!  Very ADA friendly!!  Great nightly specials!!  Close to steakhouse, bar, and downtown!!  Bus stop available.  Great Venue for a game.  However the outfield seating is grass so take your own seat.  The stands are behind 3rd to Home to 1st!!",
  "great beer specials on Thursday.Always fun to drink and watch the game ..and maybe a few drunks..probably the day not to bring the kids",
  "We recently took our sons here for their first ever baseball game at a park. It's no Wriggle Field, but it was nice. We went for Harry Potter Night, which might have been a mistake as they over sold tickets and had standing room only tickets. It was was too packed. Of course because it was a special night they opened gates earlier than normal which means even though I bought our tickets in advance, our kids did not receive the giveaway because they oversold tickets which was disappointing. We had great weather, nice people next to us, but the food was overpriced and lines way to long. Bathrooms were clean and over all it was a nice experience. Might go back on a none themed night when they aren't trying to rake in the dough though. Also arrive early to find good parking which will cost you $5 and up depending on where you can find parking. Also be prepared to walk a bit to get there.",
  "I try to go on Thur for the discounted beer.  Its always a good time.  Clean, and never had a bad seat.",
  "Attended my very first baseball game and loved it! Lots of fun. Restrooms were clean and lots of vendors to get food/drinks from.",
  "This ballpark in Downtown Lansing, formerly known as Oldsmobile Park, is a very nice place to take in a game.  While there are not really many distinguishing features that separate it from other Single-A baseball stadiums, I’ve been coming here for 15 years and have found the quality of the experience to have been consistent and even improved over the years. The stadium is in excellent condition and the new wrap-around concourse with outfield picnic and beverage features has really brought this stadium into comparable status to its newer-built counterparts.  The food quality and selection has always been terrific.  There are probably more creatively themed events here than at other stadiums.  There are just as many, if not more, “pop-up” concourse attractions.  My favorite is Plinko, where you can purchase some disks and wherever it falls you receive a prize – either free food or Lugnuts swag.  Although there is no designated “official” parking lot, parking is still easy and cheap (even free if  you know where to go).  The stadium is also located near popular restaurants and bars for pre or post game fun.  Lastly, the Lugnuts have a creative and catchy “go nuts” theme song that will probably stick in your head for about a week after the game ends.  I think more minor league teams, in general, need theme songs.",
  "And you just gotta love a team named the Lug Nuts.\n\nAnd a very well done minor league park.  Not too big, not too small.  Enough food choices to keep everyone happy, not only in the stadium concourse but past the outfield as well.  More than enough seats in the stadium as well as grassy areas in the outfield.  Lots of activities for the kids and entertainment between innings.  Lot of camp groups were very well behaved.\n\nNot enough on site parking, but enough surrounding the stadium even if you have to walk a few short blocks.\n\nFun for the baseball lover as well as those non-fans.  A nice way to spend he afternoon and `GO LUG NUTS!'"
 ]
},{
 "name": "River Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/9d/68/c6/river-trail.jpg",
 "tags": [
  "walking",
  "family",
  "parks",
  "walk",
  "walk",
  "unique",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282096-Reviews-River_Trail-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "I bike the  trail all summer long. It's an incredible thing we have here in the Lansing area. It's a super easy way to get from downtown Lansing to campus which is a perk if you don't have a car! ",
  "Great for biking, rollerblading and walking.  Our family uses River Trail all the time.  It is also a good route to get to area parks without using your car.",
  "Have been many times on the trail. There are times it gets a little crowded in areas to bike ride, but most of the time fine to bike, run or walk. They are adding to the south. Can ride from MSU to Turner house and back for about 11 mi.",
  "This is a nice trail, paved an unpaved along the river. You feel like you’re in the country even though you are right in the city.  I only do tractor was that trash cans are overflowing at one point. ",
  "I check this out , I toke a walk down trail nice and clean .A lot things see down the trail and park in area to go to.",
  "Landscape Architects & Planners, Inc., and Matrix Engineering worked together to create the downtown design along the east bank of the Grand River in front of the City Maket between the Lansing Center and Shiawassee Street Bridge, sponsored by the Lansing Rotary Club and many other corporate and individual donors,  We are proud to have been part of this experience and welcome your comments info@lapinc.net. As the architects of record, we invite you to share this experience during the day, but especially during the evening, where the light show is meant to be a specail suprise for people who are not accustum to a \"Lighted Forest\", \"Grand Staircae\", Fireplace, Rotary Plaza\", \"The HUB\" Happening under the bridge and the light display that happens every night. Join in the fun and come downtown Lansing in the evening to be emersed in a unique public expereince.",
  "The River Trail takes a lovely route along the river through parks, woodlands and along urban trails. The area just east of the zoo has had some much needed repairs to the bridge. Additionally, much of the area south of downtown has been re-paved, although the area near the market is all torn up so you need to follow detours to get to Old Town. Be patient!",
  "I was in Lansing for a conference and getting out on the River Trail every morning for a run was a great way to start my day before sitting down all day. I had fun getting off the trail and exploring the side streets but always managed to come back to  the trail and admire the river and murals along the way."
 ]
},{
 "name": "Old Town",
 "address": "201 E Grand River Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/3e/dd/ef/old-town.jpg",
 "tags": [
  "unique",
  "art",
  "eat",
  "walk",
  "food",
  "unique",
  "pets",
  "food",
  "art",
  "walk",
  "drink",
  "art",
  "unique",
  "pets"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282396-Reviews-Old_Town-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Old town has unique shops and restaurants and galleries and is a wonderful way to spend a low-key afternoon.  Cravings has wonderful popcorn, Pablos is a wonderful lunch spot, and Meat is great for dinner (after waiting in line a while).  The shops contain beautiful and unique finds with shop owners who are willing to speak to you about their store.",
  "Everything you see in Old Town Lansing is new again.  The galleries, the quaint shoppers, the restaurants...what a wonderful treat.  The annual blues festival is a must do as is the October fest event...plan on spending half a day.   Breakfast at the Old Town Diner, lunch at Pablo's ( or Meat) if you do not Mex...\nArt galleries etc.  Great time in Old Town.",
  "A short walk down the old railroad tracks, or a walk, jog or bike ride down the River Trail will bring you to old town.\n\nWhile in old town there are many small and unique shops to check out, and some great places to eat!\n\nThe best Thai food in Lansing can be found in Old Town....don't miss that if you enjoy Thai.",
  "Old Town is a collection of bars, restaurants and specialty shops on the north side of Lansing just south and east of the airport centered at the intersection of Caesar Chavez and Turner street. Some of the best restaurants in Lansing are located here. The specialty store seem a little forced but hey if they can make a buck more power to them. The whole Old Town area is clean, safe, well maintained, well lit at night and has a really fun atmosphere. I like window shopping at Elderly Instruments and visiting Breinke fish ladder. Dining at Sir Pizza and looking out the window at the river flowing by is an incredibly refreshing and relaxing experience. Preuss Pets pet store is filled with exotic animals and fish. The stores decorations are worth a visit alone. The staff is wonderful as are the customers. Golden Harvest Restaurant on the north end serves the finest breakfast food on the planet. Olympic Broil just up the road will sell you a burger and fries that you will remember for many hours. Cross the bridge going north on Larch Street and Old Town disappears in about a hundred feet. It is like an alternate universe that you need to seek out to find and even notice. Once you discover Old Town and its charm you will return often.",
  "Park anywhere in the area, get out and just walk. Take time to visit the art and the small shops. Grab a drink or dinner/lunch and just relax for a few hours. There's a little something for everyone in the Old Town area.",
  "There are so many really nice shops to meander thru in Old Town. Love the vintage feel that the district offers.",
  "The original depot, the barber's, the pharmacy, the market, Freddie's donuts.   .   .the storefronts may be gone but really the names have simply been changed.   The key is that there are not chain stores here - only unique ones.   Whether you're looking for vintage clothing, a unique hairstyle, rare and healthy pets, art works of all kinds, interesting foods, Old Town is the place to visit.   Grab some popcorn, check out the fish ladder.   There's something for absolutely every age and interest.",
  "We had time to kill after checking out of our Lansing Hotel and before heading to Saugatuck, our final destination.\n\nSo found this area listed on TripAdvisor and decided to check it out.  At 10am, no one on the streets.  Didn't look like the stores were open yet and even if they were, they did not sound by Name or appearance to be anything of interest to us.\n\nSo we drove by without even stopping."
 ]
},{
 "name": "Turner-Dodge House & Heritage Center",
 "address": "100 E North St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/11/d0/f6/turner-dodge-house-heritage.jpg",
 "tags": [
  "learn",
  "history",
  "historic",
  "music",
  "knowledgeable",
  "learn",
  "tour",
  "history",
  "learn",
  "history",
  "family",
  "history",
  "walking",
  "historic",
  "family",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282156-Reviews-Turner_Dodge_House_Heritage_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "For the last two years I've taken my mom to see the Festival of Trees and she's thoroughly enjoyed it both times. This place is a treasure any time of year and you can learn its history. This is a great outing for a work team or a friendship or faith group.\n",
  "Very well preserved historical mansion...loved the decor and the preservation of the time period.  Definitely worth seeing.  If I lived in the area would definitely consider hosting an event there!",
  "If you like antiques and historic decor, this place is very well done. Very well maintained. You can catch an occasional music event here as well for an intimate concert. ",
  "I've taken 2 girl scout troops to the Turner-Dodge house on two different occasions.  The curator was quite knowledgeable and gave the girls age appropriate information.  They got to tour the house and learn about some of the items in the home.  Both visits were well done.  My last visit was during a festival and it was very crowded.  If you want to see the house and learn about its history, I would suggest calling and scheduling a time. ",
  "For the last two years I've taken my mom to see the Festival of Trees and she's thoroughly enjoyed it both times. This place is a treasure any time of year and you can learn its history. This is a great outing for a work team or a friendship or faith group.\n",
  "Situated on the Grand River, this historically preserved home is more than a museum.  Hosting several interactive events for children throughout the year it is also an events venue.  The grounds also make great photo ops in the spring and summer when the flowers are in bloom. A great place to visit with family or friends.",
  "The Turner-Dodge house is interesting and it’s a nice thing for Lansing to continue to maintain.  I think they do well with it, but I’ve been to quite a few old houses and the Turner-Dodge experience seems to be lacking that “extra” factor that would make an attraction like this into a must-visit or repeat visit destination.  Other historical houses have better tours led by a docent or other historian which go into depth regarding the history of the house and the area. The groundskeepers have done nothing special with the property. There is an overall lack of educational signage. Some areas of the house are completely off limits (which is not unheard of with historical homes, but it seems worse here). I don’t believe they have any historical/educational videos to watch. The ballroom is just an empty . . . room. The house sometimes seems cluttered with non-historical items. The special events at Turner-Dodge are nice, but limited in scope. Also, it's located right on the river and I'm pretty sure a group of homeless people sleep on the riverbank below the house. If you live in the Lansing area, you should visit this place at least once, but it doesn’t really warrant a return visit.  If you’re visiting Lansing for a weekend, I would not prioritize this as an activity. There are other things to do. I don’t intend to be overly critical, but I think more could be done to make this a special attraction.",
  "This is a beautiful, historic home in Lansing located in a pretty park setting on the river.  The home was added onto in the early 1900’s by one of the family members.  It is now used for weddings, meetings and other functions, which is kind of the problem I had with it.  Only four rooms had period furnishings—the boys’ bedroom, girls’ bedroom, guest bedroom and music room—and I’m not sure even those rooms contained many furnishings belonging to the family.  Most of the rooms had been altered to accommodate the functions that are held at the home and there is a lot of stuff all over the place—card tables and chairs, meeting chairs, holiday decorations, etc.  I get that a historic home has to get its funding from somewhere, so I don’t take issue with that.  But maybe clean it up between functions?  Buy a storage locker to store decorations and meeting chairs and tables?  Store the holiday decorations in one room and close that room off?  I’m a neatnik and felt like I was walking around a friend’s messy house, which distracted me from really appreciating the home."
 ]
},{
 "name": "Carl G. Fenner Nature Center",
 "address": "2020 E Mount Hope Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/5a/a8/fa/carl-g-fenner-nature.jpg",
 "tags": [
  "nature",
  "walk",
  "learn",
  "nature",
  "knowledgeable",
  "learn",
  "kids",
  "knowledgeable",
  "learn",
  "kids",
  "walk",
  "field",
  "family",
  "nature",
  "walk",
  "family",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d3871068-Reviews-Carl_G_Fenner_Nature_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fenner Nature Center offers the chance to get away from the city while still being in the city.  It has a trail system that traverses woods and meadows, with several small ponds brimming with aquatic life.  Hiking the trails, observing  the flocks of wild turkeys and the numerous deer, one could scarcely sense that it is only 2 miles to the center of Lansing.  The center also offers many programs and events, including an annual maple syrup festival.  ",
  "The Carl G. Fenner Nature Center is located off E. Mount Hope Ave. just east of Aurilleus Road on the south side of Mount Hope. They have several different trails that go through wooded areas, open fields and ponds. They also have a building with a nice nature displays and a small gift shop. They run a number of different programs from children. \n\nThis is a wonderful place to walk and enjoy nature or to take children for a fun experience to learn and appreciate the great outdoors and all that it holds.",
  "I have attended more birthday parties with my daughter at this place than I would care to admit.  The kids always have an amazing time - and seem to learn a lot.  The staff are knowledgeable and kind.  They are excellent with children, and I would highly recommend this establishment for parties in the future - particularly for children < 10 years old",
  "I have attended more birthday parties with my daughter at this place than I would care to admit.  The kids always have an amazing time - and seem to learn a lot.  The staff are knowledgeable and kind.  They are excellent with children, and I would highly recommend this establishment for parties in the future - particularly for children < 10 years old",
  "We had a lovely visit today - the sun was shining, the air was crisp and the trees were starting to turn their colors. The Apple Butter Festival was in full swing and the place wasn't too crowded - lots of room to move around and enjoy the festivities. The staff were very friendly and helpful.",
  "I love this Center for many reasons. Besides being a treasure in our city. It's a little slice of a Woods in the middle of the city. They also have an Apple Butter Festival. Which I love. Hey have docents there that when I bring my students on a field trip they have many activities to help each age level. The Apple Butter Festival is for family and individuals. Which is a must-do. I also love the maple syrup Festival. You must come and walk amongst the trees. Go to the observation room and look at the birds being fed with all of the different bird feeders. See the lovely bees buzzing and an actual window into the hive is quite an attraction for young and old. They also have feathers and different species to show to the visitors.",
  "Unfortunately i'm only able to review for the center's main building and store. We were in the area and saw in the guide book they had a gift store. I'm always on the look out for minerals and other nature items. So we decided to step in, there was no one in the store and we waited a good five to ten minutes because i wanted to purchase a Night Star laminated guide. I ended up having to actually go looking for someone to ring me up in the store, found a girl in the basement area who directed me to the outside where others were taking down a tent. I know it's good to try to get everything taken care of when they have the volunteers but there should have been at least 1 person minding the store. Someone could have easily walked off with something or others could get fed up with waiting and just leave. If it hadn't been the only place i'd seen that Night Star laminated star chart i would have said forget it and left. The profits i'm sure goes to the nature center so i would think they'd want to make sure someone was watching the store so that people can purchase items without having to go looking for someone to ring them up.  I'm sure the rest of the center is great and the nature trails beautiful but we didn't have the time required to visit them. We are still thinking about possibly going back to visit the nature trails.",
  "My family and I have visited the Fenner  Nature Center many times over the last decades.  There is a museum of natural photos and animal fur and bones  to touch.  There are trails to walk and a couple bodies of water.  It's great for family or solo visits."
 ]
},{
 "name": "Mega Mall",
 "address": "15487 S US Highway 27",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/a0/8e/a5/mega-mall-lansing-mi.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d8464076-Reviews-Mega_Mall-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "We antique all over the country, so when we traveled through Michigan this was on our route.  Certainly was hyped more than we thought of it.  Prices way out of range for what we have seen similar all over the country.  Do not think we will make a stop again here.",
  "This is a great flea market / antique mall. We have been coming back for years and years, and there is always something for everybody! Antiques, collectibles, vintage clothing and jewelry, some furniture, home decor and more. The building is huge, with rows and rows of booths; we have been know to spend all day here because there is so much to see! Pricing is set by the vendors, so some booths are higher than others, but most are offering fair pricing and many offer discounts from 10-50% off. Staff members are milling about, always willing to unlock a cabinet or carry your purchases to the front until you're ready to check out.\n\nThey have carts available, and there is a small lounge area to take a break, with snacks for purchase. I prefer to visit during the week, because it is much busier and crowded on weekends. In the summer and fall months, they hold an outdoor flea market on Sundays.",
  "Large, lots to look at, bring extra legs and wallet, staff friendly, need more chairs for hubbies to sit on",
  "This is a nice antique mall.  Very large, takes about 3 hours or more to get through.  A large selection of items for everyone.  The first few aisles are all locked cabinets, but someone is available to unlock so you can look at an item.  Lots of collectibles, matchbox cars, glass ware.  My friend and I didn't get through the whole mall.  I don't know if someone sprayed perfume or bad air freshener in the back of the store, it was so strong I couldn't go back to the rear area of the store.  But otherwise, it was a nice store.",
  "A huge place, the Mega Mall is filled with a wide variety of vintage, used, and craft items. Also to be found are a large amount of \"collectibles\" such as Hallmark items, Star Wars figures, and NASCAR stuff. In short, you will find lots to browse through here, regardless of what you fancy. Unfortunately, almost all of the merchandise is overpriced, in some cases absurdly so. A large contingent of vendors seem to adhere to the \"it's-old-so-it-must-be-worth-a-lot\" school of pricing, without taking into account such things as condition, rarity (or lack thereof), and desirability. Some vendors have taken to posting printouts from ebay showing high-bid auctions of similar items, presumably to defend their pricing. It's just silly, and shows a lack of knowledge on the part of the vendors.  And yet, this place HAS stayed open for over 20 years now, so they MUST have something. But whatever it is, I couldn't find it. Your mileage may vary..."
 ]
},{
 "name": "Lansing Center",
 "address": "333 E Michigan Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/bb/c4/57/lansing-center-lansing.jpg",
 "tags": [
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d1419468-Reviews-Lansing_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "1300 happy stampers enjoyed Lansing  Center. Great acoustics and ability to  see and hear all over the big room with the help of multiple large screens.",
  "The Lansing Center was a great place for a conference. The staff that set up meals and snacks for attendees were professional and pleasant. The walkway from LC to the hotel across the river was a bonus as it was a cold week! ",
  "Very nice facilities, with all that goes with it. The cafe is good, the hot dogs are GREAT. They are 100 % beaf and the best you will ever have.",
  "I am here two to three time a year the Martin Luther King Luncheon is held here a year, The Lansing Area Sports Hall of Fame is held here also this year my Husband Football Team was Honor great place. Lot of history Thur out.",
  "I go here to attend youth wrestling and the seating as the best ever this time. We used to have to take in folding chairs but now that they are no longer allowed they have provided more of their own. Staff is always helpful and friendly."
 ]
},{
 "name": "Moores Park",
 "address": "420 Moores River Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/85/b0/11/mi-lansing-moores-park.jpg",
 "tags": [
  "field",
  "kids",
  "field",
  "kids",
  "kids",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d12826990-Reviews-Moores_Park-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Moore Park is a nice park along the river. It has a soccer field, tennis courts, places to fish in the river, playground equipment and a public pool. There are restroom facilities also.",
  "great park in Lansing for years to fish at the Dam..lots of space all over for picnics and such..many local activities also..A great pool that the kids and adults will enjoy",
  "Such a GREAT park with offerings for anyone -- fishing, swimming, public restrooms, jungle gyms, swings, etc. It's a large park with very well kept grounds. One of my favorites for sure! ",
  "The favorite was the amazing water park complete with a giant chute style slide and lots of other water features in the pool area. Hours of fun on a hot day. We also saw lots of sports field available as well as good picnic spaces. We even saw a giant sled hill for the winter. Great place to give the kids some exercise!",
  "great park in Lansing for years to fish at the Dam..lots of space all over for picnics and such..many local activities also..A great pool that the kids and adults will enjoy",
  "Moore Park is a nice park along the river. It has a soccer field, tennis courts, places to fish in the river, playground equipment and a public pool. There are restroom facilities also."
 ]
},{
 "name": "Brenke Fish Ladder",
 "address": "Lansing River Trail",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/18/71/49/brenke-fish-ladder.jpg",
 "tags": [
  "walk",
  "walk",
  "nature",
  "wander",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d10799307-Reviews-Brenke_Fish_Ladder-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "I'm from a dry part of the country where salmon have no chance, so it was gratifying to see that in Michigan fish get their own marvel of civil engineering. This is the second fish ladder I've seen on the Grand River (the other was in Grand Rapids). You can get to it from the RIver Walk trail, which is another great outdoor feature of downtown Lansing.",
  "I had never seen a fish ladder before.  Very interesting to see how it works.  Right next to old town where good restaurants can be found.  Nice park attached.  Definitely good for a walk after dinner.",
  "We visited Old Town to see what it was all about and came across the fish ladder. The park like area is a great place to sit and people watch and take in the nature views. The water wasn’t flowing around the ladder but it was neat to figure out how it works. There were people fishing in the river and we did see a few small ones brought in. Typical river smells but a good break from the busy life. Enjoy",
  "This is really a beautiful piece of architectur/engineering. It is flanked by a \"waterfall\" (spillway) formed by the substantial Grand River. Right on the edge of Old Town. Park in the lot next to the ladder, check out the place, then wander around the coolest spot in Lansing... OLD TOWN!",
  "Interesting they built a number of fish ladders along the river to help with trout and salmon migrating to reproduce. Right next to Old Town and the parking is free."
 ]
},{
 "name": "Granger Meadows Park",
 "address": "16980 Wood Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/4c/2c/95/mi-lansing-granger-meadow.jpg",
 "tags": [
  "walk",
  "field",
  "nature",
  "walk",
  "nature",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d10296185-Reviews-Granger_Meadows_Park-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very nice park with plenty of walking/biking trials. It has a rink a pond a sledding hill a ball field among other things to do summer and winter. Bugs can be rough at times. Walk through woods or along the roads and see some nice nature views. Enjoy!! ",
  "We enjoy the paved trails with our roller blades. It was quiet and a very well groomed park. We never found it to be extremely crowded and the other users were always very courteous. It's nice for picnics or other gatherings. Use it to enjoy the out of doors.",
  "This neighborhood park is a gift in many ways - a negotiated gift from Granger Waste Management and a gift to the township in all that it has to offer....brick and mortar well-kept bathrooms, safe and varied playground, sledding hill, cleared walkways, nature walk, koi pond, pavilions, basketball court.  We have it ALL in our neighborhood!!",
  "Been driving by here for years and never drove in but it was time. A good sized park if you drive around or walk. It was winter time so there was action on the hill so we sat and watched the action. Now there’s more to see but we didn’t last long this time and will go back for a good walk during the warmer part of the year. Enjoy",
  "What ya wanna do, baseball,  soccer,  football,  walk with you're dog, stroll a path throughout the park,. Have a picnic, dip a line in the fishing pond.  Something for any outdoor activities.  Enjoy! "
 ]
},{
 "name": "Reo Town",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/9e/48/79/mi-lansing-reo-town.jpg",
 "tags": [
  "eat",
  "walk",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d10312299-Reviews-Reo_Town-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Just like old town, you can park and walk around, see some shops and grab a bite to eat. The area had been a little run down in the past but it is being revitalized by the locals. ",
  "This is such an up and coming area. More business are moving in. Plenty of places to eat inside or cafe style out side. The artistic vibe is fantastic. Board of water and light even has beautiful architectural work that fits into the theme on their new building.",
  "It's been a real joy to watch this neighborhood rebound.  Interesting shops and eateries.  Conveniently located just south of downtown Lansing",
  "This is an up and coming part of Lansing. Already there are eateries, coffee shop and bars that will put a smile on your face. Worth exploring. ",
  "Reo Town is always fun to visit. Lots of good choices for food, and more coming. Parking is easy. Fun bars, with more on the way. Still lots of vacant spaces, just waiting for an entrepreneur with a vision to add something new to the mix."
 ]
},{
 "name": "Woldumar Nature Center",
 "address": "5739 Old Lansing Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/6d/e3/20/photo5jpg.jpg",
 "tags": [
  "walk",
  "field",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d3804320-Reviews-Woldumar_Nature_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Woldumar Nature Center is tucked just out of the way enough on the southwest side Lansing to feel like you are out of the city. They have nice, well kept trails and is a good place to go for a walk. They even have an area for outside weddings. Woldumar has e a great staff who loves nature and keeping the place looking good. It is also a great place for an elementary field trip.",
  "These are some of the best trails in the area.  Bring your dog, but please keep it on a leash!  Don't ruin the ability to have leashed dogs here for the rest of us!",
  "I love Woldumar! I've been here a handful of times during a month-long stay in Lansing for work and this was the perfect way to stretch my legs and wind down my day.  Even on the nicest summer days you won't run into many other people, the parking lot isn't crowded and those you do see are friendly and usually accompanied by adorable puppies! :)",
  "Beautiful, natural venue for an outdoor wedding.  Trees shaded the area and a nice breeze kept a hot day very pleasant.  So, the placement was perfect.  After the wedding ceremony, we went upstairs of the barn for the reception.  The balconies overlooking the grounds were perfect.  Lights everywhere inside were like stars.  Perfect evening.",
  "The barn and surrounding grounds are lovely, great for hiking or just relaxing yet close to town, hotels, and highways."
 ]
},{
 "name": "MichiGrain Distillery",
 "address": "523 E Shiawassee St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/fc/f2/be/building-front.jpg",
 "tags": [
  "unique",
  "drink",
  "drink",
  "unique",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d15196578-Reviews-MichiGrain_Distillery-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "My experience at Michigrain was nothing short of memorable. Whether you’re sipping on the liquor alone or enjoying one of the superb cocktails, Michigrain will not disappoint. The decently sized menu has some great options for all to enjoy. The unique concoctions of some of the cocktails will keep you coming back to try something new. I also wanted to add that the cozy atmosphere with the fireplace and couches make it extra inviting.",
  "Stopped in here with my 23 year old to enjoy a drink before going for dinner. We ended up hanging out here for a while playing some of the games out for customers and sipping on some Michigan themed vodka libations. The owner was very friendly and was barside mixing up a new recipe for us to sample.\n\nA great spot for a night out with friends or for a date. One of Lansing's gems!",
  "We came into town for dinner across the street, saw the open sign so we decide to check it.  Soooooo glad we did.  Great staff, AMAZING drinks, fun atmosphere.  I've tried all the distilleries in the area, this is by far my Favorite!!!!   Wish I lived closer!",
  "Stopped in here with my 23 year old to enjoy a drink before going for dinner. We ended up hanging out here for a while playing some of the games out for customers and sipping on some Michigan themed vodka libations. The owner was very friendly and was barside mixing up a new recipe for us to sample.\n\nA great spot for a night out with friends or for a date. One of Lansing's gems!",
  "We came to the distillery for a terpenes seminar. The meeting room was upstairs and accommodated the group well. Once the seminar was over we went down to the bar and socialized with everyone, the drinks were great and the small tapas plates were good. They had a nice fire going and it was really comfortable to hang out. Great service. \nIf you're in Lansing stop in and try the lavender infused vodka that they make. \nGreat find in the heart of Lansing! ",
  "We came into town for dinner across the street, saw the open sign so we decide to check it.  Soooooo glad we did.  Great staff, AMAZING drinks, fun atmosphere.  I've tried all the distilleries in the area, this is by far my Favorite!!!!   Wish I lived closer!",
  "My experience at Michigrain was nothing short of memorable. Whether you’re sipping on the liquor alone or enjoying one of the superb cocktails, Michigrain will not disappoint. The decently sized menu has some great options for all to enjoy. The unique concoctions of some of the cocktails will keep you coming back to try something new. I also wanted to add that the cozy atmosphere with the fireplace and couches make it extra inviting.",
  "We really enjoyed our visit to Michigrain. It is very unique, with their own custom crafted cocktails made with spirits produced right there (with 100% Michigan based products). It has a nice, cozy atmosphere with friendly, attentive staff. I wish we lived closer to visit more often."
 ]
},{
 "name": "The Creole Gallery",
 "address": "1218 Turner St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/3c/c3/b7/the-creole-gallery.jpg",
 "tags": [
  "food",
  "food",
  "drink",
  "food",
  "food",
  "delicious",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282147-Reviews-The_Creole_Gallery-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Food is great.  The vegetables dishes are amazing.  The selection of French wine is the best in the area for sure.  If you want a table on the weekend make sure you get a reservation.",
  "I crave a filet mignon often, but I order one only every five years. Luckily, I was at the Creole when the time came. The five-ounce is a perfect size, medium-rare, done just right. The onion soup is an ideal prelude. Companions enjoyed duck and pasta with vegetables. Our waitress was very attentive and helpful. The wine was fulfilling. To really savor the whole meal, maybe consider bringing a cushion for the hard wooden seats. The weeknight atmosphere lent itself to good conversation.",
  "I crave a filet mignon often, but I order one only every five years. Luckily, I was at the Creole when the time came. The five-ounce is a perfect size, medium-rare, done just right. The onion soup is an ideal prelude. Companions enjoyed duck and pasta with vegetables. Our waitress was very attentive and helpful. The wine was fulfilling. To really savor the whole meal, maybe consider bringing a cushion for the hard wooden seats. The weeknight atmosphere lent itself to good conversation.",
  "This is the second visit to this establishment.  Loved it both times.  I am particularly addicted to the Shrimp and Grits.  My husband tries different things and all have been wonderful.  Service both times was pretty slow and waitresses were rather overworked/inattentive, but worth it because we love the food.",
  "We visited with friends who also had previously enjoyed Creole Gallery.   We were disappointed that it basically has turned into another burger joint that's gone \"uptown\" in prices and alcohol offerings but otherwise 'downtown.'  A disappointment since it previously had provided a niche no one else had previously filled.",
  "the food was good and it came faster than I thought and ready for I only had a sip of my drink and the decor is avantgarde",
  "Hard to select one item from the menu. Food was multilayered in both tastes and textures.  Space is charming and comfortable.  Ate at the bar to save time but ended up lingering over good coffee. Will definitely return to try other entrees and sample from the large wall of spirits..",
  "...hhmm let me think, a good reason to go to The Creole....Got it! Because its today! Place is cozy, good for dates, good for families, good for friends. Staff is smart and you are actually waited on. Staff explains, recommends, listens and encourages gently. Portions are fair, food is lick-your-plate-you-missed-that delicious. On the menu what sounds like a hearty portion *is*, what doesn't, isn't. All servings come with plenty of time to savor, taste, enjoy, share and speak with your table. Lolly gagging, laughing, enjoying yourselves are all encouraged."
 ]
},{
 "name": "Lansing Mall",
 "address": "5330 W Saginaw Hwy",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/52/40/e5/lansing-mall.jpg",
 "tags": [
  "walk",
  "food",
  "family",
  "free",
  "food",
  "walk",
  "food",
  "food",
  "family",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d6120507-Reviews-Lansing_Mall-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nice little mall, sadly it has a few empty areas.  Parking is convenient and can usually find a place near an entrance. Many mall walkers use this space too.",
  "The interior of this mall is \"Prairie-Style\" design.  Frank Lloyd Wright designed many buildings in his early career in this design style a hundred years ago, of course, no part of this mall was designed by FLW.\n\nIf you visit the restrooms at the food court, you will see a waiting area that has a lot of \"Prairie Style\" elements (see photo).\n\nThis mall is on a single level and is a good walk from one end to the other (many \"mall walkers\" take advantage of this in the cold winter).\n\nSoon, there will be new theaters added to this mall in the Spring of 2014.  Until the theaters open, there is a sitting area with cushy reclining seats where you can watch family movies FOR FREE all day long (see photo).  This area is called \"Pop up theater\".",
  "I grew up a mile away from this mall.  I've been going there +30 years now.  The Lansing mall is a decent enough place, but it's struggled with empty stores and tons of failed businesses.  They have been unable to keep and maintain core businesses to make the mall a place people WANT to go.  For example, the food court is pretty much always empty. I've gone through the mall 5-8pm on a Friday, and seen maybe a dozen people eating.  It's pretty dead.  Paneras and Chipotle often have more people inside them than the entire food court.  They did some reno to add the Regal last year, but that hasn't brought many people.  The new bars seem dead whenever I go near them.  I just can't imagine moving any new businesses into this mall.  As far as the mall itself, it's fairly clean and well kept.  I certainly feel safe.  It's not normal to see many people here, unless it's December.",
  "As a young man, I worked at the mall in the mid 70's when it was bustling with business most every day. Now it's sad to see its demise. Only one anchor store remains and it's reported to be in financial trouble. I counted 37 vacant stores and the remaining stores hardly had any customers. This was on a Friday night too. I'll be really surprised if they remain open after the holidays.",
  "This once bustling gem of a mall is circling the drain. TWO restaurants closed after Veteran's Day. The food court is one small pizza place. It is 90% empty as of 11/22/2019 and no new tenants moving in. Can't blame online shopping. Dozens of people walk it every day for exercise. My first job was there. I haven't been there in two years. It makes me sad.",
  "We always stop by this mall on our way through Lansing.  Last time was 3 years ago.  This time we were surprised and saddened by what we found.  Most of the stores were closed, and the few that were there did not have a lot of stock in them. The winner would have to be TJ Maxx, even they didn't have a lot to offer.  It was 7 o'clock on a Thursday evening and there were just a handful of people in the mall.  I remember when this place was very busy with much to offer, but not now.  I won't be surprised if the next time through town we see this mall closed.  Sorry to see! But I saw a lot of this happening on our road trip through the States.",
  "Everything you could want all in one building,  good food , very clean, and always very helpful lots of stores to choose from",
  "Stopped here for a movie in Regal Cinemas.  They've got it well-decorated, and have family games and activities that I've never seen in malls before, as pictured.  Didn't tour the whole mall, but the part I did see was super nice. "
 ]
},{
 "name": "Mt Hope Cemetery",
 "address": "1709 E Mount Hope Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/a2/3c/1b/mt-hope-cemetery.jpg",
 "tags": [
  "family",
  "history",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d3978214-Reviews-Mt_Hope_Cemetery-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "This Municipal Cemetery contains the remains of many pioneers and leaders of the city of Lansing. \nIt's rolling hills and valleys are remnants of a glacial moraine. There are several microenvironments within the cemetery and there is a plethora of flora and fauna; wildlife includes foxes and eagles.  \nOpened in 1874, this cemetery also includes remains moved over from the city's first cemetery, Oak Park. Monuments and markers range from the very simple to the mausoleum of the R. E. Olds auto pioneer family. There is a Civil War veterans section, which also contains remains from the Spanish-American War, and a Firefighters Memorial section. \nThe new Fratcher Memorial Garden encompasses a columbarium wall, a cremation tower section, a fountain, a gazebo, benches, wandering pathways, and several flower beds.\nMonuments and markers are made from a variety of materials, including sandstone, limestone, marble, granite, and zinc.  Styles range from extremely ornate to very basic. \nMuch of the history of the city of Lansing can be found in the names of those at perpetual rest in this peaceful place.",
  "This beautiful cemetery is set along the river. There are rolling hills and winding drives that calm you as you make your way to visit those who have passed.",
  "I know this might sound strange, but during an event in the city of Lansing - Be A Tourist in Your Town, this cemetery was a stop and had a walking/driving history lesson where you had to go along and stop at different headstones and markers to learn some extremely interesting history about residents of historical Lansing that are laid to rest here...OMG, the thought kinda spooked me when we decided to go and give it a try, but upon leaving, EVERYONE in our group agreed that it was one of the most interesting experiences ever!  As we were heading there, we were making jokes about zombies and raising the dead and upon leaving, all we could say was WOW!  First time for everything...",
  "Great for a stroll. You will get your workout going up and down the winding roads. This cemetery runs alongside of the river trail/ There are some really beautiful markers from days gone by.",
  "My daughter had to a class project in her photography class.  We drove up to Mt. Hope Cemetery and Oh My Goodness... what an experience!..... "
 ]
},{
 "name": "Ralph W. Crego Park",
 "address": "1600 Fidelity Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/34/d9/2a/crego-park-lake-area.jpg",
 "tags": [
  "walk",
  "nature",
  "walk",
  "free",
  "walking",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d7109395-Reviews-Ralph_W_Crego_Park-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "I like this park because it links to a bigger trail system in Lansing.  You can park your car here as opposed to Hawk Island where they charge you.",
  "This heavily wooded, 200 acre park gives the feel of a scenic mountain venue, yet it is located only three miles southeast of the state Capitol building. The gorgeous Fidelity lake is easily accessible by car from Mount Hope Avenue via Fidelity Road and by bicycle or foot from the Lansing River Trail. The lack of motorized boats provides a quiet, peaceful setting to enjoy a picnic, canoe ride, or nature walk.   \n\nThe park 's close proximity to several other outstanding attractions make it a centerpiece of a fun-filled day trip involving the River Trail, which borders the park on the north, Fenner Arboretum, which borders it on the south, and MSU, which is less than half a mile to the east.  \n\nWildlife abounds in the park, with dense populations of deer, turkeys, geese, and fish commonly seen. The handicap-accessible kayak loading station simplifies use of canoes and kayaks. Crego Park's many assets resulted in its being honored with an Outstanding Park Design Award by the Michigan Recreation and Park Association in February, 2015.",
  "Ralph W. Crego Park was closed for several decades. It was reopen in 2014. There is a pretty little lake with access for non-motorized boats. A pier from which you can fish and trail access to the River Walk Trail. A nice place to go and normally not crowded.",
  "This is a small, scenic park with pleasant lake and river trail connection.  Includes kayak launch area, benches, and wooden pier.  Free access, free parking, not crowded, perhaps because activities include fishing, kayaking, and trail walks (with or without a dog).  No grills or picnic tables.  During the summer, trail walkers should bring bug spray.",
  "I went in reluctantly knowing that used to be a toxic waste site. Walking around they made it look nice. Nice way to get to the river. But I'm still in the back of my mind toxic waste site toxic waste sites. What I go again I don't know. Probably not",
  "The few times we have been here, we have never seen more than a dozen people.  Smaller lake with kayak launch area which is really nice.  Nice area for fishing.  More rustic than some of the other city parks, but a great area to use the trail system.  About 3 miles from the zoo.",
  "This area is connected to the river trail and seems so tranquil. There are places to picnic, fish and launch a boat. The lake is small and peaceful.",
  "Crego Park, a relatively new City of Lansing park, has it's own small lake perfect for fishing, canoeing and kayaking.  The water is calm so it's good for beginners.  It has a boat launch and nice walkways, benches and parking lot."
 ]
},{
 "name": "Grand Woods Park",
 "address": "4500 W Willow Hwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/7f/9a/92/grand-woods-park.jpg",
 "tags": [
  "family",
  "kids",
  "kids",
  "walking",
  "walk",
  "kids",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d8464449-Reviews-Grand_Woods_Park-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have had family reunions here, using the indoor pavilion.  Have been here for an office picnic which included a pizza cart complete with wood burning stove!  They have disc golf and  plenty of toys for the kids to play on too!",
  "quiet park right along the river. perfect for a picnic, romantic date, or even a place to take the kids to play on the playground. ",
  "We attended a barbeque here put on by Edward Jones.  Very nice park and liked the pavilion too.  Nice walking trails and frisby golf too.",
  "I grew up near here, so it was a pretty common place to go.  It's amazing how many people I talk to who have no idea what or where this park is.  They've got a fun disc golf course and some fun trails to walk on.  Lots of picnic tables and grills.  Lots of stuff to keep the kids busy.  Very peaceful so close to the city.",
  "There are mnay things to do here..lately this is a great place to disc golf..owned by the city of lansing for years they would bring kids from the city for daycamp here...fishing,hiking,fields for any type of ball games volley,base,foot,etc mini remot car racing track and other things ..they have good bathrooms and pavillions for you summer family bbq"
 ]
},{
 "name": "Adado Park",
 "address": "300 N Grand Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/da/30/68/adado-park.jpg",
 "tags": [
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d4858571-Reviews-Adado_Park-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place is huge! It has tons of room and the location is great. Right by the river and downtown. Lots of Festivals here. Definitely a great asset to Lansing.",
  "I used to attend powwow here every June, and have attended many of the Common Ground concerts here over the years.  As a student at LCC, and just living in the city, I've spend much time sitting by the bank of this river.  I have my favorite spot.  It can be very peaceful here.",
  "A music show befor the firework of the 4th of July. A nice fenomena to see all the people coming prior to fireworkd to listen to light music. ",
  "Lansings main downtown park for all big events from concerts and festivals to just hanging out fishing and the such. Lots of green space.",
  "An unremarkable spot, in and of itself. Yet, I must say that the staging of the annual fireworks is a very well planned event. Excellent Police protection, ads well as a genial hometown crowd, make the time spent all the more enjoyable."
 ]
},{
 "name": "Lansing's First Capital Building",
 "address": "South Washington Square near Allegan",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0b/f6/42/lansing-s-first-capital.jpg",
 "tags": [
  "history",
  "history",
  "history",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d4271620-Reviews-Lansing_s_First_Capital_Building-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's just a plaque to read so won't take much time and isn't worth an out of the way visit however if you are visiting the capitol you might as well stop and read about the first one.",
  "The Michigan Capital is a must for lovers of history, architecture and the American Civil War. All of the unit battle flags are on display in the main rotunda, tours are available, and you can even sit in the chambers and listen to the senate and house debate. Of course, they do not say a whole lot.....political commentary over.",
  "The Michigan Capital is a must for lovers of history, architecture and the American Civil War. All of the unit battle flags are on display in the main rotunda, tours are available, and you can even sit in the chambers and listen to the senate and house debate. Of course, they do not say a whole lot.....political commentary over.",
  "Michigan Capitol building and its architecture served as model for dozens of other state capitol buildings  The detail in the plastering, windows, staircases, lighting, arches entries and the dome ceiling are unprecedented.  Imagining the skill the craftsmen had to hand make this all is overwhelming and so impressive. Just designing and hanging the massive light fixtures from the glass ceiling is an engineering feat.",
  "It's just a plaque to read so won't take much time and isn't worth an out of the way visit however if you are visiting the capitol you might as well stop and read about the first one.",
  "The Michigan Capital is a must for lovers of history, architecture and the American Civil War. All of the unit battle flags are on display in the main rotunda, tours are available, and you can even sit in the chambers and listen to the senate and house debate. Of course, they do not say a whole lot.....political commentary over.",
  "The capitol is beautifully built and painted has wonderful, surprising elements and great tour guides.",
  "Found people very pleasant and informative.  Great place to visit and see history and the future coming together "
 ]
},{
 "name": "9-11-2001 Remembrance Memorial",
 "address": "northeast corner of Michigan Ave. and Grand Ave. in Wentworth Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/f2/48/72/memorial-in-park-seen.jpg",
 "tags": [
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d4914822-Reviews-9_11_2001_Remembrance_Memorial-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "This memorial is situated right next to the river opposite the Radisson hotel. It's a small park area with benches. Can get busy as we found out it is also a pokestop where over a hundred people were gathered at night. ",
  "This memorial of the 9-11 attacks is in a great spot for reflecting on the day the world changed.  It is adjacent to a memorial clock tower that reminds us of a tragic day in Lansing's history, the Kern Hotel Fire.   Centrally located in downtown Lansing, its a good place to pause from the rat race and never forget.",
  "The memorial was awesome.  The sound of the water was soothing.  The area was refreshing, nice grass growing, flowers were planted, lots of benches to sit on.  I would definitely suggest you see the museum first to bring you back to the day.  Seeing it all I can't even imagine what happened that day in this city.",
  "This is a place of reflection. Very solemn. Our own little piece of the World Trade Center. Lest we forget.",
  "This monument to what happened on Sept. 11, 2001 in New York City is a true tribute. A twisted piece of \"I\" beam is a reminder as to the tragedy of that sad day. Worth stopping to see.",
  "This memorial of the 9-11 attacks is in a great spot for reflecting on the day the world changed.  It is adjacent to a memorial clock tower that reminds us of a tragic day in Lansing's history, the Kern Hotel Fire.   Centrally located in downtown Lansing, its a good place to pause from the rat race and never forget.",
  "This memorial is situated right next to the river opposite the Radisson hotel. It's a small park area with benches. Can get busy as we found out it is also a pokestop where over a hundred people were gathered at night. ",
  "A poignant remembrance of lives lost is gracefully set along the banks of the river. Every September 11, a ceremony is held here that is touching. People from Michigan who lost their lives are remembered in the bricks.\n\nA site for reflection I've visited many times. Winter is especially pointed, as few are around. "
 ]
},{
 "name": "Eastwood Towne Center",
 "address": "3003 Preyde Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/b9/85/d0/bravo-cucina-italiana.jpg",
 "tags": [
  "food",
  "family",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d10800253-Reviews-Eastwood_Towne_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Outdoor mall that has many world brands like Gap, forever 21 .......  Parking is convenient and very clean.  Not many dining areas available ",
  "We visited the Mall on a Saturday to see what was there and to catch a quick lunch.  Much to our surprise there were only three or four food choices in the large food print development.\n\nIt was surprising that there was even a large vacant restaurant at the South entry to the mall.",
  "This is an open air mall with lots of stores that sell high end goods, Ann Taylor, J Jill, Pottery Barn... They do have some outdoor concerts that are free to attend with some good bands playing. It's a fun time for the family.",
  "Eastwood Towne Center is an open shopping area with a number of buildings. It is fun to visit in nice weather. In rain or winter you park visit the store you are interested and then leave. There is a varity of stores and restaurants. There is also a cinema."
 ]
},{
 "name": "Greater Lansing Visitors Center",
 "address": "500 E Michigan Ave Suite 180",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/a2/59/75/greater-lansing-visitors.jpg",
 "tags": [
  "kids",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g42391-d282397-Reviews-Greater_Lansing_Visitors_Center-Lansing_Ingham_County_Michigan.html",
 "source": "TripAdvisor",
 "reviews": [
  "Helpful people with maps and guides. Advice on things going on in the area and always smiling. Close to the Lugnuts stadium and other things to do. So go in early and plan you day or go in the day before to set up your time in Lansing.",
  "If you landed in Lansing for a meeting and have an evening or better yet weekend to kill, then the Visitor Bureau is the place to stop in at. Very helpful staff and TONS of literature, guides and maps.",
  "A thoical visitor center.  But we’re HUGE fans since they provided a bunch of MI swag for our group who was headed to Poland to teach English.  We bring gifts to give to kids and familes, and we were treated to a bunch of magnets, pencils, etc.  Made for awesome gifts to a number of folks in Poland. ",
  "Decided, what the heck...first time here, lets see what they have.  Got great info on the things I like to do, golf, bike, music.  Siri was a true delight...I really enjoy interacting with people who like what they are doing!",
  "If you need anything about are area this should be your first stop there have maps as well as information for where you and why these area would be a great place to see."
 ]
}]
