[
{
 "name": "Sunken Gardens",
 "address": "27th & Capitol Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/20/e5/e3/sunken-gardens.jpg",
 "tags": [
  "art",
  "free",
  "history",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d2292606-Reviews-Sunken_Gardens-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you want to see what plants will look like when planted; go here and sabre time and money.   Go in later summer so you get a feel for full foliage.   ",
  "Great little space for a larger city, like a badge of honor, but the plethora of annuals is rotated frequently--perhaps after fertilizer loses its grip--to keep the appearance of fresh and vivacious growth and make it new a few times a year. To me, this isn't a garden, it's an art gallery. If you want Nebraska, go to Spring Creek Prairie in Denton 30min southwest. I'm just in to artificial gardens no matter how well-intentioned. It gets QUITE crowded on weekend and lovely afternoons / evenings. Grandparents will love the place.",
  "Lincoln's Sunken Gardens are always worth a visit.  Lovely gardens, water features, and surprising tranquility for a location on major streets.  It's different every year, and different from summer into fall, so it's worth repeat visits.  Occasionally a friend and I will pick up lunch and take it to the Gardens--always the best lunch in town that way.  The Gardens have an interesting history.  The location was a city garbage dump.  A local citizen had a vision for something better, and the Gardens were created.  It's free and there's free parking.  Occasionally used for weddings.",
  "Unusual and attractive botanical and rose gardens in the heart of Lincoln. Great for weddings and photo shoots. Interesting all season, a must see in Lincoln!",
  "One of the most beautiful places in Lincoln in summer and fall. Prepare for a relaxing walk around sunken pools with beautiful flowers. I lived in the neighborhood so I'm a little biased. Great place for pictures or weddings has a gazebo. Little hard to get to.",
  "My mind was blown by all of the beautiful trees; flowers; butterflies, the pond, and the lilypads. The perfect setting for a date. ",
  "Beautiful garden. Every year a new color theme with so many diverse plants.  Love the Koi fish in the old ponds",
  "This public garden is a reclaimed city landfill.  It's located on the edge of the older residential district of Lincoln within walking distance of the Lincoln Children's Zoo.  There are koi ponds with lily-pads, annuals, perinials and water features.  It's a lovely spot to relax on any afternoon."
 ]
},{
 "name": "Museum of American Speed",
 "address": "599 Oak Creek Drive",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/7e/df/14/the-flat-head-display.jpg",
 "tags": [
  "history",
  "history",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d3194206-Reviews-Museum_of_American_Speed-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a comprehensive museum of automobiles from the beginning to today, with great emphasis on racing, engines, carburetors, and many innovative components.  Huge collection of toys, pedal cars, etc. Something for everyone from the history buff to the child.  Displayed beautifully.  Easy to access, and docents will tell you anything you want to know.  Highly recommended.",
  "Wonderfull place to spend a cold winter afternoon looking at the visual history of increasing speed. The show room has great period race cars and you can read about what was done to make them as fast as possible. The assortment of cars was outstanding and represented all types of racing vehicles.",
  "It doesn't matter what your automotive level of interest is. There will be something here that you love and will remember. My wife is not into cars at all, but loved the way everything was displayed. There are large displays of pedal cars, toy cars and even lunchboxes. What a wonderful place to have and visit in Lincoln NE.",
  "take your time and see it all. it will take a long time and believe me it's worth it. There's 3 floors of fantastic. No gift shop though so there's no drinks or snacks",
  "While it shows a great history of automobiles, there’s other motorized vehicles in display. From the everyday vehicles to some, hmmmm, different types of all kinds. Best if you take a tour as they are very informative."
 ]
},{
 "name": "Lincoln Children's Zoo",
 "address": "1222 S 27th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/6e/d1/ef/folsom-children-s-zoo.jpg",
 "tags": [
  "active",
  "tour",
  "walk",
  "kids",
  "kids",
  "unique",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d117031-Reviews-Lincoln_Children_s_Zoo-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "From the fan favorite train ride to the many animal displays including the opportunity to interact with butterflies, goats and ponies the Lincoln Children's Zoo provides a great experience for children and parents.",
  "This is just a treasure! With a 5 year old it is the perfect size, just the right amount of time and plenty of creatures to fascinate her! We had such a good time,  almost as almost ALL the animals were out and active, educational areas were stationed in a few different locations with animals and insects to actually pet/touch!  The staff was phenomenal.  We paid extra for a train ride and that was the perfect way to depart the zoo after a fun morning! We will definitely return whenever we are in town!",
  "As you walk into the Children's Zoo, the displays begin immediately. Just follow the path and tour the reptile building, monkeys, big cats, and so much more. Watch as the birds of many feathers cross your path, down to the pony rides, then stop and milk the cow, next is the goats and butterfly house, then off to the seals and camels. The huge turtles are usually out sun bathing and an absolute delight to watch...especially if you are not in a hurry. Go on to the concession stand, dig for dinosaur bones and continue to the otters and other water animals. Top the fun off with a ride on the Zoo Train and gift shop. One of the best kid stops in Lincoln.",
  "We enjoy taking our grandkids to the zoo. We have as much fun as they do. And we always take a train ride. A lot of things for the kids to do and places for grandparents to sit and watch the kids have fun.",
  "The Children's Zoo in Lincoln is an incredible experience for kiddos and for adults.  My husband and I have gone by ourselves and we have taken kids.\n\nMy favorite area is the giraffes.  I could watch the young and old alike delight in feeding them.  It costs $$ to buy the lettuce leafs - just make sure you get a solid hand ful for your fee.  Don't buy just one - you will want to get more!  Go ahead and buy more for the discount. If there is a child there that can't buy some, share!\n\nI love the Zoo and I love this city!",
  "The recent upgrades are great.  The giraffes are worth visiting for sure.   It isn’t like the Omaha zoo, but easy to visit and you can enjoy just a few hours there.",
  "This year the Lincoln Children zoo started its Christmas program \"Lights at the Zoo\" It was truly an enchanting experience with all the Christmas decorations and displays encompassing the zoo. In addition, they provide you with 3-D glasses at the entrance which makes looking at the Christmas lights all around even more magical and unique. Also, there was an opportunity to make smores and ride the train if you shall choose. Overall, my family truly enjoyed the experience",
  "This zoo is a great treasure to have in Lincoln!  It is small enough to cover quickly, but has expanded tremendously in last 2 years to include exhibits found at large zoos.  There are many hands on experiences you can have (goats, small animals, giraffes, camels). My kids loved this zoo when they were little and now that they are grown and in college, they still loved it when we were there this fall!  \n\nThe train ride and tunnel are always a great hit and you can see the zoo from another angle."
 ]
},{
 "name": "Nebraska State Capitol",
 "address": "1445 K St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/8f/75/1e/capital.jpg",
 "tags": [
  "art",
  "library",
  "learn",
  "tour",
  "art",
  "unique",
  "wander",
  "tour",
  "unique",
  "art",
  "art",
  "unique",
  "tour",
  "free",
  "knowledgeable",
  "art",
  "learn",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d286560-Reviews-Nebraska_State_Capitol-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "The guy that designed the capitol did also design churches.  Next to the KS state capitol, this was the most unusual state capitol that we've visited.  The soaring tower made it stand out.  The huge use of mosaics in the decoration was fantastic.  I was interested to find a bust of a distant cousin, William Frederick Cody, in the hall of honor, because he was a resident of NE at one time.  The murals and door decorations were also very nice.    You can see all of Lincoln from the observation deck, and there is a almost synagogal atmosphere to the law memorial in the tower, surrounded by the observation deck",
  "I learned about the Nebraska Capitol Building through the The Library Book. The LA Central Public Library was his next project. After researching, I felt I really had to see it in person.\n\nThe architecture, sculpture, mosaics, and other works of art are beyond description. We arrived in time to have a guided tour, so were able to learn about many of the features and see the room that houses the Supreme Court. Afterwards I took the tiny elevator (not scary at all really) to the 14th floor. Not only is the view outstanding, but the stonework, the light fixtures and the additional murals were worth the trip up. We stayed about 1.5 hours.",
  "A true architectural marvel on the prairie. This stunningly unique capitol building dates to the 1920s and is full of amazing art deco motifs, murals and stonework from that glorious period. The only unicameral state legislature in the nation is quirky but interesting. Gift shop in the basement and take the lift to the observation deck if possible",
  "Amazing architecture inside and outside. Very much worth seeing. Bring a camera; you will be surprised at the depth of detail in the interior. It is really beautiful.",
  "The Nebraska state capitol building is a gorgeous old building with great photo ops for any occasion or just to wander and enjoy the beauty.  The panoramic views of Lincoln are nice.  Just a note:  the do close the outside observation area at the top in inclement weather so check before you go it that's what you want to see.  ",
  "This is one of the most unique and beautiful Capitol buildings in the country.  Be sure to take the guided tour that provides information and insight into its construction.  Every stone , mural, mosaic, and quote has meaning and purpose, telling the story of Nebraska and its people.  The observation decks provide a beautiful panoramic view of the city and countryside.  Visit on a Thursday, so you can also tour the Govenors mansion located across the street. ",
  "If you are interested in a location that combines all the arts in one, this is\nThe top of the list. Art deco neo classical building, murals, mosaics, sculpture,  symbolism and the written word. No cost for entry and tours on the hour. One of the 100 significant buildings in USA according to the AIA (American Institute of Architects ).",
  "Founded in 1482 by Mr. Nebraska himself, the capitol building is carved out of one continuous piece of granite. Cool stuff!",
  "This is a unique gem of a building. No expense was spared on the design, art, mosaics, furnishings. So many intricate wood and stone details. Truly and architectural wonder! We make it a point to visit state capitols when we travel and this one in beyond compare.",
  "My family and I took the guided tour on March 6, 2020 at 4pm. Our tour guide was Kirk, who was very friendly and knowledgeable about the State Capital and the surrounding area. The guided tour takes about 1 hour, you will start at the entrance, learn about the mosaic tile art that is truly incredible. As you proceed through the halls, each section has a story attached to it. Then you will proceed to the State Senate Chamber, which is really pretty cool to see, the chamber was empty with the exception of a few pages having a meeting. Then it was off to see the State Supreme Court Chambers, this was our last stop. Then we were encouraged by our tour guide Kirk to take a ride on the elevator to the 14th floor where we experienced awesome city views of Lincoln. \n\nIf you are traveling or just passing through, take the time to visit the State Capital of Nebraska, it's free and very enjoyable.",
  "Built in the 30s, it's amazing how the mosaics can be seen as before their time in design as well as timeless. The outlook from the top is breathtaking, seeing so much of Linco!n. The architecture is !just Amazing!!!! \n "
 ]
},{
 "name": "Pioneer Park Nature Center",
 "address": "3201 S Coddington Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/59/e6/55/pioneers-park.jpg",
 "tags": [
  "family",
  "walking",
  "nature",
  "theatre",
  "nature",
  "nature",
  "walk",
  "nature",
  "kids",
  "walk",
  "family",
  "walking",
  "nature",
  "walking",
  "nature",
  "history",
  "walking",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d117029-Reviews-Pioneer_Park_Nature_Center-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was Sunday before Memorial Day, and after church and breakfast with the family, my granddaughter introduced me to this gem of nature within the City of Lincoln. She drove me around and showed me the sights. There are great trails for walking and running. She is a cross country runner, as are, mom, dad, brother and sister, and they often train here with their bird dog, too. A wonderful place for photography which they make great use of. My imagination ran wild as I could envision this beautiful park in it's natural state before Lincoln was settled. Nice big pond, old schoolhouse and even an outhouse; it reminded me of when and where I grew up. I loved the American bison, as we got to admire eight of them for quite a while. Too much else to mention. I am looking to spend more time here next year. Highly recommended! ",
  "Leashed dogs, children and adults enjoying nature trails, outdoor theatre, picnic and an assortment of gated large animals.  ",
  "A great park with tons to see and explore! You could easily spend all day here. A must-see is the nature center where there are hiking trails and live animals on display.",
  "We stopped by here and it was miserably cold and windy in October. Not the best day for a visit! The woman at the visitor center was so friendly and outgoing that we couldn't keep being in a bad mood about the weather. We braved the outdoors to admire the bison and to take a walk along the lake to see the red-tailed hawks. If it was nicer, we definitely would have explored more but as it was, it was a great chance to stretch our legs and admire the scenery before getting back on the road.",
  "Lived in Lincoln twice over the years but only ever visited the columns. This time I took my son to the nature center and the kids play areas. So many trails to walk or bike. ",
  "It was Sunday before Memorial Day, and after church and breakfast with the family, my granddaughter introduced me to this gem of nature within the City of Lincoln. She drove me around and showed me the sights. There are great trails for walking and running. She is a cross country runner, as are, mom, dad, brother and sister, and they often train here with their bird dog, too. A wonderful place for photography which they make great use of. My imagination ran wild as I could envision this beautiful park in it's natural state before Lincoln was settled. Nice big pond, old schoolhouse and even an outhouse; it reminded me of when and where I grew up. I loved the American bison, as we got to admire eight of them for quite a while. Too much else to mention. I am looking to spend more time here next year. Highly recommended! ",
  "It was drizzling and we decided to just take a drive over and check out this park. The nature center was a little hard to find but we did. The lady in the one building was very helpful and gave us a map of the walking trails. With our raincoats we set out. Some trails were cement/stone..others were just grass. But well marked. They have an elk, owl, and buffalo. We spent a couple hours there and thoroughly enjoyed it!",
  "Pioneers Park is a beautiful place for people seeking commune with nature.  When I visited here on a Sunday morning in July, people were already on the trails walking and running on the trails that were open; more trails open up after noon (on Sundays) for hiking at which time also the Nature Center opens.  But the trails that were open did provide access to beautiful sections in the park including the Columns, the Bison Overlook, and several ponds and prairies.  There is a marker at the Columns about the interesting history of how the columns from Washington DC were installed here.  The trails that were open for bicycles are concrete paved and well maintained.  Only, I found trail markers and maps to be inadequately posted.  Early in the morning it appeared there were a lot of birds in the trees gauging from all the chirping and singing.  But, I did not see any animals.  Also, the bison were not visible from the overlook (they must have been grazing somewhere down in the valley).\n\nThe park has a Nature Center, but I did not go there."
 ]
},{
 "name": "Memorial Stadium",
 "address": "1 Stadium Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/ec/05/ef/sea-of-red-during-a-husker.jpg",
 "tags": [
  "walking",
  "walking",
  "kids",
  "tour",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d3674518-Reviews-Memorial_Stadium-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "No parking unless  you get there a day early to tailgate. To get there, chances are lots of traffic. We used Lyft to make it there. Parking is hard to find downtown, parking lots get full fast. There's lots of walking no matter what. Full of energy, for most part people are friendly. Personally, i hated it, I don't like sweaty people and claustrophobic. I'd rather be at home watching the game in my tv and my couch. But the hubby loves it, the atmosphere. It's great really - just not for me. I  went back by the concessions and watched the game from one of the flat screens. The restrooms were clean, lots of concession stands for you to choose from. Recent WiFi addition was wonderful.",
  "No parking unless  you get there a day early to tailgate. To get there, chances are lots of traffic. We used Lyft to make it there. Parking is hard to find downtown, parking lots get full fast. There's lots of walking no matter what. Full of energy, for most part people are friendly. Personally, i hated it, I don't like sweaty people and claustrophobic. I'd rather be at home watching the game in my tv and my couch. But the hubby loves it, the atmosphere. It's great really - just not for me. I  went back by the concessions and watched the game from one of the flat screens. The restrooms were clean, lots of concession stands for you to choose from. Recent WiFi addition was wonderful.",
  "Memorial Stadium is a place to be during football , nothing beats the fans at Memorial Stadium. The seating is a bit tight but worth it all the way. ",
  "Would be 5 stars if the CMB played neck. Please patronize the poor little kids selling candy, they barely are able to make rent!",
  "A sports icon with a very interesting tour. Huge stadium with a storied history. Don't miss it if you're in town. ",
  "Anyone visiting Lincoln, Nebr. should definitely visit Memorial Stadium or attend 1 game in their lifetime!",
  "I have a great pride for this stadium. I make sure the very most important people in my life visit. So far my husband! Kids and soon my father and brother in law. It's one of my favorite places to be.",
  "Nebraska mus think ever human is skinny.  The seats are so small you eventually feel like you are sitting on your neighbors lap.  They provide seat cusions for $5 donation, you put several of them in a row and you will overlap someone else's seat. \n\nAtmosphere was abosulutely amazining.  You want tickets on the East side of the stadium or lower level of the west side.  We were row 44 and had obstructive view of the game.  Plus, they don't indicate on the tickets that the seats are obstructed."
 ]
},{
 "name": "Lincoln Children's Museum",
 "address": "1420 P St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/53/3c/8f/ever-wanted-to-sit-in.jpg",
 "tags": [
  "kids",
  "kids",
  "kids",
  "family",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d286561-Reviews-Lincoln_Children_s_Museum-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "We love this museum as this place has numerous interactive exhibits to explore for both children and adults alike. The highlight for our son was the clock playground and the police/fire department exhibits ",
  "I love this place and somdoes our Grandson.  There is parking within a block in a garage.  We lucked out and found one nearly by the front door.\n\nSo many fun things to do!  It’s laid out in a very open way sonyou never have to worry about SEEING your child or grandchild.\n\nOur grandson loves this place!  It’s a great place to burn off some energy and explore!  So many options!\n\nWe don’t live in Lincoln, but come enough that we joined.  If nothing else, we want to support such a great place for kids!",
  "This museum has so many fun things to do! While everything is for younger kids, my older kids didn't mind and they still joined their little brother for some fun. The cucoo clock is one of a kind and the water room is amazing! The water table has seats for babies to sit in to play.  Feel like the price is a little steep, especially for older kids. I'm glad we stopped in and hopefully we'll visit again someday. ",
  "Excellent things for the kids to do!! They loved the fire truck and grocery store with the dress up area!!",
  "My little one loved it I loved it too I love seeing how she loved to lurn and how her eye out up win she got to see how things work",
  "My son (and I) love this place. We visited the other day making it our second time. The place is spread out over 3 levels. The bottom one is our favorite. Well worth buying the family pass for 90 bucks. 3 visits (easily done in a year) and it’s paid for its self. ",
  "We love this museum as this place has numerous interactive exhibits to explore for both children and adults alike. The highlight for our son was the clock playground and the police/fire department exhibits ",
  "This is the place for a young person to learn by doing.  Displays allow child to interact and react. They like each exhibit so much that is hard to get them to move on to the next station.  "
 ]
},{
 "name": "International Quilt Museum",
 "address": "1523 N 33rd St University of Nebraska",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/c7/9f/76/international-quilt-study.jpg",
 "tags": [
  "art",
  "organized",
  "unique",
  "history",
  "free",
  "history",
  "art",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d1141994-Reviews-International_Quilt_Museum-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I live in in Lincoln so luckily I can visit this museum often.  The quilts on display are from all over the world and are fascinating to see.  The exhibits change regularly so there is always something new to explore.  They have a great gift shop along with lectures and workshops by visiting quilt authorities.  The annual Art Market held in November is a fundraiser for the museum and features local artisans.  Check the museum’s website for more information at quiltstudy.org.",
  "I used to live 3 blocks away and watched it being built and watched it double. They have on-line resources that will blow your mind. You can look up quilts by color, style, era, and many other categories. In the building they have a small theater where you can use the computer to bring the quilts you want to see up on a life size screen. They have international speakers come to enlighten on their area of expertise. They curate wonderful exhibits. They have controlled environment storage so well organized you can locate any quilt and bring it forth.\n\nI have had a quilt identified on ID Day. The exhibits are so well done I can not imagine being disappointed in any of these activities.",
  "I had missed Ken Burns’ display of quilts but I was determined to visit the museum at some point. The displays were absolutely beautiful. If you love arts and crafts and especially quilts you will appreciate the quilts and handwork on display. I was able to see quilts from India, many states in the USA, and Europe were exquisite. The soldiers made by soldiers were unique and displayed much artistry.",
  "My review would have to echo many of the others.  This is a gorgeous new glassy building.  The quilts on hand were immaculate and the signs on hand were educational.  There are not as many displayed as you might think, in such a large building.  The virtual displays that our local host told us about were not available, due to some construction in the museum when we were there.  \nI'm not a huge quilt aficionado, but I do enjoy history and handmade craftiness, so I enjoyed our brief visit.  I wouldn't tell anyone to come from far away for this as their main destination, but if you are in town and have an hour to check it out, it is worth the visit.",
  "If you like quilts, this is a definite place to stop in.  Admission is free on the first Friday of every month.  It starts at 4 PM and lasts until 7 PM.  One of the current exhibits they are featuring are “cheddar” quilts from the late 1800s to the early 1920s.  There was quite an array of quilts to see from this time period.  Another exhibit featured African quilts.  A smaller exhibit featured log cabin quilts.  All the exhibits had an introductory plaque explaining the origination, history and purposes of the type of quilt shown.  Additional plaques are beside each quilt explaining in further detail about them with additional historical facts such as the years (or possible years) and the quilter’s name if it was known. ",
  "Even if one is not a \"Quilter\" a visit to this attraction will cause a person to admire the care, creativeness, skill and workmanship that goes into making beautiful quilts.  The building itself is an excellent example of good museum building design, and allows for the display of the quilts as works of art (which they are).  For the casual visitor, one to two hours will yield a good experience.  For those who ARE quilters then more time will be required!",
  "Not a quilter but someone in our group is and I was pleasantly surprised with how much I enjoyed the visit.  The quilts are nicely presented.  We added to the fun by choosing our favorite in each of the galleries.  I particularly liked the double-sided quilts \"Dualities\" by Emiko Toda Loeb.",
  "As exhibits change from time to time, this is not a once and done kind of place.  Currently, the Old World Quilt exhibit is a must see.  You won’t want to miss the exquisite embroidery on these “flat” quilts.  On the way, take a peak at the quilts in the Whimsy exhibit.  Of special interest is the 43 pound quilt embellished with buttons.  And don’t miss the sock monkey quilt while you’re there!",
  "Get there early. They open late and close early. We drove to Paducah to the museum there and then to Lincoln, but the museum was closing as we got there. We did not get to see it because we were on a tight schedule.",
  "We stopped in Lincoln on a roadtrip across the country and were looking forward to visiting the museum. What we saw was pretty amazing in terms of  design and implementation. \n\nDualities was especially impressive. We both understood immediately the value of these quilts as artwork. Whimsy had some fun quilts. All those buttons! The quilts from around the world so interesting.\n\nWhat was lost was tying all the quilts together.  Why were they chosen. What impact have they had on the quilting world?",
  "What a wonderful museum.  Sweet gift shop with unique items.  The quilts on display were fabulous .  Such detail.  The photos attached are two quilts front and back.  Realize my attempts are rather primitive."
 ]
},{
 "name": "University of Nebraska State Museum",
 "address": "645 N 14th St University of Nebraska- Lincoln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/5b/24/04/university-of-nebraska.jpg",
 "tags": [
  "unique",
  "history",
  "free",
  "family",
  "kids",
  "unique",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d286703-Reviews-University_of_Nebraska_State_Museum-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I imagine some may not find this to be the flashiest museum in the USA, but it contains a wealth of unique exhibits, as well as some unique research focuses. As might be expected, it contains the best Nebraska geography and wildlife dioramas in the world. It contains a world-class woolly mammoth exhibit - possibly the world’s best (including the world’s largest mounted mammoth - “Archie”). And they just spent over $10m redoing just the 4th floor to focus on Great Plains ecology, climate change, geography, biology, zoology, archeology, etc. It’s very impressive.",
  "visited over 4th, spent a few hours. who knew NE had rhinos and elephants. very nice museum on NE history good collection of fossils prehistoric  to present. new this year 4th floor opened with overview of native Americans, importance of water, current environmental issues. do visit well worth it. Support local",
  "This is a fantastic place to go as a family or to have a playdate.  They offer a variety of things to see and hands-on activities for all ages.  Look for special events and two months of the year they offer free admission on Thursdays. \n\nI have two boys ages 3 & 7, we have a blast when we go here. I love looking at all the old stuff and explaining it to my kids and they love to make up stories and check out all the interactive parts of the exhibits!",
  "I imagine some may not find this to be the flashiest museum in the USA, but it contains a wealth of unique exhibits, as well as some unique research focuses. As might be expected, it contains the best Nebraska geography and wildlife dioramas in the world. It contains a world-class woolly mammoth exhibit - possibly the world’s best (including the world’s largest mounted mammoth - “Archie”). And they just spent over $10m redoing just the 4th floor to focus on Great Plains ecology, climate change, geography, biology, zoology, archeology, etc. It’s very impressive.",
  "This museum is inexpensive and yet gives hours of entertainment and history lessons.  It has a lot of exhibits showing everything come the ancient age to today.  The dinosaur exhibit is worth the price of admission alone.  Who know there were that many dinosaurs in that area?  The top floor is the most recent and has an excellent hands on for the kids.",
  "We took our granddaughters, eight and four, and figured they would like the mammoth exhibit and not much else. They loved everything and took their time with every exhibit. Plenty of kid friendly things.",
  "Very impressed by the climate change exhibit, particularly poignant as eastern Nebraska experienced major flooding less than 2 weeks before my visit was scheduled. Also really drawn to the prairie-specific exhibits, including taxidermy of birds (I was visiting to see the sandhill crane migration.)",
  "Go back in time with a visit to this fantastic museum, one of the best we have ever seen. It took a little to find the place and there is parking next to the building on the east side. It is also called Elephant Hall. The museum houses a huge, rare collection of elephants and their extinct ancestors, which roamed the plains. It features 13 mounted skeletons and other fossil mammals. There are displays of the Nomads of the plains and special exhibits. You can also see the Mueller Planetarium."
 ]
},{
 "name": "Pinnacle Bank Arena",
 "address": "400 Pinnacle Arena Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/07/98/ae/pinnacle-bank-arena.jpg",
 "tags": [
  "drink",
  "food",
  "historic",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d5570034-Reviews-Pinnacle_Bank_Arena-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Brand new facility.  I have been to a few events there.  Pretty typical arena.  The downside is that parking is very scarce.  Unless you are a local, or are staying at one of the hotels by the arena, plan on getting there very early and grabbing a bite or drink at one of the plentiful restaruants/bars near the facility.  The arena is not overly large, so it is a good place to get a decent concert experience.",
  "My wife and I saw Carrie Underwood at the Pinnacle Bank Arena and really enjoyed our time there. We had seats on the 2nd level and could see the stage really well. The food and beer stations on the 2nd concourse were not really busy, so it was quick and easy to get our overpriced $5.50 piece of pizza and $8 beer. \n\nOur biggest complaint from last night was not opening the doors until 45 minutes before the show started. Online we saw the doors were going to open at 5:30, but it was about 6:15 before they let anyone in, which made it seem like a mad dash to get to your seats. Also, the parking and ability to have dinner is less than ideal in the Haymarket before a big event.",
  "This is a top of the line venue with tons of amenities, including various food joints and sports shops.  It's got ample parking along with various walkways to and from the venue.  It's front doors open up to the historic haymarket region of Lincoln Nebraska.  This area has several great restaurants and shopping areas.  ",
  "We enjoyed watch the Husker women play basketball.  We were able to feel the atmosphere rocking when we scored.",
  "Good views, acoustics, etc.  Restrooms were spacious and clean.  Good staff and accessibility for wheelchair users. ",
  "In my estimation this is a world class arena. I have attended sporting events and concerts numerous times and I have enjoyed the venue immensely. Seating is comfortable with reasonable space between rows.  Concessions are readily available on all levels and there are parking garages in close proximity. Parking can be purchased online ahead of any event.",
  "I really enjoy this arena. Views are great for sporting events and the sound system is very good for concerts as well. Staff has been friendly and it is relatively easy to enter and exit. Concourses are fairly wide and signage for sections is good. Maybe the best part of all is the variety of establishments to visit before and after the event in the surrounding area.",
  "This was my first time going to this arena. I was surprised at how easy it was to get in the arena for the concert find a parking spot. We actually lucked up and seen a women leaving when we were arriving. The walk was not far at all. there were desperate doors for the different levels when entering. Grabbing concession was a breeze the seats we chose were floor seats and were great. Security was rude at this event. Overall it was way worth seeing Cardi B."
 ]
},{
 "name": "Holmes Park & Lake",
 "address": "70th and Normal Blvd.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/ac/e6/06/holmes-park-lake.jpg",
 "tags": [
  "walking",
  "parks",
  "walk",
  "free",
  "family",
  "parks",
  "walking",
  "parks",
  "walking",
  "walk",
  "free",
  "family",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d117028-Reviews-Holmes_Park_Lake-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Holmes Park has been one of  Lincolns best parks  for over 50 years!  They have ball diamonds, picnic shelters, stocked trout fishing, crappie, bass and blue gill.  They have a golf course, Hyde Astronomy  Observatory and walking trails.  In the Winter they have sledding from the dike  onto the frozen lake and ice-skating.  It is beautifully landscaped and well-maintained.\n\n It’s a happening kind of park and there are usually lots of people there.  They have several parking lots and there is usually plenty of parking.  Local radio stations occasionally host events there as well.\n\nThere is room to fly kites by the dike and there are no tennis courts or pickle courts at this time.\n\n No motor boats allowed,  but you can use canoes sail boats and windsurfers.  One of Lincoln’s many bike trails trails also connects with the park.  This park attracts  families, teens, singles, couples, middle-aged and older people.",
  "Anyone who lives in Lincoln knows Holmes Lake.  This is safe place to walk, ride your bike, fish, play at the playground, or just sit and relax by the water...it's a really beautiful place in a nice part of Lincoln. ",
  "Holmes Lake Park is a lovely 270-acre blue and green gem within the urban area of a state capital. It offers a dog park, fishing, non-motorized boating, hiking, biking, running, picnics (of course), shelters both open and rentable, ball diamonds and volleyball courts, and even a public golf course. I don't golf so I am not sure how big it is but I imagine it's a 9-hole as I doubt there is space for a full 18-hole course. Across the street there is a dog park. You could easily spend an entire day here just chillin'.\n\nOne of the most extraordinary attractions is a 3-telescope observatory within the park, open only on Saturday evenings but year round, family and child friendly, and free!\n\nThere is plenty of parking within the park. I was there to cover an event for a non-profit organization which was very well attended on a glorious Sunday when the park was otherwise jammed anyway, yet there was absolutely no problem parking, at least not on the North Shore Drive. Parks are essential for city dwellers to decompress. This one is just plain swell! ( ͡ᵔ ͜ʖ ͡ᵔ )",
  "Holmes Park has been one of  Lincolns best parks  for over 50 years!  They have ball diamonds, picnic shelters, stocked trout fishing, crappie, bass and blue gill.  They have a golf course, Hyde Astronomy  Observatory and walking trails.  In the Winter they have sledding from the dike  onto the frozen lake and ice-skating.  It is beautifully landscaped and well-maintained.\n\n It’s a happening kind of park and there are usually lots of people there.  They have several parking lots and there is usually plenty of parking.  Local radio stations occasionally host events there as well.\n\nThere is room to fly kites by the dike and there are no tennis courts or pickle courts at this time.\n\n No motor boats allowed,  but you can use canoes sail boats and windsurfers.  One of Lincoln’s many bike trails trails also connects with the park.  This park attracts  families, teens, singles, couples, middle-aged and older people.",
  "The park has some decent walking paths, but as far as landscaping goes it's drab, boring, and sad. This park could be extraordinary, but instead it lacks everything that would enhance it's beauty, and make it a great place for people, migrating birds, bees, and native perennials. Come on Lincoln, you can do much much better!",
  "Anyone who lives in Lincoln knows Holmes Lake.  This is safe place to walk, ride your bike, fish, play at the playground, or just sit and relax by the water...it's a really beautiful place in a nice part of Lincoln. ",
  "Holmes Lake Park is a lovely 270-acre blue and green gem within the urban area of a state capital. It offers a dog park, fishing, non-motorized boating, hiking, biking, running, picnics (of course), shelters both open and rentable, ball diamonds and volleyball courts, and even a public golf course. I don't golf so I am not sure how big it is but I imagine it's a 9-hole as I doubt there is space for a full 18-hole course. Across the street there is a dog park. You could easily spend an entire day here just chillin'.\n\nOne of the most extraordinary attractions is a 3-telescope observatory within the park, open only on Saturday evenings but year round, family and child friendly, and free!\n\nThere is plenty of parking within the park. I was there to cover an event for a non-profit organization which was very well attended on a glorious Sunday when the park was otherwise jammed anyway, yet there was absolutely no problem parking, at least not on the North Shore Drive. Parks are essential for city dwellers to decompress. This one is just plain swell! ( ͡ᵔ ͜ʖ ͡ᵔ )",
  "There happened to be a triathlon going on the day I visited which was quite interesting. Large park so even though there was a lot of people there, you never felt crowded. "
 ]
},{
 "name": "Pinewood Bowl Amphitheater",
 "address": "3201 S Coddington Ave South Coddington and West Van Dorn Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/60/88/b0/pinewood-bowl-amphitheater.jpg",
 "tags": [
  "food",
  "drink",
  "family",
  "walking",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d10522106-Reviews-Pinewood_Bowl_Amphitheater-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I've seen many shows and concerts at the Pinewood Bowl over the years.  It's recently been upgraded into a much higher quality venue with better speakers and seating. There is now food and drink offered, as well as security and handicpped parking.  Be aware: do NOT attempt to take in food or umbrellas or lawn chairs, you will be turned away at the gate. Overall a great place to see a show.    ",
  "Love this place!  The lawn and bench seating provides great views.  The lighting and sound is always good.  It is a great family outing for musicals and theater.  Parking is ok, plan on walking some distance to the entry.  ",
  "At least once a summer we like to go here and enjoy some kind of entertainment be it a musical play, a concert or singing group of some kind.   If the weather isn't to hot and it's not going to rain it's a great place for these sort of activities.  Parking is a bit of an issue but they do a nice job of controlling the traffic both in and out but be patient.  Stop afterwards and get an ice cream out side the east gate.  Yummy",
  "We saw Joe Bonamassa there.  It beautiful and the layout of the venue is great.  There isn't a bad seat in the house!",
  "The Pinewood bowl is one of the best venues I have ever been to!!  Nice people! Great seats! Awesome setting!!  Loved everything about it!! Alison Krauss and Willie Nelson were fabulous!!!",
  "This was my first time at the Pinewood Bowl. I enjoyed the event and was pleasantly surprised at the acoustics. Will definitely do other concerts there. ",
  "The best concert in a long time.\nThe people were friendly. Plenty of drink stands and bathrooms. Easy to find your seating. A very nice outdoor theater.",
  "Best plac3 to watch a concert!  Everyone is so friendly .  coming back as soon as i can.  Willie nelson was fabuloius"
 ]
},{
 "name": "Antelope Park",
 "address": "23rd and N. to 33rd and Sheridan Blvd.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/95/cc/5e/antelope-park.jpg",
 "tags": [
  "family",
  "family",
  "walking",
  "kids",
  "kids",
  "walk",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d117026-Reviews-Antelope_Park-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Antelope Park has a variety of means for R&R that anyone can find something  enjoyable to do there.  Trails are available for hiking, running or leisurely walks; bike trails go by the park for those who want to go on long rides.  Nearby is the Sunken Gardens, a beautiful garden for a nice relaxing visit.  The Rotary Garden is a showcase for prairie plants. The Veterans Memorial Garden is a must visit while to remember and pay tribute to veterans who have sacrificed for freedom.  A variety shelters and playgrounds are available for family picnics.  \n\nAntelope Park is a great place for a family picnic or for a solo exercise excursion.",
  "Antelope Park has a lot to offer. There are monuments, a band shell, enclosed and unenclosed picnic areas, walking trails, a Veteran's Memorial Garden, and a wonderful playground suitable for all ages. Auld Pavillion, within the park, holds local events including contra dancing on Saturday evenings. I like to go here to read, and my whole family likes to hunt Pokémon here. The playground at Antelope Park is my kids' favorite in the city. The restrooms are conveniently located near the playground, but there usually isn't any soap, so be sure to bring hand sanitizer. There are soda vending machines, as well.",
  "My son and I came here for an hour, although you could spend longer. There are a lot for the kids to do, play areas, sand pit area and a swing area. There are restrooms right next to the play areas. Also the park offers a lot of land to walk the dog, stroll or jog. There is a war memorial right next to the kids play area too.",
  "Antelope Park has a variety of means for R&R that anyone can find something  enjoyable to do there.  Trails are available for hiking, running or leisurely walks; bike trails go by the park for those who want to go on long rides.  Nearby is the Sunken Gardens, a beautiful garden for a nice relaxing visit.  The Rotary Garden is a showcase for prairie plants. The Veterans Memorial Garden is a must visit while to remember and pay tribute to veterans who have sacrificed for freedom.  A variety shelters and playgrounds are available for family picnics.  \n\nAntelope Park is a great place for a family picnic or for a solo exercise excursion.",
  "We enjoy driving through this park, getting out to stroll around, and even have a picnic.  Nice plantings of trees, shrubs, and flowers.",
  "Love this park and my daughter always requests to stop here...  there are walkways and playground equipment and restrooms.  ",
  "This place was amazing.  Super for a town like Lincoln to have such a wonderful memorial for our military veterans.   Take at least 1 hour of your busy schedule and go see this place.    Well worth the stop."
 ]
},{
 "name": "Bob Devaney Sports Center",
 "address": "1600 Court St Near the intersection of Salt Creek Pkwy. and Antelope Valley Pkwy.",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/86/06/ed/husker-volleyball.jpg",
 "tags": [
  "affordable",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d10522204-Reviews-Bob_Devaney_Sports_Center-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great venue to watch some Husker volleyball.The parking lot is the only downfall. Takes a long time to get out after the game ",
  "During volleyball season, IF you can get tickets, the Nebraska women's volleyball team is consistently one of the best in the country. Go Big Red!",
  "Great venue, amazing atmosphere, affordable tickets (high demand so hard to get), very enjoyable, high-energy fun thing to do (family friendly, or any age), concessions and restrooms are easy to find, good sports store with Husker gear",
  "The Bob Devaney Sports Center is a great place to watch Nebraska Wrestling and Women's Volleyball. Seeing 8,000+ fans, probably 90-95% cheering for Big Red, has to be an intimidating scene for opposing teams there for a Volleyball game. That place gets very raucous and loud during athletic events.",
  "its fantastic what they have done. best venue for watching women or men's volleyball. it helps having the best women program in the country. "
 ]
},{
 "name": "Nebraska History Museum",
 "address": "131 Centennial Mall N",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/6a/0f/2c/exterior-view.jpg",
 "tags": [
  "history",
  "art",
  "history",
  "history",
  "history",
  "eat",
  "walk",
  "history",
  "history",
  "learn",
  "history",
  "art",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d3222901-Reviews-Nebraska_History_Museum-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited specifically to view the Suffragist exhibit - it was remarkable, informative, interactive and well done. The second floor has Nebraska history with good exhibits and multiple options for pictures. Will return next time I'm in Lincoln.",
  "There are two museums in the downtown area. It was easy to get them mixed up. This is the one closest to the Capital and features over 10,000 years of Nebraska's history. Several exhibits display artifacts and stories about everything from comic art to aviators and politics. Only interesting for history buffs.",
  "This was a great attraction for an out-of-state visitor. Fascinating exhibits showing timeline of the history of Nebraska. Great gift shop, as well!",
  "The new remodeled look really makes this museum back on your map of things to look at while visiting Lincoln. Nebraska history is finally reborn! Lots of new areas and things to see. Parking can be hard to find so you may want to find a parking garage a couple blocks away and hit one of the many good places to eat downtown as you walk to the museum. The staff is friendly, especially Kelsey who works at the front desk. He gave us some good tips and helped us enjoy our visit. Thank you!",
  "We dropped by twice in a single week.  The first time, we briefly toured the entire museum, to get the lay of the land.  On our second visit, we focused on the exhibits of historical photos, very interesting, as well as the quilts.  The staff is soooo helpful, and the gift shop is lovely.  If you are looking for a small quilt to take home, the museum has an admirable collection at surprisingly reasonable prices.  ",
  "The museum has been recently renovated. However the displays and exhibits are rather sparse. They are gearing up towards the major opening next spring in March 2017 to celebrate the 150th birthday in Nebraska. young children will find some items to look at and listen to. But, plan on a short stay. ",
  "We visited specifically to view the Suffragist exhibit - it was remarkable, informative, interactive and well done. The second floor has Nebraska history with good exhibits and multiple options for pictures. Will return next time I'm in Lincoln.",
  "Donations.  3 Floors of exhibits, some of which change from time to time.  The stock car racing and woman's suffrage floors were not very interesting.  The 2nd floor had many displays of Nebraska history that were worth seeing.  I enjoyed the old photographs from the 1800's. Nice gift shop and friendly greeting person.  The parking garage around the corner has very reasonable rates.  Would have walked to the Capital from there if we had time.  Challenging to get back to highway during rush hour if you are not familiar with area.",
  "The Nebraska History Museum is a great place to go to learn about Nebraska's long and often complex history. There is no cost to admission, only a voluntary donation.",
  "There are two museums in the downtown area. It was easy to get them mixed up. This is the one closest to the Capital and features over 10,000 years of Nebraska's history. Several exhibits display artifacts and stories about everything from comic art to aviators and politics. Only interesting for history buffs.",
  "The Nebraska History Museum was good but not great. I would definitely come back here to see some of the newer exhibits. "
 ]
},{
 "name": "National Museum of Roller Skating",
 "address": "4730 South St Ste 2",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/cf/19/a6/national-museum-of-roller.jpg",
 "tags": [
  "unique",
  "tour",
  "free",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d286701-Reviews-National_Museum_of_Roller_Skating-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I did not know when I moved to Lincoln, Nebraska that the National Roller Skating museum even existed so I decided to take a gander at this quaint museum, It did not disappoint as it was both informative and unique. I am glad I took a visit to it",
  "Self guided tour with no admission fee. There are roller skates on display that are beyond imagination. ",
  "There is free parking available behind the building. The entrance is in the front of the building. The museum is in the back of the office. There is good signage directing you to the museum with several exhibits along the route. The staff are office workers who will help you, if necessary, but the museum is self guided. By the way, there is no admission charge but there is a donation box if you are so inclined. There is an impressive amount of roller skating memorabilia and it is primarily directed toward amateur roller skating (not roller derby). There is a gift shop, but I think you must ask an office staff member to unlock it.",
  "There is a whole world of roller skating most people don't know about. They do everything the ice skaters do in the Olympics but on roller skates: figure skating, speed skating, group routines. The museum covers the beginning from early shoe skates to roller rinks to roller derbies. Great way to spend a couple of hours and it's free (donations accepted). Don't miss this!",
  "We went because we needed to see Isaiah's coach in the Hall of Frame. What we got was a great attentive staff willing to tell the history of roller skating! We had a wonderful time because of the staff. Well worth the trip"
 ]
},{
 "name": "Sheldon Museum of Art",
 "address": "12th and R Sts On the campus of the University of Nebraska",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/17/66/3b/sheldon-museum-of-art.jpg",
 "tags": [
  "music",
  "art",
  "art",
  "free",
  "tour",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d126550-Reviews-Sheldon_Museum_of_Art-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "We enjoyed a nice stroll through the local treasures and enjoyed the seasonal exhibit on freedom.  \n\nBeautiful building & spacious layout.  \n\nWe went at 4 pm an hour before they closed on Saturday and it was a nice quiet & uncrowded time.  90-120 minutes would have been better but we were happy with an hour. \n\n",
  "Lovely building. We visited during an event which adds music and extra exhibits. They have some fabulous pieces in their permanent collection. I especially enjoy the outside exhibits.",
  "We visited on a very slow day during Spring Break.  Parking nearby is by meter, and you've got to have a credit card or change handy.  The people on duty were attentive and well informed, and they were obviously proud of what they had, too.  The rotating collections were interesting, well lit, and thoughtfully arranged.  The permanent collection, too, showed all sorts of great things, including a surprisingly good Impressionist collection.  It's not a huge museum--which is probably good, let's be honest about our ability to stare at art for hours on end--and they use the space well, breaking up pieces in a way that makes sense and make you think of the collection differently (for example, one room had things that were all made of clay, though not everything is immediately obvious as clay).",
  "I have to review Sheldon again (I had a glowing review March 2018).  The current exhibit on Portraits and Portraiture is not to be missed. Showing u til July 2020  For a FREE entrance, you will see gems showcased in the National Gallery of Art. Diane Arbus, Kehinde Wiley (who did President Obama’s portrait), Cindy Sherman, the list goes on and on.\n\nPlus, ask for a map of the out door sculptures and take your own tour of the 30+ sculptures.",
  "Two of my favorite artists in their collection are Wayne Thiebaud and Thomas Hart Benton.  Many other international known artists and changing exhibits. Also a great example of the collaboration with a museum and a university.",
  "I was not really impressed by this museum as it had nothing that really stood out at least for me but I am glad that I did take a visit to it.",
  "went to Lincoln over the 4th visiting local museums. sheldon small but has a very nice collection. was very impressed. worth a stop. friendly staff. no admission charge. very nice art museum in Lincoln. support local",
  "This is a small local art museum. It is set in a beautiful building but the art collections are limited."
 ]
},{
 "name": "Boiler Brewing Company",
 "address": "129 N 10th St Suite 8",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/ad/a2/52/20161105-154106-largejpg.jpg",
 "tags": [
  "food",
  "tasting",
  "food",
  "delicious",
  "delicious",
  "knowledgeable",
  "free",
  "economical",
  "food",
  "unique",
  "delicious",
  "unique",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d10483690-Reviews-Boiler_Brewing_Company-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "My group stopped here for a beer dessert on a recent weeknight.  The place was decently busy, but not packed.  You can order food from Single Barrel across the street.  We tried several beers (all dark) and were very impressed.  Sometimes when tasting a beer, you have to search for the ingredient listed in the description.  This was not the case here.  All the beers were big, powerful and brimming with flavor.  If you want something subtle you maybe should ask the server.  Our server was attentive but not overbearing.  The space is fun since it is in the basement of the Grand Manse (former boiler room) and has exposed brick and dim lighting.  Street parking can be a challenge, but it is worth a return visit.",
  "We know a bit about craft beer and this place is first-rate. Lots of variety and styles to meet different tastes of customers.\n\nTry the four ounce flights; if you do not like one they will replace it with another at no cost. Who does that?\n\nWe ordered bar food from across the street and it was delicious; I may have liked my plate. Try the pulled pork tacos.\n\nService was outstanding. Fun, friendly servers.\n\nAlso, an interesting ambiance; casual and cozy.",
  "We enjoyed our lunch visit to Boiler Brewing Company.  Our server Adam was very knowledgeable about the beers and provided us with lots of information.  The IPAs we sampled were very good.  We ordered a pulled pork sandwich that was delicious.  The venue is very neat, a former boiler room in the basement of the old courthouse. This is a must stop when you are in Lincoln.",
  "Boiler Brewing Company is literally in a former boiler room - in the Grand Manse, the repurposed former federal building/post office downtown. The original post office lobby is stunning - \"They don't make 'em like that any more\" stunning. The building contains a ballroom, a dining space, a restaurant or two, a donut shop and offices and apartments.  \nThe Boiler Brewing Company has a large selection of beers. The only thing missing was a red, but they may have them at other times, as the beers rotate. 5 oz. \"tasters\" aren't free - they vary in price. I tried a light pilsner (very economical), a raspberry wheat with a long name - something about red jeans and pigtails, or something like that. Hubby and I split a neat mead. Thanks to being made from honey from rare flowers in Washington state, the 5 0z. was $10! It was yummy. The food menu is pretty short. The food comes in a box from a restaurant across the street, resulting in a tasty but slightly soggy Reuben and coolish fries. There were quite a few munchies, which might be a better choice.",
  "This little gem is a hidden treasure in Lincoln, NE. They have some of the most unique brews you will find anywhere in the state. We visited before a Husker Game and thru handled the crowd no problem.  Great staff, Great beer, what more can you ask?",
  "Looking for a spot for local craft beer? Look no further. The Boiler Room offers a wide range of selections brewed on site. Great atmosphere, our server Ryan was helpful and the beer was great. ",
  "What can I say about this place other than my husband and I loved it. We tried several hazy IPAs, Gose and Peanut Butter stout. All of the above were delicious. So good in fact we came back that night for more. Highly recommend for all those beer lovers out there!",
  "Unique brewery and they have some of the best beers around. So many different styles of beers and great staff that know theirs brews."
 ]
},{
 "name": "Wilderness Park",
 "address": "Saltillo Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/46/06/70/wilderness-park-bridge.jpg",
 "tags": [
  "walking",
  "walk",
  "walking",
  "walk",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d117030-Reviews-Wilderness_Park-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park saves my sanity on a weekly basis. Extensive hiking, biking, and equestrian trails. Great for shorter trips or all day excursions. It's not a manicured area....so bring bug spray and proper footware. Be courteous to all types of users so we can keep sharing. ",
  "I love taking the dogs on hikes at Wilderness Park.  The trails are well-marked and well-trodden, but keep a sharp eye out for bicyclists - they seem to appear from nowhere and with no warning.  The trails are marked for hikers, bikers, and horseback riders, and I think people pretty much mind the signs.  There are folks who will let their dogs run off-leash (and shouldn't), so keep a lookout for them!  ",
  "I love taking the dogs on hikes at Wilderness Park.  The trails are well-marked and well-trodden, but keep a sharp eye out for bicyclists - they seem to appear from nowhere and with no warning.  The trails are marked for hikers, bikers, and horseback riders, and I think people pretty much mind the signs.  There are folks who will let their dogs run off-leash (and shouldn't), so keep a lookout for them!  ",
  "Lincoln has many walking, biking, running trails.  This one starts at Saltillo Lincoln, Nebraska and runs all the way to Beatrice, Nebraska.  It is a beautiful trail mostly flat so walk, bike or run parts or all of it.  Lots of friendly people using these trails. ",
  "Nice breath of wilderness close to Lincoln. Nice trail system that allows for multiple types of options when out walking. Have taken the dog on a nice walk. My wife and I enjoy coming out during the fall to see the leaves as they change.",
  "This park stretches for several miles along the west edge of Lincoln. It has a nice bike trail with good bridges that stretches the length of the park. This is a great place to get away and enjoy nature, possibly see deer and fox.",
  "Like taking my dogs for walks here. Pretty, peaceful and secluded. Do wish they would mow better and clean up the area better, Kinda getting unruly.",
  "Late afternoon walk with dog. Paths were clean and clear. Guests were friendly and polite. Trails are marked for bikes, hikers or horses. Had no issue finding my way and staying on the hiking trails."
 ]
},{
 "name": "Lester F. Larsen Tractor Test & Power Museum",
 "address": "35th Fair Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/22/53/19/lester-f-larsen-tractor.jpg",
 "tags": [
  "tour",
  "performance",
  "history",
  "tour",
  "knowledgeable",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d3600211-Reviews-Lester_F_Larsen_Tractor_Test_Power_Museum-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you like tractors and enjoy seeing vintage tractors, this is the place for you. Located on the east campus of the University of Nebraska--Lincoln, this is home the the testing facilities used to certify performance of every tractor model sold in the state of Nebraska. Our volunteer tour guide was excellent and highly informative. The museum is in the original test facility, while the current facilities are just down the hill. Donation recommended.",
  "First of all, the voluteer staff were top notch as they were both informative and kind. The museum itself was a short and sweet adventure if you love learning about the history of Nebraska and farming. ",
  "By State Law since 1920, every tractor marketed in Nebraska has to be tested and certified to perform as advertised. The first state to do so and still required for 100+ horsepower tractors, today every state and most countries use the Nebraska data to allow tractor sales. The museum has dozens of old tractors and also test devices from the 1920's. Located on the campus it's a little tricky to find but well worth a visit. Cost is only $5, guides are very good and there's a neat gift shop",
  "Quilt museum staff recommended this place to husband while I was at the quilt museum. He really enjoyed seeing the old tractors and learning information while on the $10 tour. He was the only person there so he had a very personal tour with the knowledgeable guide. He also learned about the Nebraska law that requires all tractor models be tested before they can be sold in NE.",
  "This museum is a lot more interesting than you might expect. It is especially interesting if you are given a guided tour by Don (I think). He is a retired Dean from University of Nebraska and restores old tractors as a hobby. I don’t think there is anything about antique tractors that he doesn’t know."
 ]
},{
 "name": "Nebraska State Holocaust Memorial",
 "address": "3600 O St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/85/ff/cb/the-star-of-rememberance.jpg",
 "tags": [
  "family",
  "learn",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d7712112-Reviews-Nebraska_State_Holocaust_Memorial-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very nice memorial. Well done and well kept. A hidden gem. Worth the search. Stop and get a map to make it easier to find.",
  "It only takes about 10 minutes to pause here, linger longer if you want, but it's a beautiful memorial to honor those lost in the Holocaust.  ",
  "You may have to use mapquest to find this location but if you have the time then I recommend this memorial and the surrounding area. This is a very well done reminder and memorial and it was refreshing to see others getting out of their vehicles and explore what the memorial has to say. Family friendly and an excellent offering by the community.",
  "I visited with a group of 29 high school students. These were my cast members for a Holocaust remembrance play, AND THEN THEY CAME FOR ME:Remembering the World of Anne Frank at Lincoln Southwest HS. It was beautifully designed, created, and maintained. A must visit for all young people. In today’s society we need to learn from the past so when people say, “It couldn’t happen here.” We know that the German people said the same thing. Silence = acceptance. May we never forget.",
  "The Holocaust memorial is worth seeing if you can stand to visit a graveyard. It was worthwhile in my eyes as this memorial properly gives tribute to those who lost their lives during this horrible ordeal. ",
  "Very nice memorial. Well done and well kept. A hidden gem. Worth the search. Stop and get a map to make it easier to find.",
  "This memorial is in an historic cemetery in the heart of Lincoln.  Smaller dedication but full of information.  The cemetery grounds are beautiful and have several other memorials to enjoy.",
  "This was a beautiful sight and a great attraction.  I enjoyed the pictures and all the bricks with names on them.  Such a heartbreaking time in history.  this memorial was so nice. "
 ]
},{
 "name": "Hamann Rose Garden",
 "address": "S 27th St Lincoln",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/59/db/a6/hamann-rose-garden.jpg",
 "tags": [
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d12162419-Reviews-Hamann_Rose_Garden-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "During the rose season, the fragrance and the colors, so beautiful. Paths well laid out. Bonus, right across the street from the Sunken Gardens and just a few steps from the Lincoln zoo",
  "I enjoyed walking through this garden with all it's beauty. I'm very glad they repaired the large fountain. It was nice to see it working again. ",
  "This is an extraordinarily beautiful place: I strolled through in about an hour, enjoying the color and fragrance of the roses.  There are many types of greenery, which contrasts nicely with the roses.  It was a bit early in the spring, so many of them had not achieved their full blossom.  But what I will remember most about this park is the fragrance: \"a rose by any other name would smell as sweet,\" and that sweetness will stay with me.",
  "Glorious pathways to take a stroll. Gorgeous roses. Next to Children's Zoo. Excellent relaxing environment! The glorious, plants the glorious, smells the beauty of Lincoln, Ne. ",
  "If you need a quiet place, this is the place to come! It's usually not crowded and the wonderful flowers and fountains are very relaxing."
 ]
},{
 "name": "Pawnee Lake",
 "address": "112th & Superior St.",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/1d/1a/c6/pawnee-lake.jpg",
 "tags": [
  "parks",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d4500741-Reviews-Pawnee_Lake-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lake Wanahoo is part of the Environmental Restoration Project for the Sand Creek watershed. The project area comprises 1,777 acres, including a 662 acre lake. The project area is owned by the Lower Platte North Natural Resources District (LPNNRD) and was developed in conjunction with the U.S. Army Corps of Engineers. The Nebraska Game and Parks Commission provided in-lake and recreation design input.",
  "A beautiful place for birding. Came here off season. Would be beautiful for camping in warmer weather.",
  "Nebraska has some handy campgrounds that are easily accessed when driving across the state. We needed a place for the night and pulled in here. We were there in early October, so that even on a Saturday night, it was fairly deserted. (Except where the larger RVs were.) Seems to be a pretty area, from our quick walkabout the next morning. Quiet and tidy with flat, paved sites. I will note that the bathrooms (both here and at another state park) seem very outdated and poorly constructed, given the amount of traffic I'm guessing that they receive. The pit toilets were in decent shape, but they might want to invest in improvements to the main bathrooms.",
  "This is a very nice RV and Tent Campground.  It was where we spent our first two nights camping, on a cross- country road trip.  We wanted to be assured a site, so we made arrangements, on-line, through the Nebraska State Park Website.\n\nNot all of the campsites are reservable.  I counted 36 reservable sites.  They have electricity available, I believe 50 & 30 amp service, as well as two 110 plugs.  We were tenting, so didn't need the electric, but did use the 110 plugs to charge our cell phones.  As an Illinois resident, we had to pay additional to reserve a site.  The cost was $20.00 a night, plus  a reservation fee and taxes.  Even though this may seem a bit high, for tent campers, I enjoyed the nicely wooded sites, and the hot showers and flush toilets, included in the fee.\n\nWater is available from ground water pumps, behind sites 55 & 56, on the road we were located on.  Other drinking water pumps are available throughout the campground.  The hot showers and restrooms were a short walk from our camp site.  The grass has been mowed down to provide a clear path to the facilities.  Behind our site was a small canyon, so we had no one behind us.\n\nPawnee Lake is very nice.  It's clear that locals come out and swim, boat, and fish at the lake.  We had ice chests, for our perisable food, but there are no General Store on site.  So we drove into Lincoln to replenish our chests with ice.  Also, if you want to have a fire, I would suggest picking up a couple of bundles of wood before entering the site, as no good wood is available at the camp site.  The picnic table was great, anchored in a cement pad.  The parking spaces are paved and level, all a very nice set up with mature trees.  I recommend this camp site!\n",
  "Was rather annoyed by the mean man who was cleaning the restrooms. I greeted him good morning and he grunted at me like he was annoyed. And then after having a great weekend we were very rudely informed that our generator ( which is very quiet) had the whole lake \"up in arms\" Then he stormed off. Lovely lake and very peaceful out there. Just be weary of grouchy old jerks that go on power trips and act like petty tyrants"
 ]
},{
 "name": "LUX Center for the Arts",
 "address": "2601 N 48th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/5c/f8/cb/lux-center-for-the-arts.jpg",
 "tags": [
  "history",
  "art",
  "art",
  "creative",
  "tour",
  "history",
  "art",
  "art",
  "creative",
  "tour",
  "art",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d7205585-Reviews-LUX_Center_for_the_Arts-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lovely gallery in an old firehouse in University Place near Wesleyan University in Lincoln.   Very nice gift shop. An exhibit in the main gallery was Females, Fibers and Finesse which I thought was fantastic.  I visit Lincoln every year or so and try to visit the Lux gallery, check out the website, the back history of Gladys Lux is inspiring.",
  "The Lux Center’s First Friday featured 3 Native American artists. All 3 worked with mix media.  First, thank you to the Lux for having an art exhibit showcasing Native Americans.  It was nice to see minority representation from the artistic community.  I found the art displayed to be contemporary and thought provoking while still maintaining an ethnic feel.  There was another exhibit featuring ceramics. It was interesting to see how the artist incorporated wood as a way to display his ceramic pieces. I also liked how he was there to explain his pieces and how he came by his materials.  I was impressed with the fact of how he used wood from a shop in Omaha.  I am a strong supporter of the use of local and/or state resources. If any of the Native American artists had made an appearance, it wasn’t while I was there.  Besides the art exhibits, there was a nice selection of finger foods and drinks.  I highly recommend anyone who lives in or who comes to visit Lincoln to stop in here.  ",
  "I had an art requirement for college, and decided on painting 101.  I was 58 years old and no artist.  I wasn't looking forward to this at all, I was afraid everyone else in the class would be natural, accomplished artists who just had to fulfill a school requirement, so they chose Painting 101 for an easy A.\n\nWell, once again I was completely wrong.  There were 3 others in the class, and not one of them had any experience with painting, either.  Which was a huge relief.  \n\nThe teacher was teriffic.  She understood our collective anxieties about being crummy artists, and how intimidating a blank canvas can be.  She had us do small, training tasks; shadowing, orbs, mixing our own black paints and such, which got us used to the supplies and less nervous about using them.   \n Long story short- all of us well exceeded our expectations of ourselves. Two of us discovered hidden talents, and I did an exceptional (I believe, anyway) and instantly recognizeable Bob Marley, complete with dreads and Rasta hair beads. \nI had absolutely no idea I had that in me, and would have scoffed had you told me I did.  The teacher and the creative, supportive atmosphere of the LUX Center made that a positive, memorable experience for me.  \nNow- about the galleries- I'd tour the displays each week when I was leaving class, and there was always something captivating. There were several different showings during the span of my class, and every one was enjoyable.  The pieces were well displayed, the shows were all very different from each other, the printed materials and artist's statements helping to understand the theme, or the meaning of a particular piece.  \n\nBy the way- the gift shop is fabulous.  ",
  "Lovely gallery in an old firehouse in University Place near Wesleyan University in Lincoln.   Very nice gift shop. An exhibit in the main gallery was Females, Fibers and Finesse which I thought was fantastic.  I visit Lincoln every year or so and try to visit the Lux gallery, check out the website, the back history of Gladys Lux is inspiring.",
  "The Lux Center’s First Friday featured 3 Native American artists. All 3 worked with mix media.  First, thank you to the Lux for having an art exhibit showcasing Native Americans.  It was nice to see minority representation from the artistic community.  I found the art displayed to be contemporary and thought provoking while still maintaining an ethnic feel.  There was another exhibit featuring ceramics. It was interesting to see how the artist incorporated wood as a way to display his ceramic pieces. I also liked how he was there to explain his pieces and how he came by his materials.  I was impressed with the fact of how he used wood from a shop in Omaha.  I am a strong supporter of the use of local and/or state resources. If any of the Native American artists had made an appearance, it wasn’t while I was there.  Besides the art exhibits, there was a nice selection of finger foods and drinks.  I highly recommend anyone who lives in or who comes to visit Lincoln to stop in here.  ",
  "I had an art requirement for college, and decided on painting 101.  I was 58 years old and no artist.  I wasn't looking forward to this at all, I was afraid everyone else in the class would be natural, accomplished artists who just had to fulfill a school requirement, so they chose Painting 101 for an easy A.\n\nWell, once again I was completely wrong.  There were 3 others in the class, and not one of them had any experience with painting, either.  Which was a huge relief.  \n\nThe teacher was teriffic.  She understood our collective anxieties about being crummy artists, and how intimidating a blank canvas can be.  She had us do small, training tasks; shadowing, orbs, mixing our own black paints and such, which got us used to the supplies and less nervous about using them.   \n Long story short- all of us well exceeded our expectations of ourselves. Two of us discovered hidden talents, and I did an exceptional (I believe, anyway) and instantly recognizeable Bob Marley, complete with dreads and Rasta hair beads. \nI had absolutely no idea I had that in me, and would have scoffed had you told me I did.  The teacher and the creative, supportive atmosphere of the LUX Center made that a positive, memorable experience for me.  \nNow- about the galleries- I'd tour the displays each week when I was leaving class, and there was always something captivating. There were several different showings during the span of my class, and every one was enjoyable.  The pieces were well displayed, the shows were all very different from each other, the printed materials and artist's statements helping to understand the theme, or the meaning of a particular piece.  \n\nBy the way- the gift shop is fabulous.  ",
  "while the emphasis will be on local artists - regional contributors are also represented.  Fun space in restored village city hall building (1914).  well curated to allow you to see a progression of an art style - one of the few galleries were the best part is the exit through the gift shop!  magnificent ceramics, paper, wood & sculpture.  ask about workshop schedules- you could throw a pot, make paper, etc.\neasy parking in rear of building",
  "We were on a family trip and this was fun for all of us--5 and 6 year-old grandchildren, me, and my 3 adult children. They assist you in creating fun art--we had a great time and had art to remember it. They also have a nice gift shop filled with art."
 ]
},{
 "name": "Saint Mary Catholic Church",
 "address": "14th and K Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/88/f0/98/saint-mary-catholic-church.jpg",
 "tags": [
  "art",
  "tour",
  "structure",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d8449747-Reviews-Saint_Mary_Catholic_Church-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "St Mary's is just a beautiful.  If you love architecture and art then definitely stop by for a visit.\n\nSt Mary's is located across the street from the Capitol building so include it on your tour.  It holds mass so if you visit be respectful of time and people.",
  "Stunning church with the capital nearby. Bring your camera, this place is a beautiful structure in Lincoln",
  "This Church is very neat outside and inside. Not too many areas to park when church is taking place, but it is a simple walk from downtown and right across from the Capitol!",
  "This church is right next to the capitol building and is close to UNL and the rest of downtown. It has many daily and weekend options for mass, confessions, and more. I go to UNL and I often utilize St. Mary's. ",
  "I am not religious but I can still admire the artwork and architecture. It was worth visiting. And it is conveniently located by the capital building.",
  "I paid a quick visit here after being at the State Capitol across the road. The church is outstanding from the road and inside it’s a great example of a traditional Catholic Church. The stained glass is great as is the organ. Fantastic. ",
  "Easy to find right across from the State Capitol, beautiful church, nice congregation and friendly priests",
  "Beautiful stained glass. Clean restrooms. A quiet place if you need to go there and just pray or meditate in peace. "
 ]
},{
 "name": "Deer Springs Winery",
 "address": "16255 Adams St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/65/7c/46/deer-springs-winery.jpg",
 "tags": [
  "winery",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d6078933-Reviews-Deer_Springs_Winery-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Deer Springs has both excellent wine (seriously) and the bread, cheese and sausage baskets that allow you to have a wonderfully intimate experience with a dear one or a group of friends. ",
  "Very nice for a mid-week get away. We had 2 tastings (5 samples each) and the bread basket, which is very ample, with local meat and cheese for about $30, including tax. ",
  "Band was great!  Had not seen them before and very happy we went.  The weather was beautiful which sets off the locale and the sangria slushy was excellent!",
  "We enjoyed friendly service, and most of their wine selection along with some cheese and crackers with our friends. Also bought a few bottles to bring home.",
  "we have had the pleasure of visiting The deer Springs Winery on two different occasions.  the first time was to try the different types of wine that they offered. we found two very nice types that we both enjoyed. our favorite is called wild Collen. they have live music on a number of occasions and outdoor seating around the grounds. they offer different types of bread and cheese baskets,or you can bring your own picnic basket to enjoy with a bottle of wine."
 ]
},{
 "name": "Hazel Abel Park",
 "address": "1716 E St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/c9/d8/d2/hazel-abel-park.jpg",
 "tags": [
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d117027-Reviews-Hazel_Abel_Park-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "I visited the park twice during my stay in Lincoln and I was very surprised how quiet place it is. You can enjoy the sun and reading on the benches, listening to the fountain...",
  "I’ve wanted to go here for a while, it was a nice warm fall day today so I thought I’d go. So happy I did. The park is close to the capital building with plenty of parking around the park. The park is well kept and very quite. (At least when I was there around 10am). There is a small kids play area and seating for the older folks. ",
  "This is a small neighborhood park. I love the gazebo and it is a nice place for a small, outdoor wedding.",
  "Interesting park by UNL campus where you can get lost in a garden with pretty architecture for a while. ",
  "A pleasant and unexpected green-space close to downtown Lincoln.  A pergola is nestled in the corner with a lovely fountain in the center of the park.  There are also swings and a safe play area.  All of this surrounded by a hedge and colorful plantings."
 ]
},{
 "name": "Lied Center for the Performing Arts",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "theatre",
  "drink",
  "free",
  "performance",
  "art",
  "theatre",
  "drink",
  "music",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d126552-Reviews-Lied_Center_for_the_Performing_Arts-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great evening for theatre. The drink line was long but luckily the restroom line was fast.  Great venue for a night of theatre.",
  "Attended Lincoln Symphony performance Friday night. Richard Fountain was featured pianist in Shostakovich Piano Concerto No. 2, in addition to the other works. \n\nGreat venue, great bargain for fine arts.\n\nWe had never been there before. When we got to our seats there was a little invitation taped to one of the arms inviting us as new patrons to visit their table at intermission. Got a free CD as a special gift - smart marketing. We'll be back to visit our daughter from time to time and will be looking to coordinate visits with events at Lied Center!",
  "I have attended 7 shows in 2 years and I am amazed at the quality of the shows. The staff are super friendly (it is Nebraska).  The production of Cinderella was simply the best ever.  They had a pit orchestra and the sound was amazing.  The stage is a good size.  The tickets are a good value.  The problem.... the seats.  I am a tall, wide shouldered gentleman with some extra weight.  If I get another larger person next to me - I can expect to sit there with shoulders hunched and legs crossed most of the time.  This can be painful after 2-3 hours.  Getting an aisle seat helps - they seem to be a little larger",
  "We saw a play in the main stage and a musical in the Carson Theater both very comfortable and with ease of access. Lots of parking in near by ramp or walk-able from many hotels. Facility is in very good condition.",
  "Easy to park near here, beautiful, and you can take water in with you even - nice!",
  "We attended a reception in the Lied Commons, located on the ground floor of the Performing Arts Center, overlooking Sheldon Art Museum and Sculpture Garden.  This space is beautiful, and the appetizers and buffet dinner served were outstanding.",
  "Our granddaughter's high school graduation ceremonies were here last Sunday.  The seats were very comfortable.  Our view from the 3rd floor balcony was perfect.  I use  a wheelchair, so one of the ushers took my husband to show him possible places for all of us to sit.  He was very kind and took great care of us.  Found us a perfect spot where I only had to manage 3 steps.  Super nice facility.",
  "Great evening for theatre. The drink line was long but luckily the restroom line was fast.  Great venue for a night of theatre.",
  "We paid almost $800 for Monty Python’s Spamalot, and missed 70% of the spoken words due to acoustic limitations. Lyrics with music were better, but from our seats in the balcony it was a bust,",
  "a few night ago friends and our family went to hear a well known group of performers   , here..although we paid a good price for the tickets I won't be going back as sound quality for the balcony was poor and the seats were much smaller than comparable venues.If you chose seast carfully ."
 ]
},{
 "name": "Gateway Mall",
 "address": "6100 O Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e0/0c/1e/gateway-mall.jpg",
 "tags": [
  "delicious",
  "kids",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d7319791-Reviews-Gateway_Mall-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "Difficult to find a decent store. Sporting good store is all anyone cares about. Good stores left long ago. This was a great place in the 1970s. Left the city for 30 years and came back to find the 'mall' not at all what it once had been. I try to stay away from this place. ",
  "Had lunch with my colleague at the restaurant situated in the mall. Tried the bunnychow it was delicious and the waiters were friendly and helpful",
  "My kids enjoyed the playground on our short trip to Lincoln. It was easy to find with all the signs hanging in the mall.",
  "Gateway has a great variety of stores to chose from, great for grabbing some after Christmas sales. Loved the Dilliard's and Sears. Busy place but a great day at the mall.",
  "We really enjoyed shopping at Gateway Mall.  It's filled with stores with mid range prices.  (Think JC Penney, Dillard's)  It's fairly large and has lots of stores.  The food court had a nice selection of restaurants.   It's a great place to shop."
 ]
},{
 "name": "Haymarket District",
 "address": "335 N 8th St Ste B",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/77/2b/5c/who-doesn-t-love-a-good.jpg",
 "tags": [
  "historic",
  "walking",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g45667-d17295269-Reviews-Haymarket_District-Lincoln_Nebraska.html",
 "source": "TripAdvisor",
 "reviews": [
  "A must see historic district alive with nightlife, restaurants and bars. Really hopping on Cornhusker football game days!",
  "This area has such cool shops, bars, coffee shops, stores, hotels, etc. Lots of variety. They also have a really cool train engine to get pics with. I really liked their fun mural!",
  "I didn't know what to expect when I was heading to the Haymarket District when visiting Lincoln. I expected the typical town centre, but Haymarket is different. :)",
  "Wear your walking shoes.  A great way to spend a day- lots of shops and restaurants.  Great for pedestrians.  Close to Pinnacle Bank Arena, Lincoln Station, much, much more.",
  "I remember when this area was nothing but an old depot and some old warehouses, but oh how times have changed. \nThis area is thriving with plenty of restaurants, pubs and a few motels. The area is the place to be before a sporting event or concert. The area attracts large crowds of people so expect to have to wait to be served at many establishments. \nThe Haymarket area is kept clean and and the area is safe to stroll through any time of day or night. There is metered parking on the street and parking lots in the area. If you are visiting on a day of a special event, I would suggest parking in another area downtown and walking to the Haymarket. Memorial Stadium is a short walk and the Pinnacle Bank Arena is in the same area.\nI was actually surprised to see so few reviews for the Haymarket. All the establishments in the area have many reviews so if your looking at a specific business, you should be able to find plenty of reviews. \nIf you are traveling to Lincoln to watch a Husker football game and you are supporting the visiting team, rest assured that you're welcome in the area and will have a good time. Yes, there are jerks everywhere, but Huskers fans are very respectful and happy to have opposing fans travel to Memorial Stadium."
 ]
}]
