[
{
 "name": "Pinnacle Mountain State Park",
 "address": "11901 Pinnacle Valley Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/90/05/8c/on-a-clear-day-you-can.jpg",
 "tags": [
  "hike",
  "hike",
  "nature",
  "kids",
  "parks",
  "hike",
  "active",
  "family",
  "hike",
  "hike",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d106702-Reviews-Pinnacle_Mountain_State_Park-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are visiting Little Rock and enjoy hiking you got to visit the pinnacle mountain. There is a base trail around the mountain which is an easy hike. If you would like to go up the mountain there are two options: a) west side- moderate difficulty with some rocky section near the top. B) east side - this one is a challenging hike there isn’t really a trail and most sections are rocks/boulders. I would recommend to do This only if you know your way. \n\nOnce you reach the top you will be rewarded with the beautiful views of the valley. Pro tip: go early morning and watch the sunrise.",
  "Beautiful state park with excellent facilities and programs. Great hiking trails, river access, visitor center and of course the Mountain which is fun to climb, with beautiful views of the Arkansas River Valley and Lake Maumelle.  Super playground for children. Can be crazy crowded in nice weather. Close to the city.",
  "Great hike to the top of a pinnacle overlooking the Arkansas River.  Can be somewhat strenuous. Also great hike along a swampy area and a wooded area.  Nice children's playground also.  Also Arkansas River access",
  "Well marked trail starts with a couple of short switchbacks through the woods and then the rock scramble to the top begins.   Great views on the trail.  Go early if you can as the west and east trail meet at the top and was busy during the lunch hour.",
  "Central Arkansas has the advantage of having a nice metro area (Little Rock) surrounded by nature trails, parks and other outdoor recreation.  Pinnacle is popular with the locals for outtings and exercise.  There are several paths leading up the mountain and the view is magnificent at the top.  It can be challenging for those that may be lacking a bit in fitness, but it is doable and worth it.  The park has picnic tables and a ramp for canoes and kayaks on a smaller stream.  There is also a play area for the kids.  Usually very busy on nice Saturdays, so if you are looking for less of a crowd, go in the morning or on a weekday.  If you plan to get to the top during AR spring or summer, be sure to bring some water.  It can get very warm.",
  "We have hiked this mountain on several occasions.  It is certainly a great workout and has a lovely reward at the top.  The panoramic view is one of the best we've seen in the state.  We've also seen eagles flying around the mountain more than once, which always adds a little extra something.\n\nI do caution though, choose wisely before ascending.  There are two trails which will get you to the top of the mountain.  The West Summit starts at the picnic area and is the more popular hike.  This is a somewhat difficult climb (perhaps very difficult, depend on your usual level of activity). It starts rather gently but the last half requires longer, taller steps as the trail changes from stair-like rocks to shallow, shaky boulders.  Even our very active pup laid down on a rock for a break half way up.  \n\nThe East Summit, however, which starts at a much smaller parking lot on the opposite side, starts like a typical hiking trail, but changes rather quickly.  I would recommend this side for experienced hikers/climbers only.  The last markers actually take you through a trail of massive boulders which are probably best tackled using both hands and feet.\n\nWhen you reach the top, via either trail, you have the option to go down the way you came or choose to descend the opposite summit.  If you choose not to retrace your steps, the two summits are connected at the bottom by the \"Base Trail\" but this will add roughly an hour or two to your hike.\n\nRegardless of which trail you choose, be sure to wear sunscreen, and bring plenty of water, a healthy snack (for a break at the top) and your camera!",
  "This was our first family hike ever with my wife and 3 children.  My 6 yr old daughter and 4 yr old daughter made it to the top and back down on a foggy, misty day with slightly wet rocks with no help but I carried our 3 yr old daughter the entire 1.5 mile roundtrip.  There are markers numbered 0 to 10 to track your progress.  This is a challenging hike with lots of rock steps and the top 1/3 is almost all rocks and I was honestly surprised my daughter's were ae to do it and didn't complain.  It took us right at 2 hours to go up and back down with down being more challenging because of the steep damp rocks. Luckily we really had no slips or falls but I kept reminding them to step on flat rocks and pay attention.   My girls really enjoyed it and the only down side is that it was foggy the day we went to instead of having a view at the top we got to taste the clouds.",
  "A fantastic and challenging hike.   The view is worth every step it requires to get to the top.  Not a trail hike, requires the ability to climb up small rock formations.   ",
  "Beautiful hike! Breathtaking views. Took 3-4 hours to do entire loop. We just in the morning and it was really quiet, not very many people on the trail, which was nice. \n",
  "We hiked the West side of the mph rain up to the pinnacle. It was a moderately challenging hike with bouldering required on the final 1/3 of the ascent. Beautiful views! Worth the hike!",
  "We visit the state park from time to time, usually at a gathering for a car show or retreat. It is a wonderful opportunity to see the Arkansas River Valley which is the terminus of a vast watershed that originates in the foothills of the Rocky Mountains. The elevation allows a vista that is unforgettable. We have seen its origin in the Rockies and here we see its final extent. Plus, in the summer it is a nice retreat from the heat and humidity."
 ]
},{
 "name": "Little Rock Central High School National Historic Site",
 "address": "1500 S Park St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/4c/1d/20/little-rock-central-high.jpg",
 "tags": [
  "history",
  "walk",
  "tour",
  "walking",
  "history",
  "history",
  "walk",
  "family",
  "kids",
  "tour",
  "learn",
  "history",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "free",
  "historic",
  "history",
  "learn",
  "active"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d106709-Reviews-Little_Rock_Central_High_School_National_Historic_Site-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was the highlight of our trip with high school aged Girl Scouts.  It is a beautiful high school with reflecting pond   in front, and the Visitor Center contains a wealth of information about the integral role that the Little Rock Nine played in the Civil Rights movement after Brown v. Board.  My scouts are about the same age as the Little Rock Nine were during that time.  Seeing the school and the visitor center was an important lesson for the younger generation and a poignant reminder for the older generations.  We definitely recommend for all ages and would visit again if in this area.",
  "The visitor center is fantastic, and gives the history of the events surrounding the decision to send US Army regular soldiers to Little Rock to ensure the integration of Central High.  The school itself is a great example of scholastic architecture from the post WWII era.",
  "We did a tour of the high school with Ranger Randy, and wow were we impressed. He did an excellent job of laying out the historical context and assisting us all in imagining ourselves inside the story to think about the impact of what happened here. Taking that walk along the street, remembering the history, walking up those steps and through those doors was powerful! Little Rock Central is an important historical site, and I am very thankful that the National Park Service is able to teach this history while co-existing with the still operational high school.",
  "Not in the best part of town but it is great place to see some history. Beautiful grounds and easy access.",
  "My family of 5 (kids 14, 12 and 9) took a ranger led tour on Monday, March 9th. We didn’t realize this tour was 90 minutes and I’m glad that I didn’t know beforehand. I think I might have shied away from it thinking it was too long for my youngest. She did great. We ended up on a tour with a high school group from Dallas. The tour was very informative while also engaging. This is such an important part of history and such a big lesson for our children to learn about. I loved that we were able to walk from the visitor’s center to the school. Our Park Ranger talked about Elizabeth’s walk from one bus stop to the other and by being outside and being able to visualize it was sobering. \n\nOut of all the things we did in Hot Springs and Little Rock this is the thing my 12 year old talks about the most.",
  "Such a tumultuous and confusing time in history. It’s a very important stop whether you are a history buff or just a human being. Informative but not over done. Such a beautiful school as well. ",
  "We attended the tour offered but the National Park Service. The tour starts at the nearby Visitors’ Center, continues across the street to the school and ends in the school auditorium. The guide was super knowledgeable, and gave a dramatic retelling of the events that took place there in 1957. Operates on school days and students are present going about their school day during the tour. Tour requires a reservation, is free and is not handicapped accessible (stairs to climb to get into the school). Very worthwhile look into a sad time in our history. ",
  "A must see location for a turning point in US History.  The only high school listed as a national historic site and still an active high school.  Today's students (all levels) should come here and learn a few things about race and the constitution."
 ]
},{
 "name": "Big Dam Bridge",
 "address": "7600 Rebsamen Park Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/e1/90/34/big-dam-bridge.jpg",
 "tags": [
  "walk",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d1831458-Reviews-Big_Dam_Bridge-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "A little bit of a drive but fun to walk across. Lots of people fishing nearby. Good little day picnic or night walk.",
  "Excellent venue for cycling. An up ramp to get cardio moving then terrific view over the river ending with a speed cycle down to the other bank. An outdoor excursion exercise communal urban treasure.",
  "A Big Dam Bridge to enjoy the Dam. Anyone can walk or bike on the the Big Dam Bridge.\n\nWe could stay as long as we wanted and see how the dam works. It is free.\n\nI really liked my time here. It was worthwhile.",
  "Cloudy day, perfect views from the trail. Perhaps because of the corona panic this was a popular spot today which was great to see. People were jovial on the trail and lots of dogs on leashes with their humans out enjoying the day. ",
  "Walkintg along the paths and up the bridge are an exhilarating and peaceful experience.  You can see for miles at the top and the sound of the water from the top cannot be beat.  My favorite spot there is close to an old boat ramp where there is a parthway that leads to nowhere."
 ]
},{
 "name": "William J. Clinton Presidential Library",
 "address": "River Market District 1200 President Clinton Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/53/0a/5e/william-j-clinton-presidential.jpg",
 "tags": [
  "library",
  "tour",
  "library",
  "free",
  "history",
  "library",
  "history",
  "library",
  "tour",
  "library",
  "walking",
  "food",
  "walk",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d509012-Reviews-William_J_Clinton_Presidential_Library-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "President Clinton will always be one of my favorite Presidents so I especially enjoyed visiting this Library and learning more about his eight years at the White House.  I thought the Library was done well and presented in an easy way to follow.  Would go back to visit.",
  "We really enjoyed the layout and style of this library -- it's much different from other Presidential Libraries we've visited.  There's far more technology including a free download-able app that allows you to enjoy an excellent self-paced audio tour narrated by President Clinton.  The temporary exhibit during our visit was on Nelson Mandela and was quite well done.  ",
  "This museum is a Must-do for locals and for visitors to Little Rock. It chronicles the history during his presidency with film, video, timeline, replica of the Oval Office at Clinton's time and meeting room, and ephemera from celebrated White house visits from dignitaries, celebrities, and the like as well as personal items(saxophone collection).It is presented in a beautiful contemporary open space. Plan on spending  about 2 hours for a  memorable piece of history ",
  "I'm not a huge Bill Clinton fan but I have been to several presidential libraries.  The museum overall was what I expected with the exhibits. What was different about this library was the individuals working it. All of them, from the greeter to the cashier to the guides were so friendly.  They made me laugh and joked around with me and I felt welcomed. The grounds are beautiful too. ",
  "Really enjoyed visiting the Clinton Presidential Library and revisiting that time period in history. The displays were well laid out and thoughtful. We particularly enjoyed the 90’s exhibit that showcase the culture of the times. ",
  "Interesting to know more about the Clinton s legacy  \nI had a very guided tour and lunch in the restaurant. The restaurant is very good. \nIf you don’t want to see the library, you still have lunch or diner here. Nice situated at the river",
  "Worth an afternoon. Nice open layout. Easy to navigate. Despite remembering a lot of that era, it was great to be reminded of lasting accomplishments like FMLA. \n\nGrounds are nice and the adjacent walking bridge over the river is quite nice for some exercise. The restaurant was good for lunch with good food, service and nice views.",
  "Interesting walk through the life of Bill and Hillary.  Number of exhibits regarding the Clinton years in the White House. They have a replica of the Oval Office that is interesting. The staff is helpful and knowledgeable. Not sure what I was expecting but it was underwhelming and I am not sure I would pay to do it again."
 ]
},{
 "name": "Riverfront Park",
 "address": "1 Riverfront Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/8d/a2/43/junction-bridge-a-footbridge.jpg",
 "tags": [
  "walk",
  "walking",
  "music",
  "performance",
  "walk",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d591292-Reviews-Riverfront_Park-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great walking around area.  Good restaurants, music and people.  Parking is terrible if there are any events going on, and there usually are, best to walk into the area.",
  "This park has a lot of potential however, there are a lot of homeless people sleeping on or near the playground which is a bit unnerving to parents and grandparents. The river and the bridge crossings are beautiful.\nDo not leave children unsupervised as there are a lot of rocks and craggy edges in this climbing park",
  "Riverfront Park is a needed oasis in downtown Little Rock. The park provides opportunities to stroll and take in the grandeur of the Arkansas River. Scattered throughout the park are many pieces of sculpture, historical markers and beautiful landscaping. The amphitheater provides performance space for concerts and public events. The Junction Bridge was been converted to a pedestrian walkway and provides the opportunity for views up and down the river. Don't miss the marker describing the story of the 'little rock' and the origin of the city name. The adjacent River Market district has numerous restaurants, galleries, shops and museums. This area has undergone a much needed revitalization in recent years and can easily provide a full day of entertainment.",
  "Great place to walk around and get some photos. There is an elevator to the top of the bridge. Good stop!",
  "My granddaughter from out of town had so much fun here. She wanted to do a photo shoot from all the great locations in that area.",
  "After touring the submarine the USS Razorback, we crossed the walking bridge and played in the park.  It was a fun, relaxing afternoon.  Our party had one adult and kids/young adults ranging from 5-23. All enjoyed the bridge and park.",
  "When going through or staying in a Little Rock, we always visit the waterfront. Beautifully landscaped and great hiking. This evening the fog was hanging over the bridge!",
  "It finally stopped raining so we went at dusk. So pretty! So much to see with sculptures, monuments and the bridge. The park is wonderful for kids!"
 ]
},{
 "name": "Rock Town Distillery",
 "address": "1201 Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d4/32/c5/tours-are-a-fun-way-to.jpg",
 "tags": [
  "tour",
  "tasting",
  "tour",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "tasting",
  "tour",
  "tour",
  "tour",
  "history",
  "drink",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d4040780-Reviews-Rock_Town_Distillery-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wonderful tour of the distillery showing you the distilling room bottling and labeling lines. Jade our tour guide had lots of interesting information about making the product and was with us in the tasting room helping us with helpful tips to select ones we would like",
  "Trent did a great job throughout the tour. He was fun and we learned a lot. The tasting was great. We were able to try a little of everything and he was very knowledgeable as to what to mix it with and gave us ideas. ",
  "We were looking for something to do on our way out of the state after spending the weekend rock and crystal hunting.  We wanted something a little more mellow to do.  The staff at the distillery were knowledgeable and fun to talk to.  The tour is $7 per person and lasts around a 1/2 hour.  You can take pictures and ask all the questions you want.    They strive to use as many local ingredients as they can and it's a very small operation -- feels very local and friendly.\n\nAfter the tour, you get to sample any of their products -- we went through the gins, whiskys, bourbon, vodka, and moonshines.  Anything that wasn't part of the normal tasting you could ask for and sample.  If you're not careful, you can get pretty toasty during the tasting so have a designated driver or a way home.    There are some samplers for purchase in the gift shop along with some clothing, glassware, gift boxes, and treats.  My favorite items were the Grapefruit Vodka, Coffee Liqueur, and 40 proof Apple Pie Moonshine.  The Basil Vodka would make a spectacular Bloody Mary too ;)\nThe tasting portion lasts around an hour(ish) depending on how many people are in your group.\n\nWe had a super fun tour group and great tour guides.  We are looking forward to taking some friends down there next time we are in town.",
  "Wonderful tour of the distillery showing you the distilling room bottling and labeling lines. Jade our tour guide had lots of interesting information about making the product and was with us in the tasting room helping us with helpful tips to select ones we would like",
  "Stopped in here while in SoMA for their Mardi Gras parade while in town on business.  They offered some cool specials drinks with whiskeys and bourbons made here. Although no tours were offered on the day I was here, they are available, as well as tasting.  Large room with lots of tables for seating - and at the bar. Small gift shop inside. ",
  "Great and informative tour. Paige did an awesome job. Thanks for the lesson!!! A must do if you are in Little Rock.",
  "My friend and I did a tour at 2 pm. Jade was an awesome guide and equally outstanding bartender. Abby also was an adept and most friendly bartender.  They have a solid vinyl collection and Christian put Sgt Peppers on for us. The experience was also filled with flavor. The spirits were truly amazing. We will be back! Rock Town  rocks!",
  "When Stephanie, our spirit guide as it says on her shirt, met us to begin class I knew it was going to be good because she was energetic and welcoming off the bat. Showing us first the wall that gave information on the founder choosing his passion as his career path diverged, she then excitedly spouted off their awards on the adjacent wall. \n\nEntering into the room with all the barrels she shared how the different gins, bourbons, whiskies, and vodkas were made and an idea of the composition of each type. Meandering our way to the fermenting room she had lots of intricate details to share to explain all the machinery down to the juniper berry component. \n\nDuring the cocktail making class she was a wealth of information on the history from sailor ships to prohibition to more contemporary makings of the drink as well as regional differences. Look, she even made their ice an interesting story. \n\nThis tour was upbeat and definitely worth the money and time. I highly recommend it as a couples outing or just something to do if you are at home and want to get out to do something unique in Little Rock. \n\nYou can leave with some grapefruit vodka or a bourbon creme or a plethora of other smooth libations. Ask for Stephanie, she will help you pick the right one so that you can go from class to your own glass. "
 ]
},{
 "name": "Museum Of Discovery",
 "address": "500 President Clinton Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/18/de/14/museum-of-discovery.jpg",
 "tags": [
  "kids",
  "learn",
  "kids",
  "learn",
  "kids",
  "nature",
  "library",
  "free",
  "creative",
  "walk",
  "kids",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d581027-Reviews-Museum_Of_Discovery-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We've visited on a number of occasions. We did visit more frequently when the kids were in elementary school. We touch and feel and build and pet until we can't take any more. I LOVE that the museum's own, Kevin Delaney can be seen periodically on the \"tonight show\" with Jimmy fallen. He's so cool and good with the kids and now the entire nation knows. Many ways to learn while having fun here, too. It's a win if you want something cool to do indoors on rainy days or hot weather. Everyone will love it. ",
  "This is a good place to take your kids and let them play and explore and learn about science. There are plenty of fun activities to keep the kids busy and cool interactive experiments.",
  "Great museum that offers many hands-on activities for kids of all ages. There is an area upstairs just for kids 5 and younger. Down stairs there is a tinkering studio where kids get to take apart and build lots of fun crafts and there are lots of cool animals to check out.\nOverall it's a great museum in the heart of downtown Little Rock, with lots of places nearby that you can wlak to for lunch.",
  "Took my four-year-old grandson here last week. After using up our two-hour public library parking time, we drove to the midtown Pizza Cafe for lunch, then back downtown for another two hours of fun. His favorite parts were the Pet Clinic and the Bed of Nails, which we kept coming back to. Also, the karaoke room (Old MacDonald) and a soft playground surrounded with netting to bounce around on. A few educational parts captured his interest, too--a dinosaur exhibit and anatomy display. A few of the science gizmos weren't working, and the place shows minor wear and tear, which is to be expected. However, it was an engaging place to spend the day.  As an added bonus, the Stephens Nature Center is nearby with free admission. Be aware that parking is a challenge since the River Market District is one long congested street, President Clinton Avenue, with no side streets to park on. However, there is indefinite free parking a few blocks away at the Clinton Library on the east side of the district. Also, if you have a public library card, you can park in their lot for two hours without having to pay.",
  "The children loved it. Lots of variety in the exhibits.  Lots of exhibits.  Very easily spent over two hours. The only minor frustration was that a few of the exhibits didn’t work. ",
  "A fun place to spend a rainy Saturday morning with the grandkids. Lots of creative learning. Be sure to see the Tesla coil demonstration!",
  "I really had fun and my 4 year old had a blast! Loved the live demos, especially the Tesla machine. Limited room so be quick when they announce. The live animal demos were cool too.  Spent about 2 hours and could have spent more but we were hungry and they only have vending machines, but the area is filled with restaurants.",
  "Visited this museum with my 19 and 10 year old kids! The museum is ranked as the 6th best science museum in the US by MENSA. Side note-Can you believe that my kids were so engaged that they didn’t argue at all! The exhibits and activities are beyond awesome. It’s also a short walk from the Clinton Library and many eateries!   Discounted rates for educators, just provide your school e-mail! Do yourself a favor and go have some fun. This place allows a kid to be a kid!"
 ]
},{
 "name": "Arkansas State Capitol",
 "address": "Woodlane & Capitol Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/0a/c1/68/arkansas-state-capitol.jpg",
 "tags": [
  "unique",
  "walk",
  "historic",
  "history",
  "tour",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d144366-Reviews-Arkansas_State_Capitol-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful building with spectacular marble staircases and exceptional stained glass domes in the house and senate wings. Also a chance to hold $1,000,000 in the working treasury vault was a unique experience. Very kind and courteous guides make you feel welcome.",
  "If you have never been to Washington D.C. and want to see a miniature replica. Well, Little Rock's state capital is the place for you. It looks like the national capital but on a smaller scale. It is open to the public and you can see the beautiful rotunda from the bottom or take a few flights of stairs and see the states original Supreme Court and then look back down to the bottom floor. Lots of wonderful statues and tributes to fallen soldiers are located on the state grounds. The monuments to the Little Rock nine is something everyone should see if they visit Little Rock. It is a true walk back in time to see.",
  "I'm currently visiting all 50 of America's state capitols and collecting the stamps in the Capitol Collection book.  It's a fun thing to do as I am interested in history, politics, and architecture.  Having been to many of the capitols already, I have to say that Arkansas's is one of my very favorites.  All of the capitols are historic and interesting, and most are quite grand, but this one is unusually beautiful.  From the elegant house and senate chambers, to the governor's reception room, to the very formal, neoclassic rotunda, this is a tremendous building.  It is well worth a visit.",
  "It is massive. There is a cupola at the top and a crown,made by gold.\n\nIt is hard to find a parking place.\n\nThere are a lot of windows.\n\nThey have lights at night.\n\nI really liked that",
  "My favorite place to go visit. The building is the most beautiful Capitol I have ever visited. Lots to see in this building and don’t miss out on the grounds.",
  "We took a great guided tour here. Cheryl, our guide, was wonderful. She is very personable, was able to answer all our questions, and she knew everything about the building, plus having great stories. We were a small interested group, and we had a good time there.\nThe building is very white inside and out with just a few art pieces, and some nice chandeliers.\nWe have been trying to visit all the capitol building, and this was our 40th.",
  "We try to see every state capital of the states we have been to and this one was well appointed. Security on entry was not a problem.",
  "Our Korean Visitor was more interested in obtaining picture of himself in front of the statue on the north side of Woodlane, to show his friends back home.  This was on New Year's Day 2020.  I've been to the Capitol many times over the years.  It was cold and my daughter took the picture of him in front of the statue.  We drove to many other places that day, for her Korean friend to take pictures."
 ]
},{
 "name": "River Market District",
 "address": "E. Markham St.",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0b/5d/40/little-rock.jpg",
 "tags": [
  "walk",
  "library",
  "food",
  "parks",
  "food",
  "walk",
  "free",
  "delicious",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d144370-Reviews-River_Market_District-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Having lived in the Little Rock area for over 25 years, I have a historical experience with the creation and environment of the River Market District. Historically, I am an eyewitness to the conception and creation of the area. \nThe River Market District with its milestone enclosed Pavilion is a small scale concept borrowed from the San Antonio, Texas river walk area. The geographic area where the River Market District exists was on a street full of old, dilapidated warehouses and abandoned buildings. Historically, the buildings existed there since the early beginnings of Little Rock. The effort was to refurbish the area into a \"village\" of food, entertainment, and social recreation. Coupled with the building of the William Jefferson Clinton Presidential Library, the Arkansas Game & Fish Commission Center, and the Heifer Project Building nearby, the area took on new life nestled beside the glorious Arkansas River. \nThe Pavilion features foods from many international aspects and local flavors. The areas around the Pavilion consist of bars, gift shops, museums, libraries, parks, and other spots both designed to entertain families or for social gatherings for the night crowd. \nThroughout the year various festivals and events are held in and around the Pavilion. \nThis is truly a wonderful place to visit and come back to again and again.",
  "This is a very nice area of Little Rock, with the River Trail passing right through it. When we bike the trail, it's fun to stop off at a restaurant in the River Market area to have a quick, light lunch. The Farmers Market is held in the River Market pavilion from about April-October. It's especially fun to visit it on Saturday mornings.",
  "The LR River Market is about a 15 year old investment in downtown LR. Your have very high end restaurants (Cache and Sonny Williams) to mid range and below. Gus's Chicken is some of the best you will find, Buenos Aires and a great new addition to the River Market. The Flying Fish is a huge local favorite along with the best breakfast in town at @ The Corner. The restaurant in the Capital Hotel will rival any upper end spot and the Capital Bar has great food and drinks as well. If you are visiting LR, you must stay in a downtown hotel, it is where all the fun is. Several Museums, bike riding and the river is right there.",
  "The trolley is free and there is a bunch to do. Shops, restaurants, ice cream, museum. Take a day and walk around!",
  "Went here twice. Had pizza with my daughter at Jay's pizza, it was ok. The wait was long, 20 minutes but there was a sign. Bea Blessed Bakery was awesome!! The ladies working the counter are super friendly. I had a delicious peach fruit pie and my daughter, who doesn't enjoy pecan pie, had a piece and absolutely loved it. ",
  "I was down there on a Sunday and was surprised at how aggressive the homeless panhandling seems to have gotten.  I was there mid afternoon and on practically every corner I was approached for a handout and, in three instances when I declined to give them something, was accosted verbally.  I worry about the plight of homeless people and can only imagine what their lives are like.  However, I would think the aggressive nature I encountered would deter people visiting the area.  Even though there is a substation there I never saw a single member of the LRPD.",
  "This place is really good for Little Rock, offering a variety of shops and restaurants. Unfortunately, some of the inside establishments are closed on Sunday. However, there are other ones open in the District. There is parking on street or in garages. ",
  "I love the River Market area. Went down there today to get some Christmas presents. Found what I needed. I do wish there were a few more shops."
 ]
},{
 "name": "Esse Purse Museum & Store",
 "address": "1510 Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/9a/ab/9c/the-mural-facing-our.jpg",
 "tags": [
  "walk",
  "free",
  "history",
  "historic",
  "history",
  "unique",
  "history",
  "free",
  "kids",
  "creative",
  "historic",
  "history",
  "organized",
  "walk",
  "eat",
  "unique",
  "tour",
  "history",
  "tour",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d4465876-Reviews-Esse_Purse_Museum_Store-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a hidden gem, this was so much fun to do with a girlfriend! It's not a large museum, and doesn't take to much time, but they did a great job of taking you thru the decades. It's much more than just handbags to see. When we got to the 70's & 80's we had so many memories!  We walked thru then backtracked and found so much we missed on the first walk thru. Cost was $10 for adults, I thought a bit high, but the owner really amassed a great collection.  If that wasn't enough,  they have a great gift shop, good luck getting out without buying one or two. If your an out of towner they will ship your purchase home for free. Which we took advantage of.  Enjoy the walk down memory lane!",
  "I loved, loved, LOVED this museum. The collection is huge and eclectic, and at the time I was there, there was an exhibit of undergarments, which was neat to see. The museum uses accessories to tell women's history, with a display case and explanatory sign for each decade of the twentieth century. I learned a lot! There's also a great gift shop with a huge selection of purses and other items, and the people working there were great--Carly greeted us and gave us a little introduction to the collection, then left us to explore on our own. The posted hours did vary from what was on the website, so I would double-check that before you visit. But definitely, do visit!",
  "This is one cool place.  The permanent exhibit, which displays purses through the 20th century, also gives a brief history of each decade AND what women of each decade would have carried in their purses.  The items in the purses are so much fun!  You'll see the things your mother and grandmother carried with them.  Depending upon your age, some items may revive memories from your younger days.  Regardless, you will be entertained.  And you will be amazed by the incredible collection of purses and the various materials the purses are made of.  The museum also hosts fascinating temporary exhibits ranging from historic footwear to historic bathing attire.  The gift shop offers tons of purses and a wide variety of unique gifts for sale.  I doubt that men would enjoy this little gem, but women will love it.",
  "The history of American fashion is captured by the displays of women's handbags throughout history. iconic designers and homemade treasures are all on display. It is a small museum, but it is worth the trip.",
  "I'm a local, and heard about this museum.  Thought wife would like it.  Had a few hours to kill one afternoon and suggested to her that we go.  Really nice experience.  Staff was great and very helpful.  Admission is charged but is very reasonable.  It's really about the evolution of women's attitudes as expressed through their handbags.  Very nicely done.  You can see the whole thing in under an hour, but take your time anyway.",
  "I was trying to think when the last time a small city had the good fortune of a private citizen building and operating a museum, particularly one of high quality. The numbers you might recall might be counted on one hand. Little Rock is undeniably fortunate to have a benefactor who has done this, taking a lifelong collection, building a gem of a museum around it, and opening to the public. In a repurposed building, along a street recently reenergized with interesting shops and cafes, the Esse Purse Museum currently has a chronologically organized history of American women's fascination with the hand bag during the 20th Century; and also houses a temporary exhibit for the next 60 days, of a similar collection of women's hats. With the purses comes a narrative and accompanying exhibitry which explains America during each decade - our work, recreation, our challenges and our successes, all interpreted through the handbag...and often all the things which spill out of the bag. There are snapshots and handerchiefs and wartime remembrance and much more. The museum appeals therefore not just to those who like style and design but to the historians in each of us. At first I was confused about just whom I should recommend to visit this museum. Women would seem a natural to enjoy Esse, but I soon was reminded that I liked it too... and I realized that guys like me with an interest in our country's history would find it interesting. I believe teen and preteen girls would definitely fall for Esse, but as to younger children and most boys?... I really do not know. I want to say one thing about the design of the exhibitry before I forget...this is no amateur installation. The cases and display design would match decorative arts museums of New York and major European galleries. There is one more draw to the museum. Aside from the very impressive Historic Arkansas Museum gift shop , the Esse shop is easily the best museum shop in town and probably the most interesting jewelry display I've seen in the state.  I'm headed there for Christmas shopping. Don't be put off by some $1500 purses for sale, there are plenty of very unusual things there for ordinary budgets...which brings me to the only issue of the museum, admission cost. Unfortunately, the owner, though hugely generous in opening this fine facility for the public's pleasure, does not have the means of Alice Walton, and must charge to keep the museum up and running. There are no city subsidies available, thought here probably should be. The $10 entry fee (discounts for students and seniors and small kids free) can be off-putting to travelers on a budget. However, when you figure a mediocre lunch or a movie can approach that, I can safely say that there is nothing mediocre about this experience. I got my money's worth, but I'd like to see the owner explore various ways to bring more travelers and locals to the museum for less cost. I anticipate creative changing shows here, and cutting edge ideas in the future. This is the kind of place which puts our town on the map and I'm hopeful it receives much support. I'm just wondering if they let bag ladies in free.",
  "The museum is about a 20-30 minute walk through of purses and what was in them through the 1900s and then the store attached sells lots of unique purses, wallets, jewelry etc! Visited here with my mother (26 yo + mid 50s) and we loved it! Spent about an hour or so in the shop + museum and then visited The Root next door for a bite to eat!",
  "Without a doubt, the Esse Purse museum should be on the short list of Things To Do in Little Rock. We flew in from New York to see Waitress (musical, national tour) and only had a single day to tour around. What we found was so much more than just purses, but a decade by decade overview of societal development, and how purses fit into the evolution in ways you never considered.  All facets of history were covered with explanatory panels of text (10 decades worth) supported by thousands of actual pieces of history in the cases, all in support of the overall narrative.  Photographs, receipts, tickets, lockets, fashion items... there is no way I can do it justice in my description. My wife and I were blown away, as were our companions. A side exhibit room on the 1970's provided a virtual time travel to our collective past.  And the women running the shop were as friendly, engaging, and obviously proud of the entire establishment as they could possibly be.  Give yourself time to absorb the details and the workmanship involved in the purses themselves, all the supporting items in the cases.  This is truly a world class museum!",
  "What a great place to rent for an event. Went to my nieces shower and had a fun time. Got to have a tour of the museum. \nI would definitely recommend the place.",
  "What a great way to look at history - yes, there are purses - lot of purses but there are other items that also tell the history of our country.  There is also a shop where you can purchase purchase, jewerly, cards, etc.  There is a senior discount.  The staff is great - so friendly!",
  "A purse museum is only the beginning of the description. It’s a terrific history lesson about women throughout the 20th century: changing societal norms, fashions and evolving status. Each decade is a separate exhibit including the possessions women carried in their purses and the importance of various contents as well as other displays about different types of purses. The temporary exhibit was about hats and hat pins, so to speak hand-in-hand with purses. Terrific gift shop, come ready to grow your own collection!"
 ]
},{
 "name": "The Arkansas River Trail",
 "address": "400 President Clinton Ave Little Rock River Market",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/f9/da/f5/getlstd-property-photo.jpg",
 "tags": [
  "walk",
  "art",
  "drink",
  "food",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d3573221-Reviews-The_Arkansas_River_Trail-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you have the time the river trail is a great walk on a nice day. We walked it for about an hour last week after a lunch at the Rivermarket pavilion. There are more and more pieces of art (sculptures) along the way. You can cross to the north little rock side and walk that path too. I recommended this walk to anyone that has the time and wants to see our city from the rivers edge",
  "For a casual cruise or a pounding workout this is a great trail with excellent infrastructure and great scenery.  It is mixed use so be watchful for walkers, dogs and baby strollers but it never gets old, always a good workout and always plenty to see.  Good food and drink nearby at the bottom of Cantrell Hill and The River Market District.",
  "Crossing two bridges over the Arkansas River, including THE BIG DAM BRIDGE over one of the Locks and dams on the river, this paved bike trail is a scenic ride and one which goes thru downtown Little Rock and North Little Rock.",
  "We only did a small portion of this.  We had a great time walking and looking at the statues and sculptures There are huge sculptures and tiny sculptures everywhere.  They blend in and stand out.  This is a beautiful state.",
  "Great bicycling trail along the Arkansas River with beautiful views!  Easy to navigate and very doable for beginners.",
  "It's a lovely ride all the way around, except for a portion behind the Dillards headquarters where you have to ride a few blocks on the street. Hopefully, one day the trail will be complete. The North Little Rock side is more wild and scenic than the Little Rock side. Today there were white pelicans diving for fish in a little river inlet. The trail is often deserted. I've done the loop countless times and never seen any of the \"vagrants\" noted by another reviewer. There are a couple of well-maintained bathrooms along the way. The trail and river are two of the best things about Little Rock. It takes about two hours to complete the 17 miles. ",
  "The Arkansas River Trail is a year-round location for outdoor exercise or just to clear your head! Oasis within the city with access to the river, public golf and plenty of locations for libations and recreation.",
  "This is very inspirational walk along the Arkansas River...found out that the river walk was inspired by the river walk in Portland OR..."
 ]
},{
 "name": "Heifer Village (Heifer International)",
 "address": "1 World Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/0e/b8/1f/heifer-village-heifer.jpg",
 "tags": [
  "kids",
  "learn",
  "unique",
  "learn",
  "unique",
  "walk",
  "kids",
  "learn",
  "food",
  "eat",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d2287425-Reviews-Heifer_Village_Heifer_International-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "it will only take an hour but it really is worth the time that it takes ... the work they do is heartening and needs encouragement.",
  "It is for kids but grown ups can learn something too. Don't miss the gift shop, they have unique stuff. It's very interesting. Give it a try.",
  "If you know about Heifer Int'l, you need to visit their headquarters in Little Rock! If you DON'T know about Heifer, you definitely need to visit & learn about it! Heifer is a great organization & their extremely eco-friendly building is amazing. It's worth the trip just to learn about the building alone, & everything else is icing on the cake. There is a small gift shop, but it contains some very unique items & is well worth a visit. I lived in the area for 50-years & after the headquarters building was completed in Little Rock, I would make a specific trip (on my eco-friendly bicycle, of course!) there whenever I needed a unique gift item. LoVe Heifer Int'l!",
  "The museum is so cute! Great for younger kids, but still engaging for teens. Lots of interesting things to read, and hands-on activities. The little farm outside was the best part. Many different animals, that had enough room in their enclosure to walk around and be comfortable. Really nice gift shop. The staff were very kind and answered questions.",
  "Amazing is what this organization is in helping people throughout the world and in our own backyard to be self sufficient.  Come visit. Learn.  Donate",
  "Really enjoyed seeing the Gardens  , visiting the Gift shop .\nThe Goat soap & Lotion are made local  .  They only had a few animals out (  Alpacas )& the barn was closed , maybe because it was late in the season ? This is a free walk thru . We  did eat lunch there. They make your Food  from the gardens so you know it's fresh . The staff were very helpful and nice . My take away is we are so lucky and shouldn't take what we have for granted . \n",
  "Very informative and very interesting. So glad that my friends and I stopped by and checked out this museum.",
  "Heifer International is a world organization educating poor communities conservation and recycling, farming techniques, and livestock care. When you arrive there are very friendly and helpful volunteers to inform you about Heifer Intn'l. There are many global displays of the work they do in the USA and the world.  There is an urban farm with many ornamentals, fruits, and vegetables that are developed for educational purposes in the communities they visit. Outside you can visit with the Alpacas, cow, goats, roosters, turkey and the caretakers who will answer all questions about the animals. Inside there is a cafe and gift shop.  Nice pleasant relaxed visit."
 ]
},{
 "name": "Junction Bridge",
 "address": "Riverwalk",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/74/01/cc/junction-bridge.jpg",
 "tags": [
  "walking",
  "kids",
  "walking",
  "walk",
  "walk",
  "history",
  "walk",
  "historic",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d7235316-Reviews-Junction_Bridge-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Riverfront park is always a great stop. Walking across Junction Bridge is fun, and it's enjoyable to watch the river and look at the view as you are on the bridge. I loved the cute sign in front of the bridge that makes a great photo keepsake. For those who are unable to climb the stairs, an elevator is available.",
  "Went about an hour or two before the sun went down, walked across the bridge and around the park on the other side! The park was full of neat sculptures and if you had kids a great play area! On the way back the bridge was all lit up and a spectacular sight! This is a great place to get some walking in and some great pictures so plan on taking a couple hours here! ",
  "Great walk on a nice sunny afternoon across the bridge and grab some gorgeous views of the lake. Also don't forget your padlock if you're with your significant other as a symbolism to lock your lock.",
  "I liked the Junction Bridge, the river walk as well as the history. We explored everything and we had fun!",
  "The Junction Bridge is a must-see if you plan on spending any time in Little Rock. It's a great way to start a walk or run across the river, or just as a quick stop before lunch in the River Market.",
  "Riverfront Park provides amazing running around and across the Arkansas River. There are two bridges dedicated to runners/bikes and another bridge with a separate section for runners/bikes. The park has miles of trails, a myriad of different sculptures and several historic postings. I loved this location and anticipate I will return here many times over the years.",
  "Very cool walking bridge coverted from a railroad bridge. It is located very close to the River Market and spans the Arkansas River. There are steps on either end, but also elevators if you need them. At night, it lights up in bright colors. Places along the river to take a selfie with the bridge in the background. Fun little thing to do.",
  "The bridge is absolutely amazing!  The colors at night and while we didn't know bc it was our first time but,  the thing to do is bring a lock that has initials engraved and lock it on the bridge.  We saw 100s and we will be going back this Saturday with ours"
 ]
},{
 "name": "Little Rock Zoo",
 "address": "1 Zoo Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/60/7e/99/tiger-at-the-little-rock.jpg",
 "tags": [
  "walk",
  "kids",
  "kids",
  "kids",
  "educate",
  "kids",
  "walk",
  "walking",
  "family",
  "kids",
  "food",
  "family",
  "drink",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d271374-Reviews-Little_Rock_Zoo-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went on Tuesday of Spring Break and even though it was crowded, it didn't seem crowded.  They had activities for the kids just because it was Spring Break.  Some animals were still in hiding, but many were out for viewing and showing off to the children.  It was very nice to walk around because they opened the gates near the cafe for the short cut that I wish were opened year round.  We will definitely be back because we did get a membership :)",
  "I’ve had annual passes to the zoo since my daughter was born. It’s such a great place to go for a few hours. My kids love the farm area and feeding the goats. They love the train ride, and the playgrounds are perfect for their age. The zoo had really grown over the years and you can tell the stuff puts their heart into making it great!",
  "We've visited the Little Rock Zoo several times and have enjoyed every visit. There's plenty for the kids to see and do; we usually spend a few hours there. Many of the animals are hiding during colder months, so you may want to go when it's warmer.",
  "I like to visit zoos whenever I travel to other cities. I’m here for business and needed to get out of my hotel room! Little Rock has a pretty good zoo overall. The zoo was very clean. The staff does a great job of keeping the grounds in pristine shape. Some animals have various enclosures to help with a change in environment, which I love. Lots of construction going on for new exhibits so I’m sure it will get even better. Signage was lacking on some exhibits. More work is needed for sure to educate visitors on the animals and conservation efforts for them. On the side of the park with the Cheetahs they need sound barriers. The vehicle noise was insane and I can’t imagine the animals on that end of the park aren’t even more stressed by it. \nOverall a good zoo to spend a few hours at. ",
  "My husband and I came to town to celebrate our granddaughters 2nd birthday. The zoo is one of her favorites and this didnt disappoint. I cannot wait to come back once they get all of their upgrades for their animals in place. One BIG thing was seeing a turtle out with its handler so we could see and touch it. The train was a great addition to the zoo even if we didnt get to ride it. We loved the playground they had for our granddaughter and she enjoyed it very much. This zoo had nice employees and was alot of fun. We would visit again.",
  "There are so many animals. It’s awesome it’s a must do it has a playground also for kids. A train merry go round it’s a must see",
  "This is a pretty good size Zoo for a medium-sized City. I've been to over 60 zooz so I'll give you my thoughts on this. Like I said the size is nice and it does have a decent lay out. They have a lot of the major animals except for maybe giraffes as far as one of those primaries that they don't have. They do have some very nice exhibits and all of the enclosures seem to have quite a bit of room for the the animals for the most part. The issue I have is this place is doing a lot of construction so they are working on their future which is a great thing. However with this comes a lot of closures on the pathways so sometimes you have to double back which gets kind of frustrating after the 7th or 8th time when you're going to an animal and it looks like you can walk through and have a decent flow to your visit only to find out that it dead-ends and you have to walk back the way you came. I really like the elephants and I really like the Apes. I like the Rhino exhibit was very nice. And I like their big cats excited which has an overview where you can see all the animals from the top so the Lions the Tigers the Jaguar you can come have a bird's-eye view of their enclosures as well as the normal view you get just walking on the path in front of it. That was pretty cool. Their African cafe has some food that's better than average it doesn't feel like it's off the assembly line deals like it's almost home cooked from scratch. And a very friendly staff there. They do have a tiny gift shop but the staff there also is very nice. They have a train and they have a carousel for the kids as well as a play area and a Heritage Farm type area. Some of their enclosures are dated but they do seem to really take good care of the animals here. I do have a hard time seeing penguins that are outside and don't have an interior place to view them where it's nice and cold especially in a warm climate like Little Rock in the summer. This zoo does provide a lot of shade though so even on a hot summer day is a nice place to come and visit or bring the family. Again my only issue was but that's that did ended in you have to retrace your steps other than that this is a pretty nice Zoo. 1295 for adults and $3 for parking.",
  "Great family experience!  Several food venders are scattered thru the park and there is the African Cafe with si,ple food and drink done well.  Be sure to check out the reptile house.  "
 ]
},{
 "name": "Maumelle Park",
 "address": "9009 Pinnacle Valley Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/2a/e6/52/photo2jpg.jpg",
 "tags": [
  "walking",
  "walk",
  "kids",
  "walk",
  "walking",
  "affordable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d103221-Reviews-Maumelle_Park-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Website Link Totally WRONG! (Will try to report erroneous website.)\nMaumelle Park, on the Little Rock side of the AR River (near the confluence of Maumelle & AR rivers), is NOT the same as the incorporated town of Maumelle (on the North Little Rock side of the river). It is a US Corps of Engineers park (in our opinion, The finest one!) - can make advanced reservations online at Recreation.gov .\nGreat Riverfront park developed for Day use and Camping. Lots of Wonderful campsites, many are 50 amp, all have water at site, dump stations. Wooded loops, loops near playgrounds, loops near Marina, loops near boat launch with sites right on the river. Pavilions and picnic areas. Trails. Pinnacle Mountain State Park nearby offers addnl recreation opportunities - events, great walking and hiking trails - for all ages, boat launch with rentals, pavilions. \nMaumelle Park “feels” remote but amenities are close by.  Follow signs north off Hwy. 10 (Cantrell Rd.) - west of the I-430 intersection with Hwy 10. \n",
  "The RV park in Maumelle park is a great place to walk. Paved roads, shade trees, and bathrooms make it a great place to exercise. You get a view of the river and all the different RVs.  Plus everybody drives very slow (thank you speed bumps) and park rangers patrol.  Safe environment for kids.  Just watch out for the goose poop. They have discovered that the park is a great place to raise their babies. ",
  "Maumelle Corps of Engineers Park, just outside of LIttle Rock, offers  gorgeous views of the Arkansas River.  The river is about 3/4 a mile wide and flows steady and strong.  Add a forest of tall mature trees and you have one beautiful park.  This park has four rv loops; some with 30 amp and water and other sites with 50 amp and water.  I noticed some full-hook up sites that are marked for use of those with medical passes; I assume to help those who are in town for medical treatment in Little Rock, which is a very nice service for the park to offer.  The interior roads are asphalt and easy to maneuver for any size rig.  Sites are either concrete or asphalt and each has a concrete patio with a gravel frame, a picnic table and fire ring. Utilities were conveniently located on the sites and in good working order.  There are three dump stations on the property and well as several covered large-group pavilions.  Our site needed only a little assistance from us to be level.  There are several sites which are \"Y\" shaped for those who have friends/family in separate rigs to share a spot.  All sites were spacious, offering ample privacy.  Restroom/Showers were clean, thanks to the diligence of the Park Hosts. We were able to connect to satellite and had great coverage on both Verizon and AT&T.  We only had one night there, but wish we could have spent more time in this lovely park.  ",
  "We didn't knew that this was a RV Park. However, we could walk and we had a good walk. However, there were no leaves on the trees, because it was January.\n\nPeople can bring boats on the river.\n\nWe had fun and I will miss the river!",
  "Website Link Totally WRONG! (Will try to report erroneous website.)\nMaumelle Park, on the Little Rock side of the AR River (near the confluence of Maumelle & AR rivers), is NOT the same as the incorporated town of Maumelle (on the North Little Rock side of the river). It is a US Corps of Engineers park (in our opinion, The finest one!) - can make advanced reservations online at Recreation.gov .\nGreat Riverfront park developed for Day use and Camping. Lots of Wonderful campsites, many are 50 amp, all have water at site, dump stations. Wooded loops, loops near playgrounds, loops near Marina, loops near boat launch with sites right on the river. Pavilions and picnic areas. Trails. Pinnacle Mountain State Park nearby offers addnl recreation opportunities - events, great walking and hiking trails - for all ages, boat launch with rentals, pavilions. \nMaumelle Park “feels” remote but amenities are close by.  Follow signs north off Hwy. 10 (Cantrell Rd.) - west of the I-430 intersection with Hwy 10. \n",
  " It such a great quiet, clean campground. plus it is close to pinnacle mountain. Affordable camping with clean water and electric hookups.  Clean restroooms and showers!\n",
  "We have stayed here several times and it is always awsome.  The staff are friendly and the campsites are beautiful.",
  "We would highly recommend this park, very well run, very clean, the views were beautiful, our site was along the river, 2 miles to Pinnacle Mountain....very nice!"
 ]
},{
 "name": "Robinson Center",
 "address": "Markham At Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/c2/c8/79/enjoying-holiday-youth.jpg",
 "tags": [
  "tour",
  "history",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d1419944-Reviews-Robinson_Center-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Flew into Little Rock to see the musical Waitress (national tour) and although I'm biased (my daughter is in the show), I found the theater to have wonderful acoustics and very comfortable seats.  Two balconies and side boxes, all beautifully designed.  A great venue for such a sold-out musical.\n ",
  "First visit. Came to see Wicked. Took a bit to figure out where to go after arrival and parking, but figured it out. Staff nice. Seating was fine. Late arrivers and constant traffic in the isles was distracting. ",
  "I love the theater! First time to the renovated auditorium! Extremely disappointed!! Can you imagine paying for Orchestra level (center), driving an hour, checking off your bucket list “Wicked” and the person’s head in front of you COMPLETELY blocking your view! I was EXTREMELY DISAPPOINTED!! It wasn’t just the money spent, it was the entire experience!!! I didn’t even mind the $10 to park in the parking deck. My neck and back are hurting today because I had to lean and contort my neck to see anything! Could NOT at anytime see the whole stage, only the side I was contorting to. There’s next to no leg room, glad I am average height! You are literally shoulder to shoulder with the person next to you! Dissatisfied is an understatement!! There’s high school auditoriums with much better seating! Expectations of a new auditorium were delivered way below average! Wicked, what I saw of it was amazing! Not sure I will ever return to Robinson again.",
  "Orchestra section is good but seats aren’t very comfortable.  Saw Wicked & it was crazy busy for 2pm matinee.  Parking took a while so plan on that.  Wished you prepaid when you arrive for shows so you can get out when it’s over.",
  "I have seen a few plays here and it is absolutely beautiful! The building is a treasure inside and out. It even has some history lessons you can read about this theatre while you are waiting for your show to start. However, the drinks and snacks they serve are very much over priced but I believe it is a given. This stage is a bit smaller than most other theaters I have been to but the seats are comfortable and I haven’t had a bad seat yet!! "
 ]
},{
 "name": "Old State House Museum",
 "address": "300 W Markham St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/93/b1/b0/statehouse-museum-entrance.jpg",
 "tags": [
  "history",
  "history",
  "free",
  "free",
  "walk",
  "history",
  "free",
  "library",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d108498-Reviews-Old_State_House_Museum-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful building with spectacular wooden staircases and a chance to get a history lesson. Not very large but does give a good idea of the early years in developing into a state.",
  "This museum is next door to the Marriott hotel so we just walked over.  Gorgeous grounds, very nice museum and it's free! My favorite exhibits were the Arkansas First Ladies Gown exhibit and the African American Quilt exhibit.  Check it out - the architecture is beautiful and there is a lot of Arkansas history.",
  "Lots of interesting items from various places. ancient artifacts dating from 3,000 B.C. to modern times. Section on early native Americans, Spanish conquest, American Civil War and WW I and II. Something for everyone, Handicap accessible, helpful staff that will provide wheelchair, if needed and FREE. Museum covers two floors and is very large. Trolley stop nearby. Could have spend several hours in museum without being bored.",
  "Great museum, lots of interesting history and the building is so fun to walk through. Free but donation requested.",
  "In town for only two days, the Old State House Museum was directly next to our hotel, so it seemed a likely place to while away an hour.  What we found were easily 12-15 self contained exhibitions in this beautifully restored building, with rooms leading to rooms, leading to stairways, each leading to another subject exhibition. Yet another world class museum (the Purse Museum is another) in this town that is full of surprises.",
  "I loved the architecture & beautiful tree in front of the building. This was the states’s first Capitol (oldest state Capitol west of the Mississippi). It was also a medical school at one time. I loved how the wooden floors creaked in this old building lending authenticity to its age. I enjoyed the dress collection and African quilts exhibit. The dual spiral stair cases, were beautiful, although not original to the building. The young lady working the counter was very informative and polite.  We arrived 45 minutes before closing on a rainy day & she still let us in!  ",
  "We were greeted with the typical southern hospitality and they  went beyond...we were investigating our relative who had served in the House of Representative in 1846...they called the Library in Perry County, to see if they had any information,  he was from and represented Perry County...they then sent us to the State Achieve to search for further information on him. We saw a great deal of the government buildings and met the most wonderful people!",
  "Beautiful building with spectacular wooden staircases and a chance to get a history lesson. Not very large but does give a good idea of the early years in developing into a state."
 ]
},{
 "name": "Historic Arkansas Museum",
 "address": "200 E 3rd St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c1/7d/ca/historic-arkansas-museum.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "walking",
  "history",
  "family",
  "tour",
  "knowledgeable",
  "free",
  "cheap",
  "free",
  "art",
  "historic",
  "library",
  "tour",
  "historic",
  "kids",
  "free",
  "unique",
  "historic",
  "walking",
  "performance",
  "tour",
  "history",
  "walking",
  "performance",
  "tour",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d213931-Reviews-Historic_Arkansas_Museum-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We just visited this lovely museum, and what a pleasure it was!\n\nThe guided tour of the buildings, for a VERY nominal fee ($1.50 for seniors) was truly exceptional.  Casey was our docent,  and he was amazing! He is passionate about what he does,  he knows such a lot of the regional history,  and he really brings a lot of knowledge to the subject.  Thanks very much Casey.\n\nAnother real highlight was the living history guide who was portraying Tabby, a person of history from the appropriate time era. The woman was truly exceptional....you really believed her. She is a gifted re-enactor, making history come alive. \n\nDon't miss this gem of a museum!\n ",
  "We decided to spend a few hours here while passing through Little Rock recently and were very glad we did.  Great exhibits and the personal, guided tour of all of the outbuildings was a very nice touch that made you really feel as if you were walking back in time.  I have family that live in Little Rock who said they've never been there, and that's a shame.  It's a real nice piece of preserved history right there in your little city and is well worth the time and money to go and see.  Parking can be a bit tricky, but if you're not in a hurry it is well worth the stop.\n\nHighly recommended place to visit.",
  "Admission was $8 total for four visitors. That included a guided tour of a number of old buildings, with an exceptional tour guide. At one of the stops, a costumed Mr. McVicar described how he went to California to look for gold in 1850 and ended up operating an inn there. One of the buildings was a replica of the print shop for The Arkansas Democrat-Gazette. Another was an old inn. Excellent, knowledgeable tour guide.\n\nThere is also a 2 floor museum with free admission. Don’t skip the second floor for numerous Indian artifacts and exhibits.",
  "The Historic Arkansas Museum is a modern museum which is adjacent to a truly historic district of early 19th century buildings. It  has a number of very old Little Rock Buildings, including the oldest log cabin/tavern,  a print shop, and docents doing cooking in a kitchen that is apart from the house....both to make sure the house did not get hot an d that it did not b urn down, in case the kitchen fires got out of hand. We got a sample of yummy chicken pot pie done in coals in a cast iron lidded pot in an open fireplace....others got blueberry pie made the same way. The modern museum had an Quilt exhibit (runs through August 2015) with some of the best quilts we have ever seen. They also have examples of Arkansas Art: Bowie Knives, furniture, photographs, etc. They had one room devoted to Arkansas Indians, and their brutal story.  The presentation of the Indians was respectful of their culture and artifacts.  It also described how they were mistreated by  the French, the Spanish and the American whites. AND THIS PLACE IS CHEAP!  The entire place costs a few dollars... but if you only want to see the museum building, and not the historic properties, it is Free. This place is certainly worth a few hours and it is not far from the Clinton Presidential Library, or the Capitol, or the River Market Area.",
  "Small but very nice exhibits;  beautiful quilt display and native American exhibit.  be aware to see the historic buildings they are tour guided only and have set tour times.",
  "My 3 boys and I visited this museum again to see some new exhibits.  They are always changing out the temporary exhibits, so it pays to go back again and again.  The Arkansas in WW1 exhibit is good.  I wish there had been more artifacts to see, but the information to read was great.  There was new artwork in the galleries that we had not seen.  My kids always like the Children's area which had a sign saying it would be all new by Summer 2017.  The sculptures outside are neat to see.  And the old buildings on the grounds are so well taken care of.  Admission is free.  There is a small fee to visit some of the buildings outside, but worth it.  And there is a small free parking lot just for Museum guests.",
  "great exhibits, very interesting..  Gift shop offers a lot of unique gifts .  The old cabins on the grounds are neat",
  "Half a block restored with houses through the ages.  Scheduled walking tours to show you round.  Not strenuous, takes an hour.  Subtle nod to the slavery struggles.  Tour introduces you to 2 historic characters. The lady who played Tippy on Saturday 12Oct 1pm tour deserves an Oscar. Very powerful performance, several of us teared up, kudos to her!!!",
  "So, this museum is split in two sections. The indoor museum is nice, the knife displays are pretty amazing and I'm not a knife enthusiast. When I was there they also had quilts on display, some pottery and artwork by local artists upstairs. It's a beautiful new modern building. And this part is no charge. Part two is outside and scheduled, they make an announcement if you're walking around. The outdoor guided tour is only a mere $2.50 per person, and worth every penny. This is a living history tour of Arkansas. They've put together a small town, including a printer, post office, bar, home. I hope you meet Tabby on your tour, her performance will take your breath away. It's truly wonderful what they put together. Don't miss !",
  "So much to see! Tells you both the history of the area through the art and the present. Quilt display was fabulous. Area about knives was fascinating. Art work of various times and places excellent. Absolute must if in Little Rock",
  "I love the display of knives made by Arkansas master blade smiths. I am a collector myself, and can appreciate the artistry."
 ]
},{
 "name": "Two Rivers Park",
 "address": "6900 Two Rivers Park Road, Little Rock, AR 72223",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/3d/f3/28/spring-has-sprung.jpg",
 "tags": [
  "kids",
  "nature",
  "nature",
  "walking",
  "field",
  "family",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d2647249-Reviews-Two_Rivers_Park-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I liked the river the best. It went quietly and attractive.\n\nHowever, there were a lot of panels about spring and summer.\n\nThere are lots of birds.\n\nMany will be fishing.\n\nWe will see deers and many other animals.\n\nThe trees would be blooming.\n\nI can see that. I imagined it was spring. I was smiling. Flowers were everywhere and fishing will be fun! Kids would be playing. Everybody would be happy.\n\nI can see myself in spring.\n\nWorthwhile!",
  "This is s great park for bicycling, walkers, runners, picnics or just sitting to take in nature at a nice point in the Arkansas River.",
  "This park is beautiful!  Great experience for the entire family with nature trails, fishing, biking, etc.  I walked my dog and I saw a field within the park full of deer.  I was amazed that they were there in their natural habitat grazing.  Nice for seeing nature, relaxing and walking.",
  "This park is full of people of all ages, people on bikes and eopke with dogs (on leashes). It offers pleasant, flat, paved trails under large shade trees. The only complaint I have is that there is not enough parking to accommodate all of the people who wish to visit.",
  "So beautiful - multi-recreational space. We saw runners, cyclists, canoeists, people with kites, walkers, families just playing. Such a lovely area! I would definitely recommend checking it out. No visible amenities but nature at it's best."
 ]
},{
 "name": "MacArthur Museum of Arkansas Military History",
 "address": "503 E 9th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c3/eb/70/macarthur-museum-of-arkansas.jpg",
 "tags": [
  "tour",
  "free",
  "walk",
  "tour",
  "history",
  "learn",
  "history",
  "kids",
  "history",
  "free",
  "family",
  "history",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d314031-Reviews-MacArthur_Museum_of_Arkansas_Military_History-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum was a wonderful surprise first it was free..donations accepted. It was a tribute to General MacArthur including a 20 minute film, who was born here, left when he was young and his father was transferred and came back after President Truman fired him. There is a display of Arkansas, Little Rock and their part in the Civil War but the highlight were the WW 2 and Vietnam pictures on display taken by AR natives. There were more displays for all the wars which were informative and well done. ",
  "My husband and I had some free time, so we found this museum on the internet. OH...MY...GOODNESS! We both thoroughly enjoyed this self-guided tour of the museum and grounds! We would certainly visit again! ",
  "Take a walk through the Park, sit near the lake, then tour the museum for a great history lesson on Gen. Douglas MacArthur along with history of various fought wars like Vietnam and Korea",
  "Very few people know the history of the MacArthur Museum. I recommend if you have time go and visit and learn a little bit more about the General.",
  "Our family visited the museum on a Sunday, so it wasn’t very crowded at all. If you’ve got young kids, maybe keep that in mind! Loved this museum. If you love WWII history, this museum is can’t miss in Little Rock. Lots of cool MacArthur stories. Not a lot of personal artifacts from MacArthur, but I learned a lot about the man. \n\nThe building is very well maintained. Functional elevator and wheelchair entrance. The museum is free, but donations are encouraged and help with museum maintenance. ",
  "This is a beautiful historic museum. They do not charge for entry. They have two floors of history to meander thru. They have a room with Military jeeps and how the helped the war effort. Upstairs they have a display of Arkansas women in leadership. It's really worth the visit.",
  "Well put together military museum.  Loved the exhibit on jeep history. Loved that all wars from civil war to Vietnam were covered in exhibits.  ",
  "This museum was a wonderful surprise first it was free..donations accepted. It was a tribute to General MacArthur including a 20 minute film, who was born here, left when he was young and his father was transferred and came back after President Truman fired him. There is a display of Arkansas, Little Rock and their part in the Civil War but the highlight were the WW 2 and Vietnam pictures on display taken by AR natives. There were more displays for all the wars which were informative and well done. "
 ]
},{
 "name": "Arkansas Arts Center",
 "address": "501 E 9th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/cd/d3/14/20160622-143346-largejpg.jpg",
 "tags": [
  "art",
  "family",
  "art",
  "art",
  "unique",
  "food",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d314030-Reviews-Arkansas_Arts_Center-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I've been visiting the Arkansas Arts Center since I was a child. I remember when it was just the original building and how much it improved when Mrs. Winthrop Rockefeller took it under her wing in the 1960's. It's bigger and better now, and I hear there are plans to improve it some more.\n\nIt's not a huge place, but it offers a lot. There are art exhibits, classes, lectures, and theater productions. I have watched it grow and change with the times and have enjoyed spending time there looking at the exhibits and participating in the activities.\n\nWe have not lived in Arkansas in several years, but when we come back to visit family, we try to make time to go to the Arts Center.",
  "This is such a nice place to go and visit and see excellent art and other exhibits - special exhibit when we went was The Art of Seating - who knew that different chairs could be so interesting",
  "The art museum in Little Rock is delightful. It is fairly small, so not at all overwhelming. There are quite unique exhibits, such as, the Japanese interment camps, integration, and (right now) the Central High School photographs from 1957, which are very powerful. They have a delightful little gift shop and a great restaurant. We've been members of the art museum for many years and still enjoy returning there.",
  "The Arkansas Arts Center has moved as they are remodeling the one on 9th street. I went with my daughter and grand daughters to see Christmas Carol. It was awesome, as usual.  We love the Arts Center!",
  "What a wolderful buffett at Watercolors Rest yesterday with group of 10 friends. Food was fabulous and so was service. A bit towards expansive side  ($27 from chilled soup to desserts and with excellent tea) but well worth it esp with a friend celebrating 85th birthday!\nSorry TAdv...will not allow scrumptious food pic!",
  "We were in Little Rock primarily to visit the Central High School site, and found ourselves here almost accidentally on a Sunday of thunderstorms and rain a couple of weeks ago. We were very much time limited, but what we saw, not least the photographs of Frida Karhlo were new to us and provided a fresh perspective on her life and work",
  "I've been visiting the Arkansas Arts Center since I was a child. I remember when it was just the original building and how much it improved when Mrs. Winthrop Rockefeller took it under her wing in the 1960's. It's bigger and better now, and I hear there are plans to improve it some more.\n\nIt's not a huge place, but it offers a lot. There are art exhibits, classes, lectures, and theater productions. I have watched it grow and change with the times and have enjoyed spending time there looking at the exhibits and participating in the activities.\n\nWe have not lived in Arkansas in several years, but when we come back to visit family, we try to make time to go to the Arts Center.",
  "We are so fortunate to have this amazing facility in our state. Wonderful exhibit...Martin Muller is a genius!  How gracious of him to share from his collection.  We also enjoyed the Collector’s Exhibit plus seeing some of the Center’s new acquisitions. Kudos to all associated with the planning and execution of these remarkable exhibits."
 ]
},{
 "name": "Wild River Country",
 "address": "6820 Crystal Hill Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/37/68/76/fun-fun-fun.jpg",
 "tags": [
  "parks",
  "adventurous",
  "walk",
  "family",
  "free",
  "kids",
  "parks",
  "kids",
  "eat",
  "walking",
  "food",
  "parks",
  "kids",
  "kids",
  "drink",
  "food",
  "adventurous",
  "walk",
  "family",
  "free",
  "kids",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d1125475-Reviews-Wild_River_Country-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have a 5 year old, 12 year old and 17 year old. We all love coming here. This was our second time traveling here and we will be back years to come.  What I love most is my 5 year old is able to actually participate. Some parks dont offer anything but a kiddie area for that age. When we come we never have to stand in line long and that's a big plus for me. When we came this time 2 school buses pulled up with children and the lines still were not long. Looking forward to next time!",
  "I was very impressed today.  It was the first time I've gone to this park.  We bought season passes during a special in March for a very reasonable amount, so we plan to go quite a bit more this summer.\n\nUpon entry, they do ask to inspect your bags, but I had no trouble with anything we brought.  They directed me to a building to pick up the season passes for each of my family and after just a few minutes, we had them in hand.  \n\nThe bathrooms were clean.  I didn't use a locker, but there were plenty there and I was told we can rent them.  Instead, the parking lot was so close with employees near at all times, I didn't really see the need to use a locker.   Anything I wanted to lock up, I put in the car. \n\nThe water in the pool was very clear.  There was some chipped paint and a little brown staining on the side of the lazy river, but the water was still very well maintained.\n\nThere were a lot of lifeguards around everywhere, and I felt all were very professional and attentive.  At regular intervals, they'd rotate, and you could see them constantly scanning the water to cover all the areas of each pool.  The top of each slide had a lifeguard as well as the bottom.  \n\nMy 4 year old had a lot of fun and several of the slides were great for her as well as older kids.  My 11 year old son went on some of the more adventurous slides and also had a lot of fun.\n\nYou could ride up to 4 on the cyclone.  Other than that there were slides for 2 people at once and one person.  Some slides had tubes (provided free of charge) and some did not.  There was a person checking the tubes at several areas.  We had a damaged tube once, and told one of the guys checking them, and he removed it right away from the area.  They also had lifevests (free of charge).\n\nThe lines moved quickly all day and were not long to begin with.  I didn't have to walk all over the place to get to different slides.  It was layed out well such that different family members could go on multiple slides or in the pool and still be in the same area.  I didn't feel I was running around after each one.\n\nLastly, everyone was very friendly beginning with the greeting at the gate and even as we were leaving.  I didn't see the lifeguards talking unnecessarily, but they were also very nice with assisting all the children and adults in their areas or responsibility.",
  "It was a cool and fun experience I liked it we went 2 seniors and 5 adults and 1 toddler and 1 teenager we had a lot of fun ",
  "The water rides are awesome! To be able to go on all of them I suggest you rent a tube. You can skip lines and go by yourself on ones requiring more than one person! The lines are decent and you have quite a climb to each of the slides! You need to know how to swim! Make sure you bring sandals as there aren't any shaded areas and the concrete will burn your feet! ",
  "This water park is OLD and needs updating and MAINTENANCE!  We won't go back unless things change. This water park seems to attract the WRONG crowd so go at your own risk.   Magic Springs in Hot Springs beats it hands down...and is 2 parks in one.",
  "We grab season passes every summer for our group. I take the kids on my days off for some water time. They love all the slides and the wave pool. I grab a shaded lounge and read and jump in the wave pool and cool off when it gets too hot. I do wish they had sprayers for the hot concrete as it burns in July/August when you're moving from slide to slide. I hate to have my kids wear shoes and get the awful tan lines and then be told to hold them in hand when going down the slide...id rather burn off top layer of skin walking around. 😜 it's a fun time...it gets crowded and if you stay for night water it can get rowdy. We go early and leave before a big crowd hits and enjoy it. Food lines are ridiculous later in the evenings. Eat before you go. ",
  "I have a 5 year old, 12 year old and 17 year old. We all love coming here. This was our second time traveling here and we will be back years to come.  What I love most is my 5 year old is able to actually participate. Some parks dont offer anything but a kiddie area for that age. When we come we never have to stand in line long and that's a big plus for me. When we came this time 2 school buses pulled up with children and the lines still were not long. Looking forward to next time!",
  "Going to Wild River Country was a treat I looked forward to every summer when I was a kid. I been taking my kids for years. But then I realized a few years ago... its not worth it! I don't go at all anymore unless I have a coupon:) Why go to Wild River Country when you can go to Magic Springs for the same price or cheaper depending on when you're going. The season passes at Magic Springs are even cheaper. The actual rides are pretty fun and for us just enough excitement but you need very strong legs to maneuver around this park. Every time I go I think... who designed this? Last time we went the lazy river was dirty, the concession was unkept, expensive and very blah. Soooo... let's face it, Wild River Country needs to do something to justify why I'm gonna pay $35 to go there. Sorry but I'd rather go to Magic Springs!",
  "Small water park.....Admission prices for adults & children over 48 inches tall (even though only 7 & 9) were very pricey. Food & drink prices within the park are even pricier. Our children (ages 9, 7, & 3) did have a fun time on the FEW slides & the swim area that were appropriate for them. The first day we were there, the park closed due to thunderstorms. We thankfully received a rain check & returned the next day. However; we had paid $8 for a locker that we only used 1 hour & did not receive ANY compensation for that! Life guards seemed to be very attentive to the kids. Not sure I will ever return based on limited rides & high admission prices.",
  "I was very impressed today.  It was the first time I've gone to this park.  We bought season passes during a special in March for a very reasonable amount, so we plan to go quite a bit more this summer.\n\nUpon entry, they do ask to inspect your bags, but I had no trouble with anything we brought.  They directed me to a building to pick up the season passes for each of my family and after just a few minutes, we had them in hand.  \n\nThe bathrooms were clean.  I didn't use a locker, but there were plenty there and I was told we can rent them.  Instead, the parking lot was so close with employees near at all times, I didn't really see the need to use a locker.   Anything I wanted to lock up, I put in the car. \n\nThe water in the pool was very clear.  There was some chipped paint and a little brown staining on the side of the lazy river, but the water was still very well maintained.\n\nThere were a lot of lifeguards around everywhere, and I felt all were very professional and attentive.  At regular intervals, they'd rotate, and you could see them constantly scanning the water to cover all the areas of each pool.  The top of each slide had a lifeguard as well as the bottom.  \n\nMy 4 year old had a lot of fun and several of the slides were great for her as well as older kids.  My 11 year old son went on some of the more adventurous slides and also had a lot of fun.\n\nYou could ride up to 4 on the cyclone.  Other than that there were slides for 2 people at once and one person.  Some slides had tubes (provided free of charge) and some did not.  There was a person checking the tubes at several areas.  We had a damaged tube once, and told one of the guys checking them, and he removed it right away from the area.  They also had lifevests (free of charge).\n\nThe lines moved quickly all day and were not long to begin with.  I didn't have to walk all over the place to get to different slides.  It was layed out well such that different family members could go on multiple slides or in the pool and still be in the same area.  I didn't feel I was running around after each one.\n\nLastly, everyone was very friendly beginning with the greeting at the gate and even as we were leaving.  I didn't see the lifeguards talking unnecessarily, but they were also very nice with assisting all the children and adults in their areas or responsibility.",
  "Run down and rather dirty. Chairs had cob webs and wave pool area needed swept first thing in am.Concession are is unkept and food quality poor. Prices are high for what is provided."
 ]
},{
 "name": "Verizon Arena",
 "address": "1 Verizon Arena Way",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/03/bf/6c/tso-concert-from-section.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d272107-Reviews-Verizon_Arena-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I hate it when I go to this arena. I go just because of my little girl wanting to see Disney on Ice. Thankfully she has outgrown that over rated show. If you sit in a seat you better stay there because moving around will be extremely difficult!!! I'm 5'9\" tall. Normal weight and the seating has to be the worst. ",
  "I’m stoked that Simmons now has the naming rights. They’ve stepped up and are doing a facelift to the exterior. For years you would drive by it and see a stained ugly exterior..  pathetic up keep in my opinion. It was disgusting inside too. Now that Simmons has it, the original shine has been brought back and we all are better off because of it. This Arena is the signature arena for events in central Arkansas. We can to see the Hogs play. Great night. Great crowd!!  I caught the exterior name change one day from the highway...  need to tell the guys about the missing “k”... 😂",
  "Came here for multiple events, concerts and a graduation. This place can do it all with no issue. the only complaint I have is the seats seem a bit small but tat is with most places, just like in an airplane.",
  "Easy venue to get in and out of, security was tight, but moved along quite well. Not sure I'd sit in the higher up level, but looks like a venue where there isn't a bad seat to see a show since it's a smaller venue.  We'd travel here again to see a show at this venue.",
  "We attended a concert here.  We were in section 203 (row 5).  I was afraid the seating might be bad, but it was good for a concert in-the-round.  Never felt like we missed out on anything happening on stage.  Easy for someone to drop us off before the concert and pick us up afterward."
 ]
},{
 "name": "Mosaic Templars Cultural Center",
 "address": "501 W 9th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c4/2e/a7/mosaic-templars-cultural.jpg",
 "tags": [
  "history",
  "walk",
  "tour",
  "history",
  "historic",
  "history",
  "history",
  "free",
  "kids",
  "art",
  "historic",
  "history",
  "history",
  "family",
  "free",
  "tour",
  "learn",
  "historic",
  "history",
  "art",
  "tour",
  "history",
  "knowledgeable",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d1792300-Reviews-Mosaic_Templars_Cultural_Center-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was here for a historical grant class. The center is very educational. Its about the African American history in Arkansas and Little Rock. It is worth a visit if your in Little Rock",
  "A must see of old black history, also be sure to walk down to the Arkansas Flag and Banner and take a tour of Dreamland Ballroom, Ella Fitzgerald, Duke Ellington and many famous groups performed there, a superb place to see.",
  "the building itself is a splended rebuild of an historic African American center of culture.  the building burned several years ago and was completely rebuilt ... looks like the old but with all new systems.  I houses a thorough and interesting collection of African American exhibits depicting the story of 9th Street when it was the center of African American business, culture and entertainment..",
  "While this is out of the immediate downtown area, this place is not to be missed.  There is plenty of parking in the back and touring is free...donations accepted.  There is a lovely bookstore.  The exhibits provide a history and overview of life in the African American Community and in Arkansas. The displays are well-presented and there is much to be learned.  I would call this a must-see place for lovers of history and culture.",
  "I ended up here looking for something to do between checking out of the hotel and catching a flight home. It was great! Lots of great history.  And the staff member who greeted us also took the time to give us a brief history of the building, the organization and the neighborhood. \n\nTake an hour or two and visit if you are in Little Rock!",
  "This is a great museum! It's only a few years old, so everything is sparkling new! It's an African American history museum, but it's not only for African Americans... it's everyone's history!!! The museum is located in the historic 9th street district, which was the Black Business District during segregation. The actual building that houses the museum has it's own history, which is cool.\n\nIf you ask the front desk, they can print out a scavenger hunt for the kids to complete, which is good because the museum isn't really child-oriented, the scavenger hunt gives them something fun to do.\n\n Be sure to check the calendar on their website as they have a lot of adult and kid programing, all of it free! The gift shop has an amazing selection of books on black history, as well as locally made jewlery, art, and quilts. Definetly worth checking out!",
  "If you want to know anything about African American history in Arkansas this is the place to go. The permanent exhibits are stellar! And Mosaic always has fascinating temporary exhibits on relevant topics as it relates to the African diaspora. If you can, take your whole family, and spend the day here. You definitely won't regret it! ",
  "Interesting pieces of information in this building some of the original stonework in the entrance after the building burnt down its well set out loads of pictures and things to read worth a visit its free entry ",
  "We were given a private tour of this center.  In this building you can view permanent exhibits that tell both the present and past history of African Americans in Arkansas from 1870 to the present time. This is the ideal place to bring your children for a history lesson.  They will learn about post-Civil War life which led to the birthplace of Black entrepreneurship in Arkansas including the Arkansas Black Hall of Fame, art inspired by Negro League baseball, the fine art of Jazz and the \"Inauguration of Hope\", a life size memorial to the historic inauguration of President Barak Obama.This center was one of my favorite places to visit in Little Rock.",
  "Amazing facility!  The museum is beautifully curated!  This is a must-see of African-American history in Arkansas.  The event space is very nice and nostalgic...I won’t give away the secrets!  The staff is extremely knowledgeable and they also have a great gift shop.  Perfect historical tour and event/banquet space for school groups, church groups, family/family reunion groups...definitely make this a stop on the itinerary:-). And if you want oral history, ask for Ms. Annie!!!!",
  "This place is a must see for history.  They also provide awesome programs and services for the community.  I attended a Paint and Sip in February and the people and experience were wonderful.  The Art Exhibits and Historical Exhibition are amazing.  This place is a MUST SEE when traveling to Little Rock. "
 ]
},{
 "name": "Arkansas Repertory Theatre",
 "address": "601 Main St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/a0/c4/a0/arkansas-repertory-theatre.jpg",
 "tags": [
  "performance",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d6557725-Reviews-Arkansas_Repertory_Theatre-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Always a lovely experience attending any performance at this venue.  Intimate setting with good seating and easy access and parking.  Conveniently located to various sites in the area.",
  "What a show, Million Dollar Quartet. It was wonderful flashback of the 50's with Jerry Lee Lewis, Carl Perkins, Elvis Presley, and Johnny Cash. Almost 2 hours of  fun packed entertainment. Enjoyed The Rep.",
  "Known as The Rep is the state’s longest running nonprofit resident theatre.  It has 377 seats and all are super good seats. I highly recommend it if you’re visiting Little Rock. You have to pay for public parking. ",
  "Saw a really good play. “Million Dollar Quartet”. Loved it. Really nice place. The building was very clean and easy to find my way around. I don’t think there was a bad seat in the house with the way everything was set up.",
  "So glad to see the rep open. If you live in or near Little Rock you should come to one of the amazing shows. You won’t be disappointed. "
 ]
},{
 "name": "H.U. Lee International Gate and Garden",
 "address": "7 Statehouse Plz",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/fb/18/e9/hu-lee-international.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d3492281-Reviews-H_U_Lee_International_Gate_and_Garden-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Its a very nice big door. There is bird netting across the entire roof/gables or whatever they are called. Open the door take a look inside and that is all folks. I am sure I am not informed enough to understand the meaning but neither are there information areas to be easily seen that explains.  Great photo op.",
  "Not much to it really but it was interesting.  It really only take a few minutes to check out.  So if looking for something quick, it's good if you're already passing by that way.",
  "The garden is beautiful and easy to relax and reflect in.  Fountain is clean and has seating around it.  Beautiful spot for pics! ",
  "It is a beautiful garden located right next to our hotel on Main street.  It has easy access and offers many photo opportunities.",
  "The cutest decor and statues. Really unexpected to see the garden behind the hut. Don’t miss it, you must see it.",
  "If you are close to it then stop in but I wouldn’t make a trip just to see it. It’s pretty & has some fountain seating. ",
  "Neat little garden and worth a stop if your passing by.  The entrance is intriguing and once inside there is star shaped fountain in the center along with statues around the walkways.  We spent maybe 15 minutes there which is plenty.  I wouldn't recommend going out of your way to stop here.",
  "The garden is beautiful and easy to relax and reflect in.  Fountain is clean and has seating around it.  Beautiful spot for pics! "
 ]
},{
 "name": "Testament: The Little Rock Nine Monument",
 "address": "1 Capitol Mall",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/f3/6b/28/photo1jpg.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "learn",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d10716396-Reviews-Testament_The_Little_Rock_Nine_Monument-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Facing the front of the Capitol, the statues are located to right and slightly to the back. If you do not know they are there, you will miss an opportunity to reflect and be thankful. Make the effort to find the statues. Stay in school ...take the hard courses, pay forward the price the Little Rock Nine has already paid!",
  "This memorial to the Central High nine sits outside in front of the Capitol. President Clinton had it made and placed here to remind all future Governors of this. They statue's are life size and the words at each statue are from the nine. Take the time to see it. I recommend you visit after going thru Central HS tour.",
  "Here you will see the statues of the Little Rock Nine Students. I suggest a tour thru the Central High Museum to learn the history of these students, and what they went thru to get an education. ",
  "A haunting, yet at the same time very moving reminder that, despite the efforts of a few who cannot read or chose to disregard our Constitution, we’re all the same, just different.",
  "We did miss this on our visit to state capitol didn't realise it was at the side of the building so had to return again today as I did not want to miss seeing this monument I actually think it should be at the front of the building and not where it is. It's a really nice monument a  piece of History.We visited the central High School the day before so this was a must visit.",
  "This memorial to the Central High nine sits outside in front of the Capitol. President Clinton had it made and placed here to remind all future Governors of this. They statue's are life size and the words at each statue are from the nine. Take the time to see it. I recommend you visit after going thru Central HS tour.",
  "Lovely sculpture. A personal quote from each student encircles the piece which is poignant. Worth a visit!",
  "We found out by visiting Central High School that there were actually ten students admitted and one withdrew for some reason."
 ]
},{
 "name": "Outlets of Little Rock",
 "address": "11201 Bass Pro Pkwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/74/ec/61/rh.jpg",
 "tags": [
  "kids",
  "kids",
  "family",
  "food",
  "walking",
  "walk",
  "family",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d8732499-Reviews-Outlets_of_Little_Rock-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Love the way this mall is built, so much nicer than the other outlet malls I\"ve been to.  Love that they have a Lindt candy store, best chocolate ever.",
  "This is a very nice outlet mall. It was clean and they had various things kids could play on in the center area. We shopped at a few stores and the employees were all very friendly. ",
  "This is worth the effort! The Outlet has a wonderful selection of shops to visit and I found many great deals throughout the various stores. An enjoyable visit - a must stop!!",
  "It is your typical outlet mall but almost every store that I visited had friendly sales people. It is an outdoor mall so take an umbrella if its raining. ",
  "While we were visiting the Little Rock area, we decided that the Outlets of Little Rock would be a great place to shop. How could you find fault with a Factory Outlet that has such great stores like Banana Republic, Bass Factory Outlet, Brooks Brothers, Carter babies and kids, Clarks Outlet, Cole Haan, Famous Footwear, J Crew, Kay Jewelers, Kitchen Collection (my fave), Lane Bryant, Levi's Lindt Chocolate, Old Navy (also a fave), OshKosh B-gosh and VF Outlet (also a fave). And don't let me forget to mention that they also had a Tommy Hilfiger store where I was able to purchase just the cutest purse at a great price either for myself or as a gift. Also, I was hoping to stop by Starbucks for my Java Jolt but I understand that it won't be open until sometime in the Summer!\n\nHours:  Monday-Saturday 10 am - 9 pm, Sunday 11 am - 6 pm Holiday Hours may Vary\n\nDirections to the Outlets of Little Rock at the Intersection of Interstates 30 and 430\nExit 128 to Bass Pro Parkway.  Outlets of Little Rock is located next to Bass Pro Shops\n\nTravelers Tip:  I always head to their Customer Service desk which was located in their food court for  discount coupons.  And this is the very first place in all my travels where I have come across three designated rest rooms:  Male, Female, and Family (Parents or Parent with an accompanied child or children).  I guess it is because this is a very new Outlet and has only been open for business less than a year!",
  "nice outlet although not big. could find Under Armor and Nike for which I went there. closes early so be sure to have couple of hours to cover the stores. ",
  "Love the way this mall is built, so much nicer than the other outlet malls I\"ve been to.  Love that they have a Lindt candy store, best chocolate ever.",
  "I’m not a fan of outlets, but I’ve visited this place several times. There’s a good selection of stores, with many of them having a good selection of shopping choices. The walkways and grounds are always neat, clean and well maintained. The restrooms are okay, but it would have been nice if they had paper towels to dry your hands. I hate those air dryer things. The location is good because there’s a nice hotel nearby and decent eating options. If you’re thinking about visiting, consider the cooler months because it’s no fun walking to the different stores in hot temperatures.",
  "They don’t let you walk around with your pet around the Outlets. My wife and I stopped recently when traveling and a very rude Security Guard told her our 6 lbs  Miniature Schnauzer puppy was not allowed anywhere on the Outlets grounds.\n\nIf you’re going to be so rude and have a “No Pet Policy” then put up signs that states you’re no pet friendly. This is the first outdoor Outlets mall that is not pet friendly. My wife and I have stopped at many outlets in various states and never encountered this or been treated so rudely",
  "If you don't mind the ins and outs this is a great shopping adventure with something for the whole family. Just make sure you have on a good pair of comfortable shoes and a refreshing treat to beat the heat.",
  "There is a great selection here of inexpensive name brand stores (but be careful, not all are outlets.)  My wife and I have been here several times and always leave with a few items that we picked up pretty cheap."
 ]
},{
 "name": "Statehouse Convention Center",
 "address": "Markham and Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/a7/e0/a7/inside-and-out-of-the.jpg",
 "tags": [
  "walk",
  "food",
  "walk",
  "tour",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d1419984-Reviews-Statehouse_Convention_Center-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Only reason this is not a 5 star review is parking is a pain and expensive. Everything thing else is golden!  Love the area lots of foods, places for coffee and to hang out, shop, walk and picnic!  ",
  "Nestled between two hotels, the convention center is convenient to downtown shops, restaurants and the River Market. It's a great venue for an event requiring accommodations for up to several hundred people.",
  "Great place to see and meet. Was there for conference. The only real downside is the cost to valet park or pay for parking. You will pay $26.00 per day for valet if not validated. Rooms are nice, area has many many food choices. Near the Robinson center so catch a show if you can and next door to the Old Statehouse Museum. I enjoyed the area. ",
  "We stayed at the Little Rock Marriott, which was the host hotel for the Little Rock Marathon. The LR Marathon expo and packet pickup was held at the Statehouse Convention Center, which was attached to the LR Marriott. The Convention Center can be exited at the opposite end from the hotel, which makes it very convenient to walk to the various restaurants located in the River Market area, which is on the same street as the Convention Center. Plenty of space for vendors to set up, and the Convention Center allowed race-themed displays outside the expo hall, which was great for photo ops. ",
  "It was our first time visiting Little Rock and the Statehouse Convention Center. It is beautiful and very well equipped. I was very pleased by the staff and everyone that helped make Arkansas Comic Con 2019 a success! ",
  "I’ve been to many conferences and exhibitions here and find that it’s a good space for meetings with a lot of people. The  location is great. The facility is very clean and modern. ",
  "This was my first visit to the Statehouse Convention Center.  It was bright, modern, and clean.  The halls were well lit, the temperature of the rooms good, and direction signage very helpful.  We found public parking directly across from the center.  ",
  "I visited the Convention center for a private reception.  Although there were no major exhibits or activities planed at the time of my visit, I was able to tour the building and the grounds outside.  This center is centrally located and in walking distance of local stores.  This building is a perfect place to host a convention for large or small groups and has a variety of meeting rooms."
 ]
},{
 "name": "Allsopp Park",
 "address": "3700 Cedar Hill Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/76/ee/5d/wet-beautiful-park-in.jpg",
 "tags": [
  "family",
  "nature",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60766-d6753835-Reviews-Allsopp_Park-Little_Rock_Arkansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Good family park with playground and room to play. My children love playing in the creek that runs through the park.  It’s a great location and we love it.",
  "We noticed this place on the way to a restaurant and checked it out. It’s a nature trail with paths to choose from. The paths are natural so there are roots and sharp rocks you also have to watch out for trail riders on bikes. Neat place it just needs more signage and maybe keep up the paths a little better; overall nice time.",
  "Cute playground & easy, short little trail for the kiddos that goes up to a pavilion.  We went to a really great egg hunt there this year.  The only issue I would have is sometimes the older kids use this as a hangout & then it becomes less appropriate for the littles to be around.",
  "Allsopp Park is a nice park with playgrounds, trails and tennis courts.  We attended a party at the pavilion which is covered and accommodates 20-30 people easily.  The park is much better maintained than when I was a kid and there are plenty of people out hiking and biking even when the weather is colder.  Overall a great place to be outside!",
  "Allsopp Park I stumbled upon while looking at all the beautiful historical homes in Little Rock. The neighborhood was the first “Suburb” of Little Rock. The area is beautiful and when I came across this park I just had to get out and walk it with my dog Kobe. He loved it as well!"
 ]
}]
