[
{
 "name": "Wisconsin State Capitol",
 "address": "Across from 1 E. Main St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/39/4c/6f/photo2jpg.jpg",
 "tags": [
  "tour",
  "free",
  "tour",
  "structure",
  "history",
  "walk",
  "tour",
  "history",
  "walk",
  "knowledgeable",
  "tour",
  "kids",
  "tour",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280436-Reviews-Wisconsin_State_Capitol-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "A stunningly beautiful building unveiled via a great guided tour packed with historical information about everything from the paintings adorning the chambers to the stone in the rotunda. The tour was just under an hour and thus should even hold the attention of distractible children. Definitely worth hiking up a few steps at the end for the indoor and outdoor observation decks.",
  "The Wisconsin State Capitol is a must-see in Madison, especially during the summer time when you can visit the Farmers' Market all around the capitol square or attend one of the Concerts on the Square on the Capitol lawn. The inside is of course a treat, free to visit, and try to go on a day when the observation deck is open for great photo opportunities.",
  "What do i say about a place I have been visiting for 55 years. It is a beautiful building to just look at and absorb the skill and craftsmanship it took to design and build. It's a place to see the history not only of the building itself but of our great state and enjoy the peace and quiet you can find almost everyday here. I go there to walk the marble and stone hallways and just enjoy the quiet as I have over the years and I see something I haven't seen before. You can take a guided tour which they do on a regular basis during the week and be taken to see the Supreme Court and the Senate and Assembly Chambers and hear the history of this great structure or you can just come and walk on your own and absorb the history and who knows maybe you will run into your State Senator or Representative in halls or just go to there door and stop in. Whatever you do come and see your State Capitol building you will not regret it.",
  "If you’re in town, take time to stop in or at least take an outside look. It’s such a magnificent building- day or night. ",
  "We had an extremely good guided tour of the building with an very knowledgeable docent.  We had the pleasure of speaking to her while waiting for the tour.  We were amazed how she managed to control the children during the tour - a ‘child whisperer’.\n\nThe building is stunning in its design and its use of stone and scale.  Amazing to walk the halls, then to stop and look up.\n\nAs a Canadian I’ve noted many times that we simply do not exalt our heritage the way Americans do despite the richness of our history.  They do it better.\n\nGreat job, our many thanks to the Governor and his staff.",
  "Good, narrative tour.  Not a lot of security.  Kids were running around and playing hide and seek.  Beautiful!",
  "You can do a self-tour or a guided tour (about 45 minutes) - The guided tour takes you into a few locked areas including the Governors Conference room as well as the Senate and House chambers.  Lots of fun trivia and information about the capital building itself and the history behind it.  We were hoping to be able to get to either the inside overlook or the outside one, but it was not available in February.",
  "My flight home was cancelled and I was stuck in Madison another day and decided to explore the Capital building. It is absolutely beautiful. They offer free tours almost every hour and everyone at the information desk are really friendly and helpful. "
 ]
},{
 "name": "Olbrich Botanical Gardens",
 "address": "3330 Atwood Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/06/cf/42/olbrich-botanical-gardens.jpg",
 "tags": [
  "free",
  "walk",
  "free",
  "walking",
  "unique",
  "family",
  "walk",
  "free",
  "kids",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d109921-Reviews-Olbrich_Botanical_Gardens-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Some friends and I try to meet up somewhere every fall.  This year I read about and picked this spot as Madison is a halfway point for all.  I was absolutely amazed at this gem - free parking, free access to the outdoor areas and only $2.00 to explore the indoor conservatory.  The volunteers greeted us when we walked into the conservatory, and one went so far as to walk us around and point out all the different areas so that we wouldn't miss any of it.  There is a gift shop that is stocked with seeds, bulbs, cards that can be planted, clothing and much, much more.  \n\nThe conservatory has lush plants, trees, ferns, a koi pond and other water features.  After exploring inside we went out and walked all of the different paths and areas that were very well maintained, and a true sensory treat!  Photography is a hobby of mine, and I came home with almost 60 pictures and could easily have taken more.  We are looking forward to meeting up again in other seasons.  \n\nIf you are in the Madison area, do yourself a favor and take the time to enjoy this wonderful place!",
  "Acres of plantings with natural and created water features will provide an oasis for reflection and delight to the eyes and ears. Olbrich's outdoor gardens are open year round and feature perennial beds, rose garden, rock garden, woodland garden, meadow, great lawn, and the stunning Thai sala, given to the University of Wisconsin by alumni and presented beautifully with reflecting ponds and colorful plantings. Check out their website for details about the many programs, concerts, and membership opportunities. Beauty of the outside gardens will bring you back each season. The conservatory is sure to chase winter blues away with its tropical feel. The outside gardens are free for the walking. There is a nominal fee for the conservatory. Don't miss this.",
  "16 acres of beautiful outdoor gardens that is easy to walk around in - a unique Thai pavilion - and it's all free - no admission charge. And free parking. Family friendly. Nice indoor tropical garden that has a diverse collection of tropical plants (including banana, coffee, vanilla etc - and carnivorous plants - ew !), a rushing waterfall, free-flying birds, and blooming orchids. I think the tropical garden costs $2 to get in to. In Madison in the winter, it's well worth it. ",
  "We took our grandchilden to the Holidays at Olbrich.  They had tons of fun and spent an hour watching the model trains.  We also try to take them to see their butterfly show every year.  What a great place for kids and the adults like it too",
  "A short drive from downtown Madison lies this treasure of colors and nature. Ornated with hundreds of plants and colourful flora from many regions, these gardens are sure to please. Creatively designed and meticulously groomed and well signaled, it is easy to enjoy the grounds and get a lesson in horticulture at the same time. It's no secret that newlyweds flock to this picturesque sight to memorialize their nuptials in vivid colours.",
  "For any age,  a short visit to the Olbrich arboretum at the botanical gardens was really nice.especially in winter.  Cost was $2 each for adults.  A small amount to enjoy the trees, plants, flowers and wildlife they have.  It is small but with variety.   There are places to sit and relax in the setting.  You can take as little or as much time as you like.  Worth seeing.",
  "I love spending time at the outdoor gardens in every season.  Always something to see! The indoor Conservatory is great during the colder months and during the annual Butterfly Bonanza in August",
  "Took a walk into the conservatory on a cold and dreary winter day and immediately felt transported to another place.  The warmth, incredible plants and the resident birds made this a great stop even in winter! Even the walks around the garden were cleared for a nice brisk walk around the grounds.  Love this place."
 ]
},{
 "name": "Henry Vilas Zoo",
 "address": "702 S Randall Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/72/a7/63/henry-vilas-zoo.jpg",
 "tags": [
  "active",
  "eat",
  "food",
  "walk",
  "free",
  "kids",
  "kids",
  "free",
  "kids",
  "free",
  "walking",
  "walk",
  "free",
  "kids",
  "free",
  "active",
  "eat",
  "food",
  "walk",
  "free",
  "free",
  "eat",
  "family",
  "field",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d207431-Reviews-Henry_Vilas_Zoo-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went here with our son and our 2 year old granddaughter.  They had been here before but it was our first time.  It was a very nicely maintained zoo in a lovely park.  It is fairly small which was perfect for the granddaughter- we could walk around and look at everything without her getting too tired or overwhelmed.  It has a varied selection of animals, a merry-go-round and a train ride, a Children's Zoo with a VERY active group of goats which our granddaughter loved, a playground, gift shop and restaurants.  You're also allowed to bring your own food and eat at one of the picnic tables.  It is very popular with the locals so we got there shortly after it opened to avoid the crowds later in the day.  Glad we went and looking forward to returning.",
  "PROS: located on a quiet neighborhood; exhibits just right for most people especially kids; updated habitats look fantastic - the Bison , Polar Bear, Seal habitats. Free parking is good for 3 hours - more than enough for most people and gives other people the chance to park and see the zoo as well .     \n \nCONS: none.",
  "Many things to do in Madison that cost you money but, Henry Vilas Zoo offers so much with no to a little bit of money. Zoo is the perfect size to keep all ages entertained, afterwards the park or beach to picnic, swim, take a trail, have the kids play on the play ground equipment, play ball, ice skate in the winter on & on it goes grew up loving this park and over 50 years later it still is one of my favorite places in Madison.",
  "This is a great zoo to bring young kids.  It is big enough that they can see a wide range of animals, yet intimate enough that you can leave to allow enough time for the kids to nap in comfort at home/hotel.  They host a Halloween event here, where kids can trick-or-treat and see the animals.  Get there early for these types of events as parking can be crazy!  Nice free zoo.",
  "Even as a little kid, this was always one of my favorite places to visit.  And as an adult, it just keeps getting better as they improve the habitat for the animals and add new exhibits.  This is a very clean zoo, and it's obvious the staff puts in a lot of time and effort to care for the animals and make them comfortable.  There is a lot of walking, but there are stroller rentals for people visiting with small children.  This zoo does not charge admission, but there is a place for those who may wish to make a donation for upkeep and care of the facility and the animals.  There is a large, restored indoor carouosel that does charge for riding it, but it's a small fee and is worth it.  There is also a children's area with a petting zoo.  Parking is free, but is limited so get there early unless you want to park further away and walk to the front gate.  This attraction should definitely be on your list of \"must see\" places to visit when in the Madison area.",
  "This is a great place for kids and families.  They work really hard to make sure the animal's environment is appropriate and healthy.  It's free, but bring your appetite because the snack bar is great!",
  "My boyfriend and I have gone two years in a row now after our snowboarding trip at Devil's Head. It's a small zoo in a cute park/neighborhood. It's also free but we try to donate anyway. I have not been in the summer but it's on the agenda this summer!",
  "We went here with our son and our 2 year old granddaughter.  They had been here before but it was our first time.  It was a very nicely maintained zoo in a lovely park.  It is fairly small which was perfect for the granddaughter- we could walk around and look at everything without her getting too tired or overwhelmed.  It has a varied selection of animals, a merry-go-round and a train ride, a Children's Zoo with a VERY active group of goats which our granddaughter loved, a playground, gift shop and restaurants.  You're also allowed to bring your own food and eat at one of the picnic tables.  It is very popular with the locals so we got there shortly after it opened to avoid the crowds later in the day.  Glad we went and looking forward to returning.",
  "This is a very nice place to visit and rightfully so, it is always busy. Grounds are kept very nice.",
  "We took our grand girls on an outing to this zoo.... We enjoyed 2 hours of animal exhibits including lions, giraffes, sea lions and so much more!  Admission is free.... minimal cost to ride the carousel of zoo animals... We enjoyed it a great deal!",
  "I have been to this zoo numerous times in my life and each time it has been uniquely different. My last visit was a reserved pavilion outside \nof the zoo for a family reunion. Just watch out for an occasional odd ball lurking around if you rent one. There was plenty of room for our whole family with enough space to spare for strangers when it started to rain hard outside. You can pull up to the pavilion to drop stuff off, but are expected to park in designated parking spaces afterwards. Although, it would be nice if they offered at least one disabled space next to the pavilion for those who need it. The gift shop has a great selection of educational toys and gifts for everyone. There is a great playground inside & outside the zoo, along with lots of picnic tables to eat at. There is a restaurant inside otherwise that you can buy food at & watch a bear through huge windows while eating. It's really cool! Large selection of animals throughout the zoo. My favorites to watch are the bears. Basketball court & beach in Summer outside of zoo. Great idea for a field trip. Holiday lights throughout zoo in the Winter. Little train and big carousel you can ride for a fee certain times of the year. There is free parking in both the front and back of the zoo. Overall, it has always been a great place to visit. I will definitely be visiting again."
 ]
},{
 "name": "Memorial Union Terrace",
 "address": "800 Langdon St University of Wisconsin",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e1/7a/8a/your-terrace-chair-is.jpg",
 "tags": [
  "free",
  "music",
  "food",
  "music",
  "drink",
  "food",
  "drink",
  "food",
  "music",
  "family",
  "food",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d4480969-Reviews-Memorial_Union_Terrace-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "I'm a local and this is one of my favorite places to hangout during the spring, summer and fall! (It's outdoor, so everything is pretty closed up in the winter, but if you are visiting in the winter, check out the Rathskellar, just inside the union). If you want to hang out in Madison like a local you must stop here! In fact, I met my husband here!  The union terrace is the cultural center of the University whenever the weather is nice (for locals, that means anything above freezing). There is live music several nights a week during the summer and fall. You can rent a kayak, canoe, or stand up paddle board and head out onto the lake. If you have your own boat, you can even boat in and tie up for a beer at the union. This is one of the only student unions in the country where you can buy beer, and there are lots of great choices, local and national. There is also Babcock ice cream, a Madison favorite. As the student union, technically you have to be a member of the Wisconsin Union, UW student, or UW staff to buy food or drinks here. If you are asked for a union membership card and you don't have one, they will often give you a free one day pass to the union, or you can always ask someone else to buy your beer for you. Wisconsinites are super friendly, so you won't have trouble finding a smiling stranger to help you out. \n\nWARNING: I have heard rumors that the union will be closed for remodeling during the summer of 2016, but I can't confirm.",
  "The terrace is 100% UW-Madison. Go in warm weather when the beer is flowing and live music is playing and the sun is shining and the terrace is filled with people (although there always seem to be open seats). Sit back and watch the watch, drink your beer, listen to the music and remember (or enjoy) your college days.",
  "The Terrace was packed both days of this past weekend when we visited.  We sat lakeside, enjoyed the view and weather and relaxed for a while.  It's an awesome place to hangout, talk and people (& dog) watch.  There is food and drink available if wanted but not required.",
  "This iconic place is so wonderful in the summe r- the chair are legendary and the view is a million dollar!",
  "Love always coming here when visiting the college student, and any other time we are in Madison in the summer.   I love that they have champagne!   The food offerings and entertainment are great, it gets very busy.  The view and ambiance are so fun!",
  "Full disclosure, I am from Madison, attended UW many years ago, so have been to the Union countless times.  Their recent upgrades means you have more choices for food and more options for seating out on the terrace, which sits along the shires of Lake Mendota.  In addition to the frequent live music in summer, this is a very family friendly place for strolling along the Lakeshore path.  Amazing sunsets, many docks to view the water more close up, and a wonderful place for many ages.  Highly recommended: the cheese curds (deep fried) from the rathskeller.",
  "Great people watching as well s a place for young kids to feed ducks and to just play. The food and drinks are excellent. Possibly the number 1 spot for visitors to Madison.",
  "xox This is the only semester I am exchanging to UW-Madison and I love this place so much. \n\nWhen I first visited the terrace three months ago, I has just got dumped by my ex and lost my phone. At the first glance of the terrace I could feel a remedy for me. \n\nI love Ice cream with Union Utopia flavor! I badly love this name. And I love it that I got lost phone at the bus company! \n\nI literally love everything here! And I love me here. "
 ]
},{
 "name": "Madison Farmer's Market",
 "address": "20 East Mifflin Capitol Square",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/15/21/27/madison-farmers-market.jpg",
 "tags": [
  "tour",
  "music",
  "free",
  "art",
  "food",
  "family",
  "food",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d486864-Reviews-Madison_Farmer_s_Market-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "If I offered one tip on the market, it would be to go first thing in the morning.  That way you beat the crowd, while being exposed to all that is offered.  The market has everything - fresh cheese curds, vegetables, beef sticks, honey, bakery, flowers and plants, herbs, popcorn, and much more.  Can’t beat the cheese bread.   ",
  "The farmers market is all around the capital building. When we were here there were also old timey cars on display all around the streets so those were fun to see, not sure how often they do this.  This farmers market was great, lots of variety of items and very good quality items. They had flowers, fresh produce, tomatoes, asparagus, mushrooms, onions, peppers, honey, jams, all kinds of sauces and dips, baked goods, breads, brownies, cookies, fresh meat, beef jerky.  I am not sure of the exact vendor name but we got some peppered beef jerky and it was amazing, I was sad I didnt get more.  ",
  "The Madison Farmer's Market held on the Capitol Square each Saturday morning from mid-April through the first week in November, is the largest producer-only farmers' market in the U.S. \n\nFor most visitors it is probably more about noshing some pastries, gawking at some of the crowd and just plain socializing with others in an absolutely beautiful setting, than it is about buying veggies for the week.\n\nReturning to Madison for an all-to-brief visit, there was no way that we could miss this signature event.  We prefer to start early, ridiculously early, shortly after the 6:15 opening of the market.  The market is open until 1:45, but most of that time the crowds are so huge that we shy away.\n\nIn addition to farmers sharing their produce, crafts people sell their wares and local music groups perform for the crowds.  \n\nThere are also numerous people dedicated to various political or social causes handing out literature and being engaged by members of the public who agree or disagree with the view points being presented.  In other words, the market is \ndemocracy in action.\n\nThe event is free and open to everyone.  There is NO need what-so-ever to pay for a tour of this event.\n\nThis is a MUST DO introduction to the wonderful city in which it is held!\n\nWe Recommend it MOST HIGHLY.",
  "This farmers market is one of the largest and most diverse in the region. It has local produce, flowers, and food. Check the local calendar to find special weekends for various events like the art on the square. Get to the farmers market early (before 9) to beat the crowds then enjoy one of the great brunch places on the square.",
  "We had a family reunion in Madison this past weekend.  We were pleased to find out that the farmers market opened this past weekend, which I think is a bit early.  Best selection of any market I've been to. Get there early to beat the crowds if you can.",
  "The place to be on a Saturday morning in summer. Go early or late if you don't like crowds BUT crowd watching is part of the fun! You can buy fresh produce and other foods PLUS have an elephant ear and coffee for breakfast!",
  "We've been to the Farmers Market a few times and always find something new to try, and lots of stuff to bring home. Definitely will visit Madison Farmer's Market again,",
  "This is the best farmers market in the state. Also love street performers and food trucks. The whole square is full.",
  "Took wife here.  Always a treat.  This Saturday was very cold and windy for 1st weekend in November (just had 8 inches of snow) so crowds and vendors down a bit.  That being said, to see the mix of earth muffins, students, tourists, locals, and farmers is worth it alone.  Then add on the produce, baked goods, meats, and cheeses!  O.M.G.  10 days later, as I type this (yes, this Florida boy finally thawed out) I am grawing on beef sticks and cheese curds from there.  Had blue popcorn I bought there during the Packer game yesterday!  \n\nJust do NOT check your cholesterol for 3 months after visiting Wisconsin!!! ;)  Enjoy!",
  "We enjoyed this farmer's market, and would have bought lots of things except we were traveling by air. So we settled for consumable items that we could eat up right there. We went on a gorgeous sunny day in October, and it was crowded, but if you went with the foot traffic flow, it was fine. We stayed in a hotel that was walkable to the market, so didn't have to worry about parking.",
  "There was amazing food, great local produce, cheese and breads! Also a great flower selection and god several jams!"
 ]
},{
 "name": "Capitol Square",
 "address": "2 East Main Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/af/ec/f1/capitol-square.jpg",
 "tags": [
  "food",
  "tour",
  "learn",
  "food",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d282451-Reviews-Capitol_Square-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "This has one of the best farmer's markets that I have ever seen.  It circles the entire mall.  The mall itself is very peaceful and quiet except on Saturday mornings.  I only wish that there was more seating to enjoy the park",
  "An essential part of any trip to Madison and the Madison experience. Capital tours, a couple of museums, and lots of good food choices",
  "It is always exciting to tour the Capitol Square and surrounding shops, particularly durring Farmers Market season.  There are thousands of great things to explore and learn.  Fun food samples at the Farmer's Market.  There are even posters at the Market and one  can get acquainted with the cows and goats supplying milks made into the Artisanal cheeses at the market.   Exciting bookshops near the Capitol too.  ",
  "Restaurants and shops surround the Capitol Square area.  Nice central place to visit family who live in Wisconsin.",
  "Each time I am in Madison there is also something going on at the Capital Square.  On Saturdays (not in the winter) there is the Farmer's Market that had and endless number of vendors.  There are often bands or performers depending on the time of year.  The Capitol building itself is just beautiful, not something you see often."
 ]
},{
 "name": "State Street & Downtown Madison",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/22/8a/2a/state-street.jpg",
 "tags": [
  "walk",
  "unique",
  "eat",
  "kids",
  "walk",
  "walk",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d281199-Reviews-State_Street_Downtown_Madison-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great pedestrian, bike, and public transportation only street with lots of shops and restaurants. Starts at the Capitol and ends on campus. Walk to the Memorial Union for a beer when you are done!",
  "Unique shops\nLots of places to eat if you get hungry \nGreat place to get in the holiday spirit\nYou can also visit the Capital and see the Christmas tree, it's beautiful",
  "Running from the edge of the UW campus to the capitol, this street turned pedestrian mall is packed with small restaurants offering a wide variety of different cuisines as well as an assortment of eclectic shops. On a sunny day, it is a great place for some people watching - college kids, old hippies, state employees, etc. Unfortunately, there are a lot of cross streets that still have traffic, so your meandering will be interrupted every block or so while waiting for the lights to change, but that just leaves more time to watch the show or window shop.",
  "It’s so fun to return to Madison and walk here as we did yesterday. As I expected, there were some new, cute shops to browse and buy a couple things. No cars are allowed on State coupled with the university students, it’s just a great place. ",
  "Enjoyed going in stores and seeing what restaurants there are in the area. I enjoy the area and feel safer in the daytime.",
  "We often walk State Street from the Capitol to the UW Union.  In between, there are lots of in shops where you can browse, cafes where you can grab a hot tea for sustenance, and plenty of interesting restaurants if you get hungry.  After you get to the Union, go out onto the terrace and have a beer in the summer.  In the winter, you can see the folks ice fishing, but you’ll have to get your beer inside!",
  "We were here just a short time but we enjoyed our walk in the area around the Capitol. We noticed and visited some of the nice stores and restaurants. Parking was easy. We even enjoyed playing a bit of corn hole on a set which was set up out side some stores. \n\nWe are not experts - but the area around the Capitol - in daylight - was very nice.",
  "I'm torn on my rating of 3 vs 4, but this was  comparable to most other big cities I've been to. It was clean, had a lot of national stores (many I can find anywhere) and some local and was pretty well maintained.   The traffic wasn't too bad.  \n\nMost people did their thing and I only heard a few groups of people arguing, one of which almost resulted in a fight.\n\nIt's worth walking around the city for the experience.  If you're a college kid and or into the bar seen this would be a good place to go.\n\n"
 ]
},{
 "name": "Chazen Museum of Art",
 "address": "750 University Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/09/c2/4b/chazen-museum.jpg",
 "tags": [
  "art",
  "free",
  "art",
  "free",
  "free",
  "learn",
  "art",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d109920-Reviews-Chazen_Museum_of_Art-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "This university museum of art has a wonderful collection of various art items (paintings, statuary, jewelry, textiles). It aims to show samples from every era in western, African, Indian and Oriental regions.  They have well known artists, but small ones, so that they can also have funds to purchase/show other artists.   The cost? - it’s free. ",
  "This beautiful university art gallery has no admission charge.    The galleries are bright and creatively filled with an interesting mix of works.  The art on display includes paintings, sculpture and ceramics from antiquity until the present time.  ",
  "I really enjoyed my time at the Chazen Museum which is on the University of Wisconsin campus.  The museum is free and has tons of galleries with a large variety of works.  I had only 2 hours to explore, and could have been there longer.",
  "Snowy day in Madison but warm, cozy and oh so interesting inside the Chazen. The exhibits were varied and displayed as to get the optimum view of each piece. In some places the lighting should have been more luminous. Another great FREE museum. Thank you.",
  "My wife and I went to spend the morning at the cafe and the museum.  Despite what the signs, the website, Google, and this site say, while the cafe is open at 8am, the mise only has one tiny gallery open at 8am. \n\nYou can't claim you are open when 80% of the museum is closed until lunch time. And please don't be condesendimg to me when you finally notice I'm try to find away to the rest of the museum. How about a closed until 11am sign instead of.makng me guess. I understand that you are a teaching institute, but if you want to be open to the public, learn a little something about serving the public. Fix you signage and teach your staff how to talk to the public. ",
  "My daughter is interested in the arts,  so we visited this museum while in town. She/we really enjoyed it. It is rather large with quite a variety of work to view.",
  "This is a fabulous collection with temporary exhibits.  There is a wide range of art and period styles.  Admission is free. \nThere were students from the College of Dance practicing in the foyer. There is a nice coffee shop with some gift items.",
  "They have a new cafe with wifi, treats, espresso, and gifts.  It's a gift shop with benefits!  I already bought a book and a few mochas.  Really nice addition to a great museum!"
 ]
},{
 "name": "Camp Randall Stadium University of Wisconsin",
 "address": "1440 Monroe St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/1e/88/93/camp-randall-stadium.jpg",
 "tags": [
  "food",
  "walk",
  "historic",
  "history",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d3606130-Reviews-Camp_Randall_Stadium_University_of_Wisconsin-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Been to many stadiums, and this is one of the best if not the best in the land. Awesome fan base, great team. Don't miss the jump around between the 3rd and 4th quarter - it's quite the sight. ",
  "Don't be coming to Madison in the fall without getting out your Red and White to support the Badgers at a home football game.  A truly uniquely Madison itinerary item.  Bike, walk, take a cab or park and tailgate.  Plenty of restaurants, bars and pop up food carts across from the stadium and Mickeys Dairy Bar.",
  "One of the best stadiums in the nation to watch college football. A historic landmark with several modern amenities. College game day is an all day event in Madison and crowds can get a bit rowdy (intoxicated) but security does a good job of keeping the experience safe. ",
  "Lots of history here in this lovely stadium. There isn't a bad seat in the bowl but it does get VERY loud if you are near the student section.  Be sure to be in your seat for the Jump Around.",
  "So much fun and sportsmanship.  I love going to see the Badgers.  Great updates to the place are coming.",
  "Fun time at establishments around the stadium, just a great place on game day. It is indeed a great stadium to watch a game. Crowd knows there football, I get the complaint about the lines for restrooms,  but aren’t all games professional and college have that problem?",
  "This was my 2nd College game and it was much better than the 1st. I attended the Badgers vs Hawkeyes game and it was a cracker. \n\nWe were driving up to Green Bay for the Packers Panthers game from Chicago and got lucky that the Badgers were at home to stop off at on the way up.\n\nThe tail gate areas around the place were great, the atmosphere was crazy and everyone was just up for having fun which was good. There loads to do around State Street and those roads up to the Town Hall more so around the campus area but the more you walk to the stadium the more tailgating was happening.\n\nThe stadium from the outside looks a bit bland but when you get inside it’s got a much better feel to it. I like the fact it’s all still bleachers to sit on as it’s got an old school vibe, keep them going forever! I was surprised when I saw the capacity was around 80k, it seemed a lot lower but I guess the bleachers help keep those numbers up!\n\nThe actual game atmosphere was great, my only slight issue was that the student section took so long to fill up? The regular ticket holders around me said that they bring them in row by row and stagger it which I guess is for safety reasons but some of them were still getting brought in at the start of the 2nd quarter which seemed a bit silly to me and unfair on them. The marching band were great and all of the entertainment bits during the game were really fun too.\n\nThis was a great experience and one I’d definitely recommend to everyone. I loved it.",
  "We watched a close game between Wisconsin and Iowa. I picked a line at the food service that was the slowest. The person taking the order would only take one order at a time, and he had to wait for everything to be delivered to him for the customer. This was after halftime. The game was great. The restrooms always had lines, but they moved very quickly. "
 ]
},{
 "name": "University of Wisconsin-Madison Arboretum",
 "address": "1207 Seminole Hwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/5f/46/31/the-arboretum-s-wisconsin.jpg",
 "tags": [
  "free",
  "family",
  "kids",
  "nature",
  "walking",
  "field",
  "family",
  "nature",
  "walking",
  "walk",
  "educate",
  "free",
  "active",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d147145-Reviews-University_of_Wisconsin_Madison_Arboretum-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "I moved to Madison in 2005 as a graduate student, and ended up settling here to raise a family. The Arboretum has always been one of my favorite spots, and a great retreat from the city (and part of what gives Madison its charm and stops it from feeling too much like a huge city).\n\nIn the summer and fall there are beautiful hikes through both wooded and prairie landscapes. In the spring the Longenecker Gardens have an amazing collection of lilacs (every shade of lilac imaginable, ranging from white to lavender to dark violet to pink) that infuses the air with its scent, as well as many flowering magnolias and crabapples.  In the winter, you can cross country ski/snowshoe in the trails and find the 'lost city'.  \n\nSince it's affiliated with the university, there's a lot of research going on as well as various educational programs/tours/walks and exhibits in the visitor center.  Also, it's free!  My kids love exploring it and we've really only seen a small fraction of it, and I hope it continues to foster a love of nature in them. It's a nice way to get them off their screens for awhile.",
  "If you are a fan of prairie restoration, you won't want to miss the birthplace -- Curtis Prairie. You can tell a lot of work and love goes into keeping this prairie vibrant. I visited in December, during a snowstorm, and someone had thoughtfully cleared (at considerable effort) some of the trails so they were accessible. Amazing winter colors, great wildlife (saw a flock of turkeys, a red-tailed hawk), and an easy to get to warm-up spot with restrooms at the lovely visitor center and shop, where I dropped some $$$ on books and gifts. Beautiful metal sculptures at the prairie entrance enhance the experience. Don't miss this prairie!",
  "The Arboretum is divided into two different locations; north and south of the belt-line. From Grassland to Shrubland, Lake Wingra, and botanical research garden your will enjoy your time there. If you are feeling ambitious there is a 10K (6 mi) road/trail around the lake that is filled with smiling faces. Keep you eyes open for red fox, coyotes, wild turkeys, red tailed hawks, eagles, woodcocks, whitetail deer plus all the birds from three communities.",
  "The UW Arboretum is a peaceful escape from the urban crunch any time of year. Whether biking, walking, skiing or paddling, there's plenty of peace and opportunities for solitude amid the prairie and forest environs. Watch for deer and wild turkeys too. Keep in mind that the Arboretum Drive is blocked for through car traffic at the visitor center. Bikes and other non-motorized modes can proceed the entire length.",
  "I'm biased from having grown up in Madison and going there, but I absolutely love the Arb. The range of different habitats there is astonishing--two different prairies, swamps, evergreen and deciduous forests, horticultural garden...what a groove! Don't miss the duck pond off of Nakoma Road--the ducks are there all year--and the Lost City in the eastern end of the Arb, where streets were laid for an ill-fated, never-completed subdivision in the 1930s.",
  "There is a lot to enjoy and bring your bird watching binoculars - it's a nice time and relaxing too!",
  "I have loved the arboretum since I was a child. I used to loved exploring the woods with family or in a school field trip. It has been a place that I have enjoyed over the years with my children. Spring is my favorite time, when the flowered trees are all in bloom and fall as the leaves are turning colors.",
  "This Arboretum is conveniently located near the UWisconsin campus.  There are many walking paths throughout, only a few hard service, unless you walk the road, which many people do.  It is very peaceful with many birds and small animals.  You can educate yourself more about the area near the nature center.  There is praise and woods, bring your hiking shoes to see more, especially if it snows.",
  "A free arboretum visit is a rarity.  This one is an active project of the Univ of WI and I'd learned that they have the largest collection of lilacs!  I'm looking forward to going back in the Spring.  \n\nAlthough there really was very little to see or do in the Fall the volunteer staff and visit to the small, uniquely stocked book/ gift shop as well as clean accessible bathrooms still made it a pleasant stop!",
  "A fine central free attraction, good parking, visitor centre, marked trails in the extensive woods, great variety of shrubs and trees, most named in the garden, all within the central hub giving an obvious boost to the local environment.",
  "We spent a few hours with my son and young granddaughters. I was really impressed. Lots of trails, very pretty. The only complaint is it's not stroller friendly. "
 ]
},{
 "name": "Kohl Center",
 "address": "601 W Dayton St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/72/7e/ac/senior-day-big-10-champions.jpg",
 "tags": [
  "food",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280429-Reviews-Kohl_Center-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Thoroughly enjoyed our visit to the Kohl Center for a concert that was sold out. Parking can be difficult if you're running late. Otherwise, it's a top notch facility, clean and modern with enough rest rooms.",
  "We always enjoy going to see Badger basketball and hockey games each year. The majority of the seat options are very good with a great scoreboard and sound system. The food concessions offer some decent choices and the bathrooms are convenient and clean. ",
  "We visited the Kohl Center during the summer and thus there wasn't much going on.   The people were very friendly and & helpful.   The woman at the desk even looked up an ice cream shop for us.    We enjoyed walking around the Kohl Center & seeing all the awards, trophies, tributes to the athletes.    We were lucky enough to catch a glimpse of the basketball team practicing.  We were very politely asked to leave the practice session (We understand outsiders aren't allowed to watch practice, although I have to admit I was excited to see some of my favorite players.   I live several states away from WI so I never get to see a live game).    Nice facility!!",
  "We watched a Badger hockey game over the Thanksgiving weekend.  It was fun and the fans have lots of team spirit.",
  "One of the newer and nicer arenas to watch college basketball and hockey. There are plenty of concessions and restrooms though both can get crowded during intermissions. Take a moment and enjoy the historical displays on the outer wall throughout the 100 level lobby. Spend the extra money to get a 100 level seat for sporting events. The seats are comfortable and close to all of the action.  ",
  "Kohl Center is a great spot for college sports.  Great seats, easy parking and a world class institution.   On Wisconsin.  ",
  "Simply the best in terms of aura, facilities, slick, well orchestrated digital playbacks / fun audience views and and experiencing the excitement of basketball games first hand.  Would highly recommend it to anyone discovering or just loving basketball.  There is nothing like a live game!!!",
  " I was in Madison on business for a month, so I thought I’d check out a Badger basketball game. I got my ticket easily online  and I was happy to sit in the farthest seat you could sit in. My back was literally against the far outside wall! Thank goodness for the large TV screens in the middle! I enjoyed all the traditions they had - Like singing songs (varsity) and swaying back-and-forth and making a W with your two hands and more . The only problem I had was parking.  I suggest they have more parking around the stadium on the campus ."
 ]
},{
 "name": "Madison Children's Museum",
 "address": "100 N Hamilton St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/9f/fc/95/madison-children-s-museum.jpg",
 "tags": [
  "walk",
  "food",
  "history",
  "structure",
  "creative",
  "kids",
  "art",
  "food",
  "eat",
  "kids",
  "art",
  "food",
  "creative",
  "kids",
  "food",
  "walk",
  "art",
  "family",
  "eat",
  "food",
  "cheap",
  "family",
  "active"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d109918-Reviews-Madison_Children_s_Museum-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Several times per year, MCM provides an evening called Adult Swim with themes to go play!  This place is full of innovative, highly visual, and fun activities. ",
  "Great children’s museum with lots to see and do.  Our 7 yr old granddaughter loved the craft room and there was plenty to keep everyone aged 6 months to 6yrs old busy and happily exploring.   A good value for the cost!",
  "My 11, 8, and 5 year olds had a blast exploring this highly interactive and innovative children's museum. It's high candy for kids and adults alike from the moment you walk in and see the 5 and under Wildernest area on the lower level while looking straight up at the open staircase to see the older kid climbing play structure \"thing\" that you have to see to believe. Naturally, we went straight up to climb and slide. Great energy burner and the slide is steep/fast enough that kids don't get held up waiting to go. Next we made our way through the coops to cathedrals portion. I was fascinated! I had no idea about the history of Frank Lloyd Wright- I knew he was from Madison but I learned so much about his life and design ideas. There was everything from the types of blocks he played with as a child to a fun barn space for kids to try out building and chores to a functioning \"studio\" space where they can try to design a dog house with large interlocking puzzles pieces. So cool! I finally weaned my kids off this section because I was eager to check out the rooftop. For older kids the staircase is yet another helpful energy burner (up a few flights). The rooftop is beautiful and another creative place to explore, with interesting garden spaces and indoor lab space to check out beetles, turtles, and other small animals. There's also a chicken coop outside, plus a couple of small climbing structures and beautiful look out spots (especially fun for us out oft owners). The one last thing my daughter wanted to do was the giant hamster wheel back down by the climbing structure. It's a fun little novel thing to do but be prepared to wait a few minutes in line since it's open sporadically as staff are able to come and open it. I assume it's open more readily on weekends. And now a few logistics: I bought my tickets online ahead of time to see if it saved any time. For one adult & three kids it was just over $31, so not bad. It saved a few seconds when we walked in, but since there wasn't a separate line I was confused about how this would help on really crowded days. We were there on a June Tuesday afternoon. Parking was crazy easy since a street space opened up right outside the front door. I also saw multiple parking structures, so even on weekends I figure parking is not impossible. I saw that they allow you to bring food in to the cafe, which is super helpful. You can bring in food for the little ones just within the Wildernest, also helpful. Bathrooms and elevators were really easy to find once inside. I also appreciated that they had environmentally friendly features like high flow/low flow toilet flushers and hand dryers. Most of all, I appreciated the time and effort that clearly went into making this an amazing space for a wide variety of ages.",
  "My husband, 2 year old son, and I have been here twice and love it! On the roof top they have a green house, chickens, a rabbit, and variety of reptiles. On the second floor they have a dedication to Frank Loyd Wright, a huge slide, art room, and mock pizzeria. The first floor is really interactive for the little ones complete with a huge tree house, water room, puzzles, and othe fun stuff. It is really worth a stop if you have young children!",
  "I have taken my grandson here at age 3 1/2  He loved it. Plan a half day.  They have so much to do for kids.  Make sure your child has good shoes, and clothes for climbing, and playing.  I would eat before you go. They have food, but it's not great.  The ice cream was good though. ",
  "We've visited a number of children's museums and enjoyed this one in Madison. Although it's downtown and literally right across the street from the capital building it's easy to get to. One and two hour street parking is available and there is a municipal lot across the street if you'd like to stay at the museum longer. If you use the lot be sure to ask for a parking voucher when you buy your admission it will give you a discount. The museum is not as large as I expected it to be. Great use of upcycling items into fun, creative, learning experiences for kids. The art area was our favorite with a variety creative options to get hands on with. The rooftop looks fun and we visited it briefly because it was chilly outside. There is a small building on the rooftop with chicks, snakes, rats (yuck) and turtles - worth a look. Although we stayed for four hours - plan on two hours or more depending on your level of interest. There is a café but with limited food offerings - at 1pm they were only offering ice cream. Ideal ages would be 1 year to 8 years. There is a large area dedicated to five and under - looked fun but we did not investigate as we exceeded that age group.",
  "We have come here frequently over the past few years, at least twice each year.  Keeps my 11, 8, and 6 year olds busy for several hours.  This last time they each brought a friend and all their friends loved it--they didn't want to leave after 5 hours there!  Only thing that needs to change is the snack/lunch area.  This was the 1st time we didn't pack a lunch and I wish we would have.  The guy working it was so rude to everyone we saw walk up and order, including young children.  This is not the place for him.  The food isn't that great to begin with but on top of being rude, we just flops your plate down where it either is about to fall off or in one case, the mac & cheese fell off the plate and partially on the floor.  Then he was disgusted that happened and acted like it was the customer's fault.  Please replace him!",
  "We used the trip advisor coupon and a family of four was $35 but don’t think I would have paid full price. Nothing really interactive more like a big indoor playground. Baby dolls and dress up & art station but my 8 year old seemed bored.",
  "The museum is great for children! My son had so much fun, he could of stayed all day! However the cafe is terrible! Bring your own food to eat lunch. It wasn't expensive, but the quality was terrible.",
  "Several times per year, MCM provides an evening called Adult Swim with themes to go play!  This place is full of innovative, highly visual, and fun activities. ",
  "My toddler (2) wore herself out here on a drizzly winter day\n\n. She's really active and high energy, and yet there were things she focused on for 20 minutes or more. The Lego wall, the life-sized baby dolls in the under-5 area, coloring area, and even a zebra chair kept her entranced. We were there for nearly 3 hours, and she fell asleep in the car within 30 seconds. \n\nPrice: It's $9 per person, or $135 for an annual family pass. Not cheap, but if we go as a family 4 times, it's worth the annual subscription. Given how much my kid loved the place, they can have all of my money.\n\nParking: There are a few street spots nearby, but it's easier to find parking in the nearby garages.\n\nStorage: There's a coat area. There are a few lockers (quarter-operated), but an open cubby area filled with bins and coat hooks.\n\nRestrooms: They have changing areas and stepstools at the sink, but I didn't see any smaller toilets for the little ones."
 ]
},{
 "name": "Lake Mendota",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/7e/5e/52/lake-mendota.jpg",
 "tags": [
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d109925-Reviews-Lake_Mendota-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "We stayed at the Edgewater Hotel and spent considerable time overlooking the lake overlooking the lake and enjoying a beverage and Enjoying a beverage.. It was very serene.. I only wish we had we had the time to take him some water sports..",
  "The largest and deepest lake in the Madison area and the one with more of the larger sport fish (muskie, walleye, etc)",
  "Going around lake Mendota and through Tenny lock to lake Monona to see all the shore lines and the State Capital in Madison Wisconsin is a great day on the water ",
  "easy walk from Livingston Inn and enjoyed the sunset\n\n'pioAs'jmeos[irgjvpoIUWEHFOIPQakwLS\"F:lvm[oiwqePUDOIPA\"DFPVM:AOWIDFBN",
  "Going to Lake Mendota, the largest of the four lakes surrounding Madison, Wisconsin, feels like a visit to an ocean. Ripples break along the shore, seagulls fly overhead, and green hills form the distant view. It's a lovely spot for a picnic, or a place to simply rest and meditate.",
  "We ate lunch in the square and took a stroll to the lake on way thru town.  Nice little stop with lots of people in the park.",
  "We stayed at the Edgewater Hotel and spent considerable time overlooking the lake overlooking the lake and enjoying a beverage and Enjoying a beverage.. It was very serene.. I only wish we had we had the time to take him some water sports..",
  "The largest and deepest lake in the Madison area and the one with more of the larger sport fish (muskie, walleye, etc)"
 ]
},{
 "name": "University of Wisconsin - Madison",
 "address": "716 Langdon St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5a/a3/26/some-architecture-on.jpg",
 "tags": [
  "history",
  "wander",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280438-Reviews-University_of_Wisconsin_Madison-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a lovely campus, we walked in late afternoon on a friday.  Lots of people watching and some great restaurants and sites.   Make sure to see this is you are in Madison.",
  "I graduated from UW Madison 50 years ago, and loved it greatly. We have been back many times to visit. A lot has changed, but a lot has stayed the same.",
  "I graduated from University of Wisconsin in 1963. Just returned for a first after many years.  The campus is beautiful, situated on a beautiful lake.  The Rathskeller was the highlight,  filled with wonderful memories.  Even visited my first year dorm.",
  "Nice situation, well spaced out buildings, good access, interesting history, friendly staff and the lakeside aspect stunning.",
  "We've visited most of the colleges across America over the years, and Madison is tough to beat. Situated between two lakes, there is the history combined with excellence in education that puts this university near the top of the list. Loved Bascom Hill, the old Student Union, proximity to State Street, and the sprawling, yet very manageable to walk campus. The surrounding residential neighborhoods are nice to wander through also."
 ]
},{
 "name": "Wisconsin Veterans Museum",
 "address": "30 W Mifflin St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/68/13/94/vietnam-somehow-they.jpg",
 "tags": [
  "art",
  "history",
  "free",
  "walking",
  "free",
  "learn",
  "art",
  "history",
  "art",
  "free",
  "organized",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d109917-Reviews-Wisconsin_Veterans_Museum-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "In our travels from coast to coast, my wife and I love to visit art museums and history museums. In Madison, Wisconsin, we visited the Wisconsin Historical Museum, the Chazen Museum of Art and the Overture Center for the Arts. Then one of the docents at the Chazen asked: \"Have you been to the Veterans Museum?\" Now we have. We would have been disappointed if we had missed it. Located at 30 West Mifflin Street, the Wisconsin Veterans Museum was founded in 1901 and has been housed at this site since 1993. Dedicated to the soldiers of the state of Wisconsin, it is composed of two galleries that chronicle the history of their service in the nation's wars from the Civil War to the Persian Gulf War to the War on Terror through exhibits, videos, maps, photographs and dioramas. The 19th century gallery showcases Wisconsin's involvement in the Civil War, including a large diorama depicting the Battle of Antietam. Three Wisconsin regiments formed part of the famed Iron Brigade that fought in most of the major battles in the eastern theater, including Antietam, Gettysburg, Chancellorsville and Petersburg. In the 20th century gallery, see exhibits that illustrate Wisconsin's roles in the Mexican Border campaign, World War I and World War II and the Korean, Vietnam and Persian Gulf conflicts. Many historical firearms and three full-scale aircraft also are on display--a Sopwith Camel from WW I, a P-51 Mustang from WW II and a Huey helicopter from the Vietnam War. Even if you aren't from Wisconsin, a visit to the Wisconsin Veterans Museum is a very sobering and educational experience.",
  "Amazing museum with great exhibits for FREE! Would visit every day. Only downside is the cost of parking. Also, can something be done about the homeless people on the side of the building? I was very uncomfortable walking by and one of them tried to sell me urine scented soap. ",
  "Wisconsin sons and daughters have fought in all of America's wars since she joined the Union (and no doubt individual settlers were engaged in earlier conflicts as well). This museum strikes a good balance between artifacts and interpretive displays - there are plenty of both to give the visitor a detailed view of the actions and sacrifices of these men and women starting with the Civil War through the Global War on Terror. You can easily spend an hour or more looking through the two galleries and then spend a little time in the excellent gift shop to stock up on some books to learn more or pick up some souvenirs. Admission is free, so the price is certainly right too!",
  "In our travels from coast to coast, my wife and I love to visit art museums and history museums. In Madison, Wisconsin, we visited the Wisconsin Historical Museum, the Chazen Museum of Art and the Overture Center for the Arts. Then one of the docents at the Chazen asked: \"Have you been to the Veterans Museum?\" Now we have. We would have been disappointed if we had missed it. Located at 30 West Mifflin Street, the Wisconsin Veterans Museum was founded in 1901 and has been housed at this site since 1993. Dedicated to the soldiers of the state of Wisconsin, it is composed of two galleries that chronicle the history of their service in the nation's wars from the Civil War to the Persian Gulf War to the War on Terror through exhibits, videos, maps, photographs and dioramas. The 19th century gallery showcases Wisconsin's involvement in the Civil War, including a large diorama depicting the Battle of Antietam. Three Wisconsin regiments formed part of the famed Iron Brigade that fought in most of the major battles in the eastern theater, including Antietam, Gettysburg, Chancellorsville and Petersburg. In the 20th century gallery, see exhibits that illustrate Wisconsin's roles in the Mexican Border campaign, World War I and World War II and the Korean, Vietnam and Persian Gulf conflicts. Many historical firearms and three full-scale aircraft also are on display--a Sopwith Camel from WW I, a P-51 Mustang from WW II and a Huey helicopter from the Vietnam War. Even if you aren't from Wisconsin, a visit to the Wisconsin Veterans Museum is a very sobering and educational experience.",
  "This museum, along with The State Historical Museum and Chazen Museum of Art, are the must-see trio in Madison. Beautifully reconstructed dioramas, as well as plentiful historical firearms, are at the core of this museum. The story line goes from war to war in chronological order, and covers some little-knnown conflicts as well as major wars that everyone is aware of. My only grudge here is they don't allow flash photos, so it's hard to make good photos while visiting (hence four stars instead of five in ratings)",
  "Great museum & It’s free!  The only suggestion I have is a bench near the videos would be nice.  Also some handicap parking would definitely would help people to come to the museum.  ",
  "A must see place in Madison.  The layout is very organized. You can walk from the Civil War to the War on terror.  I was there with my niece and the reality of hand to hand combat moved her.  As a country we have invested the lives of our men and women into keeping us safe.  Visit.  Remember.  Honor.",
  "Overall a nice museum focusing on the history Wisconsin and is vets played in numerous wars. Relatively small, you can see everything in about an hour. "
 ]
},{
 "name": "Monona Terrace Community and Convention Center",
 "address": "1 John Nolen Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/0f/78/ba/monona-terrace-community.jpg",
 "tags": [
  "tour",
  "history",
  "walk",
  "wander",
  "free",
  "tour",
  "walk",
  "music",
  "food",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280671-Reviews-Monona_Terrace_Community_and_Convention_Center-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whether you are attending an event, taking the guided tour, or just stopping in to admire the view of the lake, it is worth the trip. This is a Frank Lloyd Wright designed building, but the history behind it is really interesting. We stopped in just to walk around the main floor and admire the view of the lake from the inside, and then walked upstairs to the outdoor terrace. My husband and son had never been here before, and they were blown away by the views of Lake Monona and the Capitol. I find Monona Terrace and the Capitol building to be the two \"must see\" attractions in Madison.",
  "Monona Terrace has a well-earned reputation among meeting professionals as one of the best venues in the country, but you do not have to be at a conference in order to visit. You can wander around this beautiful building on your own or take a docent-led tour. Tours are at 1.00 p.m. every day of the week from May through October and on Fridays and the weekends from November through April. Get a peek into this Frank Lloyd Wright creation that caused controversy when the plans were first proposed back in the 1940s. Spacious meeting rooms welcome conference attendees. Floor to ceiling windows on the main level at the back of the building give you a panoramic view of Lake Monona in all its moods.\n \nThe building has a surprisingly contemporary feel considering when it was designed. The lecture theater is the only interior room that Frank Lloyd Wright proposed. His influence is evident in the round-edged symmetry that you see throughout. The rest of the interior was created by one of his students, Tony Puttnam. \n\nIf you are interested in Wright’s work in general, the hallway on the same level as the gift shop has photos of some of his other buildings. The gift shop itself is worth a browse as it has a wide range of Frank Lloyd Wright inspired souvenirs. You can find clocks, coasters, scarves, earrings and more. \n\nTake a stroll on to the roof top to admire another view of Lake Monona and sample one of the offerings of the Lake Vista Café if you’re feeling hungry or thirsty. Its’ easy to stay awhile and relax under the shade of an umbrella. (Note that on occasions in summer, this area may be closed for a private function, but it is normally open to the public until 10.00 p.m. And if you happen to be in Madison on a Friday night in August, the Dane Dances are free on the roof top.)\n\nIt may have taken almost 60 years of debate to receive voter approval and another 5 years to be built, but celebrating its twentieth anniversary this year, Monona Terrace is now a great asset to Madison, one that is enjoyed by both visitors and residents alike.",
  "This is an amazing building, great for all sorts of events and the rooftop terrace has a wonderful view of the lake!",
  "Right off the capitol square in Madison, Wis. you can see and stroll around an example of the most wonderful civic architecture ever designed by Frank Lloyd Wright. There is a gift shop with many interesting Wright-related items to choose from. Beautiful views of Lake Monona. On-site parking makes it even easier to explore this American treasure. It was first proposed by Wright in 1938 but never gained enough public support or financing to be built. But almost 60 years later it was resurrected by Mayor Paul Soglin and built at the original location Wright had suggested.",
  "If you are a Frank Lloyd Wright fan Monona Terrace is a must.  It was originally his vision that outlined this building.  I attended the winter Farmers Market.   The only issue is parking when there are multiple events going on. I tecommend to not pay the $5 but park outside their ramp for a much better price and walk to the Terrace.  ",
  "I recently attended a conference held at Monona Terrace and my only wish is that the arena wasn't long and narrow. Seating means difficulty seeing what is taking place during presentations, even with the large screens and sound is difficult to control.",
  "Self-guided museum in basement area.  Interesting and nice museum!  There is also a gift shop.  Beautiful area overlooking lake.",
  "This building, built from plans after Wright's death, has a terrific view of Lake Monona, as well as lovely conference rooms for a variety of events.  I usually go for the items at the Gift Shop which feature a large selection of Wright inspired items, as well as great cheesy Wisconsin gift items!!!! ",
  "We enjoyed  Shake the lake community activities.  Music, nice food and activities during this time.  Right on the lake.  Street parking as the lot seemed to maybe be for VIP’s.  Shooting happened after we left, ugh.",
  "During the summer, Monona Terrace offers live concerts on the rooftop. One such concert was a group called Super Tuesday.  They are a party band for lack of a better term.  What a great time!  These are ticketed events but Free.  I actually really like this for crowd control and people that make the effort to get a free ticket really want to be there and have a great time.  The last concert of the season was a Mo Town theme.  I took a cribbage board with my friend to listen to some great Diana Ross/Aretha Franklin tunes.  Even the Lt Gov of WI Mandela Barnes showed up in person.  It's every Thursday night from 7-10pm during the summer overlooking the Lake.  It's an amazing time and I highly recommend this diversion during the work week.  Enjoy!\n\nSuper Tuesday is a party band what a great time.",
  "We loved coming here for a conference. The building is beautiful, the view of the lake spectacular and nice conference rooms. Parking is close with getting into the building on a cold day fast. Breaks between meetings were relaxing and enjoyable. The staff was always around to help us get from talk to talk quickly."
 ]
},{
 "name": "Wisconsin Historical Museum",
 "address": "30 N Carroll St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/c9/c4/c1/wisconsin-historical.jpg",
 "tags": [
  "tour",
  "history",
  "kids",
  "free",
  "free",
  "history",
  "family",
  "history",
  "history",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d258764-Reviews-Wisconsin_Historical_Museum-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "We last toured this museum about 10 years ago. We come back to Madison every year on business and find time to stop by their excellent gift shop to peruse the new Wisconsin history books that they have, but haven't had the time to visit the actual museum again until this recent trip. Frankly, we'd forgotten how good this museum really is.\n\nThe museum is very logically laid out. The first floor has the entrance and welcome desk (there is no charge to tour the museum, but these folks will answer your questions and hand you a laminated guide to the collections on the various floors), the gift shop, and a large room that is currently setup to provide a gathering point for school groups with an adjacent theater. Fortunately, for us, the large group of kids visiting the museum this day was just getting ready to leave, so we took off for the upper floors which were now kid free to enjoy the exhibits.\n\nThe second floor deals with the Native American societies that have and continue to live in what is today Wisconsin. Exiting the elevator, we started with a series of vintage images taken by photographer Charles Van Schaick of the Ho-Chunk people over the 1880-1940 period. His work was unusual in that he treated the members of the tribe as customers, not subjects, so his images show them more as they wanted themselves to be seen as individuals, not as some sort of ethnographic study. From here, we followed the Wisconsin Native American story from the pre-contact period (\"People of the Woodlands\") to their interaction with the incoming settlers (\"Era of Exchange\") to the side story of how this history has been reconstructed (\"Archaeology\"). Unlike many museums, the focus here is on artifacts and information instead of interpretative displays - there are some of those here as well (a wigwam, fur trading post, etc.), but they complement rather than take the place of the real historical objects and explanation of their context and meaning.\n\nThe third floor focuses on the period of European/American expansion into the state focusing on \"Frontier Wisconsin,\" \"The Immigrant State,\" and \"Making a Living.\" The importance of lead mining, lumber, farming, and industry are all covered as are the people's stories, again told through artifacts, images, information panels, and interpretive displays. There are literally hundreds of artifacts on display from the first governor's document seal to automobiles made in the state - each one telling an important part of the story.\n\nThe fourth floor continues the Wisconsin story by focusing the colorful political history of the state as a \"Laboratory of Democracy\" as well as how the people of the state have overcome a variety of issues from immigration to war to develop a \"Sense of Community.\" Up here currently is also a photographic study of Native American mounds in the state and another of the capitol square through history. The latter is by a large window that provides a very nice, perhaps the best, view of the capitol itself.\n\nWith the kids now gone from the first floor, we were able to go back down and look at another interesting photographic study of Wisconsin underwater shipwrecks. Several wrecks are featured, each with an information panel describing the ship as originally built, what it looked like, what its function was, etc. We finished up with a visit to the gift shop where we picked up several new books including one on the Charles Van Schaick photos of the Ho-Chunk people. We spent maybe an hour-and-a-half here (could easily have spent more time but we had to get back to business) and felt it was definitely time very well spent.",
  "We enjoyed this museum immensely as it took you through the various stages of Wisconsin growth, from the days of pioneering to modern times.  They have tons of artifacts, nicely displayed as well as life size dioramas depicting early life of Native Americans and early settlers.  Most interesting and surprising were some of the industry associated with Wisconsin.  I'm not revealing, but it's not just a cheese state!  You need to see this museum to appreciate what Wisconsin has contributed to our country.  A must see and I give it an A++ grade.",
  "I thoroughly enjoyed my trip to the museum. There are four floors of Wisconsin history, from the Natives who lived here through modern times, and everything in between. As an archaeologist, I was most interested in the Native American displays. I would've liked more artifacts, but the displays they did have were very nice. Admission is free, but the suggested donation is $5 for adults. The gift shop has a nice selection of souvenirs for all ages, including books on a variety of topics.",
  "This is a hidden gem, full of great information for all things Wisconsin.  A revolving showcase of exhibitions keep the interest high, along with activities for the whole family.  Don’t miss the gift shop where a wide array of books and fun things will draw you in.  ",
  "This museum is right \"on the square\" - meaning near the Capitol building in Madison, Wisconsin. While visiting town for any reason, this is a central place, and it's hard to avoid stopping at the Museum if you're into history. The Museum is also a central \"headquarters\" of the Wisconsin Historical Society, whose magazines you might be a subscriber to, and whose other historical sites you might have visited in the past.",
  "Especially loved the exhibit in the 1st floor of the Ever Gleaming Christmas Trees.  Brought back so many childhood memories.  The upper floors were interesting as well.  Worth making time to see",
  "Very comprehensive display covering the history of this territory and subsequent state, well worth a peek.",
  "I thoroughly enjoyed my trip to the museum. There are four floors of Wisconsin history, from the Natives who lived here through modern times, and everything in between. As an archaeologist, I was most interested in the Native American displays. I would've liked more artifacts, but the displays they did have were very nice. Admission is free, but the suggested donation is $5 for adults. The gift shop has a nice selection of souvenirs for all ages, including books on a variety of topics."
 ]
},{
 "name": "University of Wisconsin Geology Museum",
 "address": "1215 W Dayton St Weeks Hall",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/ed/10/85/university-of-wisconsin.jpg",
 "tags": [
  "free",
  "kids",
  "art",
  "unique",
  "free",
  "tour",
  "free",
  "free",
  "free",
  "knowledgeable",
  "tour",
  "kids",
  "walk",
  "free",
  "kids",
  "art",
  "unique",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280437-Reviews-University_of_Wisconsin_Geology_Museum-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a very small museum but it has nice displays of rocks and fossils.  The kids loved the dark room and seeing the rocks glow in the dark.  There is a room with several dinosaur skeletons, very impressive dioramas.  The museum is free but will take donations, looking for a parking space is hard.  Definitely worth a visit if you are in the area.",
  "This small museum on the second floor of the geology building (a couple blocks from Camp Randall Stadium) provides a fascinating look at the rocks underneath your feet. \n\nIt starts with a small exhibit on meteors and meteorites - including video of the 2010 meteor that exploded over southern Wisconsin and several examples of meteorites from that strike as well as a general discussion of the various types of meteors with again examples of the resulting meteorites from around the world. Next is an extensive display of minerals including many beautiful crystals, colors, etc. - indeed the example of pyrite \"suns\" naturally grown in a slab of black slate looks more like modern art than a natural specimen.\n\nVisitors are next led into a room equipped with a black light to show a wall full of examples minerals that glow in UV light - very 1960s. This room leads to another small room modeled after a cave to illustrate the difference between stalactites and stalagmites. \n\nThe remaining main gallery looks at fossils from the microscopic to dinosaurs and other prehistoric animals. Here again, some of the natural specimens looks more like art than science - for example, the fossilized school of sea lilies struck us as something that would look just as good in an art museum as in a geology exhibit.There is also a unique complete example of a fossilized diving bird from 80 million years ago, as well as a large hadrosaur and a bizarre large armored mammal from South America.\n\nWe spent about an hour here (and this wasn't our first visit) and found it enlightening to say the least. You can even take home (for a small price) some examples of some of minerals and fossils that they have for sale - the museum itself is free.",
  "This is a great location to take kids--they will love all the dinosaurs, the black light gem room with glow in the dark metals.  There is a great audio tour as well -- what a gem right in the middle of UW!",
  "This is aces for a free museum. They have a great collection of rocks and minerals — don't miss the room of rocks that glow in UV light! There's also a surprisingly wide assortment of fossils from the Cambrian through the Tertiary, including some dinosaurs. You can also take a peek at the fossil preparation lab. Be aware that parking can be difficult to find on campus. The Union South parking garage (Lot 80) is just down the street and, unlike many of the campus parking lots, open to the public.",
  "One of the benefits of a University town is...the University!  Here we have the Geology department's small but packed museum.  There are several dinosaur specimens and pieces of dinosaurs, as well as a \"cave\", black-light display, and lots of minerals and fossils.  We've attended for the free story-times (check website for times), and my grandkids have enjoyed these very much.  Parking is a challenge; there is sometimes parking under Union South, or else you'll be looking for a street spot.",
  "Love the Geology Museum.  It is small, but packed with beautiful rocks, fossils and information.  They even have a couple of fossil skeletons.  The people are very friendly and knowledgeable.  The parking is a trial.  There is no public parking at the Geology building, but there are meters a block or so away.  It is a lovely, low key and free museum. I Love the Black Light Room - the fluorescing rocks are so cool.",
  "I love taking my 4K classroom here! This is a great place where the kids can wonder and still  be contained. I would not recommend a guided tour for kids under 8 because a lot of the information goes over their head. Otherwise staff are great with the kids and it is always fun.",
  "If you're into rocks and minerals, this is the best-hidden treasure in Madison. Off the main path and hidden within UW-Madison campus, the museum is a must to visit if you appreciate everything rocks. Very fine specimens of minerals and extnict animals' skeletons are abound in this rich collection. The only downside is that you have to find parking elsewhere and walk to the museum - nearest city parking ramp is few blocks away.",
  "This is a very small museum but it has nice displays of rocks and fossils.  The kids loved the dark room and seeing the rocks glow in the dark.  There is a room with several dinosaur skeletons, very impressive dioramas.  The museum is free but will take donations, looking for a parking space is hard.  Definitely worth a visit if you are in the area.",
  "This is an attractive little museum!  Nicely arranged and plenty for mineral enthusiasts. The dinosaur display is fun because you are so close, can look a T. rex in the face. Parking only downside.",
  "This small museum on the second floor of the geology building (a couple blocks from Camp Randall Stadium) provides a fascinating look at the rocks underneath your feet. \n\nIt starts with a small exhibit on meteors and meteorites - including video of the 2010 meteor that exploded over southern Wisconsin and several examples of meteorites from that strike as well as a general discussion of the various types of meteors with again examples of the resulting meteorites from around the world. Next is an extensive display of minerals including many beautiful crystals, colors, etc. - indeed the example of pyrite \"suns\" naturally grown in a slab of black slate looks more like modern art than a natural specimen.\n\nVisitors are next led into a room equipped with a black light to show a wall full of examples minerals that glow in UV light - very 1960s. This room leads to another small room modeled after a cave to illustrate the difference between stalactites and stalagmites. \n\nThe remaining main gallery looks at fossils from the microscopic to dinosaurs and other prehistoric animals. Here again, some of the natural specimens looks more like art than science - for example, the fossilized school of sea lilies struck us as something that would look just as good in an art museum as in a geology exhibit.There is also a unique complete example of a fossilized diving bird from 80 million years ago, as well as a large hadrosaur and a bizarre large armored mammal from South America.\n\nWe spent about an hour here (and this wasn't our first visit) and found it enlightening to say the least. You can even take home (for a small price) some examples of some of minerals and fossils that they have for sale - the museum itself is free."
 ]
},{
 "name": "Allen Centennial Gardens",
 "address": "620 Babcock Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/1f/e6/9b/allen-centennial-gardens.jpg",
 "tags": [
  "library",
  "art",
  "structure",
  "historic",
  "library",
  "art",
  "structure",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280432-Reviews-Allen_Centennial_Gardens-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located near the Lakeshore dorms and the Steenbock Library at the corner of Babcock and Observatory Drive is the always lovely Allen Centennial Garden. The garden architects have packed a lot into a small space to create a sensory stimulating treat. The plants are labeled and other brief signs provide further explanation. If you plan to spend a few minutes or a couple of hours you will feel refreshed as you leave. ",
  "This fine garden (actually a composite of half-a-dozen different garden types: Japanese, English, rock, woodland, etc.) wraps around the beautiful 10,000 square foot Queen Anne style house that was the residence of the first four deans of UW's agriculture school (today it is used for office space). \n\nThe garden is carefully maintained - on our visit, there were no less than half-a-dozen gardeners at work on the grounds - and always looks magnificent. For the botanist fans, each different type of plant is marked, while most people will just enjoy strolling the grounds and perhaps sitting in one of the little seating areas scattered around. If you get tired of looking at plants, you can watch the fish in the koi ponds (they tend to school together when you get close, probably waiting for a handout).",
  "I've taken my classes there to see the hundreds of species that are present there. You can see the rock garden, a vegetable garden, and several other annual and perennial displays. It's also a nice spot to take a lunch break!",
  "When thinking of gardens in Madison, one's mind jumps to Arboretum or Olbrich. Of course Allen Centennial is not a match to the big boys in size, but a combination of historic building (Agricultural Dean's House), plants and art (like Hortisculpture) is certainly worthy a visit if you're near campus. Parking on the street is pretty limited, but there is a new parking structure nearby.",
  "A great place to stop when touring campus with many varieties of plants. Try to be there when they are working on the garden because the staff are VERY helpful with your questions",
  "I've taken my classes there to see the hundreds of species that are present there. You can see the rock garden, a vegetable garden, and several other annual and perennial displays. It's also a nice spot to take a lunch break!",
  "Wow. This is not someplace that you’d just happen upon unless maybe you’re wandering through the UW campus, and even then it would be easy to miss. But it’s worth finding. Not as big as Olbrich but with an amazing variety of plants and different types of gardens. Very well done. Great oasis in the middle of an urban campus. ",
  "Located near the Lakeshore dorms and the Steenbock Library at the corner of Babcock and Observatory Drive is the always lovely Allen Centennial Garden. The garden architects have packed a lot into a small space to create a sensory stimulating treat. The plants are labeled and other brief signs provide further explanation. If you plan to spend a few minutes or a couple of hours you will feel refreshed as you leave. ",
  "This fine garden (actually a composite of half-a-dozen different garden types: Japanese, English, rock, woodland, etc.) wraps around the beautiful 10,000 square foot Queen Anne style house that was the residence of the first four deans of UW's agriculture school (today it is used for office space). \n\nThe garden is carefully maintained - on our visit, there were no less than half-a-dozen gardeners at work on the grounds - and always looks magnificent. For the botanist fans, each different type of plant is marked, while most people will just enjoy strolling the grounds and perhaps sitting in one of the little seating areas scattered around. If you get tired of looking at plants, you can watch the fish in the koi ponds (they tend to school together when you get close, probably waiting for a handout).",
  "I've taken my classes there to see the hundreds of species that are present there. You can see the rock garden, a vegetable garden, and several other annual and perennial displays. It's also a nice spot to take a lunch break!",
  "When thinking of gardens in Madison, one's mind jumps to Arboretum or Olbrich. Of course Allen Centennial is not a match to the big boys in size, but a combination of historic building (Agricultural Dean's House), plants and art (like Hortisculpture) is certainly worthy a visit if you're near campus. Parking on the street is pretty limited, but there is a new parking structure nearby."
 ]
},{
 "name": "Tenney Park",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/37/e4/fd/fishing-in-the-sunset.jpg",
 "tags": [
  "walk",
  "walking",
  "family",
  "parks",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d299840-Reviews-Tenney_Park-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lovely small park- very picturesque. It's a great place to walk and has great ice skating in the winter. The fishing is good but the swimming isn't the best as Lake Mendota tends to have a lot of algae issues. Boat launch facilities are good too.  ",
  "I would highly recommend Tenney Park for the ice skating and their cozy warming house in the winter time.  They also have skate rentals.  In the summer time its a good location to go and see the fireworks.",
  "I would highly recommend Tenney Park for the ice skating and their cozy warming house in the winter time.  They also have skate rentals.  In the summer time its a good location to go and see the fireworks.",
  "Lots of things to do here in all seasons: swimming, boating, lake watching, ice skating, general walking and relaxing",
  "One of several city parks around Madison that host outdoor ice skating when weather & ice conditions permit, the Tenney Park lagoon between Sherman Ave. & E. Johnson St. (access via N. Thorton Ave.) makes for a memorable outing for visitors and local skating enthusiasts (shinny hockey players & recreational skaters).  The John Wall Family Pavilion offers a warm & comfortable space for skaters to put on and take off their gear with quick access to the lagoon ice surface.  The indoor concession stand also offers refreshments, as well as rental skates & hockey sticks (when available).  The attractive arch of Tenney Park's pedestrian bridge provides a photo-worthy backdrop for the on-ice activities on a cold mid-winter day; and the horseshoe-shaped lagoon offers plenty of space for individuals & families to skate, without interference with the enthusiastic pick-up hockey groups that gather there on weekends & holidays.  Tenney & similar park facilities around town are local treasures, and I hope they are maintained by the city & its volunteer caretakers for many years to come.",
  "Small Sandy Beach for swimming, lots of ducks and hike/bike path. This is a serene place that's magical on a sunny day. It would be a perfect picnic spot.",
  "I drove seven hours to get to Tenney Park this winter to ice skate and it was worth it! Good rental skates in the warming house, and a warm fire. The lights come on after dusk and it's magical skating across the lagoon and under the bridge. I only wish that a larger area were open for skating, as it was in 2001-2002 when I was last there. It was so fun going farther down the \"river\" toward Lake Mendota. What happened? It's still the best ice skating in Madison and the best ice skating that I know of anywhere in the continental U.S. ",
  "Took a walk with the fam here during a nice winter weekend. Tried to get the kiddo out on a sled, but slow was minimal. Hope to get out again soon!"
 ]
},{
 "name": "Madison Museum of Contemporary Art",
 "address": "227 State St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/84/85/9c/photo-by-sharon-vanorny.jpg",
 "tags": [
  "art",
  "free",
  "organized",
  "art",
  "free",
  "art",
  "unique",
  "art",
  "free",
  "art",
  "art",
  "unique",
  "free",
  "art",
  "free",
  "art",
  "unique",
  "art",
  "walking",
  "free",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d639838-Reviews-Madison_Museum_of_Contemporary_Art-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Perhaps the most imposing building in Madison, Wisconsin, isn't the State Capitol. Visitors are awestruck when viewing the three-story glass facade of the Madison Museum of Contemporary Art for the first time. At least these two visitors from Chicago were. The MMoCA, as it is commonly referred to, formerly known as the Madison Art Center, is an art museum with a three-story glass facade that serves as the museum's main staircase and an architectural landmark. Located at 227 State Street, at the corner of State and Henry Streets, it is part of the Overture Center for the Arts. The MMoCA has four galleries--the State Street Gallery directly off the museum lobby, the Henry Street Gallery that showcases a rotating selection of the museum's collections; the main galleries, the museum's largest exhibition space, on the second floor; and the Imprint Gallery on the second floor that provides an environment for artwork based on sound or film. Artwork also is displayed in the lobby and in the Rooftop Sculpture Garden. There also is a theater for films, a  museum store and the Fresco restaurant. Admission is free. Currently, the most notable piece in the museum's collection is Pitahayas, a 1938 oil-on-metal painting by Frida Kahlo.",
  "Don't miss the Madison Museum of Contemporary Art.  Easy to do in a bustling college town with plenty of shiny attractions and temptations\n\nHere's what is attractive:\n\n1. Curated exhibits.  The roster of big name original art won't wow you but the exhibits are smartly conceived and compellingly organized.  The current exhibit on images brings together original artwork and reproductions to demonstrate that self-portraits are far more interesting and varied than what we usually see.  \n\n2. Third floor has a charming, get-away sculpture garden with refreshing drinks\n\n3. One of the most interesting museum shops I've seen after visiting the major museums in the US and Europe.  Yes the Met has Met stuff but this Museum displays glass, jewelry, scarves, bags, ties, cards, toys (weird and interesting) etc that have been collected by an owner with a keen eye and a commitment to small artists who produce beauty and originality.  \n\n4. Free",
  "Conveniently-located off State & Johnson, entering visitors are at once attracted to climbing the unique and impressive glass staircase to the galleries.  Of course no photos are allowed of the art inside, but bring your camera for the city views.  The 3rd floor sculpture garden is a lovely respite on a sunny day and provides especially great views of the Madison capitol area and State Street.   Only a few sculptures are present, but the whimsically-connected, one-of-a-kind (functional) picnic tables are worth a look.   Also remarkable and noteworthy is the recently-added ‘22nd Century’ exhibit on 2nd floor—this  is keenly interesting;  take another look--it's not just any modern art installment – it is a sociological statement developed via input from Madison residents.",
  "The Madison Museum of Contemporary Art does what many of the best contemporary art museums do, which is to provide an excellent setting for exhibitions that regularly change to keep the displays fresh.\n\nThe setting itself if nice and, predictably modern.  There is a lot of glass and natural light and good settings for displays ranging from an entire floor to a single room.  I liked the glass staircases, but you can now see more or less the same thing at Apple stores in places like San Francisco.  There is also a restaurant on the third floor that is open for dinner.\n\nWhen I was there,  they had exhibits by Frank Stella (a retrospective), Claire Stigliani (which have kind of a fantasy feel), William Kentridge (two videos in a single room), and Warrington Colescott on the Thomas Mann book \"Death in Venice\".  The four were very different and, of course, your experience may be different still because the exhibitions change regularly.  This is, of course, a contemporary art museum, so don't expect realism or much that will be familiar - that 's a big part of the attraction.\n\nArt is very personal, but I thought that the Frank Stella exhibit, which took up most of the second floor, was the most intriguing.  You can tell in an instant that he created all of the art, but he has very distinct periods that cover topics like circuits (basically abstractions of race tracks), Italian folk tales, exotic birds, eccentric polygons, and even Moby Dick.\n\nThe William Kentridge display consists of a single room displaying 2 videos he created.  Take at least 5 minutes to sit and enjoy it.  He is a South African who basically created a story using charcoal and pastel drawings that acts like a cartoon, only each cel is just another step in the art work so it unfolds both as a story and to watch the artwork unfold.\n\nThe Warrington Colescott exhibition was enough to make me want to review the novella on which it was based, which I view as a compliment.\n\nAs is typical of contemporary art museums, they limit photography, but they have excellent printed materials available with clearer pictures of the highlights than you would likely be able to take yourself without special lighting, a tripod, etc.  Some of the pieces are also available on line if you want a digital copy.\n\nThey had introductory material by each of the exhibits that I found helpful as I was not familiar with many of the artists, as is likely the case with most visitors I suspect.\n\nAdmission was free, apparently due to an anonymous donor (thank you, \"anonymous\"!), but they have boxes to donate if you want (which I did).\n\nThe museum store has a lot of really cool stuff that you won't fine most other places.  \n\nAs with all contemporary art, some may question whether it is art at all, but I will leave that to the critics.  I enjoyed my time here and it was certainly worth more than the price.",
  "I've always loved modern art because it seems to try so hard - when it's good, it's really good and when it's bad, it's really bad.  The MMoCA has been able to bring in some really impressive artists in the past.  It's always worth stopping in to see if anything takes you by surprise.  When my friend and I stopped in this past Friday, I really enjoyed the Narayan Mahon exhibition, titled Lands in Limbo.  It was a collection of photographic prints displaying individuals living in unrecognized quasi-nations.  Be sure to see all three of the galleries - the State Street gallery (immediately to your left upon entrance), the Henry Street gallery (tucked away in the back of the first floor) and the main gallery on the second floor.",
  "As TA member Taylor B emphasized in their recent review, the MMoCA building (designed by renowned Argentine architect Cesar Pelli) presents an attractive & unique home for the museum's contemporary art collection and related visiting exhibitions.  The free admission is also an unexpected bonus for visitors; be sure to grab an exhibit map & related art descriptions at the front desk, to help you navigate the disconnected gallery spaces & to better understand the art pieces.  But beyond the soaring sharp-angled multi-story glass atrium stairwell, my wife & I found very little noteworthy art inside.  Perhaps the curators will continue to strengthen the local collection & attract higher profile traveling exhibits, but on this day in March the visit was no more satisfying than those in many other modern art museums we've visited around the U.S..",
  "Perhaps the most imposing building in Madison, Wisconsin, isn't the State Capitol. Visitors are awestruck when viewing the three-story glass facade of the Madison Museum of Contemporary Art for the first time. At least these two visitors from Chicago were. The MMoCA, as it is commonly referred to, formerly known as the Madison Art Center, is an art museum with a three-story glass facade that serves as the museum's main staircase and an architectural landmark. Located at 227 State Street, at the corner of State and Henry Streets, it is part of the Overture Center for the Arts. The MMoCA has four galleries--the State Street Gallery directly off the museum lobby, the Henry Street Gallery that showcases a rotating selection of the museum's collections; the main galleries, the museum's largest exhibition space, on the second floor; and the Imprint Gallery on the second floor that provides an environment for artwork based on sound or film. Artwork also is displayed in the lobby and in the Rooftop Sculpture Garden. There also is a theater for films, a  museum store and the Fresco restaurant. Admission is free. Currently, the most notable piece in the museum's collection is Pitahayas, a 1938 oil-on-metal painting by Frida Kahlo.",
  "This is a nice small museum with very unique offerings. I love Modern and Contemporary art, and this is an impressive home for rotating collections. I loved the atmosphere, a very low-key, contemplative vibe.",
  "Walking towards the Capitol on the pedestrian mall, Madison's Contemporary Art Museum offers a welcome counterpoint to the many shops and eateries.\nThe museum doesn't have its own collection, and thus the visitors' enjoyment depends upon the temporary exhibits he encounters.\nWe were lucky, as a least three of the four artists on show in August made our visit very worthwhile. Btw, the museum is free.",
  "Not a big fan of modern art but they have a good collection.  I would definitely recommend this museum to anyone who likes modern art."
 ]
},{
 "name": "Alliant Energy Center",
 "address": "1919 Alliant Energy Center Way",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/e9/7c/7a/alliant-energy-center.jpg",
 "tags": [
  "family",
  "free",
  "food",
  "tasting",
  "walking",
  "food",
  "learn",
  "food",
  "organized",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280427-Reviews-Alliant_Energy_Center-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "I wish we could just rate the World Dairy Expo as that is what I TRULY want you to know about.  The Alliant Center hosts it, but the Expo is the true story here.  The Expo is a staff of 11 people who pull off the almost impossible.  From over 800 exhibitors, thousands of cattle from all of the world, to an International lounge.   They have it all and they handle it like it's an every day thing.  Absolutely AMAZING!!! The world should know about the World Dairy Expo!",
  "Love going to this every year.  Awesome people who have horses!  Love the huge sale/craft/jewelry area.  Seeing the clinics offered is so worth it for any rider.  Rodeo and horse show are amazing.  What an awesome day for any family!",
  "I came all the way from Chicago to see the show.  I am a wheelchair user and I cam alone.  I had no problem parking (for FREE) and someone was nice enough to get my wheelchair in and out of the car.  I was escorted all the way from my car to my seat by some really friendly helpful staff.  The only way to get tickets for that show was through Ticketmaster, but I had no problem.  I would go back there.",
  "You will find events from a model railroad show, gourmet food and wine tasting & Comiccom  And on a day we were just taking a drive and followed Alliant after touring venders booths of a wide variety ti sitting outside watching Chicks with Axes dazzling us with their skills then screaming for him - the Wandellas performed for over 35 minutes.  Parking is not bad, people are friendly bring a picnic and sit at the tables provided or snack at several food booths.  Its a gem",
  "Drive in by the Olin drive entrance, lines are usually shorter and many times you can get closer to the building in the back parking lot.   We go the Midwest Horse Fair, RV Show, Garden Show, Shriners Circus and much more.  ",
  "I attend various \"happenings\" at the Alliant Energy Center.  Most recently attend the wonderful workshops  of the Wisconsin Public Television Garden Expo with hundreds of exhibitors, Educational Seminars and demonstrations plus the on site farmer's market.  Walked away with good info on gardening.  The place accommodates for extensive activities, plenty of parking, much walking. They provide for food, and places to sit as well.  A place where whole families can participate.  There is often fees for parking but reasonable.",
  "We were in attendance for the PBS Wisconsin Garden Expo in the exhibitional hall.  The expo featured seminars and stage demonstrations, equipment and services vendors, opportunities to talk with gardeners and to learn so much.  The only disappointment was the lack of garden displays.  There was only one true display.  The seminars were great.",
  "The convention center has a wide variety of rooms and halls that suited the convention I attended very nicely. It was clean and well maintained. They had a large variety of food available in the food court, but $7 for a slice of pizza or $6 for a designer coffee was too pricey for me. ",
  "I was just here for world dairy expo and it was excellent.  The Alliant Energy Center was clean and well maintained.  Trashes were not overflowing and didn't see trash on the sides of the road/sidewalks.  Everything seemed very well organized and handled (including parking).",
  "I wish we could just rate the World Dairy Expo as that is what I TRULY want you to know about.  The Alliant Center hosts it, but the Expo is the true story here.  The Expo is a staff of 11 people who pull off the almost impossible.  From over 800 exhibitors, thousands of cattle from all of the world, to an International lounge.   They have it all and they handle it like it's an every day thing.  Absolutely AMAZING!!! The world should know about the World Dairy Expo!",
  "Love going to this every year.  Awesome people who have horses!  Love the huge sale/craft/jewelry area.  Seeing the clinics offered is so worth it for any rider.  Rodeo and horse show are amazing.  What an awesome day for any family!"
 ]
},{
 "name": "Madison Mallards",
 "address": "2920 N Sherman Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/42/a6/91/madison-marlins.jpg",
 "tags": [
  "free",
  "music",
  "food",
  "family",
  "drink",
  "field",
  "kids",
  "field",
  "family",
  "food",
  "free",
  "food",
  "family",
  "kids",
  "cheap",
  "field",
  "eat",
  "drink",
  "field",
  "food",
  "free",
  "music",
  "food",
  "family",
  "drink",
  "field",
  "kids",
  "family",
  "field",
  "family",
  "food",
  "parks",
  "food",
  "free",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d1440352-Reviews-Madison_Mallards-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great ballpark.  The parking is free.  The atmosphere is very nice for the family and kids and adults who want to enjoy a game with an adult beverage.  They have little events going on the field between innings making it great fun for kids.  They have large air-filled baseballs that the kids can tap around in the stands, they do a shirt toss, and many other fun things for the kids.  The music playing between innings is also great.  For $41 you can purchase \"Duck Blind\" seating which includes all food and drinks (included many varieties of beer).  Mixed drinks are $3 per drink. It isn't assigned seating so get there early to reserve a group of tables and chairs.  It fills up on the weekends.  Great fun.  Excellent price!  I would go again for sure.",
  "Why did we wait so long to go to a Mallards game?  We took a visiting houseguest and had a terrific evening in the Great Dane Duck Blind, where admission includes unlimited beer and ballpark food.  Very family friendly, entertaining, and enjoyable.  The college athletes put on a great show.  Our visitor, a professional coach, said there's probably no minor league field in the country quite like Warner Park.  Highly recommend!",
  "Having been a 7 game season ticket holder for five years, I want to be sure everybody knows what a great entertainment value the Mallards are. Food, games for kids and adults, giveaways and oh yes...baseball! Whether you're a serious baseball fan or just a novice, a Mallards game at The Duck Pond (as Warner Park is known to locals), is an evening everyone will remember. Good, clean family entertainment, but there are also sections for 20 something's and up where the beer and good times flow as well.\n\nYou can sign up for drawings for giveaways every game or maybe get a prize that is tossed into the crows. Maybe even win an oversized beach ball. Parking is free and plentiful right outside the ball park. It's also on a bus line if you need it.\n\nCome on out and see for yourself. Bring the crawlers and the grandfolks. Fun for all.",
  "If you're in your 20-40s and love to have some drinks at a baseball game, the Duck Blind is your place to be in the summer time in Madison. It's roughly $30-$35 for all you can drink and eat until the 7th inning. Many people head there to fill up on beers and general baseball field fare then head out downtown. It can be a little crowded trying to leave the parking lot by car, but overall a great experience and cheap way to enjoy a summer evening.",
  "The Mallards are what baseball should be:  hardworking and friendly players, accommodating management, worthwhile promotions, and reasonable prices for food and beverages.  The recent remodeling of the ballpark is wonderful and adds an extra level of comfort to this aging facility.  Watch out for flying balls....one is definitely without protection in the stands which are very close to the field.",
  "This summer league franchise for college players is a terrific spot to see some decent baseball. The venue is a throwback as there is definitely nothing fancy about it. But that fact more or less adds to its charm as it takes one back to a previous era before money came to dominate the sport. For a very reasonable price, who knows...you may see a future star.",
  "This is a great ballpark.  The parking is free.  The atmosphere is very nice for the family and kids and adults who want to enjoy a game with an adult beverage.  They have little events going on the field between innings making it great fun for kids.  They have large air-filled baseballs that the kids can tap around in the stands, they do a shirt toss, and many other fun things for the kids.  The music playing between innings is also great.  For $41 you can purchase \"Duck Blind\" seating which includes all food and drinks (included many varieties of beer).  Mixed drinks are $3 per drink. It isn't assigned seating so get there early to reserve a group of tables and chairs.  It fills up on the weekends.  Great fun.  Excellent price!  I would go again for sure.",
  "This was our first, family trip to the Mallards game this season. The game and facilities are fine, but the entertainment is not what it used to be. There are fun and games, but the announcements and game excitement is not what it used to be. Still had fun though!",
  "Why did we wait so long to go to a Mallards game?  We took a visiting houseguest and had a terrific evening in the Great Dane Duck Blind, where admission includes unlimited beer and ballpark food.  Very family friendly, entertaining, and enjoyable.  The college athletes put on a great show.  Our visitor, a professional coach, said there's probably no minor league field in the country quite like Warner Park.  Highly recommend!",
  "Our son got us tickets to the Mallards' Father's Day game and we had a wonderful time (even though they lost). We love small ball parks and young men who play for the love of the game, not a big pay check.  Good seats, friendly people around us.  The food  we had was not terrific.",
  "We've attended Mallards baseball games for years and it's always a great time.  Tickets are inexpensive, parking is free, and the baseball is high quality.  In the past, we've always eaten at the ballpark, but will not do that anymore.  Went to a game last weekend and the food was terrible:  taco was ice cold and TINY with tough meat, bun with brat was too dry/hard to even eat, and a server spilled fries out of the container replaced them with her BARE HANDS and tried to hand us the tray.  So a great evening and great venue, but we will not eat there anymore. Which is disappointing because their food has always been excellent up until now."
 ]
},{
 "name": "Ho-Chunk Gaming Madison",
 "address": "4002 Evan Acres Rd",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/37/78/19/ho-chunk-gaming-madison.jpg",
 "tags": [
  "walk",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d2287532-Reviews-Ho_Chunk_Gaming_Madison-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's a great afternoon get away and the non smoking makes it even better! Thank You for a nice atmosphere!",
  "What a refreshing change ... no smoke and I was a winner!  Visited on a Sunday night and was happy to walk away with no smoke on my clothes and a few bucks in my pocket!  ",
  "The casino was GREAT fun!  The hotel was SUPER comfortable.  The buffet was EXCELLENT!  This will likely be our go-to place for weekend fun.",
  "Snacks, drinks, and fun awaits the visitor who is looking for a wide variety of slot machines. By the way, I left a WINNER!",
  "My husband and I come here a few times a year and always have a good time.  Not as big or nice as the Wisconsin Dells Ho-Chunk or the Potawatomi Casino, but it's still a good time.  We've been going for years and will continue to.",
  "Received a promotional offer in the mail and decided to check it out. 1 1/2 hour drive.  Easy to find. Rewards staff friendly and efficient. Casino clean and bright. Many new machines. Most are tied to their Bingo, but didn't try that. \nLoved the No smoking. Several beverage centers with many choices. (cups too small,tho).\nHad lunch at Gambler Grill. Really good, reasonable prices. Friendly fast service. I don't rate a casino on winning or losing.  We broke even. A very enjoyable day and will return again soon.\nOne tip, leaving the casino a rush hour (5 pm) not a good idea. Had to cross a busy highway with no stop lights.",
  "Lots of slots and a nice variety. I see a fair amount of people winning, I wish they had better dining options.",
  "Very crowded and machines are very tight.  The cafe needs improvement. Cold/dry sandwiches and chips. Workers not friendly. ",
  "While we enjoy this particular casino because of the no smoking policy, other casinos, pay attention, this place is BUSY with no smoking, the grill area, not so much.  It had more dirty tables than clean, were incredibly slow and you had to buy soda.  I went into the casino and grabbed a cup, it's ridiculous to pay.  The food was okay, typical grill food.  Please keep it clean so you don't mind eating there!\n\nIt would be nice to offer water as well as fountain drinks in the casino.",
  "I have visited several times, and always have fun!  The servers and others who assist patrons are so friendly and helpful!  I love the machines that they have!",
  "The casino was nice, I wasn't 100% happy with the game choices.  There were not to many newer machines.  Some of the older ones were fun.  We did not walk away winners but we did play for 12 hours on a few hundred bucks.  It was a fun time but not to sure I would make the 2 hour trip again."
 ]
},{
 "name": "Vilas Park",
 "address": "702 S Randall Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/34/89/60/vilas-park.jpg",
 "tags": [
  "walk",
  "kids",
  "walk",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d279033-Reviews-Vilas_Park-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "You can drive to the welcome center of the Arboretum on Sundays and take a walk in beautiful park with 2500 different trees, a bazillion flowers, birds, butterflies, and just such a cool setup.",
  "Great space for kids to play on the jungle gym, have an outdoor gathering, visit the zoo or go swimming in Lake Wingra, there's a lot to do at this park.",
  "Vilas Park is located on the southern edge of the University of Wisconsin campus and is also adjacent to the Henry Vilas Zoo. It's popular with joggers, walkers and mom's with strollers because of it's beauty. The perfect park to go for a peaceful and tranquil stroll.",
  "You can drive to the welcome center of the Arboretum on Sundays and take a walk in beautiful park with 2500 different trees, a bazillion flowers, birds, butterflies, and just such a cool setup.",
  "Great space for kids to play on the jungle gym, have an outdoor gathering, visit the zoo or go swimming in Lake Wingra, there's a lot to do at this park.",
  "Vilas Park is located on the southern edge of the University of Wisconsin campus and is also adjacent to the Henry Vilas Zoo. It's popular with joggers, walkers and mom's with strollers because of it's beauty. The perfect park to go for a peaceful and tranquil stroll.",
  "On the boardwalk you can collect jewel weed (touch-me-not) which cures bug bites and poison ivy almost instantly.",
  "The staff was phenomenal and the wildlife seemed happy and well treated. Be sure to stop here with your kids for a great afternoon."
 ]
},{
 "name": "Olin-Turville Park",
 "address": "John Nolen Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/61/04/57/view-fro-the-park.jpg",
 "tags": [
  "free",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d8699077-Reviews-Olin_Turville_Park-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "I've been to the light display at Grand Geneva several times but this one is much better.  More displays and a fair amount of creativity on display.  Plenty of spots to pull over and just observe without disrupting traffic flows.",
  "On the shore of Lake Monona with views of the city skyline, the state capitol, the John Nolen causeway, and a memorable holiday light display.",
  "Bring your camera and look north. You will see the burgeoning Madison skyline across tranquil Lake Monna as you watch sailboats skim across the placed water",
  "Free parking is a bonus to the pleasant-enough park which is well cared for.  Visited in June and noted though a lack of colour (flowering shrubs).",
  "Saw the event on the news, decided to make the hour and a half drive.  It's small, but worth it.  Drive through only, but offers tractor rides through. \nA great way to start the holiday season with family.  \n\n"
 ]
},{
 "name": "Lake Monona Shoreline Run",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/06/1d/27/view-of-the-lake-and.jpg",
 "tags": [
  "eat",
  "eat",
  "drink",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d147144-Reviews-Lake_Monona_Shoreline_Run-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "I walked along the lake wall, where it was bustling with cyclists, walkers, and fishermen.  Then I took the elevator to the top floor where I saw even more beautiful views.  There is a fountain up there, and the state capitol building can be seen in the distance. So pretty!",
  "Lake Monona is usually calmer than Lake Mendota.  My two favorite places to watch it are from Olbrich Park and John Nolen Drive.  John Nolen Drive area is busy and bustling.  The Pontoon porch and Betty Lou Cruises also dock here.  There a variety of places to eat here.  Olbrich is wide open spaces with a public dock area also.  This is a park to throw a Frisbee, play basketball or whatever.  ",
  "This is a beautiful trail along the lake.  It is mostly shaded.  It starts (or ends) at the Terrace of Univ. of Wis.  This is a fun place to stretch or get a bite to eat or drink.",
  "A great facility for this city, the opportunity to experience the lake from within the city, watch out for the cyclists.",
  "My favorite part of the trail is the bridge on John Nolen Dr. You can see the state capitol from the other side of the lake. I rent a BCycle for $5/30mins, and it was very easy to ride. I don’t see any public restrooms near by.",
  "I walked along the lake wall, where it was bustling with cyclists, walkers, and fishermen.  Then I took the elevator to the top floor where I saw even more beautiful views.  There is a fountain up there, and the state capitol building can be seen in the distance. So pretty!",
  "The Monona shoreline is one of my favorite places to run! It's fairly flat and has beautiful scenery! Well maintained trail.",
  "The walk around the lake was cold but beautiful!! We had a snow storm and still managed to take a look!!\n"
 ]
},{
 "name": "Warner Park",
 "address": "1511 Northport Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/1c/d4/76/warner-park.jpg",
 "tags": [
  "walking",
  "walking",
  "nature",
  "cheap",
  "family",
  "free",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280426-Reviews-Warner_Park-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great place to watch the Mallard's play baseball.  Love the game.  We try to go a couple of times a summer.  Nice park!",
  "A beautiful location to be,with all the wildlife, a great walking path close to the lake, an award winning Recreational center, an amazing Indoor aquatic center in the talks! ",
  "From a minor league baseball stadium to endless football and soccer fields, and basketball courts , surrounded by nature, including a forest for hiking, 300 acre Warner Park is a great place for nearly every outdoor activity, including jogging, dog walking, Crane watching and even a bit of fishing.  A park like this is a true \"gift\" for any city and is beloved to Madison.",
  "Always a good time, nothing fancy but you can take in a minor league game or some local games with cheap eats and drinks, great way to spend a summer evening with friends.",
  "Warner Park is more than just a park. It has a big shelter and lots of grassy spots. Annually several Festivals are held here.\n\nWarner Park has a community center where one can buy memberships in the exercise area. In addition, they have a child care center and also the offices for the NE Senior Center. Several times a year, crafts fairs are held here. During the craft festivals one can build arts and crafts as well as yummy snacks.\nA great place for a family to go to enjoy indoor and outdoor activities.",
  "For out of towner this park has lots of things to do. There is a boat launch and green space by the lake. Then there is a bike trail throughout the park starting just about anywhere you can park. A covered pavilion with restrooms, a lagoon for fishing and some basketball courts. The Muskies baseball park is also within the park on the Sherman Avenue side. Lots of room for you and your little rug rats to play if you have them. Its free as well except for the Muskies games.",
  "This is a great place to watch the Mallard's play baseball.  Love the game.  We try to go a couple of times a summer.  Nice park!",
  "A beautiful location to be,with all the wildlife, a great walking path close to the lake, an award winning Recreational center, an amazing Indoor aquatic center in the talks! ",
  "Madison's Warner Park is located on the city's far east side. It's a large quiet park that rarely gets crowded most spring and summer days. It's a great place to plan a barbeque or picnics because of it's beauty with rolling hills and plenty of parking. ",
  "The show was great,southwest wind made huge waves in Warner bay so it was twice as hard to ski.  Alice did an exceptional job as her father's assistant.\nThe city could have an alternative temp parking with angles to get more folks closer to the beach.",
  "An interesting bit of geography/geology on the North side of Madison. Water, fields and some woods. Sometimes there are events like concerts, sports, science and history ."
 ]
},{
 "name": "Elver Park",
 "address": "1301 Gammon Rd.",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/2e/51/7f/view-of-sledding-hill.jpg",
 "tags": [
  "family",
  "kids",
  "kids",
  "parks",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d280434-Reviews-Elver_Park-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very large park with multiple basketball courts. nice playground area and also a shelter where you can throw parties.",
  "Winterfest had great skiing and sledding and skiing for people who are disabled and coffee and hot chocolate and gyros and somemores and wonderful volunteers!",
  "Went with my niece and nephew to play in the snow and it was a blast. Definitely a great place to enjoy as a family and a fun winter spot to visit. ",
  "Ice-skating and sledding? Basketball and tennis? Softball and running? Yes to all. If you have small kids there is less to do in summer unless you want to \"climb the mountain\" which is the large sledding hill. If you like sports bring your tennis and basketball stuff in the summer or your skates and sleds in the winter. In winter there is a warming house with cocoa, etc.",
  "No better place in madison to go sledding. Watch out for oncoming sleds though,  I've seen some amazing wipeots...literally head over heels!",
  "Ice-skating and sledding? Basketball and tennis? Softball and running? Yes to all. If you have small kids there is less to do in summer unless you want to \"climb the mountain\" which is the large sledding hill. If you like sports bring your tennis and basketball stuff in the summer or your skates and sleds in the winter. In winter there is a warming house with cocoa, etc.",
  "Very large park with multiple basketball courts. nice playground area and also a shelter where you can throw parties.",
  "Winterfest had great skiing and sledding and skiing for people who are disabled and coffee and hot chocolate and gyros and somemores and wonderful volunteers!",
  "One of several of the really nice parks in Madison. Good for x-country skiing. Cross the road for the good stuff.",
  "Elver Park on Madison's far west side has long been our favorite hill to come for winter sledding. It's a long, steep hill which makes for very fast sledding. PLEASE make sure you climb back up the hill to the far right, NOT up the middle. ",
  "Went with my niece and nephew to play in the snow and it was a blast. Definitely a great place to enjoy as a family and a fun winter spot to visit. "
 ]
},{
 "name": "Madison Public Library",
 "address": "210 Mifflin Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e0/76/73/madison-public-library.jpg",
 "tags": [
  "field",
  "library",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60859-d4885828-Reviews-Madison_Public_Library-Madison_Wisconsin.html",
 "source": "TripAdvisor",
 "reviews": [
  "Best childrens section. I love that this is in the basement so the kiddo's do not have to be real quiet. There are activities planned and classes that you can drop in on! We have also eatten lunch a few times on our field trips! Great staff and very welcoming!",
  "The Madison Public Library is a fine stop, especially when it is raining out and you have children with you.  The children’s sections not only has a fine book an d reading area, but also a fine collection of computer based amusements for children.  Well done, Madison.",
  "This is a great place to find some excellent reading material but also for local events and don't forget to check out the children's section!",
  "This is a wonderful place to visit in Madison, of course for books, but also the wonderful children's section in the lower level which has some great educational play stations. Also, the rooftop has a great view in warmer weather.",
  "This is a wonderful library. Everyone is so helpful. There is a great selection of books and if they don't have it they will help you find it."
 ]
}]
