[
{
 "name": "Morse Farm Maple Sugarworks",
 "address": "1168 County Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/41/b6/ab/chrysanthemums-for-sale.jpg",
 "tags": [
  "unique",
  "theatre",
  "free",
  "history",
  "tour",
  "family",
  "tasting",
  "delicious",
  "tour",
  "sampling",
  "tour",
  "sampling"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d2216699-Reviews-Morse_Farm_Maple_Sugarworks-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "The maple soft serve ice cream, the quirky wood \"sculptures\", the great gift shop, the hilarious video narrated by Burr Morse, just some of the reasons to make the visit. The biggest reason being their long term commitment to maple syrup production. Well worth the visit. Vermont as it always has been and hopefully will continue to be!",
  "Started our visit with a trip to the \"Woodshed Theatre\"  where we watched a video of Burr humorously explain the process of turning maple sap into maple syrup and maple sugar products. Quite interesting and filled with lots of information. The sugar house was our next stop. As it was after the syrup season, clean was taking place... But we received a great overview of the process by our guide.\nScattered throughout the grounds are unique wood carvings and sculptures. You can also see antique farm and maple sugaring equipment .... and cute animals.\nThe country store/gift shop is H-U-G-E! Lots to look at and many maple products to sample and purchase. Plus, you can get maple soft serve ice cream. yum!\nBeautiful grounds and scenery. Welcoming people... A perfect example of Vermont and is welcoming, friendly spirit.\nA fun place to visit for all ages.",
  "Every time we have company come to visit Vermont we take them to Morse Farm.  Entertaining information on the history and current techniques for making maple syrup.  During sugaring season you can watch the syrup being made right there in the sugar house.  They have a great gift shop filled with local items and everything maple (lots of free samples), sugar on snow during sugaring season and the BEST maple cremees around!  They also have hiking and cross country ski trails so you can work off all the calories.",
  "If you live in Central Vermont, Morse Farm is one of those iconic family businesses to visit with out-of-town family or friends; to buy your Christmas tree and wreath; to buy your fall mums and pumpkins; to buy your fresh berries, corn, apples or whatever the seasonal produce might be. They make their own excellent maple syrup in all grades, maple sugar candy, maple kettle corn, and offer maple creemees year round. They have a great gift shop with whimsical items for folks of all ages plus maple syrup tasting. They stock Vermont cheeses and other local products in the frig and local grass-fed beef in their freezer. Situated just outside of Montpelier, it's a major stop for tour buses during leaf-peeper season. It's a charming place to sit in the sun, take in the views, and have a nice chat with family or friends over one of those delicious creemees.",
  "Bus tour stop, I thought that this would be boring but turned out to be really good fun.\nBurr did a fantastic talk on how maple syrup is collected. This guy should be on stage, he was so funny.\nStore good with lots of interesting products, fantastic place.",
  "We visited the Morse Farm because a former work colleague grew up down the street from them and would bring me syrup when he came to back to work. We didn't join in on the tours, but they did have buses that had special presentations and sampling of the products. Some of the groups were from Texas. You can sit through a presentation and movie and then visit their store with all kinds of treats and syrups to take home. Even maple ice cream was served. We had a chance to get a good sampling of the products and setting but you could spend a good hour or more with the whole presentation there.",
  "Arrived at the same time as a bus tour, so the shop was very busy, but we did get to hear the talk about the harvesting of sap and making of maple syrup, with the chance to ask questions. It was of course entirely the wrong time of year to see the process itself. Look out for the faces in the wood.",
  "A fun place to visit.  A little bit out of the way but worth it.  Enjoyed the maple ice cream and sampling the different grades of maple.  Informative on production of maple syrup.  Great decor and a fun gift shop."
 ]
},{
 "name": "Bragg Farm Sugar House & Gift Shop",
 "address": "1005 Vt Route 14 S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/18/d7/22/bragg-farm-sugar-house.jpg",
 "tags": [
  "tour",
  "family",
  "learn",
  "history",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d2182212-Reviews-Bragg_Farm_Sugar_House_Gift_Shop-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love visiting the Bragg Farm Sugar House, they have the best maple creemees in the state!  I make it a point to bring every house guest we get.  I love that they still collect all their sap in buckets (no tubes!), the syrup is great!  They also have lots of other VT specialty items!  Everybody is very nice too!",
  "It was all things Vermont. A cute country store with  all the essentials to bring back a souvenir if your from out of state. When you visit you are able to visit the Sugar house, the store, ice cream shop and even view a video on how they produce the maple syrup. It was fine but I would have liked to have been able to take a tour and see how they go about doing the maple syrup. The ladies inside were very nice and were very helpful in answering questions. We made several purchases to remind us of our visit to Vermont. ",
  "Had to stop after reading the reviews.  We were not disappointed.  The maple syrup was amazing!  Loved that we were able to try the different kinds as well as learn all about sugaring.\n\nThe owner was wonderful.  Loved hearing the stories and learning about her family farm and the history.  Definitely a must stop!\n\n",
  "Just happened to see this place driving through VT.  It was a fun store and I wished we had more room in our luggage so we could have bought more!  Maple corn (think caramel corn) was delicious!  Besides basic syrup, they have all kinds of treats and gift items.  A plus is the scenery in the area in the fall!",
  "Our 4th trip to Vermont from California and would never miss a stop at Braggs Farm.  Always so friendly and helpful and find things we don’t see elsewhere. This time I had them mail my heavy box of wonderful syrups, jams, and various gifts to to my home and it arrived within a week, each item wrapped with great care, nothing broken and with a reasonable shipping rate!  Can’t wait to go back! Be sure to have a maple flavored is cream cone on your way out!"
 ]
},{
 "name": "Vermont State House",
 "address": "115 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/fa/28/3b/vermont-state-house.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "history",
  "free",
  "history",
  "tour",
  "active",
  "tour",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d105553-Reviews-Vermont_State_House-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "I came to Vermont to visit an old Friend, Montpelier was the closest City, so I stayed @ an AirBnB across the river from the State House. Kept busy w/ my friend so did my exploring of Montpelier in the evening, but had the afternoon before my departure, so the State House was just the destination.\nGuided tour or just on your own to roam around, great architecture, great history & the People's Museum decorating the Halls ... \nWandering to the 2nd floor, in the back to my \"surprise\" was a well appointed \"Legislators Cafeteria\" open to the Public (Why of course ..😉😀😂). Browsed the Menu, good selection, good prices and open for Breakfast & Lunch ... 👍\nMy misfortune was, last day late, but had I known this would have been a regular for Breakfast during my visit. \nShould you be there during the Legislature you might even be \"rubbing elbows\" w/ the State political establishment!\n\"Enjoy History my Friend\" (Dos-XX)",
  "Elegant is the word for Vermont’s stately capitol building.  The tour guide imparts facts of Vermont and the history and architecture of the building as the group moves from room to room.  Each space is classic beauty – entry, house and senate chambers, governor’s office, graceful staircases, and reception room.  After the tour, we walked back to each of the rooms for another look and photographs.  The gold dome atop the building shines brilliantly in the sunlight – perfection!\n  \nWe parked in the metered parking in front of the lawn, but once inside, we learned that some free parking spaces are nearby.  The price of the meters was fine especially considering that the tour is free.",
  "The Vermont State House in Montpelier is a beautiful building featuring period architecture on immaculate grounds.  Worth a stop for history buffs or USA travelers.",
  "Whenever I am at a new state and I am in their capitol city I love to visit their Capitol building. The Vermont Capitol building was built before the Civil War and it is a stately building. The building is currently under renovations so we were not able to get a thorough visit but what we were able to see was beautiful and well maintained. We were lucky enough to be granted permission to visit the House and Senate chambers. The actual building itself was not as large as I expected it to be but it definitely has plenty of character. Glad to have been able to visit. The one thing I found interesting was the people who work in the building; they treated us so well. At the end of the day in buildings like these it is not necessarily about the building but the people and they left a great impression. ",
  "I didn't realise this was the state capital but tour turned out to be a pleasant surprise.\nVery impressive inside and outside in a really good setiing.\n\nHidden gem!",
  "We visited this place on October 9. There are guided tours every each half hour. You will see the into 1859 redecorated chamber and senate. It is not the biggest or nicest State House we have seen, but the explanation we got from the guide (an active representative) was very informative.",
  "Visited Vermont State House as part of a New England in The Fall tour with Insight Vacations. The building is impressive from the outside and equally impressive on the inside. Well worth a visit.",
  "The Vermont State Capitol Building in Montpelier is a stunning and classic building in a beautiful setting.  The building dates to 1859, is finely detailed, and contains a small state museum which features Montpelier native Admiral George Dewey from the Spanish American War of 1898.  The surrounding area is also picturesque, across the street from the Capitol Building is a string of about 5 or 6 fine old Victorian-era houses, many of which now house Vermont state departments and a visitor center with free coffee and restrooms.  The entire area is surrounded by nice trees with fall color."
 ]
},{
 "name": "Camel's Hump",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/7c/0e/b4/looking-out-towards-sugarbush.jpg",
 "tags": [
  "walking",
  "kids",
  "parks",
  "food",
  "kids",
  "hike",
  "hike",
  "hike",
  "walking",
  "kids",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d146348-Reviews-Camel_s_Hump-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "Just hiked it two days ago and it was phenomenal!!! We are not hikers, but we accompanied another couple who are. The trail is rated moderate difficulty by the Vermont State Parks website, though other sites list it either as for beginners or easy. No way is this for beginners, (though we did see several families with kids and dogs) unless you happen to be fit already. This was hard work (for us), not so much for the other couple, though they did mention that their legs are still a bit sore. I don't have much to compare this trail to, but it did seem steep to us at times, and the trail was covered in rocks, tree roots, and boulders (a couple of which required me to climb over as I'm short). Walking poles were very helpful, both up and down. It is 2.1 miles up the trail, with another .3 to the summit. And once you reach the summit - WOW. Fantastic views and a great feeling of accomplishment. Though it was a bit foggy for us, apparently on clear days you can see quite far. It was extremely windy and chilly at the summit that day - actually thought I might blow over a time or two! It took us approximately 5 1/2 hours round trip (with some breaks). Really great experience.",
  "OK, I'll admit that we were a little unprepared mentally for a six, yes, six hour round trip expedition on the Monroe Trail.  We are by no means serious hikers.  Luckily, we were dressed appropriately (gorgeous day over Columbus Day weekend) and we had plenty of food.  The trail was much longer than expected, so we did plop down halfway up to have our picnic lunch, but that was OK.  My two kids and little dog made it up without too much grumbling.\n\nLesson learned: I will not undertake something like this again without poles.  The more serious hikers had poles and I was a little jealous as we scrambled over rocks.  Overall, we are in decent physical shape and we found it a worthwhile challenge.\n\nThe pictures we captured at the top of the mountain barely do it justice.  It really was a gorgeous view of mountains, countryside and foliage.  Just stunning.  We all agreed that we'll make this an annual tradition (except next time with poles!).\n\nGo for it.  We'll be talking about this for years to come.",
  "I absolutely love hiking Camel's Hump. I typically go up the Waterbury/Duxbury side up the Monroe Trail. Those that are looking for a little easier hike should consider going up the Huntington side. There are many cool things to see on the hike including the plane crash site and of course the summit which is in the Alpine tundra. The views at the summit are amazing. Consider bringing a light jacket for the top as the wind can make you cold - even in the summer months. The hike can get difficult at times but is totally doable by almost anyone. Last time I went (May 2016) it took me about 1.5 hours to reach the top.",
  "I am from CO and consider myself an intermediate hiker. I've done a couple of 14ers and a lot of day hikes. I didn't think too much of this hike as we started and I will say it kicked my butt! Vermont trails go straight up! There are a lot of rocks and leg work! There is a little bit of a scramble near the top but I didn't find that part too difficult. It is worth it for the spectacular views and the feeling of accomplishment!",
  "A relatively difficult hike for a novice hiker in her 50s.  I’d suggest walking poles to take some pressure off the knees.  It’s a long hike and so worth it!  Good to do with older kids, couples and relatives who are in shape.",
  "Trails aren’t ready for visitors but I’m so ready for this mountain again. It’s my fav in all of Vermont. Either side, all sides, trails excellent. Spring is a magical time on this mountain with so many weekly changes. Birds are singing at lower elevations. Wait til mud season is over tho then enjoy! Weekends can be very busy so if you’re able go midweek. You’ll enjoy the quiet of the trail.",
  "Amazing hike. Trails were muddy yet we maintained.  There’s a good amount of traffic, and not everyone planned very well.  The day stared out nice, sunny and cool.  The start was about 50 degrees and no wind.  As we got higher it stared to rain and eventually turned into snow.  The summit was roughly 20 degrees and 60-70mph winds.  It was beautiful.  But I watched people summit in shorts and quickly regret it.  \n\nDoes and don’ts...\nDo bring water to rehydrate.\nDo bring a flashlight\nDo pack a windbreaker/rain jackets.\nDo wear hiking boots and not sneakers\nI recommend trekking poles as they make the descend much easier.\nDo plan for a 4 to 6 hour hike.  It can be done much quicker if you’re in incredible shape but you’re not going to enjoy much scenery either.  \nDo pay attention to which trail you take up. There’s a landing where all the trails merge before the summit and if you head down the wrong one you’ll be ALONG way from your car (like 16 miles).\n\nDon’t start hiking at 4 o’clock without headlamps and flashlight during this time of year.\nDon’t be loud and ridiculous.  People are out there to get away from that.\nDon’t be affrade to turn around if it gets late or the weather isn’t favorable.\nDon’t think because you’re warm at your car that the summit weather is the same.\n\nI saw people hiking in tennis shoes, shorts, and t-shirt with no water, no jacket, and no idea what they were getting into.\n\nOn day hikes I’ve never regretted being over prepared.",
  "Loved traveling to Vt. to see the foliage.  We will hike Camel's Head but the road Camel Hump Road gets very narrow and it's best to travel less than the speed limit as other cars don't always share the narrow road or slow on small hills. The park is not easy to find."
 ]
},{
 "name": "Vermont Historical Society Museum",
 "address": "109 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0e/d5/90/the-pavilion-building.jpg",
 "tags": [
  "history",
  "walk",
  "free",
  "walking",
  "walk",
  "history",
  "history",
  "walk",
  "art",
  "history",
  "history",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d106224-Reviews-Vermont_Historical_Society_Museum-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was not planning to visit the museum but we walked by and decided to give it a shot. I am so glad that I did. The museum takes you on a full history of Vermont from Native American history to colonization, to their efforts in the American Revolution to statehood and beyond. As you begin it starts at a wigwam and as you walk through you are able to get the full story of Vermont. Their displays are excellent with plenty of artifacts which tell a complete story of who, what, where, when, why and how. If I remember correctly we only paid about $7 per adult person and it was worth it. They also have a small gift shop which had some great items to purchase. For the purposes of planning your visit it can take you anywhere from 1-2 hours to see all exhibits, maybe more if you really get into reading all the stories. I highly recommend this Musuem, you won’t be disappointed. ",
  "I spent about 90 minutes walking around this museum. Lots of good information and cool displays. You see everything from political stuff to Norman Rockwell stuff to Native American stuff.\n\nIt was the weekend and I parked for free right out front of the Capitol Building which is next door. \n\nThere are restrooms there and you can easily walk down the road to restaurants and shops. ",
  "The museum is strategically located next to the Vermont State House.  It is easy to visit both within a morning and we heartily recommend that visitors to Monpelier do so. There is a modest entrance fee that is well worth it.  The exhibition provides a flavor of life throughout Vermont history, from Native Americans to Ethan Allen to  modern industry and concerns about retaining the 'Vermont way of life.\"  The small gift shop has a pleasant selection. ",
  "I was not planning to visit the museum but we walked by and decided to give it a shot. I am so glad that I did. The museum takes you on a full history of Vermont from Native American history to colonization, to their efforts in the American Revolution to statehood and beyond. As you begin it starts at a wigwam and as you walk through you are able to get the full story of Vermont. Their displays are excellent with plenty of artifacts which tell a complete story of who, what, where, when, why and how. If I remember correctly we only paid about $7 per adult person and it was worth it. They also have a small gift shop which had some great items to purchase. For the purposes of planning your visit it can take you anywhere from 1-2 hours to see all exhibits, maybe more if you really get into reading all the stories. I highly recommend this Musuem, you won’t be disappointed. ",
  "We visited this place on October 9. It is a one floor museum where you get a view of the Vermont history. Do not expect a state of the art museum. It seems more a museum for schoolchildren to actively get an idea what the inhabitants did in those days.",
  "This charming, old hotel now houses the Vermont state museum which gives a good overview of the history of the state and how it connects to NY State.  Well displayed and enjoyable.",
  "We spent an hour slowly ambling through this well designed display, each room was carefully crafted to portray its own period of history. Many artifacts to gaze upon giving us a real sense of the lives of the people over the years.",
  "We really enjoyed this museum. Lots of great information and artifacts. When you first walk up it does look like it’s much but it’s very large and worth spending the money."
 ]
},{
 "name": "Hubbard Park",
 "address": "Winter Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/a2/3f/a8/the-tower.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d651153-Reviews-Hubbard_Park-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you didn't know it was in the center of Montpelier, you would never guess it once you are within. A beautiful wooded area with easy, clearly marked trails, but an overall map would be helpful. There are trails all over, but its hard to know where you are going unless you are familiar with them. Best to stay on the main trials and roads.\n\nGood shoes and adequate clothing is a must depending on the weather. There is limited parking within the park, but some on streets leading up to the park entrances.",
  "I went expecting something different. Really, I was just looking to go up into the tower to check out the view. What I found were tons of really great, well-maintained trails. I explored only a few of them as I didn’t plan for a lot of hiking. \n\nTurns out the tower was only kind of cool with ok views but the paths were stellar. ",
  "This park is essentially behind the state house.  The drive to get there is quite interesting as the road are narrow, twisting and super steep!  Once in the park, there's not much labeled.  I had wanted to see the tower pictured on trip advisor, but could not easily find it.  There were no signs and we did find one map posted but it wasn't clear where we were on that map.  Still, we stopped at some picnic tables and had a nice lunch.",
  "This park is easily accessed with plenty of parking and it offers a good variety of trails man ythat are gently sloping and welcoming to the walker or to the hiker.  ",
  "The entrance to the Hubbard Park Tower Trail is not well labeled and rather hard to find.  It is at one end of a parking lot behind some city buildings.  You may need to stop at the visitors center for a map of the area.  They will be glad to give you detailed directions.  The trail in the park is beautifully tree lined and well maintained.  It is rather steep and winds through the woods.  When you reach the end of the trail you can climb 65 more steps to the top of the tower.  It is worth it because the view is fabulous.  "
 ]
},{
 "name": "Lost Nation Theater",
 "address": "39 Main St Montpelier City Hall",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/46/c3/ca/lost-nation-theater.jpg",
 "tags": [
  "theatre",
  "performance",
  "performance",
  "family",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d5007427-Reviews-Lost_Nation_Theater-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "This theater has been in town for 30+ years.  They do a wonderful job and it is worth the visit for their shows.  When in town, please do urself a favor & see 1 of their productions. You won’t be sorry...",
  "The most remarkable thing about LNT is the group of young professional actors they bring in from NYC and elsewhere. Whenever I see that Christopher Scheer, Aaron Aubry, Kate Kenny or Eric Love is returning for a play, we drop everything to make sure we see it.",
  "Lost Nation Theater is a small, intimate theater in the heart of downtown Montpelier where every seat is a great seat!  I have seen many productions from drama to musicals and have always been impressed with the acting, costumes, and the set.  Visiting, very talented professional actors from New York to Chicago have performed at Lost Nation Theater.  A must see for all — you will leave smiling!",
  "Even if you’re in town for only a few days be sure to catch Pride and Prejudice at Lost Nation Theatre. It’s a rollicking laugh out loud high jinks interpretation on a classic. And ... a befuddled Mr Darcy still ends up with a resolute, before her time feminist, Lizzy just like We always imagined   ",
  "Intimate theater perfect for the stellar performance by Margo Whitcomb. Another must see offering from Lost Nation Theater. Bought our seats in advance which allowed us to reserve two seats in the third row center on the aisle. Buying tickets at the door gets you an unreserved seat so get there half hour before showtime, head in to the theater and pick any unreserved seat.",
  "While stopping in Montpelier overnight during a family road trip, we decided to see \"Cabaret\" at the Lost Nation Theater in the City Hall Building.  None of us had ever seen play, or movie, but as it has always been well reviewed, we wanted to check it out.  Amazing!  The entire performance was mesmerizing. Excellent singing, dancing, acting, costumes, and make-up!  I have seen many Broadway plays and musicals and this ensemble is certainly on par.  I would definitely recommend putting this theater on your list of things to do while visiting Montpelier!",
  "This theater has been in town for 30+ years.  They do a wonderful job and it is worth the visit for their shows.  When in town, please do urself a favor & see 1 of their productions. You won’t be sorry...",
  "For many years now, decades?, Lost Nation has provided imaginative entertaining theatre for Central Vermont residents and visitors.  We are grateful for its presence.  I look forward to the next show"
 ]
},{
 "name": "Ethan Allen Statue",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c0/0f/ef/ethan-allen-statue.jpg",
 "tags": [
  "history",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d105554-Reviews-Ethan_Allen_Statue-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "It is outside the capital building. Get a pic. I had forgotten his history. All I had on the brain was furniture. ",
  "As all stautes are, this one is of a famous historical figure.  Ethan Allen was a Green Mountain Boy and participated in the founding of the country.  Located in front of the state house, it is easily viewed.  Plenty of parking available around the state house.",
  "Ethan and his younger brother Ira played major roles in Vermont's history. Not just in wartime but also in peaceful times",
  " This was the second Ethan Allen statue we have seen this month. The other, representing the state of Vermont, is displayed in the US Capitol in Washington DC. ",
  "Located just outside of the entrance into the State House, be sure to stop by for a photo either coming or going!  Just don't miss the statehouse tour!"
 ]
},{
 "name": "Ceres",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/c0/11/65/ceres.jpg",
 "tags": [
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d108051-Reviews-Ceres-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "December 2018:  Ceres is back! A local sculptor was selected to carve a new statue after the old one became damaged and worn over the years. This one is carved of hardwood instead of pine. Fun fact: the statue has to be wood because the Statehouse dome isn't strong enough to support a stone statue. We held a big public celebration to raise the new Ceres to her post atop the dome. So if you missed her earlier in 2018, come back and see the fresh new version.",
  "The Vermont state capital building is solid and simple in form, built from local granite.  Elegant in its simplicity, but topped with a gold dome and a statue of Ceres, the god of agriculture. The original(s) statue of Ceres was hand carved out of wood by the Senate sergeant at arms.  The capital building is beautiful inside and well worth a visit and tour.",
  "You can't really get up there to see it, but the lobby has a great display and story of the capital. ",
  "December 2018:  Ceres is back! A local sculptor was selected to carve a new statue after the old one became damaged and worn over the years. This one is carved of hardwood instead of pine. Fun fact: the statue has to be wood because the Statehouse dome isn't strong enough to support a stone statue. We held a big public celebration to raise the new Ceres to her post atop the dome. So if you missed her earlier in 2018, come back and see the fresh new version.",
  "Ceres has been removed. Don't know why or where it has gone. The state house looks odd without it. The dome is bright and shiny gold.",
  "April 2018 - The Ceres statue has just been removed for a cleaning and will be replaced back upon the state house dome later this year after the dome itself is cleaned and re-laminated.  As an historically agricultural state, which is still true in many respects today, Vermont selected Ceres since she represents Agriculture.  It is good to know they are keeping to their 'roots.'",
  "This makes a nice crown to a photogenic capitol dome - the building and grounds are definitely worth checking out while visiting the area!"
 ]
},{
 "name": "Coburn Covered Bridge",
 "address": "Coburn Rd east of Montpelier, east of route 14",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/91/2d/75/busy.jpg",
 "tags": [
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d14920208-Reviews-Coburn_Covered_Bridge-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I were driving from NH to Montpelier and decided to check out the Coburn Covered Bridge from my Trip Advisor research.  I wasn't super excited about it at first but after seeing it was glad we went.  Granted, it's only a bridge, but it was fun to see the preservation of history and think about how life was back then (and it's still functional).  It's a bit off the beaten path but easy to find with GPS.",
  "For many Baby Boomers, these were a country stable item,  Today, there are only a few, many are recorded in books. However, here there is an actively used  covered bridge, weather but still useful.",
  "This is cool because we don't have them in Houston. I have a few other bridges collected in our travels. We take a short video of going over or through them. Kinda cool. ",
  "Not exactly easy to get to but worthwhile if you enjoy this sort of task.  Built in the 1840's and possibly the only remaining covered bridge in East Montpelier.",
  "This bridge is less than a mile from US-2. Parking near it was easy. Many cars went over it in the twenty minutes we were there. It is a very nice covered bridge."
 ]
},{
 "name": "North Branch Vineyards",
 "address": "82 Trillium Hl",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/5d/7e/82/welcome.jpg",
 "tags": [
  "tour",
  "family",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d4174181-Reviews-North_Branch_Vineyards-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "Though I have not actually been to the vineyard (I would love to go) I have had he pleasure of meeting the owner at the Stowe Foliage Arts Festival for the past two years.  He is a joy to talk to had his wine is simply amazing.  I love the Frontenac Gris and the Proprietors Blend but my absolute favorite is the Frontenac.  He makes wonderful wine that I greatly enjoy and recommend to anyone who likes wine no matter what their preference is because he has something for every palette! ",
  "Don't let this place fool you.  I have been visiting several wineries and vineyards this summer and this is the first to boast that all the grapes are grown in Vermont!  Very knowledgeable and personable.  Answered all of my husbands questions about wine making and even explained things to the beer drinking part of our party so that they understood.  Our entire group was very pleased with the business and this stop on our tour.\n\nMake sure you call ahead as it is a family business and sometimes they have family functions to attend."
 ]
},{
 "name": "Vermont College",
 "address": "36 College St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "art",
  "kids",
  "walk",
  "tour",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d106580-Reviews-Vermont_College-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "I graduated from Vermont College in the 1960s. Back then it was a two year school for girls offering associate degrees. Now it is called Vermont College of Fine Arts offering master's degrees. My daughter recently moved to Montpelier, so when I came to town for a visit, I took the time to revisit the campus. Much to my delight, except for the new sign on the quad, the campus looks exactly the same as when I attended. Quaint, charming and quintessential New England. It sure brought back many great memories. What a lovely place to pursue a degree.",
  "Wonderful classic architecture in this traditional college.  Quiet, safe campus can get students away from busy cities to focus on studies",
  "This is a beautiful campus that has undergone some changes in the last few years.  We have seen some face lifting being done to the grounds, but the obvious things have remained the same - the beautiful buildings and the water fountain on the Green are stunning, there's also the addition of their beautiful new Cafe building - state of the art with lots of glass - just stunning.",
  "Looked like a fun little school to send your kids to. Hilly area.  Not much fun to walk in - in the winter.  Small town with a lot of opportunities.  Just nice.",
  "Vermont College is the epitome of a small New England College.  A stroll around the square and a tour of the architecturally unique College Hall are a wonderful way to spend an afternoon."
 ]
},{
 "name": "Pavilion Building",
 "address": "State Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/78/5f/9b/caption.jpg",
 "tags": [
  "historic",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d146345-Reviews-Pavilion_Building-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Pavilion Building is located a stone's throw from the Vermont State House.  The building is historic and is home to the Historical Society and some state offices. The building is not the style one might expect of a state office building - but look hard and the deep verandas and high ceilings.  All Lovely!",
  "Attended a meeting in this building so did not get to explore. It is a charming old Vermont building that has been renovated to house office space, governor's offices and a museum. It is well kept. Prepare for security and to have special key entry for access internally since it is a government office building. ",
  "The old building burned down.  The state built a replica of the old building and attached a modern brick and mortar office building to it.  There's not much to see unless you're a fan of government office buildings, fluorescent lighting, and bland paint combinations. The governor's office is on the fifth floor, the floors below house the state treasurer and the office of the attorney general.",
  "A nice little museum that covers everything from the paleo-Indians on to today, it takes around an hour to see it all. Everything is in good condition, and the topic coverage is comprehensive, including the anti-Masonic political parties of the 1800s, and even a photo of a large Klan (yup, that's right) rally in the 1940s. It's all here, and nearly organized. Kid friendly.",
  "Great exhibits, genealogy research. Very interesting. I liked the stuffed animals and other artifacts."
 ]
},{
 "name": "Green Mountain Cemetary",
 "address": "250 State Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "unique",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d17626290-Reviews-Green_Mountain_Cemetary-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is one unique cemetary.\n\nStart off with the massive stone entry; with a castle-like appearance, stone arch and two side chapel-vault buildings. A fine way to enter such an omnious place.\n\nTake the first right and see the memorial to lost at birth or very young children. Heartbreaking. At the end of this short drive we parked and walked the rest. In the corner you will find the \"stairway to nowhere\" carved out the existing granite. At the top find a built in bench and higher up a tree-stump carved into a chair. BUT... explore beyond for a second stairway and old fountain fall with an angel looking over you!\n\nKeeping walking up the far right side to see many other well-known sculpture and carved stones. Stop at Margaret who is standing calmly at a gate. Can you find her missing shoe button? Maybe you might see her ghost leave the stone and float to her nearby parents stones only to disappear inside it! Continue upwards looking for dogs, angels, crosses and such. Look around the back edge of the hill for in-the-woods memorials. Take alook back down at the entry for a fantistic view.\n\nWalking back down, we explored carved clothing left on memorials and flowering bushes. You might see a man holding his hat! Do not leave before stopping by \"Black Agnes\" but be forewarned if you sit in her lap at midnight! Legend says that \"grave bad luck\" and even death befalls all who do."
 ]
},{
 "name": "VT Dept of Tourism & Marketing",
 "address": "1 National Life Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "knowledgeable",
  "free",
  "walk",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d146341-Reviews-VT_Dept_of_Tourism_Marketing-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visitors to Montpelier and Vermont can get a lot of useful help here on what to see and when and where to go.  For hikers especially, the Green Mountain Club in Waterbury is also another excellent source of information.  But the staff at the Department of Tourism is knowledgeable and helpful and, yes, very clean bathrooms.  Public transportation is spotty in Montpelier so you may have to drive to get to the Department of Tourism.",
  "Good for an overview of Vermont tourist options.  Staff very helpful.  I needed info on hiking Camel's Hump and they photocopied a map of trails with descriptions.  Plenty of parking in back for free.  Worth a visit.",
  "Be warned that in the winter months The Vermonter train from NYC arrives in Montpelier Vt after dark and the train station is almost 2 miles from civilation.  The station will be closed.  There is no public transportation unless the lone Montpelier taxi is arranged beforehand.  Winter temperatures at that time can approach zero and wind-chill much below that.  I wouldn't give a nickel for your chances of surviving a walk to town. God forbid you are disabled.",
  "The ride up to Camel's Hump State Park is a hoot-the mountain itself is a challenge to the great vertical relief and steepness of the upper ridges. Still, well worth the trip.",
  "Desk personnel know Montpelier well and can expertly direct you to your destination.  The information bookshelves and map racks are well organized and nicely stacked.  Rooms are clean, well-lighted and bright.  Service is swift and efficient. Overall a pleasant experience. "
 ]
},{
 "name": "T.W. Wood Art Gallery",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "art",
  "art",
  "historic",
  "music",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d106581-Reviews-T_W_Wood_Art_Gallery-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "Appreciated the display of Hooked Art of Tarot Cards and other work by the artists in group. The stairs were a challenge for some in party",
  "The Wood is well-known locally for its extensive permanent collection of historic Vermont art. It is now in spiffy new quarters on Barre Street (in a refurbished building) and has rotating collections as well as regular special events. The building is now known as CAL -- the Center for Arts and Learning -- which offers art space, classes, music and more. Hours are now afternoons, 12-4, Tues-Sat. Check it out.",
  "The location has changed and it is amazing what they are doing with the place,  the art is beautiful, great place to go",
  "This is a great local institution with a wonderful permanent collection and lots of revolving exhibits but -- it recently moved to new digs at 46 Barre Street and is still in the process of getting re-established in this new location.  Call before making the trip!"
 ]
},{
 "name": "North Branch Nature Center",
 "address": "713 Elm St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "free",
  "hike",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d17571754-Reviews-North_Branch_Nature_Center-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": [
  "The North Branch Nature Center hugs the banks of the Winooski River, just barely outside Montpelier, Vermont. There is no charge, and we visited on a June week-end, when it was awash in greenery. It adjoins a large community garden where one is free to visit and talk to the friendly (it's Vermont, after all) gardeners (no dogs allowed in garden). Paths are maintained in the grasslands of the Center and lead to a bridge over the river, where the nature trail continues for perhaps miles. \n\nThere is a school at the Center during the week, but the rustic playground is available to visitors on weekends, where the youngsters can get down and dig in the dirt, climb on rocks and fallen trees, and do what youngsters will. \n\nThere is also an office, which perhaps has exhibits but is open 9 am to 4 pm on weekdays. Check the website for periodic programs and events.\n\nJust a nice place to hike through or stroll around. Plenty of free parking."
 ]
},{
 "name": "Capital City Farmers Market",
 "address": "60 State St",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d20182043-Reviews-Capital_City_Farmers_Market-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": []
},{
 "name": "Historic Montpelier Train Station",
 "address": "11350 Constitution Hwy",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d14396947-Reviews-Historic_Montpelier_Train_Station-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": []
},{
 "name": "Studio DavAnn",
 "address": "",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g57324-d1490419-Reviews-Studio_DavAnn-Montpelier_Vermont.html",
 "source": "TripAdvisor",
 "reviews": []
}]
