[
{
 "name": "Legacy Museum",
 "address": "115 Coosa St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/cc/0e/27/memorial-of-peace-and.jpg",
 "tags": [
  "walk",
  "history",
  "history",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d13977526-Reviews-Legacy_Museum-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Legacy Museum is simply one of the most remarkable museums in the U.S. on par with the Holocaust Museum in Washington, DC.  Traces the legacy of African Americans from slavery through incarceration in an objective, but stirring manner. A stark view of the reality of racism in America with the goal of compassion and healing. Impeccably well researched as one would expect from the oversight of the great Bryan Stevenson.\n\nHINT  Be sure to get tickets in advance. Admission is timed and limited to allow for people to really explore the exhibits in depth.  Don't miss the nearby Memorial for Peace and Justice which can be accessed by bus from the Legacy Museum.",
  "This Museum and the Memorial for Peace and Justice are two separate areas, yet they are both connected and interrelated.  There is a reasonable fee for each, and tickets may be bought on line.  The museum tickets are timed since it is very popular, so it is wise to reserve in advance.  The memorial may be visited at any time during the hours at which it is open.\n\tThere is a shuttle running around every 20 minutes between the two areas. You can also walk (around 20 minutes) or drive.  Parking at the museum can be challenging, but there is a parking garage about two blocks away.\n\tThe memorial was formerly known as the National Lynching Memorial and is a national memorial to commemorate the victims of lynching in the United States. The memorial was constructed and opened in 2018 in order to acknowledge the past of racial terrorism and further the continual search for social justice in America. In the central position is the memorial square with 805 hanging steel rectangles, the size and shape of coffins, representing each of the counties in the United States where a documented lynching took place.  Around this is a reflective area with benches and statuary where people may sit or walk.\n\tThe Legacy Museum: from Enslavement to Mass Incarceration displays the history of slavery and racism in America. This includes the enslavement of African-Americans, racial lynchings, segregation, and racial bias.  There are displays, storyboards, videos, photographs, and artwork to spent time thinking about.  There is a collection of soil in bottles from lynching sites across the United States on display at the museum and an area with “hologram” technology to dramatize the horror and terror of enslavement, lynchings, and legalized racial segregation in America. There are first person accounts of slavery and auctioning through narration and voice overs.\n\tWe spent around three hours here in early March.  If you are in the Montgomery area, you need to visit these sites.",
  "This is a must see stop for anyone traveling through the area as well as making time in your life to travel specifically to visit this place and others in the Alabama/Georgia area when thinking about human and civil rights. This experience is well planned and laid out with very deeply moving and disturbing information, lessons, interviews and thought provoking content. Note: please make sure if you are brining children to have a conversation with them before going, do research about what to expect and leave time for important processing and talking about this topic during and after your visit. Change starts with education and a passion for fellow human beings. \nNote... you are not allowed to take backpacks, large purses, take photos, videos, have cell phones on during your visit inside so its best to leave them in the trunk of your car.\n",
  "This museum presents aspects of our country's history that isn't included in textbooks, starting with the early slave trade through the disparities that still persist today.  The stories told though photos and audio recordings are sobering.  \n\nAs a nurse, I found the differences between the treatment of white and Black patients horrifying.  Everyone deserves good care, no matter their skin color. ",
  "The setting for the outdoor portion of the Museum is a large rectangle surrounding open ground.  Experiencing it reminded me of being at the 9-11 Memorial in NYC or the Holocaust Museum in DC.  The visitors are respectful and sober..... just soaking in the significance of the sheer number of lynchings that are memorialized here.   Well worth a visit.",
  "This museum is long over due. It tells the story not of an uplifting \"isn't everything better now\" civil rights movement, but of the continuing legacy of slavery that is still unresolved. The museum does provide some uplift with the opportunity at the end to find ways to get engaged on these issues in your own community -- it encourages participants to take action to correct injustice. \nIt is a relatively small space but it packs in a lot of information in a coherent and powerful way. The point is to demonstrate how slavery, then lynching and terrorizing Black Americans  has morphed into a police state that incarcerates Blacks as a \"legal\" means of continuing white supremacy. It's powerful, well researched, and well presented. You can't leave the museum without feeling changed. \nI would definitely get tickets in advance on line. You reserve for a particular time. We were there on a Saturday morning and it was busy but not impossibly packed. I would definitely see the museum before heading to the Memorial for Peace and Justice as the museum provides the context for the Memorial. It is an easy walk between the two sites.",
  "Do not miss seeing this museum!  Exhibits so well done, different mediums, different ways to engage, incredibly powerful message.  We went Sunday morning at 9am, was perfect - free parking out front, and not too busy the entire time we were there, but it was filling up fast by the time we left.  Visited the Memorial after, also saw the Civil Rights Memorial, stayed overnight.  Drove back to New Orleans via Selma, also amazing to see, and listened to audiobook The Sun Does Shine by Anthony Ray Hinton (an EJI death row client who was exonerated) on the way.  Unforgettable weekend.",
  "The Legacy Museum presents a powerful and sad memorial  honoring the men and women in the South who were llynched out of pure hatred beasue they were Black.  I felt real shame and dispair that people could be so inhuman  to their fellow man...all the while calling themselves Christian."
 ]
},{
 "name": "National Memorial for Peace and Justice",
 "address": "417 Caroline St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/05/0e/23/the-outside.jpg",
 "tags": [
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d13977560-Reviews-National_Memorial_for_Peace_and_Justice-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "The  memorial is striking in many ways: first the topic is just so important and misunderstood among our populace--it's magnitude and how long it went on, into the fifties! Second, the graceful, spare and factual presentation of what happened, when and where and under what circumstances. Third the scale of the memorial--it must be on 5 or ten  acres; fourth, the beauty of the architectural design. This site could be experienced full for any of these reasons. Together they make one of the most important monuments in the country, maybe the world. You should go out of your way (and it IS out of the way!) to see it. It's worth it.",
  "We'd tried several times to visit the National Memorial for Peace and Justice and I'm very glad we kept trying.  It's moving and the number of lynching that took place is astounding. They didn't occur in just in the south or in the early 1900s, but continued into the 40s and 60s and in places like Duluth MN and Omaha NB.\n\nThe site is beautiful and the blooms on the trees and bulbs at the entrance make a nice contrast to the ugliness of the subject matter.  ",
  "Walk through this amazingly well designed tribute to the thousands of African Americans who have been lynched..... Even young children were reverant and respectful during our visit.  Well done!",
  "Take a stroll through this beautifully designed and very moving memorial. The experience will definitely stay with you.",
  "This is a memorial to the over 4,000 African Americans who were lynched over the past two centuries. The lynchings have been well researched and are very individualized with names, counties and dates. \nThe Memorial itself is somber, but also very beautiful. The materials remind of us human bodies with the variety of tone in the rusting shapes. The light comes in and creates shadows and illuminates the hanging blocks. The subject is horrific but the experience of seeing the Memorial is tranquil, reverent and spiritual. \nThere is an engraved statement at the Memorial says it all: \n\"With hope because hopelessness is the enemy of Justice. With Courage because Peace requires Bravery. With Persistence because Justice is a Constant Struggle. With Faith because we shall overcome.\" \nYou should go; it's an important place."
 ]
},{
 "name": "Rosa Parks Library and Museum",
 "address": "251 Montgomery St 251 Montgomery Street, 36104",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/98/36/ec/rosa-parks-library-and.jpg",
 "tags": [
  "historic",
  "unique",
  "learn",
  "parks",
  "parks",
  "tour",
  "parks",
  "tour",
  "history",
  "parks",
  "history",
  "parks",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d259988-Reviews-Rosa_Parks_Library_and_Museum-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very effective presentation of an important historical event. An initial video is followed by a re-enactment of the historic bus ride, the beginning of the modern Civil Rights movement. ",
  "Informative, educational, utilizes multi-media:print, pictures, video, etc. See both the children’s museum with simulated bus ride and historical perspective and the main museum. For all ages. Everything is well done.",
  "A unique presentation of events that make you feel as if you were there. Experience the power of the Montgomery Bus Boycott, how it all began, and just how powerful and courageous on woman's actions were in shaping this community and our nation. Be sure to visit the exhibit hall- current exhibits were very somber and powerful. I would recommend visiting this site on a Saturday to avoid weekday traffic in this capital city. You will find better parking too. This museum is suitable and should be visited by all ages.",
  "The Montgomery bus boycott; the early days of the civil rights movement. And it began when one woman quietly refused to give up her seat on a city bus. The re-creation of that moment is vivid and compelling; you feel yourself going back in time, with Mrs. Parks.\n\nThe exhibits are excellent and include many original documents, such as reports from police informants, newspaper stories, and an extraordinary letter from a young preacher named Martin Luther King. The videotaped interviews with participants and witnesses round out the story. Don't rush through this museum; take the time to learn, to remember, to be inspired, to reflect. ",
  "The museum was really good and very well laid out. We spent around 1 hour here  which felt the right amount of time. There is lots of parking around the area just make sure you have change for the parking meters. The girl who did the introduction was a bit disappointing as she mumbled quite a bit making it difficult to undetstand her, and she was unable to answer a very basic question about Rosa Parks. No photos can be taken once In the museum. Would definitely recommend.",
  "Drove through town and stopped to see this museum, was not disappointed! They have done a great job creating a walk-through experience that takes you into the Rosa Parks story and the Bus Boycott in an immersive manner. It's not a long tour so you don't need a ton of time but it's well worth the time it does take. ",
  "I went here a few days ago as part of a tour. I have to say that this a great tribute to an amazing woman. If you visit Montgomery, you must visit this museum, its great for people of all ages and its not to be missed. Most of us knew about Rosa Parks,but you get to know so much more here.",
  "There are really two sections of the Rosa Parks Museum. One is for adults (or everyone) and one is for children (but adults can enjoy this section too). They are almost next door to one another but they aren't connected. When you purchase tickets you purchase for one or the other or both. I really recommend doing both. \nThe museum has really used multi media and an interactive approach to make the story of Rosa Parks arrest and the history leading up to the Montgomery Bus Boycott come alive. The highlight of the adult section is an actual bus where you observe a re-enactment of the incident that began the boycott. You see where people were seated, what they said and did, how the buses were arranged and what was expected of African Americans. It's an ugly but accurate depiction. The first room, before you enter into the re-enactment room goes over the history and historical figures that led the civil rights movement. You do get to see that Rosa Parks was not just a tired seamstress who one day decided not to give up her seat. You see that she had a long history of activism and leadership in the civil rights movement. In addition you come to understand that the boycott had long been a point of discussion. While the moment itself might not have been fully planned, the leadership was primed to take advantage of Rosa Park's stance and begin the boycott. They had studied and understood that a bus boycott could make a difference and hurt the city economically. \nThe Children's section is both informative and fun. You actually get on a bus that serves as a time machine and takes you back to visit historical figures important to the Civil Rights movement over the past hundred years or more. These figures, like Dred Scott, are introduced and appear as virtual people to present their stories. \nThere are a lot of great museums in Montgomery. We chose this one but missed out on the Civil Rights Museum and the Freedom Fighters Museum --- both of which looked interesting. Especially the Freedom Fighters Museum in the old Greyhound station. \nBut of course we also went to the Legacy Museum and the Peace and Justice Memorial which were superb. I thought the Rosa Parks museum was another great choice.",
  "A wonderful tribute to a wonderful woman. My husband and I were visiting from Arkansas. We had a great time in the city and experiencing the history. ",
  "Give this museum time, the recommended time for the two exhibitions was 1.5 hours, we spent the long in just the Rosa Parks area.  It was so informative and whilst I thought I knew the story I did not know nearly enough, nor did I fully understand the consequences of Rosa’s actions.  A courageous woman, so well portrayed here.",
  "This museum allows visitors to walk through Rosa Park's arrest, leading to the Montgomery Bus Boycotts.  It shines a light on the ugly history of the segregated south and pays homage to the brave people who peacefully worked for justice.  There are many different rooms with wonderful exhibits that give visitors an important historical perspective that isn't found in most textbooks."
 ]
},{
 "name": "Dexter Parsonage Museum - Dr. Martin Luther King home",
 "address": "315 S Jackson St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/de/b9/a7/dexter-parsonage-museum.jpg",
 "tags": [
  "learn",
  "history",
  "tour",
  "tour",
  "history",
  "family",
  "kids",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "family",
  "walk",
  "tour",
  "family",
  "history",
  "family",
  "tour",
  "walk",
  "tour",
  "family",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d291939-Reviews-Dexter_Parsonage_Museum_Dr_Martin_Luther_King_home-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Be prepared for a deeply moving experience. Explained masterfully by Dr. Shirley Cherry, the events of the Civil Rights movement come alive, and most importantly, the people and their bravery and love and devotion become so much more real. A beautiful way to spend an hour or so.",
  "History!  How can words begin to explain what it is like to hear history first hand from people who lived it, remember it clearly, and are alive to tell us about it?  We met people who truly knew what life was like when Dr. Martin Luther King Jr. was alive.  We met a woman who personally heard him preach.  We learned about the still living neighbor who, in warm weather, welcomes you to her front porch only a few houses away from the parsonage.  Dr. Shirley guided us through the parsonage sharing her historical knowledge and personal life stories in each and every room.  From the moment you step onto the porch and read the plaque noting where the bomb landed to the moment you exit the kitchen through the back door of the house you will be filled with awe.  Is this really the dining room table where great minds met to discuss to truths of the day?  Is this really the kitchen table chair where Dr. King prayed and found comfort and courage to continue his message?  Dr. Shirley's desire for us to learn and retain what we learned was evident.  She will ask you to remember three things.  Be prepared for a pop quiz question while standing in the Dr. King's study.  She shared her passion with the two of us as well as four sisters who were celebrating a sisters' weekend trip.  The six of us left Dr. Shirley's guided tour with a wealth of knowledge to share with all who will listen, the determination to share it, and a full understanding of the word \"character.\"",
  "We can only echo the previous posters and add our MOST enthusiastic endorsement of the parsonage visit. We were very fortunate that Dr. Shirley Cherry was available. We wrapped up visits to the Birmingham civil rights institute, the two Selma interpretative centers, the pettus bridge and the civil rights memorial in Montgomery(all must-sees) with the parsonage tour and feel that was the pinnacle of an extraordinary journey through national shame to national pride. \n\nThe parsonage is simple and humble, but it radiates the spirits of Dr. King and his family, and the others who lived, worked and visited there. Shirley illuminates the history, infusing stories of her personal struggles and triumphs. She is simply inspirational. \n\nStanding on the front porch and seeing a crater caused by a bomb thrown at a home containing an infant, seeing the piano played by Coretta Scott King as a release from the stress of her life, sitting at the kitchen table where Dr. King wrote, prayed and ultimately decided to move on with his calling despite the danger to himself and his family....this visit was our last travel stop of 2016, a tumultuous and upsetting year. We left with a sense of hope that new leadership will emerge. ",
  "No matter your background, you need to visit this amazing piece of American history.  So close to the Capitol building and the former Confederate Capitol building, it's very easy to find (plus the large sign in the yard pointing to it).  Street parking all along this area.  Visiting on a weekend is better as there is less traffic/cars.  Close to other vital Civil Rights sites along the Civil Rights Heritage Trail.  Younger kids may not understand and might get antsy.",
  "I had previously visited the parsonage where Dr. Martin Luther King, Jr. and his family lived.  I was delighted to find that Dr. Shirley Cherry was back as Director and able to lead the tour for our group of 35.  We have sometime had other tour leaders who weren't as good.  Dr. Cherry is deeply knowledgeable about the parsonage, its history, its neighborhood, and what it was like for the King family to live there.  She connects with each visitor deeply and engagingly.  Without being \"teachy\" she is a superb educator.  You should allow about an hour for the experience, or a little more time to linger in the gift shop or in the garden.",
  "You must schedule a visit and be inspired by Ms Cherry. She brings the Civil Rights Movement to life. You will feel MLKs spirit come alive. ",
  "Walk through the house where MLK lived while preaching at the Dexter Ave Church during the Montgomery bus boycott. See and touch the scar on the porch from the bomb was thrown at the house. Some of the furniture was actually used by the King family. Guided tour starts with a video. ",
  "My family stopped in Montgomery on our way from Charlotte to NOLA for vacation, we only planned to do a few things in the city and originally this was not one of them.  We decided to stay longer in Montgomery and visit this museum.  You first go to the visitor center and watch a short film, then you are taken by a guide to the parsonage next door.  The history behind this house is amazing and you can feel it while in the house.  Much of the furnishings are original, down to MLK's coffee pot.  If you like history and particularly civil rights history, you need to stop by here!",
  "Arrive on the hour or arrange in advance for a group tour of this important civil rights site.  This is where Dr. King lived from 1954 to 1956 as the pastor of the Dexter Street church, and was the President of the Montgomery Improvement Association, which led the bus boycott after Rosa Parks’ arrest.  The parsonage was bombed and subjected to 40 plus telephone death threats during that time too.  Down the street is the very important Harris house and behind the interpretive center is a thought provoking garden.",
  "If you're my age, this is a nostalgic walk through a house in that familiar 50's decor plus the guided tour we took revealed some facts we didn't know about the MLK family.",
  "I called about a week before our trip to purchase tickets. I tried to use the website but no one contacted me. There are limited tour times and they sell out. Tickets were under $10. \nThe home was easy to find and parking is available behind the interpretive center. \nThe tour begins with a short video (which honestly needs to be updated).\nThen we went next door to the parsonage. We were able to go in every room in the home. Much of the furniture is original. Home has been restored to reflect the 1950s. Our tour guide was pleasant but spoke quickly and wanted to move us along. The tour only lasted 40 minutes. No photos are allowed in the home. Although brief, we still thought it was definitely worth our time. We love historical homes and this one certainly hold many memories. "
 ]
},{
 "name": "Civil Rights Memorial Center",
 "address": "400 Washington Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/03/88/9f/civil-rights-memorial.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d1861816-Reviews-Civil_Rights_Memorial_Center-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "It provides the back-story to many of the names inscribed on the Civil Rights Memorial designed by Maya Lin.  Excellent film presented inside the center museum.\nLocated across the street from the Southern Poverty Law Center building and very close to the MLK's  Dexter Ave Church and other important historical locations.",
  "The stark and powerful fountain and memorial at the SPLC's Civil Rights Memorial Center, designed by Maya Lin (who also designed the Vietnam Memorial in Washington, DC), is well worth a visit. It's open 24 hours, and is lit at night, so you can pay tribute at anytime.\n\nHowever, it's *so well worth* going when the museum inside is open, and paying the $2 admission. For each of the martyrs commemorated on the memorial, there's a powerful story with details on their background, their place in the movement, and how they were killed. Learning that, for example, Michael Schwerner, killed in Mississippi with two of his fellow organizers in the summer of 1964, loved pancakes and syrup makes him all the more human, and his death all the more heart-wrenching.\n\nThe museum also has a short film about some key figures of the civil rights movement, portraits of people recently killed in hate crimes, and an interactive exhibit in which you can add your name to a wall of people committed to fighting for tolerance.\n\nDedicate an hour to explore this museum and go deeper into the lives of people from all walks of life whose lives (and deaths) contributed to making the fight for civil rights what it was.",
  "This place is a chilling memorial to those who lost their lives during the Civil Rights movement, and a vivid reminder of what hatred can turn human beings into. The short movie brought tears to my eyes. This is a must stop in Montgomery for anyone of any race or religion.",
  "So sad to read and hear stories from lives impacted by slavery and oppression. I didn't agree with a lot of the opinions. However, the historically fact-based info was educational. ",
  "The center gives a short sketch about the people whose names are on the memorial. But, it also has info on more recent victims, who are LGBTQ, Muslim, etc. There is a theater with an excellent film. Be sure to add your name to the Wall of Tolerance and mean it.",
  "This does not pack the punch of the Legacy Museum or the Memorial for Peace and Justice, but it is a useful adjunct and I wouldn't skip it. It is well-designed, maybe a little too simplistic, but that can be a relief after the Legacy Museum. The short film is worth watching,",
  "Very worthwhile museum to visit, which provides information on the struggle for civil rights for all, and for counteracting hatred across the globe.  The outside ground of the museum are very beautiful and every installation you see has a meaning.  The initiative is promoted via testimonials, videos, and historical evidence that seeks to reach a consensus for mutual respect and dignity.  The end of the museum is the highlight, where you are presented with the imposing Wall of Tolerance.  This is an actual giant video monitor with names that appear and scroll in different directions.  These names are people who are committed to fighting hatred, and you can enter your name that will appear on the screen as well.  On the side of the wall is the mission that you sign up for.  This is a symbolic yet powerful commitment to fight hatred worldwide.  Excellent museum.",
  "I wish we had more time as we would have surveyed the place even more. We just walked past and took in the quote and reflected on it"
 ]
},{
 "name": "Dexter Avenue King Memorial Baptist Church",
 "address": "454 Dexter Ave Cost Of Admission",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/51/ca/4a/dexter-avenue-king-memorial.jpg",
 "tags": [
  "history",
  "music",
  "family",
  "historic",
  "history",
  "tour",
  "walk",
  "tour",
  "history",
  "knowledgeable",
  "kids",
  "history",
  "tour",
  "history",
  "tour",
  "tour",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105431-Reviews-Dexter_Avenue_King_Memorial_Baptist_Church-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I attended Sunday service at this church with its incredible history.   Wonderful music and celebration.   You are greeted as a member of the family.  Interestingly the service was attended by a large number of us \"white fok\" ",
  "If you are at all interested in Civil Rights history and some of the real hero’s and heroines of our country, you must visit this church and its historic and important location on Dexter Avenue, a couple of blocks from the Alabama State Capital! This area is rich in history that we can never forget. The church has the most engaging, interesting tour guides who talk, recollect, and sing! My tour was so good, I came back the next day for church! What a great experience!",
  "We drove from Memphis, hoping to it would be worth the drive, and we will never forget this wonderful place...\n\nOur luck would have it that we visited on Sunday morning and got to experience the church service. \n\nThe atmosphere of friendship, love and acceptance by the local community and blasting sounds of the most engaging, passionate gospel choir are still vivid in our memories.\n\nAfter visiting the Lorraine Hotel (Civil Rights Museum) in Memphis, followed by Dexter Avenue King Memorial Baptist Church - our trip from Australie was worth every single mile of it. \n\nThank you for your warm hospitality.",
  "A visit here is essential to understanding Southern culture and the Civil Rights movement.  Take time to attend a Sunday service and you'll see the importance of church in the African American community.  To sit in a pew of Dr. King's church, and to envision him delivering a sermon, was a truly moving experience.",
  "Love seeing the dogs in Montgomery, but it was moving to see MLK Jr.'s church, where he preached. Visit it at night and during the day to get both aspects. ",
  "I visited the church on April 6th and we were a little early for the 11am tour. Not sure of where to wait, or buy tickets, we went in the front door--not realizing there is really no foyer and pretty much stepped right into the tour before ours. We stayed in the back as not to disrupt and heard the entire presentation at the mural on that level. Well, the tour moved up into the church and we were invited to join for the last part. After it ended, we went back to the entrance to buy the tickets and see the part we missed. This is absolutely a must stop if you only have a limited time and are at all interested in the Civil Rights movement and the history of that particular church. Our guide was so warm, welcoming, and passionate in her presentation that you almost felt like you just attended service. (And I don't currently practice any particular religion.) The whole tour was just under an hour and about two blocks easy walk from the capitol. ",
  "This is sacred space and those who show you Dr King Jr.'s office and lecturn and the basement and sanctuary know that  and make it all come alive. The short introductory video narrated by Julian Bond is helpful. (Wanda was our loving, enthusiastic, knowledgeable guide and person in charge.)",
  "We walked in the door about 2 min after a tour began. Immediately we were given a giant genuine hug for a welcome. We then went upstairs and had a fun time learning about the history of the chapel and how Dr. King was one of many pastors who have served the church. Highly recommend. Reasonably priced as well! Was around $35 for 3 adults and kids. ",
  "If you are Montgomery to soak up the history of the civil rights movement, you must stop at the church King himself once ministered at.  The ladies who run the tours are themselves worth the visit.  Their exuberance and connection to the site is a joy and they bring the hisotry to life.",
  "Wanda was our tour guide. She was very welcoming.\nThank you to her team for making our visit so enjoyable.",
  "The church runs organized tours about every hour. The tour guide knows and loves the church. It is amazing to sit in the pews and imagine MLK preaching from the pulpit."
 ]
},{
 "name": "First White House of the Confederacy",
 "address": "644 Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/20/23/6a/photo9jpg.jpg",
 "tags": [
  "tour",
  "walking",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "free",
  "tour",
  "history",
  "free",
  "family",
  "history",
  "free",
  "walk",
  "learn",
  "history",
  "history",
  "tour",
  "history",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105428-Reviews-First_White_House_of_the_Confederacy-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "A simply amazing storehouse of historical artifacts about Jefferson Davis, and Bob, the new museum curator, is like a walking encyclopedia and an amazing man to listen to. This was our second visit to the place and it was better than the first. There's no charge to tour and like stepping back in history.  The new carpet from England is incredible.",
  "Beautifully preserved 19th century home that served as the residence and office of Jefferson Davis during the early days of the Civil War.  We tagged onto a small group of high-school students getting a tour and were glad we did.  The tour guide was excellent and very knowledgeable about the house and Civil War history.  It doesn't take much time to tour - even with a guide - maybe 1 hour.  \n\nCombine it with the excellent Alabama Department of Archives and History next door.  Our guide says there is free parking behind the Archives building but we parked on the street and fed the meter.",
  "Nice stop; greeted warmly upon entering and even offered refreshments on our FREE tour!  The self-guided tour is a little dull as it mostly mentions period pieces and who they were donated from for inclusion in the Museum - wish there was more history about Mr. Davis and his family.  But a wonderful re-creation of his home of 4 months with some beautiful furnishings and memorabilia in the \"relic room.\" (Although it is upsetting to see such bright lights and no UV protection on such rare relics!)  The staff was friendly and informative and knew the answers to all our questions; the gift shop was a cute unexpected treat, and we were even allowed to use restrooms at the facility before departing on a long road trip (not sure if they are supposed to be reserved for staff only).  Overall glad that we stopped in for a piece of southern history that often seems a little overlooked.  Montgomery was a great place to see the road all the way from the Civil War to the Civil Rights movement and how it changed our country!",
  "I had no idea this place existed but am glad it does.  Anywhere else you would pay a premium to visit a site like this but this one is unbelievably free.  Plenty of artifacts especially on the second floor and a great gift shop on the first.  It is self guided but there is a book that explains everything and you can buy a copy of it to take home if so inclined.  Pictures welcomed so click away.  Right next to the history museum and across from the Capitol building.  Parking available in the lot behind the history museum across the street from it.",
  "Across the road from the Alabama State Capitol building. This place is closed on Sundays but you can walk round the grounds. ",
  "Almost surreal to find this place within three blocks of the Civil Rights Memorial Center and the Dexter Avenue Baptist Church where MLK was pastor.  That's the interesting thing about Montgomery though - so many layers of history overlap.  This site is well-maintained with many period artifacts, and the staff is welcoming and informative.  Don't expect to hear much about the Civil War, although you'll learn a lot about the War Between the States, and the War of Northern Aggression.  And don't be surprised to find an African American woman behind the counter of the gift shop.  Lots to think about here, and some perspective to be gained.",
  "This memorial and museum sheds a great deal of light on the history and issues associated with slavery.  Definitely worth a visit.",
  "This was an absolute gem.  We were met by a very friendly guy from New York.  He sang to us and it was so good to be greeted like this.  He gave us plenty of information.  The house itself was beautifully set out and well kept with an informative self tour pack.  Definitely recommend.",
  "Spend time listening to one of the curators to get the back story of this authentic and important piece of Southern history.  Well worth a stop!",
  "Being a nonwhite Hispanic from New York, I visited the First White House of the Confederacy with some trepidation. With that in mind, I found this place to be a fine combination of political and historical home period history through its guidebook--even the Bible on display has a story behind it, and even an old article that nods at how little is publicly known about the home's historical occupant. And unlike most historical homes, this one has a gift shop full of books and souvenirs. It is a diverse selection with something you might like. What confederate perspective things there were in stock were unsettling, but tasteful enough. By all means hesitate, but go anyway.",
  "I thoroughly enjoyed taking to the staff especially Robert W (sorry, my memory is bad and don't want to misspell his last name). He was extremely friendly, extremely engaging and willing to share stories which made the history fun to consume. I would truly recommend it as Pres J Davies of the Confederates is at times a misunderstood character in history and by visiting this home, perception can be better addressed"
 ]
},{
 "name": "Montgomery Zoo",
 "address": "2301 Coliseum Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/64/bc/63/the-elepants.jpg",
 "tags": [
  "family",
  "kids",
  "family",
  "walk",
  "family",
  "kids",
  "walk",
  "walking",
  "family",
  "kids",
  "eat",
  "walking",
  "walk",
  "walk",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d207614-Reviews-Montgomery_Zoo-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "We came on a family outing and had a great time!  This Zoo is just the right size and has something for all ages.  Our two girls are 21 months and 7 years.  They enjoyed all the animals, especially the petting zoo.  They also loved the playground.  My 7 year old enjoyed feeding the giraffes.  Overall, an enjoyable trip!  So glad we came!",
  "had a blast. lots of interaction with the animals and the sky lift is great\nlove the otters and the Alligators ",
  "What a surprise!  Took the entire family son, spouse, 3 grandchildren and us; got a military discount which was great.  The zoo was clean, animals were well taken care of and a perfect day for the family.  Noticed that you can bring a picnic lunch if you wish which would save $$$$ also an added bonus.  Small train to ride which is an additional $5.00, for a 10 min ride, kids love it so a must, didn't do sky lift as we had visions of my grandson jumping from chair.  Parakeet cage was a hit for our 5 and 7 yr old....a great 4-5 hr day for the price!!!",
  "Don't let the size of Montgomery fool you. The Montgomery Zoo is a great experience. It has most of your traditional African animals. It's a great family activity in Montgomery. Take 3-4 hours to walk around and experience all the habitats including reptiles. There is a small train ride through the entire park and an overhead chair lift (don't wear sandals). The zoo has a well stocked gift shop and a cafe to pick up a quick lunch or snack. Don't miss the Mann wildlife exhibit attached to the Zoo. The Mann museum has a lot of taxidermy from North America. Look for specials on tickets and big events like Zoo Boo at Halloween or Zoofest in the Spring.",
  "My 5 year old and 3 year old loved this zoo. There was an educational piece at 1:30 about the lions that my 5 year old loved and my 3 year old loved the elephants and ant eater. This would be a great place to take a Girl Scout troop or something similar because of the educational aspect of it. There were several exhibits, a great playground on the grounds near the Tigers, and the train for smaller kids ( but didn't really go near anything), and the sky tram that allowed us to see pretty much the whole zoo. Great time. Tips: pack a lunch. Bring water in the winter months because the water fountains were off. ",
  "My husband and I used to go to this zoo all the time but it has been several years ago. We were pleasantly surprised to see all of the updates to the park. The first sign you see is a poor representation of the park, it must be a fifty year old sign that just looks pitiful. So don't turn back when you see it! \nAdmission is reasonably priced $12 for adults and discounts for children/military of which we had neither. There are add ons you can purchase such as horse back rides, a sky lift, and giraffe encounter. You can purchase tickets for these at the window or throughout the park. You will need exact change if you purchase tickets in the park so get some ones. \n\nThe first thing we did was get on the sky lift, a recently added ski lift that takes you over the majority of the park. It costs $4 (may just be adult price?) which could get pricey for a large family but I think its well worth it. There is a rider minimum height of 42\". We really enjoyed this part. You get to fly over and feel like you are *in* the enclosures with the animals. Plus we saw some behind the scenes work as workers built new shelters with a curious giraffe looking over their shoulder and others feeding/taking care of animals. Plus you see some animals that are lazing around in corners unseen when you are on foot. \n\nWhen walking around the park it is very shady in many areas so you can escape the warm Southern sun for a bit. *note-there are no rain checks so be sure you have enough time to see everything before it rains. \n\nThey have also added a very large park for the kids to run off some steam and parents to sit back and relax a bit. As a special education teacher and special needs baseball coach, I was really pleased to see their very well equipped special needs playground. Way to go Montgomery! I also thought about my kids on the sky lift, this would be a great adventure for those who are non-ambulatory but able to sit up.  \n\nThere are some signs and exhibits could use some updating but with the addition of so many interesting things to do this is really minor. \n\nThere are several places to bring a lunch and eat at as well as a small restaraunt with normal park food-burgers, hot dogs, etc. We had nachos and drinks. You can get a refillable souvenirs cup. Refills are $1 but you have to go back to the restaraunt to get them refilled unless the kiosks around the park are open, which they weren't when we went (on a Sunday in April). \n\nThere were only a couple of exhibits where we didn't get to see an animal. Most were up walking around, playing, or lazily sleeping in the distance. I am not usually attracted to see birds but their many bird enclosures, including a walk in aviary, were really interesting. I used to live in Panama so I was able to see many I used to see while living there and many I have never seen before. \n\nI think the best $2 I have ever spent was the giraffe encounter. You get a cup full of alfalfa hay and walk out on a bridge to feed the awaiting giraffes. They know what's about to happen when you begin to pay the lady and will begin making their way over, patiently waiting for you to hurry up and finish paying and getting your camera out. Then its no holds bar when you are on deck...they want their hay! Very gentle though. Have your camera ready to take a picture when the kids first see that long tongue!\nBring quarters, their are machines on the bridge and around the park to feed treats to the giraffes and other animals. \n\nThe staff were all friendly and helpful. I could tell they have a bond with the animals. Even when busily going from one place to another, I saw workers stop and say hello to a tiger or bear.\n\nWe had a great time at the zoo and will definently be back to see some of what we didn't have time to do. You could easily spend a day here but we only had a couple of hours. Even though the \"extras\" may add up for a large family, I think it would be well worth it for the memories and experience. My husband and I enjoyed hearing the reactions of the children around the zoo as they saw animals up close, \"flew\" on the sky lift, ride the train, and pet a giraffe on the head.",
  "We've been to much larger zoos, but this one is very clean, well laid out.  Was surprised at just how many animals we saw.  Mid-week in Feb. had very few visitors.  Nice gift shop also. ",
  "I came for a Zoo conference and had a very good time visiting the Zoo. The layout is great and there are several ways to see the Zoo There is a sky ride that takes you over some of the exhibits, a train that takes you around the Zoo and spacious walking paths. They have a well rounded collection of animals and birds many cohabitant as they would in the wild.. ",
  "Great time and very clean. The lay out is not confusing and the Walk way are nice and clean. Price is very reasonable. Staff is friendly the cafe is really expensive",
  "You cannot go wrong with a visit to the Montgomery Zoo. It is wonderful and clean. The exhibits are well taken care of. The associates are top notch. This is very family friendly, and an easy walk. The little train is fabulous, Montgomery should be very proud of this attraction.",
  "Had a great time visiting Montgomery zoo.       Great exhibit space and very well laid out.      Animals all looked very well cared for and all staff showed a lot of knowledge.         Looking forward to coming back and spending more time.  "
 ]
},{
 "name": "Hank Williams Memorial - Oakwood Annex Cemetery",
 "address": "Upper Wetumpka Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/cb/19/f1/resized-20180429-102704.jpg",
 "tags": [
  "music",
  "music",
  "music",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105433-Reviews-Hank_Williams_Memorial_Oakwood_Annex_Cemetery-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "I took a detour from my trip to Savannah to visit Montgomery, specifically Hank Williams Sr's resting place.  This was well worth the trip!  I am too young to remember this man, but I have heard his music.  This was so a breathtaking place.  Finding the memorial in a very quaint cemetary was a little unexpected, but so worth my trip!",
  "This is a beautiful tribute to a legend gone too soon and his wife.  I kept thinking of the song by Alan Jackson 'Midnight in Montgomery' standing there.  Its definitely worth a visit. ",
  "Whether you like country music or not, Hank Williams was a true American original.  Take a few moments from your trip and stop by this cemetery to pay tribute.  It's not far from I-85 and, hey, you need a break anyway.\n\nIt's well-maintained, and if you're extremely lucky you might meet a local who can give you the scoop.  I met a guy who voluntarily and regularly tidies up the grave and makes it look brand new.  He can tell you about the nearby graves, and what the other families think  about all the attention.  (They don't much like it.)  He can tell you why they have astro turf instead of real grass.  (Fans kept stealing the real grass.)  Has he ever seen Hank Williams, Jr?  Yes, and he was a nice guy.  But that's a rare thing indeed.\n\nIt's sufficient to just visit and think about this guy's music.  Remember that he was only 29 when he died, and already a legend.  And don't forget his wife, laying right beside him, who was  country artist too.  And his mom lies on the other side of Hank.\n\nA few miles away, if you have more time, check out the Hank Williams Museum.  Heck, as of this writing, I have seen it yet either.",
  "I took a detour from my trip to Savannah to visit Montgomery, specifically Hank Williams Sr's resting place.  This was well worth the trip!  I am too young to remember this man, but I have heard his music.  This was so a breathtaking place.  Finding the memorial in a very quaint cemetary was a little unexpected, but so worth my trip!",
  "A great deal of history within the grounds of this cemetery; there used to be a tour given by a local historian around the grounds.  She was extremely knowledgable and I believe was also a retired history teacher.",
  "By all means give your respects to Hank. The cemetery it's self is quite lovely. Keep in mind the narrow roads, and make sure to visit the other  part of this cemetary.",
  "It is a beautiful place.  Very well kept.  Beautiful views.  Well marked and easy to find. Worth the trip.",
  "The graveyard itself is a bit shabby as you drive in but Hanks area is spotless and a very fitting resting place. Look for the stone marker on the road and drive in up over the hill"
 ]
},{
 "name": "Alabama Department of Archives and History",
 "address": "624 Washington Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/61/e6/fc/the-front-of-the-archives.jpg",
 "tags": [
  "cheap",
  "family",
  "free",
  "unique",
  "kids",
  "learn",
  "art",
  "history",
  "sightseeing",
  "learn",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d274187-Reviews-Alabama_Department_of_Archives_and_History-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Having played in many concerts in the front of the ARCHIVES  I can say I really appreciate  this grand building.  I took California guests there and they were enthralled with the third floor particularly .It begins with the Giant  wooly Mammouth and moves thru then eons of time  to modern times..it will hold your interest as it has the latest technology displays and objects...The 3rd floor was designed in cooperation with the Smithsonian in Washington D.C. You can expect excellence and a good use of your travel time.",
  "Looking for a free or cheap attraction to visit and spend our morning before we headed home and make the most of our trip to town and over night stay for a concert.  The gift shop has some great Alabama themed unique items and they are helpful to give you a map at the desk on the first floor and answer any questions - An Elevator makes it easy to go up to the other floors but the grand stair cases give access too.  - The walls on the second floor carry photos and art work to view and the temporary exhibit I think in the lobby there was Creek Indians and very beautiful to catch your eye - there are smaller rooms, a Grandma's Attic for kids to do a hands on lesson and is filled with rotary phone booths, school desks, every possible item and clothing apparel that Grandma or another relative from years past might have - little hands on items, pictures of the real things in use and info are scattered all over the room - it is a family room for adults to share their experience and knowledge to the children not a place to leave the children to play - some sections have tubs labeled about what long ago treasures you will find to try out or learn about hands on - Other projects can be found completed or inviting you to add to - This might be best left to the last stop - as we did because getting children or wanting to leave your self after seeing those things you once knew can be hard - Actually for locals or those just wanting to get the kids out of the hotel or to spend some time while others are busy or you are waiting for another event - this room alone would be worth the visit - there is limited but free parking behind the building on Adam's across that street and also street parking in the area.  There is a room that shows many different weapons and items and medals that were part of the military thru the years.  A room that shows the natural wonders of the state and the different regions and what can be found there thru out the state and a short film explaining each as well as photos and touchable natural resources found there  - seeing the section of a tree trunk and seeing the time periods it lived thru is impressive.  At the end of the hall is an exhibition that starts with The Voice of Alabama - shows faces of well known people from the state as well as the other kinds of individuals that make up the state thru the years.  It keeps wandering and winding reveling new information and parts of the state's history in short interesting forms of facts and displays.  It starts with the first to live in the state the Native Indians.  It shows the important part farm life to the state and it's people. Thru some slavery, and the beginning of the Civil War and the different parts and statements the state made - it's parts in other wars or the effect they had on the state.  It shows the life styles and items used or worn, it shows the mining and iron & steel industries and their roles in how the life changed in the state.  It shows many of the accomplishments and inventions that started in Alabama that are used and reached around the world and the stars that have risen from our state.  You can take as much time or as little as you want to.  Enough details to explain and interest the older and enough displays to hold the attention of younger people.  It is all free and the truth is better than any movie - interesting to see the progress and growth of the state.    ",
  "We visited on a rainy sightseeing day and were glad we did. From the formation of the land to present day Alabama, it is all under one roof.\nThis is the best \"little\" museum we had ever seen.  The exhibits, movies, the artifacts and chronology - are interesting and memorable. Alabama through the ages in three hours. You can fully enjoy it in less time or more. \n",
  "We were delighted with this museum, it gave us information and plenty of things to think about and discuss.  Well set out, informative and easy to look at, at our pace.  Would recommend for teens upwards, some of the younger children in here were bored.",
  "Having played in many concerts in the front of the ARCHIVES  I can say I really appreciate  this grand building.  I took California guests there and they were enthralled with the third floor particularly .It begins with the Giant  wooly Mammouth and moves thru then eons of time  to modern times..it will hold your interest as it has the latest technology displays and objects...The 3rd floor was designed in cooperation with the Smithsonian in Washington D.C. You can expect excellence and a good use of your travel time.",
  "The museum is a nice mix between what you probably already know, and a marvelous display of what you probably don't. You'll know some of the famous faces and names on display, but features on the state's founders, portraits of unknown people, and exhibits on location, topography, and Native American history can define the heart of what you learn. A must visit for history and museum buffs.",
  "By the time I'm actually writing this, the incredible display, in one place, of all six of Alabama's state constitutions are probably tucked safely away.  We were very lucky to see this rare and special exhibit.  Not to worry, the rest of the museum is very interesting and well presented.",
  "Driving through Montgomery one day we only had time to visit three or four places. One of the ones we chose was this museum and it turned out to be a great choice. It was a wonderful history of Alabama, both the land and the people. And you can’t beat the price, they don’t charge anything. Absolutely a must see."
 ]
},{
 "name": "Montgomery Museum of Fine Arts",
 "address": "1 Museum Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/48/19/30/montgomery-museum-of.jpg",
 "tags": [
  "art",
  "unique",
  "walk",
  "art",
  "art",
  "free",
  "free",
  "walk",
  "walking",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d274188-Reviews-Montgomery_Museum_of_Fine_Arts-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Really a nice museum with an impressive and varied collection! We came to see the Gee’s Bend quilts. We left after seeing some wonderful blown glass, TH Benton, Frank Stella, Deborah Butterfield, Hopper, Rembrandt and on and on and on. What a treat! What’s more, there’s no admission fee. ",
  "In town for funeral and had the morning to see some sights.  Walked around the Cultural Park to get exercise and went in to the museum which has many different types of art, cool children's area and sculpture garden.",
  "I have visited the Montgomery Museum of Fine Arts many times over the years... First, as a fun, mother-daughter outing when my daughter was in elementary school, and numerous times in the years since, including a recent mother-daughter outing while my daughter was home from college!  The Artworks section is a great interactive area for children. (Adults shouldn't miss it either!)  We love the permanent exhibits and the way they are displayed, and there's always something new with the rotating exhibits.  It is a beautiful venue as well.  There is a small, but nice cafe.  I particularly like the museum gift shop as a source for art-inspired gifts for visiting out-of-town guests, or unique Christmas gifts.  There is no admission fee required, but it's always nice to leave a donation in the box at the entry.  So glad to have such a quality museum so nearby!",
  "Really a nice museum with an impressive and varied collection! We came to see the Gee’s Bend quilts. We left after seeing some wonderful blown glass, TH Benton, Frank Stella, Deborah Butterfield, Hopper, Rembrandt and on and on and on. What a treat! What’s more, there’s no admission fee. ",
  "Beautiful place to walk your dogs or feed the ducks. Plenty of trails along a beautiful scenic landscape. Great exhibits inside including African sculpture art.",
  "This beautiful museum has a gorgeous setting, surrounded by interesting sculptures, a primo cafe, and a good to excellent collection, very nicely presented.  I thought it was worth the visit just to see their superb Hopper, Sargent, Copley and Cassat, to name a few of the admirable works on display.  This is also a great place to bring children with an interest in art as there are several child oriented options, which are also fun for adults.  Admission is free. ",
  "This is an average museum thats free\nNot much to see but did have some nice paintings that had interesting discriptions",
  "We went today and had a good time in the kid area and spent a little bit of time walking through the galleries.\n\nThe kid area has a heat or motion video camera (Picture) very cool, plus puppet and reading  section and a place to draw on computers or by hand. \n\nAlthough we were trying to beat the heat we did go to the outdoor sculpture garden and it was so quiet and peaceful to walk around. \n\nSmall but great and it’s free!!!!"
 ]
},{
 "name": "Alabama Shakespeare Festival",
 "address": "1 Festival Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/98/79/e6/alabama-shakespeare-festival.jpg",
 "tags": [
  "family",
  "theatre",
  "walking",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d2101996-Reviews-Alabama_Shakespeare_Festival-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "A great place to take walks with the  Family on the Weekend. Especially great when there is a great play",
  "If you love the theatre, then you will love this place.  All of the shows I’ve ever seen (well over 25) have been expertly done.  They bring in professional actors as well as mixing in some local talent and they do an excellent job of doing that.  Seating is well laid out and the acoustics are good.   Go see a show, you will enjoy it !",
  "The park is a large open area with plenty of space for picnics or just flying a kite. The walking trails are perfect for some quiet time with a loved one or enough space to let the little one down to run out all of their extra energy. Plus the ability to see a play in the theater or time in the museum. ",
  "A party is a party but the play - I have to give it 11 out of 10 stars. You read that correctly, 11/10. The play, Alabama Story, is about a state librarian in the 1959 era in Montgomery, AL. The story line (based on actual events and people with some literary license) revolves around a children's book in which a white rabbit marries a black rabbit. Many in the state took this to be an affront to the efforts to maintain segregation.  I cannot say enough about the play - the actors were fantastic and they were only superseded by the story line.",
  "Pick your show and go enjoy! Offers a great variation of entertainment. Looking forward to returning soon.",
  "We have been to many plays at this theater and they have been awesome and professional. We recently saw Pipeline and although the actors were dedicated this is by far the most vulgar and disgusting play we’ve ever attended. There is so much use of vulgar language that it takes away from the play.  I found the actors saying f*ck, Gdamm, and sh*t 500 hundred plus times in a play is unnecessary and offensive. It stereotypes that people of color or teachers talk like that in their professional capabilities. The people that I know do not talk like this.  Notwithstanding minors were not recommended but allowed in the play.  No where in the advertisement did it show that it would be a very vulgar language play.",
  "The theater is nice, of course, but the grounds are equally worth visiting. Stroll around, and enjoy something you wouldn’t expect to see in Montgomery. Well worth the detour.",
  "Great time spent with Family - great acoustics and vibe. Saw a play however I am looking forward to Mac McAnally and John Paul White on the 27!"
 ]
},{
 "name": "Alabama State Capitol",
 "address": "600 Dexter Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/b6/9a/d9/state-capitol-alabama.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "free",
  "family",
  "historic",
  "history",
  "history",
  "unique",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105427-Reviews-Alabama_State_Capitol-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "You can take a guided tour or self tour.  You find a number of state offices for high ranking officials that appear as they did in the 1800s and early 1900s which is seeing history live.  Such as the impressive stairwell build by a freed slave, the old Supreme Chambers, The Secretary of State's office, the old Senate Chambers, the House Chambers.  In addition 150 to 100 year old paintings.  ",
  "The Alabama State Capital is a Beautiful building and well worth the time to tour it! Wen there a few weeks ago and it was awesome. The wood and marble have look as if they were brand new and of course they are over 150 years old. If you appreciate history and architecture, you will really enjoy your time there.",
  "We first obtained free parking passes for spaces just at the foot of the Capitol from Montgomery Information Center in the train station. We had the number one spot. Free for the day!\n\nWe were greeted at the Capitol door by a friendly lady who turned out to be from our area of the South and a genealogist who later helped us research a possible family connection. \n\nThe Capitol is gorgeous inside and out. It is in pristine condition. The architecture  amazing. The exhibits and portraits as well as beautiful dome murals told the story of Alabama. \n\nThe employees we encountered on our self guided tour were so friendly and nice.\n\nThe visit across from the Capitol to the Alabama Archives World War 1\nand History of Alabama exhibits was excellent. Again, we were welcomed by such a friendly helpful lady at the admissions. \n\nAlabama has its best foot forward!",
  "I've been to lots of state capitols and this one really doesn't rank up there.  It's meh on the inside and the outside.  There aren't any historic exhibits to speak of though there are signs outside some of the rooms explaining their historical context.  The dome is ok and the artwork inside is not very good compared to other states.  Honestly, the amount to see and the quality of what you're seeing isn't worth the stop.",
  "The dome is absolutely beautiful inside. If you can't see the stained glass at the top, try zooming with your camera. This is no longer where the legislature meets, but the old chambers are still interesting  in decor. I found it amazing that there were areas marked on the map and described, such as the two old Governor's Suites, but also noted as \"not accessible\". Why?\nIf you are into Southern history, there is plenty of it here. The aforementioned dome also has murals of Alabama history below it, but some of the \"titles\" below them leave something to be desired in their treatment of non-whites. \nOutside, there is the Avenue of Flags of the states, with plaques below them made from stone from the particular state with the name engraved in it. Hawaii seems to be lava rock, for example. The Goat Hill Museum on the lowest level of the building is quite good and offers items from around the state.",
  "We were fortunate to have Dr. Aroine Irby guide us through the history and architecture of this beautiful capital.  Dr. Irby pointed out various, unique physical features of the building itself and talked to us about the history of several famous Alabama governors and Jefferson Davis’ inaugural. \n\nHighly recommended...",
  "Maybe we're becoming State Capitol snobs but we were a bit disappointed that such a handsome building was not more celebrated or decorated.  We took the self-guided tour as no tour guide was available  - perhaps a guided tour would have provided more color and context.  At least there was plenty of street parking and we were in and out in a fairly short time, giving us more time to visit the State Archives.",
  "This is the Capitol building where the 1965 Selma to Montgomery March ended, with State troopers barring the door and Governor Wallace refusing to appear or accept the marcher’s petition.  On its front step Jefferson Davis took the oath of office as President of the Confederacy.   His body lay in state in the old Supreme Court chamber.  The beautifully maintained interior reflects that legacy, including huge flattering portraits of Wallace and his wife, a capital rotunda lined with paintings celebrating a white-oriented view of Alabam history, and marble plaques commemorating secession and Davis’ ascension.  You will find Confederate flags and hats and a celebration of Alabama cotton in the gift shop.  Very very interesting.  "
 ]
},{
 "name": "Hank Williams Museum",
 "address": "118 Commerce St Downtown Entertainment District",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/6b/48/56/hank-williams-1952-baby.jpg",
 "tags": [
  "history",
  "family",
  "music",
  "music",
  "learn",
  "art",
  "music",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105435-Reviews-Hank_Williams_Museum-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Don't let the negative reviews fool you - this place is run by some of the sweetest, most helpful people you'll ever meet.  The $10 entrance fee is well-worth the amazing collection of memorabilia, photos, and records you'll get to enjoy (personally, I think $10 is a steal for what you get - this place is spotlessly clean, maintained beautifully, and filled with more info than you can ever imagine).  My two-year-old son LOVED getting to put a quarter into the Wurlitzer and play his favorite song!  The gift shop has an excellent selection of items and is very reasonably-priced - we got a vintage record for just $10!  I am so thrilled to have marked this gem off my bucket list, and I hope I'm in Montgomery again soon for another visit here! ",
  "This is a must do for you, if you visit Montgomery, AL.We visited Hank Williams grave first and then went to the Museum, which is located downtown at 118 Commerce Street. There is lots of history and memorabilia in the Museum to see and tells a real story about his life and history and family! It also has his Blue Cadillac in there that he passed away in. I would highly recommend it. The Website is thehankwilliamsmuseum.net",
  "I went to visit the Hank Williams I visited the Museum while in Montgomery Alabama to attend another event because I was raised on country music, and Hank Sr.'s songs were some of the first I'd ever heard.  One of my earliest memories is sitting on the floor at my dad's feet while he played his guitar and sang to whichever of the 6 of us were there and Hank Williams' songs were always on the set list. I entered the museum intending to only stay a short while; but after I paid the very reasonable cover fee and walked into to the exhibits section, the first song they played was the one my dad always played for me, \"I'm So Lonesome I Could Cry\". I paused but continued on, remembering. The next song that played was one I always asked for, \"The Lost Highway\". That's when the tears came. I spent nearly 2 hours there, and it was worth every second. There are exhibits from every aspect of Hank's life, career and death, a wealth of items donated and on loan from fans who knew how much they would mean to others and shared them with us thru the museum. Standing and looking at a wardrobe from his home before he moved on to make his indelible mark on music, the embroidered suits that I remember from the record sleeve photos, or the hand-written lyrics to all those songs that are part of the warp and woof of my childhood was awesome. But what raised the goosebumps was standing next to the actual blue Cadillac where he took his \"Last Ride\" and listening to my dad's voice tell us about it, hearing it clearly even tho I wasn't 2 years old at the time! If you're a Hank Williams fan with a connection to him like mine, or just learning to appreciate the classic country music of Hank and his contemporaries, the Museum is the place to do it.",
  "This is a funny, small museum packed with Hank Williams memorabilia. There isn't a really coherent story laid out, so if you don't already know much about Hank Williams you wouldn't come away with a clear picture. The museum definitely has a home-made, home-grown feeling to it -- which I find charming. I thought the museum was way over priced -- especially since the Legacy Museum right up the street -- which is a superb and comprehensive museum --  is only $5. The Hank Williams museum is $20/pp and most people will only spend a half hour here. I wished there was more opportunity to hear his music; there is only one TV set that plays an old show with Hank Williams. The space is filled with manaquins with his clothing, old record covers, and tons of promotional posters and photos. I love his music but this museum didn't communicate much to me.",
  "This Memorial to Mr. and Mrs. Williams is absolutely wonderful.  I'm not really a fan but it was still really nice to see.",
  "Collection of records, belongings, stage costumes, instruments, letters, photos, and other artifacts as well as replicas and fan art - if you want to learn about the life of this son of Alabama and listen to his Pulitzer-Prize-winning collection of songs, spend an hour here. They do offer $1 off for AAA.",
  "This museum is downtown Montgomery and nearby is a statue of Hank Williams Sr and his guitar.  The staff was welcoming and helpful. The museum itself was full if many artifacts including the car he last ride in. The museum has a nice gift store. Its a very small place but if you are a country music fan I think this place is a must visit. I enjoyed my time there and my boyfriend did too. ",
  "After having lunch at a restaurant in the alley, my son and I were walking by and decided to look inside.  I am so glad we did, and now realize how many great old songs that everyone knows are Hank Williams songs.  What an amazing legacy by someone who passed at such a young age.  So many pics, videos, other artifacts, and of course, that gorgeous car.  You can look at the gift shop items without paying to go into the museum part, but I am glad we went in."
 ]
},{
 "name": "The F. Scott and Zelda Fitzgerald Museum",
 "address": "919 Felder Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/5f/d8/9f/the-fitzgerald-museum.jpg",
 "tags": [
  "history",
  "knowledgeable",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105436-Reviews-The_F_Scott_and_Zelda_Fitzgerald_Museum-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Filled with photographs, handwritten notes, and all sorts of personal items from the time the couple lived in the home. Located in a beautiful neighborhood, rich with historical significance.  The ladies who manage the property are very knowledgeable about the history of the area and the Fitzgerald’s lives and contributions.  Wonderful preservation of their legacy. Highly recommend a visit for a chance to step back in time. Next time I will stay on the property in one of the lovely Airbnb’s.",
  "Years of reading about Scott and Zelda brought me here.  The museum displays love letters, photos, artifacts, and also has a great display of Zelda's artwork.  Any fan of the Jazz Age and of the Fitzgerald's should make the stop!",
  "Even if American literature makes you yawn, you'll enjoy a visit to the Scott and Zelda Fitzgerald Museum. The docents are fun and engaging and their ability to make history come alive for their audiences is amazing. This is a must-see for those visiting Montgomery!",
  "Being from the Atlanta metro area, this was a really fun day trip for us.  We are Fitzgerald fans and have been fortunate enough to visit multiple Fitzgerald sites in France, but this site was a welcomed change of pace.  A lot of primary source written documents, especially from Zelda.  It's a fun day away for the american literature lover in all of us.",
  "We stayed in the apartment above the museum. Very cool experience. The apartment is furnished in the style of the year the Fitzgerald's lived in the house. There are letters above the bed that Zelda and F Scott wrote to each other. It is a small museum, but it has many things from the Great Gatsby movies and other personal effects. Very knowledgeable staff. Great way to start off the day. If you get an opportunity to stay in the apartment, you will not be disappointed.",
  "I really enjoyed this museum and that it was opened on Sunday considering most of museums and activities are closed. \n\n",
  "This is a very small museum, consisting of collectibles in a space the Fitzgeralds lived in for about a year and a half.  But what is here is choice. A must for Fitzgerald or Zelda fans.  ",
  "Outdoor party here, under some white lights. Large lawn, which allows for games and comfortable seating. Inside, some nice memorabilia and artwork. \n"
 ]
},{
 "name": "Old Alabama Town",
 "address": "301 Columbus St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/8d/5f/d1/old-alabama-town.jpg",
 "tags": [
  "field",
  "free",
  "kids",
  "tour",
  "history",
  "tour",
  "family",
  "walk",
  "tour",
  "walking",
  "walk",
  "tour",
  "walking",
  "free",
  "knowledgeable",
  "kids",
  "food",
  "tour",
  "historic",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105432-Reviews-Old_Alabama_Town-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Old Alabama Town is a great place to see history through buildings that have been relocated and preserved.  We have been in the past on field trips with our kids.  Today was a second Saturday free admission with a blacksmith working. The tour is self-guided and self-paced.  They have laminated guides that describe each of the buildings.  They have everything from work buildings (blacksmith, pottery, cotton gin, etc), school house, church, grocery, tavern, and homes.  It is definitely worth a visit!",
  "There are 2 sections, one a residential area and one a working area.  We got a tour of the family house which was one of the first in the neighborhood. The house has been restored but there are plenty of original pieces of furniture.  Our guide took us throughout the house and the outbuildings where the kitchens, slave quarters, \"necessary rooms\" and stables were.  A block away was the original tavern house where Lafayette stayed.  Several blocks from this was a working area with a blacksmith. milliner and dressmaker, print shop, drug store and cotton gin.  There were volunteers working in some shops to give school groups an idea of how life was in the 1800s.  The organization owns several blocks of homes that it rents to offices and other organizations and some have been restored to their former beauty.  You can spend a whole day looking at the archetecture",
  "This was a very nice tour we enjoyed seeing and reading all about the early settler days.  Be sure to wear comfortable walking shoes, it's a few blocks to the first cabin.  It's a very enjoyable walk though, all the homes are historical homes made into offices.  This is a self guided tour.",
  "This attraction is about a mile from downtown Montgomery.  There are plenty of places to park for free.  There are old homes and businesses that were moved here from other locations and preserved so you can walk through the streets to take in an Old Alabama Town, and view how life was in the 1800's.  This is great for both young and old to visit.  There is a one room school house, church, doctor's office, millinery, general store, and much more to see.  Our tour started at the summer home of a wealthy person which was there originally.  I liked the replica of the Cotton Gin, it's too bad it's not a working Cotton Gin, but you understand how cotton was produced after it was grown and picked.  Hint: wear walking shoes and dress according to weather conditions.",
  "Old Alabama Town is section of Montgomery that has been historically preserved.  Part of the tour is self-guided, which is nice, so  you can go at your own pace.  There is a house tour --- you can go inside the three-story historic Ordeman Townhouse with a tour guide.  Our tour guide was so knowledgeable, interesting and fun (wish I could remember her name!).  There is an admission fee for the tours and there are also AAA and military discounts available.  We were there for around 1.5 hours -- I wish we had had more time! As it was, we were only able to see half the town.  If you're short on time, you can let the ladies know in the visitor center -- you get a special sticker saying you only have access to 1/2 the town, but your admission is cut in half.  Outside the visitor's center, there is an awesome playground for kids and lots of space for a picnic lunch, but bring your own -- they don't serve any type of food there, except some small candy items.",
  "When we arrived and paid our 30 dollars I was sceptical as to whether we had made a mistake.  Not all of the attractions were open as a member of staff / volunteer had not arrived.  But .. on going round the various houses I was pleasantly surprised.  The guides were absolutely brilliant with lots of explanations and information (especially the store) the cotton processing was astoundingly interesting and we spent almost 2 hours looking at the various rooms and artefacts.  Superbly interesting and insightful for a child",
  "The homes and shops provide an interesting look at old Alabama.  The guides provide good information.  We were running out of time, and the guide taking us to the final community told us we had to do the entire 45 minute tour, and could not abbreviate it, even though we were the only ones!  We were disappointed about this.",
  "Just Outstanding. Highly recommended! So much explanation and visual information. Give yourself enough time, at least an hour.",
  "We had a very informative, educational visit to the many buildings in Alabama Old Town. Homes of various styles, grist Mill, cotton gin, drug store, dressmaking shop, church, school were all enjoyed. Reasonable admission price. Allow 2 hours or more, if you read all the captions that are available.",
  "For those who enjoy touring Nineteenth Century buildings and communities, you will not be disappointed spending two hours touring these facilities! Much of the tour is self-guided but one of the homes is a guided tour. This takes about 2 hours to see but is well worth it!"
 ]
},{
 "name": "Freedom Rides Museum",
 "address": "210 S Court St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/00/95/18/freedom-rides-museum.jpg",
 "tags": [
  "tour",
  "history",
  "history",
  "history",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d2413478-Reviews-Freedom_Rides_Museum-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "We take many things for granted. This small former Greyhound Bus Station gives you a sense of how segregated the South really was. While a very small portion of the original station remains, the museum provides a good overview of the many who came together around the nation to make a non violent point, only to be met by violence.\nThank you freedom riders!",
  "This is a small but powerful museum. The staff was very friendly and informative. You can easily spend an hour in this self guided tour with an introduction from the staff.",
  "It is amazing and humbling how impactful this small space is, its position in civil rights history, the courage of so many young people.   ",
  "We were disappointed not to be able to get into the museum today, but just visiting the site of this incredible piece of Civil Rights history was great.  The pictures and stories outside were excellent but made me want to get inside.  If you want to see the museum, check the days and hours carefully.",
  "This museum is part of the old bus station that sparked a lot of the Civil Rights activities of the early 1960s.  The display outside covers fairly well the events that occurred in Montgomery during the Freedom Rides.  Inside, the displays go into more depth and provides very interesting insight from the individuals involved in the events.  Should not take too long--recommend 30-45 minutes for the visit.",
  "This is a great little museum. If you are interested in Civil Rights history in general, and in Montgomery in particular, this is a required stop. Director, Dorothy Walker, is passionate and knowledgable. We spoke with her for around an hour and it was fun and fascinating.",
  "I was here a few days ago over from the UK and actually got to meet one of the Freedom Riders!! Listening to what this lady had to say felt like an honour. Looking at the images of both this lady along with her brother and father on the wall and knowing that you were stood in front of living history was amazing!! The museum staff were great too. Well worth a visit.",
  "We visited this one morning when they had a guest speaker (someone who had participated in the Freedom Rides) and his story gave the displays added impact.  \n\nThe museum reviews how the Freedom Rides started, includes photos of those arrested in Montgomery, shows the location of where people came from to participate in the Freedom Rides and has a suitcase showing what people usually carried with them.  They also have a small book and gift store. ",
  "The woman behind the desk was very friendly and provided each visitor with an overview of the historical site. The museum is small but has video testimony from those that lived this experience or where around during the time these rides visited Montgomery. It is worth your time. I spent about an hour or an hour and a half which was plenty of time. It could be done in 45 minutes if your time is pressed. ",
  "Museum is built in part of the former Greyhound Bus Station where Freedom Riders were beaten and arrested. Run by people who are inspired by the history and want to share it with you.",
  "We take many things for granted. This small former Greyhound Bus Station gives you a sense of how segregated the South really was. While a very small portion of the original station remains, the museum provides a good overview of the many who came together around the nation to make a non violent point, only to be met by violence.\nThank you freedom riders!"
 ]
},{
 "name": "Riverfront Park",
 "address": "103 N Perry St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/65/1b/29/riverfront-park.jpg",
 "tags": [
  "walking",
  "history",
  "walk",
  "kids",
  "family",
  "walking",
  "family",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d3140557-Reviews-Riverfront_Park-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you go to downtown Montgomery, outside of ... Dr King's church & residence & the inside of Union station there is nothing but boring large cement government buildings, except for the riverfront park. Bring an ice cream, cause the nearest place you can get one is a half a mile away and enjoy just relaxing and walking around this well done park",
  "If you have an interest in history, then you would find this fascinating learning about the town's past. If you're looking for an event and excitement, don't bother",
  "The River Front is a awesome way to enjoy a staycation. The water is great. Your family can go down and spread towels, and just enjoy the scenery. They also have a nice splash pad for the kids to enjoy. This is a nice walk in the summer or winter months.",
  "A great place to walk-off a big meal from one of the nearby restaurants.  A wide, paved walkway along the bank with plenty of seating to sit and look at the water flowing by.",
  "Go through the tunnel under the rail tracks to the dock that at one time saw the unloading of black humans to be housed in nearby warehouses and then sold at the slave market.\nNearby is the train station and worth a pop in.\nWalking into town from the tunnel is a nice statue of Hank Williams.  The Hank Williams museum is nearby.",
  "Near Union Station, a place to stroll, somewhat quiet, very peaceful, particularly when the water is calm in the early morning. I’ve never been down here before, and glad I made time to do so.",
  "This cruise is great for Anniversaries, Birthdays, Family Reunions, Ladies or Mens night out or whatever you want it to be. I really enjoyed this activity on the Harriott Cruise at Riverfront in Montgomery Alabama. It had live entertainment, great food and drinks and it was a Whole lot of fun I plan to go back very soon.",
  "Lovely views to be had and a nice walk along the river.  The station is here too.  I would recommend a stroll. "
 ]
},{
 "name": "Riverwalk Stadium",
 "address": "200 Coosa St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/d5/56/0f/the-montgomery-biscuits.jpg",
 "tags": [
  "food",
  "field",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d4106328-Reviews-Riverwalk_Stadium-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to watch a ball game. Lots of fun things inside, other than baseball, and a variety of food. Easy to get to. Lots of parking all around. Absolutely worth a drop in, on game day or otherwise. ",
  "Conveniently located near several hotels, seeing a Biscuits game is a great experience. The ballpark concession options include multiple types of biscuits. Everything is reasonably priced. There are frequently large freight trains on the tracks near the outfield.",
  "Had a great time at the Biscuits game.  Loved seeing the up and coming baseball players before they get to the big leagues.",
  "The atmosphere in this ballpark is incredible.  It feels old and nostalgic, but also modern and new.  Finding parking was a bit awkward, but that was due to my own fault of not knowing Montgomery that well.  \n\nI will say I was disappointed in the actual Biscuits that they serve in concessions. They were dry and the sausage and bacon were sub-par. I ended up getting a pulled pork sandwich that was great though.",
  "This is a 15-year-old ballpark with a retro feel, including left field view of the freight train line that runs parallel to the Alabama River and a corresponding kiddie train ride that runs along side it. Food options are pretty standard, but there are interesting local items like biscuits/gravy. Relaxing and inexpensive way to spend an evening."
 ]
},{
 "name": "Rosa Parks Arrest Site",
 "address": "Moulton/Montgomery Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/81/d9/75/my-1st-stop-here-in-town.jpg",
 "tags": [
  "history",
  "historic",
  "parks",
  "library",
  "parks",
  "walk",
  "historic",
  "parks",
  "walk",
  "historic",
  "learn",
  "parks",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d106396-Reviews-Rosa_Parks_Arrest_Site-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was just awesome to visit such a historic site.... Ms Parks Bible is there in a locked case for all to see and there is a marker..... so much history of a rue America Hero.",
  "Visited this site recently, and encourage folks to stop by and reflect while visiting Montgomery, Alabama.  I highly recommend visiting this site as well as the Rosa Parks Library and Museum.",
  "Downtown Montgomery Alabama is a small town with many tree lined steets. We visited on a bright sunny day . The bus stop where Rosa Parks boarded the infamous bus has a large plaque bearing a synopsis of the mother of the Civil rights movement. Lots of information boards are adjacent  and also cover the Selma bridge to Montgomery historic trail. A short walk takes you to the Wells Fargo Montgomery Union Station - also worth a visit . Some excellent exhibitions and artefacts on display. Look out for the exquisite statues of Hank Williams ; the Rainbow Soldier and a heritage plaque paying homage to the Indian Village of Encanchata.  ",
  "it was awsome everyone who worked there told everything about rosa detaeledly and super nice its amazing peaple really need to visit",
  "You can walk past this easily as you explore Montgomery, and why not? It's value depends on how much you value being right where something historic happened.",
  "I would highly recommend this Museum, you will be enlightened by the information & educated in an atmosphere that makes it very attractive to adults, and yet an attention getter for children. You will learn about the beginning of slavery, segregation, civil rights, freedom, and more. I learned alot about the laws of the early slavery n segregation days an era called the Jim Crowe laws.",
  "I am so glad there is a sign commemorating the spot where Ms. Parks was arrested.  Stopping to read it gives one an opportunity to remember and honor her memory and the courage she mustered the day she was arrested.  Are you willing to get arrested to seek and/or exercise your rights?  This is a perfect spot to ask yourself this question.",
  "The place where Rosa Parks was arrested for not giving up her seat on the bus. There's a double sided informative plaque marking the spot. The actual paving slabs have been moved into the adjacent Rosa Parks museum and form part of the exhibits."
 ]
},{
 "name": "Civil Rights Memorial",
 "address": "400 Washington Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/d4/73/5e/montgomery-civil-rights.jpg",
 "tags": [
  "history",
  "history",
  "history",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d105609-Reviews-Civil_Rights_Memorial-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was touched by the simple beauty of this evocative Memorial. The history of the Civil Rights Movement is laid out in a circular pattern covered with flowing water. It creates a sense of motion and symbolizes Dr. King’s words.",
  "Located outside of the Civil Rights Memorial Center in downtown Montgomery, this is a lovely memorial and worth a stop. The Civil Rights Memorial is a round granite table covered in water that feature the names of Civil Rights martyrs. It’s a beautiful memorial that honors those who lost their lives in the struggle for Civil Rights freedom and a reminder of how far we have come as a nation.",
  "This simple, elegant memorial outside the offices of the Southern Poverty Law Center stands as a silent testimonial to those brave men and women who lost their lives in the struggle for freedom and equality. An adjacent waterfall carries a quote from Dr. Martin Luther King, Jr. There is no cost to see this thought provoking memorial.",
  "This is a beautiful spot to stand and reflect on all the history of Montgomery.  Do take time to pause and to visualize all that has transpired on this historical spot.",
  "This was one of my favorite stops.  Just a beautiful memorial dedicated to times past.  The water flowing and the quote on the wall along with the history etched into the circular fountain were just delightful.  Parking is close, just around the corner on the street.  We spent 30 mins just admiring and reading the fountain.  Great history lesson for our daughter who has been learning about civil rights and asked to stop in Montgomery",
  "Wonderful tribute to the I forgotten Civil Rights martyrs. Beautiful memorial, great movie, nice pledge displayed at the end. Have your cameras ready for your name to pop up on the huge screen. ",
  "This memorial is open to the public all of the time and sits just outside the Civil Rights Museum and across the street from the Southern Poverty Law Center. The memorial is beautiful and thought provoking in its simplicity and the way that the water never pours over the rim. It is mesmerizing which gives you more time to think about the people who lost their lives in the struggle for equality.",
  "A beautiful memorial which is humbling, thoughtful, and saddening to view, yet gives me graitude for those real heroes and heroines who stood for integrity, equality and justice for all.  It summons each of us to live for the common good.",
  "Maya Lin, who designed the Vietnam War Memorial in Washington DC, has created another moving tribute. This time, the names of those who died in the Civil Rights struggle and the history of the struggle are engraved in the stone. It can be difficult to read at times due to the action of the water on the stone.",
  "This is open all the time, along the sidewalk. Walk over and look at the engravings on the flat circular slab. Very moving and disturbing. Another beautiful piece of work by Maya Lin.",
  "A great experience from the start. Beautiful water themed parts on the outside. Once you go inside and understand the history, you understand the water parts outside. A lot of great information in a forum that makes you think. Great job!"
 ]
},{
 "name": "Montgomery Visitors Center",
 "address": "300 Water St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/2a/89/6a/inside.jpg",
 "tags": [
  "tour",
  "walking",
  "learn",
  "free",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d106397-Reviews-Montgomery_Visitors_Center-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Visitors Center is a great place to peruse local attraction options while admiring the fine architecture of this former railroad depot.  There's a nice introductory video, as well, in a comfortable theater.",
  "This is the beginning of a walking tour that takes in many historical sites in downtown Montgomery.  The staff here was very helpful.",
  "The staff person who helped us got our visit off to a great start; she is quite the ambassador for the City.  Good place to get info and learn of the FREE parking pass available for near the Capitol.  ",
  "I had to wait outside while my friend went in, because there is no parking. She came out with one worthwhile map, and some bad information. \nParking in Montgomery is awful. The meters have a two-hour limit and its illegal to feed the meter. The city is small and the attractions (museums, historical sites etc) are close together. However, you can't walk because seeing two museums and walking between them takes over 2 hours.\nParking at the visitor center is the worst. They don't even bother with the meters!\nThere is much to see in Montgomery, but parking doesn't make it easy. ",
  "Union station has been around forever, and has a beautiful building, outside and inside. Lots of visitor info. Worth a drop in, as part of seeing Montgomery.",
  "We enjoyed this visitor's center. The location is nice - downtown in the old train station. There is plenty of information inside to get you pointed in the right direction for touring Montgomery. Jackie helped us at the front desk. She gave us a ton of additional information, talked us through some of the best ways to get around/parking/etc, and really enhanced the value of the stop. Worth going here first if you're looking to poke around Montgomery.",
  "Well stocked visitor center with helpful staff and numerous brochures. Displays and lovely windows and woodworking adorn the interior. ",
  "Staff will tell you everything you need to know to enjoy the city. There will even give you a parking pass to go to state capitol."
 ]
},{
 "name": "Court Square Fountain",
 "address": "ntersection of Commerce Street and Dexter Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/24/98/68/the-fountain.jpg",
 "tags": [
  "learn",
  "walking",
  "history",
  "historic",
  "history",
  "parks",
  "historic",
  "parks",
  "history",
  "parks",
  "walk",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d3184410-Reviews-Court_Square_Fountain-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a wonderful fountain, located right downtown.Its ornate metal work is beautiful.Its worth a look.",
  "Amazingly sad history for such a beautiful location.  Read the signs to learn about it or grab a visitors guide with a self guided driving or walking map.  This place is hauntingly serene with a history that will make you really think about how slaves were treated.  Worth a stop even if just driving through",
  "This fountain is beautifully maintained and rich with history.  I'd recommend getting a close look at the fountain and taking pictures with it as your background.  Some historic points of interest all around the fountain as well.  Rosa Parks bus stop, the Montgomery march route, and more right there.",
  "This area is the site of a number of historic events including the arrest of Rosa Parks during the Montgomery Bus Boycott, the inauguration of Jefferson Davis as the president of the Confederacy during the Civil War, the building with the first telegraph office from which Davis sent the telegram that started the Civil War, and more...",
  "The fountain area has a lot of history to it. This whole area is being updated. When it is done it will be a first class area to visit.",
  "This is an attractive Artesian fountain in the historical part of town. Worth a look here if you're in the area as the surrounding buildings are of historical significance.",
  "You can only see a lovely fountain but if the square could talk ---\n1. Rosa Parks caught the bus here for the fateful bus ride starting a year boycott of Montgomery buses.\n2. This is the site of the Montgomery Slave auctions.  Montgomery was the major slave trading site.\n3. The building on the corner across from the park was the place that sent the word to Charleston to fire on Fort Sumter starting the battles of the civil war\nWhile you are there, note the Kress building.  There's a nice coffee shop inside.",
  "Just a nice fountain, not particularly fancy, but well situated. This is an historic area. It’s nice to just walk around the fountain and get different views of the Montgomery of the past and the Montgomery of the present. "
 ]
},{
 "name": "Wind Creek Montgomery",
 "address": "1801 Eddie Tullis Dr",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/2b/f3/2a/creek-casino-montgomery.jpg",
 "tags": [
  "music",
  "food",
  "eat",
  "music",
  "food",
  "knowledgeable",
  "drink",
  "food",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d3184248-Reviews-Wind_Creek_Montgomery-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "A different atmosphere than the Wind Creek Wetumpka. More of a laid back feel with the BB King reaturant and Blues club. The music is great, the BBQ is tasty and there is always fun at the slots. There is the constant ring overhead of jackpots so it could be you!",
  "Very nice room with all of the expected amenities.  Several food choices and a diverse selection of gaming options.",
  "The casino is large and attractive, with typical casino ambiance. The heavy presence of smoke fumes makes it difficult for people with respiratory problems to enjoy the main slot area. There is a non-smoking area, but the choice of slots is limited.   The machines are modern, with a drink-ordering feature that makes it easy to get beverages without waiting to be asked if you want one.  I was disappointed in the dining facilities. There was no buffet. There were only two choices. We chose the B.B. King Grill.  The 9.95 chicken strips were satisfying, but the tiny serving of cole slaw, for 3.45 was so sparse, I asked the server to make sure it was actually a serving.  It was.   The server was pleasant and patient. The highlight of the experience was the soulful voice of the performer, Pierre Stefan. His renditions of songs by John Legend, New Edition and others were consistently pleasing.  Unfortunately, there was not much of a crowd to enjoy him.  If I return to Wind Creek, I will eat before I go and sit at a machine close to the restaurant door to enjoy the music.",
  "We enjoy going . We have been many times . We have won a few small jackpots $60 to $500 . Some times we don't win at all . But that is how gambling works. The casino is very nice -clean -lively ! Clean restrooms .  We love the seafood buffet on the weekends -it's the best !!!  Never short of crab legs ,wonderful chiefs -friendly staff .  Awesome food .",
  "Hotel completely non-smoking. (outdoor smoking area locate on 3rd floor, casino allows smoking) Check in was quick and easy (for sunday afternoon) check-in receptionist was very helpful, friendly and knowledgeable about the property. Check-out receptionist not quite as friendly/pleasant. Room 2 gueen was spacious with 2 sitting chairs with coffee type table, also a business desk set-up attached to the front dresser with an enclosed refrigerator.  Great size HD TV including hbo/cinmax. Bed soft and cozy (was concerned of being to soft for bad back but woke up not hurting so) 4 soft pillows. Bathroom was nice glass enclosed only(no tub) shower toilet separated by divider wall so person using could not be seen or see person using sink or shower, but still open bathroom with 1 door. Room door locks with new WiFi locks just tap  card key on the symbol. Seems clean, elevator smooth and fast. ",
  "My friend and I visited in November of last year and they had a promotional event for Christmas. We ordered 2 items from the event through IN marketing group. It is now January and we still haven't received the items. Wind Creek and IN marketing will not return phone calls and anytime I have asked the status of the order face to face with the customer service reps at wind creek they always assure me they will find out what is going on and get back to us. Months have passed with no follow up and no resolution.  Neither company seems to really give a crap.",
  "needed a room short notice and during the Poosa Q event. were able to get a nice room and spend a night. next time it will be longer",
  "This place is a total rip off. Wetumpka one thousand times better. I see very few jackpots and nothing but sad faces. \n\nI don’t know how the manager sleeps at night. Sorry SOB. \n\nOne thing is for sure, they want get another dime of my money. I tried everything, low rolling, high rolling and zero.\n\nAvoid this place! \n\nO YEA, a lot of there employees are rude and do not appreciate the business.",
  "My wife and I frequent here alot, especially since Wetumpka closed their truck parking. The payout sometimes is good, but lately on 60 spins, I'm lucky to get $200 and I play Max Bet. The people at Player Services are nice and polite. The waitress are nice alao, but during busy times, 1st-3rd of the month or a major giveaway, you have to wait 10 minutes for your drink. They don't comp your card, like Wind Creek Wetumpka if there is a delay. Wishing I can \"See My Winning Moment\" with a jackpot because it's been over 6 years here. My biggest concern is I have is I have to wait 30 minutes or longer someimes to get picked up or taken back to my truck because they are short with Security officers.",
  "We had a blast even though we didn't know anything about the games.  The people were very nice and helpful, and the food was delicious and reasonably priced. Plan to return in very soon. Next time we plan on staying in the hotel there at the casino"
 ]
},{
 "name": "Wynton M. Blount Cultural Park",
 "address": "6000 Vaughn Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/a2/b6/9f/alabama-shakespeare-festival.jpg",
 "tags": [
  "walk",
  "eat",
  "walk",
  "kids",
  "art",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d560234-Reviews-Wynton_M_Blount_Cultural_Park-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Absolutely beautiful grounds with rustic romantic feel. We were able to capture great pictures. Definitely will be returning.",
  "The park is a lot better now that they have a special area for dogs.  It is really nice to walk around,  feed the ducks and sit and eat.  it is also a great place to jog.   ",
  "Thank you for such a beautiful fireworks show for America's Birthday.... Great location easy access and easy to leave. Great entertainment.",
  "This is a beautiful park! Plenty of places to walk around and explore. The pond had a huge amount of turtles, which surprised me! It was also prom season, so it was great to see the kids getting their picture taken in the beautiful area. This place is also home to the Alabama Shakespeare Festival.",
  "Blount has a bit of everything, right in the middle of Eastern Montgomery.  It is amazing that this is right off of one of the main streets and close to the interstate.  You would never know it by how peaceful it is here.  \n\nThe park has a nice walking trail and contains the Art Museum and the Shakespeare theater.  There is plenty of wildlife around, such as ducks and other aquatic birds.  You could spend the whole day or afternoon here and not get bored.  Very nice park!"
 ]
},{
 "name": "Alabama Safari Park",
 "address": "1664 Venable Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/67/a1/7b/newest-giraffe-in-alabama.jpg",
 "tags": [
  "walk",
  "kids",
  "eat",
  "food",
  "kids",
  "eat",
  "food",
  "walk",
  "family",
  "family",
  "eat",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30616-d13806942-Reviews-Alabama_Safari_Park-Hope_Hull_Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took our 2 1/2 year old and baby to the Safari Park this morning - what a fun time we had! It was perfect because you drive through in your car, so the baby got to nap the whole time and the toddler LOVED the animals. I thought it was a little pricey (entrance alone for 2 adults and 1 child was $45). You get to stay in your car and the animals come to you. You can opt to purchase little buckets of feed, which we did. But we made the mistake of feeding it to the very first animals we saw, who were obviously the clever ones, because the camel literally pulled the bucket out of my hands! Next time we'd save the feed for the animals further down, they'll come up to your window either way.  \n\nOther notes: they give you a handy info booklet about the animals so you know what you're looking at, there were very clean restrooms available at the ticketing area, there is a petting zoo type place at the end with more domestic animals (i.e. pigs, goats, giraffes... and some budgies). Also, you do not need a stroller for this. You barely have to walk at all. Save yourself the trouble of bringing it and leave it at home 😉",
  "350 acres of wild adventure! drive your car thru the wildlife park, feed the animals from your car!! Zebras, bison, camels, llamas and hundreds of more animals all come to your car and eat from the buckets of animal food sold at the gift shop before you drive thru the park ! Kids of all ages will love this great new place...after the drive thru visit the petting area and feed the newest giraffe in Alabama! Great gift shop to visit and I'm sure the picnic area tables will be here soon, so bring your picnic or eat at one of the local restaurants, Your tickets' good all day!",
  "350 acres of wild adventure! drive your car thru the wildlife park, feed the animals from your car!! Zebras, bison, camels, llamas and hundreds of more animals all come to your car and eat from the buckets of animal food sold at the gift shop before you drive thru the park ! Kids of all ages will love this great new place...after the drive thru visit the petting area and feed the newest giraffe in Alabama! Great gift shop to visit and I'm sure the picnic area tables will be here soon, so bring your picnic or eat at one of the local restaurants, Your tickets' good all day!",
  "We’ve been quarantined for over a month and yesterday was my youngest child’s birthday. We surprised her with a trip to the Alabama Safari Park. It’s a very short drive from Montgomery just go down the interstate you simply get off at exit 158 and turn left then follow the signs. \nWhile interaction with the staff is so limited for safety they were all extremely nice. The animals are fun, will walk beside your vehicle to feed a little. Most have learned that if you pull the little bucket back towards you that it’s over however, there are some greedy ones that require you to hold onto the bucket as a llama yanked a bucket out of my teenagers hands. You’re able to drive through the park as many times as you wish. We went through twice before we got bored. \nI hate that the walk through is closed during this pandemic but we understand. Just means we will go back to visit another time.\nI do think they need more places for people to pull over as I had to pass three cars since the first one was holding up about 25 cars.",
  "We had a wonderful time!! Such a fun experience!! And the building is new, clean, very nice restrooms and a cute really cute gift shop. Highly recommend it!!",
  "We went the day after Christmas and the weather was perfect.  Entry was $17 per person for over 12 yo and $13 2-12 yo and we got 2 buckets of treats for $8 ($4 each).  The animals were so much fun but they are definitely greedy so be prepared to ration your treat buckets.  We have a 15 yo and a 3 yo and both enjoyed this and well as their mom and I.  After the drive through part there is a small feeding area to hand feed some goats.  They had a couple pigs but the goats are so dominant that is all you can reach.  We ended up buying another bucket of treats for this area as we were out from the the drive through.  This area also has the option to hand feed a giraffe for $4 for a cup of lettuce.  It is a keepsake plastic cup and the opportunity is worth the $4.  They also have a bird enclosure that was very neat.  For an additional $1.50 you can by a popsicle stick with seeds stuck to it that will attract the birds to you and one stick last about 10 minutes of feeding so one stick for two people was plenty.  There was a kangaroo pen but that was not very exciting as it is just viewing from a walkway.  All in all it was a great experience.  So for a family of four total we spent about $80 plus Alabama's good ole 10% tax rounding to about $90.",
  "visited with my colleqauges when was in town . nice bigg park . have plans to visit with the family. Need some petting zone.",
  "I love zoos, but don't like seeing animals so confined. So I was thrilled with the Alabama Safari Park. Grazing animals have wide open spaces to roam around and visitors get up close without trying to see them through fencing. This is a drive-thru park and you will need to stay in your vehicle to remain safe. Although the animals are not meat eaters, many have horns and hooves. A frightened animal is always dangerous.  \nAfter paying for admittance ($16.96 for adults, $14.95 for senior adults, $12.95 for children), we purchased a bucket of food ($4 each). If large animals sticking their heads in your car is not for you, skip the feeding and drive through with your windows up. As with all animals (humans included) there were timid feeders and there were greedy, aggressive feeders. Animals and human safety is important, so follow the rules. Do not try to feed from your hand, do not roll up the car window while the animal is feeding. We found that by spilling some of the food on the ground, the animal would move their head out of the car and go after the food on the ground. It was then safe to close the window and slowly drive on. You will need to be patient and wait for the animals to move out of the road. One large llama stood directly in front of our car and wouldn't budge until another car was spotted behind us. \nWhen you pay for admittance, you will received a guide book with photos and info on the animals you will encounter - some up close and some from a distance. Some will approach for food and some are grazing nearby. \nAfter the drive-thru loop is completed, you can visit the gift shop and purchase Romaine lettuce ($5 with souvenir cup) to feed the giraffes or seed sticks ($1.50) to feed the birds. Depending on the size of your family, you may want more than one cup of lettuce, but one seed stick should work for a group. We found the birds had to be coaxed to feed and would have been able to share one stick. It was taking the birds so long to eat, we set the sticks on a post and left. There is an Outback area with kangaroos and a large area with goats and pigs."
 ]
},{
 "name": "Equal Justice Initiative",
 "address": "122 Commerce St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/00/86/c6/montgomery.jpg",
 "tags": [
  "history",
  "history",
  "history",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d14981636-Reviews-Equal_Justice_Initiative-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "This wonderfully designed museum spans the African American experience from the beginnings of the slave trade, through the Civil War, Jim Crow era, the Civil Rights Movement and racism in the criminal \"justice\" system.  Many mediums are utilized to make the history accessible.  Such an important museum.",
  "We wanted to visit the Legacy Museum downtown.  You get tickets at another location and can buy tickets for two museums.  A little confusion, but nice presentation of the history of Domestic Slave Trade.",
  "It grabs you from the very first step you take inside! It conjures up thoughts and feelings that you don’t necessarily want to come up. However are necessary for you to understand the depths of what you’re seeing. INJUSTICES are still very much alive today! I have changed my mind about the death penalty/capital punishment! Too many INNOCENT people have been executed and are on death row!  What’s even more sad is that when they are finally released, NO ONE EVEN APOLOGIZES OR RECOGNIZES THE WRONG! There have been years of wrong and this highlights that. Thank you for doing such an awesome job of informing us and prompting me into action! I feel like you have to visit more than once, just to take it all in,\n.",
  "The family made the visit for son’s college class.  The entire display  is lovely, but soul rocking to see the brutality that our history entails.  May peace be to all. ",
  "The legacy of slavery and it's atifacts are on full display here.  This museum documents the full African American experience regarding slavery, racial injustice and the criminal justice system.  There are interactive videos and holograms that will truly break your heart.  This is a must see exhibition."
 ]
},{
 "name": "Montgomery Biscuits",
 "address": "200 Coosa St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/c7/79/4f/img-20170704-194605-largejpg.jpg",
 "tags": [
  "family",
  "food",
  "unique",
  "food",
  "drink",
  "free",
  "kids",
  "affordable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d10594276-Reviews-Montgomery_Biscuits-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "It is a very nice stadium, the staff is always very pleasant and helpful . There arelots of activities for the children and no bad seats in the house. It is a good place to go and spend time with family.",
  "Major league amenities with a small town feel. The food options were extensive and unique. (Sausage and chicken biscuits!) Stadium was a renovated train station. Fun event for families and friends ",
  "As a local, I'm positive we don't appreciate what is in our backyard!  The Biscuits stadium is truly a top notch stadium with a beautiful back drop.  If you're lucky a train will pass by at some point during the game.  They have great, fun inflatables (for $5 wristbands for the game) and playground (that is free).  So many food and drink options.  The Biscuit Bunch does a great good of keeping the crowd engaged.  The seats are fantastic.  Parking is easy and safe.",
  "This is a top notch Double A baseball program. The stadium is one of the nicer ones I’ve been to. It’s clean, accessible parking, a nice setting next to the train and river and a lot of eating options. There is plenty of entertainment between innings to keep the kids engaged and a nice large scoreboard in the outfield with a screen to keep up with the game. Ticket prices are affordable and there are lots of promotions throughout the week and fireworks on Fridays and Saturdays. Be sure to get your biscuits too! Overall an enjoyable evening!",
  "Visited the Montgomery Biscuits AA minor league team last night and had a great time. It was very lively and the in between inning shows were great. Victor really keeps the crowd moving. "
 ]
},{
 "name": "Montgomery Performing Arts Centre",
 "address": "201 Tallapoosa St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/f2/78/63/three-dog-night.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d3658532-Reviews-Montgomery_Performing_Arts_Centre-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "Just made my first visit to MPAC. Easily accessiable parking. Very comfortable seats. Clean restrooms. Not a bad view in the entire auditorium! Had a very good experience and will go again. Only drawback is that it is not smoker friendly at all. No smoking area! Once you are in that's it.",
  "Went to concert there a few weeks ago, EVERYONE was so nice and accomodating.  I was in two casts and a wheelchair and they were there at every turn to help us in and out of our seats.  The acoustics were fantastic, the arena itself was the perfect size. not to big not to small.  The lobby had snacks for sale and drinks.  A bit pricey for the beers, but it was worth it to us.  I would go again for sure.",
  "A GREAT show in an excellent facility for this type concert. My only disappointment on my first visit to this well managed facility was with the purchase of the tickets . They were only available as “walk up” or through Ticketmaster which turned $225 for 4 tickets to $271. ",
  "Great venue.  It is comfortable and not a bad seat anywhere in this place.  Accoustics and lighting good too!  The people working there are very friendly and excellent customer service!  Highly recommend. ",
  "Stage is good size. Seats are comfy, for the most part. If you're seated on the top level, you'll need to take the stairs or wait for the elevator. Front row seats at the top are good seats, but you can't see the stage w/o leaning up and being on the edge of your seat. Easy in and easy out."
 ]
},{
 "name": "Eastbrook Flea Market and Antique Mall",
 "address": "425 Coliseum Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/c6/16/3e/orvieto-mug.jpg",
 "tags": [
  "walk",
  "art",
  "walking",
  "family",
  "walk",
  "art",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g30712-d3140545-Reviews-Eastbrook_Flea_Market_and_Antique_Mall-Montgomery_Alabama.html",
 "source": "TripAdvisor",
 "reviews": [
  "This would have been a 5 star rating but I always have to rate down places that have some cluttered and tight booths.  We just walk right past those because it isn't worth tripping of knocking over something to get to the back of the booth.  \n\nWalking in the door we were greeted with friendly hellos and welcomes from a very nice woman.  The place is 60,000 square feet on 3 floors so plan to spend a bit of time here.  We walked out with a golf whiskey decanter to add to my husbands collection.\n\nYou can also find china, lighting, furniture, kitchenware, art, vintage clothes and jewelry, collectibles, glassware, art deco, mid-century, textiles, decanters, books, tools, pottery, great collection of fiesta ware, vintage hats, and so much more.",
  "Most items were made to look “Antique” but still some really cool stuff to look at. The basement had a huge book section for a great price. The store is slightly disorganized but definitely an easy way to kill a few hours. ",
  "My family and I really enjoy coming here.  Whether you're interested in Fine Antiques or Nice items from the recent decade, this mall has it all.\n\nMost prices are very reasonable and to double your fun, there's a large thrift store next door called 'Helping Hands'.  Its full of collectibles and recently donated items.",
  "This is three floors of choice kitsch and near antiques, at excellent prices.  Bring cash as the additional discount is substantial.  Everything is in beautiful condition.  And allow lots of time as there’s a huge amount to see.  There’s also a decent thrift store next door and a nearby vintage record shop.  ",
  "Three floors of vintage treasures. We visited on the way home from the beach. My son loved this place, he could have spent hours here. The staff was very friendly and helpful.  I would definitely  recommend stopping here.",
  "This would have been a 5 star rating but I always have to rate down places that have some cluttered and tight booths.  We just walk right past those because it isn't worth tripping of knocking over something to get to the back of the booth.  \n\nWalking in the door we were greeted with friendly hellos and welcomes from a very nice woman.  The place is 60,000 square feet on 3 floors so plan to spend a bit of time here.  We walked out with a golf whiskey decanter to add to my husbands collection.\n\nYou can also find china, lighting, furniture, kitchenware, art, vintage clothes and jewelry, collectibles, glassware, art deco, mid-century, textiles, decanters, books, tools, pottery, great collection of fiesta ware, vintage hats, and so much more.",
  "Eastbrook Flea Market and Antique Mall is beyond amazing!  Take a walk back in time and see all the cool decor you used to have in your home from years past.  There’s also a good assortment of new items that are on point trend wise.  Plan to spend a few hours scouring each booth on three floors of what was once Montgomery Fair department store.  When done, take a ride through the neighborhood for authentic mid-century architecture.  Highly recommend Eastbrook!!",
  "Spent several hours just trying to take it all in. Located in an old more upscale department store, 3 stories. Really enjoyed , will return. "
 ]
}]
