[
{
 "name": "Grand Ole Opry",
 "address": "2804 Opryland Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/2b/4a/5c/photo3jpg.jpg",
 "tags": [
  "music",
  "sampling",
  "tour",
  "music",
  "tour",
  "free",
  "tour",
  "music",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106503-Reviews-Grand_Ole_Opry-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Current 1970's building is a bit ugly from the outside but very functional for the numbers of people attending every show, and the acoustics are fantastic once seated. An endless sequence of performers come on and do three songs each so there's plenty of variety - all introduced by the compare/ DJ that is delivering the live radio broadcast you are part of - including the inevitable adverts between each act. A great experience even if you are not a lover of Country & Western. Watch the drinks cost though - a bit pricy.",
  "The auditorium is wonderful with great acoustics\nThis is a really good way of sampling the various types of country music\nAll eight acts were great\nIt is amazing that it has been going for so long\nLoved the compere reading out the adverts  for those listening on the radio!\nWorth popping into the Opry resort next door ",
  "We did the backstage tour found it very interesting our tour guide was great fun and very enthusiastic about the tour loved looking at the dressing rooms artists entrance getting a real feel for how it is for artists . Highlight at end and going onto the stage seen many times in videos and on TV . Bought the photo on way out as quality of picture excellent, only regret didn't get to a evening show so something to look forward to next time in Nashville ",
  "I called the Grand Ole Opry a few months before visiting Nashville. The agent on the phone suggested I buy tickets from her at $75 and sit in the third row, sold!!! We had such a wonderful night! We got super lucky and knew 4 of the 6 artists performing that night so it was even more enjoyable.  ",
  "Personally, I am not a very big fan of country music, but I loved this. The performances put on were truly amazing. I loved the heart and enthusiasm that the artists put into their singing. This might have even been my favorite part of Nashville. We attended a fantastic concert!",
  "My mom and I went to see the Dancing With THe Stars Live Tour at the Grand Ole Opry and it's been amazing 2 years in a row! Seats in the Mezzanine section or lower are best. Parking is way over priced in my opinion but you can park in the Opry Mills Mall parking lot for free.",
  "We had a fabulous time!  The tour was filled with history from yester-year up to yesterday.  It was a wonderful story of CW evolution from its infancy at the Ryman Auditorium.  Well worth the time & $ to see this icon of country music up close and personal.",
  "Current 1970's building is a bit ugly from the outside but very functional for the numbers of people attending every show, and the acoustics are fantastic once seated. An endless sequence of performers come on and do three songs each so there's plenty of variety - all introduced by the compare/ DJ that is delivering the live radio broadcast you are part of - including the inevitable adverts between each act. A great experience even if you are not a lover of Country & Western. Watch the drinks cost though - a bit pricy."
 ]
},{
 "name": "Ryman Auditorium",
 "address": "116 Fifth Ave N",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/25/0d/86/ryman-auditorium.jpg",
 "tags": [
  "family",
  "music",
  "history",
  "tour",
  "theatre",
  "history",
  "family",
  "music",
  "history",
  "historic",
  "music",
  "music",
  "history",
  "tour",
  "history",
  "free",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106496-Reviews-Ryman_Auditorium-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Originally a radio show that reached across great portions of America, WSM-AM's broadcast of the Grand Ole Opry brought major stars and aspiring artists (many of whom went on to greatness) to the homes of people in the South, Midwest and further. Patty Loveless talks about her Mama propping the family's tube radio in the kitchen window to get the best reception in the hollow where she grew up, remembering sitting on the kitchen table as she and her mother sang.\nCarlene Carter tells stories of having her mother June Carter fish first husband Carl Smith out of Tootsies (across the alley) so he wouldn't miss the second show. And Hank Williams once kicked out the footlights, and was banned forever.\nEven Johnny Cash shot his celebrated tv series at the Ryman, where one night he defied the censors and sang the proper lyrics of \"Sunday Morning Coming Down.\" A nervous Kris Kristofferson, the song's writer, roared his approval from the balcony,\nThat's just the tip of ice berg of what the Ryman has been home to. Originally built as a church, it was converted to a music venue. But even that history wasn't enough to keep the Opry from moving outside of town to the Gaylord Entertainment complex... and so the Ryman almost wasn't.\nEnter Emmylou Harris, who got wind that the rundown building was on the verge of a wrecking ball. She stepped in, recorded LIVE FROM THE RYMAN, and the city began to recognize what it's history was worth. She was also onstage when Neil Young filmed his live back-to-roots-music concert film \"A Prairie Wind\" there.\nToday, the Ryman is an award-winning concert venue. It is also a part-time home of the Grand Ole Opry -- and various theme concert series it runs throughout the year (a bluegrass series, Vince Gill + Amy Grant's Christmas show, Little Big Town's residency). But beyond the music itself, there is the building.\nFor those who crave to see where this music began and came from, tours are available throughout the day. History is shared, as you move through the Confederate Gallery upstairs, down through the church pews below, backstage and in the dressing rooms once used by Dolly Parton, Patsy Cline, Willie Nelson, Loretta Lynn, the Carter Family, Porter Wagoner, Minnie Pearl, Connie Smith even Elvis.\nThis is a crucible of pop culture, a place you can touch and take in. That it was once a church explains the way it feels inside: this is something much greater than merely an old building where something happened. Step inside, you'll see.",
  "Great tour ...highly recommend the backstage tour... tour guides are full of stories and history of the theatre ...really gives you a great feel for the history of the theatre. Movie at the beginning of the tour was excellently produced! ",
  "This was the most fantastic trip I've ever taken to Nashville, this trip had just one objective, to see The Coal Miners Daughter Miss Loretta Lynn and her sister Crystal Gail, who was inducted into The Grand Ole Opry family, the Ryman is the mother church of country music. The sound quality was outstanding, we had great seats in the balcony, it was a little tight but acceptable. I'll be planning to go again and again. Find yourself a show a experience the great environment and enjoy the history behind one of the greatest music venues ever. ",
  "Not a bad seat in house, we were setting in handicap seating and could see great! This was all young stars singing Dolly’s songs! We enjoyed it!",
  "We attended the Opry in the historic Ryman.  The place was sold out and the crowd was enthusiastic.   Music was very good and we enjoyed the show, especially new comer, James Carothers, and old timer, Allen Jackson.  It was a fun night.   ",
  "Wonderful venue with a fully immersive experience from the moment the doors open Excellent AV presentation with friendly attentive staff We then wandered around on our own and enjoyed every moment Steps of history Anyone who’s anyone in music history has layer here Fabulous visit ",
  "We really enjoyed our visit to the Ryman. The video at the start of the tour was interesting and informative, and we loved reading about all the history. Taking a picture on stage and getting it for free (included in tour price) was really nice. We'd highly recommend this to others visiting Nashville.",
  "The tour we had went well beyond our expectations. The Ryman has a great history and is a beautiful facility. We saw back stage as well as the main auditorium and received great information and stories. Our guide was very knowledgeable and entertaining.  The energy is amazing at the Ryman! I would put as a must see when in Nashville. "
 ]
},{
 "name": "Country Music Hall of Fame and Museum",
 "address": "222 Fifth Avenue South",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/88/6c/a5/country-music-hall-of.jpg",
 "tags": [
  "tour",
  "active",
  "music",
  "history",
  "historic",
  "music",
  "tour",
  "history",
  "music",
  "music",
  "family",
  "music",
  "history",
  "history",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106493-Reviews-Country_Music_Hall_of_Fame_and_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are visiting Nashville, Tennessee, chances are you are here to see what makes Music City tick, from the Grand Ole Opry to Ryman Auditorium to the many museums dedicated to country music and its legendary recording artists from Jimmie Rodgers to Hank Williams to Roy Acuff to Patsy Cline to Johnny Cash. Located at 222 Fifth Avenue South, the 350,000-square-foot Country Music Hall of Fame and Museum is one of the world's largest and most active and popular music research centers and the world's largest repository of country music artifacts, more than 2.5 million. Chartered in 1964, the museum houses 200,000 sound recordings, 500,000 photographs, more than 30,000 moving images on film, video and digital formats, hundreds of musical instruments, thousands of items of clothing, oral histories and iconic vehicles, including Elvis Presley's 1960 \"Solid Gold\" Cadillac and Jerry Reed's 1980 Pontiac Trans Am from Smokey and the Bandit II. The museum attracts more than 1.1 million visitors a year. So what do you want to see? Historic RCA Studio B, Nashville's oldest surviving recording studio, where recordings by Elvis Presley, Dolly Parton and Waylon Jennings were made. The bronze plaques of the Hall of Famers that are displayed in the museum's 70-foot-high rotunda. Glen Campbell narrating the history of country music. Maybelle Carter's Gibson L-5. Earl Scruggs' banjo. Bill Monroe's mandolin. Patsy Cline's cocktail dress. Johnny Cash's black suit. Reba McEntire's red dress. Start with the museum's core exhibit, \"Sing Me Back Home: A Journey Through Country Music,\" which immerses visitors in the history and sounds of country music, its origins and traditions, and the stories and voices of many of its architects, then take a tour of the museum to experience what country music is all about.",
  "Spent hours here reading all the information available about every country singer imaginable. The costumes, instruments, gold records, cars and photographs are a country music lovers dream spread over three floors allow yourself plenty of time to thoroughly explore this wonderful music museum ",
  "Our guide, Ron Harman, \nWas the best ❗\nIf you miss the Studio B Tour with Ron Harman as your guide, you've miss the best tour guide doing the Studio B Tour. Ron is a treasure of information. He went over parts of Studio B that only Ron can offer as he has lived history with some of the best in the recording industry\n\nDon't miss this tour & if you luck into having Ron Harman as your guide you have hit a home run with the bases loaded. ",
  "We are new to the country music scene so this was not what we expected. If you visit here maybe know a bit more about country music prior to 2012 ;)",
  "I am not a country music fan, so obviously I didn't enjoy this. The museum was set up very nicely. If you are a fan of current country music, I don't suggest this. The only current artists that were featured are Taylor Swift and Blake Shelton. This museum was not what I expected.",
  "As a family we visited the hall of fame and enjoyed seeing and reading about the artists and the history of country music. There is so much to see and do in Nashville but I would make sure to add this to your itinerary",
  "going back in june 2021 for my 4th  visit love the history of this place seeing all the plaques on the wall of all\nthe stars i grew up listening to on my mums 78 rpm records",
  "A must for country music lovers Huge new building with polished experience for visitors Very impressive "
 ]
},{
 "name": "Belle Meade Plantation",
 "address": "110 Leake Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/aa/8e/73/belle-meade-mansion.jpg",
 "tags": [
  "tour",
  "affordable",
  "tasting",
  "tour",
  "history",
  "family",
  "historic",
  "library",
  "winery",
  "tour",
  "tasting",
  "walk",
  "cheap",
  "history",
  "delicious",
  "tour",
  "walking",
  "tasting",
  "history",
  "winery",
  "tour",
  "tasting",
  "cheap",
  "winery",
  "food",
  "tour",
  "family",
  "history",
  "delicious",
  "unique",
  "tour",
  "history",
  "tour",
  "unique",
  "history",
  "knowledgeable",
  "tour",
  "history",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d108042-Reviews-Belle_Meade_Plantation-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "My 3 friends and I loved our experience at Bell Meade! We had an amazing guide who was a recent graduate, who did a phenomenal job at keeping us engaged and interested during the tour of the mansion, then we loved the wine tasting and were able to enjoy an affordable bottle of wine between the 4 of us in a lovely setting afterward!",
  "We so enjoyed this tour - rich with a diverse history - horse breeding and a connection to a legacy of triple crown winners, to aristocracy and a fascinating history about generations of slavery.  Beautiful grounds and so much to see. Highly recommend! ",
  "Belle Meade Plantation is  located at 5025 Harding Pike in Belle Meade, Tennessee, a posh residential suburb due south of downtown Nashville. With a population of 3,000, its per capita income is by far the highest in Tennessee and one of the highest in the nation. Former U.S. vice-president Al Gore lives there. So do entertainers Vince Gill and Amy Grant and Pulitzer Prize winning author Jon Meacham. So it is fitting that the roots of this ritzy town were laid in 1807 when Belle Meade Plantation was constructed. The estate once covered 5,400 acres, was worked by 136 slaves and included thoroughbred racing and breeding operations. Today, the plantation's grounds number only 30 acres but includes the three-story mansion with a 14-foot-high central entrance hall that runs the full length of the house from east to west and was added to the National Register of Historic Places in 1969 and 10 outbuildings, including a winery, visitor's center, children's playhouse, smokehouse, dairy, carriage house, stable, mausoleum and restored slave quarters. The mansion also features thoroughbred paintings by 19th century painters Edward Troye, Harry Hall and Henry Stull, depicting the plantations's most famous horses, double parlors, library, dining room, family portraits and chandeliers that once were lit with methane gas made with manure, a second-floor Empire-style staircase carved in cherry, four bedrooms and three full bathrooms complete with hot and cold running water. The 1826 smokehouse was the largest in the South, producing as much as 20,000 pounds of pork a year. The 1884 dairy produced up to 240 pounds of butter each week. The 1892 carriage house contains a surrey with a fringe on top, luxury Victorian carriages or high-end social events and a 16-passenger double-decker carriage. Among the many notable guests to visit Belle Meade were President U.S. Grant, General William T. Sherman and President Grover Cleveland.",
  "I would rate this as one of the top visits for adventurers who want to see a piece of history in Tennessee.  The tour through the residence was unbelievable, along with the ability to walk the grounds to see the wine tasting, smoke house and bourbon buildings.  I purchased some of the delicious wine and gifts from the Gift Shop that were awesome.   Check out the wine bottle holders, the prices were unbelievable (too cheap not to buy).  Treat yourself and do an early tour through the main house, it is well worth it and will give you enough time to walk the grounds and then do lunch at the restaurant on site.",
  "I especially enjoyed learning about American Horse Racing History.  You can spend a good portion of the day here.  Multiple tours available.  We did Mansion tour,the walking tour and enjoyed a snack at the winery tasting room on the property.  To get the most out of the property arrive late morning.  The last Segway, Bourbon and Wine Pairing tours start around 2 pm",
  "I like wine... so I had to stop by here on my visit to Nashville. You go in through the gift shop and off to the right you get your tickets to go into the plantation for $16 and this includes complimentary wine tasting of 4 or 5 sweeter wines. This allows you to check out the old carriages, small slave house, the ice cream shop, the outside of the mansion, the winery, and the small milk house. The map makes everything look farther away than they really are. If you want a tour and access to the mansion, $24. Maybe that's what we missed. While the grounds were nice, I'm not sure it's worth the short drive out of town. The wine was sweet but easily drinkable. Very cheap if you want to take a bottle home. Also, there is an option for wine and food pairing. You should try to reserve that ahead of time. The gift shop is very neat. Prices were actually pretty cheap compared to other gift shops. ",
  "Beautiful grounds, mansion, and some unique delicious wines. The guided mansion tour was short and not very engaging. The interpreters had history of the family and a few stories that were enjoyable. However, they didn’t seem to have much info or historical knowledge beyond their script. ",
  "One of Nashville's little treasures,.... the tour guides do an admirable job of relaying the Belle Meade history that's interesting to the lay person.  A couple of hours here is well spent!  And, ask about Secretariat....",
  "Had the best time on a private pairings tour with Cindy. By bottle #5, the group was getting rowdy, but Cindy was a professional at reining them in and continuing the party. Afterwards, the group walked around the grounds with plastic drinking cups and bottles of their favorite wines from the pairings. The entire group had only great things to say. I was the designated driver, otherwise UBER. We will be back!",
  "If you like plantations, this one is a little different. Unique history with a very cordial and knowledgeable guide. Great for a history buff!",
  "We were excited to tour the mansion, but by the second room the musty state of the house aggravates my wife’s asthma causing her to cough. Other guest gave us the, “Do you have Covid19 look,” and we exited the tour early for their sake and ours. Missed the wine tasting which was probably the best part of the tour.\nIf you are planning to go, and don’t LOVE history, just visit the vineyard."
 ]
},{
 "name": "Andrew Jackson's Hermitage",
 "address": "4580 Rachels Ln",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/e0/52/64/front-view.jpg",
 "tags": [
  "tour",
  "structure",
  "historic",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "tour",
  "family",
  "kids",
  "tour",
  "family",
  "history",
  "kids",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106501-Reviews-Andrew_Jackson_s_Hermitage-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Hermitage, Andrew Jackson's home from 1804 until his death in 1845, has been acclaimed the fourth best Presidential site in the nation by USA Today, behind the White House, Thomas Jefferson's Monticello and George Washington's Mount Vernon. Located at 4580 Rachels Lane in Davidson County, 10 miles east of downtown Nashville, the Greek Revival structure has a rectangular layout, about 104 feet from east to west and 54 feet from north to south. The main entrance includes a central block with a five-bay, two-story structure with a portico supported by six modified Corinthian style, wooden columns. Within the portico is a two-story balcony. One-story wings flank the mansion. Inside, the main block of the house consists of four large rooms separated by a center hall. At the far end of the hall is the elliptical cantilevered staircase with mahogany handrail that leads to the second level. Notice the crystal chandeliers and Italian marble mantels and the entry hall with plank flooring painted dark and decorated with block-printed wallpaper made in Paris, France. To the right of the entrance hall are two bedrooms that were occupied by Jackson and his son. On the second level are four bedrooms that once were occupied by guests such as Sam Houston, the Marquis de Lafayette, James K. Polk and Martin Van Buren. Perhaps the most interesting feature in the house is a rustic mantelpiece called the \"Eighth of January\" that was carved by a veteran of the Battle of New Orleans, who worked on the mantelpiece on each anniversary of the battle until he finished on January 8, 1839. The Hermitage, which was designated a National Historic Landmark in 1960 and added to the National Register of Historic Places in 1966, can be viewed in via a two to four-hour self-guided tour, a 90-minute guided tour of the mansion and grounds and access to the mansion's balcony, a tour of the grounds via a horse-drawn wagon allowing a glimpse of what life was like on the 1,000-acre cotton plantation and two tours that include access to the mansion, grounds and exhibit gallery, an interpreter-led tour of the mansion, a self-guided auto tour of the gardens, grounds and the other historic buildings, a self-guided tour of the farmland that used to be the Heritage Planation and viewing a film, \"Andrew Jackson: Born From A Star,\" at the visitors center. Also of interest is the large brick smokehouse at the rear of the kitchen that was built in 1831 and cured 20,000 pounds of pork a year and a nearby slave cabin known as Uncle Alfred's Cabin, named for Alfred Jackson, who was born into slavery on the property in 1812 and worked as a freedman after Emancipation and stayed on as a caretaker following the purchase of the estate in 1889 by the Ladies' Hermitage Association. He died in 1901 and was buried near the tomb of the seventh President of the United States and his wife, Rachel, who died in 1828. There is so much to see at the Hermitage, so much history and so many stories.",
  "Loved the history the tour of the house we as awesome.....we also did the horse wagon   ride which was amazing .....the grounds are beautiful",
  "My wife and I were in town and looking for something to do. Didn’t know that much about Jackson but thought it might be interesting, and the cost was reasonable.  The home is so very well preserved from the original furniture, books, silverware, toys, and paintings, right down to the French wall paper. I’m told by our amazing tour guide (Rosetta, who’s been giving tours for 40 years) that almost everything but the bed linens and curtains are original (95%). We recently had gone to Mount Vernon and this home was much more impressive to us (very little in Mount Vernon is original). We were there mid week and nothing was crowded. The museum was also very well done and the exhibits were numerous and very interesting. We walked the grounds (it’s a really well done self guided audio tour) and spotted wild deer and turkeys down by the creek, as we checked out the original Hermitage home, slave quarters, gardens, cemetery and more. We learned a whole lot about Andrew Jackson, both the good and the bad, and came away really happy that we went there. Anyone interested in American history and life in the 1800’s should pay it a visit.",
  "My family really enjoyed our visit to the Andrew Jackson Hermitage. My kids were 13 and 11 at the time of our tour. The gentlemen who was our guide kept the kids engaged. We all came away feeling we learned so much about Andrew Jackson life.  The grounds were pretty too! ",
  "We came here as a day trip from downtown Nashville, and we really enjoyed it. We loved learning about our 7th president and seeing where he lived. The tour was great and the information was very captivating.",
  "A must see when visiting Nashville or surrounding area. Go back in time to the days of large plantations  the home and surrounding buildings and property are well maintained. I highly recommend the horse drawn surrey ride. The driver was a wealth of information and was well worth the expense.  A great place for the family ",
  "We spent quite a few hours on this site.  The house is beautiful, the grounds are well-kept and really provides the history of the land. My favorite part was the house because I love all things old, but if you are a Jackson fan the museum is well down and has a lot of information about his life.  This was worth the visit and my kids even appreciated being in the home of a former president. ",
  "There was so much rich history here to learn about a president I did not know much about and left with a strong appreciation of who he was and what he stood for.\n\nThe staff is dressed to play the part and equally equipped to share their knowledge with you to make this experience even better.  I appreciated that the good, the bad and the ugly were all shared as part of his history.  It was not glossed over at all.  You can see it for yourself and leave with a respect for the person he was in the times he lived and the factors that drove his leadership."
 ]
},{
 "name": "Downtown Nashville",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/9a/1b/9a/downtown-nashville.jpg",
 "tags": [
  "music",
  "music",
  "music",
  "walking",
  "walk",
  "music",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d1378948-Reviews-Downtown_Nashville-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "We live here and enjoy going to the used bookstores, downtown library,restaurants, shops near Vanderbilt University, and the riverfront as well as Centennial Park. It's best by day as at night the drunks come out and the music venues blast horrible country music. See a tall building that appears to look like Batman's head? That is the AT&T building- known locally as the \"Bat Building\".",
  "Hello and as always thank you for reading my review. Going down Broadway street is a real treat for any country fan. I found a new pair of cowboy boots and we got to jump into a few of the local bars and enjoy some music. Pay attention and find the hatch shop and goo goo shop for some great souvenirs. It does get quite windy so if your going in the cooler months bring a sweater. Overall we had a great time.  Cheers!",
  "Downtown Nashville offers a great variety of honky tonks for music and drinks as well as many restaurants, from casual to fine dining. We spent most of our time on Broadway between the river and 6th St., walking in and out of several little spots eating, drinking and listening to music. There is a lot of construction going on downtown right now, so expect some alternate walkways and such.",
  "Unfortunately couldn't go anywhere because of the outbreak. The city is clean and Broadway looks like it be a great place to check out. Hope to visit soon. ",
  "You walk in anywhere you can hear people with their dreams of making it big. A lot of good people and you wish they could all make it. You have to weigh yourself through the drunks. The homeless news is out of control with all the taxes they take in from Taurus you think they could make more housing",
  "Our family went to Nashville for a soccer game on 2/29 and were blown away by the Downtown area. I hadn't visited for 10+ years, and it has grown substantially. Granted, there were two sporting events (hockey and soccer) and a concert all happening, but downtown was bustling with folks. Lots of options, live music from every bar/restaurant and tons of folks having a great time as far as the eye could see. Most importantly, the City had great resources and planning in place (a few roads blocked, police directing traffic and managing pedestrians, etc.) to ensure folks had a good time while all being safe. It was an all around fun, impressive experience.",
  "We spent an afternoon there and an evening. I definitely enjoyed the afternoon better. Less people. We especially enjoyed Allan Jackson’s Bar. It is fun listening to all the different bands and the bands change all the time which is a great idea. Better for families with children during the day. ",
  "Absolutely brilliant day and night out. Fantastic artists in lots of bars. Friendly atmosphere everywhere we went. Great choice of food and drinks. Whatever your taste in traditional or new country there's a place for everyone. I can't wait to go back."
 ]
},{
 "name": "The Johnny Cash Museum",
 "address": "119 3rd Ave S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/e2/80/e0/the-johnny-cash-museum.jpg",
 "tags": [
  "kids",
  "music",
  "learn",
  "family",
  "food",
  "tour",
  "walk",
  "music",
  "family",
  "history",
  "music",
  "music",
  "learn",
  "kids",
  "performance",
  "music",
  "walk",
  "music",
  "walk",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d4177748-Reviews-The_Johnny_Cash_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "While driving from Flagstaff to DC, the male half of IllyCoffeeDrinkers and one of our kids spent a day and night in Nashville in order to take in the sites, music and food. The Johnny Cash Museum is a must-see location for all Johnny Cash and music fans.  The museum contains a spectacular collection of John Cash awards, memorabilia, personal items, informative exhibits and photos (a few photos are attached).  As Johnny Cash fans, we were inspired to learn so many things about his career, family, friends and artists he collaborated with.  It is truly incredible how many songs Johnny Cash recorded, and the number of people involved in his music.  As we walked through the exhibits, we kept wondering – did this guy ever sleep?  Our bottom line, if you are a Johnny Cash fan, or just a music fan, this place is definitely worth a visit.            \n\nIf you found this review helpful and/or our photos helpful or pleasing, we hope you will click the “helpful/thank you” button.  Those of us who write detailed reviews appreciate the feedback and it encourages us to write additional reviews for everyone’s consideration.  Thank you.",
  "You don't have to be a fan of country music to appreciate and admire the life and music of the \"Man in Black,\" entertainer Johnny Cash, one of the best-selling recording artists of all time. His life, from his early years and Air Force career to his personal life and music career, including memorabilia from his famous prison concerts and a history of his all-black look, is chronicled in the Johnny Cash Museum in Nashville, Tennessee. The 18,000-square-foot museum is located at 119 3rd Avenue South, in the busy South of Broadway (SoBro) neighborhood, near the 4th Avenue North and Broadway Avenue SB bus station and at Stop 3 on the Old Town Trolley Tour. It houses the world's largest collection of Johnny Cash memorabilia and artifacts, including a stone wall taken from his lake house in Hendersonville, Tennessee. The museum also features a gift shop stocked with Johnny Cash souvenirs and collectibles, a cafe and a coffee shop. The Johnny Cash collection includes stage costumes, handwritten letters and notes, handwritten lyrics, Gold and Platinum records, Grammy and CMA awards, personal belongings, his personal Bible, memorabilia from his days with the Highwaymen, the Cash family piano, even his birth certificate. Two recent additions are Cash's first gold record, \"I Walk The Line,\" which is now certified double platinum, and \"The Man In Black\" exhibit which focuses on Cash's all-black look and his history with the man who helped him create it, Manuel Cuevas. Other sections of the museum are devoted to Sun Records, the Memphis label that helped launch Cash's career, along with the careers of Elvis Presley, Roy Orbison and Jerry Lee Lewis, an exhibit that focuses on Cash's TV and movie career and the Patsy Cline Museum, which is located on the second floor. The Johnny Cash Museum has received numerous accolades since its opening in 2013, including \"No. 1 Must Visit Museum for Music Lovers\" by Conde Nast Traveler and \"No. 1 Must See Nashville Destination\" by Forbes magazine and \"Best Culture Stop in Nashville\" by Money magazine.",
  "This is a fantastic museum located downtown and should be seen by any music fan and should be required for any Johnny Cash fan!!  Well rounded exhibits spanning his career and a great gift shop up front!  It's associated with the Patsy Cline museum so have a wonderful afternoon and see both!!",
  "Could not believe how much we didn't know about Johnny Cash. The Museum is great with lots of videos, music and memorabilia. It's a little pricey but if you roll it into the hop on hop off trolley it's not bad.",
  "If you are a fan these exhibits bring back great memories of Johnny Cash.  If you are not a fan or have not followed him you will see enough to give you an education if you are open and have a desire to learn. It is small compact and a little dark.  Kids would not enjoy.  Location in downtown near the Broadway glitz so no on site parking and the lots are $17.00 for 2 hours.  Since there is plenty to see in the area a hop off and on trolley will allow you to hear and see a lot of the sites.  With parking so expensive tours and trolleys are a good alternative to driving downtown.    ",
  "Location wise it's right in the center of the action Downtown. We knew it wasn't the largest space inside so when we tried to go at 1.30pm on a Saturday and we saw the line to enter the museum part we thought it best just to collect our tickets and if they didn't have a specific time or date on them to come back another time since the museum is open until 7pm. Tickets are around $19 but there was a sign that if you had a ticket stub from the Ryman Auditorium you'd get a discount to the museum. We had the Nashville Music Attraction Discount Pass package deal which included the Ryman, Johnny Cash Museum, CMHFM and Studio B so we didn’t buy the tickets at museum we just collected them. Instead of joining the line and entering the museum part we took that time to look around the gift shop and there were some great t-shirts for adults and fun baby clothes. I found the range in quality in the t-shirts varied though. There's also a cafe there where you can get a Man in Black coffee. When we returned we came back two days later we came at 9am just when it was opening so there were no lines, we were the first ones there. For the size of the place it really is an impressive collection of memorabilia and personal effects, goes through the different decades, moving from Johnny as a young boy with childhood report cards and yearbooks and photos to his time in the military and really personal items like love letters to his first wife into his music -framed gold and platinum albums, photos,outfits and lyrics. Alongside interactive displays to listen to his music and watch performance highlights  there's a section dedicated to his on-screen film appearances and television cameos shown on a loop. And there's a section for the Walk the Line film.You can also get a souvenir photo with the man himself in a choice of two poses for around $20. It really is a story of a life, a fitting end is his video of Hurt, left a lump in my throat and was a beautiful end to my visit. A must for Cash fans. But my advice, get in early as because it's small and fills up quickly, you'll spend some time waiting on some of the interactive exhibits. We spent 2 hours there. And check out the size of his shoes!!",
  "I have always been a fan of Johnny and this museum did not disappoint. It is a quint place, with so much of his story, and his contributions to the music industry. The wall of records and awards is so impressive-also to read about how many other musicians have covered his music! For sure my favorite part was the room with the chair from \"Hurt\" and the corresponding video of the song- so powerful-stayed in that room for quite a while.  You can easily do the museum in an hour.",
  "one of the true ledgends of our time seeing all theitems about him and remembering seeing him live at western springs nz many years ago",
  "We enjoyed a chance to view Johnny Cash's career and personal life.   The museum doesn't take long to walk through but the exhibits are well done.  We ate lunch at the cafe and were pleased.",
  "I will be honest, I am not a huge Jonny Cash fan but this museum was well done. It was fascinating to see his life and career. I really enjoyed the museum and the videos they had playing. This was entertaining. I may even be a bit more of a Cash fan now ;). ",
  "In a relatively small space the life of Johnny Cash came to life.  The exhibits were well done with great explanations.  Thre progression was from early to late with seating areas to watch videos.  Music was well amplified but not deafening. I learned so much about someone I thought I knew lots about already."
 ]
},{
 "name": "RCA Studio B",
 "address": "1611 Roy Acuff Pl",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/27/36/44/20160125-142351-largejpg.jpg",
 "tags": [
  "tour",
  "knowledgeable",
  "tour",
  "music",
  "history",
  "tour",
  "music",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "music",
  "music",
  "tour",
  "knowledgeable",
  "tour",
  "tour",
  "knowledgeable",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106495-Reviews-RCA_Studio_B-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our guide was very entertaining and knowledgeable and made our tour so enjoyable seeing where so many artists have recorded records was a wonderful experience and we got to record a song in the same studio where Elvis recorded wow!!!! We were given a cd of our recording as a souvenir what a wonderful surprise ",
  "As a life long western musician, I can't even begin to tell you how much I could literally feel and hear the walls talking in this legendary place.  All the greats have recorded here, many of them recruited by legendary guitarist Chet Atkins . . . Waylon Jennings, Eddy Arnold, Bobby Bare, Jim Reeves, Floyd Cramer, The Everly Brothers, Don Gibson, Hank Locklin, Roy Orbison, Dolly Parton, Charley Pride, Boots Randolph, Hank Snow, Connie Smith, Marty Stuart, Porter Wagoner, and the King, Elvis!  In fact, some of the biggest and most significant songs in music history, country or otherwise, were recorded here, including \"Are You Lonesome Tonight\" by Elvis, which was recorded in a single take in complete darkness with Elvis, the musicians, and backup singers the Jordanaires all placed very specifically in the room.  The tour guide was absolutely fantastic and wealth of knowledge, let alone entertaining.\n\nSome great old instruments in the room, including a showroom new condition Fender '59 Bassman amp, a war-vintage Steinway piano that Elvis and Jerry Lee both played, and an old 1800s upright saloon piano that Waylon loved and used on several of his recordings.\n\nTakes about an hour to go through this guided tour and it's worth every minute of it.  I could have just sat in that room and strummed my guitar for hours just thinking about the company I would be in the presence of throughout time.  Don't miss it!\n\nDo the bundled tour with the Country Music Hall of Fame, as there's an easy shuttle bass that takes you back and forth between the two places.  The studio is located within the part of Nashville where all the big record companies and working studios still reside today . . .",
  "We purchased this tour with our tickets to the CMHF. It included bus transportation and a very knowledgeable tour guide who filled us in on many interesting facts about Nashville, Studio B and the important roles both played in music history. Very interesting and enjoyable.",
  "Try to go after you tour the museum. It is a short bus ride away and very worthwhile",
  "Sit in the very same studio the country music stars recorded their songs and albums in the 50's, 60's and 70's.  Elvis recorded 1/2 of his songs in this studio.  The tour guide was excellent in providing stories of the many stars who cut albums in this studio and where in the studio the stars sang their tunes to get the best sound. The tour last 1 hour and tour members are allowed to take pictures. This attraction is in conjunction with country music hall of fame platinum ticket only.",
  "Quite an informative visit. So many amazing musician and songs came out of this place.  It's certainly worth the trip, and the people from the Country Music Hall of Fame actually take you there, so you don't have to worry about driving  Nashville. ",
  "Our guide around the studio was called Ron, and he was so enthusiastic and knowledgeable that he made the whole tour a pleasure. Nice that the original studio has survived all these years and that the original pianos, and microphones are there for photo opportunities. The finale in the studio itself when Ron turned the lights down and played Elvis in the dark was almost emotional",
  "We missed this tour the first time around--don't make that mistake!  This gives you lots of behind the scenes information you would not otherwise get.  Sign up now!  Great tour guide!!",
  "The guided tour here is worth every penny and then some!  I had no idea how many amazing entertainers recorded here.  The guide was very knowledgeable and the stories he told enriched this experience wonderfully.",
  "If you get to Nashville go to Studio B and take the guided tour.  A great experience as we were lucky to have Ron as our guide whose knowledge and passion for the subject was truly exceptional. Full of interesting anecdotes and insights into the myriad of songs and artistes who have recorded there over the years majoring on Elvis of course. ",
  "Great experience overall! Our host Stephanie (RCA Studio B) was fantastic. \nUsing Tripadvisor was smooth and an easy process."
 ]
},{
 "name": "Gaylord Opryland Resort Gardens",
 "address": "2800 Opryland Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/c7/ac/33/opryland-resort-gardens.jpg",
 "tags": [
  "tour",
  "walk",
  "walk",
  "walk",
  "walking",
  "walking",
  "walk",
  "free",
  "walking",
  "walk",
  "eat",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d592251-Reviews-Gaylord_Opryland_Resort_Gardens-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "We did not stay at the Gaylord Opryland Resort Gardens but rather just visited to see the decorations for Christmas and tour the property.  Wow!  It is amazing - the intricate and well maintained gardens, water features, and many restaurants were simply breathtaking.  The Parking was over $30....but, you could also walk to the outlet mall, if you wanted to brave the wind and rain the day we visited, and overall was easier to use than trying to find parking in other close locations.  We will be back again to this location.  ",
  "Visited with out of town visit on a Thursday evening \nThe gardens are beautiful to see\nA must do when in Nashville \n\nTip park at mall and walk over",
  "While we are not touristy people, everyone said a visit to this hotel to see the decorations was a must. Lord, were they right! The atrium area is huge with thousands upon thousands of plants that are native to the Mississippi Delta. There is a river running through it all and when you layer the gorgeous Christmas decorations, huge decorated trees, hot air balloons, and other eye-popping glitz on top of it all, it's a sight to behold. Walk past all the kiosks and shops wanting your money for overpriced drinks and merchandise and enjoy the beauty of the surroundings.",
  "Three huge glass roofed conservatory style areas with waterfalls, towering trees, huge vines, and even a boat ride. Don't park yourself, because you'll be walking a good distance and the valet service is about the same price. ",
  "The Gaylord Opryland Resort Gardens is a must see if you are in Nashville. You don't have to be a quest there it is open to the public. It is all indoors and be prepared and have your walking shoes on. The place is huge. It even has a river running through it. At Christmas time the decorations are just specular. We actually got lost in here and had to ask to find the entrance where we were dropped of to get in.",
  "We went early one morning, and it was quiet and lovely to walk around all of their Atriums. To avoid the parking fee, park in the back of the Mall where you see the large brick wall. Walk across their lot, over a little foot bridge and on into the nearest entrance to the hotel. ",
  "This is a real wow!  We had a chance to visit this beautiful facility during the holiday season. The outside ice ring was jammed the inside decorations were superb. This was worth the trip to Nashville by itself. There are several eating facilities for any palate.  Convenient and free parking",
  "We've traveled to 18 countries, and have stayed at all types of hotels. We've been attending an annual convention at the Gaylord Opryland Hotel for 20+ years, yet this place still takes my breath with the beauty of the plants and water features. It was updated in 2019 (maybe 2018), keeping the charm of the original hotel with elegance and comfort. You truly have to see this place to believe it!",
  "ONLY if you're into walking all over the place looking a tropical lushness and landscape architecture will you be interested in this place; otherwise, check off the square by sticking your head in the door and taking a BRIEF walk around - it's the same averywhere you go, unless you're really into it.  FURTHER - save yourself $35 by not parking there!  Go to the outlet mall just south of there (just follow the sign like you're going to the hotel) and park on the north side of the mall and walk over (better yet) just have somebody sit in the car while you run inside and take a quick look!  OR, for example, if you stay at the Hyatt Place, they'll shuttle you over and back.",
  "This was my fourth Convention stay at Gaylord Opryland Resort.  It is a beautiful hotel/resort.  Hard to believe that it is all under one roof.  Lots of things to see and do there.  Lots of good resturants, make reservations in advance or plan to eat early to beat the crowds.  The reason for a 4 instead of 5 is that it is very challenging to find your room and finding different locations.  Lots of walking! Yes they have maps... but still confusing.  Also, checking in is usually a long wait. ",
  "Beautiful hotel with lots of inside greenery and water features. Great convention hotel. Check in was fast. Check out no so much. Good restaurants. Bed was comfortable and decor fine. Very small closet space.  Housekeeping cleaned my room while I was out even though I had called and told them not to and had a “Do Not Disturb” sign on my door."
 ]
},{
 "name": "Musicians Hall of Fame and Museum",
 "address": "401 Gay St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/4c/dd/9e/musicians-hall-of-fame.jpg",
 "tags": [
  "music",
  "history",
  "music",
  "walking",
  "history",
  "music",
  "music",
  "history",
  "walk",
  "walking",
  "knowledgeable",
  "music",
  "learn",
  "history",
  "tour",
  "knowledgeable",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d621531-Reviews-Musicians_Hall_of_Fame_and_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Musicians HoF is a marvelous musical experience. The highlights are tributes to a broad spectrum of artists and the players that backed them; (eg - The Funk Brothers backing Motown artists) a history of the Grammy awards, major tributes to artists such as Ray Charles, Jimi Hendrix, and Johnny Cash; a chance to sing and play some instruments; and a dazzling collection of musical instruments and artifacts used by these artists. They also offer a photo op that you can send to your email & friend's email for no extra charge. All of the staff were friendly and helpful, particularly Sam and Jeni who were fabulous. Groupon is offering a nice discount on adult tickets for $14.40. If you're a music hound like myself prepare to spend two hours here. Nice job MHOF!!",
  "If you want to see the history of the unsung heroes of your favorite recordings, along with some great exhibits of amazing artists, this museum is on par with the Rock Hall of Fame, Country Music Hall of Fame, and others in that league. The new Hendrix exhibit from his time in Nashville and more is a real stunner. Walking through the semi-truck trailer mobile recording studio exhibit and seeing the amazing records made in that trailer is awe inspiring. The instruments from The Wrecking Crew musicians, Motown, Stax, Sun, and so many others are delightful priceless bits of American history. There is a lot to see here for real music lovers and even casual fans.",
  "From the brief introduction movie, narrated by Duane “Guitar” Eddy, this venue will have you loving every second of your decision to make this a stop in your Nashville visit. You will be shown, through static display, archival still photos and videos, how and why we have come to our love of music. Most all the musical greats we know and love are represented here, from Elvis Presley, Johnny Cash, Carl Perkins, Jerry Lee Lewis, The Beatles, The Rolling Stones, Jimi Hendrix, The Beach Boys, Motown greats, Nashville stars, the list goes on and on. Skip the much heralded Johnny Cash museum and see the Cash display here. It is phenomenal and there is plenty of room to enjoy it. The beginnings of Rock & Roll are explored with the Sun Studio and Stax Records exhibits. Plan on being here multiple hours as you become enchanted with the “back story” of chart-topping singles.  Any appreciation for music and songs of all genres that move you require that you visit this venue. You won’t be disappointed. ",
  "The Musicians Hall of Fame goes beyond the typical Country Music history that you might expect of Nashville, and is the lesser-known, multi-genre equivalent to the Country Music Hall of Fame. We visited here with friends who were not Country fans but liked the idea of some music history.\n\nDo not be put off when you walk in - once you have found your way to the entrance (tucked around the back), you are greeted by a large, fairly empty space. It was very quiet when we were visiting. \n\nAfter entry, you wait to be taken through to a video which gives a brief history of music in some key areas - Nashville, Memphis, Atlanta to name a few, Then you leave and enter the museum itself, which is a far cry from the emptiness in the entrance! \n\nThe walls are packed with memorabilia and information, and the museum is roughly organieed by \"sound\" or genre of music. I think our younger friends would have liked more current musicians featured, as the museum definitely focused on 30s-60s as its key time frame, which might not necessarily have been clear from the name. Definitely covers classic artists!\n\nThe highlight for us was the new Grammy exhibition where we spent most of our time. This gives you a chance to play instruments, experiment with distortions and other features, sing, be a sound engineer or mixer and have a drum lesson from Ringo Starr! The exhibit is really new but is sure to transform the museum. It is very interactive and will appeal to younger visitors.\n\nWe hadn't really planned to visit here but I am glad we did, especially the Grammy section.\n\n",
  "We accidentally ended up here but loved it. The information was so interesting and the displays excellent. We loved the interactive section. We were able to goof around and pretend we were in a band. Silly but fun. The girls running it were exceptionally friendly and helpful. We used Groupon and got a good discount. So much information. Give yourself a few hours as there is plenty of reading to be done. ",
  "This music museum takes such a different approach to the music museum. Most music museums focus on bands where the frontman/signer is the focal point, but this museum gives you the the true history of the musicians and their instruments behind the songs. When walking through this museum, you will be amazed at how many songs you will recognize and then be surprised to see the actual instrument that was used on that song. Even more amazing than that, you will see that most of those same instruments were used to record other songs you've heard by completely different artists. But the instrument is only the visual part of the story. Being able to learn about the musician that owned and played the instrument, and to see that they had such a wide and diverse range of musical talent to be able to play country one day and then R&B or rock n' roll the next is truly amazing and interesting. The museum is large and you really need to plan a couple of hours to be able to see everything. The museum staff is friendly and knowledgeable. The museum does not have on-premises parking, but parking is within a block of the museum.",
  "This museum is well laid out and the exhibits are very thorough, and rich with artifacts and information. \nThere were lots of odes to those who helped propel to the limelight the many celebrities we've come to love.  Not to be missed is the Jimi Hendrix Exhibit.  Best part of our tour! ",
  "There were not many things open when we were in Nashville, but we were warmly welcomed at the MHFM. The staff was excellent and knowledgeable.  We enjoyed playing on the instruments, visiting the displays, and pretending to record ourselves.  The Johnny Cash display was our favorite!",
  "This is a great place for music lovers to get totally immersed. It covers many music genres and had so much memorabilia to look at. The best part was the interactive area where you could make recordings, play instruments or help write a song. The staff were really engaged, you could tell they loved being there too. Highly recommended!",
  "We absolutely loved our visit. Such a wide variety of artists are represented. The interactive displays are very well done. My son sat down and played keyboard. The founder was very friendly and has so much knowledge. A++",
  "Wasn't expecting much, but it was a fun, informative, interactive museum.  Great memorabilia and info"
 ]
},{
 "name": "Nelson's Green Brier Distillery",
 "address": "1414 Clinton St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/1b/00/79/the-distillery.jpg",
 "tags": [
  "tour",
  "tour",
  "family",
  "history",
  "tasting",
  "tour",
  "learn",
  "family",
  "history",
  "drink",
  "tour",
  "tasting",
  "tour",
  "history",
  "tour",
  "history",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "knowledgeable",
  "history",
  "family",
  "delicious",
  "drink",
  "tour",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d7305616-Reviews-Nelson_s_Green_Brier_Distillery-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great tour, great guide, great whiskey, great time!!\n\nThanks for the hospitality, and the education and welcome back!!",
  "We decided to stop by Nelson's Green Briar Distillery while visiting Nashville for the weekend.  It is definitely worth checking out and for those who qualify, they offer a military discount.  Staff was friendly and Ben, our tour guide, and did a great job explaining the family history of the distillery, from founder Charles Nelson, his wife Louisa, to the great great grandsons who reopened the current distillery.  Got to see the actual distillery operation and Ben even offered to take photos on your phone for all who wanted one by some barrels with a backdrop of the Tennessee state flag.  The tasting was great and the gift shop had lots of options for purchase.  We would definitely recommend stopping by!",
  "I was just in Nashville for my family’s 50th family reunion, and I told my father I had been wanting to go to a whiskey distillery to learn about the history of whiskey making and have a touring. I don’t drink but was a sport and tried some of the samples. We had a great tour guide, Joe, who had a wealth of knowledge to share and really drew the crowd in, sharing with us the history of the Nelson family and, also, providing us with the differences in bourbon vs. whiskey and how the curing process has everything to do with it, rather than the age-old Kentucky vs. Tennessee argument. Needless to say, I had the best time! Thank you so much for sharing your space with our group and giving us a great time!",
  "We had a great time at the tour. It's a well curated distillery with a fascinating story. Dylan did a great job as our guide (dont forget to buy a cocktail to take with you in the tour) and the tasting was yummy!  Highly recommend!!",
  "My husband and I enjoy touring breweries and distilleries and the like. This was the best tour we've done! The history and stories behind this place are so interesting. Highly recommend!",
  "I came here as a stop on a Nashville whiskey and beer tour. Our tour guide, Dylan, was super funny and knowledgeable about the amazing history of this place. I learned a lot and really enjoyed the tasting at the end. Thanks, Dylan!",
  "Great history lesson. Really interesting family history. Small distillery and not where the majority of their bourbon is sourced. BUT....The main “flavor” of the tour of course is the  tasting of the fruits of their labor.  Bellmeade Bourbon and TN Whiskey are very good pours. Louisa’s liqueur is quite delicious. Some of the smoothest I’ve had for sipping a nice smooth drink. The finish is pretty good after the first “chew”. Really like it. \n\nThe only reason I gave it 4 “stars” and not 5 is that there is an overlap in the tour with another group. As one group is coming in the same room as the tasting room the previous group is in the tasting room too. The tour guides (by the way very knowledgeable and informed folks) simply couldn’t be heard well because of the other group leader trying to talk too. Otherwise a short and sweet but informational (and tasty) tour in the TN bourbon and whiskey tour. ",
  "Great Experience! \nOur tour guide, Kyle, was exceptional and very knowledgeable. There was not a question he could not answer. Such a fun afternoon!"
 ]
},{
 "name": "The Parthenon",
 "address": "2600 W End Ave Centennial Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/60/59/40/side-view.jpg",
 "tags": [
  "history",
  "tour",
  "unique",
  "parks",
  "free",
  "art",
  "art",
  "structure",
  "history",
  "free",
  "family",
  "eat",
  "walk",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106498-Reviews-The_Parthenon-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Yes it’s an exact replica of The Parthenon at Greece!... Made with the same Patience, Artistic Excellence and knowledge about the the then History and Cultural expertise, Parthenon is a treat to Watch and adds to the many Attractions to the Beutiful City Of Nashville.A very Green, Calm and Picturesque Location at Centennial Park the Parthenon houses the Greek Goddess Of Victory and other Replicas Of Ancient Greek times. It also houses a good Sovenighr Shop.",
  "The Nashville Parthenon sits in one of our premier parks, Centennial across West End from Vanderbilt. We have free concerts on the summer weekends, running trails and a unique model of what the parthenon would have looked like...a hidden gem is the tour inside that finishes with the statue of Athena \nIf you’ve ever seen the ruins in Athens this is a real treat",
  "I myself had first visited the Parthenon  in 1963 but never entered it and this was my wife,s first visit to the States. Inside the building there was a  worthy exhibition of American art /Greek artifacts and the story of why and how the Parthenon was built plus an enormous statue of the goddess Athena(most impressive) and well worth a visit and of course it is set in the wonderful Centennial Park",
  "It's worth a stop to check out. Very cool history about the original purpose of the structure which was for the Tennessee Centennial Exposition.\n\nThe building built in 1897 is a full scale replica of the original in Athens Greece. A replica of the original 42 foot statue of Athena Parthenos is the centerpiece.\n\nThe building now serves as an art museum, displays history of the building & gift shop. This is a piece of Nashville's roots that most would enjoy. Younger visitors under 5 maybe not so much. \n\nAdmission is $6 for adults, $4 12&U, FREE military and their families. ",
  "Nice park and really cool replica of the Parthenon but not a must do in my opinion. Aside from the small museum there is not much to see. ",
  "My family and I thought this was a really cool replica. We liked the museum inside, but it was not necessary to see. Even just stopping outside the Parthenon for a picture would be good.",
  "A beautiful building and park.  Such a peaceful place to eat lunch, walk or just relax from a busy day.",
  "The architecture of the building is amazing the statue it's something you just sit and look at every detail is beautiful. It's in a beautiful park where you can spend half a day between the art museum in the park it's a really nice outing worth the trip"
 ]
},{
 "name": "Ole Smoky Distillery",
 "address": "423 6th Ave S",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/54/15/81/getlstd-property-photo.jpg",
 "tags": [
  "tasting",
  "tasting",
  "tasting",
  "delicious",
  "tasting",
  "tasting",
  "food",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d17406536-Reviews-Ole_Smoky_Distillery-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Zane is the best!! Thanks for an awesome tasting! All of the flavors were so different and fun! Everyone should come visit Ole Smoky Distillery!",
  "If you're in Nashville come visit Josh, Jeremy, Olivia, Janis, Amber at Yee Haw for the moonshine tasting (it's only $5!!!🤯)🤩😝🥳🎉😂 \n#goodtimes #greatservice #sharegoodstuff #thanksjosh #wheninnashville",
  "We flew in from Canada and came in the morning on the honky tonk and loved it so much we came back at night. John L. took us through the taste testing and did an amazing job, he made it so fun and interactive. I would recommend him and the taste testing of moonshine to anyone coming to Nashville!! Also highly recommend the pickle shot the pickles are out of this world! Thank you to John L. And the rest of the staff here. ",
  "My friends and I had an excelled time at Ole Smoky Distillery we actually went back a second time. We did the moonshine tasting the second visit and had an outstanding experience with Chance! He was funny, lighthearted, and we had a good time. Delicious moonshine ☺️",
  "Leilah was AWESOME!! I hope I didn’t butcher the spelling of her name, I have it on a card but couldn’t find the card ( I am pretty sure she wrote Leilah Jane on it), that’s what took me so long to write this, I didn’t want to spell it wrong.. \n\nWe were there about a month ago and she was just really wonderful! She explained what we were tasting, gave us room to taste it but was close enough by to answer any questions and really paid attention to what we were asking and chatted with us.  She really made it a fun experience.",
  "We had a moonshine tasting with Mary Kate.  She was informative and entertaining.   The venue was spacious and inviting.   I can't wait to return again",
  "Caleb was super nice!! He treated us well, told us where to go and what to do with all this COVID19 craziness",
  "Our experience at Ole Smoky Distillery was incredible. I went with three of my girlfriends and we kept coming back for a few nights! Our bartender Caleb was very welcoming, outgoing and made sure we had a fantastic time. You could tell he really enjoyed his job and wanted to make sure we were accommodated and having a great time. We did the moonshine tasting a couple of times and it was so fun. The food and entertainment was great as well!"
 ]
},{
 "name": "Cheekwood",
 "address": "1200 Forrest Park Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/65/10/8e/cheekwood-botanical-gardens.jpg",
 "tags": [
  "art",
  "historic",
  "family",
  "tour",
  "tour",
  "knowledgeable",
  "food",
  "walk",
  "tour",
  "walk",
  "tour",
  "walk",
  "tour",
  "food",
  "kids",
  "art",
  "art",
  "art",
  "art",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d109248-Reviews-Cheekwood-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I didn't know what to expect when we researched the Cheekwood Botanical Garden and Museum of Art in preparation for our visit to Nashville, Tennessee. Well, Cheekwood is a handful, an all-day attraction that just keeps giving...a 55-acre estate, a 30,000-square-foot Georgian-style mansion, an art museum with 600 paintings and 5,000 prints, drawings and photographs, a sculpture trail with 15 sculptures by international artists, a botanical garden that extends across the entire estate, a souvenir shop and a restaurant. If you enjoy architecture, contemporary and decorative arts, plants and flowers, you've come to the right place. Located at 1200 Forest Park Drive, on the western edge of Nashville, Cheekwood formerly was the residence of the Cheek family, which founded and developed a very successful wholesale grocery business in Nashville in the 1880s. After a member of the family created an acclaimed blend of coffee called Maxwell House, the family sold their business for $40 million in 1928. The enormous and luxurious limestone mansion, inspired by the grand English manors of the 18th century, and the extensive formal gardens were completed in 1932. The museum was opened in 1960. Today, visitors can our the mansion and view the original furnishings, woodwork, marble floors and artwork, then tour the museum with its American art, the world's largest collection of sculptures of William Edmondson, photographs by Louis Dahl-Wolfe, post-World War II prints, the third largest Worcester porcelain collection in the United States and a 650-piece silver collection spanning the 18th, 19th and 20 centuries. The contemporary art collection is housed in galleries created out of the estate's original garage and stables, including paintings by Larry Rivers and Andy Warhol.  While strolling across the grounds, you can see boxwood, conifer, daffodil, dogwood, fern, herb, holly, hydrangea, magnolia, redbud and Japanese maple. There is so much to see. Take a lunch break at the Pineapple Room restaurant, which overlooks the vast west lawn. Cheekwood was added to the National Register of Historic Places in 2000.",
  "Beautiful grounds, and an impressive old mansion give you an idea on how the Maxwell House coffee people lived.  Built in a time when people with money knew how to live.  The legacy today are the grounds and gardens.",
  "I thoroughly enjoyed my self-guided tour of Cheekwood Mansion & Botanical Gardens, and recommend it to anyone who finds such an outing to be interesting. The staff was knowledgeable and able to answer my questions.   There were numerous restrooms. Good trolleys ere located in front of the mansion. I imagine it will be gorgeous when the plants are in bloom. It was worth the $20.00. ",
  "Absolutely perfect for a storybook wedding and reception.  Wear comfortable shoes because there's a bit of a walk from the parking area to the outdoor wedding site and then to the reception area.  The food was wonderful.  Perfect for a small wedding.",
  "Mansion owned by Maxwell House coffee pioneer, and was built during depression for millions, no expense was spared. Take the tour of the home to find out how the rich lived during the depression era. Wear comfortable shoes to walk the many beautiful gardens around the mansion. Don't miss the stables and cafe to the side of the mansion.",
  "Mansion owned by Maxwell House coffee pioneer, and was built during depression for millions, no expense was spared. Take the tour of the home to find out how the rich lived during the depression era. Wear comfortable shoes to walk the many beautiful gardens around the mansion. Don't miss the stables and cafe to the side of the mansion.",
  "Such beautiful gardens. The nighttime tour was amazing the mansion was decorated perfectly. Lots of photo opportunities. There were food trucks and a s’mores station. Santa for the kids!  Awesome experience.  I can’t wait to see the Chihuly exhibit and hope to see the tulips next spring!",
  "We visited on a cold and rainy day in February.  The property is large, well kept and amazingly beautiful.  \n\nWe were warmly welcomed as we wondered this wonderful estate.  \n\nThe day we visited there were only a handful of other visitors so we felt like we had this place all to ourselves.  They have a small but very nice orchid garden inside.  After a few minutes of enjoying the sights and sounds (a running water fountain) we wandered upstairs to see the Tennessee Middle-State Art Contest Winners, which was not only very artistic but very thought provoking.  We also really appreciated the architecture and the lights as we walked down the stairs to continue exploring the property.",
  "Thre house and grounds are spectacular.  Although we were too early for tulips, the yellow daffys were stunning. \nThe house is furnished in areas but also serves as galleries.  There were 2 shows when we visited, and thre student scholastic show was amazing.  Showcasing young talent make one hopeful for the future of art. ",
  "The grounds are a work of art literally. Art sculptures, bridges, ponds and creeks, vistas, train sets, tree houses, and plants galore make each turn an experience. I would allow two and a half to 3 hours to really enjoy the grounds and visit the house. The house is furnished as it was when the Cheeks lived in the home, and there is usually an art exhibit upstairs.",
  "This lovely old home has been lovingly restored and furnished with many original pieces of furniture, books and artwork. A student art exhibit was being hosted when I toured, as well as an exceptional exhibit by a professional artist. Sadly, the day was cold and grey and the sculpture garden trail was being expanded, so I missed that. Still, the view from the balcony was beautiful. Would love to return when the flowers are blooming - or with kids to the children’s garden which should be fabulous. Cafe was nothing special, although it is housed in the very nice restored stable block."
 ]
},{
 "name": "Nashville Zoo",
 "address": "3777 Nolensville Pike",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/bb/77/a1/white-rhino-photo-by.jpg",
 "tags": [
  "family",
  "food",
  "kids",
  "drink",
  "kids",
  "walking",
  "kids",
  "walking",
  "food",
  "active",
  "walking",
  "walk",
  "active",
  "cheap",
  "kids",
  "walk",
  "unique",
  "walking",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d108396-Reviews-Nashville_Zoo-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "This zoo is about the perfect size for a family to see easily in a morning or afternoon and it has the best playground ever.  The carousel, the train and zip line all make the day even more fun, although tickets are required for those rides beyond the admission price.  The grounds are clean and easy to navigate with strollers.  Lots to see and do there.",
  "We love this zoo for so many reasons and we go often. First its new, so the means of display and quality of life for the animals is up to date. So much to see and do with tons of food, drink, and snack choices along the way. The layout is awesome and you never feel like you are lost. Check out the huge jungle gym, which even has opportunity for the kids to climb rope nets suspended over water! Only one exit so a great spot for parents to rest. Check out the farm, the elephants, the indoor and outdoor aviaries, the amazing fish and reptile house, pet the farm animals, go inside the kangaroo space.....so much to do!!! So yes, come and love on all that Nashville has to offer, and make it a point to come to the zoo! Visit early....it will be less crowded and cooler!!!!",
  "So we visited the zoo in the morning, which was a great time to go, cooler, not as many people, etc.. The animal exhibits was great with lots of variety and fairly easy to get around. Wish we didn't have to pay for parking, $5. We did pay for extras, we got $13 worth of tickets, which we used for the Carousel, the kids went twice and adults weren't charged, the little train, also only had to use tickets for kids (train ride was very short and although kind of interesting for young children, would be disappointing for older kids). The kids also loved the area called The Jungle Gym, which has lots of jumping, climbing, sliding and other areas of fun and there is an area just for toddlers and an area for preteens and teens. Make sure you take water bottles as one of the only water fountains is in the reptile house, this is also where the best bathrooms are.",
  "The Nashville Zoo was pretty good. They charge $5 for parking if you're not a member. That is a rip-off; just an upcharge to the admission. Senior admission was $13; regular was $15. That seems OK, but hope it isn't much higher in the future. The best displays were in the reptile house. It can get a little crowded in there on a Sunday afternoon, with lots of kids pressed up against the glass. And its dark so watch your step. We also enjoyed the elephants and giraffes. There is quite a bit of walking on hilly terrain, so bring your comfortable shoes.",
  "This zoo is very nice.  It is clean and well marked, with lots of animals and exhibits.  There is a lot of ground to cover, so bring your walking shoes.  There is an entrance fee and a parking fee and once you are inside you can by food, snacks and drinks ant many food carts, although the prices are really steep.  You are allowed to bring in your own drinks, which is nice.  The animals are usually more active in the morning but the cages are set up so that you can usually see them all day.  We will probably go back.",
  "I was quite impressed with the exhibits, the size of them and how they were made to be somewhat like the natural habitat of the animals.  The grounds themselves were also well done...in a city like Nashville which has a lot of noise and is go-go-go, it is nice to go to a place that feels like a bit of an escape from the city.\n\nYou will have to pay for parking when you pay for your zoo admission (only $7...quite cheap compared to a few other zoos).   \n\nWe went on a Saturday...if you can, go on a weekday.  \nAs for when you go, there are a number of reasons to come first thing in morning on any day: the lines when we arrived at 930 moved quickly...about a 5-10 minute wait to get into the zoo.  As we were leaving at around 1230, the lines were fairly long (looked to be about a 30+ minute wait to get in).  As the crowds grew in the zoo itself, it became harder to see the animals as well.  A lot of the animals were also eating first thing in the morning and are more active in zoos in the cooler part of the day.  \n\nOne of the tough parts about this zoo is the layout.  There are basically two loops which both lead you back to the gibbons which are close to the main gate.  This isn't the most convenient as you end up walking to the same space you have already seen...but the overall quality of the zoo and exhibits made it worthwhile (it looks like they are in the process of opening up some short cuts soon).\n\nThe first loop on the right includes the large animals (giraffes and zebras) as well as the new Veterinary Center.  It is a bit of a walk to get up to the Vet Center but worth it.  Ask at the main gates when arriving if they have any scheduled check ups with animals.  We saw them doing a check up on a snake and turtle.  They also have the baby clouded leopards up there as well to see (it’s worth the 5 minutes to walk up there).  They have a couple of staff up there to also tell you what is going on in the procedure rooms and answer questions.\n\nThe second loop includes the main bulk of the zoo animals.  Check the schedule for the amphitheater show...it is only about 30 minutes long and very entertaining and educational.  The Unseen World building can get quite crowded which makes it hard to see the reptiles and fish.   If you are walking by and there doesn’t seem to be lines, head in then as later in the day the crowds make it difficult.\n\nYou can head either way around the second loop and still see all the animals.  The exhibits are nice as they are made to look natural.  All of the trees and plants add to the environment of the zoo.  Even though you are in a large city, it is quiet and a relaxing space.  Once again, the crowds do get larger as the day progresses so go earlier so you can enjoy the setting.   The Andean Bear exhibit is up for exhibit of the year...make sure you vote for it on 10best.com.  \n\nThe kangaroos exhibit is worth walking through.  You stay on the path and if they come near you you can pet them.  We got to pet one that was laying on the path...they are surprisingly soft...like super soft!!  You may have to wait in line to pet them but it is worth the few minute wait.\n\nThe gift shop is quite large, reasonable prices and has a wide selection of things for kids, adults, clothing and even things for your home.  It is worth popping in to take a look (unless of course you have kids with you and you are not wanting to buy yet another stuffie).  I suggest buying a postcard of the zoo and writing what the highlights of the zoo were...just a simple little souvenir. \n\nThe new Tiger area should be opening up close to May...when we were there in early April, the tigers had just been introduced to their new exhibit.",
  "I spent over $200.00 on souvenirs for my grandkids. But was not told until after the purchase that they no longer used plastic bags. I could have purchased their cloth bags, but was running low on money at this point. It was ridiculous. They should keep politics out of the zoo.",
  "I understand that there is not much that can be done with the covid 19 happening, but when we entered the zoo, no one informed us that nothing was open. So basically we paid to walk around and look at grass. All the inside attractions were closed and there was no animals outside. Im disappointed because they should have informed us at the gate so I could have gotten my money back and did something else that day.",
  "We had a great time.  Thoroughly enjoyed the lorikeets and other animals.  Beautiful site with plenty of room for animals to roam.\n",
  "Just loved some of the habitats the animals lived in. It was so amazing being close to the kangaroos.",
  "Had some unexpected free time during my Nashville visit so decided to check out the zoo since the weather was nice.  Was a fun zoo to visit as many of the animals were out and about that day.  They also had some activities and rides parents may enjoy (not just for little kids).  Only concern I had was that some of the exhibits were a little too far spread out and there were no exhibits along the way so you are just walking along bamboo trees.  Most unexpected part for me was a guinea pig village.  Must have been over 30 of them in the enclosure  frolicking here and there.  There is also a rope bridge near the monkey area that I sensed local kids are well aware of given how many times I overheard kids talking about the rope bridge all over the zoo.  It was indeed a unique experience and set up to be very safe (kids won't fall in...but your cell phone might if you drop it).  Overall a great experience."
 ]
},{
 "name": "Centennial Park",
 "address": "2500 W End Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/59/2b/1b/centennial-park.jpg",
 "tags": [
  "art",
  "eat",
  "tour",
  "walk",
  "free",
  "walking",
  "art",
  "music",
  "food",
  "family",
  "kids",
  "kids",
  "delicious",
  "free",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d105780-Reviews-Centennial_Park-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a beautiful piece of greenery to spend a sunny afternoon!  Sure, the biggest attraction is the replica of the Greek Parthenon with all the incredible art and an excellent gift shop.  But, for locals, I can think of no better place to sit on a blanket on the lawn with a bottle of infused water and an interesting book just soaking up the sun and getting lost in thought.\n\nI have not been to the craft shows there in many years, but they were among the best around, and I am sure they still are.  The largest dog park with separated spots for small and large dogs is a great place to meet a potential new friend or something more.  There is a little lake with water fowl, and they will come up and eat out of your hand, sometimes even when you are trying to feed your own belly.\n\nIf you are into throwing Frisbee or playing a pick-up game of football, there is ample room.  However, like most every other public space in this city, it is getting a bit overcrowded.",
  "Centennial Park offers something for everyone.  The green space is beautiful, the lake is a great place to watch the ducks, the Parthenon offers culture and the playground is perfect.  The seated swings throughout the park provide a place to relax and enjoy the beauty around the park.",
  "Centennial Park is right in the heart of West End...a nice grassy oasis near hospitals and universities.  There are always people there no matter what day of the week it is, but definitely becomes more crowded on the weekends.  There are concerts, plays and activities held regularly on the grounds.  You can walk the paved track around the perimeter, play frisbee on the lawn, swing at  the playground, feed the ducks & geese, walk your dog, ride your bike or tour the Parthenon (for a fee) in the center of the park.  It is great for photos and you will often see brides or recently engaged couples posing for pics.  The park is open late and is relatively safe, so a nice after dinner stroll is a great way to work off a heavy meal!",
  "This park is very beautiful.  The replica of the Parthenon is impressive, gigantic, and in excellent condition.  I don't know what some reviews mean by not in a great location.  It is virtually across from Vanderbilt University.  But whatever.  Do check and see what day the museum is open.  We went on a day that the museum was closed and could only see the Parthenon from the outside.",
  "Centennial Park at 2598 West End Ave Nashville Tn is a 132 acres of loveliness. With walking trails,a dog park, a band shell, art center, historical monuments, and the Parthenon. The band shell is used alot in the summer for free live music & free family movie night. Make sure to bring your own chair or blanket. The park is full of huge tall trees,plenty of flat areas with grass for picnics. The historical area of the park is where there are large airplanes sitting out on the grass. There is a small playground area for the kids towards the front right. The nearest food center is a McDonald's also on the front right side of the park. And then there's the Parthenon, saying it's huge is a under statement. You enter this building on the lower level, where there is a gift shop on your right. Straight ahead are glass doors that open up to great works of art, 63 paintings by 19th & 20th century American artists. The top floor is where all the plaster replicas are housed & also where the 42 foot statue of Athena is. \nNow did you know that once a year you can get in for Free at the Parthenon. Usually the first Sat in Oct. during the free Celebrate Nashville Cultural Festival. If you haven't been go! There is dancing, crafts, & food from all around the world. & checkout the Tenn Craft Fair in spring-May or June & fall-August or Sept also free. Beautiful arts & crafts from all over TN, GA, NC, & more. Paintings, photos, hand made wooden tables, hand made wooden toys, hand made brass & silver ware, garden items, clay & glass blown dishes, vases, & all types of jewelry. And yes most of the venders do take debit & credit cards at both festivals, but do bring some cash for all the great food trucks that come & setup for these events. Have Fun! Get out doors & live a little!",
  "We were lucky to rent an apartment right next to the park and it was the best decision ever. We were there every single day on our week long trip. It's a large beautiful park right next to Vanderbilt. There's a large playground area, several large swings through out the park, a duck pond, a flower garden, and of course the Parthenon. The park is usually hopping but finding parking is not hard. Day 1- kids and I just sat on a large swing. Day 2- they finally explored the large playground. Day 3 we visited the Parthenon. Day 4 she hopped off and on the steps of the little platform between the Parthenon and the playground. Day 5 we watched a master create puff candy and had a delicious picnic. Plenty of shade trees, porta potties, tons of restaurants around. ",
  "Its' free and it's worth it! It's beautiful and so relaxing and peaceful. There are usually several visitors there (at least during the summer)",
  "This replication of the Parthenon is amazing and the Athena is a site to see, We have visited several times, the museum below has several interesting exhibits notable was the Andy Warhol",
  "Being Greek I was a bit skeptical but once I saw it I was truly amazed.  Having been to the original in Athens several times it was truly amazing to see what the Acropolis might have looked like in its glory days.  Just a neat place to visit with tons of history to learn.  Not a long drive from downtown Nashville in one of the nicer areas of town - near the University and all of its shops and restaurants. ",
  "We didn't go inside but went by on Scooters as we explored downtown. gorgeous area to explore and were not disappointed",
  "The outside is great to look at for a quick pick but parking was hard to find and the area was confusing to access."
 ]
},{
 "name": "Belmont Mansion",
 "address": "Acklen Avenue at Belmont Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/eb/9f/70/photo0jpg.jpg",
 "tags": [
  "tour",
  "family",
  "history",
  "knowledgeable",
  "tour",
  "music",
  "knowledgeable",
  "art",
  "historic",
  "history",
  "tour",
  "kids",
  "art",
  "walking",
  "tour",
  "family",
  "historic",
  "learn",
  "knowledgeable",
  "family",
  "history",
  "knowledgeable",
  "tour",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d105782-Reviews-Belmont_Mansion-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "I enjoyed my tour of Belmont Mansion, because everyone who worked there (several people I came in contact with) were wonderfully helpful, cheerful, and knowledgeable. You can sense the love each one had for the mansion and its history, from the ticket seller in the gift shop, to Mary, our tour guide, to the kind gentleman in the office area, who helped me find my way all the way out of the building in the back, since that's where I had parked. I enjoyed the history of the family, as well as the beautiful furnishings. I also appreciated the outdoor gardens, in which I took a self-guided tour before my scheduled tour started. ",
  "Home to one of the wealthiest and influential women of the era, this Nashville mansion is a must see. On the grounds of a college campus, little more exists than the mansion itself, surrounded by campus buildings. However, what is inside is quite impressive. Ring the door bell to be escorted to the gift shop, where you will pay and await your tour. My only complaint was the cost, $15 seeming a bit high, but it does go towards the preservation of the mansion I suppose. You can pick up a $1 off coupon in one of the local advertising brochures. The mansion itself is something to see. The rooms, furnishings, and paintings are worth the trip. I enjoyed the upper level most, especially the staircase up to the observatory (not accessible for tours). Our guide was friendly and knowledgeable, answering all of our questions without hesitation. Tired of country music themed attractions? Check out Belmont mansion and some of the others in the area.",
  "My wife and I are Civil War buffs and we have visited antebellum plantations and houses in Kentucky, Tennessee, Virginia, Georgia, Alabama, Louisiana, Mississippi and Florida. One of the most elaborate of all is the Belmont Mansion in Nashville, Tennessee. Also known as Acklen Hall, Belle Monte and Belle Mont, it was built in 1849-1853 and is located at 1900 Belmont Boulevard on Belmont University's campus. Originally constructed to serve as a summer home to escape the heat of the owners' seven Louisiana cotton plantations, the Italian villa style home was built, furnished and landscaped as one of the most elaborate antebellum homes in the South with 36 rooms and 19,000 square feet. The grounds also included a T-shaped guest house with art gallery and bowling alley, lavish gardens, conservatories, aviary, lake and zoo featuring bears, monkeys, peacocks, singing birds, a white owl, deer and alligators from Louisiana. The house is surrounded by covered balconies with cast iron railing and trim to protect windows from the sun. Atop the house, a 10-foot octagonal cupola vented the house during the summer months and provided an astronomical observatory used for viewing the stars, the estate and downtown Nashville. During the Civil War, Belmont was occupied by 13,000 Union troops for two weeks but the house and its contents went undamaged. Much of the original Venetian glass still adorns the windows, doors and transoms. Gilt frame mirrors hang over marble mantels reflecting the elaborate gasoliers and elegantly furnished parlors. The Grand Salon is considered by architectural historians to be the most elaborate domestic interior built in antebellum Tennessee. The gardens are now maintained as part of the Belmont University campus, including five cast iron gazebos. The 105-foot water tower remains on the grounds and serves as a Bell Tower for the university. The mansion was added to the National Register of Historic Places in 1971.",
  "This wonderful home and the story of the lady of the house are more than worth a separate trip to see. Additionally, it isn't far to see Belle Meade along the way. Great original furnishings to see and wonderful history to hear. The parking is dicey since it is on a University campus, so make sure you get a pass from the docent. The price is a little high, but there are AAA discounts. The only negative besides the parking, is that the whole place is now surrounded by university concrete buildings. Needless to say, not the original glory.",
  "The slave trade was a big business, and this house was the perfect example of why the south resisted the freedom of slaves.  The opulence was amazing.  The house is still undergoing renovations, but there is still a lot to see.  The stories surrounding Adelicia are incredibly interesting, how a smart women during that era was able to fool the Union and save her kids.  Get there early like we did, and you may be lucky enough to get your own private tour.    ",
  "What really put this on my radar was hearing a story on my walking tour through Franklin, Tennessee (‘Franklin on Foot’).  The tie in to Belmont was the tale of two widowed women who set out to sell cotton during the Civil War when there were so many embargoes and restrictions in place to make this almost insurmountable.  The ensuing large sum of money that was earned from this sale was used on a huge shopping spree by Mrs. Adelicia Hayes Franklin Acklen Cheatham as she purchased treasures in Europe and sent them back to her ‘summer’ home, Belmont.  This in a nutshell is why you want to visit Belmont…for the art treasures.  You will find equally interesting the stories of Adelicia’s many marriages and savvy.  \n\nParking is a little scarce as it is shared with the University.  There was nothing clearly marked as available for Belmont visitors.  We parked where a space was available, and after ringing the front door to the mansion, was greeted by a docent.  He gave us a parking pass to put on our dashboard to ensure we would not be towed.\n\nA nice gift shop is on site.",
  "This one is not so easy to find with poor signage and in the middle of a university complex with limited parking but worth it.  The house itself is exquisite, with some outstanding features, paintings and furniture.  The guide was excellent and a fount of knowledge.",
  "This historic mansion on the grounds of Belmont University is a treasure.  The staff is so knowledgeable, the gift shop was lovely and you can learn so much about the life of the family that lived in the house along with what was going on in the Nashville area. I will say also that anyone with the opportunity to go to school at Belmont is a lucky person.",
  "We had a wonderful experience while visiting Belmont mansion their staff is very knowledgeable about the history of the house and family the mansion is beautifully decorated with original pieces from the family that made Belmont Mansion what it is today I would definitely visit again if I'm ever in Nashville Tennessee",
  "Loved the tour.  Must see if you have time.  The grounds and the house are really impressive.  They did a great job",
  "Very knowledgeable  staff knew the history  very well. Tour lasted about an 1 1/2 hours, resemble priced. Nice gift shop."
 ]
},{
 "name": "Tennessee State Museum",
 "address": "1000 Rosa L Parks Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/f2/d1/b5/front-of-new-tennessee.jpg",
 "tags": [
  "music",
  "wander",
  "walking",
  "history",
  "free",
  "historic",
  "learn",
  "history",
  "free",
  "history",
  "walk",
  "free",
  "family",
  "learn",
  "history",
  "free",
  "history",
  "tour",
  "history",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d139368-Reviews-Tennessee_State_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Last day in Nashville and needed something to do inside.  This museum is awesome from fossils, paleoindians, native Americans, early settlers, wars, geology, music, portraits, antique furniture, and so much more. This is a gem a must see.",
  "Enjoyed spending a few hours walking through the time travel tunnel to peak at this state's history from prehistoric times through today.  Lots of interesting exhibits, something for everyone to enjoy.  You'll find a nice Tennessee gift store on the first level.  Staff was friendly and helpful.  Allow plenty of time to wander through the exhibits.  Parking is easy.  Worth your time!",
  "First, the museum is free, so if you enjoy history, this is a great free history lesson. The museum details the history of Tennessee, beginning with the Ice Age, and covering everything from Native American settlements, Andrew Jackson, the Civil War, the Great Depression, desegregation, and present Times. There are a lot of artifacts that bring life back to historic times. This museum is an excellent way to learn about our great state of Tennessee!",
  "This museum definitely covers most one would want to know about Tennessee's history, with exhibits dating back as far as Tennessee's place in the pre-historic ages! It is FREE to enter which is always welcome, and when we visited it was not that busy despite being located in an ideal location, very close to Downtown (about a 15 minute walk or a very short bus journey).\nFor a non-paid attraction it is still obviously funded/supported well as the interior and exterior were quite marvelous and also very clean. The exhibits were also great; well presented and understandable movies, lots of legitimate historical artifacts to compliment information, and this was all laid out in a logical order taking you from Tennessee's creation through to the present and beyond.\nWe spent a total of around 2 hours here but you could easily spend longer. It was certainly one of the better museums we visited in the U.S., and it was suitable for most ages and also levels of historical interest.",
  "It's a good place to hang out with your family, it's not exceptional but it's ok and it's free which I think is the best part. \nA good idea if you don't know what else to do and you want to know more about the state of TN.",
  "Very nice way to spend a rainy afternoon, spent about 3 hours there and loved it all. Great way to learn about TN history",
  "1 - free!\n2 - spacious and clean\n3 - great exhibits documentating the history from back the natives to the civil war\n4 - clean bathrooms \n5 - great second story porch to relax, enjoy the view, and sip coffee\n6 to 10 - did I mention it's free?",
  "I came across this place that is right next to the Farmer's Market. My son and I decided to take a walk over and check it out. Great place to tour with our without a guide and its FREE! At the end you can make a donation if you choose to do so. This museum gave me a lot of knowledge. This would be a great place to take children on a class trip. This place has a lot of history!"
 ]
},{
 "name": "Lane Motor Museum",
 "address": "702 Murfreesboro Pike",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/ba/2b/42/czechoslovakian-vehicles.jpg",
 "tags": [
  "tour",
  "tour",
  "knowledgeable",
  "unique",
  "unique",
  "historic",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d664127-Reviews-Lane_Motor_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great private collection of Eastern European and other unusual cars, planes, bicycles and motorcycles. Well worth a stop if you are in Nashville.",
  "Fantastic collection of cars and so well maintained. I timed it with the basement tour which was really interesting and I would recommend people to look out for that!",
  "Location is easy to fond; the facility is great for a car museum. So many imported cars you never knew existed. Cars from East Germany, Russia, Czechoslovakia, France, Japan, etc. Worth the trip for any car enthusiast. ",
  "Fantastic, if you love cars, especially the odd and different this is the place to visit. Staff are knowledgeable and very nice. Not just cars there is a bicycle and motorcycle bike section as well. My highlight was the massive LARC military vehicle behind the museum...its massive. Don’t forget to go into the garage area, cool stuff in there as well. I read on a mother review that there is a “basement” tour for 6 bucks more...wish I would have known cause I definitely would have done it. Car fan, no branier !",
  "We loved spending time here admiring and ogling over the unique and oddities of this extensive collection.  A must see for all collectors and wanna be collectors! ",
  "This museum is nothing short of amazing. It boasts America’s most extensive collection of European vehicles, and that is evident. Housed in the former Sunbeam bread factory, the clean, open space is full of cars, scooters, bikes, and other assorted vehicles, including two cars propelled with airplane like propellers.\nI ran across this hidden gem while researching the Tatra car company of Czechoslovakia, and I was elated to see several beautifully restored specimens. The beauty and oddity did not stop there, though. Just observing the Ingenious approaches to locomotion filled one’s imagination with the hours and energy invested into the unique designs.\nRex and Jessie were top notch guides. Their knowledge and enthusiasm made conversing about trends, engineering, and styling a true pleasure, and seeing all these magnificent examples tickled the imagination.\nI am blind and was loaned some cotton gloves, so I could caress the exhibits. Rex and Jessie took the time to make me feel like an honored guest and cheerfully pointed out the unique aspects to each of the vehicles we viewed. \nWeather you can see or not, I highly recommend this museum. It ranks right up there with the Ford museum in Dearborn, MI.",
  "A wonderful place for the entire family.  Tons of historic vehicles and a glimpse into the automotive world outside of the US.  The best time to visit is during an event where they allow access to the vehicles not on display.",
  "Great private collection of Eastern European and other unusual cars, planes, bicycles and motorcycles. Well worth a stop if you are in Nashville."
 ]
},{
 "name": "Bridgestone Arena",
 "address": "501 Broadway 41415 Justin Clinton Twp. Mi.48038",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/65/b0/3a/filename-img-1784-jpg.jpg",
 "tags": [
  "food",
  "affordable",
  "family",
  "kids",
  "free",
  "music",
  "walking",
  "food",
  "food",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d108425-Reviews-Bridgestone_Arena-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Watched the Predators hockey for the first time and loved it.  This arena is so well prepared for the crowds, many bars, many food vendors and very friendly staff.",
  "Great venue for a concert. We had floor seats and they were perfect. East to see and plenty of space. Pay extra for the Lexus Lounge, it is worth it. ",
  "I was fortunate to get entry for the fascinating Ice Hockey game between Colorado Avalanche and Nashville Predators.Great crowd and great place",
  "We love seeing the Predators play.  The fans are wonderful (accommodating to visiting team fans) and the staff at Bridgestone is excellent.  We always buy our tickets directly from the arena - take advantage of special event (college night, family seats, etc.) for more affordable options.  We never fail to get great seats (thanks Jake B)!  Parking can be expensive and nerve wracking so plan ahead.  I noticed the seats in the arena are looking a little dirty and worn.  Take your kids down to the ice during warmups for a chance to snag a puck.  The Preds have come a LONG way from their early days as an expansion team in the South.  Be prepared to have a fabulous experience!",
  "We watch the SEC tournament every time it's in Nashville and see several concerts per year great arena for basketball, and hockey, and concerts. Don't miss an opportunity to see an event at Bridgestone Arena",
  "Lots of free entertainment just walking through all the beautifully decorated areas.  Poinsettias everywhere.  Lights hanging from the ceiling everywhere you turn.  All the trees in the perimiter of the hotel are fully, thickly, decorated with lights.  Awesome.  Also bought tickets to see the Radio City Music Hall Rockettes.  They put on an incredible show - well worth the ticket price.  Only drawback is the parking - $18 for close up.  Free parking requires a lot of walking and for some of us older folks, that can be a challenge",
  "Went to see a Nashville Predators game and had a great experience. The arena feels much smaller than it is. The main halls are well appointed with lots of different food and beverage options.",
  "Firstly, I have been to many arenas and never one where there is basically NO parking.  As a visitor to Nashville, of course I had rented a car, but finding a place to park it on a Saturday night was a nightmare.  This arena is right on Broadway where all the honky tonk and big name restaurants and bars are located.  The pedestrian traffic was like Las Vegas!  Once in the arena, it was a pretty nice experience except for the seats.  I don't consider myself a huge person by any means, but come on!  I had to turn sideways to get between the armrests, less than zero leg room and no cup holder.  Very steep in the upper levels.  \n\nI will say I enjoyed the Nashville Predator fans, but I felt like I needed a program or something to tell me all the sayings and cheers they did regularly.  And can someone explain to me about the dead fish being thrown on the ice?",
  "Went there to see Jimmy Buffett and Huey Lewis for New Years eve. Great venue withe easy access. The seat were very comfy.",
  "Attended a couple of events at the arena. The seating is not that great and finding  your way around is long and confusing. Parking is a total cluster !@#$  and very costly. ",
  "First hockey game and couldn't have been in a better arena. Great food and drink selections and comfortable seating. Have to go back. "
 ]
},{
 "name": "John Seigenthaler Pedestrian Bridge",
 "address": "Cumberland River",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/36/d2/59/skyline-to-the-left.jpg",
 "tags": [
  "walk",
  "walk",
  "walking",
  "free",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d10533133-Reviews-John_Seigenthaler_Pedestrian_Bridge-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "We really enjoyed this walk.  For a visitor, it felt like a great way to get another perspective of Nashville while getting some exercise.  \n\nWe took this enjoyable walk on our last evening there... It gave us time to reflect on our experiences in Nashville and at the end of the bridge we walked straight to a restaurant for dinner.  It was a nice way for us to end our trip.",
  "This was a nice walk over the river and back with ample photo opportunities. It started just down from the Goo Goo Cluster museum and downtown activities.",
  "Walking across the Seigenthaler Bridge offers outstanding views of Nashville and especially Nissan Stadium.  You can can great some postcard pictures from the span.  Just make sure to Google John Seigenthaler before you go.  He had an incredible life and it will make you appreciate the span even more.",
  "Nice walk over this small bridge which gives s great view on the skyscrapers of nashville. Not far and easy to reach. Free attraction great for a sunny day",
  "This is a great walking bridge over the Cumberland River that connect SoBro to East Nashville. Great views and perfect photo-op of the city."
 ]
},{
 "name": "Frist Art Museum",
 "address": "919 Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/e6/33/94/frist-art-museum-exterior.jpg",
 "tags": [
  "art",
  "learn",
  "art",
  "music",
  "art",
  "art",
  "art",
  "historic",
  "unique",
  "tour",
  "art",
  "historic",
  "unique",
  "tour",
  "walk",
  "art",
  "music",
  "family",
  "history",
  "art",
  "music",
  "art",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d216268-Reviews-Frist_Art_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had the opportunity to attend the Frida Kahlo, Diego Rivera and Mexican Modernism exhibition at the Frist Art Museum in Nashville​, Tennessee on opening day, May 24th, 2019. \n\nThought it was a great exhibit. I loved the photos taken of Frida in particular. There was also an interactive screen that visitors were able to learn more about Frida's clothing iconic style the reasons behind her fashion choices.",
  "While traveling the Nashville hop-on-hop-off trolley loop, we noticed the signage for the Frist Art Museum's current exhibit of several Impressionism's masters.  We trolley-ed back the next day, hooped off and greatly enjoyed the exhibit of various paintings from the Mellon collection of Impressionist art.  They were well-presented with printed signs explaining each individual work and its creator.\nThe Art Deco building itself, previously Nashville's Main Post Office, has been wonderfully repurposed to house several gallery rooms, along with a nice gift shop.  An additional unexpected surprise was a display of some very good artwork created by area high school art students.\nThis was an enjoyable and fun counterpart to the honky-tonk scene just a few blocks away on Broadway.  Make some time to appreciate art along with the music!",
  "Found a little time to sneak over on a lads strip on my own. It's a smaller gallery but that has zero effect on the collection. Great art deco architecture throughout. Whilst I was there the current showing was the Mellon collection from Virginia which had stuff from the British Sporting collection as well as the collection of European art including, Monet, Van Gogh, Degas and Picasso. Upstairs was a lovely collection from Florence. Do not miss this place, find the time!!",
  "I'm only in town for a short two day conference and I wasn't sure if I could make the time for the museum.  Luckily the museum is open until 9 on Thursday nights.  So glad I was able to go.  The museum is small and can be done in about two hours depending on the individual.  The highlight for me was the Dorothea Lange exhibition.  The photos were displayed in chronologically and one was able to follow her career through distinct stages: portraits, depression, internments, environmental with an excellent short documentary.  Photography isn't appreciated as an art form in a manner that I believe it deserves.  Dorothea's photography capture raw emotion all while respecting her subjects during most difficult times.  I really enjoyed the way this show was staged.  Excellent.  \n\nThe fact that the museum in housed in an old art deco post office is a major plus.  I love art deco and I love when old buildings are saved and repurposed.  \n\nThis museum is such an asset to this community.  Congrats to all involved.",
  "Living locally, I visit the First Center approximately 3 times a year. The museum is dubbed an \"Art\" museum, which most people associate with \"framed painting\" and sculptures, but this museum also hosts and exhibits traveling exhibitions of fine automobiles, European jewels and jewelry, Middle-Eastern sculptures, etc. The museum is housed in the historic Federal Post Office in Nashville, with the larger exhibitions on the main floor. The upper floors have smaller exhibitions and a \"hands-on\" art center for children. There is also a small cafe on-site that has very good sandwiches and salads and is perfect for lunch and an afternoon museum tour. The gift shop is also a good place to purchase unique gifts that you typically do not see at regular retail stores. I visit numerous museums, and the gift shop here stands out in competition with most museum gift shops. You really need 2-3 hours to see the museum, and with lunch, 3-4 hours will make a nice afternoon. Also, there is parking on-site, which is virtually unheard of in Downtown Nashville these days.",
  "Living locally, I visit the First Center approximately 3 times a year. The museum is dubbed an \"Art\" museum, which most people associate with \"framed painting\" and sculptures, but this museum also hosts and exhibits traveling exhibitions of fine automobiles, European jewels and jewelry, Middle-Eastern sculptures, etc. The museum is housed in the historic Federal Post Office in Nashville, with the larger exhibitions on the main floor. The upper floors have smaller exhibitions and a \"hands-on\" art center for children. There is also a small cafe on-site that has very good sandwiches and salads and is perfect for lunch and an afternoon museum tour. The gift shop is also a good place to purchase unique gifts that you typically do not see at regular retail stores. I visit numerous museums, and the gift shop here stands out in competition with most museum gift shops. You really need 2-3 hours to see the museum, and with lunch, 3-4 hours will make a nice afternoon. Also, there is parking on-site, which is virtually unheard of in Downtown Nashville these days.",
  "Our ticket from the Country Music Hall of Fame allowed us to visit the Frist at no cost.  We really  appreciated the Hungry Caterpillar art and history; however, all the other sections of the museum were closed so we left feeling like there could have been a lot more to see..\n\nNoting the staff was very friendly and welcoming to our family and it has a nice vibe to walk through the museum.. just felt like it could be a lot more than one exhibit.",
  "Thre exhibit takes you through his early days of traditional landscapes into his later days of early impressionism. Well curated and encompassing this painter's career.  \nThis building is worth a visit for the architecture alone,  beautifully cared for. ",
  "This is a small local museum, but the exhibits are good and, most impressive, the upstairs offers interactive activities for young and old!  Make a print--even if you have no talent like me!  Great Take (thank you, Ashley!)!",
  "Can't understand all the great reviews.   Admit we have visited 100's of galleries and museums, large and small, all over US and overseas, but the Frist was a huge disappointment.   The building (an old art-deco Post Office) is interesting but beyond that, there was little to see.   The Joseph Turner exhibition (by far, more than 50% of the art on display at the time) consisted of a lot of pieces that were \"drafts\", experiments or unfinished, for one reason or another.     Not a single framed work by any other artist.      Unless you are a big fan of that artist or particular style of art, it gets old fast.     Beyond that, there were a few pieces of \"modern\" art on display and a large interactive area for children (and adults) to try their hand at different art mediums.    There was also another area being \"prepared\" for upcoming exhibitions but there was little room remaining for that to occur.   Would have been nice to know from staff beforehand that approx 40% of display areas were awaiting art installation.    Cost of $10 for seniors was still not worth it.   If you are in Nashville, have a rainy day or need a break from the country music, give it a try, otherwise, a big disappointment",
  "...visit this museum. In addition to enjoying the art on display, see this wonderful building. And bring your studioB ticket along for free admission.\nThe Joseph Mallord William Turner (1775–1851) Exhibition: Quest for the Sublime lasts until 31 May 2020 and is NOT to be missed!"
 ]
},{
 "name": "Radnor Lake State Park",
 "address": "1160 Otter Creek Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/ba/e1/c7/radnor-lake-state-park.jpg",
 "tags": [
  "historic",
  "nature",
  "hike",
  "walk",
  "walk",
  "walking",
  "walk",
  "hike",
  "walk",
  "nature",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d207294-Reviews-Radnor_Lake_State_Park-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "After spending a few days wandering through Nashville, Tennessee, from one museum to another, from one historic site to another, from one restaurant to another, from the Ryman Auditorium to the Grand Ole Opry, from Tootsie's to Hattie's, it was refreshing and downright relaxing to visit Radnor Lake State Park, or Radnor Lake State Natural Area, in the Oak Hill neighborhood just outside Nashville. When you arrive, stop at the visitor's center to get a lay of the land. The 1,332-acre nature preserve, which was created in 1973, features five miles of unpaved hiking trails that meander through the woods surrounding the lake. Visitors to Radnor Lake enjoy wildlife native to Middle Tennessee, including river otters, beavers, mink, muskrat, bobcat, coyote and white-tailed deer. Bird-watchers will find the ring-necked duck, canvasback, gadwall, American wigeon, geese, great horned owl, red-tailed hawk, black vulture, golden eagle and bald eagle. Swimming, wading, boating, camping and picnicking are prohibited. Jogging and running on the trails is prohibited, too. But fishermen will be challenged by brown trout, channel catfish, bluegill and smallmouth bass. Dogs are allowed but must remain leashed. ",
  "Wonderful view of the lake, you can enjoy the long paved road to jog or walk. you can also take a hike though the woods look at wildlife.",
  "People everywhere, traffic all the time, lights flashing.\nIn a city as busy and crowded as Nashville….this place is a MUST in order to slow the pace of life down.  \n\nA simple walk around the lake can easily be done within the hour and is only 30 minute drive south of down. Stick to the trails and you will see great vistas of the lake and some wildlife along the way.  We saw several groups of wild turkeys, a dear, one or two squirrels (we stopped counting after two), an owl up in the trees, a heron, a swimming muskrat, some geese and some turtles sunning themselves on a log.  \n\nTake your time to slow down and enjoy the outdoors...and to look around… you never know what you will see.",
  "Ensure you go very early to get a parking spot.  The trails are varied.  If you stay on the one that circles the lake, it is very easy.  Some of the others are challenging.  Check before you enter the woods because the signs for the trails do not indicate the level of difficulty.",
  "Beautiful park with plenty of easy trails (I have little ones). We ended up walking the entire lake; which was about 2.5 miles.  Quiet nice walk though the woods.  It has rained for the 2 days before so it was muddy, be prepared with your shoes.\nParking is tough...we want early and there were a few spaces, but when we left people were parking all over and circling for a space.  Go early...even on a weekday because by 5:00 it was packed.",
  "Radnor Lake is one of our go-to places. The wildlife, the lake and the well-kept paths keep us coming back. It is the perfect length of an easy hike for a Sunday morning. If we feel like doing a little more strenuous hike, the ridge trail fits the bill. Parking can sometimes be an issue, but hop out of bed early and there's no problem! We see lots of birdwatchers while we are there and we always take a camera. It is true peace in the middle of the city.",
  "Beautiful views, a great place to walk. I havn't been in a long time but it was a great experience and a great memory. Trails are nice and the view is breathtaking in spots.",
  "The drive to the park goes through homes of the Nashville royalty: beautiful and stately. Our two dogs were welcome on the road next to the lake. We saw an otter and turtles and herons but great trails didn’t permit dogs. Wonderful nature place close to the city with or without dogs.",
  "Great outdoor experience  very peaceful and energizing:. Only issue was parking space. It’s apparently very popular and parking was limited",
  "Radnor Lake is very close to my home. Its like have a beautiful picture right next door. For those that need to travel, it is well worth the ride!",
  "I have been to Radnor Lake many times over the last 30 years. Whenever I have an extra day to squeeze in, a walk around Radnor Lake is one of my favorite choices. I love going early in the morning or just before sunset. There is abundant wildlife and the trails are inviting and peaceful. The museum has wonderful history of how the lake was created and the impact of the railroad coming to Nashville in the 1800s. There are great historical photos as well. Allow at least 2 hours to fully enjoy this local treasure."
 ]
},{
 "name": "Fontanel Mansion",
 "address": "4125 Whites Creek Pike",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/a2/14/67/view-coming-up-driveway.jpg",
 "tags": [
  "tour",
  "music",
  "history",
  "knowledgeable",
  "tour",
  "family",
  "tour",
  "family",
  "history",
  "knowledgeable",
  "music",
  "tour",
  "tour",
  "delicious",
  "unique",
  "winery",
  "food",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d2092245-Reviews-Fontanel_Mansion-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a beautiful home! Great tour with Seth who was so knowledgeable,  friendly and fun.  He really knew the history of the home and of country music.  This was a great tour and you were welcome/able to touch things, take the guitar of the wall and strum a bit if you wanted to.  Beautiful home and grounds.  Would highly recommend",
  "We enjoyed our tour of this beautiful over sized log home. It's like 33,000 sq ft. Very interesting to see how Barbara Mandrel and her family lived for 14 years.Our tour was made special by having our guide being Janeel---a country singer that got out her guitar and sang a song for us at the end of the tour",
  "The mansion is beautiful!  Absolutely amazing interior and exterior.  Our tour guide was the talented and gifted, Steven Whitson, songwriter, singer/musician yet so humble, knowledgeable and informative about the history of the home and family!  I highly recommend this place to visit and enjoy!",
  "Even though it is a bit outside of Nashville, don't miss seeing Barbara Mandrell's former home, the Fontanel Mansion. You will not be disappointed.\n\nI won't spoil the surprises you will see but I will tell you that if for no other reason to go, you'll meet some really great people there!\n\nKudos to our great guide Steven Whitson (or Kevin?? 😀). We appreciated your personal touch. We loved your music and wish you nothing but success in your career!  Hope to see you on the big stage!",
  "My wife and I visited Fontanel Mansion the third week in March. We were in Nashville for a conference and heard that Barbara Mandrell had lived there. The weather was a bit nippy but that led to the quaint and coziness of the tour. We were fortunate to have Steve Whitson as our tour guide who entertained and shared many fond moments with our group. The MAN knew everything. Kept us on the tips of our toes with a story or fact about the mansion.  He was fantastic!!! He even sang us a song while we roamed the Great Room. It was a great voice in a Great Room!!!! The tour made us feel like we had lived in this mansion for many years. He narrated the tour like it was our home. To touch, feel and admire the surroundings made us feel like kin folk to Mrs. Mandrell. The outdoor deck looking out into the woods was so serene and peaceful. Of course, my wife loved the bathroom and closet space. If you are in the neighborhood, don't miss the chance to visit the Fontanel Mansion. Remember to ask for Steve and I know he will take good care of you.",
  "Our \"tur\" of Fontanel was fun and interesting; made so by our great singing guide Steven Whitson.  You get to tour the unique and beautiful mansion cabin in a truly hands on fashion. Steven is a Fontanel expert and he has an eidetic memory for people's names.  Make sure you save time for a meal at the restaurant where the food is absolutely delicious.  It was one of the best meals we had while visiting Nasville.  We also enjoyed tastings at the winery and distillery.",
  "The Fontanel Mansion is one of the most beautiful log cabins I have ever seen, it has a room with a piano and guitars sitting around like a music room, it has a formal dining area with a long table and beautiful decor.  It is a must see for anyone that is visiting Nashville, I am from Shelbyville and I really got my moneys worth.",
  "Fontanel was bought by a new property management company and they promptly canceled our wedding that we had already fully planned and put down deposits for. We had to re-do the whole thing and had to fight to get our money back sooner so that we could put down deposits on a new venue. \n\nIf customer service meant anything to the management company, they would have at least tried to work with us a little...it seems like they're actually going to continue using the mansion for special events, so it really doesn't make any sense that they wouldn't want to keep their planned events and be able to profit from them.",
  "Nice trails, easy parking.  Too bad there wasn't information printed to help hikers better understand the story behind this property.  It was nice to stretch our legs there, but that's about it.",
  "One of the best tours; museums, gardens, representation of our former presidents. Glad I came. Would highly recommend this. Dont miss it.",
  "My girlfriends and I went here to zipline! We had so much fun even though it rained on us :( The property is beautiful! The cafe upfront had the best bloody mary's we had all weekend! "
 ]
},{
 "name": "Madame Tussauds Nashville",
 "address": "515 Opry Mills Dr Opry Mills",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/55/25/c7/img-20180618-105304-largejpg.jpg",
 "tags": [
  "family",
  "music",
  "kids",
  "kids",
  "wander",
  "music",
  "art",
  "music",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d12221658-Reviews-Madame_Tussauds_Nashville-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Ok, so we got Groupon tickets just for something to do over winter break but really didn’t expect much.  It so exceeded my expectations. I thought we’d just go through a museum like setting but boy was I wrong. It was so interactive! You could cozy up to Deacon Claiborne, play bass beside Louis Armstrong, dance beside Justin Timberlake, or play the keyboard with Bruno Mars. The figures were great, but the settings and stagings were so wonderful for picture posing. My grandsons loved pretending they were cameramen or sound operators at WSM. We had plenty of time and no one rushed you through at all. They dressed up in costumes beside the greats and thoroughly enjoyed themselves. We’d go back in a heartbeat!  ",
  "I've always wanted to go to a wax museum, and finding out you can actually touch and pose with the wax sculptures made my first trip to one an unforgettable experience. My family and I had so much fun taking pictures with the wax sculptures!\nThe attention to detail on these are amazing... I was especially blown away by the Jimi Hendrix one. WOW, was it ever realistic.\nI had read reviews that this place was small, or not worth the money- but let me tell you, it really was a fun part of my stay in Nashville. I'd go again!",
  "We got our tickets from Groupon and that made things really easy to check in (and saved us $30). The museum was very cool! A definite must for any music fan. They had everything from Bob Dylan, Elvis, Patsy Cline and Johnny Cash to Ozzy, Kid Rock and Katy Perry. My kids had a blast either copying the poses or just sitting next to them. Fun for the young and the young at hear!",
  "This place is inside the Opry Mills Mall.  We had a nice coupon that we got in a booklet at the Nashville Sounds game.  It was a fun place to check out.  You can stand next to any of the figures and take pictures with them.  It doesn't take long to go through the place but well worth the time.  There is a gift shop at the end.",
  "What can you say about a wax museum... They look kinda real and sometimes the eyes seem way to real its a little creepy, lol.  All that said the kids had a great time looking at all of the celebrities and it was a great way to pass the cloudy rainy day.  If you have the time it is worth a look.",
  "Just went to the grand opening of Madame Tussauds new museum at Opry Mills in Nashville.  I have been to other wax museums and been very disappointed.  Not so here.  The wax figures are so life like you expect them to start singing.  This museum is all about music, mostly country but with a touch of Beyoncé, Rihanna, and Katy Perry.  What makes the experience exceptional is that you wander through in a logical historical order with reproductions of many of the famous venues where the artist got their start.  As you admire the figures, you listen to excerpts of many of the songs they made famous.  The music alone is worth the visit.  \nUnlike many or most wax museums that have the proverbial red rope that you dare not cross, Madame Tussauds actually encourages you to get up close and personal.  It makes the experience all the better.  Prices are very reasonable and are usually cheaper if ordered on line.  They have several packages that include guidebooks (an item actually created by Madame Tussaud), skip the line entrance and a custom T-shirt, depending on the package you pick.\nI have include pictures to give you an idea of how lifelike these are.  The facial hair and detail is quite amazing, but Tussaud did perfect the art of wax figures long ago and having one of her museums in Nashville is definitely a nice addition.",
  "After visiting the Madame Tussaud’s was museums in London, Bangkok and New York I was very excited to visit this one because it was supposed to display figures related to  American Music. I was pretty disappointed as somehow it lacked the class others had.",
  "My mom and I did this while we were in Nashville. Very nice attraction and the price isn't that bad. I bought tickets online and the price was slightly cheaper than buying in-person.",
  "Pretty cool. Everything looks so real. Visited the one in NYC and this one isn’t as big but the quality of mannequins is just as good. Definitely stop and see it",
  "All of the wax figures were so real like. Loved singing with Patsy Cline.  We cut to CD which was a blast. And the photographer that walked around taking pictures was fantastic.",
  "Located in the Opryland Mall, this exhibit was fun to walk through.  The wax figures are very lifelike and well laid out.  Great photo ops here."
 ]
},{
 "name": "The District",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/41/08/4f/photo5jpg.jpg",
 "tags": [
  "music",
  "kids",
  "music",
  "music",
  "walk",
  "music",
  "music",
  "walking",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d106497-Reviews-The_District-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Everything is happening in the District, all of the Broadway bars & honky tonks, iconic buildings, the pedestrian bridge, printers alley, museums, & some wonderful restaurants. We spent the whole day keeping busy & having a blast within a few blocks of downtown Nashville!!",
  "Fun fun area!!!! Fun strip of stores, restaurants,  bars with live country music playing all day! Candy stores! We went with our young kids during the day, I hear it gets too crazy at night !",
  "I found the main drag along Nashville to be fun. Great live music, plenty of people enjoying life and having a good time, What I found to be even better town planning is that on one end of Broadway there is an Ice Hockey stadium for the NHL team the Nashville Predators and on the other side is the big football stadium! The town is really cool and I found the prices where not that expensive compared to other bigger American cities. Certainly I would recommend visiting Nashville.  ",
  "Nice area, easy to walk around and enjoy the views. Loads of bars with music and great resturants. Safe area from morning to night, nice for taking photo. When in nashville a must",
  "we recommend staying locally in an Air BnB or something similar. dont pay for parking, use the scooters! and explore all over downtown. had a blast",
  "We were there Day&Night several times and really nice wonderful place, vibrant, enjoyable, alive. People are nice place is full of fun stuff, if you are for fun; it is the place for you, if you want to shop it is a really nice place you can find interesting stuff. If you are hungry, say no more.",
  "The District is full of lively honky tonks, restaurants, and shops, and it's lively every day of the week.  It's a fun place to explore, people watch, and listen to great music.  It does get a bit loud, but it adds to the experience.  Parking is around, but you're going to pay for it.  There were several homeless people around, but most of them kept to themselves.  Despite these couple of negatives, definitely check out The District.  There's something for just about everyone there.",
  "This is a hopping part of town filled with restaurants, bars, boot store and even the Johnny Cash Museum and Restaurant. There is something going on all the time.  They say New York is the city that does not sleep but the Nashville District comes close. Midmorning after a walk on the bridge, we found plenty of  bars and cafe with live music.  This is not my cup of tea (been there at night), but I enjoyed walking around and peeking in and listenings.  Parking is an issue.  It is expensive and not plentiful enough.  We parked up the hill, past the Old settlement buildings along the river.  There were quite a few homeless people and also solicitors.  Probably a good place to watch your wallet and purse.  If you like a lively environment, liquor, cafe food, and loud music and are young at heart .... this may be the place for you."
 ]
},{
 "name": "Bicentennial Capitol Mall State Park",
 "address": "600 James Robertson Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/37/48/c0/bicentennial-capitol.jpg",
 "tags": [
  "unique",
  "music",
  "history",
  "tour",
  "walking",
  "walk",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d207248-Reviews-Bicentennial_Capitol_Mall_State_Park-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "After a busy couple of days exploring the many music venues in Nashville, it was nice to spend time browsing around the The farmers market, which is very interesting and supports many unique and local businesses in Nashville. The park is adjacent to the market and it was a change to do a little more relaxed and sedate activity away from the hectic and lively Broadway, Allowing you time to recharge your batteries. The park is lovely, tranquil and is a poignant reminder of lives lost so we can live in freedom. Lots of Tennessee history.",
  "A friend and I were fortunate enough to visit here near noon!  We got to hear the Bells play The Tennessee Waltz, chime 12, and then play Love Me Tender, and a Patsy Cline tune before we had to leave for other committments.  It's a beautiful park and is just beginning to bloom (March)!  Great view from the bells to the Capitol Building!",
  "we visited this park on our segway tour eric was very informative about it the pillares represent the counties of tennessee in the center of them you can stand in the middle and here your voice echo. there also is a war memoial  and a huge sidewalk with a map of tennessee with all cities rivers  etc. its great to see",
  "During lunch time you will find lot of people walking, but this is a nice place to walk around and find a quiet atmosphere. It is close to farmers market which has some good restaurants.",
  "This park is good for a little walk. There's a view of the State Capitol building and also some monuments with the history of Tennessee. Dog friendly and good for photos as well.",
  "This is a lovely place to get some fresh air on a sunny afternoon surrounded by curated quotes from famous Tennesseans.   The Saturday market is right there, too.",
  "We Scootered through this park and found it to be really beautiful. lots of photo ops here. lots of concrete for scootering around and several great spots to relax for a bit in the shade. ",
  "If you are here in summer with little ones, don't miss this place. Near enough to the farmers market for a treat, fun water to cool off in, and just enough history to make the adults feel good!"
 ]
},{
 "name": "Cooter’s Museum and Store Nashville",
 "address": "2613 McGavock Pike",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/e9/77/03/cooter-s-garage.jpg",
 "tags": [
  "knowledgeable",
  "walk",
  "economical",
  "walk",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d1165693-Reviews-Cooter_s_Museum_and_Store_Nashville-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Enjoyed visiting this place as brought back lots of memories..So fun seeing the General Lee and all the memorabilia in the shop..Make sure you stop by if you watched Dukes of Hazzard..Brings back lots of memories..",
  "This was such a fun side trip!  The museum is so much bigger than it appears from the outside - several different rooms and houses some of the vehicles from the show!  The memorabilia brought back so many memories - I was a huge fan growing up and probably had most of it at one time!  The museum was a fun excursion and would be suitable for young and old!  You can get your picture taken in the General Lee, squad car, Daisy's Jeep or Boss Hog's Cadi - super fun!  They also sell merchandise - everything from t-shirts/hoodies, ball caps, beach towels, flags, stickers - you name it!  Definitely a good place for souvenirs.  The gentleman working the day of my visit was extremely friendly and knowledgeable.  They also offer a law enforcement/military discount, so remember to ask!",
  "This was the only place my husband wanted to go when we hit Nashville, being a massive Dukes fan. We were able to see the General Lee and for a small fee my husband could sit inside for some photos. There are so many amazing pieces of memorabilia in the museum, it was a fantastic walk down memory lane. \nRecommend for anyone who grew up watching the Dukes of Hazzard and tried to get into their car through the window :)",
  "Although the \"store\" aspect of this place far outweighs the \"museum\" aspect it's still a good stop. There are a bunch of props and TONS of Dukes of Hazzard merchandise for sale. It's a pretty small place, so don't go out of your way just to come here, but if you're in Nashville anyways and a fan of the show it's a good stop.",
  "There is no admission fee for this small slice of nostalgia.  You walk into a small, somewhat crowded gift shop with various kitschy trinkets, T-shirts and such.  (At least as many of them are emblazoned with \"Cooter's\" as with the Duke's of Hazzard logo.). Through a doorway in the back of the gift shop, you walk into the \"museum.\" This mostly consists of glass-enclosed floor-to-ceiling (almost) display cases with all manner of merchandise that capitalized on the show's popularity in the 80s.  Some of it in mint condition while some of it appears to have been gently, but thoroughly loved and used.  Along the far side of the museum is a cordoned-off area displaying Daisy's Jeep, Uncle Jesse's truck and Roscoe's squad car.  The General Lee is parked out in front of the gift shop.  For a fee, you can pay to have your picture taken (and printed as a 4x6 or 8x10) while sitting in the General Lee; for an additional fee, you can get this done with all four cars. There is a more economical option, however, which is to take the pictures with your own camera (and, of course, printed on your own at a later time).  The fee for just the picture in the General Lee (with your own camera) is $5, or $10 for all four cars.  I don't recall the cost to have the pictures done by the manager of the store/museum, but it is certainly higher than the use-your-own-camera options.\n\nAs a side note, the store offers the DVDs of the Duke of Hazzard series, but the prices were a bit steep. And some of the first items I saw when we stepped into the store were the matchbox cars of the General Lee and Boss Hogg's car & Roscoe's cruiser.  My younger brother, who was a great fan of such cars as a young boy, owned all of these, and I am certain they cost nowhere near the $6 they wanted for these ($7 for the General).\n\nBottom line: if you have no affinity for the show (now in reruns on CMT), you probably won't care for the \"museum,\" but since there is no charge to enter, it is a pleasant stop if there is someone in your party who loved the show in its heyday or has discovered it in reruns.",
  "We expected a kitschy museum and it was but there was a lot more to it than I expected. Many memorabilia items and vehicles from the show as well as lots of souvenirs. It's worth a stop if you're a fan of the show. Just down the street from the Opry.",
  "We loved Cooter's. The museum was great and they have all sorts of souveniers for sale. If you are a Dukes Of Hazzard fan, you must stop by to see the vehicles!",
  "I think all of you whiners out there leaving 1 star reviews are just a bunch of whiny sissies who prolly leave lousy reviews everywhere you go and feel a place should be shuttered because you thought it was dusty. Cooters is free to get in so what's the complaining for? It could have been more,it could have been less. I thought it was a wonderful trip down memory lane and yes maybe merch could have been cheaper but it's a free museaum that has electric bills to pay so if you don't like the t shirt prices then don't freaking buy them. How many places like that are gonna be free? Willie's museum next door will cost you $10 so shut the heck up. Rock on cooter!!",
  "It was a nice visit with all my favorite characters from Hazard County! I was so excited to see General Lee!!! ",
  "This museum is small but packed to the brim with memorabilia and great souvenir offerings.   The General Lee and Uncle Jessie's truck is usually available to see and take photos with just outside the museum.   It's a great walk through memory lane whether you were a fan of the show or not!   Please support!  ",
  "We enjoyed looking around and reminiscing about our child hood and watching the Duke's Of Hazard. This is a fun stop. They have a replica of a child's room from \"way back when\" the Duke's of Hazard was on T.V. Lots of memorabilia from the show to include 3 actual cars. Great place to stop by and relax for a few minutes."
 ]
},{
 "name": "The George Jones",
 "address": "128 2nd Ave N",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/49/1f/ab/the-george-jones-rooftop.jpg",
 "tags": [
  "music",
  "food",
  "delicious",
  "food",
  "delicious",
  "music",
  "music",
  "walking",
  "tour",
  "music",
  "food",
  "food",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d8042439-Reviews-The_George_Jones-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "We hosted a corporate client appreciation function at The George Jones and it was amazing!! Our rooftop reception with cocktails, passed hors d'oeuvres, great live music and spectacular river views was followed by a candlelit private dinner on the third floor. The energy was spectacular, the food was delicious and the service provided by Rodney, Shane and the team was ON POINT. We couldn't have chosen a better venue and I couldn't have received better feedback from our guests. THANK YOU for a one-of-a-kind Nashville experience.",
  "I was impressed with the delicious food, great view of the river and interestingg memorabilia this place offers.",
  "I was lucky enough to visit at opening and had the museum to myself for a good bit.  I always intended to see him in concert, never made it so this is the next best thing.  Really enjoyed looking at artifacts from his youth throughout his career.  Fun the see many of the clips.  Loved seeing his stage costumes and lawn mower.  Very informative.  Don't miss the rooftop bar!  Great views.",
  "I must admit the only reason we came here was because entry was included in the trolley ticket.\nOne of our group is a country music fan so she knew who George Jones was so in we go.\nOnce in and we started going around the exhibits the bells started to jangle and I recalled who George Jones is and some of his music.\nRegardless - this is a quality place to visit and we really enjoyed our visit.\nIf you are a George Jones or country music fan it was have a lot more meaning but everyone will know and remember some of the stars and music.\nThe film is also a must see when you visit.",
  "When In Nashville I ended up there both nights. It was a great place to sit after walking the Broadway strip.  It was had good BBQ pork and awesome baked beans.  A Place to get A decent glass of wine and the best music. Loved a father son duo on Sunday night.  Will be back!",
  "I was in Nashville at time hockey game. so Broadway was packed and found this off main area. Great BBQ food, good selection of beers with good music. I added the George Jones museum tour to my visit which is on the second floor. Was well worth the visit.",
  "I have always loved George Jones and this is such a sweet tribute to him. It is a beautiful museum with lots of information about the life of George Jones. Not to mention that the staff are the best. Don’t miss this great place.",
  "Typical southern style cuisine with excellent service and ambiance, but so-so food choices.  My ribs were fatty and just okay tasting. My wife's chicken was okay, but a little dry."
 ]
},{
 "name": "Patsy Cline Museum",
 "address": "119 3rd Ave S 2nd Level",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/10/fb/c8/love-the-cowgirl-costumes.jpg",
 "tags": [
  "tour",
  "active",
  "cheap",
  "performance",
  "history",
  "family",
  "music",
  "history",
  "music",
  "walk",
  "music",
  "family",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g55229-d12281778-Reviews-Patsy_Cline_Museum-Nashville_Davidson_County_Tennessee.html",
 "source": "TripAdvisor",
 "reviews": [
  "Toured the Patsy Cline Museum in Nashville today. Fantastic collection of Patsy Cline memorabilia, made even better by the active cooperation of her family such that there are even two rooms displaying actual furniture from her home in its setting. \n\nLots of her clothes (stage and personal) are on display and many of her personal artifacts. There’s a nice short film on her life and a whole section on the famed Jessica Lange bio-pic. One treat is that they’ve digitized her entire wedding album, family photo album, and also her scrap book and you can view them page by page. There are also videos of some of her performances you can watch with headphones on.\n\nA display on her band shows many of their instruments, and of course, there’s a very touching display on her untimely death at age 30 in a tragic plane crash. This even includes the watch she was wearing at the time. I was surprised to find that her last performance, a benefit, was on my wife’s 10th birthday.\n\nThere’s a nice gift shop with a wide variety of items. The staff were particularly nice, especially Mario, who added a great deal of additional Patsy history and family details as we ended our visit. We’re told her daughter makes periodic visits.\n\nThe museum is accessed through the center aisle of the Johnny Cash store by taking the stairs or elevator to the 2nd floor of that facility. The fee to tour the museum isn’t cheap at $18, but if you’re a Patsy Cline fan, it’s worth every penny. Truly! Restrooms (if you’ve purchased a museum ticket or souvenir- code number on receipt opens their locks) and a coffee/snack bar are available in the Johnny Cash shop on the first floor, along with Nashville and Cash souvenirs.\n\n",
  "xThe museum is small, but very interesting.  There are headphones located to listen to Patsy's hits, and there are many.  Here life was cut so short.  There is a section where you can see Ed Harris and Jessica Lange in a clip from the movie Sweet Dreams, the life of Patsy Cline.  Worth the money to see it.",
  "This museum is above the Johnny Cash museum and is accessed by lift to the 2nd floor,\nit has great  music and history to  the life of a  great artist, this museum tells of the short life of a great country singer .\n\nThis museum must be on your to do list when in Nashville",
  "If you're a fan, i think this should rank as a must do.  I admit I was not a fan as I didn't really know Patsy Cline's stuff beforehand but my girlfriend is a fan and she wanted to go so we did.  It turned out to be a great little museum.  It shouldn't take too much time to do - about an hour or so - but it's pretty rewarding as you'll get to know all about Patsy Cline's short life and career.  You'll see some of her costumes and personal effects.  You can even put on some headphones and listen to all her songs if you so choose.  Located on the second floor right on top of the Johnny Cash Museum.  We recommend.",
  "I’ve always been a Patsy Cline fan so this was a must see for me. It is located above the Johnny Cash museum near the Music City Center. It is a little pricey as others have said, but worth a look if your a fan of Patsy. They have lots of photographs, personal letters, clothing, and other personal items of Patsy’s that are interesting to see. It took me about an hour to walk through the museum. I’m glad that I made the time to visit here! ",
  "This museum has a good selection of memorabilia of Patsy Cline. It is on the smaller size but the amount of items it has is worth the trip.",
  "Wow- what a great little museum! The staff is great and it is worth your time. You get to peak into Patsy's life and how she acheived and made it in a mans world of country music!",
  "I have not yet been to the museum itself but i do intend to plan a visit in the near future once the situation around the world calm down. Patsy is truly living in our hearts and we all love her soul touching voice.\n\nIt would be an honor to meet Mrs Julie Fudge her daughter and get to know her a lot more on a personal level. Pasty is an inspiration, a role model and a motivation in life.\n\nLove from Manchester, England",
  "This is a very small museum but Patsy died at 30 and had a limited career.   The exhibits were wonderful.   I loved the costumes!",
  "Museum is smaller than I would have expected.  But still enjoyed all the history and memorabilia.     Great family photos and timelines.  \nOnly disappointment - customer service.   We lost track of time and had to get our rent a car - was in museum 5 min - still by cashier - and staff would not let my friend come back (Reentry) or get refund.    I would have understood if we had been there a while - but not 5 minutes.   ",
  "Great way to spend a few hours in Nashville. Nice insight into her career, as I was not alive during the Patsy Cline years, so a nice insight into Nashville history, in the heart of the city."
 ]
}]
