[
{
 "name": "The National 9/11 Memorial & Museum",
 "address": "180 Greenwich St World Trade Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/99/a4/88/photo0jpg.jpg",
 "tags": [
  "experience",
  "peaceful",
  "walk",
  "calm",
  "walk",
  "experience"
 ],
 "website": "http://www.911memorial.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Such a sombre and humbling experience the museum is well planned and a very moving tribute to people who losts their lives on 9/11 and 1993 and the Memorial pools are amazing i was honoured to pay my respects ",
  "We took the subway downtown early on a Saturday morning to pay our respects and see the 9/11 Memorial.  As you walk around each enormous  Memorial, you read the names of the loved ones who lost their lives that day and listen to the calm of the flowing waterfalls that provides a peaceful place to gather and remember.\n\nWe decided not to go through the museum.  There was a very long line so I would recommend purchasing museum tickets ahead of time if you plan on seeing the museum, too.\nInstead, we walked around the area and spent time reading the names.  ",
  "A very worthwhile trip  , superbly done built on the old foundations of the twin towers , great to see and you walk around at your own pace and you can spend the whole day there reading tributes etc  You will leave feeling that you have under achieved in life and could do so much more to help others as so many did that terrible day !",
  "There are two lines.  Buy your ticket online and only wait in one line.  You can spend many hours if you read all the signs and listen to all the talks.   Very nicely done.   Rooms were very crowded at times making it hard to get close to areas.",
  "Visited Ground Zero and a little sceptical as to what it would be like but very impressed with the experience. It brought back the memories of the day. It was tastefully done, the right balance of informative, thought provoking and spiritual.  Give yourself a few hours but also recognise that for those that did not remember the day (albeit from the office in the UK) it may not have a lot of meaning - but like the WW1 memorials - it should and the museum and whole ground zero experience should help share those memories with the next generation",
  "If you do anything in New York, go here. It makes you stop and think. Allow enough time as it is on different levels. The only down side , which sounds petty is the cafe could be larger. Please go and see this museum.",
  "This is a must!\n\nVery spectacular but emotional at the same time. \n\nI love how patriotic the Americans are and how they have invested in that part of Manhatten.\n\nWould go back again.",
  "This is one of the most humbling experiences and something you want to take your time walking around.\n\nIt has been done is such an authentic way and respectful to those it affected.\n\nThere isn't a great deal you can write about this to be honest, as you know what you are visiting and why...\n\nAll I would say is, it's humbling, moving and very very well thought through.....\n\n#Respect"
 ]
},{
 "name": "The Metropolitan Museum of Art",
 "address": "1000 5th Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/2c/15/ac/the-metropolitan-museum.jpg",
 "tags": [
  "free",
  "family",
  "kids"
 ],
 "website": "http://www.metmuseum.org",
 "source": "TripAdvisor",
 "reviews": [
  "What can be said about the MET that hasn’t been said before? I have visited the MET multiple times and everytime I find myself fully captivated by its grandness.\n \nThe Impressionist period is by far my favorite, always captivating, I also highly recommend The Greek and Roman Sculpture Court, one cannot visit the MET without visiting The Temple of Dendur, the only complete Egyptian temple in the Western Hemisphere.",
  "Fantastic museum with amazing pieces of art!  They've got tons of Egyptian stuff like the \"Book of the Dead\", an amazing impressionist exhibit, very cool Arms and Armor section, Greek and Roman art, and tons more!  You could spend days in there!",
  "There are only a handful of world-class museums on earth and any list of the best will have the MET, as it's affectionately called. If you are visiting NYC for the first (or 10th) time, you really should schedule a visit and allocate at least four hours to cover the huge space and make it worthwhile (although you need more than a day to really see it all). In addition to its travelling collections, the MET has a huge permanent collection that contains over two million works, ranging from Asian Art to Egyptian collection (which contains an actual whole temple from Egypt, dissembled, transported and reassembled, mummies and more), a huge American wing that will engross you for hours, European art and sculpture, Greek and Roman Art, Islamic Art, Modern Art, and of course the famous Costume Institute, which has become all the more popular and renown thanks to American Vogue Editor-in-Chief, Anna Wintour, who raises funds for it through the annual MET Ball. In fact, the Costume Institute Complex is now named after her. \n\nThe entrance fee is a \"suggested\" US$25 but you can give less. Don't be shy if you want to pay less; the staff there deal with thousands of visitors daily and won't bat an eyelid if you offer to pay less. \n\nMy tip is to decide beforehand which exhibits and galleries you want to see and then use the free maps to plot, then follow that when you are there. Don't try to see everything because you can't in a day and you will exhaust yourself and also get lost. You can also get a free 250 page guidebook online at the newyorkpass website. The MET also has an App that you can get free for the iPhone and Android, and this contains maps, recommendations on what to see, listings of exhibitions, events, and how to visit the Museum. You can also save your favorite art, events, and exhibitions, and add them to your calendar. \n",
  "This museum is beautiful and is the best museum I have been to. It definitely lives up to the hype around it. The art was displayed beautifully and had so many gorgeous rooms. My favorite were the Temple of Dendur room and the American wing. These rooms were beautiful and made for the best photos. My best tip is if you want to go but don’t have time to be there all day do your research to see where your must see pieces or rooms are located and have a plan for when you get there. It is super overwhelming since it is such a humongous building but if you know your plan it will make the best use of your time. We unfortunately did not have all day when we went so we saw everything we wanted to see in 3 hours plus lots of extras along the way. Make sure to stop by and see William the Hippo in the Egyptian art section since he’s the mascot of the museum. He’s not overly impressive but don’t leave without seeing him, you’ll regret it. My only complaint is that the staff were not very helpful with directions and didn’t seem to be overly concerned with answering questions. But it could have just been the few we talked to. So make sure to grab a few maps at the entrance so you don’t get lost. Overall we loved this museum and can’t wait to go back to see the other sections that we didn’t see.",
  "I came here a couple of times thinking I was going to benefit from this museum. Boy I was wrong. I wasted a lot of time here back in 2017 to 2018. Thank goodness I never came back here ever again. The boring statues and long walks... You receive nothing from this place when you visit here. The MET benefits, you dont. Don't think about wasting your money here since you get nothing from a museum. Museums are a waste of time and money. Should've been demolished than the good old art deco and swing jazz age buildings built in the 1920s to 1930s.",
  "As an NYC local, I have been to this museum many times. I've gone alone (I bought a membership.), with friends and with family. There is so much to see, from permanent collections to new exhibits. You won't see it all in one trip or even several, so pick what most interests you and explore from there with as much time as you have. It's one of the best museums in the world. It's also right next to Central Park, and a great place to visit on a hot summer day or in inclement weather.",
  "Dont miss it if you are going to NYC. The only advice Id give, is if you are going with kids...pick one section to go see, maybe two...and plan a \"break\" after an hour (the snack bar? go outside onto the lawns of next door playground? and then go back in) The place is soooo huge, it gets very overwhelming (especially for kids) unless you plan just to see one section that everyone is interested in...then go have lunch. You will not see this whole museum...it would take days.",
  "A great attraction for any art lover. My daughter wanted to visit here so we used our pass bought via Groupon. Not my cup of tea but it's well worth the visit. A good attraction for when the weather is bad. It was very busy but very informative and laid out. The Van Gough painting was great to see and there were some very weird and wonderful pieces! One of the biggest museums I've ever been to, be prepared to spend at least half a day here."
 ]
},{
 "name": "Central Park",
 "address": "59th to 110th Street Manhattan Borough, from Central Park West to 5th Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/16/1a/e6/new-york-city-central.jpg",
 "tags": [
  "experience",
  "kids",
  "walk",
  "calm",
  "walk",
  "kids",
  "jog",
  "free",
  "walk",
  "walk",
  "calm",
  "family"
 ],
 "website": "http://www.centralparknyc.org",
 "source": "TripAdvisor",
 "reviews": [
  "Central Park makes the concrete jungle of Manhattan livable for everyone in NYC and anyone who visits. This man-made, 850 acre park is so extensive and so varied that it takes more than one visit to experience the Sheep's Meadow. the Great Lawn, Belvedere Castle, the Delacourt Theater, more than a dozen ball fields, two turtle ponds, a lake, a bike trail, jogging trails, Strawberry Fields, Bethesda Terrace and Fountain, row boat rentals, the Boathouse Cafe, Cleopatra's Needles, about three dozen bridges, the upper lake called Harlem Meer...and the list goes on --  all simply wonderful and all man-made.  Plus, nature's contributions including wildlife from turtles to ducks to hawks, a multitude of songbirds and more.  The park is lively with music and theater in the warm months, a great place for picnics in the summer and  ice skating in the winter.  It's a MUST.  Throughout the park there are posting of phone numbers that enable you to hear the narrative backstory of each area, most recorded by famous New Yorkers.",
  "Lovely views, great open spaces, excellent people watching, lovely surprises like the Alice in Wonderland statue, the model boat pond, rowing on the lake, strawberry fields, the horse stables, and all of the things you have seen in the movies! And it is FREE!! A great place to take a break from shopping or after a day inside the Met or the Natural History Museum.",
  "Zoo\nPonds\nReservoirs\nIce Skaing\nBeatles Memorial\nBridges Galore\nBuskers\nBikers\nJoggers\nKids playgrounds\nBoat house\nBoulders to climb\nSheep's Meadow to meander\n\nGreat green space used by the locals and visited by the tourists.  Never disappoints\n",
  "I highly recommend taking a bicycle ride round Central Park. We went during the March thaw (probably not the best time to go) but it was breath taking! Maybe a bit too big to cover on foot in 1 day, so bike is a must. Get a padlock as well because you have to dismount in certain areas. ",
  "We hired bikes with the kids and cycled round Central Park. If the day is nice then this is the go. Make sure you get a bike lock and wonder off from time to time. You will need at least three hours if you do it this way, but only 2 if you don't get off your bike. You will need half a day if you walk. Could not get over the amount of people around, just amazing.",
  "A visit to NYC is not complete without a day in Central Park. For a change of pace try the upper half of the park. There are way fewer tourists and there are some great treasures up north. Make sure you visit The Loch, The Ravine, The Harlem Meer and The Conservatory Gardens. \nWhile I love the southern part of the park it can get very crowded. Among the Top spots in the south are my favorites The Mall, The Bethesda Fountain, The Ramble and The Great Lawn. \nLeave the crowds and head north you will not be disappointed.",
  "A beautiful park. Oasis of calm in the heart of the city. Some nice picnic spots, benches to sit on, trees, cafes and access to the zoo.  Well worth spending an hour or so in every day.  Felt very safe and also clean with little or no litter.",
  "I always walk or jog here but it tends to be crowded during the summer. If you have kids, take them to the zoo inside. be careful of the hawkers inside. Also rent a citi bike instead of the bike rental shops they're crazy expensive.",
  "This park is an amazing retreat away from the hustle and bustle, also it's totally free!\n\nYou can walk for hrs and not see all of it, I would recommend walking the side closest to 5th Avenue which is so scenic!\n\nCountless attractions, bridges, Trees and lakes to take pictues of!\n\nDO not go at night!\n\nEnjoy",
  "Central Park never gets old! There are fields for picnics, beautiful ponds, rocks to climb, paths to walk, and so much to explore. Tourists tend to roam near the south side of the park, and the more calm parts are the north sides. The North Woods is a quiet trail that was designed to look like the Adirondack mountains. I will come here just to walk around and relax, or with friends for a picnic. It never gets old. One thing to be aware of, is that the carriage rides and pedicabs are extremely over priced, and you would be much better off renting a citibike walking. Also, the bathrooms are dirty, but that should be expected for park bathrooms. ",
  "This park is fantastic in such a metropolitan city of New York downtown center. We can not imagine, as if were in China, probably most of it were with tall buildings, no many green area.... we recall the nice park behind Potala Palace, Lhasa, Tibet, where we walked quite often in our daily Lhasa life. This park is great for family, solo and any travelers..."
 ]
},{
 "name": "Empire State Building",
 "address": "20 West 34th Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/f3/82/90/the-new-exhibits-at-esb.jpg",
 "tags": [
  "experience",
  "walk",
  "experience",
  "history",
  "family",
  "history"
 ],
 "website": "http://www.esbnyc.com/buy-tickets",
 "source": "TripAdvisor",
 "reviews": [
  "We had an amazing visit to The Empire State Building - Fantastic Clear Skies gave amazing views - visiting the 102nd Floor for the first time added an extra buzz - Priority Access worth every penny - Outstanding Visit, highly recommended ",
  "Wow! Empire State Building doesn’t disappoint, probably the most exciting experience of our trip! Something very magical about being at the top of the most iconic building in NYC, the view is incredible and being able to look down into the city streets was amazing and you can see the Chrysler building really well too (neither of which you can do so well at Top of the Rock) and the exhibition at the start was fascinating. Would not hesitate to recommend. Loved it, thank you!",
  "A must see visit when in New York great day and night ,large indoor viewing ,lovely Art Deco decor , outdoor area with 360 views ,\nQuick and efficient lifts ,queues moved swiftly, gift shop , \nGreat experience , great staff , \nJust a short 10 minutes walk from our hotel The Wyndham New Yorker ",
  "I visited NYC back in the summer of 2017 to the empire state building. I wasted about $39 just to look at tall buildings, trees, water, and the sky. It was no fun. Plus going up the empire state building was so windy that it nearly blew my hat off. It is also dangerous since its so high. The only thing they can only brag about this building is that it was built in the 1920s or 1930 and king kong was filmed in 1933 before the disgusting hippies and babies born in the mid 1920s to 1950s destroyed america. How vicious and disgusting they were and still are from the day they were born til now.",
  "This was always on my bucket list when visiting New York and it was amazing. However a few tips before booking this. There is no information once you've entered the queues, if you have elderly relatives, small children or any health issues, you could be waiting a very long time standing, there is no information given to the length of the queue etc and they seemed to go on forever, one after the other, some waiting time information would have been useful. A bit chaotic getting to the top.\nHowever once you've waiting and gone through the queues and security it is well worth it. Not great if you don't like heights! \nThe views on a clear day are spectacular and you can see for miles. It does get very busy at the top as you would expect but worth every penny.\nWe went early morning and were at the top in around an hour. The history of the building was a nice interesting touch on the way up.\nThe beautiful Art Deco of the building is amazing, such an iconic building you simply must visit. \nI would definitely go back during a sunset.",
  "I obviously didn't get to go on my vacation to New York City because of the pandemic,  so we did not get to use our tickets. I asked for a refund and was told it was a no refund policy. ",
  "The visit was so beautiful, excellent service and the view is spectacular. Many photos for my family album.",
  "We had entry to this as part of our Big Bus Tour ticket. A really interesting trip up to the top of the building and some fantastic views.  A really interesting history of the time it was being built and how.  Well worth the time spent. Very much an iconic building.\n"
 ]
},{
 "name": "Top of the Rock",
 "address": "30 Rockfeller Plaza Enter on West 50th Street, between 5th & 6th Avenues",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/20/ff/cd/top-of-the-rock-observation.jpg",
 "tags": [
  "experience",
  "experience",
  "cheap",
  "history",
  "experience",
  "learn",
  "drink"
 ],
 "website": "http://www.topoftherocknyc.com",
 "source": "TripAdvisor",
 "reviews": [
  "'The  Observation Deck has breathtaking 360-degree view of New York City,  with three levels of indoor and outdoor viewing access to stunning views of the skyline, Central Park, and Midtown, as well as landmarks and skyscrapers Great place to get great photos level makes your photos ,an experience unlike anywhere else in the city.'",
  "Easy ticket and entry system Fantastic unobstructed view of all of Manhattan, Empire state building and central park, Great to see sunset and lights come on, really made our trip to New York, great Value for Money",
  "What a great way to see the Manhattan Skyline at night.  A real treat!  Best to go when you have familarised yourself with the buildings/location so that you know what you are looking at.  Quite busy at night and outside the Rock there is ice skating so you can make an evening of it.  Allow an hour for the viewing - so much to take in.  We visited at 19:30 and not too busy.  Wrap up warm too!  The lift itself is an experience - won't spoil it for you - well recommended!  Visited the Empire State too in the daytime - good to see both night and day views.",
  "One of the biggest advantage to choosing this observation deck is that you can get a fabulous view of the Empire State Building plus the 360 degrees bird's eye view of Manhattan. Recommend to purchase the tickets in advance to avoid queue at the counter. Not necessary to have tickets printed as they can be scanned on devices. If you wish to go up at a specific time, it's always better to have at least 1 hour allowance ahead your desired viewing time so to not miss anything. E.g. To be up at the observation deck at 4pm, book the ticket that enters at 3pm. This is because the line is always very long, and even though the admission is based on the time slot, it still depends on the overall crowd flow to decide when you can enter. Visitors are allowed to stay for as long as they wish up there once you have entered.",
  "The Top of the Rock offers phenomenal views of the city, including the Empire State Building and Central Park.  A favorite spot for photos of the city!  Though it isn’t cheap, budget for this attraction…it’s worth it as a part of your experience of the city!  On the way to the elevators that take you to the observation deck, there are displays offering the history of the Rockefeller Center, including a few short videos that you can watch to learn about the building and it’s history.  I would choose Top of the Rock over the Empire State Building for views of the city.  Radio City Music Hall is just across the street, so see it while you are here!",
  "Quick tip - Climb the rock if you want to best views of New York and the Empire State Building.\n\nWe planned a day where it was clear sky's and it made such a difference because the whole of Manhatten could be seen, with 360 picturesque views available.\n\nMilitary discount is 50% I think but the discount I got was great.\n\nYou are not going to get better views and pictures at the moment in New York and of the Empire State so this is a must!\n\nAlso, visit the restaurants under the rock for a quick bite and drink.\n\nWould visit every week if I lived in NYC",
  "Get the CityPass option so you don't have to line up in the horrendous queues....\n\nTo be honest, there isn't a huge amount you can say difference from the Empire State, etc in that you are at top and great views...... The only thing to be aware of here is it gets congested with the lines getting in. You are in a shopping centre and security move you on all the time.\n\nNot sure there is a better way to plan it out, but that side of it the Empire State is better.....\n\nIt is of course a great thing to do, great views and well worth it....",
  "Neighborhood gem and and oldie but goodie. Observation deck is grand. Perfect venue for corporate holiday events. Decorated beautifully. Food is catered Deliciously and excellent variety. Ordinary day with clear skies, you can the boroughs, with unobstructed view. Don’t miss it.",
  "I love views over cities. If rooftop bars or viewpoints, most important is to see as far and as much as possible. From this tower you're able to watch over several districts. \n\nThe saftety guard was very friendly and explained us what we see where, don't be afraid of asking them. I'm sure they'll be helpful.\n\nThere was a short waiting line, but I remember that it did not take as long as I expected.\n\nRecommendable viewpoint 10 out of 10!",
  "We got there with prebooked  tickets for the sunset and they gave us a 2 hour wait even though we had prebooked then gave all the good immediate timeslots to people who just walked in off the street very disappointed with the way they prioritise the veiw was still nice but didn’t get to see the sunset"
 ]
},{
 "name": "Statue of Liberty",
 "address": "Liberty Island",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/b7/e5/02/photo3jpg.jpg",
 "tags": [
  "history",
  "walk",
  "wander"
 ],
 "website": "http://www.nps.gov/stli",
 "source": "TripAdvisor",
 "reviews": [
  "We have been up to the Statue of Liberty on a previous visit but only sailed by on a boat.  The island visit is definitely worth it, we went across from Battery Park on the ferry and went on to Liberty Island, the views of Manhatten are fantastic and seeing the Statue of Liberty so close up is amazing.  Definitely worth a trip.",
  "One of best monuments to be seen before u die and best time to travel on weekend from the jersey side and also try to book in advance for crown tickets (Best view from the top of statue )",
  "An icon of America, so we wanted to make sure we did out trip justice, so made sure we booked the Crown access early, I think I booked in March '17 for our visit in July '17, to ensure we had crown access tickets, as none available on the day!. We saw lots of disappointed families who didn't realise, and who even queued in the line for crown/ pedestal access thinking they could get in with a general ticket.  \nBe aware of the airport style security before you even get onto the ferry, so if you purchase say a 12 noon ticket in the expectation of getting to the statue at that time, no, that's the time you can get started on the security clearance and the ferry journey before getting to Liberty Island. Book an early timed access ticket, so you can also get to Ellis island same day.\nCrown access well worth it, but be advised that the steps leading to the crown after pedestal level are very narrow spiral stairs, I just about managed to fit at 6ft 6\" tall.\nMuseum very interesting at the base of the statue about the history and construction of Liberty.",
  "We had the first ferry over in the morning and it is way less crowded at that time.   Gave us lots of time to walk around without too many others in our photos.  The ferry takes you right out front so the photos are great going over.  You have to book 5-6 months in advance to get inside and we never had that much notice when we were going to go so that was not an option. :(.   ",
  "Another site being part of our Big Bus Tour ticket. The ferry crossing gave a great view of the city and pleasant enough in itself.  The park around the statue most enjoyable to wander around and close up to the statue gives you another aspect of the structure.",
  "We took a ferry from NJ to the island. Did not get passes to go inside of the statue as it was late in the day. Would like to go inside someday. Also did not have time to visit Ellis Island. Plan ahead, wish we would have. ",
  "We have seen this in many movies & pictures, but to stand at the bottom & look up It is much more meaningful & powerful.\nAs this was the first sight that our ancestors saw when they came to AMERICA.",
  "Historic! just a tip. if you're planning to see Lady Liberty, take the ferry from Staten Island. It's FREE! It's just a subway ride "
 ]
},{
 "name": "Brooklyn Bridge",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/3a/14/1e/photo3jpg.jpg",
 "tags": [
  "walk",
  "walk",
  "walk",
  "low",
  "run",
  "run",
  "walk",
  "walk",
  "walk",
  "walk",
  "walk",
  "walk"
 ],
 "website": "http://www.nyc.gov/html/dot/html/bridges/bridges.shtml#brooklyn",
 "source": "TripAdvisor",
 "reviews": [
  "Great walk across the epic/iconic bridge great views of the sky line also Ellis island n Statue of Liberty about 30 minute walk each way dress warmly as the wind can be very “biting”",
  "This is one of the most amazing bridges in New York and are definitely in the sea in New York City You can get amazing photographs from the bridge with the architecture in the background this is an amazing day out and it takes a good 40 minutes to walk across the page I would recommend doing this on a nice day it has amazing views",
  "When in nyc you must take the walk over the Brooklyn bridge the views of the city and the other bridges and the Statue of Liberty are breathtaking, lots of bikes to rent if you’d rather take that option and there is a bike lane too",
  "Okay, okay, so we all know what the BB looks like right? But have you ever walked across it? Ahh! If not, you don't know what you're missing. This is a life Bucket List kind of thing. Go early or late in the day, preferable when its sunny. The light will dazzle you. You'll feel like you're flying, or on top of the world. Ships pass by underneath, helicopters fly low overhead. People from all over the world will be there, speaking all languages. You'll get bumped, almost run down by bicyclists. Get your picture taken. Be a tourist! You'll love it.",
  "Go early any day of the week, especially the weekend.  Otherwise you'll be run over by tourists!  It's easy to combine a trip down to the South Street Seaport, or the park on the Brooklyn side of the bridge for a great view of the lower Manhattan skyline.",
  "My husband and I walked across Brooklyn Bridge on a cold but sunny Tuesday morning. Super walk that took around 20 minutes each way. Much busier on the return journey so might be worth doing earlier rather than later in the day. Do be careful and avoid stepping into the cycle lane as the bikes come through fast! We took the subway down to Brooklyn Bridge (green route 6) and had a lovely breakfast at Westville Dumbo. ",
  "We rode the subway over to Brooklyn and then walked back toward the city.  It was a cool Nov day but the view and the walk were both great.  Highly recommend.",
  "i am an unfit overweight person\nmy wife encouraged me to go  on the walk\nreally enjoyed it great photo opportunities of manhattan\nonly takes a couple of hours",
  "We ended up walking over the entire bridge. Was not in our plan that day. Got to the other side and took a while to find a subway entrance. Would not recommend with older people who struggle to walk. You can walk a little bit in and take your pictures and then just return back.",
  "An amazing spectacle of engineering and impressing views of New York so I highly recommend taking a trip to see Brooklyn Bridge.\n\nQuick tip, Walk across and then catch the tube back or visa versa because it's a very long walk.\n\nBe prepared for all the wannabee Instagrammers taking countless pictures...",
  "Nice Experience to walk on the bridge. Massive bridge with beautiful views. can see most of the iconic buildings in New York from the bridge."
 ]
},{
 "name": "Manhattan Skyline",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/35/49/80/manhattan-skyline.jpg",
 "tags": [
  "experience"
 ],
 "website": "",
 "source": "TripAdvisor",
 "reviews": [
  "My second trip to New York and the skyline seen as the BA courtesy bus took us from the airport in New York to New Jersey - alas the flight landed in the wrong State!  A good 90 minutes drive from one to another, and not what you want to do when you have just arrived in the country.  The bus circled us around Manhattan and a most exciting view of the skyline.  Also saw the skyline from the ferry trip to Staten Island and Ellis Island.  Looks great also from the water.",
  "Saw the Manhattan Skyline while on a tour guide and it was amazing! the structure of the buildings just outweighs anything on this planet",
  "We did this first thing in the morning just before we were going to back across the Brooklyn Bridge (from Brooklyn to Manhattan). Its such an amazing view, one of those things that is like an out of body experience seeing it. One of those things youve seen so many times on TV and then there it is. So many gorgeous photo opportunities, what a brilliant view.",
  "What an iconic view; just like in the movies! Unfortunately, we had a bad storm coming in that day, so it was fairly cloudy (although made for atmospheric photos!), but you can just stand and take it all in for ages; truly is something special to behold.",
  "If you like photography, this is a very nice location! go in the morning of afternoon for best light"
 ]
},{
 "name": "The High Line",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/86/71/32/at-sunset.jpg",
 "tags": [
  "walk",
  "unique",
  "experience",
  "walk",
  "historic",
  "experience",
  "walk",
  "history",
  "learn",
  "adventurous",
  "food",
  "walk",
  "tranquil",
  "walk",
  "free",
  "walk",
  "kids",
  "experience"
 ],
 "website": "http://www.thehighline.org",
 "source": "TripAdvisor",
 "reviews": [
  "A unique experience walking through NY via a disused railway \nVery nice walk through skyscrapers \nVery cool and a great way to walk of the best brunch ever at Bubbys which is opposite the start of the Highline",
  "I have traveled the high line during these last three years and always in the month of January.\nEven in Winter it is a lovely walk\nyou can stop in many places and visit for example la Iglesia de Nuestra Señora de Guadalupe, Chelsea Market, Withney Museum (new), See a sunset in New Jersey, Hudson Yards.....\nI hope visit in spring",
  "The HIgh Line is a wonderful old railway park perfect for taking a stroll and enjoying panoramic Hudson River views when the weather is fair, or, treat yourself to a rich cultural experience by visiting the new Whitney Museum of Art located on the southern end (downtown side) of the High Line pathway. Museum Restaurant Cafe onsite. Check on line when museum is closed. \n\nThe High Line is wheelchair accessible and strategically located in the historic Meat Packing District with cobblestone streets, numerous eateries and bars for coffee, ice cream, brunch/lunch, dinner or cocktails. If shopping's your thing, neighborhood is chock full of trendy fashion shops with popular and cutting edge designers.\n\nDid you know, more than a century ago this neighborhood was the site of the city gaol (jail).\n\nTip- Best to go on a week day after 10am to avoid crowds, if going for dinner and a night stroll make reservations at a nearby restaurant. Taxis are plentiful off 9th Avenue.",
  "The high line was without a doubt one of my favorite places that I visited while in New York. It seemed as if the a city was able seamlessly combine nature within the steel and mortar of the surrounding buildings. When I visited the high line, it gave me the feeling that \"Urban Jungle\" must be a term inspired by the city of New York. The high line features street artists, tours, outdoor markets on certain days. If you want to visit without the hustle and bustle of the tourists, definitely check it out on a weekday before breakfast. It truly is a beautiful sight to see. You will take a walk though history as you will notice the old rail road tracks that once ran through the city which are now covered in flowers and plants native to the city. Make sure you read the placards spread throughout the area as you will learn so much about how the high line came to be. \n\nMy partner and I took an Uber at the time and we're dropped off near a set of stairs that take you up to the high line. Take comfortable shoes as it is a long walk; hopefully by the time you've been there you've become accustomed to walking everywhere as you will well notice that New Yorkers walk walk walk (and very fast). ",
  "I have visited the High Line every season. Each time, the essence of change has been phenomenal- snow drops and crocuses right now. Best to go as early as possible from mid Spring and to the end of Fall - it gets a bit crowded but not agoraphobically crowded... I see something new each time.  Fun to hit the Chelsea Market  when done or if still in the mood of exploring- head west to the Hudson River greenway- nice walking or bike path - South to Battery Park or North to near Central Park if adventurous enough!!!  A must go.... ",
  "What a delightful bit of nature in the middle of the busy city.  Especially beautiful in spring and summer when all the flowers are blooming, but relaxing to walk in all seasons.  Many places to sit and relax along the route.  A food area that serves among other things...ice cream,  is definitely a welcome sight on a hot day.  Jump on at any entrance and enjoy the sights.  Can get crowded, but try for early morning or late afternoon to avoid the crowds.",
  "We took a leisurely stroll along here one pleasant summer morning. You can see city life going on all around you yet you seem so removed and tranquil. ",
  "Just seems like some rich people got together to make an elevated park. Not sure whats so amazing about it. The fact that you have to elevate a park means that there is no room below for it. Also all the marketing for it is so pretentious. Its just an elevated overcrowded park. Just because it cost a lot of money to make doesnt mean it’s fabulous ",
  "I have visited this park many times since it has opened. It is a beautiful place to walk around and relax. Unfortunately, the High alone has become a tourist attraction which makes it very crowded, especially during times like Memorial Day weekend and the Fourth of July weekend. If you are nearby I definitely recommend checking it out and taking a nice walk down the park, if it isn’t too crowded. ",
  "The High Line actually starts at 34th Street, between 11th & 12th  Ave. It is a great way to have a 1.45 miles walk. It get busy as the weather get nicer. Its a free park for public. Even with the crowd we were able to complete a nice walk with the view of the Hudson River, beautiful Vessel structure, walk between the buildings, through the building, and enjoy various city architect while I had nice chat with my team. It is always good to walk with water bottle, may be some snacks so that you can make stop, sit on the designated areas and spend some time as well. After we reached at the end, we walked back to Chelsey market.",
  "They keep adding little tidbits to this abandoned raised railway to make it more of an experience.  One of the coolest aspects is that it starts by the Whitney Museum and there is Ample Hill Ice Cream shop at its bottom. it has plants benches and art sculptures.  If you have money to burn, at the very end the new Hudson Yards is close by.  Somewhere in the middle is a window where you can watch traffic fight it's way up 10th avenue.  My kids weren't impressed, but that's because we have a back yard. Most people don't, and I think as a tourist you can definitely appreciate the Whitney art museum whereas my kids are too young and bored by the mere thought of walking a mile and a half long elevated park.  Your experience may differ."
 ]
},{
 "name": "One World Observatory",
 "address": "285 Fulton St One World Trade Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/0e/f5/46/sky-portal-step-on-this.jpg",
 "tags": [
  "peaceful",
  "history",
  "experience",
  "learn",
  "food",
  "experience",
  "interactive",
  "experience",
  "free",
  "experience",
  "experience",
  "experience"
 ],
 "website": "https://oneworldobservatory.com/en-US",
 "source": "TripAdvisor",
 "reviews": [
  "The sky scrapper of NYC.Awesome city view.The sky ball lift and observatory great experience.What travelers are saying We enjoyed every aspect of this trip - the modernistic subway, the entryway to the observatory, the fantastic elevator ride, the short film with the awesome unveiling and the beautiful views!",
  "This is simply a stunning view.  Beautiful views of the harbour, Brooklyn bridge, Manhattan bridge, Statue of Liberty, Brooklyn, New Jersey, Empire State Building, Chrysler building and the very emotional World Trade Center site.  There isn’t a bad view from up here.  I recommend going closer to sunset so you can get Day views, sunset views and night time views.",
  "Visiting OWO (One World Trade Center) is much, much more than just enjoying an observation deck. It's an emotional journey. Historic at first, when you are in the elevator ride going up to the 102nd floor, when you can learn about New York City history projected on the walls of the elevator. Starting in 1492, when you are on the first floor, until current date, when you reach the top floor of Freedom Tower. It's incredible how much an elevator ride can turn into an in-depth experience.\n\nThen, well, I won't tell you because I would screw up with the wonderful surprise when you watch a dynamic video project on a huge wall of the observatory. At the end of this video, WOW. Just WOW!\n\nThere's more: watching the sunset from up there is speechless. You can also see the Statue of Liberty (like it was a little ant), New York Bay, Brooklyn Bridge, Manhattan Bridge, Queensboro Bridge, Williamsburg Bridge, and Manhattan iconic landmarks - as well as Brooklyn, Queens, Hudson River, East River, part of New Jersey, the traffic of hundreds of boats, ships and ferries - and so much more.\n\nTake a moment to just be quiet observing the horizon line. It's peaceful and exciting at the same time.\n\nWhen you are amazed with it all, then comes even more: the elevator ride going down.\n\nThere's also all those emotions and sensations when you remember what's happened on that ground zero - and how this new One World Trade Center (A.K.A. Freedom Tower) represents more than just a building.\n\nIt's worth every cent of the ticket.",
  "Short queue to enter. Great visuals during elevator ascent. Superb views of NY from top. Do not buy the premium packages- not worth it in my opinion. Standard tickets more than adequate.",
  "Its a must for NYC visit. You can spend hours here. Must arrive around 10am if you wanna skip the lines or crowd. you can also buy the tickets online or on groupon which is even cheaper. The lifts are superfast, considering you reach 102 floor in no time. The staff is very professional and courteous. The view from the top is breath taking. You can literally spend hours n hours here. We booked lunch here too. Ita at 101floor. The view is awesome and food is soooo tasty. The overall experience is 10/10.",
  "Well this building doesn’t disappoint - it’s stunning. We went to visit ground zero and the memorial gardens. We decided to book tickets for the one world observatory. It’s located on the 102nd floor of the new world trade centre. The lift takes 47 seconds to reach the top, which is crazily quick. Once at the top, the views are sensational across all aspects of the city and beyond. They offer interactive iPads at a cost of $15 each, which allow you to point them in the direction that you are looking at and it tells you what you are seeing. There was 5 of us, so they gave us 5 iPads for $30, which was a great offer. You can spend as much time as you want up in the observatory, I would recommend going late afternoon/early evening - that way you can experience the views in the day and also at night. If you get the chance to experience this whilst in New York, you won’t be disappointed. The staff were all very informative. There is a coffee shop and eatery in the observatory, a gift shop and also somewhere to buy beer and wine, if you want. ",
  "The attraction gets everyone attention at the first experience when you enter the lift. Then we're all surprised with what I'd call a gift! An extraordinary audio and visual experience at the beginning of the tour which input in our minds a huge \"WOW\". Then, we're free to be pleased with the spectacular view.",
  "This was our first trip to the top since the loss of the twin towers. Elevator ride was very informative and once you get top the top it is still easy to spend hours picking out landmarks.",
  "The One World Observatory is an amazing experience. Unfortunately the day we had to visit the weather was overcast.and we didn't actually get to see the windows open. Having said that it was an enjoyable visit ",
  "This was definitely a highlight of our trip!  We paid extra to access the ipads and it is definitely worth it.  We enjoyed lunch in the restaurant with a breath taking view.",
  "My experience in the One World Trade Center was magical I got a whole view of New York I learned a lot and I was amazed at the elevator with how fast it went, I highly recommend it, it is an unforgettable experience!"
 ]
},{
 "name": "Grand Central Terminal",
 "address": "89 E 42nd Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f3/4b/4e/grand-central-terminal.jpg",
 "tags": [
  "kids",
  "history",
  "walk",
  "family",
  "experience",
  "delicious",
  "walk",
  "history",
  "learn",
  "unique",
  "history",
  "history",
  "experience",
  "food",
  "food"
 ],
 "website": "http://www.grandcentralterminal.com/",
 "source": "TripAdvisor",
 "reviews": [
  "Because thousands of commuters pass through Grand Central Terminal every day, there's a market, filled with delicious pre-prepared foods, fresh fruits and vegetables, and even a small outpost of the EAT Gifts.  As a tourist, this is a GREAT place to pick up delicious goodies for an impromptu picnic in Central Park, or snacks for midnight cravings in your hotel.   \n\nIf you have a little more time, consider having a meal at the Grand Central Oyster Bar.  First opened in 1913, this restaurant is a true NYC gem, offering up over twenty varieties of fresh oysters, a large menu of fresh, grilled and fried seafood choices, and an ambience and history that makes The Oyster Bar a very fun dining experience! Just outside the entrance to the Oyster Bar, is a space with a high vaulted ceiling.  The four corners offer a bit of magic.  If you and a friend will stand on opposite corners, you can speak directly into the wall, and the geometry of the space will carry your message up the wall, across the ceiling, and to your friend on the other side, earning the area the informal title of \"the whispering walls.\"  It's a ton of fun, and kids will get a HUGE kick out of sending and receiving messages!\n\nIf cocktails are more your speed, The Campbell Apartment is a super swanky spot. The space was first rented out in 1923 by William Kissam Vanderbilt II, whose family built the terminal. It was once the ornate private office of early 20th century railroad exec and financier John Williams Campbell, andlater a studio for CBS Radio and a jail used by Metro-North Railroad. Today, it's a step back in time, and a little hard to find, making cocktail hour both glamorous and a little mysterious. \n\nIf pure history is what you are after, take some time to admire the the zodiac mural on the ceiling of the Grand Concourse, one of New York City’s most beloved pieces of public art, created by French pastelist and etcher Paul César Helleu in 1912. The signs of the zodiac from October to March are outlined in gold leaf and modeled with nearly 2500 tiny, stippled gold leaf stars.Be sure and walk outside to 42nd street, and admire the gorgeous facade, particularly the imposing sculptures of Mercury, Hercules, and Minerva at the top. I never tire of the view, both during the day and at night, and few sites make me feel more truly in the heart of Manhattan than time spent in Grand Central Terminal.  ",
  "whispering gallery is a MUST!!! the ceilings is a must!! and please if you happen to go there go to one of the stores there P!Q super fun, excelente service and great prices!!! \n",
  "A must see if any NYC break\n\nSuch a beautiful Building and it is a wow factor when you go in \n\nFree to walk around and explore \n\nGood to hire the tour guide handsets so you can walk around and get to learn the history \n\nSuch a stunning building to visit ",
  "This place is well connected to the subway network in Manhattan. Any time you feel like you need to catch a breather and are near this building, do drop by. This was the erstwhile Grand Central Depot, built under the formidable eyes of Cornelius Vanderbilt and stands as a mark of the true American industrial spirit. Apart from its rich history the architecture of this building is quite unique.  You can roam around the terminal or sit down in one of the staircases and gaze up at the ceiling. The artwork may not be inspiring the curved dome like structure is sure to invoke awe. There are lots of coffee shops and quaint restaurants which may a good option for a snack or dinner. Its a little bit on the expensive side, but it gives you that added time to admire the building and watch the world go by as you stand still. Its a rare feeling in todays world. Be wary of the station guards as they may sometimes ask you to keep moving if you loiter or sit on the stairs too long. You just need to shift around and it should be cool.",
  "Wow amazing photos, particularly at night with the Chrysler Building in the background. Visit the Oyster Bar, it’s a must for any goody, top tip go happy hour Monday to Wednesday plus Saturday 4pm to 7pm for great value oysters.",
  "Have been to New York twice in the past 2 years and one of the places I keep going back to is Grand Central. Not only because there are trains to everywhere in and around NY but because it has everything. The architecture is awe inspiring. You just have to stand on the main staircase and gaze around. From the astrological signs painted on the turquoise ceiling to the wonderful spherical brass clock - it is a true landmark. The subdued lighting makes for a special feel too. The Grand Central market is just the place to buy a snack. Just to see the array of meat, fish, fruit, vegetables, cheeses, coffee and bread will fill your senses, the colours, the aromas! There are many shops to browse, the staff all very willing to help. The restaurants and dining concourse are to be recommended; in fact you can spend a happy couple of hours in this Aladdins cave of treasures and still not have seen it all!",
  "We ended up transferring from the subway to the bus here and had a chance to enjoy the great old architecture. ",
  "This is iconic NYC. Filled with history from the arcitectural plans to the first day the trains ran and have never stopped. A magnificent structure with 24K gilded millwork, exquisite imported tiles, granite and marble, it’s an artists’ dream come true. Viewing all the tracks alone and hearing the whistles blowing, are worth the visit. Filmed for many famous movies, used as a venue for constant corporate events/weddings, it remains as one if the finest structures of art in the world. Now filled with pricy and chic pubs,  seafood restaurants and shops, you you experience the whole shebang in one place.",
  "This was one of my favourite places in New York even tho it's just a station! the old architecture is second to none and you start to realise how many films the Grand Terminal is in.\n\nEasy access and simple system! hustle and bustle everywhere.",
  "We spent some time in the terminal. It has very big open space and lovely stairs. There’s also little shops for buying local food.",
  "It is just great to feel the buzz of the station and you can't imagine you are in the middle of a big city., as this is a small city in itself. Do not miss out on the food market, because that really has some of the best eateries around."
 ]
},{
 "name": "The Met Cloisters",
 "address": "99 Margaret Corbin Drive Fort Tryon Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/b7/f9/4c/the-cloisters.jpg",
 "tags": [
  "unique",
  "free",
  "knowledgeable",
  "free",
  "kids",
  "walk",
  "run",
  "food",
  "walk",
  "knowledgeable",
  "free",
  "walk",
  "historic",
  "experience"
 ],
 "website": "http://www.metmuseum.org/visit/met-cloisters",
 "source": "TripAdvisor",
 "reviews": [
  "If in the mood for time transportation, check out the glorious Cloisters Museum in northern Manhattan.  Yes, a bit of a schlep to get there (take the A or 1 subway) but worth it.  Once there, a quietly serene transportation back to the Middle Ages - like walking through an exquisite monastery - the whole 9 yards, what with winding staircases, tiny chapels, gardens, crypts, and galleries loaded with amazing Christian art.  And several gorgeous gardens, with breathtaking views of the Hudson River and the Palisades (cliffs) of New Jersey on the opposite side of the river.  Never mobbed with tourists (unlike its Mother Museum The Met), the Cloisters can be enjoyed on dual levels.  Medieval art in a unique museum that doesn't seem like a museum, or just a quiet place for reflection and/or contemplation, in a placid environment.  In manic, maddening, Manhattan.",
  "A branch of The Metropolitan Museum of Art (MET).\n\nA cloistered outdoor gardens nested in Washington Heights in Fort Tryon Park is a museum and garden devoted to medieval Europe of Romanesque period filled with paintings, period arches, Gothic arch doors, arch windows, tapestries, stained glass, metalwork, sculptures and extensive gardens.  Doorway arches of limestone and marble date back to 12th century to 15th century era.  The structure of this museum appears to be a medieval castle.  Beautiful! The gardens does have plants and some culinary herb plants used for cooking.  With my Meetup group we joined the guided tour which is very extensive and informative.  Refreshing to the mind, spirit, eyes and camera lens.  Photography is permitted without flash.\n\nOverlooking views of the Hudson River and George Washington Bridge is very scenic and breath taking especially during the autumn foliage.  Easily accessible by A train.",
  "My husband took me up to the Met Cloisters as a surprise for our 21st Wedding Anniversary. Left the snarky teens with our friends and took a nice subway up and away from the bustling downtown. I had no idea what he had planned until we arrived at this quiet place, and got tickets to their Garden Tour. They take a maximum of 10 guests, and it is free. Our guide, Betty Anne, was very welcoming and knowledgeable about medieval gardens and the beautiful landscaping and incorporated some of the lovely tapestries displayed including the famous Unicorn tapestries, which helped to inform what is known about what was planted at the time. What I liked about Betty anne is that she made sure her attention was on us, even as random patrons who were not part of the tour asked questions and offered their opinions. She was quick to turn the attention back on us and our inquiries. As for the rest of the museum and grounds, all was very interesting and a nice change of pace from all the bustle.  And certainly a respite from the stifling heat of August!",
  "I used to run through the park every day.  This museum is right out of the Middle Ages, so take a sweater or jacket, especially in cool weather. Spectacular tapestries and other artifacts.\nThe gardens attached as beautiful all through the year.\nThere are a few parking spots that are usually filled on weekends.  There is a restaurant within a few steps and a great neighborhood with 2 playgrounds.  One right outside of the park entrance, so kids can get a little culture and then, run around.  The museum, like the Met, has a suggested donation, but is free.  I used to give a little something every time I went, but not the suggestion because I would only be there for 30 minutes.\nTake the A train to 181st Street.  Get in the front 3 cars.  When you get to the station, take the first set of steps and then the elevator up.  Turn right outside the station doors and follow to the museum - a 5-10 minute walk.  187th Street has a number of restaurants and bars, so take a look as you walk.  ",
  "When you need a break from the hustle of midtown and downtown, the Cloisters offer much-needed respite. It's best enjoyed when the crowds are few so go early and avoid the late afternoon hours on weekends.",
  "I went on a rainy day and the cloisters and surroundings were beautiful in the light drizzle. It's a really nice walk through Fort Tryon park before reaching the cloisters so make sure to check it out. Note that there aren't that many food options available nearby. I had to walk a distance to Inwood for lunch.",
  "Wonderful museum, but allocate enough time since there are so many exhibits. The senior ticket allows entrance for several days.",
  "Sometimes I forget that this museum is in NYC, as it seems so unlike the rest of the museums in the city.  It's in the northern part of Manhattan but easily accessible by subway and bus, so please do go in warm weather and soak in the scenery and artwork.  The art are arranged so that people can take them in at their own pace and at an unbiased, neutral angle, and I'd say that the buildings themselves are part of the art.  The tours are wonderful, as the tour guides are really knowledgeable and make the art more fascinating.",
  "I highly recommend taking the once-daily highlights tour.  On the one-hour tour, the guide discusses a number of items in depth.  It’s like getting a free university lecture.  \n\nWe took the subway up from where we stayed in Times Square.  It was easy to get to.  After the train, you can take the bus just one stop or walk through the park (if you’re healthy and the weather is nice).  We chose to take the bus on the way there and walk back through the park.\n\nThe ticket from The Met Cloisters can also be used at The Met—it’s good for three days.",
  "We lived in the UK for 40 years, so have seen many historic buildings and museums full of artwork. The Cloisters is not like any of them. It's a wonderfully effective array of individual items displayed in a neutral environment, allowing its beauty and craftsmanship to be appreciated without distraction. The rescued buildings and architectural samples are brought together in a way that feels natural and yet allows visitors to see each one on its merits. It's wonderful, and it's set in a park that feels unlike any other part of Manhattan. ",
  "This is a wonderful Museum.  Get there early, enjoy the entire experience at your own pace.  Three day passes are perfect for breaking up you NYC visit."
 ]
},{
 "name": "Rockefeller Center",
 "address": "45 Rockefeller Plaza Rockefeller Centre",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/93/30/1d/photo1jpg.jpg",
 "tags": [
  "family",
  "learn",
  "family",
  "free"
 ],
 "website": "http://www.rockefellercenter.com/",
 "source": "TripAdvisor",
 "reviews": [
  "This is always a favorite place to visit, right by 5th Avenue, St. Patricks Cathedral, Radio City Music Hall, the Tower, the ice skating rink, many shops and restaurants, and of course the beautiful Christmas tree and other decorations in December.  We enjoyed music, the lighted tree.",
  "Rockefeller center has great  architecture, great shops, restaurants, ice skating, movie scenes from Home Alone, murals on the ceilings and an underground passageways to help you get back and forth and stay warm!",
  "Love this place! you do get the feeling you are in NYC! brand stores around ( I personally liked the Lego Store), you can do ice skating, have coffee or just look around  - nice flowers and waterfalls. ",
  "Go at night - it has the best views of NYC!\n\nIt is much less crowded than the Empire State Building, but offers a lot more for your money!",
  "Go on line and book the combination tour / Top of the Rock. It saves waiting and money. The tour takes precisely one hour and concentrates on the architecture and art work of RC. I hadn't even noticed some of it before, and it's beautiful with wonderful symbolism. It is not the NBC studio tour. More than half the time is spent out doors, so wear warm clothes if a chilly day. If you have mobility issues, beware there is no sitting on this tour. The guide was fabulous--knowledgeable, very funny, enthusiastic, and he does this tour 3 times a day, 5 days a week. We were in a group of 10 and the only Americans. It was fun, but I am guessing the rapid speech of the guide (hey he's native to the City), may have been difficult for some of the guests, though they seemed to enjoy the tour. At the end, we were taken immediately to the Top of the Rock here there was no time limit placed on our stay, so lots of time to look and snap photos. A great way to spend a couple of hours. The subway cones right not the Center so easy to get to also.",
  "The Rockefeller has several features that makes it a very good stop. \n\nThe Top of the Rock is very nice, similar to Empire State but with a better view of Central Park and not so much of the Liberty Statue, Financial District, etc. It must be more enjoyable during the warmer seasons because the higher you get, the colder it is. Ideally, do the Top of the Rock in early morning : lot less crowded.  Also, you'll enjoy the elevator ride to and back from the Top...we are far from the classic awkward elevator music. \n\nDuring winter, the Rockefeller had a small ice rink outside, surrounded by original and fancy shops. Once you have visited the Rockefeller building (or even better, once you have had a tour of the building) make a stop at the Lego shop : you'll find some interesting pieces of art that will make you smile! \n\nThe tour organized with the Rockefeller building is definitely worth it. It was both interesting and entertaining. You will see how and where the architectural ideas come from and learn several interesting facts about both the building and the famous family behind its construction. \n\nIt's a stop that might not seem interesting, but was definitely a highlight in my trip. The New York Pass offers both Top of the Rock and the Rockefeller tour in its attraction, so it might be a very useful option for those who wants to visit several NYC musts and save on the final price.",
  "Wated ice skaters.. you can watch from inside from under the statues, ask how to get in there. Many places to eat in there too.\nThere is a Friday's just south (kind of next door on 5th ave) great for a hot cup of tea or coco and soup on a cold day.",
  "Great Business trip for Flywebmakers \nas always after subscription many new businesses get high visibility online and as flywebmakers do not take competitors in the same location all businesses are like a one big family .\nthanks for Rockefeller Center for a chance to do Matterport projects and a lot of great contacts we see us in March 2021 again .\n\nBest Regards Flywebmakers Team",
  "This is always a favorite place to visit, right by 5th Avenue, St. Patricks Cathedral, Radio City Music Hall, the Tower, the ice skating rink, many shops and restaurants, and of course the beautiful Christmas tree and other decorations in December.  We enjoyed music, the lighted tree.",
  "There's nothing like ice skating in Rockefeller center.  The VIP line is the way to go found in the basement.  No need to waste hours waiting in line and you get cookies and hot chocolate for free.  ",
  "Visit at Christmas time is a very nice time to take in all the visual holiday decorations and the spirit of Christmas."
 ]
},{
 "name": "Radio City Music Hall",
 "address": "1260 6th Avenue Between 50th and 51st Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/29/a1/03/radio-city-music-hall.jpg",
 "tags": [
  "kids",
  "experience",
  "family",
  "experience"
 ],
 "website": "http://www.radiocity.com",
 "source": "TripAdvisor",
 "reviews": [
  "Attended the 2019 Holiday show, and was so impressed. The integration of tech graphics, the orchestra, live animals, the chorale singers, and of course the phenomenal Rockettes,  into the sets was perfect. I hadn't been to Radio City in years, and it was as exceptional as I remembered. ",
  "... and take the children ages 4 and up. It is truly spectacular, from the world's largest organ to the multipying Santa Clauses to the 3D visit to NYC to the Rockettes to the on-stage Ice Skaters to the finale ... a giant nativity scene with real camels and other animals. The building is a magnificent example of Art Deco and should be admired before the show and at intermission (go down the grand staircase to the lower lobby and restrooms . They try to sell you expensive souvenirs for which there is NO need - tell the children in advance that you're not buying any - and just enjoy the amazing spectacular.",
  "We went to Radio City to see the Rockettes Christmas Spectacular - what a wonderful environment - what a incredible place - totally blown away by the venue.... the show was wonderful.... loved it",
  "Radio City Music Hall is a beautiful venue,  we went to see the Rockettes Christmas show.  Truly amazing, made our trip that extra Speacial.  Don't bother with getting seats at the front, get them right at the back, it's cheaper and you get the full effect of the show and can still see everything.  It was pure magic!",
  "This was truly a CHRISTmas spectacular. My lady and I thought that this would have been too childish to see but we were in the area and many folks kept bragging about it so we tried it and and I cannot be happier with the results. The lines seems to go by fast so do not get scared when they are around the block. The bathrooms are easily accessible. Security is very tight. The venue itself is very classy all around. The souvenir shop is reasonably priced. The show starts off kind of slow but then you get an experience that only Radio City can bring to your eyes and ears. The Rockettes were on point and so elegant in their craft. I do not want to spoil it but it has a beautiful ending and message. Thumbs and toes way up! Definitely will bring my kids next time. Overall, great value and comfortable seating for the price. Many great things to look at before the show and worth the 1 plus hour show.",
  "I've been going to Radio City since I was a little girl and I never get tired of it!  The Christmans show with the Rockettes & Santa is the best!  Costly, but if you're from out of town, it's a must at Xmas.",
  "We stopped in at the theater the afternoon of the show and got great seats.  It was a sell out show too.  The show was great.  I was very pleased.  If you are ever in NYC close to Christmas, go see their Christmas show.",
  "Incredibly well organized, had a great seat and their performance was simply pure perfection.  Would have preferred less visuals and more emphasis on the music.  The venue was packed and the two days were 'sold out'.  Drove all the way to see them and they were brilliant.",
  "A really interesting tour to see the inner workings of Radio City.  You get a good look at an art deco masterpiece from the historical stage elevators to the lounges, the theatre, the grand foyer, and private rooms.  It was fun taking a picture with a Rockette.",
  "Every Trip that I make to New York try to go to the RADIO CITY MUSIC HALL. I did more or less 32 from 1995 to Now and I enjoy just simply to see outside. I made pictures for the TONY AWARDS twenty years ago when I was journalist...Very nice experience. The shows at the RADIO CITY are memorable. A incredible experience to tell when You and Your family go back to Your Country!!!",
  "Excellent show which was professionally staged. Dancers were very synchronized and visual effects were fantastic!"
 ]
},{
 "name": "Bryant Park",
 "address": "between 40th and 42nd Streets & Fifth and Sixth Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/46/7a/36/bryant-park.jpg",
 "tags": [
  "food",
  "peaceful",
  "free",
  "learn",
  "food",
  "free",
  "food",
  "food",
  "food",
  "free",
  "delicious",
  "food"
 ],
 "website": "http://bryantpark.org",
 "source": "TripAdvisor",
 "reviews": [
  "It feels really magical at Christmas time, with its amazing ice-skating rink and the Christmas market, which offers a variety of  good exotic food & superb views of the lit buildings around and the amazing frozen fountain",
  "Despite being right in the heart of the city (42nd Street close to Times Square) it still manages to feel relaxed and peaceful. Lovely cafes and restaurants but, for me, the range of free activities on offer is very impressive : juggling, table tennis, an open air library from which you can borrow books, boules, yoga, dance, 'learn a language's - some activities are Summer only.",
  "This is one of the quintessential New York winter spots for the holidays. (Whoever came up with the idea to put up this winter wonderland was a genius.) There are about 100 or more shops, food areas, and a large ice skating rink with free ice skating (if you bring your own skates). Be forewarned however that it is very crowded on the weekends and there are lots of extra charges at the skating rink to rent skates, or check bags, etc. There are lots of food eateries but except for the Bryant Park Grill (which is very expensive), they are very crowded and limited in what they serve, and there is very limited seating - if any at all. Even with these caveats, how can you resist the beautiful atmosphere with ice skating, wonderful holiday music playing, a very beautiful and large Christmas tree, and lots of different shops to browse - and of course all the wonderful people watching. I would recommend this to New Yorkers and out-of-towners alike! (Plan for 1,2, 3 or 4 hours depending on what you do.)",
  "I worked right across the street from Bryant Park for over three years. Every time they weather would warm a little I would go have lunch there. They set up a big area with tables and chairs. The food at the restaurant is pretty good too but pricey. The Thursday happy hour is awesome but PACKED; get there early to secure a spot. ",
  "This is a lovely park next to the main library ( which starred in the film the day after tomorrow) and is lovely for coffee, cakes..\nLots of space to relax....outdoor cinema n summer...just lovely. Avoid the restaurants as they are overpriced and the food is not great...gongonthenlittle coffee stalls in the park instead much cheaper and great snacks.",
  "It's worth the extra money to pay for the immediate access pass to the skating rink.  The regular line was very long.  We loved the rink, and thought it was a great place to skate.  Rockefeller Center is nice too, but this has a totally different fell- more like a small village.  The restaurant overlooking the skating rink has a great view.  The Carrousel on site is very nice, and the vendor shops set up around the rink are great for browsing.  Some in our group did not want to skate, so they had had plenty to do - and a great view from the restaurant \"Celsius\" - which features glass-enclosed lounges.",
  "Great place to shop, stroll and sip hot chocolate.  They also had an ice rink although we did not get the chance to try it.",
  "What a Lovely park. In the summer, it's great for sitting at one of the benches or tables with a cold beverage, snack and a book. It's very close to the public library and always has a lot of events going on. My favorite time to visit is in winter, when the Christmas market opens and there's free ice skating at the seasonal outdoor rink. Grab a steamy hot chocolate, peruse the beautiful and fun crafts and holiday gifts, and skate around with a gorgeous backdrop of the city. As you can imagine, it's quite popular so it gets crowded fairly often.\nCame here for the Winter Village and it was super cool. Definitely suggest dropping in for a visit. They have a bunch of little shops set up in rows, as well as food truck style stops. Think I sampled a little bit from every place but absolutely loved Destination Dumplings. Tried the chicken dumplings. They are delicious to say the least.",
  "Free ice rink and a great Christmas market the atmosphere stays with you and your only around to the public library the reading room  is  something special.",
  "I miss Bryant Park so much now that I don't live in NY! This piece of land is utilised so well. Concerts and picnics in the summer, plenty of benches to eat your lunch or grab coffee with a friend (and always a great place to meet if you're coming from different boroughs, as it's so close to GC), the cutest craft and gift stalls in the winter- and can't forget the FREE ice skating! Such an all-around wonderful public space.",
  "My favorite part of Bryant Park is when they have the Winter park Pop up shops / food carts/ ice skating, etc."
 ]
},{
 "name": "Staten Island Ferry",
 "address": "4 South Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/41/61/63/passing-ferry.jpg",
 "tags": [
  "free",
  "experience",
  "free",
  "kids",
  "experience",
  "free",
  "free",
  "history"
 ],
 "website": "http://www.nyc.gov/html/dot/html/ferrybus/statfery.shtml",
 "source": "TripAdvisor",
 "reviews": [
  "A must of course for a fantastic free view of NYC...but do homework before you plan your time of travel....some ferries are closed decks and some are open....which is much better for photos and experience so check out on board in Whitehall terminal which are open and times of travel.",
  "The Staten Island Ferry is the best free activity in NYC! From the ferry you will have stunning views of NYC, beautiful photo ops and the best view of the Statue of Liberty in context (with the city behind). If you have never done this, you are missing out! Great experience for kids, too! ",
  "The Ferry is 25 minute free service that connects Staten Island and Manhattan The views are nice, you can see downtown Manhattan's skyscrapers, the Statue of Liberty, the Skyline of Brooklyn & Jersey City. The views are picture-perfect, seeing the highlights around New York Harbor.However it is usually packed during rush hour and seats to the side facing New Jersey are taken quickly.Still very good.",
  "Hard to believe that a great way to see the Statue of Liberty, and one of the coolest experiences in New York is still free. This is a must do ride for anyone visiting NYC.",
  "Very well organized with so many tourists on board anxious to go ashore to see the the famous Statue of Liberty.",
  "The Staten ferry was ok but nothing to shout about got to see quite a few sights and bits of New York you wouldn't by foot. So many people try to sell you overpriced tickets which is annoying and there is not much seating.\n\nThe tour guide is very afformative and tells you history along the way and landmarks. ",
  "Free ferry ride that sails past the statue of liberty and Ellis Island.\nI managed some great photos from the ferry of the statue of liberty.\nWorth a couple of hours short trip great fun.",
  "If you are looking to see the statue of liberty at a distance and enjoy a ferry ride at no cost.  This is the perfect outing for you.  It's relaxing and being on the water is full of views of the New York skyline."
 ]
},{
 "name": "New York Public Library",
 "address": "476 5th Ave New York, NY 10018",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/7d/71/33/ny-public-library-reading.jpg",
 "tags": [
  "free",
  "history",
  "free",
  "drink",
  "history",
  "family",
  "history",
  "family",
  "free",
  "history",
  "history"
 ],
 "website": "http://www.nypl.org/",
 "source": "TripAdvisor",
 "reviews": [
  "When we first popped into the library it was quite hard to look around and get a real sense of what you were looking at. Luckily, we managed to get two spaces on the free hour-long tour at 2pm (there are several a day). The tour guide was excellent and explained each room before we went in and pointed out some of the more hidden architectural details. As a bonus, anyone on the tour gets 10% off in the gift shop (something you'll definitely use).\n\nThe library also has a small film (c. 20 minutes) that runs every half an hour that tells you all about the library building and some of the treasures of the collection. It was quite frustrating that a lot of the hidden gems of the collection aren't available to view, but the tour guide told us that a new exhibition was opening in 2020 where they'd feature a rotating selection of the collection (much like the British Library).\n\nWith the tour and the free exhibitions (Salinger and made at the NY Public Library) we easily spent 4 hours here, a definite recommend if you're into books, literature and civic history - they have the original Winnie the Pooh too!",
  "The library has some fabulous reading rooms most of which are accessible to the public and they are free to enter..! The library backs onto Bryant Park which is a perfect spot to relax with a drink or coffee",
  "We kind of fell into this, on our way to the winter wonderland at Bryant Park, but we were so glad we did. Beautiful building, with so many wonderful areas to explore, The reading rooms were stunning and filled with amazing pieces of literary history including Charles Dickens' handwritten notes on a copy of the Christmas Carol for one of his tours of the US. Interestingly the lending collections seemed quite limited, but there was so much else to see and enjoy that this didn't matter.",
  "Visiting the New York Library is an absolute MUST if your coming into the city. It is seated right behind Bryant park, which makes it incredibly easy to kill two birds with one stone. I personally do not ever frequent libraries but at 9,000+ reviews, I suppose people cannot be wrong. There is a superior level of architecture and work that went into this library. From old marble and wood, to the multi-story facility that can assist you with everything from reading, to genealogy, to a nice quite place to study. There is security and bag checks at the front, so keep that in mind. If you have time while in the city, I suggest putting away a couple hours at minimum to tour this library. Their genealogy department is very kind and helpful, with an extensive amount of online and physical research material, just in case you wanted to research your family history while you are in town. The NY Library is also know to house the most extensive research and materials for genealogy based research. Visit for a few hours or even a couple days, either way you cannot go wrong! From the murals on the ceiling to the intricate woodwork, this is a great place for all ages to see! P.S There are ADA accessible elevators within the building as well!",
  "When my daughter indicated this was the one place on her must-do list, I was a little unsure!  But wow was I shocked!\n\nThe architecture is STUNNING!  The grand staircases on either side of the lobby make it easy to see why it was chosen for movie sets, fashion magazine shoots etc.  There was an amazing exhibit on photography through the ages that kept me intrigued for over an hour.  My daughter, an educator, ventured throughout the library to see the many research rooms.  The main reading room was closed, so a little disappointing.  If you are interested in particular manuscripts or rooms, be sure to check the schedule prior to attending.\n\nThe final stop in the library was the amazing gift shop - we found great souvenirs for friends and family!\n\nA MUST stop on your tour of the City!",
  "This is a magnificent building.  If you are a lover of books, architecture, history or literature you would want to drop by for a visit.  Take the Library Way - East 41st St. starting from Park Avenue, it leads West towards the building at 5th Ave. Look down - scattered along the way there are bronze decorative plaques that are inscribed with inspiring quotes from the greats; it makes for a great intro to the building and sets the tone for your visit (just be careful of pedestrians behind you if you are stopping every few steps to read the ground!).  Following the plaques you will approach the library's iconic entrance front and centre - with the lions \"Patience\" and \"Fortitude\" presiding and guarding its doors.\n\nThere is a free audio tour for the library.  You just need to sign it out at the info desk at the entrance hall, it is nice getting a little information as you move around the building and can make sure you don't miss anything.  The building is simply marvelous, so much work and care went into this \"temple of knowledge\"; there are also artwork, decors and collections in there that makes the visit special (For example, the original Winnie the Pooh stuffed characters are there...you won't miss it if you are on the tour).  \n\nCaveat: The Rose Main Reading Room (aka the most iconic room of the library) is currently closed.  That is very disappointing because it was the heart and icon of the complex.   We also went on a Sunday, and it was probably not the best day because a lot of the reading rooms/divisions (even the gift shop) were closed.  Having said all that, the rest of the building is still more than worthwhile and we enjoyed our visit immensely.  \n\nIf you can spare an hour, do go for a little browse (not on Sunday).",
  "The location is right next to the park. It is a great place to just sit and rest before resuming the day. They have a clean bathroom. I been here quite often just to use their bathrooms when I am around the area. It is always nice to see the interiors. nyc doesn't have enough bathroom locations but I am glad this is one of those spots.",
  "First, I adore the structure and the entire design from top to bottom. The reading room with dark brass and green glass lights is famous. Studied there from college on for best research on microfilm and now all digital. Really spent hours there almost daily. Sitting on the iconic steps, watching all the tourists taking pictures with the lions, is a hoot. It remains a true melting pot of ethnicity. One could eat breakfast, lunch and dinner without ever leaving or actually enter the library. \n",
  "Beautiful library. We visited the Rose reading room on the top floor which was stunning. You can’t get the full effect though as the room is divided, one side for visitors and the other side for library users - there is literally a wall between the 2 sides, so difficult to get perspective. Obviously we appreciated its a library first, but selfishly a little disappointed with the view.\nOur main reason to visit was to go see Winnie Pooh and the gang in the children’s section. It was fantastic seeing the real characters. It was surprisingly quiet too. We managed to get lots of photos.\nPoints to note -\nIt was very warm in the library in general.\nThere are info points with maps and also staff to ‘help’ once inside, but my impression was they must get weary with tourist visitors asking questions. I deigned to approach the desk where the staff member was talking to friends (I could tell from the conversation they were having). I stood patiently for about 5 minutes, but then had to interrupt to ask for assistance as it was obvious the conversation wouldn’t be ending soon. No smile, no apology, nothing. I asked my question and was indicated by a hand movement as to the direction I should take. It didn’t spoil the visit, but not great customer service.\nThey have a fantastic library shop selling some really lovely things including Central Library t shirts, books and gadgets.\nI would thoroughly recommend a visit.",
  "I've been to NYC 3 times now and this remains my absolute favourite landmark. It is steeped in history, literature, architecture and everything else you could want. Including the original Winnie the Pooh! What a treat. ",
  "Wanted to visit as this was the setting (part of) for the Ghostbusters movie - showing my age!! The most beautiful building and reading rooms, some private, that are locked off. There's an old fashioned telephone booth as well, good photo opportunity! Kids (teens) were a bit bored but my husband and I love the interior and the architecture. Well worth a trip if you can get there."
 ]
},{
 "name": "Intrepid Sea, Air & Space Museum",
 "address": "12th Avenue & 46th Street Pier 86",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7a/40/ea/intrepid-sea-air-space.jpg",
 "tags": [
  "walk",
  "knowledgeable",
  "low",
  "experience",
  "wander",
  "knowledgeable",
  "unique",
  "history",
  "experience",
  "kids"
 ],
 "website": "http://www.intrepidmuseum.org",
 "source": "TripAdvisor",
 "reviews": [
  "A Family place for sure ! A restored battle tested carrier.Great collection of aircraft on the flight deck and hangar deck. The space shuttle Enterprise  is in its own building on the flight deck.All amazing to see ,wheel chair friendly! Elevators to get up and down.\nPlenty of rest rooms.Parking is hard to find unless you want to pay . Submarine USS Growler is fun to walk all the way through it.Great views of the city and Hudson river from the flight deck.It is  hallowed ground Sailors lost there lives on this ship.My Navy Squadron VA 95 Green Lizards has an A4 Skyhawk  on the hangar deck. Please remember the men who served so you can walk this ship in peace time.Thanks ,Just a Sailor",
  "We visited with our two young children and had a great time ! Highlights included : \n- Friendly and helpful staff\n- The walk-through of USS Growler (the submarine)\n- The excellent (and well maintained) displays in the hangers (especially the kids-zone)\n- The good range of planes on the flight deck\n- Concorde\n- The Space Shuttle\nAn aviation enthusiasts’ dream ! \n",
  "First I must say everyone on the Intrepid staff is very friendly, polite, knowledgeable and caring that you get the most from ALL their tours. I would highly prebuy all tours through directly the Intrepid website and schedule all your tour times asap before coming to the Intrepid Museum. Please call them directly for help in getting all the tour schedules to fit your day. I did and I was able to start at 9am on the only Growler submarine tour, then Pacific War Tour at 10:40 w/Becky, then the 12:30 Concorde tour, then 2pm Space tour w/Jim who is exquisitely knowledgeable on this topic! Then lastly the 3:30pm Intrepid 101 Tour. If short on time and able to take the 10:40am Pacific Tour then I’d cut out the Intrepid 101 Tour. \nYou will appreciate getting time slots filled ahead of time before arriving at the Intrepid Museum, because I’d expect them to be full on the day of arrival possibly. \nOne of the best tour guides was Becky on the “Pacific War Tour”! Our group was of adequate sized and not to many. She took as much time as needed for all questions! If you only have sparing time then this tour is a must and one I believe is a wealth of knowledge on seeing much of the Intrepid and talks of its war time actions! High regards to Becky of the Intrepid Pacific tour!\nAnother tour is the Concorde airplane. Our knowledgeable tour guide for this was Isaiah who also did a great job on the Intrepid 101 tour at 3:30 also. The timeframe and story behind this magnificent Concorde airplane was way ahead of its time to be able to fly as a passenger at twice the speed of sound and allowed to sit in the plane and feel elite on how passengers felt paying huge bucks to be privileged to fly on Concorde and get across the Atlantic Ocean in about 3.5 hours! Listening to how they became to stop service of this magnificent airplane which I wish was still in service. How they spoiled you in their lounges before the flight, then spoiled you more on the Concorde eating Lobsters, champagne. This is a once in life time chance if in NY at the Intrepid Museum to be able to climb inside this faster passenger Jet ever!\nAnother great tour is the Space Tour that Jim  presented! He presented so much knowledge and took us past long lines which is part of buying a private tour which will save you enormous mounts of time and is definitely worth every bit of money.\nThe early morning 9am only private guided tour of the Growler was nice to not be rushed and told about real life stories of crew members that were actually living on this submarine by our guide. I am sorry I didn’t catch his name b/c I showed up a few minutes late for the start. But my  Memorial Day Monday Intrepid tour was positively one of the best days I’ve spent in NY and I can’t stress enough to prebuy and schedule all your tours ahead of time and to call them from the Intrepid’s own website directly. They will help you set up timeframes to get the most out of your tour. \nThe Intrepid staff is some of the best tour guides I have experienced and they should be told this from my review please. Great Museum! Thanks ",
  "The items on display are rarely available to the public elsewhere, and not in one location.  If you like to see navy and military items as well as a Space Shuttle, a submarine and hangar ship, the place is a must. \n\nSome own knowledge or a guide will enhance the experience a lot. Allow around 2 hours in low season and 3 hours in peak season.  Start with the submarine, lines can be long but it is the only nuclear armed sub in the world you can visit. \nVolunteers, often previous military staff, adds a lot if value if you talk to them. We met a navy man who had sailed the Intrepid hangar ship and he had great stories to share. \nLocated next to the cruise tours, great to combine them. ",
  "Great museum that's constantly growing. Since my last visit half a dozen years ago, it has expanded to include a bunch of space stuff, which is very impressive (including the Enterprise space shuttle). \n\nThis is a great trip, well worth while! \n\nOne point to remember, is that you're in a ship. Dress up and you'll manage to find some grease or a stain somewhere! (maybe its just me ;-). \n\nA city pass is great (gets you into half a dozen of the top NYC attractions) for a great price, but the main benefit is jumping the queue at each of them.",
  "This attraction must ne fairly unique, where else can you see aircraft displayed in an environment such as this. Yes I have seen aircraft displayed better and with more information but like I say not in this type of location. Be careful to not turn up to late in the day (check the advertised last admission times) and only take the add ons if you really feel you must. The best thing though is to wander through the various decks and levels and engage with the veterans that are there as guides. They are knowledgeable and engaging. I can't comment about the catering facilities as we didn't use them. Overall a worthwhile visit.",
  "Turns out my wife was much more interested in the Intrepid and the Growler sub than I expected. We visited during a light drizzle but it eventually stopped in time for us to go up to the flight deck. We ended up spending much of the day here to the exclusion of several other things we had planned on.",
  "It was a very good experience because when you go inside they give you a gadget to listen the history of each plane or room. There was a inside area and a outdoor area, in the outside area you had a lot of planes and helicopters to see and in the interior area you had rooms, machine guns, and the cabins. Near the outside area you can see the “ENTERPRISE” (the plane that went to the moon in a mission). When you end the visit you can go to see a submarine that went to the war a few years ago. In short there are planes that go trough the sea and there are ships that go trough the sky. ",
  "An unexpectedly fantastic museum on an aircraft carrier! Lots of planes to see. The Concorde was amazing and great to go into the flight deck. ",
  "We first visited 15 years ago, and in that time it really has changed loads. \n\nReally enjoyed the space exhibit and seeing all the aircraft on the flight deck. \n\nThought it was wrong that you had to pay more to get onto Concorde though.",
  "We bought the general admission as part of the C3. It doesn’t include the VR and the 4D theater. Nice exhibits, and great for families with kids. Employees are not friendly. "
 ]
},{
 "name": "The Oculus",
 "address": "33-69 Vesey St World Trade Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/a5/44/f5/l-occulus.jpg",
 "tags": [
  "walk",
  "free",
  "experience",
  "free",
  "experience"
 ],
 "website": "http://www.wtc.com",
 "source": "TripAdvisor",
 "reviews": [
  "This is a train station/ shopping center which has an amazing architectural design.\n\nI was really impressed!\n\nIt is spectacular!\n\nWorth while visiting. It is very near the One World Observatory and the 9/11 museum so you can do both.\n\nYou do not need to spend much time there unless you want to shop (very expensive shops) or take a train.\n\nA must!\n",
  "Stumbled upon this on my way to the 9-11 memorial. Huge beautiful structure with a few good places to eat and nice shopping. If it’s a rainy day it’s a nice place to walk around.",
  "I enjoy the huge space for a carefree day of roaming around & enjoying the daily events there.  Sometimes it’s art and sometimes it’s a holiday affair.  During rush hour it was mad crazy & busy so avoid those hours.  It was a sea of people trying to get home.",
  "Wow! You will stop breathing for a second when you first come up from the train station. Just a beautiful building. Several stores  for some shopping. But really just take in the beauty. Its free!",
  "Amazing breathtaking experience as you step out the subway station into the huge Oculus. Like its name suggests,it is a stunning eye-like design! It is basically a mall with tons of fancy shops and some classy restaurants and coffee shops.Situated below the new World Trade Centre.",
  "After visiting the 9 11 memorial, we passed through the oculus on our way to the subway station located nearby.\nThe construction itself is massive, architecturally speaking very impressive and spacious, but in my opinion is a punch in the eye.\nInside there is a lot of free space and shops are here and there, I did not see a real concept (although I am sure there is).\nOverall interesting to see once, but that's about it. ",
  "The architecture and look from the inside is quite impressive; But the overall experience is not spectacular or out of this world. Very functional shopping area with paths to the metro and the PATH  ",
  "The Oculus is the architectural gem in the new World Trade Center which now includes a new tower, along with memorial museum and fountains where the original twin towers used to be. It’s definitely worth seeing."
 ]
},{
 "name": "Ellis Island",
 "address": "New York Harbor",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d5/64/9c/ellis-island-canopy-with.jpg",
 "tags": [
  "interactive",
  "family",
  "history",
  "history",
  "history",
  "experience",
  "family",
  "history",
  "experience",
  "history",
  "walk",
  "experience",
  "food",
  "history",
  "learn"
 ],
 "website": "http://www.statuecruises.com",
 "source": "TripAdvisor",
 "reviews": [
  "A must visit while in New York !step back in time  ----don't miss the immigration video - moving and uplifting - check out your family history on the interactive geneology site - nice cafe - great views -",
  "I have visited Ellis Island twice in the last year.  \nMy visits included the audio tour of all three floors of the museum, participating in the Hard Hat Tour, viewing the film \"Island of Hope, Island of Tears\", browsing the bookstore and gift shop, along with Fort Gibson and the Wall of Honor, and enjoying a lovely lunch in the Cafe.  \nAs a second generation native New Yorker, I absolutely recommend this trip to all.  It leaves you with a great appreciation for all the immigrants who took long voyages to freedom, a new life and for the great work done by the Save Ellis Island Foundation to keep this history alive.",
  "Accessible by ferry with great views of Statue of Liberty and skylines \nA treasure trove of history that allows one to appreciate the sacrifices our forefathers took in immigrating to US\nUpon reflection brings one to tears ...a bucket list experience\nHelpful in understanding a component of what made USA great ",
  "Despite being a native NYer, I had never visited Ellis Island before. Perhaps due to the fact that for most of my 54 years the island was abandoned and not open for visitation. Plus, my family arrived in America before Ellis was in service, so, due to my lack of personal connection, I had not thought to visit. Well, I am soooo pleased we did! We opted for the Hard Hat tour, which takes you through the buildings on Island 3 that have not been renovated as of yet. Just fascinating!! Our guide  was enthusiastic and knowledgable, and I really felt like we walking through history (because, I guess, we were!) You get to see the hospital pavilions, the more, one of the old kitchens and also the house where the head doctors lived with their families. I learned a lot of new information. The tour groups are small, ours was only 7 people, so you had ample opportunity to ask questions. It is a haunting and emotional experience and makes the small hassle of getting there worth the bother. Because of our heightened state in regards to terrorism, you need to endure a 20 minute line and airport style security before you board the ferry. However, do NOT let this discourage you. The views of NYC alone make it totally worth it. And the history, if you are a buff like we are, is just incredible. This is an extremely well-run National Park. Wear good walking shoes if you plan to take this tour, it lasts 90 minutes (90 fascinating minutes that is).",
  "Despite the negative reviews we decided we should visit the \nStatue of Liberty and I'm glad we did. We got the first ferry of the day and had no problems with the security checks. We found the guides helpful and good humoured. Do get a monument pass because the museum is interesting and the views from the pedestal just amazing. Ellis Island was less interesting as we don't have a connection with its history but it was easy to have a quick look and jump on the next ferry back.",
  "I recently visited Ellis Island.  When I had visited the Statue of Liberty a couple of years ago, Ellis Island was closed post Sandy.  I had signed up to do the \"hard hat\" tour, which included going through the abandoned buildings of the contagious disease hospital on the south part of the island.  It was tremendous.  Our group was small - I think 10 plus our guide.  Guide was very informative and it was fascinating to walk through the buildings, which have a haunted feel to them.  Advance reservations for the tour are essential, I think (I reserved ~ a month ahead).  I visited the museum after the hard hat tour and enjoyed that as well, although not as much.  I realized during my visit that I had not really understood how Ellis Island functioned, so I learned a lot.",
  "This is a wonderful museum, a great insight into the fabric of the American people, and I'm sure a very emotional experience for those who have personal ties to this place. I found the museum, and whole the experience, very informative and often eye-opening as to the formation of the melting pot that is America. Seeing the large, elegant processing room, polished and sparkling, and knowing that is was once filled with people, looking for a new life...Entering the sterile dormitories where people slept in towers of bunks, like books piled on a shelf...I enjoyed the temporary exhibit on the one thing of importance people brought with them during some of the most recent conflicts, involving refugees from Afghanistan, Syria and Libya. \nI booked through State Cruises, and if I can say one thing, it would be to book the ferry from the New Jersey departure. There were so few people leaving from Liberty State Park, it made the process of going through security a breeze! Also, there is a cafeteria on Ellis Island, but there is nothing stopping you from bringing a picnic to enjoy on the grounds outside, with a knock-out view of the NYC skyline! Combined with the Statue of Liberty, plan on spending most of the day visiting here - we took a 9 am crossing, and finally return to Liberty Park around 3 pm.",
  "Stayed in New York and I can tell you this is an amazing place to find out whereabouts my predecessors  ended up in the America. From there the plan was to travel to England to find out even further where and how far back we went.\nEllis Island is good  with good security and for obvious reasons!\nWell worth taking your time for the research.",
  "We decided to visit Ellis Island by purchasing tickets through state cruises, which offered a fair deal for both the statue of liberty and Ellis Island.\nAfter visiting the first landmark, we headed by boat to Ellis Island, where millions of immigrants came upon arriving to the New world a century ago.\nThe buildings were restored and looked really stunning, the grounds are beautifully kept and there are lots of reading to do inside, movies to see and pictures to look at.\nI did not use the audio guide as I found it quite boring.\nWe spent nearly 3 hours there and could have stayed even more, then my belly was rumbling and we left for Manhattan.\nIt was inspiring reading what immigrants went through, how they lived and what they thought of this new world, we both really enjoyed our time and whenever we will visit NY again this will be one of the first attractions we want to go back to.\nSimply wonderful, touching and inspiring. ",
  "So glad we took time to see all Ellis Island had to offer. There are many exhibits, though I most enjoyed the one that took you through what it would have been like to immigrate through the island. \n\nThere’s a cafe here that had a decent variety in food options and wasn’t way over priced, like I thought it may be.  ",
  "As a fourth grade teacher, this was a place I have wanted to see for a long time, and it didn't disappoint.  This museum was very well done with so much history.  I would recommend Ellis Island to anyone who wants to learn more about American history.  "
 ]
},{
 "name": "St. Patrick's Cathedral",
 "address": "50th Street & 5th Avenue Wheelchair accessibility located off the corner of 51st Street and 5th Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/af/8f/8e/pope-francis-with-msgr.jpg",
 "tags": [
  "history",
  "experience",
  "learn",
  "calm"
 ],
 "website": "http://www.saintpatrickscathedral.org/tours",
 "source": "TripAdvisor",
 "reviews": [
  "Spectacular neo-gothic architecture right in the heart of midtown on 5th Avenue and a wonderful place to spend some quiet time away from the hustle and bustle of Manhattan. Lots of beautiful catholic icons to see inside and opportunities to light a candle, sit quietly and pray, learn more about the history of the building and Catholicism in New York or just reflect on the amazing design and construction. Something for everyone to experience here whether religious or not. ",
  "This extraordinarily beautiful cathedral offers soaring heights, gorgeous stained glass windows, superb acoustics, a great organ and lovely stone carvings in each of the side altars. Mass at St. Patrick's is always full, and some of the most moving services can be experienced in this holy place. Concerts and special ceremonies (weddings, baptisms, etc.) are enhanced by the structure as well as the historical significance of this church. This Neo-Gothic building offers an great contrast to the surrounding modern Americana of tall skyscrapers.",
  "I had heard about this cathedral and had to see it. What a breathtakingly beautiful building.  We went during a weekday, late morning, and there was a small crowd spread throughout. We walked along the perimeter and I was amazed - detailed sculptures, beautiful stained glass windows, the huge pipe organ on an upper level and the amazing architecture of this cathedral! There was a reverent hush - so glad we visited!",
  "I spent about 90 minutes in the cathedral. A beautiful building inside and out. Very calm atmosphere inside after the frenetic bustle of the New York Streets.",
  "This is one of our biggest pride for us the Americans and my favorite building in my life God may be with us all in this moments.Amen",
  "Just an amazing church.  Spend some time there and enjoy the surroundings and take some quiet time to let everything sink in.",
  "I attended mass here early on a Sunday morning and it was lovely to sit and pray and take in the beauty of this beutiful Cathedral. As an Irish catholic the connections are strong to this Cathedral and New York, however it was very unusual to see security in the church and people walking around when mass was being said.  ",
  "The St, Patrick Cathedral is a true icon. Definitely a must do when in New York City. It went thru a major overhaul and it is truly Stunning,"
 ]
},{
 "name": "Madison Square Garden",
 "address": "4 Penn Plaza",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/01/ee/69/madison-square-garden.jpg",
 "tags": [
  "food",
  "experience",
  "energy",
  "experience",
  "food",
  "food",
  "family",
  "walk",
  "experience",
  "experience"
 ],
 "website": "http://www.madisonarena.com/",
 "source": "TripAdvisor",
 "reviews": [
  "A Night with the Piano Man - Billy Joel - although he's 70 and it's his 112th time in Madison Square Garden (The Garden) - he still delivers a great and magically performance with an 2 hours of musical treats from his amazing singing career. A totally and absolutely fantastic experience, sometimes dreams do come true.  \nThe Garden is a magnificent concert stage with perfect sound, video screens and lighting. Great seats. The food service and selection is great and you are meet with service minded personal from outside the stadium to the seating inside. \n#billyjoel #billyjoelmsg #live #madisonsquaregarden #thegarden #nyc #manhattan #magic #dreamscometrue",
  "Right in the heart of Manhattan and above Penn Station you can see the world famous NY Knicks and the NY Rangers along with tennis and other great sports venues..",
  "Watched the Rangers/Islanders game at Madison Square Garden in October, first time ever watching Ice Hockey on my first visit to USA and I loved it!! MSG is huge and so impressive, the whole place is just buzzing with energy and excitement. The game was incredible to watch - made a  fan out of me! Amazing experience 10/10",
  "I have always wanted to see a basketball game in America and to visit Madison Square Gardens so two boxes ticked.\n\nI was quite disappointed that they forced the LGBT agenda on to the crowd with an LGBT theme for everything all night! it's the 21 century and no one cares about your sexuality! everyone is human and everyone is accepted.\n\nThe atmosphere was amazing and the fans are brilliant but the sport itself was quite dull but maybe its because the team isn't very good. haha\n\nDrinks, food and merchndise are so expensive $20 a wine and $15 for a bud light haha\n\nbut its a great event and the crowd go wild when the staff shoot t-shirts into the stand.\n\noh yeah nearly forgot the best part THE CHEERLEADERS!",
  "I can't begin to tell you how amazing this place is. For a start its easy to get to, just follow the crowds - and there are thousands of them - even on a school night! Its just an iconic place too. We were greeted by friendly security staff who search your bags before allowing you into the 'reception area' there are plenty of things to buy from the club shops that pop up. We went in March (to watch the basketball) and September to watch the Ice Hockey - both amazing and entertaining - who'd have thought it. Seat allocations are good, you have a reserved seat and people generally sit in their own seats, if not the plentiful ushers will help you out. Its a great venue. great atmosphere and so big. We absolutely enjoyed the games we watched there and would love to go back.",
  "We attended the Knicks and Pistons game.  I was very impressed with the inside of the arena.  It was easy to navigate and our seats were comfortable.  The food was pretty good.  We all had the chicken baskets with fries.  We were in the 400 level and had to walk far if we wanted anything other than popcorn and hotdogs.  Every stand had the same selection.  It would’ve been nice if every other had something else to offer.  The lower levels for example had pizza along with the yummy chicken baskets.  At this point, I enjoyed my time there, but it was our last stop that made our evening.  We finished at a gift shop to take some Knicks items home to family.  First off, all of the staff was incredibly friendly.  They were all chatting and made us feel welcomed.  Who stood out the most was Marcus (sp), he even dribbled basketball with my son for probably 15 minutes.  He taught him better form and laughed with him.  He was patient and genuine.  He went way over and above what any employee would do.  My son couldn’t stop talking about Marcus.  Additionally, we wanted some Rangers gear and the staff happily got that for us.  We will return to Madison Square a garden and are grateful for the experience that we had!!",
  "Fantastic experience and well worth a trip!! \nWe watched the Knicks play and thoroughly enjoyed it!! Great atmosphere and well worth a visit\nWe also had a couple of daily burgers which were the best burgers we’ve ever eaten!! \nWell worth a trip :)",
  "We visited Madison Square gardens to see a knicks game. The venue is simply brilliant. Very well organised and I would recommend to anyone."
 ]
},{
 "name": "Broadway",
 "address": "599 Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/8a/c7/ff/broadway.jpg",
 "tags": [
  "historic",
  "energy",
  "food",
  "experience",
  "run"
 ],
 "website": "",
 "source": "TripAdvisor",
 "reviews": [
  "The NYC Times Square Hilton is a beautiful, clean and very modern facility with great access to all of the principal activities of NYC, including Broadway, Lincoln Center and the poignant sights of the 9/11 Memorial and Museum.  The price was great and every part of our visit was made more enjoyable by this comfortanle facility in the heart of everything that's happening in NYC.",
  "We visited the Majestic Theater off Broadway and saw the Fantastic Phantom of the Opera!!  What a wonderful Production!!  Loved every min. the music, costumes, awesome dance and acting and singing the special effects the historic theater itself.  It was just so exciting!  ",
  "We went to see Kinky Boots on Broadway, fabulous show, living near London we go to Shaftsbury Avenue, Broadway has a very similar feel, show bizzy glizt, great visit lots of theatres, huge range of shows. There are numerous restaurants to take your pick of before or after shows, worth the visit",
  "I am a regular.  Must see. Go to TKTS, pick a show and go., You will want to go back.  It is always packed with people and very high energy!!! So much to see and do.  A must see tourist attraction, and a great place for New Yorkers. \nPublic Transportation encouraged- travel time in area when driving can be horrific depending on time of day.",
  "Great place to visit and a must when seeing the City, its completly different day time to night time so is a must to see at both times of the day. This is the busiest part of the city (or appeared so)",
  "Seeing a Broadway show is a must see experience if you are in New York City!  TKTS offers discounted tickets the day before and day of a show.  They have electronic boards that list the shows they have tickets available for outside each location.  You cannot choose your seats, but can get tickets up to half off!  There are two TKTS locations; Times Square and South Street Seaport.  Your wait time is significantly shorter at the less busy South Street Seaport location.  Go early for the best selection of tickets!  \n\nI highly recommend “In The Heights” which was a Tony award winner.  The show has lots of laughs and fun, upbeat music that highlights life in the NYC neighborhood of Washington Heights.  Both my husband and I have seen many broadway shows across the country, and we both really enjoyed this show!\n\nCarmine's is a great Italian restaurant in the Theatre district for dinner before the show.  Reservations are recommended, even on a weeknight, but they will serve their full menu at the bar.  We stopped in without a reservation and were able to snag seats at the bar.  The bartender provided excellent service and the food came out fast and piping hot.  We were easily in and out within an hour, and on our way to the show!  Juniors Cheesecake is right in the heart of the broadway theaters and is an excellent choice for dessert after the show.",
  "This place is amazing - so many attractions to see and do it's unbelievable, just like you see in the movies. There's so much going on it's hard to take it all in. Just stop to people watch for an hour! A crazy place and a must visit for all musical lovers.",
  "Broadway was next to our hotel so we walked through it most days and nights usually to visit times square.\n\nepic views of building all lit up and loads of shops to visit!",
  "I have been 4 times and every time always is incredible, architecture is the best part.... I visit convenience stores to know other cultures, people who I know where awesome, I walked during midnight safe Restaurants are wonderful, Hotels are nice but small rooms,  Statue of Liberty is gorgeous, … the  things that I hated them everywhere smell marijuana :(  ...  Everything is expensive ...  Trash is a lot (unreal) ... \nOn your first day, you  must take a bus tour  and then decide where are you will get off to enjoy NY\n:D",
  "Too bad that this show's run on Broadway is over, but it is such a good show that I don't doubt it will make a return at some point! I caught the Sunday matinee, which meant the cast was a little switched up, but all the performances where top-notch, with a special shout-out to George Salazar in the role of Michael. I came out of the theatre with the music swirling around inside of my brain, and it hasn't stopped since. A definite two thumbs-up from me for a great way to spend an evening!",
  "While who ever you ask will have their own favorite show or many,  99% of the time you cant go wrong, i personally like the big over the top musicals but the comedies are also fantastic.  I recommend buying directly from the theaters for the best pricing."
 ]
},{
 "name": "Times Square",
 "address": "Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/d5/ae/38/times-square.jpg",
 "tags": [
  "experience",
  "free",
  "walk",
  "low"
 ],
 "website": "http://www.timessquarenyc.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Amazing place to visit and so different from everything I am used to, great to see in the day as well as at night, with lots of street performers to make the experience even more enjoyable!",
  "We stayed at Crowne Plaza Hotel on Times Sq; very central; great buzz; you can get discounted tickets to shows at TKT booth on Times Sq. Lots of bright neon lights in Times Sq; and watch out for the Naked Cowboy! M&M Shop 3 floors high; be prepared to buy, hard not to!",
  "Times Square will always be my favorite place on earth, from New York City. Full of life and lights, biggest screen ever, best restaurant of New York,\nShop stores are the best, amazing broadway and off broadway shows, clubs, movie theaters etc etc etc. It’s a must visit and explore place!!",
  "If you have never been to Times Square you must visit.  The night is the best view because it’s so bright and lit up that it looks like it’s the middle of the day.  \n\nEverything stays open late and there areas many people walking around, exploring and visiting.  I love the m&m store and doing a bit of shopping. \n\nIt’s always busy and always crazy so be prepared for very large crowds and lots of people. ",
  "Times Square is a must-see for anyone visiting New York for the first time. The area is a far cry better and safer than the war zone it once was in the 80s and 90s. But, there are a few things you should be wary of prior to seeing this iconic location.\n\nAvoid all of the crappy costumed characters and superheroes, especially if you have curious children. They try to lure you in for a photo and then demand tips, often $5 (US) or more. One particularly annoying practice they all engage in is \"swarming\"; they see one having a photo taken and then insert themselves uninvited and demand tips after the photo is taken.\n\nThere are very nasty young men posing as aspiring rappers, supposedly handing out \"free\" CDs; if you take one from them, some will become very aggressive and attempt to intimidate you into giving them a \"tip\" of $10 or more. These jerks also utilize the swarming technique. This is why they are sometimes referred to as \"CD Bullies\". They like to specifically target young adults and teenagers, so keep an eye on the youngsters in your group. Just walk past them, do not speak to them, answer their questions or make eye contact. Do not under any circumstance take a CD as they reach out and attempt to hand one to you!! Be ready for them to call you a racist and/or shout obscenities while walking past; just keep going! If they touch or grab you or anyone in your party, immediately find a NYPD Officer and report the incident; there are cops everywhere around Times Square and they take it seriously if one of these scumbags lays hands on someone!\n\nFinally, watch out for the ticket hawkers, particularly the people promoting the Comedy Clubs like LOL NY. They will try and lure you in with \"discount\" or even free admission tickets. The catch is that there is a two-drink minimum purchase for everyone in a party. The drinks are extremely overpriced at nearly $20 for beer or cocktail and $8 for soda or water. LOL is a seedy joint and the talent is mediocre at best.",
  "Busy and filled with light , Walk around and explore. Be cautious of pick pockets and be aware that the costume character will ask for a good sum if you take pics with them.( sometimes they try sneaking in pics also) Dont buy cds from people stopping you there as it is a scam. Walk around and be dazzled and explore the disney store. Souvenir shops are very expensive instead one can buy from stalls on street which have combo deals and low prices.Keep count of time and definitely sit back and attend any live dance/show happening on the streets by artisans!",
  "Always crazy busy as you would expect but a must visit when in New York. Keep your wits about you, a polite no to the sellers is enough. So much going on, great shops too!",
  "Well it's lost a bit of it's appeal after scrambling across Shibuya in Tokyo, but it's still the bustling jewel of NYC.",
  "You have to go and if possible, go at night when all the lights are on.  The New Years Eve ball is visible all year long if you know where to look.  Lots of people.",
  "Its bright. Like daytime bright even at 10pm. Ton of people everywhere. Watched some street performers. Felt very safe as there were several police officers all around. ",
  "Brought clients here in late February and could not have been more appreciative or more thankful. It was evening and \"The Great White Way\" could not have looked any better. They were first timers. Guess when you are not used to seeing bright lights, tall buildings and poster boards of giant celebs- it's a WOW- as it should be. This is a must see and  not ever miss at anytime.Nothing like this this in the world. I am a true NYC kid!"
 ]
},{
 "name": "American Museum of Natural History",
 "address": "79th Street Central Park West",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/b7/e7/76/photo0jpg.jpg",
 "tags": [
  "walk",
  "learn",
  "food",
  "food",
  "experience",
  "walk",
  "history",
  "educational",
  "historic"
 ],
 "website": "http://www.amnh.org",
 "source": "TripAdvisor",
 "reviews": [
  "The dinosaurs, the whales, the wildlife and biodiversity from around the world and throughout the ages.  From early visits as a school girl to the Hayden Planetarium - that's become highly more sophisticated in the decades since - to bringing my own grandchildren to watch 3D movies in  Samuel and Ethel LeFrak Theater, I've \"closed\" this museum many a time when my journey has begun in the morning.  Spend at least a day there when you're in NYC: they have SO much to choose from!",
  "I first visited this museum at the age of six, and somehow whenever I see it I become six years old again.  The museum is one of the glories of NYC; its greatest features include its halls of dinosaurs and extinct mammals and sea creatures; its many halls of exhibitions of wildlife from around the world; the famous Blue Whale; its mineralogical and geological collections, and the breathtaking special exhibit on butterflies, which happens for several weeks at a stretch, twice a year.  Don't miss the butterflies, whatever you do, if the exhibit is up for your visit.",
  "This was our second visit to this outstanding museum, which should be on the 'must-do' list for anyone visiting New York. \n\nAs we were limited for time on this occasion we made the decision to choose only the exhibits we wanted to see most, and ignore everything else. I think this is really the only way to do it unless you have the whole day; trying to rush around as we did on our 1st visit is just overwhelming and tiring. We had 2 and a half hours only, and this approach worked well. \n\nOn this visit we explored the whole Dinosaur section (my Husband was/is a Dinosaur nut), the Hall of North American Mammals (I love how the dioramas are put together) and the Dark Universe show which was fantastic.\n\nTop Tip - We naively didn't expect too much of a line as we'd last visited in very early January and basically walked straight in. Of course we were very wrong on a wet day in May, and there were long long lines from the front and subway entrances, so THANK YOU to the passing New Yorker who took pity on us standing in the rain and told us about the apparently little known 81st street entrance with barely any line at all. We were paid up and inside within 15 minutes; we could have easily been an hour if we'd have stayed in the subway entrance line and with our limited time frame might have had to give up altogether.",
  "One of \"jewels\" on the crown when it comes to New York City museums. First you will NOT be able to see the whole museum in one day. My advice (especially with young children) is to plan what sections you'll like to view and see those. Dinosaurs, blue whale, large bugs... a wonderful place to see and learn. Check website for special events (adults and children) and during the summer months after the museum stroll into central park right across the street. There's a children's park section right down the block. Walk around the block on the weekends there are outdoor merchant's market. Places to eat? Plenty down the columbus ave side, yet I would go further away from the museum (cheaper). Cuban restaurant \"Calle Ocho\" down the block on 81st (very good). This museum will not disappoint, but be prepared for a crowd on the weekend. The NYC subway stops under the museum you do NOT have to go outside to enter museum. I find the museum temperature very \"warm\" bring light jacket in the winter unless you plan to walk outside. There is a for pay coat check. The museum is a donation admission. There is a \"suggested price.\" It's worth every dollar of the suggested price, yet if you're on budget you can still enjoy one of best museum NYC has to offer. Enjoy!!",
  "Incredibly huge museum so you could spend days in it.  I advise reading about the museum before to hit the exhibits you want to see first.  \n\nTips:\n-Buy your ticket online before.  Will save a lot of time waiting in line.\n\n-Unless you want to see the special exhibits just go for the basic ticket, there is more than enough to see.\n\n-Usually there are food trucks parked outside, or, bring your own food.\n\n-There is a subway exit directly at the museum.\n\n-Go early, plan for at least 5 hours, and it won't be enough time.",
  "AMNH is a remarkable destination for tourists and locals alike. If you're driving in,  the museum parking is perfect since you can stay parked until 11pm. That gives you time to explore the wonders of Central Park, and grab some food and beverages at one (or more) of the phenomenal pubs and restaurants nearby. Very memorable trip for all ages.",
  "There are not words to express what a great experience touring this museum is.  Allow your self enough time or to revisit in order to see all of the exhibits",
  "Nice museum with loads to see (can easily get lost in there). Was a little be disappointed that there wasn't an Egyptian section or some",
  "This is an absolute must on your visit! It took us a lot longer to walk around than we thought though, so allow a whole day if you can! It is steeped in history and architecture in a magnificent building, laid out on several floors. There's all manner of exhibitions to see, so do take your time.",
  "I took my 7 year old for a few hours on a Saturday morning.  We didn’t have a line to wait in and we breezed right in.  We both loved it!!  We didn’t have enough time to see everything so we picked a few things we both wanted to check out and away we went.  The dinosaur exhibits are huge and they were definitely busier than other areas we visited...we spent a lot of time exploring and taking pictures.  Very cool displays!\n\nThe other area we checked out was the sea life and giant whale installation.  Such a huge, cavernous space that didn’t feel busy at all.  We took lots of pictures and looked at lots of displays.\n\nShe was definitely captivated for several hours and enjoyed seeing and learning new things-so that’s a win in my book.  We’ll definitely be back-we need to check out the other floors we didn’t get to and explore the planetarium.  You should come by for a visit and lose yourself for the day.",
  "I first visited the museum 7 years ago on my first time in NY, and I remember vividly wandering around endlessly while reading as many plaques and inscriptions I could.\nFew weeks ago my girlfriend and I visited the museum as we always do in every major city we visit, as we enjoy learning something new about the past and I especially love dinosaurs.\nWe came around 3pm on a rainy day, and while I was ready to pay the full price the cashier told me I could choose how much to pay. I eventually gave 26 usd, which I think was fair for the amount of time we spent inside.\nWe tried to see as much as we could, and in fact we stayed until they told us they would close soon and we better exit the building.\nWe mostly enjoyed the historic exhibitions about countries and the dinosaurs, but in general the entire museum, although aging and in need of revamping, was very educational and it's definitely worth spending both time and money for a visit.\nI hope not to have to wait other 7 years for my next visit :) "
 ]
},{
 "name": "Greenwich Village",
 "address": "14th Street and West of Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/cd/61/bb/imag1152-largejpg.jpg",
 "tags": [
  "historic",
  "historic",
  "historic",
  "walk",
  "walk",
  "walk",
  "peaceful",
  "peaceful",
  "walk"
 ],
 "website": "http://www.greenwichvillage.com/",
 "source": "TripAdvisor",
 "reviews": [
  "A trip to NYC is not complete without visiting Greenwich Village.  So much to see, depending upon the weather, of course. Great cafes and unusual little stores, Christopher St, “Alphabet City” to the East, NYU’s campus buildings, Washington Square Park and the grand archway, outstanding comedy clubs, great restaurants, nice boutiques, historic buildings, delightful brownstones, superb falafel, and great people watching! Just take the subway to Christopher St and start zigzag-wandering east... so much to see! Enjoy!",
  "We did a self-guided tour down Bleeker Street in Greenwich Village on our Spring Break trip to New York, and loved the walkable neighborhood, the selection of local shops, stores, and restaurants, and historic buildings.",
  "For a real slice of NYC life, visiting Greenwich Village is a must, with its beautiful tree lined streets, wonderful architecture and small town feel. Walk the streets where Bob Dylan and his fellow folk music contemporaries played and lived, visit the funky East Village, with its eclectic shops, restaurants and bars, and get the real \"flavor\" of NYC. Just fantastic",
  "OK, I'm prejudiced because I have lived here for 40 years. But most visitors also seem to consider this historic neighborhood the tops for residential charm and a superb place for a great walk. But it may help to minimize the duller, more utilitarian areas such as Sixth and Seventh Avenues and focus on the highlights. \n\nIf you like music (and noise), go to Washington Square  on a nice weekend. If you prefer peace and quiet, try it on a weekday. The north side of the square has very impressive old New York houses, which might have come out of a Henry James novel (say \"Washington Square\"),  though they mainly house New York University offices these days.  The numbered streets just north of the square have some of the more beautiful 19th Century houses in the city. Skip tawdry 8th Street and dull 13th Street and focus on 9th though 12th Streets, between Fifth and Sixth Avenues. \n\nFarther west, the houses can be a bit less imposing, but there is more of a neighborhood feel. West 4th Street north of the about 10th Street (Yes, this part of West 4th Street runs north-south -- don't ask) is especially charming. Streets running off it, such as Charles, Perry and West 11th are also very appealing. l (And yes, there is an intersection of West 4th Street and West 11th Street.) Roughly parallel to West 4th Street, Bleecker Street has become a chic shopping street. \n\nA bit south of this area, streets like Barrow, Commerce and Bedford can be very charming. A stretch of Grove Street near Hudson has a place called Grove Court with attractive old  houses built around a courtyard. Farther west, there is a popular park built on a former pier where you can watch boats in the river and sunbathe in summer. \n\nAll you need is a decent map and sturdy pair of shoes.",
  "It was just OK.  Nothing special about the place.  very difficult to get a cab at Washington Square (or whatever that park is called.)",
  "Beautiful streets, many TV shows referring to those streets. Do not miss visiting Magnolia bakery and try banana pudding! Washington park relaxing, and gorgeous pictures to take from and in all directions to capture prominent lanscaping!",
  "If You ask Me where will Be My favorite place to live, I absolutely reply in the Greenwich Village(said GRAENICH!) This arch, for example is One of the nicest place that I went in my life. I prefere this than the Paris...Really. Smaller but I prefere the Washington Square in My Lovely Space in NYC... the Greenwich Village. Know it, walk it. And after tell Me if You are agree!!!",
  "We visited Greenwich village twice after visit Dominique Ansel bakery, stopping at Washington Square Park, walking towards the house of Friends, and then grabbing a coffee while wandering around the neighborhood.\nAll in all I was not a huuuge fan, I visited new york to see skyscrapers and Greenwich village reminded me of London's or Berlin's suburbs with lower buildings and streets filled by expensive hipster restaurants and shops. \nIt's pleasant for a walk, but not a must if you are on a tight schedule. \n",
  "I stopped off here before goin back to Holiday Inn in Manhattan Financial District. It was busy but the line went pretty fast . I ordered Footlong and cooked. It was tasty but next time , Leila get more olive oil.",
  "We were lucky enough to stay in Greenwich village. How lucky we were. It was much quieter and peaceful at night but still great restaurants. Loved being walkable distance to Greenwich market and the High Line. \nLoved loved loved it  ",
  "The place is quite peaceful to walk and enjoy it..nice stone houses trees and lots of cafes.. walked a bit at this place..nice weather made it all the more better"
 ]
},{
 "name": "Chelsea Market",
 "address": "75 9th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/23/e9/a4/chelsea-market.jpg",
 "tags": [
  "food",
  "food",
  "family",
  "experience",
  "food",
  "food",
  "walk",
  "unique"
 ],
 "website": "http://www.chelseamarket.com/",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to grab any type of food! I have been here two times so far and all the places I have eaten in were delish! If you are in the mood for Jamaican food you definitely should go to Tings. They also have all different types of shops as well with different imported items from other countries.",
  "Every time that I go to New York City I choose to do a lot of things....One is to go to the Chelsea Market! I will never let it in my schedule. Go please a see everithing. All is good and nice.",
  "Fantastic marketplace. My family and I visited here on a cold afternoon in March and we were all spellbound by the vibrant shops selling gifts, ethnic goods, food and books etc. there is so much to see here and so many foods to try. It was busy and filled with music, lights and people taking it all In. It was a magical experience. Definitely one of my favorite places in NYC",
  "During our stay in NY, we visited Chelsea market three times.\nThe market has several restaurants, coffee shops, bakeries, grocery stores, tacquerias and everything else you could wish for;if I had to be under quarantine, that would be the ideal spot not to die of hunger!\nWe tried several foods and loved them all, prices were competitive and the atmosphere was definitely cordial and joyful.\nThere was though a dearth of tables or benches for people who wanted to take the food away, but we found a stone structure next to a well and enjoyed our drinks there. ",
  "Chelsea Market has something for everyone.\nIt is beautifully designed, in the old Nabisco (National Biscuit Company) factory, with its unique bare brick walls.\nThe market has lots of specialty food vendors, catering for all tastes.\nYou can sit down (if you get a seat......) or walk around eating what you've decided to purchase.\nThere are almost sixty (!!!) food stands/eateries, so you're sure to find what you like. Delicious soups, Mexican food, Sushi, Israeli cuisine, Bread bakeries, Ice Cream and lots more. Hungry you won't be........\nIn addition, there are lots of shops, primarily focused around the kitchen, where you can find lots of interesting items from all over the world.\nTake your time.....and come hungry!!!\nYou'll Love It!!!"
 ]
},{
 "name": "Gulliver's Gate",
 "address": "216 W 44th St Located between 7th and 8th avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/4f/ed/97/italy.jpg",
 "tags": [
  "interactive",
  "kids",
  "kids",
  "interactive",
  "kids",
  "kids"
 ],
 "website": "http://Gulliversgate.com",
 "source": "TripAdvisor",
 "reviews": [
  "The museum is amazing, it was the  best museum in New York and all our seniors were happy to see such exhibitions,  I will be recommended to everybody at all ages.  Come and see, it is like a wonderland for kind and adults.  Thank you for creating such amazing place.  Good luck.",
  "For a recent outing in New York City on a frigid afternoon, my husband and I had to figure out a way to pleasurably fill 90 minutes between brunch and our 3 pm Sunday Broadway matinee. I searched “museums near Times Square,” and was bemused to see an unbeknownst-to-me exhibit called Gulliver’s Gate pop up on my screen. After finding a coupon online, I bought two discounted tickets in advance.\n\nThis $40 million permanent attraction opened in spring 2017 and boasts 300 miniature scenes from 50 world nations in a 49,000-square-foot self-guided tour space. Besides the cities and towns, the meticulous models include dozens of UNESCO World Heritage sites such as Angkor Wat, the Taj Mahal, Mecca, the Kremlin, and the Panama Canal (featuring the locks system with freighters going through it both ways). As we wandered past the ancient landmarks and modern cities, all beautifully detailed and packed in one after another, our heads swiveled right and left while our mouths hung open in incredulity. \n\nIf you have a tolerance for kitsch (and you have to admit that miniatures are the height of kitsch) you may well find it quite engrossing and engaging. As we perused the U.S. and European scenes my husband and I found ourselves pointing at the colorful plazas and buildings saying, “I’ve been there,” and “Remember that?” At other, more exotic points we said, “Why haven’t we been there yet?” or “Wow, maybe that’s worth checking out,” and made notes for our travel lists. In that way, it was like walking through a 3D travel highlights brochure for the well-heeled luxury traveler.\n\nYou come away with a renewed appreciation of how vast, varied and extraordinary both nature and human engineering can be. I predict I’ll return another day to spend more time at Gulliver’s Gate talking to the craftspeople and taking my time to peer at all their amazing models when it’s a little less crowded than on a holiday Sunday afternoon.",
  "We took our 5 year old grandson to see this fascinating exhibit. What a professionally organized space with opportunities to gain insight into the concept and how it has been and continues to be developed. Our grandson loved the interactive keys. My only suggestion, it is hard for young children to see the detail of the exhibit and especially the moving parts (of which there are many) and some kind of an elevated step would be very helpful for younger visitors. Nonetheless, well worth a visit.",
  "We’ve been there three times and marvel at the clever detail, magnitude and scope of the amazing miniatures and just fell in love with every aspect of it! Try to avoid holidays and weekends if possible as it can get crowded.\nFavorite miniature was the Panama Canal!\n",
  "Great and very interesting attraction!! I would recommend not going in peak season - if you do morning hours are best. SInce it gets too crowded which takes away from the enjoyment of this attraction.",
  "I came across Gulliver Gate a few days before heading to NYC and through it would be a good thing to visit if it rained. I was wrong, it's great any time. They are still in the building phase and preview - but it was well worth the visit. \nThe attention to details is amazing. Moving vehicles, car lights flashing, a small Macy's Parade in the NYC model. The vehicles even use their turn signals. The building have people in them, and apartment/office lights turn on and off. Such great attention to detail. \nI can't wait to see how big it grows with additional cities. \nDefinitely a must see, and the kids there were loving it. ",
  "What a beautiful place to go and see all the miniatures of the world in 2 hours we enjoyed every little bit of it and were fascinated by the details of each landmark and the surroundings. I can’t wait to come back to do the scavenger hunt with my kids when they grow up! It was the highlight of our trip! ",
  "Staff were super friendly, and some of the countries were nicely represented.\nBut very biased in terms of representation - only some locations are covered. And some things are just wrong :-)\nThe interactive keys were a nice touch, but two of them broke as we went around. \nThere were also things to \"find\" depending on the season, but it was not clear why or how.\nAll in all, a totally acceptable way to spend an hour but no wow factor. Could be much better.",
  "Was very nice and interesting! It looked like a whole miniature world! Great for 4+ kids and adults!\n",
  "Great visit - it's a must in NYC! Great for kids and for adults. Definitely you feel that you are away from Times Square and it's a trip around the world",
  "Somewhat expensive but that is predictable in Times Square. Definitely the best miniature museum I've seen recently. The details are amazing"
 ]
},{
 "name": "The Museum of Modern Art (MoMA)",
 "address": "11 West 53rd Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ab/4b/ef/so-much-to-enjoy.jpg",
 "tags": [
  "free",
  "experience",
  "free",
  "experience",
  "family",
  "walk",
  "free"
 ],
 "website": "http://www.moma.org",
 "source": "TripAdvisor",
 "reviews": [
  "The MOMA was an enjoyable experience. Although we visited during the peak Christmas period there was plenty for all of us to see\nGalleries included works from Dali Gauguin Van Gogh and some massive Monet canvasses\nFree audio a must\nParticularly enjoyed the modern architecture exhibitions from Frank Lloyd Wright and Bauhaus\nSculpture garden is free and Open to the public",
  "MoMA was a gratifying experience in art. Famous works of art are on display from such artists as Pablo Picasso, Henri Matisse, Claude Monet, Piet Mondrian, Jackson Pollock, and my favorite, Vincent van Gogh! Starry Night by Van Gogh is definitely the most popular. There are also sculptures and other artifacts. The museum has 5 floors and I recommend starting on the 5th and going down, since that floor is the most popular and can get pretty crowded. When you pay the admission fee (seniors pay less), you are given an audio machine to hear about the works of art. It was very helpful! After a certain hour in the afternoon, the public can enter free of charge. MoMA has so many famous artists, it is definitely one of the best museums I've seen.",
  "The Museum of Modern Art, more commonly referred to simply as “ The MoMA” is located in New York City on Fifty-third Street near Fifth Avenue (with a branch in Long Island City) and is widely acknowledged as the world’s finest (and most famous) depository of modern art in the world.  It was begun by the Rockefeller family during the Great Depression of the 1930s and was endowed by that family and other wealthy families.  Nelson Rockefeller was its director for many years, and he is credited with the acquisition of many of its greatest works.  The MoMA’s collections begin with the Impressionists and Post Impressionists and continues to the present day.  Among its most noted works are three paintings by Vincent Van Gough, including his “Starry Night,” Andrew Wyeth’s “Christina’s World,” Salvador Dali’s “Memory,” Matisse’s “Dance,” Jasper Johns’s “American Flag,” Andy Warhol’s “Campbell's Soup Can,” Roy Lichtenstein’s “Drowning Girl,” Claude Monet’s “Water Lilies” and many, many other masterpieces by some of the world’s best known artists, including Paul Cézanne, Marc Chagall, Max Ernst, Paul Gauguin, Frida Kahlo, Piet Mondrian, Claude Monet, Pablo Picasso, Jackson Pollock.  There are, of course, many others, too numerous to be listed here.\n\tThe MoMA is a private institution and does not receive government assistance and therefore one must pay its twenty-five-dollar entrance fee which many of my guests consider steep.  It is open late on Friday nights and has a pay-what-you-wish policy for that night, but the lines form early in the day; and, although it is open seven days a week, it is always one of the most crowded showplaces in the city.\n\tPersonally, I do not think it holds candlelight to The Metropolitan Museum of Art or the Frick Collection (but that, as stated, is only my personal opinion).\n\tWhen visiting the MOMA, one might also enjoy the beautiful stained glass and other works in the nearby Fifth Avenue Episcopal Church (St. Thomas Church) on Fifth Avenue at Fifty-third Street.  A short walk further on Fifth Avenue is Trump Tower (which is open to the public) and Tiffany’s Jewelry store where the spectacular Kimberly diamond is on public display as well as a collection of jewelry designed by Paloma Picasso (the daughter of Pablo).\nJoseph London, Licensed New York City Tour Guide",
  "Free entry 4-8pm on Fridays, just bear in mind that it gets absolutely rammed so not good if you don't like crowds. I suggest that you join the queue at about 3:30 PM for a relatively speedy entry. DO NOT bring a backpack with you - if you do, you'll have to leave it in the cloakroom and the queue is just abysmal. Messenger bags ok.\n\nThe museum itself is really good, bit similar to Tate modern in London. I particularly enjoyed the 6th floor (Picabia - temporary) and the 5th floor (Picasso, Matisse, Van Gogh et al.). The iPhone app is pretty good too.",
  "One of the best museums of modern art I have visited. Amazing collection, amazing building, great atmosphere. It can get very crowded so plan to arrive early or stay late. Good coffee shop on the 2nd floor but be prepared to wait in line especially right at noon. It will take several hours to appreciate the museum's exhibits and its grounds including the museum shop. Visiting exhibits may have an extra cost, so visit the museum's website and plan ahead. Wear comfortable shoes and bring something to write on all the information and artists you will discover here. ",
  "Free entry 4-8pm on Fridays, just bear in mind that it gets absolutely rammed so not good if you don't like crowds. I suggest that you join the queue at about 3:30 PM for a relatively speedy entry. DO NOT bring a backpack with you - if you do, you'll have to leave it in the cloakroom and the queue is just abysmal. Messenger bags ok.\n\nThe museum itself is really good, bit similar to Tate modern in London. I particularly enjoyed the 6th floor (Picabia - temporary) and the 5th floor (Picasso, Matisse, Van Gogh et al.). The iPhone app is pretty good too.",
  "Huge museum containing countless treasures of modern art. The only downside is that museum is a bit crowded due to its popularity.",
  "This is hands-down one of my favorite arts museums, in the city or elsewhere.  It's not for everyone, as it tends towards (as the name says) modern art, so if you don't like modern art, then go to the Met instead.  This museum has an exhaustive number of permanent exhibits and some famous paintings, such as Dalí's The Persistence of Memory, as well as fantastic temporary exhibits (a few years ago they had an exhibit dedicated to Tim Burton, and they also had a life artwork performance by Marina Abramoviç).  Some of the art is more interpretive, which I think is wonderful and makes the art consumer engage with the art in a more thoughtful manner.",
  "Maybe I am getting older but in my first trip to NEW YORK CITY, 1995, I had a very good special impact when I was to the MOMA. After, I went a looot of times and TODAY, I only go in the free days, MONDAY, from 4 to 8 pm, because I don´t like the \"modern?\" art, junk art, or whatever... I like to go to see the DALI, la persistencia de la memoria, The VAN GOGH, the ROUSSEAU and etc PICASSO but...No more space in my head to see this KIND of ? ART...",
  "I would suggest Museum of Modern Art is a must Do in New York. If you have time you can indulge in huge and unforgettable collections, masterpieces of art that fill the heart with emotions and stir the senses in a deep manner. If your time is short, it’ s enough to see The Starry Night by Vincent Van Gogh and the Water Lillies by Claude Monet, timeless, vibrant, universal paintings!",
  "Best museum in NYC. If you can only got to one, this is it. And frankly, the coffee at the Terrace is some of the best anywhere. So there's that in addition to Monet, Warhol, FLW and SO much more. Yes - some weird stuff. But 98% of it is fabulous."
 ]
},{
 "name": "The Roosevelt Island Tramway",
 "address": "59th Street and Second Avenue Tramway Plaza",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/5c/29/9f/roosevelt-island-tramway.jpg",
 "tags": [
  "walk",
  "experience",
  "walk"
 ],
 "website": "http://rioc.ny.gov/302/Tram",
 "source": "TripAdvisor",
 "reviews": [
  "The tram is a very cool way to get to Roosevelt Island and gives you awesome views of the city, if you can catch a spot by the window. The trams are quite large, and you could get stuck right in the middle with no view. The trip is also very quick, so pay attention while you're in there! I was disappointed with how short it was, but it is after all a mode of transportation and not a tourist destination. For the price of a subway swipe, it's definitely worth it.",
  "What a steal!   Leave the city behind for under an hour return trip, in the safety of a swiss built cable car, sit or stand and enjoy fabulous city views.    Purchase a metro card, swipe your card, board the tram between 59/60th and 2nd Avenue, point your camera and enjoy the ride!",
  "Enjoy stunning views of the Manhattan Skyline and the Queensborough Bridge for the cost of a Subway Ride. $2.75 takes you between 60th Street to Roosevelt Island and Metrocards are accepted.\n\nThe tramway runs till 2am and is possibly best done at night, as the service is less busy, and, depending on the time of year, the night time sky provides wonderful photo opportunities.\n\nRemember this is an integral part of the New York transport system. Many New Yorkers commute using the tram, making rush hours especially busy - which is the only reason I cannot award 5 stars.\n\nThe service is fully wheelchair accessible with an elevator at 60th Street and street level access on Roosevelt Island.",
  "Took this brief trip on the tramway mainly because it's there. Would liked to have had a walk around the island but it was pouring with rain and I wasn't suitably dressed.\nVery smooth and efficient service and a great thing for the island.",
  "Before coming to NY I had read about the cable car connecting Manhattan to Roosevelt Island, but was not sure whether we could fit it in our schedule.\nLuckily, before going back to the hotel one late afternoon, we made and we definitely loved it! I taken plenty of cable car while going skiing on the mountains, but this was a pleasant experience, fun and it offered a wonderful perspective on the city.\nSince we had a weekly subway pass, we did not spend a dime and we had a very good time taking pictures and admiring the city's skyline.\nWe spent about 30 mins on the island, just enough to wait for the following cable car and take pictures.\nWhat a fun attraction, I strongly recommend it to whoever has some spare time, you won't be disappointed. ",
  "We took the subway out to Roosevelt Island and had a lovely walk along the waterway ending up at the Roosevelt Monument.\n\nWe spent a short time there reflecting on the wording on the stone - if only we had a world that Roosevelt hoped for!!\n\nWe had a nice walk back and took the Tramway into Manhatten.\n\nThe view isnt great but it is a very fun thing to do.",
  "I had a NYC native tell me about the Tram that goes to Roosevelt Island - right over the East River.  It was chilly when I went so I didn't do much exploring but the trip over and back afforded great views up and down.  For something a little different ......",
  "For $6 you get to ride the tram across the river. It’s amazing and well worth a trip. 2nd Ave and 60th Street. "
 ]
}]
