[
{
 "name": "The National 9/11 Memorial & Museum",
 "address": "180 Greenwich St World Trade Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/99/a4/88/photo0jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This place is haunting, captivating, humbling and truly amazing. Words cannot express how powerful this tour is. Do not skip this on your NYC visit!",
  "My daughter took me there for the first time, and I was so touched by the way it was all put together and honored the lives that were lost that day. I will never forget what I saw. TY",
  "Always visit here at the holidays with out of towners, relatives and friends. Although I could give the tour by heart, much better taking the Official. More Celebratory and majestic. Plan to spend a minimum 2-3 hours to take everything in.",
  "A treasure of pictures, memorabilia, artifacts, and videos showing the event of 9/11. An awesome place on the very site of what had been the World Trade Center towers.  ",
  "The designers and architects did a wonderful job on this memorial museum.  It really tells the devastating story of that day. Would recommend getting the tickets online so you don't have to wait in line."
 ]
},{
 "name": "The Metropolitan Museum of Art",
 "address": "1000 5th Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/2c/15/ac/the-metropolitan-museum.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This is one of the great comprehensive museums of the world. Only the Louvre in Paris can compare in scope of art periods and movements included, as well as depth of styles and quality of the collections. ",
  "We visited the Met on a rainy day in January, on our first visit to NYC with our 2 boys, 17 and 12. We all LOVED it and still talk about. We all chose a section to see and there  was something for everyone. It is the reason we would go back to NYC again!",
  "I love the free guided tour the museum offers.  Each day they have a timetable that you can get from the information, or ticket counter.  The guides are very knowledgeable on the topics they are responsible for.  The tour is usually an hour.  \n\nIt is a huge museum, so many to see.  The ticket is good for three days.  I chose to spend about 2-3 hours each day and went back every day for different tours.  It was a wonderful experience",
  "This is truly one of the best museums in the world, I had only a couple of days touring New York but I can't miss this.  I would give myself two full days if I had the opportunity to go back again, and its very easy to get around the hall as they are clearly marked.  The Met Shop also have many interesting books and gifts, and there's even a clearance section.  \n\nWould love to go back.  Late posting, I was there during June 2018",
  "In my opinion, this is one of the two most interesting museums in New York, only because of the gigantic and wonderful collection, but also because of the architecture and general structure of this place!"
 ]
},{
 "name": "Central Park",
 "address": "59th to 110th Street Manhattan Borough, from Central Park West to 5th Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/16/1a/e6/new-york-city-central.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Really enjoyed walking around and taking in the sights of the infamous Central Park. It was a chilly but sunny day when we went and we loved every second of it. Some of the colors from the fall were still left over!",
  "A natual place inside the new york city.  Hard to cover all in one day. Enjoyed with the nature. Can relax the mind and body",
  "We loved the little bike/cart tour through central park. Our guide was very knowledgeable and personable! It started to rain as our tour was ending, and he offered to take us back to our hotel!  LOVE! Great customer service!!",
  "I went in Winter and the lake was frozen , but so beautiful, even in Winter, it's a great place to visit alone or with the family.",
  "I could walk around in Central Park for hours to escape the hustle and bustle of the city.  I love walking the trails all different times of year but my favorite is in the fall.  Make sure to watch the gondolas in the pond.  "
 ]
},{
 "name": "Empire State Building",
 "address": "20 West 34th Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/f3/82/90/the-new-exhibits-at-esb.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Had a pleasant experience was just very crowded as I was there over the festive season . I would like visit again maybe during the summer.",
  "This was my 2nd visit to the Empire State, my first was in 1971.\n\nIt was still as amazing as I remembered but with lots of improvements and new experiences,\n\nMy son and I went to the top which we paid extra for but it was worth it \n\nThe views are great - you must put this on your to do list ",
  "JUST WOW! The views are the best, the museum leading up to the views is so nice as well. Staff so friendly. We went right to the top (102nd floor)  We truly loved it so much. We went on the 18th February (my boyfriends 21st birthday) about 8:30am and the lady that was at the top was incredible, so friendly and took the best pictures. A massive thank you to her 😁",
  "We were due to visit this month and bought tickets totalling about $250 direct from the Empire State website. I have emailed various addresses without response and wonder if any of them are monitored by real people. Anybody else trying for a refund? We have received refunds from other NYC attractions including Top of the Rock and the Circle Line.",
  "It’s an ordinary activity ! If you have a fight phobia don’t even think about it!\nBeside that it was a very simple and ordinary experience ! You can have the same feeling from any rooftop bar "
 ]
},{
 "name": "Top of the Rock",
 "address": "30 Rockfeller Plaza Enter on West 50th Street, between 5th & 6th Avenues",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/20/ff/cd/top-of-the-rock-observation.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Neighborhood gem and and oldie but goodie. Observation deck is grand. Perfect venue for corporate holiday events. Decorated beautifully. Food is catered Deliciously and excellent variety. Ordinary day with clear skies, you can the boroughs, with unobstructed view. Don’t miss it.",
  "I love views over cities. If rooftop bars or viewpoints, most important is to see as far and as much as possible. From this tower you're able to watch over several districts. \n\nThe saftety guard was very friendly and explained us what we see where, don't be afraid of asking them. I'm sure they'll be helpful.\n\nThere was a short waiting line, but I remember that it did not take as long as I expected.\n\nRecommendable viewpoint 10 out of 10!",
  "We got there with prebooked  tickets for the sunset and they gave us a 2 hour wait even though we had prebooked then gave all the good immediate timeslots to people who just walked in off the street very disappointed with the way they prioritise the veiw was still nice but didn’t get to see the sunset",
  "Visited the attraction during my visit in November.\nBrilliant views of the entire island of Manhattan, and i was lucky it was a clear sunny day so could see for miles.\nYou are given a time slot for entry so the observation deck never seems overly busy.\nRecommend a visit if you are in New York.",
  "Stunning views over the park and the city, with some good information on the way up about the building of the centre. The booking and return time process was well organised to avoid queues, if you have only time to this OR Empire State, personally I would say this just tips it, in terms of the views "
 ]
},{
 "name": "Statue of Liberty",
 "address": "Liberty Island",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/b7/e5/02/photo3jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Having relatives that entered the Unites States via Ellis Island, made this visit a very moving experience.  I think everybody should visit Lady Liberty and Ellis Island if given the opportunity",
  "It was a memorable visit there. Travelling by a ferry to the liberty statue was a wonderful experience. ",
  "After so many years visiting New York, I had never been on the Statue of Liberty and this year on my birthday, I finally got to climb to the top of the crown. If you want to do this fantastic experience, you do have to book many months in advance, but it is worth it. Be prepared to be exhausted and hot, but the reward is a stunning view of Manhattan.",
  "Amazing to finally see the statue of liberty after hearing and seeing her in films. You get some great views on the ferry over too.",
  "This was without a doubt the highlight of our first visit to NYC. After seeing Liberty countless times in films/books, to finally see her for real up close, felt surreal, but was completely mesmerising! The view you get from the boat across is fantastic (in good weather) and we learnt to so many interesting facts about the statue, with the free audio guide on liberty island. Can highly recommend."
 ]
},{
 "name": "Brooklyn Bridge",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/3a/14/1e/photo3jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Nice Experience to walk on the bridge. Massive bridge with beautiful views. can see most of the iconic buildings in New York from the bridge.",
  "As we were staying in Brooklyn, it was only natural to walk up the Brooklyn Bridge, this iconic piece of architecture which is so characteristic of New York. of course, we had not counted on the heat, so we did not make it all the way to the other end, because it was just too hot. So choose a less sunny or hot day and this is a marvellous walk over the river into Manhattan.",
  "What an experience to walk on the Bridge on the eve of Christmas, watching Manhattan skylines, the shadows in the river!",
  "The Brooklyn Bridge looms majestically oner New York City’s East River, linking the two boroughs of Manhattan and Brooklyn. It’s granite towers and steel cables have offered a safe and scenic passage to commuters, tourists, trains and bicycles.",
  "The best way, we felt to see the bridge was to get the subway out of downtown and walk back into the city across the bridge. It was  a really lovely atmosphere and the sunshine really helped with making it a great experience. Lots of opportunities to take photos and buy souvenirs and ending up close to chinatown was definitely  a plus so that we could get lunch. There are benches dotted along the way to rest, so that was handy. It'll take approx 1 to 1.5 hours to walk across at a slow pace and take in the scenery. Make sure you do it. "
 ]
},{
 "name": "Manhattan Skyline",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/35/49/80/manhattan-skyline.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We did this first thing in the morning just before we were going to back across the Brooklyn Bridge (from Brooklyn to Manhattan). Its such an amazing view, one of those things that is like an out of body experience seeing it. One of those things youve seen so many times on TV and then there it is. So many gorgeous photo opportunities, what a brilliant view.",
  "What an iconic view; just like in the movies! Unfortunately, we had a bad storm coming in that day, so it was fairly cloudy (although made for atmospheric photos!), but you can just stand and take it all in for ages; truly is something special to behold.",
  "If you like photography, this is a very nice location! go in the morning of afternoon for best light",
  "Took the ferry boat ride which although the weather wasn’t great gave us a great view of the skyline. Well worth the visit ",
  "Terrific view all the more as the meteorological conditions were optimal for appreciating it full..."
 ]
},{
 "name": "The High Line",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/86/71/32/at-sunset.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Walked the trail all the way from the Hudson Yards to the Chelsea Market, comparing the differences in the city from the last time we were here to this visit. The High Line is always changing, be it from time of day to time of the year, and deserves multiple visits - it will continue to amaze. I encourage an evening visit in the summer, to enjoying the sun setting over the water, colouring the brick building an even more vibrant shade red.",
  "Totally transformed area and chic neighborhood. Creative, resourceful in design, sprung up out of no where and continues to grow rapidly. Such a hotspot, with plenty of restaurants, nail salons, top line clothing stores  and funky people. Plenty of benches, Just enough food vendors and thee most stunningly gorgeous sun set in the entire city.",
  "Quite unexppected , but a beautiful and somewhat surreal path above the streets of New York. You get to see New York in a very different way and can walk for a long time without the normal busy traffic. An absolute must for anyone somewhat familiar with New York.",
  "Expect the unexpected, what a beautiful place to walk above the city streets.  This is something fun to do that doesn't cost anything.  Great for taking pics and people watching.",
  "The High Line provides beautiful and unique views of New York City and New Jersey. It is a great stroll from west side 35th street to Chelsea. Idea for families, teens and kids. Bring your cameras you that you can take photos of these amazing views. Many eateries in the area. Oh and don’t forget to get your tickets to visit The Vessel a new attraction near the High Line,"
 ]
},{
 "name": "One World Observatory",
 "address": "285 Fulton St One World Trade Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/0e/f5/46/sky-portal-step-on-this.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "The One World Observatory is an amazing experience. Unfortunately the day we had to visit the weather was overcast.and we didn't actually get to see the windows open. Having said that it was an enjoyable visit ",
  "This was definitely a highlight of our trip!  We paid extra to access the ipads and it is definitely worth it.  We enjoyed lunch in the restaurant with a breath taking view.",
  "My experience in the One World Trade Center was magical I got a whole view of New York I learned a lot and I was amazed at the elevator with how fast it went, I highly recommend it, it is an unforgettable experience!",
  "The One World Observatory provides you with good views of the Big Apple.  The elevator shoots up so quickly you're out in a blink of an eye on the 110th floor, I believe.  You can't see Central Park.  However, you can see many of New York's other highlights and New Jersey.  I recommend going here if you are planning to go to the 9/11 museum and seeing lower Manhattan.  ",
  "Its all awesome in the ONE WORLD OBSERVATORY from the building,lift and the view.\nYou can get guide tablets for enhancing your experience.\nThe view is great. It makes you feel like the world is endless. You can also see the live ground view from screens at the top.\nYou can also get your photos with the one world observatory view at the back. They'll also give you a code , you can fill the code on the mentioned website and download your photos and you'll also get 3 copies of your photos.\nThe lift time is also amazing. They show you the story of the ONE WORLD OBSERVATORY from its building time till today.\nEverything looks so amazing from the top. You can see far enough. \nIts a lifetime experience trip to the top.\nI don't have enough words to describe the experience and all the fun you have their."
 ]
},{
 "name": "Grand Central Terminal",
 "address": "89 E 42nd Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f3/4b/4e/grand-central-terminal.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "We spent some time in the terminal. It has very big open space and lovely stairs. There’s also little shops for buying local food.",
  "It is just great to feel the buzz of the station and you can't imagine you are in the middle of a big city., as this is a small city in itself. Do not miss out on the food market, because that really has some of the best eateries around.",
  "An extraordinary beautiful train terminal and world-famous landmark of NYC downtown with history and great engineering perhaps the busiest train stations in the world, Metro, subway station, restaurants/bar, etc.",
  "Amazing building has to be seen.\nGreat food hall downstairs and a market as well.\nMuch more than a train station.",
  "Blimey, i never thought a train station could be so big.  There is so much going on - obviously as its a train station!! There are shops galore and a massive Apple shop at the far end (recharge your battery). Was tempted to get an Amtrak  - maybe next time!"
 ]
},{
 "name": "The Met Cloisters",
 "address": "99 Margaret Corbin Drive Fort Tryon Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/b7/f9/4c/the-cloisters.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Wonderful museum, but allocate enough time since there are so many exhibits. The senior ticket allows entrance for several days.",
  "Sometimes I forget that this museum is in NYC, as it seems so unlike the rest of the museums in the city.  It's in the northern part of Manhattan but easily accessible by subway and bus, so please do go in warm weather and soak in the scenery and artwork.  The art are arranged so that people can take them in at their own pace and at an unbiased, neutral angle, and I'd say that the buildings themselves are part of the art.  The tours are wonderful, as the tour guides are really knowledgeable and make the art more fascinating.",
  "I highly recommend taking the once-daily highlights tour.  On the one-hour tour, the guide discusses a number of items in depth.  It’s like getting a free university lecture.  \n\nWe took the subway up from where we stayed in Times Square.  It was easy to get to.  After the train, you can take the bus just one stop or walk through the park (if you’re healthy and the weather is nice).  We chose to take the bus on the way there and walk back through the park.\n\nThe ticket from The Met Cloisters can also be used at The Met—it’s good for three days.",
  "We lived in the UK for 40 years, so have seen many historic buildings and museums full of artwork. The Cloisters is not like any of them. It's a wonderfully effective array of individual items displayed in a neutral environment, allowing its beauty and craftsmanship to be appreciated without distraction. The rescued buildings and architectural samples are brought together in a way that feels natural and yet allows visitors to see each one on its merits. It's wonderful, and it's set in a park that feels unlike any other part of Manhattan. ",
  "This is a wonderful Museum.  Get there early, enjoy the entire experience at your own pace.  Three day passes are perfect for breaking up you NYC visit."
 ]
},{
 "name": "Rockefeller Center",
 "address": "45 Rockefeller Plaza Rockefeller Centre",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/93/30/1d/photo1jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Great Business trip for Flywebmakers \nas always after subscription many new businesses get high visibility online and as flywebmakers do not take competitors in the same location all businesses are like a one big family .\nthanks for Rockefeller Center for a chance to do Matterport projects and a lot of great contacts we see us in March 2021 again .\n\nBest Regards Flywebmakers Team",
  "This is always a favorite place to visit, right by 5th Avenue, St. Patricks Cathedral, Radio City Music Hall, the Tower, the ice skating rink, many shops and restaurants, and of course the beautiful Christmas tree and other decorations in December.  We enjoyed music, the lighted tree.",
  "There's nothing like ice skating in Rockefeller center.  The VIP line is the way to go found in the basement.  No need to waste hours waiting in line and you get cookies and hot chocolate for free.  ",
  "Visit at Christmas time is a very nice time to take in all the visual holiday decorations and the spirit of Christmas.",
  "This was just amazing, definitely worth the money - and it wasn't overly expensive. We bought anytime tickets from our hotel concierge - which I think is the best idea depending on your plans and how wedded you are to them. The queuing system is quick and efficient and prior to this you can explore the Rockerfeller Centre itself and the many shops its has. Great artwork on the walls too."
 ]
},{
 "name": "Radio City Music Hall",
 "address": "1260 6th Avenue Between 50th and 51st Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/29/a1/03/radio-city-music-hall.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Incredibly well organized, had a great seat and their performance was simply pure perfection.  Would have preferred less visuals and more emphasis on the music.  The venue was packed and the two days were 'sold out'.  Drove all the way to see them and they were brilliant.",
  "A really interesting tour to see the inner workings of Radio City.  You get a good look at an art deco masterpiece from the historical stage elevators to the lounges, the theatre, the grand foyer, and private rooms.  It was fun taking a picture with a Rockette.",
  "Every Trip that I make to New York try to go to the RADIO CITY MUSIC HALL. I did more or less 32 from 1995 to Now and I enjoy just simply to see outside. I made pictures for the TONY AWARDS twenty years ago when I was journalist...Very nice experience. The shows at the RADIO CITY are memorable. A incredible experience to tell when You and Your family go back to Your Country!!!",
  "Excellent show which was professionally staged. Dancers were very synchronized and visual effects were fantastic!",
  "Radio City Music Hall is run down and not worth the admission fee.  The theater is nothing special and other areas viewed were in disarray and dirty.  At the end of the tour you get to take a picture with a Rockette and keep the cardboard neck tag you're given, to wear during the tour.  There were very few tourists during my visit."
 ]
},{
 "name": "Bryant Park",
 "address": "between 40th and 42nd Streets & Fifth and Sixth Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/46/7a/36/bryant-park.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Free ice rink and a great Christmas market the atmosphere stays with you and your only around to the public library the reading room  is  something special.",
  "I miss Bryant Park so much now that I don't live in NY! This piece of land is utilised so well. Concerts and picnics in the summer, plenty of benches to eat your lunch or grab coffee with a friend (and always a great place to meet if you're coming from different boroughs, as it's so close to GC), the cutest craft and gift stalls in the winter- and can't forget the FREE ice skating! Such an all-around wonderful public space.",
  "My favorite part of Bryant Park is when they have the Winter park Pop up shops / food carts/ ice skating, etc.",
  "Had a walk around on my first night. Excellent shops, food and drinks. A bit pricey but so is most of New York. Ice rink there too if you fancy a skate. ",
  "Okay, it is better when the urban campers are not congregated there. it is a place for people to gather, do yoga, chat, and eat street food, up the street from Grand Central Station and the iconic public library."
 ]
},{
 "name": "Staten Island Ferry",
 "address": "4 South Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/41/61/63/passing-ferry.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Free ferry ride that sails past the statue of liberty and Ellis Island.\nI managed some great photos from the ferry of the statue of liberty.\nWorth a couple of hours short trip great fun.",
  "If you are looking to see the statue of liberty at a distance and enjoy a ferry ride at no cost.  This is the perfect outing for you.  It's relaxing and being on the water is full of views of the New York skyline.",
  "We wanted to see the Statue of Liberty but didn't want to go on one of the pricey tours so this was ideal. The ferry is free and runs regularly from the Staten Island Ferry terminal. You have to queue, but its not so bad, once on the ferry you can choose to either sit on the ample benches or stand inside or out to take in the view - an it is amazing sailing away from NYC. You can easily see the statue, not close up, but from an okay distance so its one. Once at Staten Island, we just walked off and got on the same ferry going back to New York. Total time was about 2 hours. Well worth the trip and a sunny day definitely makes a difference.",
  "This was one of my favorite things to do while I was in NYC. The Staten Island Ferry is absolutely free and was a great way to see Manhattan from another view. Make sure you get to the bottom rear of the boat so you have a beautiful view of the city as you heard toward Staten Island. It's the best view ever! Once you arrive you simply walk through the station and get in line to return to Manhattan. Easy peasy! Try and stand at the rear left hand side of the boat on the return as you'll have a great view of the Statue of Liberty. It's absolutely breathtaking! Enjoy!!!",
  "This is my second review of traveling on this ferry to see the Statue of Liberty. It was a great ride despite the weather. The crew were very thorough. There were people around us from all around the United States and abroad. It was a lovely sight to see Lady Liberty from afar and close up. Everyone we’re taking photos."
 ]
},{
 "name": "New York Public Library",
 "address": "476 5th Ave New York, NY 10018",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/7d/71/33/ny-public-library-reading.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I've been to NYC 3 times now and this remains my absolute favourite landmark. It is steeped in history, literature, architecture and everything else you could want. Including the original Winnie the Pooh! What a treat. ",
  "Wanted to visit as this was the setting (part of) for the Ghostbusters movie - showing my age!! The most beautiful building and reading rooms, some private, that are locked off. There's an old fashioned telephone booth as well, good photo opportunity! Kids (teens) were a bit bored but my husband and I love the interior and the architecture. Well worth a trip if you can get there.",
  "We stumbled upon this by chance and my word, what a magnificent building. It is free to enter (so obviously, a must!) and there is so much history and architecture in this stunning structure, you will need all day! It's a lovely, calming pace from the hustle & bustle outside too.",
  "In all my years of coming to New York City, I had never actually visited the New York library. What a mistake! This is a beautiful piece of architecture and has so much history. I felt like I knew this place after seeing it in The Day After Tomorrow movie. The staff was very friendly, helpful, and outgoing. I highly recommend that anyone take the time to visit this library when they are in New York City.",
  "While visiting new york we visited twice the public library, since it was located a few streets from our hotel and we really enjoyed taking a look at the massive amount of books on display here.\nThe library is gigantic, with several rooms each displaying books related to a peculiar topic.\nWe mostly enjoyed reading about the arrivals of immigrants in the city, some of which were actually originally from our countries, learning more about the history of New York and about the lives of people who then became members of the community in America.\nThe library is free of charge, has a small shop selling wonderful souvenirs (we bought posters about the city) and you can easily spend days here without ever getting bored.\nIt was one of the attractions we enjoyed the most, and that we are looking forward to going back to in the future.\n"
 ]
},{
 "name": "Intrepid Sea, Air & Space Museum",
 "address": "12th Avenue & 46th Street Pier 86",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7a/40/ea/intrepid-sea-air-space.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "It was a very good experience because when you go inside they give you a gadget to listen the history of each plane or room. There was a inside area and a outdoor area, in the outside area you had a lot of planes and helicopters to see and in the interior area you had rooms, machine guns, and the cabins. Near the outside area you can see the “ENTERPRISE” (the plane that went to the moon in a mission). When you end the visit you can go to see a submarine that went to the war a few years ago. In short there are planes that go trough the sea and there are ships that go trough the sky. ",
  "An unexpectedly fantastic museum on an aircraft carrier! Lots of planes to see. The Concorde was amazing and great to go into the flight deck. ",
  "We first visited 15 years ago, and in that time it really has changed loads. \n\nReally enjoyed the space exhibit and seeing all the aircraft on the flight deck. \n\nThought it was wrong that you had to pay more to get onto Concorde though.",
  "We bought the general admission as part of the C3. It doesn’t include the VR and the 4D theater. Nice exhibits, and great for families with kids. Employees are not friendly. ",
  "On our recent trip to NYC, we booked The Intrepid 101 tour for the two military enthusiasts in our group. James was our tour guide. He was engaging, interesting, and incredibly well-educated on military history, especially WWII. James made naval enthusiasts of US ALL! ❤️🇺🇸❤️"
 ]
},{
 "name": "The Oculus",
 "address": "33-69 Vesey St World Trade Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/a5/44/f5/l-occulus.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Amazing breathtaking experience as you step out the subway station into the huge Oculus. Like its name suggests,it is a stunning eye-like design! It is basically a mall with tons of fancy shops and some classy restaurants and coffee shops.Situated below the new World Trade Centre.",
  "After visiting the 9 11 memorial, we passed through the oculus on our way to the subway station located nearby.\nThe construction itself is massive, architecturally speaking very impressive and spacious, but in my opinion is a punch in the eye.\nInside there is a lot of free space and shops are here and there, I did not see a real concept (although I am sure there is).\nOverall interesting to see once, but that's about it. ",
  "The architecture and look from the inside is quite impressive; But the overall experience is not spectacular or out of this world. Very functional shopping area with paths to the metro and the PATH  ",
  "The Oculus is the architectural gem in the new World Trade Center which now includes a new tower, along with memorial museum and fountains where the original twin towers used to be. It’s definitely worth seeing.",
  "Even if you just com ehre to admire the building I can recommend it. It's super stylish and is like nothing I've seen before. Good selection of shops etc. but just enjoy it for what it is."
 ]
},{
 "name": "Ellis Island",
 "address": "New York Harbor",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d5/64/9c/ellis-island-canopy-with.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "This is a wonderful museum, a great insight into the fabric of the American people, and I'm sure a very emotional experience for those who have personal ties to this place. I found the museum, and whole the experience, very informative and often eye-opening as to the formation of the melting pot that is America. Seeing the large, elegant processing room, polished and sparkling, and knowing that is was once filled with people, looking for a new life...Entering the sterile dormitories where people slept in towers of bunks, like books piled on a shelf...I enjoyed the temporary exhibit on the one thing of importance people brought with them during some of the most recent conflicts, involving refugees from Afghanistan, Syria and Libya. \nI booked through State Cruises, and if I can say one thing, it would be to book the ferry from the New Jersey departure. There were so few people leaving from Liberty State Park, it made the process of going through security a breeze! Also, there is a cafeteria on Ellis Island, but there is nothing stopping you from bringing a picnic to enjoy on the grounds outside, with a knock-out view of the NYC skyline! Combined with the Statue of Liberty, plan on spending most of the day visiting here - we took a 9 am crossing, and finally return to Liberty Park around 3 pm.",
  "Stayed in New York and I can tell you this is an amazing place to find out whereabouts my predecessors  ended up in the America. From there the plan was to travel to England to find out even further where and how far back we went.\nEllis Island is good  with good security and for obvious reasons!\nWell worth taking your time for the research.",
  "We decided to visit Ellis Island by purchasing tickets through state cruises, which offered a fair deal for both the statue of liberty and Ellis Island.\nAfter visiting the first landmark, we headed by boat to Ellis Island, where millions of immigrants came upon arriving to the New world a century ago.\nThe buildings were restored and looked really stunning, the grounds are beautifully kept and there are lots of reading to do inside, movies to see and pictures to look at.\nI did not use the audio guide as I found it quite boring.\nWe spent nearly 3 hours there and could have stayed even more, then my belly was rumbling and we left for Manhattan.\nIt was inspiring reading what immigrants went through, how they lived and what they thought of this new world, we both really enjoyed our time and whenever we will visit NY again this will be one of the first attractions we want to go back to.\nSimply wonderful, touching and inspiring. ",
  "So glad we took time to see all Ellis Island had to offer. There are many exhibits, though I most enjoyed the one that took you through what it would have been like to immigrate through the island. \n\nThere’s a cafe here that had a decent variety in food options and wasn’t way over priced, like I thought it may be.  ",
  "As a fourth grade teacher, this was a place I have wanted to see for a long time, and it didn't disappoint.  This museum was very well done with so much history.  I would recommend Ellis Island to anyone who wants to learn more about American history.  "
 ]
},{
 "name": "St. Patrick's Cathedral",
 "address": "50th Street & 5th Avenue Wheelchair accessibility located off the corner of 51st Street and 5th Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/af/8f/8e/pope-francis-with-msgr.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Just an amazing church.  Spend some time there and enjoy the surroundings and take some quiet time to let everything sink in.",
  "I attended mass here early on a Sunday morning and it was lovely to sit and pray and take in the beauty of this beutiful Cathedral. As an Irish catholic the connections are strong to this Cathedral and New York, however it was very unusual to see security in the church and people walking around when mass was being said.  ",
  "The St, Patrick Cathedral is a true icon. Definitely a must do when in New York City. It went thru a major overhaul and it is truly Stunning,",
  "A traditionally constructed building which is spectacular on the outside as well as inside. Close to the Rockefeller centre this is a must see attraction. It is such a calm and pleasant place to spend some time and relax.",
  "On our last day in NYC, we decided to walk from our hotel to St. Patrick's on a brisk winter day. The cathedral was filling up fast for the 9:00 mass, but we managed to find a pew about half way back from the altar. The choir and organ were quite nice and fill the vast space with a beautiful sound. Cardinal Dolan was saying Mass, and we found him pragmatic yet holy. In spite of the large congregation, mass was concluded in just one hour, and we had time to admire the beautiful architecture and altars in this wonderful cathedral. It's truly a New York treasure."
 ]
},{
 "name": "Madison Square Garden",
 "address": "4 Penn Plaza",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/01/ee/69/madison-square-garden.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I can't begin to tell you how amazing this place is. For a start its easy to get to, just follow the crowds - and there are thousands of them - even on a school night! Its just an iconic place too. We were greeted by friendly security staff who search your bags before allowing you into the 'reception area' there are plenty of things to buy from the club shops that pop up. We went in March (to watch the basketball) and September to watch the Ice Hockey - both amazing and entertaining - who'd have thought it. Seat allocations are good, you have a reserved seat and people generally sit in their own seats, if not the plentiful ushers will help you out. Its a great venue. great atmosphere and so big. We absolutely enjoyed the games we watched there and would love to go back.",
  "We attended the Knicks and Pistons game.  I was very impressed with the inside of the arena.  It was easy to navigate and our seats were comfortable.  The food was pretty good.  We all had the chicken baskets with fries.  We were in the 400 level and had to walk far if we wanted anything other than popcorn and hotdogs.  Every stand had the same selection.  It would’ve been nice if every other had something else to offer.  The lower levels for example had pizza along with the yummy chicken baskets.  At this point, I enjoyed my time there, but it was our last stop that made our evening.  We finished at a gift shop to take some Knicks items home to family.  First off, all of the staff was incredibly friendly.  They were all chatting and made us feel welcomed.  Who stood out the most was Marcus (sp), he even dribbled basketball with my son for probably 15 minutes.  He taught him better form and laughed with him.  He was patient and genuine.  He went way over and above what any employee would do.  My son couldn’t stop talking about Marcus.  Additionally, we wanted some Rangers gear and the staff happily got that for us.  We will return to Madison Square a garden and are grateful for the experience that we had!!",
  "Fantastic experience and well worth a trip!! \nWe watched the Knicks play and thoroughly enjoyed it!! Great atmosphere and well worth a visit\nWe also had a couple of daily burgers which were the best burgers we’ve ever eaten!! \nWell worth a trip :)",
  "We visited Madison Square gardens to see a knicks game. The venue is simply brilliant. Very well organised and I would recommend to anyone.",
  "Don't miss when in town and the Knicks are playing. Great atmosphere, all organized and comfortable sits."
 ]
},{
 "name": "Broadway",
 "address": "599 Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/8a/c7/ff/broadway.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "I have been 4 times and every time always is incredible, architecture is the best part.... I visit convenience stores to know other cultures, people who I know where awesome, I walked during midnight safe Restaurants are wonderful, Hotels are nice but small rooms,  Statue of Liberty is gorgeous, … the  things that I hated them everywhere smell marijuana :(  ...  Everything is expensive ...  Trash is a lot (unreal) ... \nOn your first day, you  must take a bus tour  and then decide where are you will get off to enjoy NY\n:D",
  "Too bad that this show's run on Broadway is over, but it is such a good show that I don't doubt it will make a return at some point! I caught the Sunday matinee, which meant the cast was a little switched up, but all the performances where top-notch, with a special shout-out to George Salazar in the role of Michael. I came out of the theatre with the music swirling around inside of my brain, and it hasn't stopped since. A definite two thumbs-up from me for a great way to spend an evening!",
  "While who ever you ask will have their own favorite show or many,  99% of the time you cant go wrong, i personally like the big over the top musicals but the comedies are also fantastic.  I recommend buying directly from the theaters for the best pricing.",
  "Jeff was AMAZING in this show. We went specifically to see Jeff Daniels and he didn't disappoint! The rest of the cast was wonderful as well, worth the money. We have been to The Purple Rose theater in Chelsea, Jeff's theater, and always enjoy what we see there.  If you get a chance, see his one man show. He sings, tells stories, it is fantastic!!",
  "Went to see the show for my birthday and it was one of the best shows I have seen on broadway.  The scenery, actors, and story line were all great. I would highly recommend and can't wait to go again!"
 ]
},{
 "name": "Times Square",
 "address": "Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/d5/ae/38/times-square.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Visit Times Square and feel the excitement and buzz of the area. Loved it start spreading the news ...",
  "Beautiful in the night with lights and branded shops all over people on the road 24*7. Can enjoy the night life in better way. ",
  "Always a must-see when in NYC, I just want people to know that there is always a place to have your moment in Times Square - unless it is NYE and the ball is dropping, you'll always find a little corner where you can experience the sights and sounds of New York City. You just might have to wander a little, but there are plenty of spots to sit and enjoy. And snack on an apple...in the Big Apple...because you KNOW you have to do it!",
  "A short walk from our hotel, I was not expecting this. I thought it would be an actual square, but in n way shape or form were we disappointed. The lights leading down and going off towards Broadway were amazing, it was like daylight. The atmosphere was exciting and the place was bustling with tourists - late at night too. We visited a few times, during the day and at night - go both times to appreciate the sights. There are stairs leading to a sort of viewing platform, where you can take pictures galore or sit and rest. It does get very busy, but its just amazing. There are plenty of shops and restaurants close by and we saw several street performers too. Its free and fantastic so make sure you go.",
  "Always looks like its day time in times square from all the lights.  Its always crowded with tourists, which I understand why.  I recommend sitting back on the big steps and taking it all in."
 ]
},{
 "name": "American Museum of Natural History",
 "address": "79th Street Central Park West",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/b7/e7/76/photo0jpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "There are not words to express what a great experience touring this museum is.  Allow your self enough time or to revisit in order to see all of the exhibits",
  "Nice museum with loads to see (can easily get lost in there). Was a little be disappointed that there wasn't an Egyptian section or some",
  "This is an absolute must on your visit! It took us a lot longer to walk around than we thought though, so allow a whole day if you can! It is steeped in history and architecture in a magnificent building, laid out on several floors. There's all manner of exhibitions to see, so do take your time.",
  "I took my 7 year old for a few hours on a Saturday morning.  We didn’t have a line to wait in and we breezed right in.  We both loved it!!  We didn’t have enough time to see everything so we picked a few things we both wanted to check out and away we went.  The dinosaur exhibits are huge and they were definitely busier than other areas we visited...we spent a lot of time exploring and taking pictures.  Very cool displays!\n\nThe other area we checked out was the sea life and giant whale installation.  Such a huge, cavernous space that didn’t feel busy at all.  We took lots of pictures and looked at lots of displays.\n\nShe was definitely captivated for several hours and enjoyed seeing and learning new things-so that’s a win in my book.  We’ll definitely be back-we need to check out the other floors we didn’t get to and explore the planetarium.  You should come by for a visit and lose yourself for the day.",
  "I first visited the museum 7 years ago on my first time in NY, and I remember vividly wandering around endlessly while reading as many plaques and inscriptions I could.\nFew weeks ago my girlfriend and I visited the museum as we always do in every major city we visit, as we enjoy learning something new about the past and I especially love dinosaurs.\nWe came around 3pm on a rainy day, and while I was ready to pay the full price the cashier told me I could choose how much to pay. I eventually gave 26 usd, which I think was fair for the amount of time we spent inside.\nWe tried to see as much as we could, and in fact we stayed until they told us they would close soon and we better exit the building.\nWe mostly enjoyed the historic exhibitions about countries and the dinosaurs, but in general the entire museum, although aging and in need of revamping, was very educational and it's definitely worth spending both time and money for a visit.\nI hope not to have to wait other 7 years for my next visit :) "
 ]
},{
 "name": "Greenwich Village",
 "address": "14th Street and West of Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/cd/61/bb/imag1152-largejpg.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "If You ask Me where will Be My favorite place to live, I absolutely reply in the Greenwich Village(said GRAENICH!) This arch, for example is One of the nicest place that I went in my life. I prefere this than the Paris...Really. Smaller but I prefere the Washington Square in My Lovely Space in NYC... the Greenwich Village. Know it, walk it. And after tell Me if You are agree!!!",
  "We visited Greenwich village twice after visit Dominique Ansel bakery, stopping at Washington Square Park, walking towards the house of Friends, and then grabbing a coffee while wandering around the neighborhood.\nAll in all I was not a huuuge fan, I visited new york to see skyscrapers and Greenwich village reminded me of London's or Berlin's suburbs with lower buildings and streets filled by expensive hipster restaurants and shops. \nIt's pleasant for a walk, but not a must if you are on a tight schedule. \n",
  "I stopped off here before goin back to Holiday Inn in Manhattan Financial District. It was busy but the line went pretty fast . I ordered Footlong and cooked. It was tasty but next time , Leila get more olive oil.",
  "We were lucky enough to stay in Greenwich village. How lucky we were. It was much quieter and peaceful at night but still great restaurants. Loved being walkable distance to Greenwich market and the High Line. \nLoved loved loved it  ",
  "The place is quite peaceful to walk and enjoy it..nice stone houses trees and lots of cafes.. walked a bit at this place..nice weather made it all the more better"
 ]
},{
 "name": "Chelsea Market",
 "address": "75 9th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/23/e9/a4/chelsea-market.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to grab any type of food! I have been here two times so far and all the places I have eaten in were delish! If you are in the mood for Jamaican food you definitely should go to Tings. They also have all different types of shops as well with different imported items from other countries.",
  "Every time that I go to New York City I choose to do a lot of things....One is to go to the Chelsea Market! I will never let it in my schedule. Go please a see everithing. All is good and nice.",
  "Fantastic marketplace. My family and I visited here on a cold afternoon in March and we were all spellbound by the vibrant shops selling gifts, ethnic goods, food and books etc. there is so much to see here and so many foods to try. It was busy and filled with music, lights and people taking it all In. It was a magical experience. Definitely one of my favorite places in NYC",
  "During our stay in NY, we visited Chelsea market three times.\nThe market has several restaurants, coffee shops, bakeries, grocery stores, tacquerias and everything else you could wish for;if I had to be under quarantine, that would be the ideal spot not to die of hunger!\nWe tried several foods and loved them all, prices were competitive and the atmosphere was definitely cordial and joyful.\nThere was though a dearth of tables or benches for people who wanted to take the food away, but we found a stone structure next to a well and enjoyed our drinks there. ",
  "Chelsea Market has something for everyone.\nIt is beautifully designed, in the old Nabisco (National Biscuit Company) factory, with its unique bare brick walls.\nThe market has lots of specialty food vendors, catering for all tastes.\nYou can sit down (if you get a seat......) or walk around eating what you've decided to purchase.\nThere are almost sixty (!!!) food stands/eateries, so you're sure to find what you like. Delicious soups, Mexican food, Sushi, Israeli cuisine, Bread bakeries, Ice Cream and lots more. Hungry you won't be........\nIn addition, there are lots of shops, primarily focused around the kitchen, where you can find lots of interesting items from all over the world.\nTake your time.....and come hungry!!!\nYou'll Love It!!!"
 ]
},{
 "name": "Gulliver's Gate",
 "address": "216 W 44th St Located between 7th and 8th avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/4f/ed/97/italy.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "What a beautiful place to go and see all the miniatures of the world in 2 hours we enjoyed every little bit of it and were fascinated by the details of each landmark and the surroundings. I can’t wait to come back to do the scavenger hunt with my kids when they grow up! It was the highlight of our trip! ",
  "Staff were super friendly, and some of the countries were nicely represented.\nBut very biased in terms of representation - only some locations are covered. And some things are just wrong :-)\nThe interactive keys were a nice touch, but two of them broke as we went around. \nThere were also things to \"find\" depending on the season, but it was not clear why or how.\nAll in all, a totally acceptable way to spend an hour but no wow factor. Could be much better.",
  "Was very nice and interesting! It looked like a whole miniature world! Great for 4+ kids and adults!\n",
  "Great visit - it's a must in NYC! Great for kids and for adults. Definitely you feel that you are away from Times Square and it's a trip around the world",
  "Somewhat expensive but that is predictable in Times Square. Definitely the best miniature museum I've seen recently. The details are amazing"
 ]
},{
 "name": "The Museum of Modern Art (MoMA)",
 "address": "11 West 53rd Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ab/4b/ef/so-much-to-enjoy.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Huge museum containing countless treasures of modern art. The only downside is that museum is a bit crowded due to its popularity.",
  "This is hands-down one of my favorite arts museums, in the city or elsewhere.  It's not for everyone, as it tends towards (as the name says) modern art, so if you don't like modern art, then go to the Met instead.  This museum has an exhaustive number of permanent exhibits and some famous paintings, such as Dalí's The Persistence of Memory, as well as fantastic temporary exhibits (a few years ago they had an exhibit dedicated to Tim Burton, and they also had a life artwork performance by Marina Abramoviç).  Some of the art is more interpretive, which I think is wonderful and makes the art consumer engage with the art in a more thoughtful manner.",
  "Maybe I am getting older but in my first trip to NEW YORK CITY, 1995, I had a very good special impact when I was to the MOMA. After, I went a looot of times and TODAY, I only go in the free days, MONDAY, from 4 to 8 pm, because I don´t like the \"modern?\" art, junk art, or whatever... I like to go to see the DALI, la persistencia de la memoria, The VAN GOGH, the ROUSSEAU and etc PICASSO but...No more space in my head to see this KIND of ? ART...",
  "I would suggest Museum of Modern Art is a must Do in New York. If you have time you can indulge in huge and unforgettable collections, masterpieces of art that fill the heart with emotions and stir the senses in a deep manner. If your time is short, it’ s enough to see The Starry Night by Vincent Van Gogh and the Water Lillies by Claude Monet, timeless, vibrant, universal paintings!",
  "Best museum in NYC. If you can only got to one, this is it. And frankly, the coffee at the Terrace is some of the best anywhere. So there's that in addition to Monet, Warhol, FLW and SO much more. Yes - some weird stuff. But 98% of it is fabulous."
 ]
},{
 "name": "The Roosevelt Island Tramway",
 "address": "59th Street and Second Avenue Tramway Plaza",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/5c/29/9f/roosevelt-island-tramway.jpg",
 "tags": "[]",
 "source": "TripAdvisor",
 "reviews": [
  "Took this brief trip on the tramway mainly because it's there. Would liked to have had a walk around the island but it was pouring with rain and I wasn't suitably dressed.\nVery smooth and efficient service and a great thing for the island.",
  "Before coming to NY I had read about the cable car connecting Manhattan to Roosevelt Island, but was not sure whether we could fit it in our schedule.\nLuckily, before going back to the hotel one late afternoon, we made and we definitely loved it! I taken plenty of cable car while going skiing on the mountains, but this was a pleasant experience, fun and it offered a wonderful perspective on the city.\nSince we had a weekly subway pass, we did not spend a dime and we had a very good time taking pictures and admiring the city's skyline.\nWe spent about 30 mins on the island, just enough to wait for the following cable car and take pictures.\nWhat a fun attraction, I strongly recommend it to whoever has some spare time, you won't be disappointed. ",
  "We took the subway out to Roosevelt Island and had a lovely walk along the waterway ending up at the Roosevelt Monument.\n\nWe spent a short time there reflecting on the wording on the stone - if only we had a world that Roosevelt hoped for!!\n\nWe had a nice walk back and took the Tramway into Manhatten.\n\nThe view isnt great but it is a very fun thing to do.",
  "I had a NYC native tell me about the Tram that goes to Roosevelt Island - right over the East River.  It was chilly when I went so I didn't do much exploring but the trip over and back afforded great views up and down.  For something a little different ......",
  "For $6 you get to ride the tram across the river. It’s amazing and well worth a trip. 2nd Ave and 60th Street. "
 ]
}]
