[
{
 "name": "Oklahoma City National Memorial & Museum",
 "address": "620 N Harvey Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/ef/b9/b0/oklahoma-city-national.jpg",
 "tags": [
  "historic",
  "field",
  "history",
  "parks",
  "history",
  "walk",
  "walking",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d271178-Reviews-Oklahoma_City_National_Memorial_Museum-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent over 3 hours visiting this memorial and museum. Very well done and a great tribute to those who lost their lives in the bombing and all of the Emergency (Police, Fire, EMS etc) and the volunteers to helped for several days after the bombing. ",
  "Very moving experience. The Oklahoma City Memorial Museum has done an amazing job at portraying all events surrounding that horrific day. The memorial garden with the chairs for each of the lives lost is a moving tribute to the victims and provides a peaceful place for the families and friends to remember their loved ones. ",
  "We love to visit National Parks and Historic Monuments and sites. We were looking forward to visiting OCNMM. The experience is very moving. The Memorial Museum story by chapter: the history of the site; the meeting recorded; the confusion & chaos; the world reaction rescue and recovery; the watching &waiting; Gallery of Honor; the Impact & Healing; the investigation, evidence & Justice; and the Responsibility & Hope.  The Outdoor Memorial occupies the new sacred soil where 168 Americans were killed. \nGates of time \nEast Gate 9:01am innocence before the attack\ndestruction 9:02 am \nWest Gate 9:03 am marks when the healing began\n\nVisit the reflecting pool of healing and calming waters\nVisit the Survivors Tree century old Elm tree stands as a symbol of strength and resilience \nVisit the Rescuers’ orchard these are of trees stand guard over the Survivor tree\nVisit the children’s plaza wall of hand painted tiles\nThe fence installed to enclose the crime scene\nMurray Plaza Overlook surviving original area\nSurvivors wall only wall remaining with 600+ names of those who survived the blast\nVisit the field of empty chairs naming the 168 who were killed including 19 smaller chairs representing the children who died",
  "Memorial is done very nice.  It was a very cold day so seeing the outside part was done very quickly.  I'm sure in the summer when there is water in the reflecting pool, it is very nice.   It was hard to think that so many children died and seeing their little chairs made you realize how terrible it was.  I would love to go back sometime when the weather is warmer.",
  "I visited this amazing museum in early March, right before the outbreak of Covid-19.  The museum goes beyond simply recording the horrific terrorist act that changes the state's history forever.  It is more about heroism, courage, and hope for a more beautiful future.",
  "This was a place to take my out of town in laws. Very moving and emotional. It was a walk through the time leading up to and following the bombing. Many artifacts and a lot of emotion remembering that day.",
  "While not in OKC at the time of the bombing, I was a little over an hour away, and I do remember the events as they unfolded. I never did see the remnants of the building before leaving Oklahoma so I wanted to take the opportunity while we were in town. The experience is very well put together, walking you through the daily lives of many people, that would forever be changed. The audio recording of the the meeting that was brutally brought to an end by the explosion was especially chilling. Maybe not appropriate for young children, but should be required curriculum for all of us. Recommended.",
  "We visited the Oklahoma City National Memorial & Museum about two weeks ago.  It was so moving and well done.  We took a self guided tour of about 1 1/2 hours.Getting around is easy.  Elevators are available.  It  is hard to imagine what happened there in 1995 when 168 innocents were killed in the bombing of the Murrah Building, but the photos, videos, momentos and other displays provided help make it so clear what kind of tragedy happened that day and the every day heroes who stepped up to help the victims.  As an Okie who moved away many years ago, this memorial made me very proud of my heritage.  I recommend everyone who visits Oklahoma City put this on their itinerary."
 ]
},{
 "name": "National Cowboy & Western Heritage Museum",
 "address": "1700 Northeast 63rd Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/df/73/8a/national-cowboy-western.jpg",
 "tags": [
  "art",
  "learn",
  "history",
  "tour",
  "unique",
  "kids",
  "free",
  "history",
  "wander",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117482-Reviews-National_Cowboy_Western_Heritage_Museum-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wow... I have been to various museums across the US to learn about the history of the early pioneers and the native Americans and their story, most are very disappointing but this museum brings the history of the west alive. The broad range of exhibits from the stunning art inspired by the west, the way of life, tools, clothes, weapons, utensils, Rodeos, Ranching how Hollywood romanticised the west,  and fascinating  displays of so many different artefacts  (including a room on barbed wire.....)  are well staged in visually interesting settings and are really informative. The section on the Native American Indians is probably the most interesting and thorough I have seen and puts the lamentable offering at the Smithsonian in DC or the equally poor  Santa Fe museum in the shade. As with most history there are conflicting  elements. It’s a complex and in my opinion on the one hand an ultimately profoundly tragic story but also a fascinating one telling  of the grit and determination of the pioneers. This museum brings it too life in a truly immersive, fascinating, well pitched and perfectly presented way. I strongly recommend a visit for anyone interested in this piece of history. Thank you Oklahoma!",
  "This 37 acre museum complex has a huge building with two wings that has 26 different areas and galleries to visit indoors and outdoors the Jack and Phoebe Cooke Gardens  has native plants and ornamental  trees amidst sculptures, gravesites, memorials, a koi pond, and lush surroundings.  There are many discounts on admission-I had a credit card that gave me free admission the day I was there.  The docents were great as was Nick the security guard.  Free tours were offered and you could join or leave the tour at any time.\nI particularly enjoyed the American West Gallery which had many works by Remington and Russell, the Western Performers Gallery which had an incredible amount of memorabilia from TV westerns and movies, and Prosperity Junction which depicted a frontier western town just after dusk at the turn of the 20th century complete with sounds and electricity on Main Street and kerosene and gas lamps else where. You could enter some of the buildings while others were just fronts.  There is a theater with continuous running videos.  Especially for kids is the Children's Cowboy Coral.  Just to give you  an idea of the amount of info, the barbed wire display had 1300 varieties on display in drawers that you pulled out.  Many interactive exhibits.  \nThere is also a restaurant on site (check ahead for hours) and a wonderful gift shop with many unique items.  I arrived right when the museum opened at noon on Sunday and stayed almost to closing at 5 PM.  It is easy to access the museum from either I-35 or I-44.  Parking is free.",
  "I have visited this place so many times throughout my life, it’s such a part of home, and definitely a treasure to be shared, and shown off to impress visitors to Oklahoma. It never disappoints, and we love to attend special events like charity balls in the ballroom with the amazing Windows to the West. We love the interactive portions of the museum, awesome gardens and water features, our favorite ... the old west village, the beautiful artwork and sculpture, and an amazing gift shop.",
  "My wife and I were driving the Old Route 66 visiting as many exhibits we could find.  The National Cowboy & Western Heritage Museum was a great stop.  The museum was so large we only saw part of it.  The exhibits were excellent and showed a lot of history.",
  "You want to allow yourself at least 3 hours to read about and enjoy so many different exhibits because it will surprise you for the size outside,  how much to cover inside !!",
  "I guess I didn't realize just how sizable this installation was until we started wandering through it. There are several distinct areas within the museum that cover everything from Indian artifacts, Rodeo Hall of Fame, western movies, historic guns, and even Andy Warhol’s fascination with the West when he was young. It will take you a solid three or four hours to see everything in this museum so you may want to take a look at a map and decide what's really important to you if you don't have that kind of time to spare. The museum's exhibits were very high quality and very well done. I especially enjoyed the photo Gallery of Dorothea Lange whom I knew nothing about, even though I had seen some of her pictures in the past. I am a bit of a gun person so the exhibit on historic firearms from the West was interesting and then I also enjoyed all of the accouterments collected from the western cinema perspective. There was also an exhibit on singing Cowboys, as well as the rodeo Hall of Fame. There is even a replica of a small western village that you can wander down the wooden sidewalk which creaks underneath your feet just like it does in any Clint Eastwood movie. It was a good museum and well worth the time an admission fee. Recommended",
  "This museum has been on our to do list for years. We had only 1 hour 20 minutes there due to travel schedule. Wish we’d had at least half a day. The map/brochure needs to tell what is in the different galleries- I missed the Prix exhibit entirely. Loved the Dorothea Lange exhibit and many of the paintings in various galleries.",
  "2nd Visit and well worth it . Great items on display and well displayed at that . Huge Halls and some truly dramatic sculptures."
 ]
},{
 "name": "Oklahoma City Zoo and Botanical Garden",
 "address": "2000 Remington Pl",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/eb/51/4e/official-zoo-logo.jpg",
 "tags": [
  "unique",
  "learn",
  "unique",
  "wander",
  "food",
  "field",
  "kids",
  "walk",
  "family",
  "walking",
  "kids",
  "food",
  "walk",
  "food",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117225-Reviews-Oklahoma_City_Zoo_and_Botanical_Garden-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "From California, we have some top rated zoos, but Oklahoma City zoo provides so many up, close and personal opportunities.\n\nI feel buying the Zoo-It-All was worth it just out of convenience, but if you dont do it all  you may save some buying one event at a time.\n\nWhat interactions does this zoo offer:\n1.  Stingray petting and feeding\n2.  Lorikeet feeding\n3.  Giraffe feeding (F,S,and Sun only for only 1 hour each day)\n4.  Camel rides (I think camel rides need to be re-thought.  The camels were way too tired by the end of the day)\n5.  PAY THE EXTRA for the Up close and personal tours.  For about $70, we got a unique experience with an Elephant.  In CA, the cost would have been $150 per person.\n\nLet me tell you more about the elephant encounter.  It was a small group of 9 people.  We got to go where the zookeepers go.  They showed us how the elephants learn.  We even got see the newest baby up close.  We each got to pet the elephant.  They are magnificent creatures with such personalities.  Spending the extra made this beyond a special zoo trip.\n\nYou will need the full 9am to 5pm to fully explore this zoo.",
  "We were pleasantly surprised by the OKC zoo! It had so many unique features... from bird sanctuaries, to reptile and amphibian exhibits to s sting ray tank... to sea creatures, a huge elephant exhibit, gorillas and lions and bears oh my! Even if all the animals are not out when you go there they have plenty of beautiful bronze sculptures of each different area. There is a large body of water on the outskirts of the park and a shuttle system to help get you around. It is worth your time to go see! ",
  "We are members of the OKC Zoo and are therefore eligible for discounts at participating AZA members across the country.  As a result, we are constantly comparing those zoos to our own and many pale in the comparison.  The paths that wander all around the zoo are wide, well-maintained, and lined with many beautiful indigenous plants (many with labels).   There are also quite a few \"cooling towers\" to take the edge off the OK heat should you be visiting when the weather is hot.   \n\nThere is a small train which takes you INSIDE the animal enclosures for a close-up view of some of the animals.  It's amazing how an animal can be just a few feet from you and yet almost invisible.  At times you can watch some of the animals sneak alongside the train in a vain attempt to visit their friends across the road.  Please be aware that it is a very short trip so some may feel that it is not a really good value for the money.   Another ride is a trolley which offers a seated view of most of the zoo with the opportunity to get off/get on in different locations in the zoo.  It runs most of the day so keep your wristband on!   \n\nA wonderful opportunity for children of all abilities to play on a playground is not far from the front entrance.  The variety of activities is almost too long to list here but all my grandchildren (11, 8, and a special 5)  enjoyed their time in the playground.  There is also a children's area in the zoo that has a petting zoo, a splash pool with dancing waters, and a butterfly garden.  The entrance to the lorikeet feeding exhibit is also in this area.\n\nIf you want to get to know Oklahoma visit the Oklahoma Trails section.  This is a beautifully crafted area that highlights all of the indigenous animals to Oklahoma and features a store with \"Made in Oklahoma\" products.  \n\nIf you like animals of the watery variety see the Noble Aquatic Center.  It features a sea lion show and has a dazzling array of aquariums filled with a dizzying number of fish spread over three stories.  \n\nJust to touch on some of the many other offerings: a vet clinic where you can observe the animals being treated, a picnic area, a carousel, paddleboats, gift shops, the new elephant observatory, The Great EscAPE, the great cats, the Education Building, StingRay Bay (yes, you can pet them!), the ZooZeum, the Aviary, and so many other wonders that it's hard to name them all! \n\nThere are also many events that happen at the Zoo, so I recommend that you check out their website at okczoo.org to see if something exciting is happening the day of your visit.",
  "The OKC Zoo is pretty good, albeit not as impressive as the San Diego and Washington DC Zoos. For the $8 price tag though, totally worth the money! They have elephants, giraffes, lions, etc. and enough benches and tables scattered around to rest and take a snack break. I love that you can bring your own food and water and that it seems pretty clean. They have a children's area which is pretty fun and includes a petting area for goats as well as playgrounds and a little stream the kids love to splash in. Watch out in April and May as that is when schools plan field trips during the week! Overall, we liked it enough to buy a pass and I know we'll more than get our money's worth. ",
  "It is a big zoo so wear good shoes and be prepared to spend the day.  I did not like the pathmarkings.  It seemed like the exhibits were disjointed-you would have to walk awhile past nothing.  We would have to backtrack several times to get from one to another (going from elephants you had to backtrack to ge to the bears/giraffe area).  I would suggest taking the tram first to plot out what you want to see and work your way back up to the front entrance.",
  "We spent a full day at the zoo over Spring break. We had not been there in several years. They have made plenty of improvements. The zoo is bigger than I remembered. My advice is to go early. Wear good walking shoes...even though a \"hop on - hop off\" tram is available, as the day goes on the seating is hard to get. We were able to make some of the shows and feedings.We really enjoyed feeding the giraffes. The animals are accessable either outside or in the indoor areas. Kids really enjoyed the childrens area. It was a great family trip.",
  "My husband and I had a great visit at the zoo today. Every staff member was friendly and welcoming. At the ticket booth they even told us about a few things we might want to check out. I did notice how clean the park was though. There was no trash anywhere! It also appeared that the animals had just been fed which made for great viewing. The bat exhibit was awesome because they too had food and were flying around eating the fruit. I've never seen them in action until this visit. It was awesome! I love this zoo. We'll be back again soon.",
  "We always enjoy the zoo.  A wonderful place to enjoy the sights and sounds of the animals.  You cant go wrong here.  Walk and enjoy the beauty of the OKC Zoo.",
  "OKC Zoo by far is a bang for your buck spot. The food the staff super clean. Not the biggest Zoo park but a good time none the less",
  "We had a GREAT time walking the park. All the animals look healthy. The staff was amazing. Thanks for the memories.",
  "We've been Oklahoma City Zoo Friends for 22 years. It's a great place to visit and a wonderful walking venue, especially at 9 AM (the opening hour) or late in the afternoons. That's when an annual Zoo Friends pass comes in handy. If you're paying for single admission most people think they have to stay all day to get their money's worth. But for those within driving distance, the annual Zoo Friends pass is the way to go. Mathis Brothers has a sale on them between Thanksgiving and Christmas. A great value.  "
 ]
},{
 "name": "Bricktown",
 "address": "Downtown",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/11/fe/5d/bricktown-fountain.jpg",
 "tags": [
  "unique",
  "walk",
  "walking",
  "family",
  "walking",
  "kids",
  "family",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d108485-Reviews-Bricktown-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "We simply loved this town we stayed at the Loft there and walked uptown every night the Christmas Water taxi was awesome the people were so nice there I love the layout of this unique place",
  "A beautiful revitalization of an old warehouse district just east of downtown Oklahoma City with many restaurants,gift shops and entertainment venues. A comic club, a baseball park,a movie theater and many more sites.  Don’t forget to stop by and see the land run,statues just south of Bass Pro shops. It’ can also be seen from the water taxi that meanders thru bricktown",
  "Bricktown is great for any time of year. Whether you're there for a Thunder or Dodgers game or looking to see the river walk, theres plenty off restaurants and bars to enjoy the evening. I love it.",
  "We were here during a very cold day in Oct.   It was still very beautiful.  We walked around and enjoyed the sites.  I;m sure in the summer it is very busy and beautiful.  ",
  "Walking along the Bricktown canal and along nearby streets was an engaging way to see the city. There are a wide variety of dining options available, and even in winter, the canal is appealing. ",
  "Bricktown offers something for everyone. Whether it's walking around with the family, fun for the kids and nights out for the adults - this place is a gem.",
  "Bricktown is great if you are looking for a casual night out for dinner and drinks. There are some family fun options too. Recommend a visit no matter who you are.",
  "I stayed here the last few weeks,and there is always something to do or see. The number of restaurants, bars and other attractions is remarkable. Everything is within walking distance, or you can take the water taxi or the street cars with a day hop on hop off pass."
 ]
},{
 "name": "Science Museum Oklahoma",
 "address": "2020 Remington Pl",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/c7/67/11/the-science-floor-at.jpg",
 "tags": [
  "learn",
  "kids",
  "family",
  "kids",
  "eat",
  "kids",
  "drink",
  "kids",
  "art",
  "family",
  "family",
  "learn",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117285-Reviews-Science_Museum_Oklahoma-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "In two words, The Best! We haven’t gone to the SMO without feeling exhausted and happy. There are hours of fun to be had. We also always check out their perfectly enjoyable store. They have everything you need in a gift, or even something for yourself. Educational, fun and interactive, for any age. Jennifer and Sam, have done a brilliant job, having both ends of the spectrum in prices. We never leave without a bag of their latest books, t-shirts and toys!",
  "My two daughter one 30 and one 12 had a blast, we loved it so much fun and so educational .. I would highly recommend that you go to this place it's fun for kids and adults there so much interaction with each other so many things to do and learn as you're doing",
  "Great for kids, and can spend the entire day here. Lots to do with activities scheduled out the day. Family enjoy the creatures and how alive they look. Time ran out but will be back soon again to see the rest of the museum.",
  "This place is a great place to spend a half day with kids under the age 10.  The museum has several interesting exhibit areas from a young kids area showing the science seen in carnivals, areas touching on space, light, physics, weather, health and even trains. The museum is spread out well and even has an area to grab something to eat and drink. Our son is 4 1/2 so he is still too young to understand fully what each exhibit is about. However there was enough hands on activities to keep him interested and allowed him to have a good time. Keep in mind this place is geared towards kids, so for teens and adults without kids visiting the next door zoo is a better way to spend the day. ",
  "You can't go wrong visiting here. Staff is great and the hands on displays are great. Good for kids and adults. Parking can be a challenge depending on when you go since the Zoo is right next door but don't let that stop you from going",
  "I don't know how I should rate our visit.  We went during spring break and it was CROWDED!!  We spent 4 hrs there, saw the planetarium, made an art drawing with the pendulum, ate lunch and watched part of the science live demonstration.  The rest of the time was standing in horrendously long lines.  The cafe had a line out to the main exhibit area, the tables were filthy, lines for the bathroom...lines lines, everywhere lines!!!  We paid over $60 for a family of four to stand in lines all afternoon.  \n\nNow all that being said,  the planetarium show was spectacular!  Very educational and interesting!  This show is not for babies or toddlers, so don't take them in (it ruins the experience for all the others who waited in line forever!). The science live show was the highlight of our day.  We only saw the last part of the show, and we had to sneak in to find seats once somebody left.  But it was great!!  The host was funny, engaging and worth the wait.   \n\nI don't know if I would return to see the rest of the museum....maybe on a Wednesday early as they open...just avoid it during spring break! ",
  "Great fun for all ages! We try to go every year. We would spend the entire day there. Catch a movie if you can! ",
  "I took my 7 year old daughter and a family friends daughter who is 9 they both love science so they loved this you could spend about 2-3 hours in here that’s how long we spent it determines on what your kids want to see perfect for kids who love to learn!",
  "This museum exceeded my expectations. There was so much to see and do. We went to one of the Science Live demonstrations and my 7 year old said that was his favorite part of our trip. We were there almost 4 hours and still probably didn’t see everything, so plan to spend a good chunk of time if you go!",
  "This was a great place to spend a day exploring with my grandchildren!  Lots of things to do and see, so plan at least 3-4 hours!!  ",
  "Visited Oklahoma for my sons military graduation, ended our day at the science museum...we all wish we would've started our day there. I have 3 kids, 18, 11 and 9 and we all thoroughly enjoyed our time together there. So many interesting activities to do, all while learning about the amazing world we live in. It's a great place to spend the day or multiple days if you live in the area. Great hands on activities, very enjoyable and educational!"
 ]
},{
 "name": "SKELETONS: Museum of Osteology",
 "address": "10301 S Sunnylane Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/87/8e/a8/20180629-092038-largejpg.jpg",
 "tags": [
  "kids",
  "kids",
  "kids",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d2103602-Reviews-SKELETONS_Museum_of_Osteology-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "First time visit and my wife and I enjoyed it very much!For such a small museum it sure was big! Took about 2 hours to see everything.The gift shop was very nice and had very reasonable prices of any gift shop I have been. The girls up front were very nice. I liked all the exhibits,my wife's favorite was the humpback whale. All in all a must see!!",
  "After watching some of the practice for the air show at Tinker Air Force Base, I took my 3.5 year old boy here. It is a bit out of the way based on where we live in Edmond, but given we were in the area I was excited to finally pay the museum a visit. Pulling up I expected a larger and more impressive building. Do not let the exterior fool you - the interior of this museum is surprisingly fantastic! \n\nWith two levels, there is an incredible amount to look at. Well over 90% of the bones on display are real, with very few faux displays. Kids are welcome to run around, touch anything that is not in a case. From large scale whales and giraffes to the tiniest little bird skeletons, the displays are amazing for all ages. There are also educational activities, etc...\n\nWe will definitely be back!",
  "me & my boyfriend wanted something out of the box & fun to do. i came across the museum & it seemed pretty cool! when we went everyone was super nice & they have a scavenger hunt for different ages, we spent a hour finding the different skeletons & learning new things it was so fun!!  ",
  "This little museum is packed with excellent exhibits.  The skeletons are superbly displayed and information is nicely presented.  No long, boring explanations here.  ",
  "This was a great place to spend the afternoon with my 7 year old son. It’s fairly small, so don’t plan to spend more than a couple hours there. He loved getting to see all the animal skeletons, I loved all the educational opportunities there were, and the staff were super friendly. I would definitely recommend for families with young kids.",
  "I visited the museum on a whim, because the name interested me when I searched for attractions to visit in Oklahoma City. It was well worth the time! The museum has an incredible range of skeletons on display--far more than I would have thought could be displayed so well in the building. The collection has been thoughtfully curated to interest and teach visitors. I especially enjoyed that except for the skeletons in the glass cases, visitors are encouraged to touch and handle the bones. I noticed several activity stations for younger children, and look forward to returning with my nephews.",
  "The museum far exceeded what we thought it would .  We were in town to visit grand kids and decided to take them there.  Don't let the size of the building fool you like it did us.  It is packed full of interesting displays, information and scavenger hunts for the kids.  The staff is very helpful and knowledgeable.  We are looking forward to visiting again when we're here.",
  "They had a massive amount of skeletons, and some extinct things! There were fun scavenger hunt pages to do based on your age range. The gift shop was also super nice."
 ]
},{
 "name": "Myriad Botanical Gardens",
 "address": "301 W Reno Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7e/84/80/tulips-blooming-in-the.jpg",
 "tags": [
  "free",
  "walk",
  "economical",
  "nature",
  "walk",
  "family",
  "kids",
  "walk",
  "nature",
  "walk",
  "walk",
  "learn",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117286-Reviews-Myriad_Botanical_Gardens-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "While Myriad Botanical Gardens is certainly worth a visit, the two biggest draws are the Children's Garden and the holiday lights. The Children's Garden is part of the free grounds and has an amazing playground, perfect for families. The Illuminations holiday lights were absolutely stunning and very much worth the $8 per person price of admission.\nWe ran into Myriad's COO, Renee Porter, and she was immensely kind and helpful! She also recommended that we visit Scissortail Park, Myriad's sister park that is a short walk away, and it was just as pretty. All of the staff we encountered were very kind and the grounds were beautiful. Overall, a great experience.",
  "We showed up for the \"Tree for All\" event and as we walked around, my partner commented that even in November this was one of the most beautiful botanical gardens he'd seen... and he's lived in a LOT of different places. I agreed. The layout and arrangement of trees, plants and architecture was all very thoughtful and aesthetically pleasing... and this was BEFORE we went inside the Crystal Bridge to see the tropical plants!! \n\nThat was just beyond cool. And interactive in a way. They call your attention to scientific facts, economical and sociological details and even just the fragrance of certain blooms. There are birds flitting about and trees and plants bursting into exotic, colorful flowers... in November! One of our favorite parts was definitely the hot air balloon planters... if I could've taken those home, I would have. So whimsical and delightful.\n\nWe were so very pleased and intend to come back to see it again in the spring.",
  "For years, the residents of OKC never went in the Myriad Gardens. It's outer beams, which were supposed to provide a protected garden, were instead scary and seemed dangerous. \n\nWhen the garden was redone in recent years, it was amazing what a beautiful park emerged! We love strolling in this beautiful garden with its water features, botanical specimens, great area for children and a picnic, a dog park, a beautiful lawn for concerts and a wonderful place just to enjoy nature. Congratulations OKC on this fabulous redo!",
  "Such a gem! Loved getting to walk through the gardens and see all of the exotic plants. It was seriously a breath of fresh air after the long winter. The gardens are meticulously maintained and there are some nice water features inside. Great for all ages. There are some stairs to get up higher in the building, so if you have issues climbing, keep that in mind.",
  "17 acres to walk around outside before or after entrance. Take bread for kids to feed the ducks; ducks were loving it! Nice tables outside with a small park; one family was having a picnic there. Parking can be tricky especially if there's an event at Chesapeake. Beautiful!! Stunning blooming tulips! Would live to return!! ",
  "The refurbished, reopened Myriad garden is a delight for the senses and a soothing balm for the soul. Everywhere you look, you find beautiful surprises. Don't miss an opportunity to stroll through this wonderland of botanical exotica.",
  "What a wonderful respite during the coronavirus pandemic. Marvelous, vibrant colors of flowers and grass, immaculately maintained including the restrooms, offering a place to walk amongst nature and to picnic during a time of closed restaurants, activities of ducks and songs of birds and scurrying of squirrels and squeals of delight from children. Exciting prospects of one day reopening to outdoor concerts. With all our hearts we gave thanks for this place.",
  "On a nice day, it’s a wonderful place to walk around and enjoy the scenery. The grounds were very well kept and it looked like they even do events down by the water. Would recommend!",
  "It looks like the building belongs in space like the space station. It’s a live desert and rainforest inside. It’s  an amazing experience! ",
  "Tho place is fantastic! We live in OKC and it offered us a great way to spend Saturday afternoon. This is a must  see for locals and visitors. It is now on my list for 2 or 3 times a year. Lots of plants to learn about and appreciate. ",
  "Not a good time to see the gardens in January in OKlahoma😁 only thing we saw was the indoor rain Forrest display which was very nice and we were one of the few there so we weren’t rushed. Will go see it again in the spring!  It is a nice walk about just looking around outside"
 ]
},{
 "name": "Centennial Land Run Monument",
 "address": "200 Centennial Ave South End of Bricktown Canal",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d2/1f/9c/wagontrail.jpg",
 "tags": [
  "free",
  "history",
  "walk",
  "free",
  "walk",
  "walk",
  "free",
  "walking",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d2322328-Reviews-Centennial_Land_Run_Monument-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "We drove through the Bass Pro parking lot trying to find our way out from our hotel and saw this from the parking lot, so we decided to stop and check it out. The Centennial Land Run Monument commemorates the opening of the Unassigned Land in Oklahoma Territory with the Land Run of 1889 by artist Paul Moore. There are dozens of bronze statues of land run participants displayed as they race to claim homesteads. The monument is a city park and is open to the public year around. The park is open 24 hours a day but the monument is best seen during daylight. Parking is plentiful just to the east of the monument. The official entrance is at 200 Centennial Ave, just off Reno Ave, between the Bass Pro Shops and the Residence Inn Hotel. Open daily and admission is free.",
  "An interesting monument, good for a quick photo op and learning about Oklahoma history.  It is at the end of the Bricktown canal and before the boathouse district so it makes for a good place to stop while travelling.  There are several enjoyable walking/running paths in the area including along the Canadian River.",
  "Fun & interesting statue depicting the Oklahoma Land Run. Parking is available at Bass Pro Shop in Bricktown & the monument is a short walk beyond. ",
  "This is a cool little park near Bass Pro Shop and Bricktown. Pleasant area with a waterfall, large parking area and spectacular bronze statues of the Oklahoma Land Rush. Worth it (it’s free)!",
  "We were wandering around the river walk area in downtown OKC and saw this off in the distance. Always interested in statues. These are slightly larger-than-life and well-executed. The statues do capture the sense of urgency the settlers must have felt, right after the cannon went off and everyone started running. I feel bad for the one settler who quickly found himself on the ground. If it's a nice day it's a short walk from the eastern edge of the river walk. Recommended.",
  "Not only is the representative of the Land Run, you can see the tension and excitement in the faces of the animals .\nTruly a must see when in Oklahoma City.  It’s close to the River Walk as well as good restaurants.",
  "This is a very good display of the Land Rush along the interstate, so easily accessed. It's worth stopping to see the bronze sculputre representation!",
  "Such a beautiful outdoor experience. The sculptures depict such emotion and fervor. It’s free and if you’re passing by, we certainly recommend walking around and reading the plaques to learn about the Land Run. "
 ]
},{
 "name": "Hefner Lake & Park",
 "address": "4491 S Lake Hefner Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3f/1c/68/lighthouse-at-sunset.jpg",
 "tags": [
  "walk",
  "walk",
  "free",
  "family",
  "parks",
  "parks",
  "kids",
  "hike",
  "walk",
  "eat",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d589193-Reviews-Hefner_Lake_Park-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "if you want to \"get your steps in\" this is a great place to go.  Trail all around the lake (over 9 miles) and plenty of parking.  It can be very windy in OK so keep that in mind.  The trail is clean and clear and there is plenty of room to walk along with bicycles and skates, etc.   Bring your own water - they do not have kiosks selling bottled water nearby.",
  "if you want to \"get your steps in\" this is a great place to go.  Trail all around the lake (over 9 miles) and plenty of parking.  It can be very windy in OK so keep that in mind.  The trail is clean and clear and there is plenty of room to walk along with bicycles and skates, etc.   Bring your own water - they do not have kiosks selling bottled water nearby.",
  "Hefner Lake is a good place to take the whole family. There is lots to do parks, trails, fishing, boating, eating out etc... Can get a little windy so be aware. Lots of free parking at various locations around the lake. ",
  "The automated lighthouse is picturesque, but the lake is probably more appealing in warmer weather. Even on the windy morning I visited, it provided an interesting view.",
  "With the lake being a few minute bike ride from my apartment, I would frequently take a few laps. The trails are super smooth for bikes, and friendly for walks, dogs, etc. There are parks and restaurants on the lake as well.",
  "I have traveled extensively and can’t understand how the “dog lovers” can’t pick-up their pet’s poop.  Unbelievable the amount of crap on side of paths.  If you have kids don’t go off the paths.  If you want to bring a blanket for a picnic or just relax. Look around for the piles from ignorant pet owners. \nVery sad. \n",
  "Getting a little crowded!? I don't think so, but anyway, we all need to keep moving, and this is a good place to do it. Bring the bike, run, or hike around part of the lake. It is 9 miles one circuit. We did only 3 miles' worth after lunch -- hey, you know, we're pretty old!\n   Bon walk,",
  "My wife and I went to this Lake and Park.  Great place to spend a few hours.  We went to the lighthouse and walked around.  They also have restaurants nearby that would be perfect for a bite to eat and\\or a drink."
 ]
},{
 "name": "Oklahoma City Museum of Art",
 "address": "415 Couch Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/28/12/ff/oklahoma-city-museum.jpg",
 "tags": [
  "art",
  "field",
  "unique",
  "walk",
  "art",
  "unique",
  "art",
  "food",
  "field",
  "history",
  "creative",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d645392-Reviews-Oklahoma_City_Museum_of_Art-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "“Glass is the most magical of all materials.  It transmits light in a special way.\"\n-Dale Chihuly\n\nAfter seeing Dale Chihuly’s work at the Atlanta Botanical Gardens, and the Seattle’s Chihuly Gardens and Glass next to the Space Needle, it was a no brainer to see his exhibit at the Oklahoma City Museum of Art.\n\nIs there any more beautiful artwork than light streaming through colored glass? Think stained glass windows.  Think Tiffany lamps.  And think Dale Chihuly, creator of huge colorful glass sculptures in varying shapes and textures.  One of the largest collections of Chihuly glass is on permanent exhibit at the Oklahoma City Museum of Art.\n\nIn 2002, the Oklahoma City Museum of Art inaugurated its new home in the Donald W. Reynolds Visual Arts Center with an exhibition of glass and drawings by Dale Chihuly.  Bolstered by enormous public support, the Museum purchased the exhibition, which included works from Chihuly’s best-known series and was anchored by the 55-foot Eleanor Blake Kirkpatrick Memorial Tower in the Museum’s atrium.\n\nRedesigned in collaboration with Chihuly Studio, the galleries incorporate a unique design that features a three-dimensional approach to viewing some objects in the collection.  The presentation allows visitors to explore the large Float Boat and Ikebana Boat installations from all sides as well as includes viewing slots for the Reeds.\n\nChihuly’s work is included in over 200 museum collections, including the Oklahoma City Museum of Art, and he has received world renown for his extensive glass series, international projects, and large architectural installations such as the Museum’s Eleanor Blake Kirkpatrick Memorial Tower. The Museum’s collection represents over three decades of Chihuly’s finest work and heralds this brilliant luminist as the most important artist working in glass since Louis Comfort Tiffany.\n(okcmoa.com)\n\nThis exhibit captures your attention as soon as you walk into the museum’s door as just inside in the atrium is the 55 foot Eleanor Blake Kirkpatrick Memorial Tower, (2002), which sets you up for the breathtaking display to come shortly, once you are in the galleries. The Tower, 2400 individual hand-blown glass tubes in yellows and blues twist and curl together, soaring 55 feet up the museum’s three-story entry atrium,  hinting at what awaits you in the third-floor exhibit.\n\nThe Oklahoma City Museum of Art has one of the largest collections of Chihuly glass in the world.  Originally titled Dale Chihuly: An Inaugural Exhibition, which showed in 2002, the Museum eventually purchased the entire collection in June 2004 and later re-titled it Dale Chihuly: The Collection.  The collection also includes later gifts to the Museum by Dale Chihuly and the installation was modified again in 2015 and relaunched as Dale Chihuly: Magic & Light. (newsok.com)\n\nThe first room we entered was “The Reeds”, lovely long purple glass pieces that were embedded into several logs; the light gave a very serene feel to the exhibit.  It was a great way to start the exhibit.\n\nChihuly made the first Reeds in Finland in 1995.  To make them, one glassblower climbs onto a mechanical lift while holding the gather of glass on the blowpipe and blows into the glass while another person on the ground pulls it from below.  Some Reeds are longer than 10 feet.\n\n“During the planning of the inaugural Dale Chihuly exhibition at the Oklahoma City Museum of Art, a large storm brought down trees at the house of the Museum’s then-director Carolyn Hill,” Shotick said.  “After being treated for insects or mold, the tree trunks were brought in and used as the base for the Reed installation, adding a piece of Oklahoma to the exhibition.” (newsok.com)\n\nThe next room had many pedestals, each with a beautifully lit bowl.  There were many colors reflected in the bowls; reds, blues, yellows, and greens are just a few of the vibrant hues.\n\nThe next room had a whimsical feel about it.  The Confetti Anemone Wall, 1999, has blown glass art of many different colors, with ridges on the glass and many twisted layers, giving the pieces a beautiful playful look.\n\nNext up, was the room with the Autumn Gold Persian Wall, 2002.  These were large orange and red fan looking pieces; some hung from the wall while others were on polished black bases about eight inches off the floor creating reflections of the pieces above.  The detail in the glass with the different patterns in them is stunning.  There were also Tiger Lilies at a right angle to the Autumn Gold Persian Wall.\n\nJust when you think there can be no more surprises, you come to the Persian Ceiling, a passageway that entices you to look nowhere but up.  Going from one room to another was a corridor with the Oklahoma Persian Ceiling, 2002, and Twilight and Aurora Persian Set, 2004.  This beautiful ceiling displays colorful pieces of glass in a mosaic above the glass ceiling.\n\nThe Persian series is an eccentric collection of brightly colored and unusually shaped glass pieces.  “The series started with small and experimental geometric shapes - primarily small bottles and vessels,” Shotick said. “Gradually, Chihuly pushed his Persians into large fluted shapes, which are then often grouped with the smaller vessels.”  “If you look closely at the glass-filled ceiling, you can see five putti.  Italian for ‘little boys,’ putti are imaginary winged figures that were often used as decoration in Renaissance and Baroque art,” Shotick explained. (newsok.com)\n\nFor me the Seal Pups, 2002, were a little odd with the logs and what to me looked like long red and black water balloons.  It seemed out of place with the other exhibit pieces.  Pretty to look at but confusing, in a way.\n\nThe orange baskets here reminded me of the ones in Seattle, which were with the Native American display.  There, Chihuly’s glass baskets were displayed along with native woven baskets in Chihuly’s personal collection.  The lighting gave color and texture to the walls and floor enhancing the display.\n\nMy favorite room was the Float Boat & Ikebana Boat display.  \n\nThe boats sitting on the polished black floor gives the light and reflective qualities another dimension.  \n\nWhat was really great about this was the full 360° access the viewer has to the boats.  You may walk all around them seeing different forms and colors from every angle.  The dark room with the brightly lit balls is completely mesmerizing. \n\nPerhaps the most intriguing pieces of the collection, the glass-filled boats are especially beloved for their whimsical qualities.  But their story is equally intriguing.\nChihuly first filled boats with glass in Nuutajärvi, Finland, while working on a collaborative project for the exhibition “Chihuly Over Venice” in 1995, Shotick explained.  After several days of glassblowing, the artist and his team made temporary installations along the Nuutajoki River.\n\n“Liking the way the glass looked in water, he tossed pieces into the river, letting them float downstream,” Shotick said.  “Local children in small wooden rowboats joined in and gathered the floating glass for him, and it was then that Chihuly saw the opportunity for a new type of installation.”\n\nShe also said that the team found a partially submerged wooden rowboat along the riverbank, which was hauled out and emptied of mud and debris, and Chihuly filled it with glass.  “He has continued to revisit the boat idea ever since,” Shotick added. (newsok.com)\n\nChihuly worked with Italian glass master Pino Signoretto on this series, to add classical solid glass figures to contemporary blown glass vessels. The name Putti was inspired by the frolicking cherubs featured in their earliest pieces. Since then, Putti has expanded to include vessels with a range of mischievous figures, such as birds, mammals and sea creatures. (chihuly.com/work/putti)\n\nThe Putti Room was filled with beautiful pieces showing the various intricacies of birds on numerous colored vessels.\n\nThe Ikebana Room had colorful pieces displayed against a backlit wall on a black polished base. \n\nThe glass work exhibit is just amazing.  It is hard to imagine the huge tower in the museum entryway, how much work went into planning, creating and assembling it. The glass ceiling, the boats, and other glass works are all impressive.  Seeing the Chihuly collections all over the country gives a sense of inspiration to the possibilities of what one can do in any medium or field of endeavor.\n\nGo see this beautiful collection of blown glass, the vibrant colors and the endless surprises of what you will see at the Oklahoma City Museum of Art will not disappoint.  There are other collections that are showcased on the multiple floors of the museum giving a nice variety of artwork, displays, and interactive exhibits, for the visitor to enjoy.",
  "Following our second visit to the museum's excellent café, we were treated to two excellent visiting exhibitions, along with the resident collection and the stunning Dale Chihuly glass. A wonderful experience!",
  "A cornerstone of OKC's successful renovation of downtown, the OKC MoA is world-class from the traveling exhibits to the largest permanent collection of renowned glass blower Dale Chihuly.\nIf you're in town on a Thursday night, during the warmer weather, they have an after-work gathering spot on the roof with an incredible view of downtown.\nGet there in time to see a sunset!",
  "This museum is small but still grand.They have a large Chihuly exhibit which was fantastic. They also had some works from Ansel Adams although there are only about 7 pieces of his. The staff were very friendly and helpful. The cost to get in is only $12 per person which is more than reasonable. Warning: the museum is not open every day so check before you head over. ",
  "If you love or are interested in Chihuly art, this is a stop you must make. The exhibit is breathtaking. I think it could convert even the skeptic into a fan. The rest of modern art gallery was interesting as well. For me the remainder of the  museum was a bit lackluster. There's also a connected movie theater showing unique films and a cafe. Parking is a bit of a challenge -- prepare  to pay at least a minimal amount.   ",
  "If you have any interest in art museums, this is a lovely collection that is housed in a wonderful building.  For a visitor, one of the best things is that the museum can be fairly comprehensively covered in a couple of hours.The Chihuly glass collection alone is worth the stop, but the galleries include a little bit of everything, such as early European paintings, American contemporary, furniture, antique silver to modern sculptures. The temporary exhibits are almost always fascinating.  If you need a lunch or dinner break, the Museum Cafe is a great little restaurant, with a diverse menu and a first class atmosphere and waitstaff (and pretty much prices to match).\n\nFull disclosure: I have a membership to this museum and have volunteered there as a docent between 2004 and 2013.  I have no business relationship with the museum or cafe, but I have gotten to know the staff over time and they really are terrific. I travel a lot and I've been in a lot of museums; in the smaller museum category, this one definitely holds its own.  My recommendation is a personal one and wholehearted and does not benefit me in any way.",
  "The Dale Chihuly exhibit is beautiful. The museum is spacious, and the food is exceptional.Went on a Wednesday afternoon. Parking was a little difficult, but it was worth it.",
  "This museum has all the trappings of what you'd find in Seattle or a smaller New York City museum. I've enjoyed every exhibit I have ever visited here.  This is a must-do for local and vacationers.",
  "I recently visited the museum with my son on a school field trip.  It started off as a pleasant then became extremely uncomfortable as the staff/volunteers are extremely too stringent and punitive.  By the time I left, I felt so uncomfortable as the littlest things the children would do- they’d get reprimanded.  I understand preserving history, but every where we turned someone was there to correct them about something- anything.   I won’t ever visit this museum again! If it’s a place “kid friendly”- you certainly were NOT!",
  "I couldn't resist visiting after hearing about their Chihuly collection & it was stunning! This museum also offers Discovery Packs for kids - which I can't compliment enough. The pack is loaded with creative items & tools to help improve the museum experience for children (which makes it better for adults as well!) I hope to see more museums offering these type of packs in the near future. We took our daughter, niece, and nephew so we had three kids from ages 5-15 & everyone enjoyed exploring this museum!",
  "We go here constantly. They have fantastic permanent and traveling exhibits. It is a must see for anyone visiting Oklahoma City or the surrounding area."
 ]
},{
 "name": "Chickasaw Bricktown Ballpark",
 "address": "2 S Mickey Mantle Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/76/af/34/a-view-of-the-ballpark.jpg",
 "tags": [
  "kids",
  "field",
  "walk",
  "family",
  "eat",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d618891-Reviews-Chickasaw_Bricktown_Ballpark-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a nice place to see a game.  New and modern, it sits in the heart of Bricktown.  Easy to get to and public parking is available across the street.",
  "This is a beautiful way to spend the day with kids, self or loved one.Sponsor a child, or bus load for the day .There is nothng better than a ball game to start the days of summer. Cheer on Redhawks ( Huston Astro farm team) or your favorite visiting team. There is just no bad day at ball park !",
  "It's ok. It's a ball park. Over priced, over rated. Fits into the theme of the area called Bricktown. I've been to ballgames there and to concerts. It has good seating capacity. It's never \"full\" but finding a parking place close by might be.  So go early if you have an event to attend there. The staff is just average... nothing to write home about. It's just another ball park. ",
  "One of the Nicest Triple-A ball fields in the Nation & I Wish the Man who overseas the Awesome Field & Fix my yard in Moore,Ok. !!",
  "This is a very nice ballpark to take in a game. We enjoyed the game but were expecting the food/drink prices to be lower.",
  "Hubby got to see the statues of both players at the entrances to this ballpark and he was thrilled.  We were able to score tickets in the patio deck which had great views and very attentive staff working the area.  Nice ballpark and there doesn't seem to be a bad seat around.  We were able to walk from our hotel and there are other hotels nearby.",
  "This ballpark was built with nothing but the best! Centrally located in the heart of Oklahoma,City. Nothing spared! A great family venue! Good food choices available, ample parking, walk from your hotel Lots of great places to eat before the or after the game! Have a great time at all the activities around on the way to and from the bill park! Have fun",
  "We have visited this ballpark many times and every time we are stuck by how beautiful the park is. It is well maintained and a fun environment! "
 ]
},{
 "name": "45th Infantry Division Museum",
 "address": "2145 NE 36th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/91/ee/8e/45th-infantry-division.jpg",
 "tags": [
  "free",
  "unique",
  "knowledgeable",
  "history",
  "knowledgeable",
  "history",
  "wander",
  "free",
  "free",
  "walking",
  "history",
  "free",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117287-Reviews-45th_Infantry_Division_Museum-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great collection of vehicles, weapons, uniforms etc!  Could spend several hours here at this free museum(donations accepted)  One of the largest collections of small arms in the nation.  The volunteers here know their stuff and are more than willing to share their knowledge and stories with you.",
  "This museum is just outstanding... a huge collection of military vehicles on display on the outside, and great exhibits on display inside.  My favorite vehicle was the 8\" Howitzer - impressive to see one right in front of you.  I really liked the collection of Bill Mauldin comics from WWII - very unique collection.  The veterans working as curators are extremely knowledgeable and friendly.  If you're in the OKC area, this is a must-see stop!",
  "Traces the history of the 45th Infantry from European contact up through modern times, with emphasis on World War I and World War II. Outdoor exhibits show larger equipment such as artillery pieces, trucks, amphibious vehicles, tanks, and aircraft. Indoor exhibits show small arms, uniforms, photographs, and other small relics of history. Guide was friendly and very knowledgeable. Excellent coverage of small arms (pistols, rifles, machine guns) from European contact through the Korean war, limited coverage on up through the present. Dioramas, some life size, illustrate conditions soldiers faced. I found the World War I trench diorama particularly informative. Display of the Nazi concentration camp liberated by the 45th was both informative and chilling. I spent about three hours there and covered everything in decent detail, but I'd like to visit again to soak things up a bit more.",
  "A nice collection of military history, and equipment. Plenty of chances to takes pictures of tanks, planes, and other large military equipment. There is no charge, but they do take donations so be sure to have some cash on you if you visit. I recommend if you have a couple hours there isn't a better way to spend it",
  "I take everyone to this museum. I warn them that it is need of some updates inside and paint, but it's totally free and has incredible artifacts. Make sure you take the time to wander the grounds and check out all the aircrafts on display, they even have picnic tables so bring some snacks and stay awhile. The inside of the museum is packed full of memorabilia. They have uniforms, weapons, maps, items from Hitler's palace, flags, and lots more. There are items here for everyone in your group to enjoy looking at. Stop in and don't forget to donate.",
  "Free parking and no entry fee; however, you can give a donation.\nThe 45th infantry was an important part of the victory of WWII and has many displays from that time period.  Military object both outside of the museum and inside the museum building.  One of the best sites in OKC.",
  "Inside museum closed for covid. The outdoor exhibits were very good, well worth the drive. There is also a train museum nearby, but it has limited hours and we could not visit.",
  "As a veteran of 27 years in the Army I really enjoyed walking and viewing the military history of the museum. ",
  "Plan on a couple of hours (at least) to view this museum. Some items I had never seen anywhere in other military museums. Free admission (but please drop a few dollars in the donation box). Both inside displays as well as a large static display outside.  ",
  "We visited because my father in law was part of the 45th that liberated Dachau. This museum was created and is staffed by volunteer veterans. It covers from the Revolutionary War to the present- uniforms, artillery, etc. The best part for me is a whole room of Pulitzer Prize winner Bill Mauldin WW II cartoons. Outside are jeeps, cannons, planes, helicopters. Kids, especially boys, loved this museum",
  "My wife and I toured the museum in August 2019. There was a lot to see inside and outside. I was disappointed in the sparse displays of Vietnam era stuff. It is worth your time to visit and don't forget to leave a donation."
 ]
},{
 "name": "Max's Magic Theatre",
 "address": "8312 NW 118th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/c0/13/e4/upgraded-seating-and.jpg",
 "tags": [
  "family",
  "walking",
  "walk",
  "family",
  "family",
  "family",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d5995994-Reviews-Max_s_Magic_Theatre-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was a wonderful experience. We don't usually take the time to write reviews but we felt like we should put our two cents in here and say Go See This Show! Everything was well arranged the magic was amazing and the audience participation was the best part even for the introverts in the family.",
  "Drive down Central too quickly and you might miss it. Walk in the front door and you still might miss it. But if you did, you'd miss one heck of a show.\n\nWe went there for a Friday date night after grabbing dinner at Two Fools on that same block. After walking into the hallway to the store, we weren't sure what to expect. What we found was a warm reception! \n\nMax is a consummate professional, seeming to genuinely care about making sure all of his guests are enjoying himself. The theater is an intimate space as is and he was performing to a smaller group the night we went. \n\nEveryone got plenty of chances to participate and he pulled off some pretty amazing tricks! (No spoilers) The closeup magic was especially well done. You can tell how much he enjoys performing and the level of magic being performed is well above what you might expect in Albuquerque. It's truly a hidden gem!\n\nI'd recommend this wholeheartedly for a date night or for families making their way through town. Keep up the great work Max!",
  "Max's show is great! LOTS of audience involvement and interaction.nIf you don't like being part of the show then sit in the back, otherwise he'll get ya! Slight of hand, card tricks, mind reading, and plenty of humor to go along with it. He packs a lot of entertainment into it. And after the show we got to peruse Max's store for our own tricks and talk with him. I definitely recommend as a date night or with the family or if you're visiting Albuquerque and want to do something different and fun for a couple hours.",
  "We were so sad to hear about Max's tragic accident.  We just saw his show at the beginning of August and came home and told everyone how awesome it was.  May his friends and family be at peace knowing that He is with our loving Father in Heaven again.  He was very talented and we are glad we were able to see his talents shine.",
  "We were so very fortunate to go to a Sunday afternoon show with Max in July, 2019 as a birthday gift to our great granddaughter. I was forwarded a story from News 9 that Max was involved in a bike/auto accident last week and succumbed to his injuries last Friday, 08/26/19. What a sad loss. Our thoughts are with his family. OKC has lost an amazing resource.",
  "Had a great time! Very entertaining! He was awesome! My sister and I were so amazed by his talent and skills!  Highly recommended for an entertaining evening!",
  "I got tickets for date night. I was looking for something different and then I found this. We had a great time and I can say I was truly amazed of what he could do.  He has great personality and it was a lot of fun. We plan on going back with another couple. This is a must do!!  Kids would absolutely love it.  Thank you Max for a great time. ",
  "We took our teenagers to see this extremely talented close-up magician! It was a very strange residential neighborhood that was a far drive from our hotel in Bricktown, but we knew this when we booked the tickets and honestly, the drive out only elevated our excitement for the show!  Max holds the show in his converted den/living room. Max is a supremely talented magician and the show exceeded our already high expectations! I don't want to spoil the show in any way - I can just say (like many of the other reviewers here), days later we are still trying to figure out how he did most of his tricks! He involved the audience beautifully and the kids left with souvenirs of items manipulated during the show. This was a wonderful experience the we won't forget and I cannot recommend this experience more highly!"
 ]
},{
 "name": "Chesapeake Energy Arena",
 "address": "100 W Reno Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/6d/93/66/chesapeake-energy-arena.jpg",
 "tags": [
  "food",
  "drink",
  "food",
  "walk",
  "food",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d615990-Reviews-Chesapeake_Energy_Arena-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great multipurpose arena. Parking can sometimes be a hassle but once you're inside you forget about that! I've been to Thunder games, concerts, and an ice skating show here and the building has been very adaptable to each event. Always look forward to coming here.",
  "Get there 90 minutes early to see the teams practice and autographs. Not a bad seat in the house. Time the lines for food and restroom and it was a quick wait. Go at halftime and lines get long.",
  "We attended a Thunder game recently, and had a great time. There was heaps of atmosphere and we really enjoyed the night. \nThere’s a very good OKC merchandise shop with plenty of variety, and enough food and drink outlets that we never stood in much of a line.\nI would recommend making a reservation at the Budweiser Brew House (located in the arena) for 4:30 (gates usually open at 5:30 for a 7:00 game). This allows you to be among the first in the arena and watch the players warming up, maybe get a couple of autographs, soak up the pre-game atmosphere, etc.\nWe received special badges because it was our first time attending an OKC game - just ask at the desk outside the Brew House.\nThe arena is easy to walk to from any of the hotels in Bricktown. There are also many restaurants and bars in the area.\nOur only disappointment was that none of the OKC players signed any autographs the night we were there - not even for the hard core fans who got there 90 minutes before the game (when the gates open) and staked out spots right next to the tunnel. \nOther than the disappointment of no autographs, it was a great experience and we would recommend it.",
  "It was a very nice place I went to see a thunder game they serve very good food but the clothes at the shop are a little to expensive for me.",
  "Thunder up! I thoroughly enjoyed going to Thunder games here frequently. I also had the pleasure of seeing a couple concerts here too!",
  "I've attended many events at the Chesapeake Energy Arena throughout the years, and many for a Thunder game. However, this past season (2019-2020) I've made more of an effort to make it to the Peake for a game. As always, the staff is excellent, and the environment is full of excitement. With the help of the thunder drummers and the roars of the fans, it is easy to consider the Chesapeake Energy Arena, the heart of Oklahoma City. \nA day at the Peake is a day well spent, whether you are sitting courtside, club level or up in loud city. The experience may be different from the last, but all a good time!\n\nAnd as for the team, who was expected to flop in \"rebuild\" season, they are as fun as ever to watch. From blow-outs and back to back 20+ point comebacks to neck and neck games and cross-court baseball throws for a layup. This group plays team basketball, and they are definitely worth a trip to the Peake!\n Chris Paul shows great leadership on this team. Steven Adams is a crowd favorite as always. Shai Gilgeous-Alexander has captured the hearts of Oklahoman's as a rising-star. Danilo Gallinari knocking down shots around the arch and Lu Dort starting this last stretch of games as a firecracker with Dennis Schroder coming off the bench as a contender for the Sixth Man of the Year to lead the bench players who, like the starting five are fantastic to watch. I quickly became a big thunder fan once this season started rolling.",
  "Food: 3/5\nService: 5/5\nCleanliness: 4/5\nDecor & Style: 1/5\n\nFood is typical stadium food; hot dogs, chili dogs, burgers, fro-yo, etc. Nothing very special. The club deck (forgot what it's called) is nicer, has better selections and \"fancier\" items, but nothing worth saying \"wow\". \n\nService is great, staff is super friendly so that is unusual compared to other stadiums. Stadium is well kept and clean.\n\nThe decor is pretty boring for a stadium that was built in 2002. I don't think they tried to be original and just copied a design from the 1980's. The BOK Center in Tulsa was built only 3 years after the Chesapeake Arena and the BOK Center looks LIGHTYEARS ahead of Chesapeake! No excuses, Chesapeake Energy Arena!",
  "Had a visit to Chesapeake Energy Arena for a OKC Thunder game. Easy to navigate and find your seating, helpful staff. Had the opportunity to watch the warmups courtside, before heading to our seats. Plenty of food options, although I was rushed and made some yucky choices, but that's on me! All in all, a good experience."
 ]
},{
 "name": "Oklahoma History Center",
 "address": "800 Nazih Zuhdi Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/72/f6/c8/oklahoma-history-center.jpg",
 "tags": [
  "history",
  "history",
  "walk",
  "free",
  "tour",
  "walking",
  "history",
  "organized",
  "learn",
  "history",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d739269-Reviews-Oklahoma_History_Center-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "Best way to see the history of the state with excellent presentations of Native American period and early settlers/land run period.",
  "A top notch place full of Oklahoma history. Exhibits from the land rush to present including Wiley Post Airplane.A must for any history buff.",
  "What a neat place...learned a lot about Oklahoma and many of the thing that have happened in the state. This is where the first grocery cart was invented and Oklahoma City was the first place to have a parking meter installed!\nReally enjoyed it all and the outside area is a really nice walk and educational. ",
  "We're visiting our daughter and although I had driven through OK years ago we don't know a lot about the state. Therefore, we found this center right by the state capital worth an hour or two. We especially liked the wall of outlaws -- don't miss that! And the free enterprise exhibit.  I learned that sonic burgers were started up here.  I also didn't  know about willie may flying around the world in 1935.  The display on the women's movement in the meeting hall is also good.\n   You should have plenty of room for strolling around as we were the only ones in the place when we visited yesterday.\n    I always think of Oklahoma as a big oil state, but they don't stress that here.\n    Be sure to take the \"ride\" on braniff airlines! Now that is fun...\n    Enjoy.",
  "Missed a lot, but it was the tail end of our tour.  We were a bit 'done' with our walking around museums.  But this one was very nice and filled with information.  We only went to one area that included the 'pink kitchen' and 'Oklahoma, the musical.'  Good stop.",
  "Best way to see the history of the state with excellent presentations of Native American period and early settlers/land run period.",
  "This is an excellent facility with tons of displays to keep you busy and moving the entire time. We only had an hour and a half, so we had to rush through a lot of areas, but it gave us a good idea about the local history. We were amazed to learn that this is where the first grocery cart was invented, and that OKC was the first city to have a paid parking meter installed. Cool facts!\n\nThe Museum is large, and has several galleries to explore on a few floors. The Exhibits are fantastic.  Everything is laid out and organized well. In some rooms, there was too much stuff, but we did come out learning quite a bit about Oklahoma. We enjoyed the quick glimpses and the overview in all the rooms, but we particularly liked the exhibits devoted to OKC’s commercial history, the Vietnam War and the local soldiers, the 39 Tribal Native American Tribes, the Steamboat “Heroine”, and the oil and gas industries. The airplane “Winnie Mae” and the Helicopter hanging on the ceilings were intriguing.\n\nThe outdoor exhibits and sculptures are really nice too. The Devon Oil and gas Exploration Park was so much bigger than we thought. Allow at least half an hour to see this, and definitely check out the “Timeline of Oklahoma History” on the large tiles in the walkway just outside.\n\nThe Gift Shop was stocked with souvenirs, books and items from native artists.\n\nWholeheartedly recommend a visit. We will certainly return on our next trip to this city.",
  "Our Sunday School Class [all over 50 years old] greatly enjoyed Oklahoma History Ctr. There was so much to see that we will have to go back another day. Several of us were born or raised in the Oklahoma City area so we recognized so much of it because we had lived through it. The rest were from Oregon and Kansas so didn't relate to it but learned much about things like the grocery cart and parking meters being invented and 1st used in Oklahoma City. It was fun to do dress up and sing the song \"Oklahoma\" form the movie. I've been here several times before but always enjoy bringing new people to learn about Oklahoma."
 ]
},{
 "name": "Henry Overholser Mansion",
 "address": "405 NW 15th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/3b/f0/c7/overholser-mansion.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "knowledgeable",
  "tour",
  "historic",
  "free",
  "historic",
  "history",
  "kids",
  "tour",
  "historic",
  "tour",
  "tour",
  "family",
  "history",
  "tour",
  "family",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117293-Reviews-Henry_Overholser_Mansion-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "We made it a point to stop here on our way through town.  And it was well worth it.\nOur tour guide was Lisa who is one of the two people who work with the historical society in maintaining the house.  It is a not for profit organization.\nWe were fortunate that we were the only two people on the 2 PM tour so Lisa was able to customize and expand the tour for us.  We spent just a bit over an hour inside the house.  The house itself is a wonderful time capsule from 1903 since most of the house furnishings and interiors are the originals from that time.  It has been updated to include AC which is very nice in the summer!\nAn interesting Hollywood USA connection is to actress Megan Mullally, whose grandmother grew up in the house across the street and who was a frequent visitor to the house.\nParking is on-street, which was quite easy since it's in a lovely residential area filled with elaborate turn of the last century homes.  The house is not accessible.  There are stairs up to the front door plus two flights of stairs inside the house.\nThe tour starts from the adjacent coach house, which is nicely air conditioned and has quite a bit of comfortable seating where you can wait.  There are some regional displays there too.\nThis is well-worth making the time to visit if you're in the area.",
  "If you like old homes, then this is a place to see! The tour guide is super knowledgeable, and encourages questions. She doesn't have a script, she has experience! This magnificent home is integral to OKC history and located in a beautiful neighborhood.",
  "I always love to tour old homes and this home was extraordinary!  My friend and I were treated to our own private tour since we were the only ones who were there at that particular time.  This house is absolutely gorgeous!  It truly felt as if the owners had just stepped out and could be back any minute.  The detail put in to the building and furnishing of the house is wonderful!  Our guides were absolutely lovely and super knowledgeable.  Nikki (I may be spelling her name incorrectly) was our guide for the majority of the tour and her passion and enthusiasm were contagious!  This is a must see piece of OKC history and should not be overlooked!",
  "The Heritage area is a very pretty historical area of Okla. City. Close to downtown. It is very easy to get to this mansion and to park. The mansion was very interesting and had some original furnishings. ",
  "Probably the best old home I have seen. Pretty much everything inside is original. The curator is a very knowledgeable lady, full of great stories. Take the last tour available because you will have more of her time.",
  "This is a must-see for the historical or architectural enthusiasts.  (Our teen loved it as well!)  We booked the tour in advance due to a busy season, and they were exceedingly accommodating for our health challenges and time constraints.  Our tour guide was a wealth of knowledge, provided a phenomenal tour, and gave us time to see every single detail we wanted to see.  We'd go back in a heartbeat.  She also guided us to our next stop to local flavor restaurants, recommended historic B&B lodging, and served as a travel agent of sorts on the spot.  VERY impressed.  Don't miss this stop!",
  "This was my second time at the mansion. First time was for a Paranormal Investigation a couple years ago so it was nice to do the your and be able to hear all the history. \n\nBuilt in 1903 before Oklahoma statehood by Henry Overholser, his wife Anna and one daughter (Henry Ione) who lived in the home. Mr. Overholser was known as the “Father of Oklahoma City”. The home is said to be the first mansion built in OKC. \n\nHenry Ione & her husband (David Jay Perry) lived in the home and since they had no kids, Mr. Perry sold the home to the Oklahoma Historical Society In 1972. The sale included all the Overholser’s belongings, so everything in the home is original. \n\nThe home is beautiful & in pretty good condition for a home constructed 117 years ago. Mrs. Overholser had wonderful taste all the way down to the intricate details. \n\nThe mansion has fun events throughout the year to help with fundraising efforts to help maintain the property. You can find them on Facebook to keep informed of upcoming events. \n\nTours are offered every hour on the hour Tuesday-Saturday 10 am to 2 pm. $10 adults, $7 seniors 55 +, $5 students/children, under $6 are free. \n\nGreat historic home to check out in the heart of OKC, hard to believe this was in the country when the home was built ♥️",
  "Beautiful house.  This house had almost all the original furnishings and that enhances the visit.  Historic Preservation tour guide knew all the most interesting details about this mansion.",
  "We made it a point to stop here on our way through town.  And it was well worth it.\nOur tour guide was Lisa who is one of the two people who work with the historical society in maintaining the house.  It is a not for profit organization.\nWe were fortunate that we were the only two people on the 2 PM tour so Lisa was able to customize and expand the tour for us.  We spent just a bit over an hour inside the house.  The house itself is a wonderful time capsule from 1903 since most of the house furnishings and interiors are the originals from that time.  It has been updated to include AC which is very nice in the summer!\nAn interesting Hollywood USA connection is to actress Megan Mullally, whose grandmother grew up in the house across the street and who was a frequent visitor to the house.\nParking is on-street, which was quite easy since it's in a lovely residential area filled with elaborate turn of the last century homes.  The house is not accessible.  There are stairs up to the front door plus two flights of stairs inside the house.\nThe tour starts from the adjacent coach house, which is nicely air conditioned and has quite a bit of comfortable seating where you can wait.  There are some regional displays there too.\nThis is well-worth making the time to visit if you're in the area.",
  "This was another stop for us -- as part of the “Mansions Tour”. As soon as we checked into the Carriage House, we were left in the capable hands of Lisa – the guide for this particular mansion. She was cheerful, friendly, a wealth of information and passionate about the history of the house and its owners.\n\nMoments after we walked inside the house from the side entrance, we were transported back in time to a different era of early 20th century opulence. The home was elegant, and all the items were gently used. The place is exactly as it was the day that the son-in-law handed in the keys to the Historical Society and walked off into oblivion. There was a lot to see on all the three floors – the craftsmanship, the wall paintings, the artistry, the woodwork, old furniture and the amazing stained glass windows. The décor and the lifestyle of the rich family was a fascinating peek into old Oklahoma. The quarters for the governess on the third floor occupied the entire top space, and the largest we have ever seen for a person in that position.\n\nThis was the first mansion built in this city, and the owner is known as the “Father of Oklahoma City”. We were happy to receive that fascinating look inside this beautiful historical house. The stories about the house and the anecdotes about its owners made our tour feel so real, and so much more appealing.\n\nDo stop by if you want to spend an hour or so in another time period. Obviously a “Must” for history buffs.",
  "This place is amazing.  It was lived in by the family until the 70s.  When they left they gave it with all of the furnishings to the historical society.  Our tour guide was very informed on the history.  There are quite a few stairs and no handicapped access."
 ]
},{
 "name": "Wheeler Ferris Wheel",
 "address": "1701 S Western Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/21/9b/9f/photo1jpg.jpg",
 "tags": [
  "food",
  "kids",
  "drink",
  "music",
  "food",
  "walking",
  "walk",
  "food",
  "kids",
  "drink",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d10536171-Reviews-Wheeler_Ferris_Wheel-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I really enjoyed our visit to the Wheeler District. It’s a laid back community space- kids playing, hammocks swinging, maybe a food truck, clean restrooms, and a little  place to pick up a snack or drink. The staff was very polite and helpful. It seemed they really wanted us to enjoy our time there. I would definitely recommend it- and there’s a lot of instagramable pics to be had. Win-win! ",
  "Water front, paths along the river, hammocks to just hang around in.  You can play various games there or just relax.  The ferris wheel ride would be great at night to see the city skyline!  We did not stay that long.  You can buy one ticket or an all day pass!",
  "Go at night and the lights are spectacular.  The price is not overly expensive and a long term pass is available.  It goes around several times so the rider can view the skyline all around.  The line was not overly long and the wait time short.  It was a lot of fun.  There are concessions and picnic areas available too.",
  "Ferris Wheel allows you to take in the Oklahoma City skyline from south of downtown, see other landmarks of surrounding area. Grounds also include food, fun, and games to keep the youngsters interested. Recommend visiting on the weekends when there are music performances to let the visit have an added element.  ",
  "Despite the fact that it was freezing we went to Wheeler Park to get some exercise. We were from out of town and we wanted to walk along the Oklahoma River. We could see the Wheeler Ferris Wheel from the park but it wasn't operating but it was very large even from a distance. The park has lots of parking and a paved walking path. It was a drab walk in the winter but judging from all the trees around it must be beautiful in the summer months. There is also a fantastic view of the city from the park and we took lots of photos of it. A warning for dog owners...Keep them out of the grass. Our dog got about 8 goat heads in his feet while walking around. We would love to see this area again in the warmer weather. I'm sure it will be a whole other story.",
  "This lovely Ferris wheel in Wheeler Park stands 100 feet high and offers fabulous views of the skyline of Oklahoma City and the surrounding area. Originally it was located at Pacific Park on the famous Santa Monica Pier. It was purchased on EBay in 2008, shipped and re-assembled here on the southern shore of the Oklahoma River.\n\nThe rest of the park has a playground, a snack stand, a covered patio and pretty murals on a large wall of containers. Our favorite items were the hammocks all around. There is even an oil well on the premises.\n\nWhile here, you will not miss the huge iconic “OKC” sign. It was so perfect for our own iconic pictures.\n\nWorth a visit to the park for some rest and relaxation.",
  "The parking was close, but we left the car outside and entered. It was cool, we seated on the OKC letters and it was nice.",
  "Took out of state guest to ride the ferris wheel.  They enjoyed the view of Oklahoma City and eveything in the area.",
  "We went late in the day and the view was breathtaking. It was a little chilly because the cold front came in and made it colder but we enjoyed it anyway.",
  "My husband and I really enjoyed our visit to the Wheeler District. It’s a laid back community space- kids playing, hammocks swinging, maybe a food truck, clean restrooms, and a little  place to pick up a snack or drink. The staff was very polite and helpful. It seemed they really wanted us to enjoy our time there. I would definitely recommend it- and there’s a lot of instagramable pics to be had. Win-win! ",
  "I read all reviews on it before visiting this place last week and many of them told its best to visit during night.well, its good little place for kids and adults to enjoy,with play area and swings. Only issue was, the place is at a remote location and the entrance road is very narrow with no lights in the parking area which creeps you out..! I wish we would have visited during day time."
 ]
},{
 "name": "Will Rogers Park",
 "address": "3400 N Portland Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/eb/71/7a/20180505-182309-largejpg.jpg",
 "tags": [
  "family",
  "walk",
  "family",
  "walking",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d589221-Reviews-Will_Rogers_Park-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great park to take some time and walk around. The landscaping is gorgeous for some family pics or senior photos. It’s a big open park so plenty to see while you enjoy exercise.",
  "The daffodils and crocuses are blooming in early spring, and the gardens are lovely and well maintained. The fountain and ponds are also attractive. I really enjoyed finding the little fairy doors and houses scattered throughout the park!",
  "We hadn't been in years...it is just as beautiful as we remembered.  We had family photos taken...and there were so many lovely places to choose from!  Hidden gem.",
  "We went here to do some Pokemon Go and Wizards United.  Such an amazingly designed park with walking trails, water, benches, and animals.  This would be a fantastic place to bring a blanket, snacks, and a book for relaxing day in nature.",
  "My husband, 11 y/o and I came to this park. We took a lovely walk around and sat under a tree for a bit to get out of the sun. We sat down by the water and watched the squirrels with copper belly’s in the trees. We are from Florida and our squirrels are smaller and all grey so this was neat to see. We got to see lots of duck, geese and turtles. It was a nice visit. We wandered around the botanical gardens located at the park. Not too much to do here but was a nice stop."
 ]
},{
 "name": "American Banjo Museum",
 "address": "9 E Sheridan Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/ec/59/90/american-banjo-museum.jpg",
 "tags": [
  "free",
  "music",
  "learn",
  "art",
  "history",
  "art",
  "history",
  "free",
  "music",
  "history",
  "learn",
  "free",
  "music",
  "learn",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d2043422-Reviews-American_Banjo_Museum-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "I like bluegrass music so when I found myself in Oklahoma City with a free afternoon I had to check out this museum. I spent a few hours there and it became the highlight of my trip. Two floors packed with more designs and styles of banjos than I knew existed! There was an excellent historical exhibit and it was fascinating to learn about the different styles of music that use the banjo. I loved the space upstairs with live music, and I spent quite a while there listening to and talking with the musician. And the staff was absolutely fantastic! I would eagerly come back for another visit the next time I visit Oklahoma City.",
  "Took advantage of the Smithsonian Day to finally see this well-presented display.  We are not musicians, but it was enlightening to see the history and development of the instrument showing its changing role in American culture. So many of the banjos displayed are works of art in themselves.  Beautiful. The text actually enriches the understanding of what is seen and the videos and sound bring the museum to life. Glad we got to see the Jim Henson exhibit and the Jim Bollman Collection, as well.  Just an overall great afternoon.",
  "This was a great find in OK City. The museum has 2 floors of the history of banjos and hundreds of them from the most primitive to works of art. The also have a room with banjos you can play.",
  "An extensive collection of banjos but what most interested me was the history of banjo music - from minstrel to vaudeville to folk to jazz to.... And you MUST visit on the first Wednesday of the month for a free banjo concert from 12-1pm. Bring your bag lunch. It is NOT to be missed",
  "I stopped by here last week and I was surprised at the number of banjos they had there, a person can learn a lot here. They even have a learning lounge where people can play a couple different ones. I will certainly go back and spend more time.",
  "I like bluegrass music so when I found myself in Oklahoma City with a free afternoon I had to check out this museum. I spent a few hours there and it became the highlight of my trip. Two floors packed with more designs and styles of banjos than I knew existed! There was an excellent historical exhibit and it was fascinating to learn about the different styles of music that use the banjo. I loved the space upstairs with live music, and I spent quite a while there listening to and talking with the musician. And the staff was absolutely fantastic! I would eagerly come back for another visit the next time I visit Oklahoma City.",
  "Very friendly staff.  Lots and lots of banjos.  Great history information.  Take your time and enjoy!  Before you leave, try your hand at playing a banjo.",
  "on my last day I had time to waste before my flight later that day.  This was near the Holiday Inn Express so I stopped here to check out.  I enjoyed seeing how the banjo came to be and all the old and new versions of banjo's.  I especially enjoyed the JIm Henson display and Kermit the frog with the banjo on his lap.  I hope in the future Steve Martin will give your museum one of his banjo's for display.  Keep up the good work, and those of you reading this review, please check them out.  It has a great history of the development of the Banjo."
 ]
},{
 "name": "Outlet Shoppes at Oklahoma City",
 "address": "7624 W Reno Ave Suite 380",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/83/6d/90/outlet-shoppes-at-oklahoma.jpg",
 "tags": [
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d2254505-Reviews-Outlet_Shoppes_at_Oklahoma_City-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love coming here. Im from Kansas so we dont have anything like this. Its a nice place for families",
  "Always love the outlets. Disney outlet is our favorite. We also enjoyed the variety of show stores. It was very windy the day we went but it wasn’t too bad when you were inside the outlet hallways.",
  "Best outlet mall I have been too. Very shaded. All store fronts seem occupied. Great bargains. Friendly service. Clean. Good bathrooms. Would stop again.",
  "Outlet shops in OKC are closer together and therefore easier to shop than some of the other outlets visited in other states. Selection has always been good and we use them for the seasonal sales",
  "Went this weekend to do something different and found this outlet. It is a whole bunch of stores in 1 area. Everything that is a mall but the walking around is outside. They have a food court that is inside. Great place to go & I will be going back around Christmas!"
 ]
},{
 "name": "Frontier City",
 "address": "11501 N I 35 Service Rd On I-35, between Hefner Road and northeast 122nd Street",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/0b/fd/da/frontier-city-has-a-new.jpg",
 "tags": [
  "kids",
  "family",
  "kids",
  "eat",
  "food",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117227-Reviews-Frontier_City-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "I always like going to this theme park. It has a western theme and fun rides. They have concerts there also throughout the summer and are open during the fall for October Fest and Halloween.",
  "My husband, daughter, son, and I went to Frontier City during Fright Fest and we had a blast! We went on a weekday and arrived just after they opened to avoid crowds. Many rides when we first arrived had no lines. We rode just about everything in the park, had the turkey legs for lunch and finished our trip watching the parade of ghouls. The park itself was a great experience but going during Fright Fest made it even more memorable!",
  "Great place to takes kids of all ages as they have attractions from kiddie stuff to the roller coaster for older ones.  Great gift shop to browse and find interesting things.  ",
  "Great time with family! Kids loved it.Just the right size park for fun. The kids rode everything they wanted. The park was clean and very festive. Everyone was very sweet and courteous. We will be back!",
  "I had a great time. THe park is woned and operate by The Six Flags company. POrices are about half of what they are at a Big Six Flags theme park. In my opinion, if you have to wrroy abouthow much is spent on what then you shouldn't be out here. It's normal 2019/20 amusemant park prioces for everything. ",
  "Since being purchased by Six Flags, the prices have absolutely sky rocketed and the cleanliness and care have plummeted. Literally felt as if I was taking my life in my hands attempting to use the restroom. Cost well over 100 dollars a piece for just 2 people to eat, enjoy the attractions (you have to pay for extras) and ride the rides. Used to be a great concert venue, but even the line up has diminished. Not thrilled with the change from visit 2 years ago to this year. ",
  "We took our grandsons for a day, hoping they would enjoy this park that my wife and I enjoyed as children.  Our grandsons loved Frontier City and didn't want to leave.  We bought season passes so we could take them as often as they want.",
  "The overall condition of the park was nice.  The roller coasters were small,  but looked to be in good repair.  $11 for a slice of pizza and a breadstick was a bit high,  but about average for food in an amusement park. The pizza was delicious btw. I'm happy we went.  They have packed a lot of fun in a small area. "
 ]
},{
 "name": "Martin Park Nature Center",
 "address": "5000 W Memorial Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/e6/83/e8/indian-blanket.jpg",
 "tags": [
  "free",
  "hike",
  "kids",
  "nature",
  "tour",
  "free",
  "kids",
  "cheap",
  "food",
  "free",
  "hike",
  "kids",
  "nature",
  "pets",
  "walk",
  "wander",
  "nature",
  "walk",
  "walk",
  "sightseeing",
  "free",
  "hike",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d589197-Reviews-Martin_Park_Nature_Center-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "First of all, it's free, which is always good. It's a great spot to get outside for a short easy hike. It's great for kids because it get's them out with nature, but the trails aren't excessively long. They also have a nature center with animals and activities",
  "The park is mostly a series of trails but also has a small center that you can tour. It is free to visit. Don't forget to bring some dog food to feed the fish. They love it and the fish are huge! I don't think this would be a great place for someone in a wheel chair but if your looking for a cheap outing with the kids. You can take a picnic. ",
  "First of all, it's free, which is always good. It's a great spot to get outside for a short easy hike. It's great for kids because it get's them out with nature, but the trails aren't excessively long. They also have a nature center with animals and activities",
  "came here thinking we could go for a nice walk with my fur baby, not happening, no pets allowed here.",
  "It is a very tranquil place. Even when it is crowded, it feels peaceful. The hikes are nice and good for all ages. The playground is very cute!",
  "A pretty place for a walk with lots of level trails. I do wish they were a bit better signed. You are not going to wander off a trail but you don't always know which one you are on. A couple of signs that say \"this way back to nature center: would be helpful ",
  "OH MY GOODNESS!!! This has been the highlight of our sightseeing! We spent HOURS here this morning hiking all of the trials and taking in all of the wildlife. We even saw a DEER! A beautiful doe by the water eating the foliage! We couldn’t believe it. Waking to the creek and seeing the small falls was beautiful and serene. LOTS of shade on these trails makes it nice to stay out of the sun. Even though this park is so close highway, once you start hiking your way in you would never know. Quiet and reflective. We had an amazing time here and if we are ever back in OKC this will be on the top of our list. A truly beautiful day, even in the June heat. Highly recommend! This is an easy park to walk through. No need to be an avid hiker or anything like that. I am not a fit person and I was able to walk the three miles of trails no problem. This is a MUST SEE!!",
  "This is a great free park with walking trails and a great play ground.  Get out there with your kids or just for a nice, quick hike."
 ]
},{
 "name": "Paseo Arts District",
 "address": "2909 Paseo",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/42/9c/ea/this-is-the-view-of-paseo.jpg",
 "tags": [
  "art",
  "art",
  "art",
  "food",
  "art",
  "art",
  "art",
  "walk",
  "tour",
  "eat",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d4713946-Reviews-Paseo_Arts_District-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love the fact that, within just a few blocks (with lots of street art, parking, and easy exploring on foot), you can visit so many distinct galleries, interesting shops, and enticing restaurants!",
  "Bought the most comfortable and classy silver ring and ear ring set from Sharon Johnston Jeweler from Dallas TX at the festival.  Round stones can be switched out to match other jewlery/clothing.  I add to my collection of jewlery at the festival every year, always amazing pieces.  Then cool off in the Shakespear in the Park building where the Mid-Del Art Guild has 27 artists work on display.  MDAG is a fine organization which meets at Rose State College usually on first Mondays with demonstrations by very talented artists.  Very dedicated volunteers.  Art enriches all. ",
  "It's hard to believe the Paseo is still unknown to OKC visitors  this part of town is packed with culture with art, food, retail and entertainment. \nHighlights include: the Paseo Grill, Picasso's, Betsy King shoes! Check it out!",
  "I would come here in the mornings for donuts, the afternoon to buy art, the evening for dinner dates, and evenings for drinks with friends. Awesome place with a lot to do.",
  "I love the fact that, within just a few blocks (with lots of street art, parking, and easy exploring on foot), you can visit so many distinct galleries, interesting shops, and enticing restaurants!",
  "This is a great place to look around and see the different styles of buildings as well as the art that is on display, it really is good for all ages.",
  "Neat neighborhood with cute shops, galleries, and a few restaurants.  Nice place to walk around and see some sights.",
  "To see the Paseo Arts District at its best, go on a First Friday walking tour. These are the first Fridays of every month. All the shops are open and offering drinks, candy, etc. The artists are on hand to talk about their work. The restaurants will be totally crowded so you might want to eat before you go. "
 ]
},{
 "name": "Orr Family Farm",
 "address": "14400 S Western Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/4f/23/c6/photo0jpg.jpg",
 "tags": [
  "family",
  "field",
  "family",
  "kids",
  "family",
  "kids",
  "drink",
  "kids",
  "family",
  "family",
  "historic",
  "family",
  "kids",
  "walk",
  "wander",
  "drink",
  "food",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d3582452-Reviews-Orr_Family_Farm-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "My 3 year old daughter loves going out to the Orr Family Farm! She has a blast every time she comes out. Her favorite thing to do is ride the ponies and go down the giant slides. She is really into trains, so she has to ride the train at least twice! To the pumpkin patch and pumpkins, to the princess and super heroes to even the Easter bunny and Santa Claus.., There is so many events and activities for all ages to have a great time. I would HIGHLY recommend everyone coming out to The Orr Family Farm to really get  the experience for themselves.",
  "This place never gets old, no matter how many time that you go. Our first experience was during Halloween/thanksgiving, so we were spoiled with the pumpkin patch & zombie corn field with paint guns, but we have continued to return and almost every single visit, there is something new for the kids to enjoy. There is so much to do for the kids, to include a playground, pony rides, petting zoo, gem/fissile mining, train rides & zip lines. There is also many of manual rides and bounce areas, to include an oversized chess/checkers board and basketball/football & tetherball...I can go on and on about the activities for kids at this family fun farm. If you are in the area; please add this location to your stop. The cost of entry is minimal (ask for military) and fun never ends. Did I mention that they have a Ferris wheel and home made fudge? Woo",
  "The Orr family farm has plenty of stuff to do for the kids. There are enough to keep your kids occupied for hours and wear them out at the same time. We went during Halloween season, and was able to get a couple pumpkins after a short hay ride. The kids really enjoyed picking out their pumpkins. Give it a try! Bring your money though! ",
  "Taking my kid here for the annual pumpkin patch is a new must do. I grew up 1 1/2 miles from here and my uncle is practically their horse neighbor, but I had no idea they had built in so much fun! I am sooooo glad they are bouncing back from their devastating loss from the May 2013 tornado.\nThere is a petting zoo, bouncing/jumping thing, hay ride, pony ride, train ride, huge slide and multiple other play areas. Every child will find something that thrills them.\nThe concessions and break areas could be beefed up a bit. A few more snack choices and more than one or two spots to get a drink would be ideal.\nThe staff seems to have fun and engages with the children which is also great.\nI hope we can come back again for some other events.",
  "I usually go in the fall because it’s my favorite time of year. However, Orr offered a Groupon for four tickets at a great price for spring. I actually enjoyed driving the little tractor/tricycles around the track. The kids enjoyed bouncing, playing games and feeding the animals. There’s usually a little baby one running around. We ate at the place by the zip lines, and I’ll say they have the best French fries in town oddly enough. I ate way too many. The staff is friendly, and you can’t help but have a great day. Clean restrooms too. ",
  "This place is as neat as can be, and it's a great place to spend time with the family.  They have a lot of things to see and do, and you can even have events there.",
  "We take our grandchildren to the farm every fall and it's become one of their favorite places to visit. Even our oldest at age 15 likes going and our youngest at age 8 loves it! ",
  "We stayed overnight in their Conestoga wagons. From the time we pulled up in the cars and everyone squealed with excitement in seeing the giant pioneer style wagons to s’more making around the fire to sleeping in the cool air conditioned wagons, the whole experience was magical. Something our family will never forget.",
  "This was our first visit, but it is important to understand there are two sides to the Orr Family Farm now. Their core business and focus of fun is the farm itself - with plenty of options for kids of all ages! Their newest offering is an overnight experience, with \"glamping\" available in their conestoga wagons. We did both - so this is two reviews in one!\n\nOrr Family Farm: we arrived later afternoon on a gorgeous Saturday. It was more than evident by how the cars were parked that it had been a BUSY day. By the time we arrived there were cars parked all of the way down by the main street. However, enough people had left for the day that the spots closer to the gate were clear and the crowds had dwindled. While it may offer more energy at peak hours, it was nice not having crowds to deal with!\n\nThe farm is spacious and offers a ton of different activities - from train rides, to giant pillow bouncing, to zip lining, slides and a playground. Most items are covered in the price of admission, but there are a few activities (zip lining) that require additional $. And of course, concessions and gifts can cost you extra too! The staff is very friendly and happy to ensure your needs are met.\n\nConestoga Wagon Glamping: The newest addition to the Orr Family farm is a slew of historic conestoga wagons that are available for overnight camping/glamping. We reserved one of the luxury ones, with a king size bed and 2 bunk beds inside. It was $200 to rent for the night and check-in was 4 pm. While the Mrs. and kiddo were still playing at the farm, I went up and got us checked in for our wagon. \n\nThe wagons are super nice - and yes, come with heat and AC! There are also bathrooms located a short walk from the wagon. Each wagon gets their own private bathroom. In addition, there is a hospitality room with coffee/vending machines. Also - they have a 19' Michael Phelps Signature Swim Spa. Each luxury wagon gets 1 hour of private time in the swim spa - you schedule your time at check-in, thus it is sort of first come first serve. The swim spa was a fun experience and broke up the camping experience. \n\nAlso included in the wagon rental is stuff to make s'mores. The Orr staff comes around 6 pm and gets the camp fire going. From there you are on your own to grill as you desire. Some of the camp brought dinner from nearby restaurants and others did grill. We brought our own hotdog stuff and used the common fire to grill those and our s'mores. Each wagon does also have a charcoal grill if you opt to do a more serious grill session.\n\nThe farm itself was fun - but glamping in the historic, or should I say hipstoric, wagons really brought it all together! One \"secret\" benefit of the wagons also is that they leave the back gate of the farm open. Thus, after the farm closes to the public, we still had access to all \"un-manned\" activities Saturday evening and Sunday morning. Our toddler LOVED having the entire farm to himself Sunday morning when we hit the playground!\n\nI would highly recommend a visit to the farm, and even more so would encourage you to do something different and camp/glamp in the wagons for the night. At the site we were, there were 5 luxury wagons - what would be real fun is to get a group and rent all 5 for the night and have your own private camp site!",
  "Oh my gosh! The wagons were so much fun! I would absolutely recommend them. We stayed in the six person wagon which has a king sized bed and two sets of bunk beds it has a mini fridge and microwave and that’s it. There are four hooks to hang your things on so you do have to be efficient on space but it’s glamping! We enjoyed the fire ring. They keep the fire going and provide you with s’mores kits for your party. You can pay extra for a hot dog dinner but we didn’t. You can bring your own food or drive three minutes and you’re at a ton of restaurants. We met so many nice people! \n\nWhen we stayed it was in the sixties and then fifties overnight. The king bed has a heated blanket and the bunk beds are warmed by and over the door heater. We were more comfortable than I thought we would be. \n\nI didn’t know it until the next day but there are a ton of outlets which mattered a lot to our young boys lol \nEach wagon gets to book a one hour session in the monster hot tub/pool. \nEach wagon also has its own bathroom just a short walk away. It has a shower, toilet and sink with towels/soap/shampoo. There is a small hospitality room with a coin operated washer and dryer, food vending machine, drink vending machine and complimentary coffee and hot chocolate. \n\nThere is one small downside and that is that you’re on the edge of a town so there is some road noise. I’m a light sleeper so next time I might bring a noise machine or fan. \n\nLastly the farm is open from 10-5. Wagon check in is at 4. You are allowed to wander the farm until 7 and do tons of activities. This doesn’t include the manned activities like petting zoo, zoo line, panning for gold, train or snack bar/shop. So if you want to do those things you should come earlier. \n\nI would absolutely recommend spending a night in the wagons!",
  "I usually go in the fall because it’s my favorite time of year. However, Orr offered a Groupon for four tickets at a great price for spring. I actually enjoyed driving the little tractor/tricycles around the track. The kids enjoyed bouncing, playing games and feeding the animals. There’s usually a little baby one running around. We ate at the place by the zip lines, and I’ll say they have the best French fries in town oddly enough. I ate way too many. The staff is friendly, and you can’t help but have a great day. Clean restrooms too. "
 ]
},{
 "name": "State Capitol",
 "address": "2300 N Lincoln Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/df/1b/8f/state-capitol.jpg",
 "tags": [
  "tour",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d589215-Reviews-State_Capitol-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "I walked through here while it was under construction but still enjoyed seeing it. Optimistic about the results of the renovation!",
  "Would hope that the renovations will be completed by the time that others visit. People were friendly and there was a pleasant gift shop.",
  "We took the capitol tour and while the guide was really good the tour was a little short due to the massive renovation taking place inside. it was really interesting to see the construction process that was all around us.\nI appreciate that they were offering the tour despite the conditions.\nThe outside is still pretty unblemished, so we got to see the sculptures and architecture.\nThe oil derrick outside is fitting for an OK capitol, as is the Meeting Place which has all the flags of the many Native Nation members that live in Oklahoma.",
  "Currently the State Capitol building in Oklahoma city is worth a brief viewing, will try again once the renovations are complete and maybe a tour.",
  "This place is worth a visit, even there is lots of construction going on. Very friendly staff at the visitor center. They let us have a short tour just for the two of us. Will come back when remodeling is finished."
 ]
},{
 "name": "Oklahoma Railway Museum",
 "address": "3400 NE Grand Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/ea/56/66/20181227-112356-largejpg.jpg",
 "tags": [
  "free",
  "kids",
  "family",
  "kids",
  "kids",
  "wander",
  "kids",
  "free",
  "free",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d3314220-Reviews-Oklahoma_Railway_Museum-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "A great place for train lovers. You can get on and go through every car and caboose. Kids will love it and it's free!",
  "This year was my family's 4th year to enjoy the Christmas train ride. It's a nice 40 min ride and we enjoy singing carols and the kids love getting to visit with Santa on the train. \nThere's also an opportunity to take your own photos with Santa after the train ride. \nOnce the ride is over we head to the large indoor facility for hot chocolate and cookies. \nIt's been a wonderful start to our holiday family celebrations.",
  "I have gone here to ride the train, the Christmas train, and Thomas the Tank Engine with my kids.  I don't know who had more fun, them or me.",
  "having grown up on the northern end of the Metro railroad coming out of New York City, seeing trains go by was a daily part of life and I have always been drawn to historical train exhibits or museums whenever I can find them. This one is a smaller installation, obviously a work of love by a handful of dedicated volunteers. There is no admission fee, but you can drop a few dollars in the slot to help them keep this place open. Like many other train museums, you can actually get into and walkthrough several of the cars on display. What I haven't seen at other installations was the two or three cabooses that you could actually get up into and see what those were like. All of the engines are roped off, which is not surprising, considering the high probability of tripping or cutting yourself on a piece of equipment. One car has been retrofitted with a large model train layout where there's at least one or two cars running around for you to enjoy just like your childhood. It shouldn't take more than an hour to wander through all the cars and small exhibits, and this should be one that your kids (at least the little boys) should enjoy. Recommended",
  "I liked it but most of the train cars were locked so couldn’t go in them but I’ll probably go back when the weather warms hope so hopefully they’ll be open then. \n\nGreat collection of trains & looks like they have train cars you can rent for Birthday Parties & special events so that’s pretty neat if you know a train enthusiast. Admission to the museum was free but looks like they have events at other times that have ticket prices attached to them. I’ll try again later  in the year when you can ride one of their trains. Still a fun place to check out on an afternoon 👍🏻🚂 ",
  "This was way overpriced and there was very little to show for it. They had \"miniature golf\", that was portable fold out golf boxes laid out on the ground. Once you made the thirty min train ride through the ghetto housing of NE OKC there wasnt much else to do. There was a train that had a video of Thomas the Train playing. There was another train car that had a model train car running through it. That was nice to see. There was a canopy section that table top toys, a barn with gift store items, there was an area to to take pictures with a background scenery but there was nobody around taking pictures. I paid extra to have pictures of the event. We had our picture taken ONE time on the train by a photographer. $25.99 to have a record of this memorable event but saw a photographer once and that was on the train. The tickets to ride Thomas were $18.99, for that thirty min ride through the ghetto housing of NE OKC. Extremely disappointed. We ended up leaving and going elsewhere. It was boring. I did enjoy experiencing the historical natural of the 1929 train, other than that there wasn't much. It really was not worth the price. The event itself is free but the $18.99 is to ride Thomas The Train. I want my $25.99 digital photos refunded.",
  "While on a business trip to Oklahoma myself and a co-worker had some spare time and wanted to see something interesting. We found the museum, and thought we give it a shot! \n\nSo glad we did! When arrived, the museum admin greeted us at the entrance. She told us about the history of the place, the trains and what there is to see. The lady was so passionate about the museum, which is great! \n\nWe had a look around all the train carriages. It was a Thursday so no trains were running, but that was OK with me! The whole museum was very well layed out. There's a lot of cool equipment around to see. The restored station house from Oakwood, Oklahoma is in brilliant condition and houses the museum shop. \n\nSome of the trains and coaches are open, some are closed. It's a really nice place to visit, and something there for every generation. If I'd live a bit closer I'd volunteer! \n\nSome of the not-so-good reviews on here seem very unfair....I mean how can it be anyones fault if old trains break down! I didn't find it disappointing at all, would go again and recommend to everyone!  \n\nSet aside a couple of hours if the trains are not running. \n\n:-)",
  "The volunteers were very knowledgeable and friendly.  The engines, cars, and cabooses are interesting, especially for train  buffs.  The train ride was fun.  Our engine ran into  trouble, and volunteers quickly put another engine on to finish the ride.  Model train display and museum car are interesting.  Good displays in the old depot,  The lady in the gift shop was friendly and helpful."
 ]
},{
 "name": "National Stockyard Exchange",
 "address": "2221 Exchange Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d2/1c/f3/stockyard-city.jpg",
 "tags": [
  "walk",
  "walk",
  "structure",
  "kids",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d589200-Reviews-National_Stockyard_Exchange-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "The main attraction here is the cattle auction, not the shopping. There are a few stores--Langston's which specializes in Western clothing being the main one. There's also a saddle shop and a souvenir shop, and a shop selling bath soaps. But not much else. And Cattleman's Steakhouse is a must for lunch or dinner.\n\nBecause it's a business and not a tourist attraction per se, there isn't\nTo a lot of guidance on what to do. But everyone I encountered was really friendly and happy to answer questions. So here's what you need to need to know to see the cattle auction.\nFirst, wear closed-toe shoes you dont mind getting a bit dirty. There's a lot of cow droppings around.\nThe auctions take place on Monday and Tuesday morning. I believe they start at 8 a.m. If it's the right time. You'll find parking between the building and the stockyards, and the smell will hit you the moment you step out of the car. You'll hear mooing. Walk toward it. To the right of the covered area are the pens, and you'll notice a walkway above the pens. To stars to access it will be to the right (you'll be able to see where it ends). Go up on the walk way and take some time to watch. You'll see the cowboys moving the cattle to the auction from their pens, either on foot or on horseback. \nWhen you've seen enough, follow the walkway until you can turn right to a building. Here you can observe where they herd the cows inside to be weighed. At the end of the walkway is a door that leads directly into the auction. Be careful not to raise your hand or you might buy yourself a herd of cows :) (one local advised, just don't give anyone your credit card).\nThe auctioneer will be calling out a lot of numbers so fast I couldn't understand him. One of the bidders told me it was the price per pound, though it's written with the decimal tow digits to the right from what we're used to (so 149.00 is $1.49 per pound) which is also written on the screen. You can watch groups of cows come in to be bid on.\n\nThat's pretty much all there is to it. I'd allow about an hour to experience the auction. Oklahomans are the friendliest people I've ever encountered, so don't be shy about asking people questions when you're outside. (I wouldn't talk inside the auction, as they're focused on doing business, though even there people were really nice.)",
  "The main attraction here is the cattle auction, not the shopping. There are a few stores--Langston's which specializes in Western clothing being the main one. There's also a saddle shop and a souvenir shop, and a shop selling bath soaps. But not much else. And Cattleman's Steakhouse is a must for lunch or dinner.\n\nBecause it's a business and not a tourist attraction per se, there isn't\nTo a lot of guidance on what to do. But everyone I encountered was really friendly and happy to answer questions. So here's what you need to need to know to see the cattle auction.\nFirst, wear closed-toe shoes you dont mind getting a bit dirty. There's a lot of cow droppings around.\nThe auctions take place on Monday and Tuesday morning. I believe they start at 8 a.m. If it's the right time. You'll find parking between the building and the stockyards, and the smell will hit you the moment you step out of the car. You'll hear mooing. Walk toward it. To the right of the covered area are the pens, and you'll notice a walkway above the pens. To stars to access it will be to the right (you'll be able to see where it ends). Go up on the walk way and take some time to watch. You'll see the cowboys moving the cattle to the auction from their pens, either on foot or on horseback. \nWhen you've seen enough, follow the walkway until you can turn right to a building. Here you can observe where they herd the cows inside to be weighed. At the end of the walkway is a door that leads directly into the auction. Be careful not to raise your hand or you might buy yourself a herd of cows :) (one local advised, just don't give anyone your credit card).\nThe auctioneer will be calling out a lot of numbers so fast I couldn't understand him. One of the bidders told me it was the price per pound, though it's written with the decimal tow digits to the right from what we're used to (so 149.00 is $1.49 per pound) which is also written on the screen. You can watch groups of cows come in to be bid on.\n\nThat's pretty much all there is to it. I'd allow about an hour to experience the auction. Oklahomans are the friendliest people I've ever encountered, so don't be shy about asking people questions when you're outside. (I wouldn't talk inside the auction, as they're focused on doing business, though even there people were really nice.)",
  "The Stockyard Exchange Building is on Exchange, west of Agnew past the National Stockyards sign, several blocks. That is what this term Stockyard Exchange refers to and not to the commercial shopping district, normally just referred to as the Stockyards. \nThe Exchange has offices relating to cattle trading and dates back to the 1980's. It replaces an earlier structure which burned to the ground in the '70s. \nThere is a nice little restaurant there that offers good inexpensive meals. A popular place for stockmen, local workers, and visitors alike who find the Exchange Building. \nCattlemen's restaurant, is a so so place as Oklahoma City steakhouses go. If you do feel the need to go there, ask to sit at the counter, you'll get faster service, and less of a wait, unless, that is, you enjoy a line out the door. The Chicken Fried Steak is good, get the salad and the house dressing. We go there a few times a year. Just to treat the kids for breakfast or a special dinner.  When I worked in the stockyards years ago, it was pretty common to go in there covered in manure from working cattle all day.",
  "My wife and I visited the OKC National Stockyard on a non-sale day in January 2020. It was very quiet and we were able to walk around unfettered.\n\nWe can only image how this place would be on a sale day, Wednesday a reported “up to 9000” animals are bought and sold.\n\nWe recommend you climb the stairs to the elevated platform (you’ll see it) and walk across all the pens. This is an interesting part of the city and well worth your visit.",
  "One of the few places that has a great selection of everything western.   They staged  a Western  \"shoot out\" in the street while we were there and had a parade. ",
  "We entered the auction arena and were greeted by the auctioneer.  Several of the bidders spoke to us.  It was amazing how fast cattle moved through.We met the auctioneer after his 1 hour shift. ",
  "We went on a Friday when there was no sale. The area looks like its the old part of OKC. They have kept the street stores and things looking old and historical. The stockyards were fun for my husband to see.",
  "One of the oldest stockyards - runs around 9000 head of cattle in a sale.  Very historical - you can walk the catwalk and get a view from higher up. Still has red brick walkways. You could almost hear the cattle and the cowboys from the 1800s. Nice to get a glimpse of the past. "
 ]
},{
 "name": "Devon Energy Center",
 "address": "333 W Sheridan Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/3e/fd/ff/building-from-the-meriad.jpg",
 "tags": [
  "walk",
  "walk",
  "walk",
  "drink",
  "unique",
  "structure",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d10457876-Reviews-Devon_Energy_Center-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's tallest building in the city, with nite design and great view.\nThere is a restaurant on the top floor, so you can enjoy the view of Oklahoma City.\nI was hoping to reach the observation deck, but I was told there is nothing like that. Later, on the website, I've found out that tours in this building are available only on Thursdays and you have to make reservation on their website. Walk ins are not allowed. That's the only bad things about Devon Energy Center. The observation deck should be available for tourists every day. \nThere is another option if you want to enjoy the view. You can go to the restaurant and pick the table by the window.\n\nRomanP",
  "This building is spectacular from the outside... but wait til you get in! Just take a great big breath before you walk into the atrium... don't accidentally sit on the fountain.",
  "It's tallest building in the city, with nite design and great view.\nThere is a restaurant on the top floor, so you can enjoy the view of Oklahoma City.\nI was hoping to reach the observation deck, but I was told there is nothing like that. Later, on the website, I've found out that tours in this building are available only on Thursdays and you have to make reservation on their website. Walk ins are not allowed. That's the only bad things about Devon Energy Center. The observation deck should be available for tourists every day. \nThere is another option if you want to enjoy the view. You can go to the restaurant and pick the table by the window.\n\nRomanP",
  "The staff at the top were very nice however if you are expecting to go up to the top and see the sunset you are out of luck. First unless you are either going for a meal or invited to an event or just a drink there is no observation area. The top of the tower is configured in such a way that the kitchen is on the west side of the building so you will not get to see the sunset unless you are at an event one floor up. Apparently the windows go all around up there. As for the rest if there are people dining you won’t get to see much of anything. Go there early during the week and you should get to see a view of part of the city. Hi",
  "It is such a beautiful view of Oklahoma City from the tower, in the daytime you can really see for miles around and it gives a different perspective of the city, a must do!",
  "This magnificent glass and steel tower is an 850-foot high, 50-storied corporate skyscraper in the downtown area. It ties in height with the Park Tower in Chicago and is the 57th tallest building in the United States. Construction for this striking building started on October 6, 2009 and everything was completed in October 2012 at an estimated cost of 800 million dollars.\n\nIt is the focal point and a symbol of the resurgence of Oklahoma City. You can see it from almost anywhere in the city. It contributes greatly to make the downtown look like an ultra-modern metropolis. One newspaper article states that “Oklahoma City is on the rise, and Devon Energy Tower is helping the city reach new heights – literally”. That statement rings absolutely true when you stand there looking at that tower.\n\nThere are many boarded-up broken windows noticeable on one side. This was due to an unfortunate incident that occurred with the lift of some window-washers swinging out of control in May 2019. Fortunately the crew was safe, but it created lots of scare at the time.\n\nThe architectural design has won several awards. The Lobby is marvelously modern and jaw-dropping. We were informed that the unique three-sided structure is a sustainable one during hurricane season. The amazing lighting at night makes it stand out like a beacon no matter where you are in the city.\n\nThere is a very nice restaurant called “Vast” on the 49th floor with incredible views of the surrounds. We were fortunate to have had the chance to lunch there.\n\nWe photographed this stunning building throughout the day in different lighting conditions, and every single time our pictures came out great. Amazing!",
  "There is a wonderful restaurant on the top floor with out standing food. The view is fabulous day and night. ",
  "This building is spectacular from the outside... but wait til you get in! Just take a great big breath before you walk into the atrium... don't accidentally sit on the fountain."
 ]
},{
 "name": "White Water Bay",
 "address": "3908 W Reno Ave",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/db/0f/bb/water-slides.jpg",
 "tags": [
  "parks",
  "kids",
  "free",
  "family",
  "eat",
  "kids",
  "free",
  "family",
  "eat",
  "kids",
  "family",
  "food",
  "food",
  "family",
  "food",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d117228-Reviews-White_Water_Bay-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "My son and I went on a Tuesday.  It was a little busy but the lines moved fast.  Nice place for Oklahoma!  I didn't think it would be all that.  We had a lot of fun!",
  "Earlier this month as we were traveling across country with out \"tween\" grandchildren (ages 10 -13), we stopped at White Water Bay water park to give our grandkids the opportunity to expel some coupled up energy that comes with a cross-country trip in an RV.  Well, we hit the nail on the head with white Water Bay.  Our grandkids are from the Atlanta area and so, no stranger to water parks, but they all agreed that White Water Bay is now their favorite.  They had a ball!  We were able to get discounted tickets from the RV park we were staying in and happened to hit White Water Bay on a night they were open until 9 pm, giving the kids 3 full hours of enjoyment for a reasonable charge.  It gets an A+ in our book!",
  "I would give 5 stars, but they seriously need to remove all the carpeting.  It reeks of fungus and mold!!  Get here early if you need a chair in the shade.  There are enough activities from babies to grandparents to make them all happy.  Special thanks to all the lifeguards.  They work hard at keeping this very busy waterpark safe for everyone.  You can rent lockers, bring coolers to eat lunch in the picnic areas, clean bathrooms, rent tubes, bring your own tubes and they will blow them up for free.  My teens love movie night on Fridays (dates will be announced). You must wear a life jacket or stay on a raft while in the wave pool during the movie.  First aide is very good.  Last year one of our kids hurt themselves on a ride, and one of the lifeguards was a paramedic who did a great job.  I requested management to shut down the ride until an investigation was completed for safety.  They were wonderful at complying. Come to find out, our grandson had hit his face while going down a water ride.  Face injuries are always bloody.  What could have been done better (which was addressed), any lifeguard or adult should have ensured he was escorted to first aide.  Where was I.....my chair was right next to the first aide station.  Our family meeting point.  The staff here are wonderful considering how many people they deal with.",
  "I would give 5 stars, but they seriously need to remove all the carpeting.  It reeks of fungus and mold!!  Get here early if you need a chair in the shade.  There are enough activities from babies to grandparents to make them all happy.  Special thanks to all the lifeguards.  They work hard at keeping this very busy waterpark safe for everyone.  You can rent lockers, bring coolers to eat lunch in the picnic areas, clean bathrooms, rent tubes, bring your own tubes and they will blow them up for free.  My teens love movie night on Fridays (dates will be announced). You must wear a life jacket or stay on a raft while in the wave pool during the movie.  First aide is very good.  Last year one of our kids hurt themselves on a ride, and one of the lifeguards was a paramedic who did a great job.  I requested management to shut down the ride until an investigation was completed for safety.  They were wonderful at complying. Come to find out, our grandson had hit his face while going down a water ride.  Face injuries are always bloody.  What could have been done better (which was addressed), any lifeguard or adult should have ensured he was escorted to first aide.  Where was I.....my chair was right next to the first aide station.  Our family meeting point.  The staff here are wonderful considering how many people they deal with.",
  "This is the place to be in the summer with young children or teens. Lots of events even movie night. When temps hit 115 this is a great place to let tempers chill and children run. Get the yearly pass for best value for a family",
  "The fact that White Water has been in OKC since 1981 is part of the problem.  The park \"rides\" are pretty dirty and I didn't see any sign of cleaning activities in the six hours we were there.  Not being able to bring in food is understandable, but prices on admission have only gone up and food prices are exhorbitant.  We were there on a middle of the week trip, but the crowds were huge.  Nearing the end of summer, so everyone must have been taking advantage of their season passes!  Safari Joe's in Tulsa is much cleaner, smaller (but with all the same attractions) and the crowds are much smaller.",
  "We attended on a weekday so was not as crowded. We rented a cabana and that gave us a designated seating area in the shade. Pricey for 6 people was about 500 with Cabana rental but that included food, tubes, and a locker.",
  "We got our season passes in December as usual\n\n*Water pressure was way too strong on slides\n*No bring a friend \n*Dirty, over all: bathrooms, tables, lazy river and food lines\n*service for food service was terrible \n*General decline of park\n*unsupervised rude children\n*unattentive life guards(were told of a stuck tube in the yellow slide). Response was , we know, but didn't close the slide!!\n* Unfortunately, I can't recommend this park. No more 6flags water park passes for this family \n",
  "We took are son to the water park before school started for after school had started in the city and all I can say is I had not been there in several years but we will not be back. Way to expensive and the meal plan was a complete joke. And had to wait forever for everything and were out of 95% of stuff for the snacks. Are some was not very happy either but there were some other kids that had not supervion and just running wild and were mean.",
  "Kids had fun. All adults did too. The place has gotten way to expensive since six flags has bought it. I think it’s a bit ridiculous... but still a lot of fun."
 ]
},{
 "name": "Civic Center Music Hall",
 "address": "201 N Walker Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/3a/d1/90/civic-center.jpg",
 "tags": [
  "walking",
  "performance",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g51560-d7385814-Reviews-Civic_Center_Music_Hall-Oklahoma_City_Oklahoma.html",
 "source": "TripAdvisor",
 "reviews": [
  "A wonderful renovation that has stood up well- a terrific place for performing arts. Easy close parking & lots of nearby restaurants within walking distance",
  "Visited to see Miss Saigon with my wife for her birthday.  Lobby and entry are are nice and interactions with various ushers was nice and pleasant.  Theater area was disappointing.  Seats are worn and scratched which give the appearance they are not into keeping it up.  Little touch up would make a world of difference. Enjoyed the show very much.",
  "Our daughter bought us tickets to this performance of the beloved Christmas classic and we had a great time. The hall is all decked out for the holidays and the atmosphere is great. You can purchase a nutcracker for your kid and also take photos by the giant Christmas tree.\n    Good performance by the city ballet company. Ms. Jung was the principal dancer last night, you go girl.\n    All the cast was fine.\n    We strongly recommend attending any performance in this hall if you are in town for the holidays, visiting loved ones, or whatever.\n     Enjoy!  And happy holidays.",
  "Food: 3/5\nService: 4/5\nCleanliness: 5/5\nDecor & Style: 5/5\n\nThis place is very nice. Love the decor and am very happy OKC has this venue! The whole place gives me a very classy feel and I love how people dress up (the one place people go where they can't go casual). I feel like i'm in the 50s!",
  "Have been attending OKC Philharmonic POPS performances for over 20 years.  This Venue has Great acoustics, and superior viewing for the outstanding performers at the POPS events."
 ]
}]
