[
{
 "name": "Nisqually National Wildlife Refuge",
 "address": "100 Brown Farm Rd NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/c4/7a/54/boardwalk.jpg",
 "tags": [
  "nature",
  "pets",
  "walk",
  "unique",
  "walk",
  "tour",
  "nature",
  "walk",
  "tour",
  "hike",
  "knowledgeable",
  "tour",
  "nature",
  "walk",
  "walking",
  "kids",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d209499-Reviews-Nisqually_National_Wildlife_Refuge-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a truly beautiful experience to walk out over the incoming or outgoing tide. You feel so embedded with the tidal experience by being able to walk out on a completely elevated walkway, very even, no elevation walk over the tide flats of the picturesque Nisqually Delta. Beginning at the beautiful nature center with displays and explanations of the workings of the salmon runs, you can walk out amongst the towering old dairy and hay barns to begin your adventure! Lots of birds and a nesting area for Gold Finch, our state bird. Often you will see Bald Eagles! We have never been disappointed on our many trips out to the end and back! The staff at the center are always friendly and helpful. Kid friendly but no pets allowed!",
  "The Nisqually National Wildlife Refuge is our favorite and an enduring, super experience! My wife and I love to visit and take walks along its unique mile-long boardwalk. Depending on the tides you can see a variety of fowl and other critters. But, whether high or low tides, it's going to be a winner for ya. They have even positioned porta-potties for us old guys! From American Bitterns to lovely Great Herons, Marsh Hawks and Bald Eagles, you'll remember the Nisqually Wildlife Refuge. What a gem!",
  "This place is absolutely stunning and a true hidden gem in the lower Puget Sound area. No dogs are allowed in order to protect the wildlife and keep the peace, but it sure makes for a wonderful walk and birdwatching. Some of the path is boardwalk through wetlands, while some is gravel, and remaining is bridged above the tidal flats. An easy walk and ok for strollers.",
  "You need to go early to catch the birds.....the guided tour is on Wednesdays at 8:00.  \nI have seen wonderful ducks and birds here, but the open expanse to Puget Sound is worth the walk.\nWear appropriate shoes and warm clothes, as there's always a stiff breeze.  Bring your own water and snacks as there is no cafe.  \nThis is a tranquil nature reserve; take a while to sit or stand and wait and watch for frogs, herons, wrens, eagles, waxwings and swallows to emerge.",
  "With the wet winter (wetter than normal) we have been having it's always a great hike out to Nisqually to cure cabin fever.  I make it out there at least once a week to view the ever changing complexion of the landscape as well as the wildlife.  I believe on Wednesdays they have a gifted birder that takes folks out (around 8am) to tour the refuge and spot birds.  Check with the Visitor Center on this but it's quite an informal tour and caters to all.  I enjoy timing my visits around the outgoing tides so that I can watch the myriad of birds grazing on the exposed mudflats.  If you are into raptors you may spot Harrier hawks, Peregrine falcons and/or the iconic Bald eagle.  The trail out to the end of the boardwalk is about 4 miles (round trip) and takes about 1-2 hours depending on your pace.  I would say the trails are kid friendly but............watch 'em on the boardwalk!  The visitor center is the best place to start your \"adventure\" here with friendly and knowledgeable volunteers.  The Center is open from I believe Wednesday thru Sunday but best check for times.  And, do check into their evening lecture series at the Center during the summer months.\n\nHappy Trails!",
  "You need to go early to catch the birds.....the guided tour is on Wednesdays at 8:00.  \nI have seen wonderful ducks and birds here, but the open expanse to Puget Sound is worth the walk.\nWear appropriate shoes and warm clothes, as there's always a stiff breeze.  Bring your own water and snacks as there is no cafe.  \nThis is a tranquil nature reserve; take a while to sit or stand and wait and watch for frogs, herons, wrens, eagles, waxwings and swallows to emerge.",
  "Great place to go on a nice day. Lots of things to see. Make sure you have you walking shoes on. This boardwalk goes all the way out into the sound . ",
  "It’s great during the mid week and winter , no crowds , lots of Wildlife .  Saw a baby eagle high up in a tree....",
  "Bring your kids, bring your cameras, and explore an estuary.  (It's a bit of a walk for the sedentary or children, but there's a bathroom at the entrance and another halfway along the 'long' loop.)  In spring and summer, look for the garter snakes and mushrooms!  In autumn and winter, watch for the berries, ducks and resident year-long herons.  I love to go here for the exercise and the sights.  The travel lodge has a good selection of research books, and parking is rarely difficult.",
  "Even in the winter, the walk through the woods and boardwalk were absolutely incredible. We saw many birds and even some seals. I hope to be back, definitely with binoculars and my good camera!",
  "The experience undoubtedly varies by season and high tide, vs. low.  We probably went at the worst combination and it was still enjoyable.  Saw a bald eagle swoop down and grab dinner."
 ]
},{
 "name": "Washington State Capitol",
 "address": "416 Sid Snyder Ave SW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/8f/f1/af/washington-state-capitol.jpg",
 "tags": [
  "walk",
  "tour",
  "tour",
  "free",
  "knowledgeable",
  "tour",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d2561191-Reviews-Washington_State_Capitol-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Went for the first time ever. It’s kind of cool. Go on the weekends walk around the gift shop is in the basement.",
  "Road trip!  Our 44th state capitol visited. The tour guide makes all the difference!  Ours was great. Visitor parking was close and plentiful because we got there early. Highly recommend this tour. \n",
  "The WA State Capitol provides free capitol tours.  The tour guides are knowledgeable and provide interesting and fun facts about the architecture of the building and historical events that have occurred there. Also, there is a great little gift shop that offers fun \"Olympia\" and state capitol items - great for birthday gifts for those who already have everything!",
  "You are already one of the owners of this building, so this is a good time to take the free tour and look around- even if the legislature is not in session, this is an opportunity to check in with the ways that archectucture supports and inspires democracy. If the legislature is in session, here is an opportunity to see how ideas become policy and policy lives in our lives for better or worse. Pro tip: Be sure to visit the bathrooms-wow!  ",
  "I am on a quest to visit all 50 state capitols and I have around 15 to go. So, I know what makes a great state capitol building for me. It is attractive and tells about its state. I always say that the capitol building is how a state presents itself to the rest of the country and to the world. While tours are great, the capitol shouldn't need one to tell its story. This one tells no story. The only full sculptures are copies of ones in the US Capitol. There is a bust of George Washington and his face (as part of the Seal of the State) is all over the place, even in doorknobs. Yes, the state is named for him, but he was never here. This building tells me nothing about the people of the state or the industries or the geography. There is no artwork telling any history or showing scenery. There is nothing about the state flower, bird, etc. You can see the flags of all the counties in the rotunda, but you can't get close enough to study them. The interior is beautiful with beautiful marble and great chandeliers. I left having learned nothing about Washington.\nThere is a gift shop with some local products, but, when I was there, the clerks were too busy talking to each other about one of them possibly getting a different job, to pay much attention until someone asked to pay for something.\nParking is available down the street at the Visitors Information Center. 2 hours cost $4."
 ]
},{
 "name": "Farmers Market",
 "address": "700 Capitol Way S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/43/eb/56/fresh-and-crisp.jpg",
 "tags": [
  "art",
  "food",
  "food",
  "learn",
  "family",
  "pets",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d2087042-Reviews-Farmers_Market-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Discovered the Olympia Farmers Market last Sunday, April 17th.  It is a purpose-built building with many openings for temporary stalls as well as, what appeared to be, more permanent vendors with refrigerated and glass display cases.  Just behind the open-air buildings were several permanent, take-out food vendors.  There is an open-air stage where a local jazz band was playing.\n\nThere were lots of vendors selling flowers, plants, fruit and vegetables, fish, fresh baked goods, honey, art work and crafts, etc.  We spent well-over 30 minutes there and had a great time.  There was ample parking.  Dogs are not permitted in the market area.\n\nIt is worth a stop if you're in Olympia on the weekend.",
  "We have been going there for years. There is generally ample parking and the market is covered. It is open Thurs to Sun most of the year. There are several bakeries represented for fresh artisan  breads and goodies. There are a number of organic farms with stands featuring a multitude of common and uncommon fruits and vegetables depending on the season. We subscribe to a \"farm share\" box from one of them. There are two large fruit and vegetable sellers. You will also find craftsman of many sorts. Meats, seafood, jams and berries as well as krauts are there. Bring your gardening problems and talk to a Master Gardener. There are a number of varied food service stalls, a little garden, and frequent musical groups playing.",
  "Not a large setting, but well worth repeats visits. Lots of parking though peak times may take a little searching. Partially covered.",
  "“I had an extremely informative session today detailing how Bitcoin works, how to purchase it and how to secure it.  Mr William came out for me simple strategies and important information to get me started so I can secure the best possible investment opportunity.  There is a lot to learn, however, The Mr William provides valuable information on their website, and many other avenues to help stay informed and up-to-date with this enormous opportunity. ”Thanks very much Mr William contact her email leewilliam664 @ gmail  .com or Whatsapp number +14086012169",
  "I love supporting local farmers, artisans, bakeries, seafood, butchers, and food vendors.  Plenty of Punic tables for eating, resting or enjoying local entertainment.  There is something there for everyone.  Bonus location by the waterfront and plenty of parking.  Family friendly.  Pets are not allowed in the vendor section.  A must visit.",
  "The farmers market has the best organic vegetable starts at good prices. I always get my spring garden started from the plants there.",
  "Great local produces to pick from. Different kind of stands that sells anything from vegetable, fruites to knick knacks.",
  "This Market is clean and friendly and it's One-Stop shopping. And it's open through the holidays for all your shopping needs"
 ]
},{
 "name": "Hands On Children's Museum",
 "address": "414 Jefferson St NE",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/2e/7c/ce/outside.jpg",
 "tags": [
  "practical",
  "kids",
  "creative",
  "wander",
  "kids",
  "art",
  "eat",
  "creative",
  "kids",
  "music",
  "structure",
  "creative",
  "kids",
  "kids",
  "practical",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d269824-Reviews-Hands_On_Children_s_Museum-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Location - in downtown Olympia and next to a lake.\nParking - there is a parking garage in the adjoining plot. People can also park on the street.\nActivities - a lot of activities for kids of all ages, based on practical science experiments -  tricycles, water color painting, clay modelling, small stage, water based activities.",
  "Two stories and an outdoor area chock full of fun activities for children (and their adults) . Creative and variety of things to do and experience.",
  "Of all the children's museums I've been to, this is by far the best. There are many well thought out areas to explore. Even within each area there are multi age activities. \nIt is spotless and well staffed. The outdoor area is larger than most places with water play, all levels of tricycles, sand and pebble play, a garden, live chickens to view, and an art installation that kids can wander through. Inside is a market, a restaurant, a vet office, construction area, garden / Apple \"picking\" area, art area with painting, drawing, gluing, puppet play etc. and a cute stage for aspiring performers. I can't even name it all. The details, staff and cleanliness were the most impressive parts ( these places are often germ factories). We will be back many times. ",
  "This museum grew from an idea a group of people had many years ago into an award winning place we all take our grandchildren (or children).  It can be very crowded on holidays, but if you find a parking spot, go for it.  I do wish the staff was better trained to explain why and how some of the exhibits work rather than to just pick up stuff dropped by exuberant children.  Otherwise, it's the perfect place to spend time with grands.",
  "This is a great option for olympia families. Watch out for weekend and holiday crowds....and bring some purell, it tends to breed germs,as most of these kid places do! It truely is a gem! The cafe also offers great heakthy options for families.\r\r",
  "There is much to see and do at this newish venue in downtown Olympia so plan to bring your lunch and spend most of the day if you are coming with children. Everything from a working town where you can be the shopkeeper or the shopgoer to trying on firefighter gear, building a tiny boat to float the rapids to staging a play is available here. There are great spaces to eat your lunch outside and in as well as an eatery and gift shop. There are often evening activities for grown ups. Percival Landing is just blocks away with more things to do.",
  "Incredible place --- creative, imaginative, stem learning.  You can spend hours there. Love the outside too,  a place for making mud pies, a creek to wade in, a lighthouse to climb. I also love the classes offered there for kids, music and toddler play.  Inside there is water play, cop cars, dress up stage, tree house ,etc.  Great for grandparents to bring their grandchildren. Well worth the membership!",
  "There is so much here for youngsters of any age to explore. Our granddaughter loved the water features, the  and the light wall at 18 months, revels in the kitchen/bakery/garden complex and the ship -- and more water features -- at 2 1/2, and has so much waiting for her on future visits. We love the combination of structure and freedom the place offers.",
  "We visited this awesome place with a 4 year old and 22 month old and a great time was had by all. Market place, creative arts room, construction “zone”, water tables, science area, make believe section with props for different occupations including a police car, and a hospital nursery. If needed, there is a “4 and under” escape room. There is also an outdoor play area which must be pretty awesome in the warmer months. Something for everyone at this hands on kids place.",
  "This museum is fabulous, beautiful, fun, a wealth of knowledge, wonderfully maintained and just a wonderful place for kids and those that love them! ",
  "Location - in downtown Olympia and next to a lake.\nParking - there is a parking garage in the adjoining plot. People can also park on the street.\nActivities - a lot of activities for kids of all ages, based on practical science experiments -  tricycles, water color painting, clay modelling, small stage, water based activities."
 ]
},{
 "name": "Priest Point Park",
 "address": "2600 East Bay Drive Northeast",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/5a/24/4d/in-the-middle-of-the.jpg",
 "tags": [
  "kids",
  "walk",
  "walking",
  "hike",
  "eat",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d598028-Reviews-Priest_Point_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "I really do love this park. Ive enjoyed a good run with my pup who loves to run across fallen trees. Peaceful enough for meditation. Perfect view of Downtown for Sunset. \nIf you bring kids, make sure to bring a change of clothing and rain boots wont hurt either. The tide pools are pretty muddy and you will want to walk through them.",
  "Beautiful city park with numerous walking paths, good birding (Pacific wrens), restrooms, covered picnic area, and a wonderful rose garden in bloom while we were there.",
  "Such an amazing place to walk and play. The grounds are so beautiful lots of places to walk. Take a hike on the trails they will lead you to beaches right on the bay. looking for that quiet place to eat a picnic lunch with your sweetheart, Or just some quiet time to reflect this is the place.",
  "Priest Point has many trails packed into a beautiful area.  Lots of steps and bridges.  A couple of trails lead to the inlet, which was still and glass-like on the day we visited.  Good for walking, trail-running and dog-walking.  Peaceful and not crowded on an autumn weekday.",
  "Lovely park with a nice beach, playground and hiking trails. Really loved the garden on the westside of the park especially during the summer months.",
  "Easy trails, quiet beautiful scenery. Has a playground, ample parking and picnic tables. Could not find a way to the beach through the trail or maps.",
  "Close to the center of town but a well planned and extensive park with nice trails from the beach to the forest.",
  "Many easy hiking trails. We enjoyed this area. We were lucky and were able to see an owl hanging out in the trees. There were several locals who recommended this area and it didn’t disappoint. "
 ]
},{
 "name": "Percival Landing",
 "address": "217 Thurston Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/1d/d8/ac/a-beautiful-winter-day.jpg",
 "tags": [
  "family",
  "walk",
  "eat",
  "art",
  "walking",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d2276958-Reviews-Percival_Landing-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our favorite place to go fo family photographs, any time.  It always as an ambiance of being somewhere special, because it is. \n",
  "This is a very pleasant walk especially when it's sunny with views of not only Puget Sound but the mountains as well. I enjoy the numerous shops and eateries on the edge of the Landing and a gem that I think non-locals miss out on is the Baytown Thriftway that's close by. There is also a playground available for the children located at Percival Landing.",
  "What a great place to view Olympia from.  From Percival Landing, if you look south you can see the state capital building and if you look to the north, the Olympic Mountains are usually in clear view.  Beside the view, there are plenty of place to shop and eat on the waterfront.  A perfect place to familiarize yourself with Olympia.",
  "You can’t stop in Olympia without taking a stroll at Percival Landing.  The City invested in updating the boardwalk for everyone to enjoy.  On clear days you get amazing views of the Olympics, State Capital and  the marina.  There are restrooms, restaurants, wine tasting, pubs and a children’s playground. And of yes there are beautiful displays of public art.  The Farmer’s Market is also within walking distance.  Depending on the time of year you visit there maybe outdoor festivals, concerts or celebrations taking place.  Regardless, it’s one of the best features of downtown Olympia.",
  "This is Olympia's grandest point. It connects the Capitol, the lake, the kid's fountain, Puget Sound and some nice local restaurants. Parking can be challenging but usually can be found somewhere along the line. If you just to the boardwalk, you only need a 1/2 hour. If you start at the Capitol and go as far as Anthony's Restaurant, you will need over an hour each way with the stops you will make along the way."
 ]
},{
 "name": "Tolmie State Park",
 "address": "77360 61st Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/7e/1f/33/a-fun-sand-bar.jpg",
 "tags": [
  "parks",
  "kids",
  "hike",
  "walk",
  "hike",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d7786950-Reviews-Tolmie_State_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "We love going here.  It is \"closed\" on Monday and Tuesday, but you can still get in and get to the beach.  Nice views and a lot of wildlife.",
  "We went here on a rainy day, I am sure when it is nice out it is even more gorgeous. It is a really pretty place, parking is not really abundant, so I am sure if it is busy it would be a problem. It costs to visit I believe it is 10.00, but well worth it. There is quite a bit of wildlife in the area, views are very pretty. The restrooms are clean as is the beach area. Worth a visit if in the area, but not to go out of the way to find, there are a lot of better parks in the surrounding area to visit for the day.",
  "First of all, this park requires either a WA State Discover Pass or a day pass for $10 cash. \n\nThere are a few short hiking trails which are great for kids or dogs. The beach area is great if you want to find sand dollars. We've also seen a lot of little crabs, a few jellyfish, and other animals. \nA lot of the beach area is rocky, but there is enough sand in areas if you want to build a sand castle. \nThe views are pretty. \n\nThere are bathrooms and picnic tables on the property.\n\nThere are 2 parking lots; one upper and one lower. The lower lot is usually full on weekends. \n",
  "The park is separated into three major parts, the upper area, lower beach and lower trails. The upper area is mostly for parking. There is a short trail to the lower area’s beach, or you can walk down the steep hill to the lower parking lot. \n\nThe beach is mostly rock, until you get past the mid-tide line. Then you have a mixture of mud and sand. This area is great for turning over rocks and finding crabs. There is also a trail leading to a sandy beach, or you can wade over to the sandy beach during a low tide. \n\nThe main trail is well maintained. It is about a 30-40 minute hike through the thick forest. The shortcut that cuts the trail in half is not available, as a large tree fell and knocked out a bridge. ",
  "Our NHS took a trip to Tomie. Baby crabs (or just little ones) were a memory from when they were in primary school. We walked right out onto the beach and there were crabs everywhere! Very fun. \n\nWe also went on the 2 cedars trail. Easy trail. Tells you it takes an hour, we made it in 40 minutes.\n\nIt was a beautiful day at the park. \n\n*Discovery Pass required.*\n",
  "Although i live within 20 minutes i rarely venture out to Tolmie. I went mid week during the school year and i saw one other person (with a dog on a leash - THANK YOU!!!).  i felt taken to a far away place of seclusion and safety. My hike included ups and downs in the trail amid the massive forest growth, awesome recharge without driving for hours =>",
  "Great place to bring the kids. We saw crabs, found oysters, saw bald eagles, and just enjoyed the beautiful scenery.",
  "The tide was out so we could walk out into the water and see thousands of sand dollars and little crabs and lots of little sea creatures!!  Beautiful scenery. Requires a Discovery Pass.  "
 ]
},{
 "name": "Monarch Sculpture Park",
 "address": "8431 Waldrick Rd SE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/91/41/f9/fun-wheels.jpg",
 "tags": [
  "free",
  "walk",
  "walk",
  "wander",
  "creative",
  "art",
  "art",
  "hike",
  "walking",
  "unique",
  "free",
  "walk",
  "art",
  "nature",
  "family",
  "field",
  "kids",
  "art",
  "walking",
  "kids",
  "history",
  "family",
  "kids",
  "art",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d1451769-Reviews-Monarch_Sculpture_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "I just love this quirky sculpture park and I would have loved to have visited with children because many of the sculptures are musical ... bells being predominant... and you are encouraged to ring them.   What child (or adult!) could resist!  The one I liked best was a series of pipes which were 'played' by an old flipflop sandal!  \n\nAlthough here are many weird/quirky (even disturbing) sculptures, the park itself is very peaceful (at least it was when we visited) and even spiritual (The Sacred Grove).  There is walk in /bike in access from the Chehalis Western Trail.\n\nIt is amazing that this park is free entry (donations welcomed) and the sculptures are donated by their artists.  I will return.",
  "This is an off the beaten path, quirky, amazing sculpture garden. I was thrilled with all the different sculptures around all the corners and hidden in the grass, in the woods and around the pond. I loved playing with the gongs and musical creations. My husband couldn't do the walk and called me as I was happily scampering around hitting all the gongs. He was wondering what all the bonging sounds were that were eminating from the woods. I love the giant hand with pick up sticks, the yellow butterfly, the glass works and the lovely green ladies by the pond. I would love to express a huge thank you to the artists and curator for this delightful walk in the woods. .",
  "Although it was a cold 32º out, it was a joy to wander around and experience a wide variety of art. Some outstanding, some OK and some in poor condition. But most very creative. With heavy frost on the ground it was a \"out of world\" spooky experience.\nDespite the entry sign, we were not sure we were in the right place. Especially since there was hardly anywhere to park.",
  "Thank goodness for our Garmin GPS.  My wife and I set out with Mapquest and handwritten directions, but we went astray in Tenino.  We stopped in a church parking lot and programmed our Garmin.  It led us back to Tenino and turned onto the old Hwy 99 heading north.  A right turn onto Offut Lake Rd, and a right turn onto Waldrick Rd and then to the 8431 address.  The large Park sign is on the left side of the road, but the entry is on the right side.\nWe began to \"ooh and aaaah\" immediately upon parking.  Most of the sculptures are located in the lower section of the park.  Be sure to wear good walking shoes as the paths are a bit rustic.  If you enjoy art, you will enjoy.  If you enjoy whimsical, you will enjoy.  Even if you don't care about art, the natural surroundings abound.  There are a couple of picnic tables, but one sits out in the sun, and the other is in a wonderful wooded area with a creek running nearby.  Unfortunately, this table needs some clean up.  We did find a nice covered pavillion with bleachers to have our lunch.  It is located near the park entrance, but it requires a short hike down the hillside.  This is not an area for those who are wheelchair bound or unable negotiate a twisty trail down and back up.\nI won't describe what we found, but will allow you to explore and discover all of the fun and wonderful things we were able to see and touch.  Be sure to take your children and grandchildren.  They will love this place.  Enjoy!",
  "A committed group of artists are bringing this unique park back to life.  It is off the beaten track bit so get directions first. it is worth a stop.",
  "Located about 15 miles from Olympia, this fanciful garden is filled with a wide variety of sculptures encompassing a broad range of artistic genres.  The size and scope of the garden is not apparent upon arrival.  As you walk down the hill to the field below you pass a number of intriguing art displays -- some situated by theme and others placed for accidental discovery.  There is an Asian themed area, a sound garden (kids and playful adults will love this area), a birdhouse display, famous artist inspired areas, water features, and a tree/shrub labyrinth that is currently being refurbished.  The art work provides a great stimulus for conversation so it is a perfect spot for a date; a family outing; or a picnic with friends.  There are lots of things to touch and to ring so kids will thoroughly enjoy it.  The terrain is uneven and a bit steep in areas so it can be a challenge for those with mobility concerns.  Plant enthusiasts will enjoy the eclectic  plant life.  A great effort is being made to maintain and improve the garden (which is supported by volunteer work and donations), however, it is far from manicured.  The \"wild\" nature of parts of the garden actually lend to its quaintness and provide some great hiding spots for some pieces of art.  Entry is free, but there is a donation box where you can leave a donation if you choose.  This garden is a great experience to share with family and friends.",
  "We viewed pieces that were whimsical, thought provoking, and sometimes interactive. Worth the trip and diversion off I5.",
  "Going to the monarch sculpture park felt like walking into a secret garden of art. You can tell that a lot of love and effort has been put into maintaining the beautiful space. Some of the sculptures have been affected by the weather conditions over the years, but it somehow just adds to the beauty of the place. We ran into one of the volunteers during our visit and he was very friendly and helpful. He told us a bit about the history of the place and the challenges they have been running up against.\nI loved it so much I went again a few days later to bring my kids, who had a fantastic time playing with the musical sculptures and eating the abundant and ripe apples next to the giant hand with the pick-up sticks.",
  "This was a one of a time experience, and my family all loved the noise makers. It is a great kids activity, to get out and do. The activities could apply to anyone age 3 to 100. I loved the artwork.",
  "We came upon this sculpture park on the Western-Chehalis bike trail. We were alone in the park when we visited.  The sculptures are along a meandering path in the woods.  Serene spot to stop and enjoy the art.",
  "I just love this quirky sculpture park and I would have loved to have visited with children because many of the sculptures are musical ... bells being predominant... and you are encouraged to ring them.   What child (or adult!) could resist!  The one I liked best was a series of pipes which were 'played' by an old flipflop sandal!  \n\nAlthough here are many weird/quirky (even disturbing) sculptures, the park itself is very peaceful (at least it was when we visited) and even spiritual (The Sacred Grove).  There is walk in /bike in access from the Chehalis Western Trail.\n\nIt is amazing that this park is free entry (donations welcomed) and the sculptures are donated by their artists.  I will return."
 ]
},{
 "name": "Nisqually Red Wind Casino",
 "address": "12819 Yelm Hwy SE",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/b7/04/90/come-check-out-our-new.jpg",
 "tags": [
  "food",
  "free",
  "food",
  "learn",
  "food",
  "eat",
  "food",
  "drink",
  "delicious",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d281953-Reviews-Nisqually_Red_Wind_Casino-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Really nice casino.. played the tables and came away $20 better off.. slots was a win win too 😍.. ate in the cafe and really good food.. chicken tenders were real chicken breasts.. throughly enjoyed the few hours we spent here..walked away richer than when we arrived 💋",
  "Non-smoking area is great with lots of slot machines to chose from.  The deli is nearby and is also smoke free and serves tasty food.  You cant beat their homemade clam chowder.   They offer soup of day which is always good.    The new seafood restaurant is awesome and the steak house is good.   Nice atmosphere in both restaurants with friendly servers.",
  "Food is excellent and reasonable.  \n\nBuffet is a bit cold and utilitarian.  Their full service restaurants have excellent food and professional service.  \n\nGo late afternoon for special meals at SPECIAL prices.  Read the boards by the restaurant doors to learn of day's specials.  \n\nThe seafood restaurant offers sushi, ramen, and noodle dishes as well as nice seafood\n\nThe grill has a nice varied menu including steamed clams appetizers--yum!",
  "This casino has a nice size non-smoking section. The cigarette guests are pretty dirty, and the machines could be kept cleaner.  Bathrooms are clean. Sometimes you win, and sometimes you lose. Their roll over riches on weekends are filling the place up on Saturdays so its harder to get a favorite machine. The ability to convert your weekly reward to cash is a nice feature, especially if you don't feel like playing that week. Food is pretty bland with a sameness in the buffet and deli. But with a senior discount, and half price when paid with points, its very reasonable to eat there. Frequently long lines for buffet. There's a yummy chocolate dessert in the Grille.  I appreciated the birthday food voucher. Nice touch. Can be a pleasant place to while away some time. Staff is always friendly and nice.",
  "I've only eaten at the excellent breakfast buffet they have in the casino. You have quite a bit to choose from, plus you can have them make your omelet to order. Reasonable prices and a discount for veterans. Haven't gambled, don't like the smoky atmosphere where you have to play. But a great breakfast buffet!",
  "This is the best place in the world to be on a Friday or Saturday night if you like crab and fresh seafood.  Their seafood buffet which features lots of crab just cant be beat for the price. A bit of a drive off of I-5 but oh so worth it.  Enjoy this place now!",
  "What happened to a place that I’ve been going to for years? I do the same thing, have a drink in the bars where the bartenders are attentive and then gamble on the floor. The last couple visits to the medicine creek deli have been awful. First time, they forget an entire meal. This time we wait for 45 minutes and are then told we can refund you the chowder(it’s a dollar) or you can wait an hour. The manager Ameir was a joke and the staff was apologizing for him. I wish I could say I wasn’t going back, but there are good people working there. The direction that are given by the leadership team is obviously disconnected. ",
  "Very nice casino! Went for dinner in the Red Wind buffet for seafood dinner night. Was hardly any wait & staff was very nice, helpful & courteous. Seafood was absolutely delicious and we were filled to the brim!! Service as wonderful. I highly recommend this to all visiting in the area. ",
  "It's a casino... usually go on a weekday so can't say how busy it is during the weekend.  Always seems to be plenty of parking.  Staff is friendly, and they have an adequate number of machines and some tables.  I recommend the buffet.",
  "Really nice casino.. played the tables and came away $20 better off.. slots was a win win too 😍.. ate in the cafe and really good food.. chicken tenders were real chicken breasts.. throughly enjoyed the few hours we spent here..walked away richer than when we arrived 💋",
  "We have gone to Red Wind for many years as we live in Olympia.  It did have good rewards previously, especially for elderly and veterans, but those have been reduced.  They used to provide a birthday reward to the buffet, but now if you aren't a big money player that too has disappeared.  The menus at the deli and buffet were good, but have been reduced and prices raised.  Now, it appears that they no longer have king crab on Friday as they once did.  Since the new card system was installed, it appears pay outs are not as good.  I know that they are there to take your money, it is a casino.  Weekly rewards were once open, but if you even get them they are only good if matched.  But greed has set in and regular visitors have had their rewards cut.  The weekly rewards games do not have as good payouts and not as much fun.  Lucky Eagle while further away appears to have taken the rewards that were once offered by Red Wind and offer them. "
 ]
},{
 "name": "Millersylvania State Park",
 "address": "12245 Tilley Rd S",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/e6/d0/47/enjoying-late-winter.jpg",
 "tags": [
  "hike",
  "walk",
  "walk",
  "nature",
  "free",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d641287-Reviews-Millersylvania_State_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "My sister and I were looking for a good place to hike. The trails are flat and well-groomed. Personally, I would have preferred more of a challenge, but my sister was happy without any hills to climb. We had a great hike with fresh air and absolutely beautiful scenery.",
  "We returned for a day trip to Millersylvania State Park.  It is a fee use state park both for day use and for camping.\n\nThere is beautiful trees and a lake.  It is a popular place for kayaking, boating, fishing, swimming and hiking.  It is abundant in old-growth Cedar and Fir Trees.\n\nWe have camped there in the past.   There are also a few houses for rent as well as group use areas.",
  "I was looking for a place to get to the water and this is it-trails along the lakeside, picnic tables right there, a dock with seats to look at the view, fish; roped off swimming areas (no lifeguard). Clean restroom for day visitors. There is overnight camping which I did not investigate. ",
  "Not huge, but a nice place for a walk among some old growth trees, stroll along the lake, have a picnic.  There are campgrounds and hot showers if you plan to stay a few days.  Get an annual state park pass and save yourself a few dollars on the daily fees.  Ample parking, and more than enough to do and see for a full day.  No concessions there so plan accordingly - snacks, drinks, etc...",
  "Not huge, but a nice place for a walk among some old growth trees, stroll along the lake, have a picnic.  There are campgrounds and hot showers if you plan to stay a few days.  Get an annual state park pass and save yourself a few dollars on the daily fees.  Ample parking, and more than enough to do and see for a full day.  No concessions there so plan accordingly - snacks, drinks, etc...",
  "During the winter the 6 miles trails are a little muddy in parts, but passable. It's a nice place to get away and enjoy nature. Deep lake has swimming areas and a small boat launch that is probably in constant use during the summer. Don't forget to have your Discover Pass for parking.",
  "We rented the boat and went around the lake. Lots of trees and branches are underwater. Cold but clear water. I would guess end of July would be a great time for swimming in the lake.",
  "Millersylvania has a variety of terrain including boardwalks and tree roots that make the trails somewhat challenging in places. Most of the trails are within the forest, which make sunglasses unnecessary even on a sunny day.  We had the trails mostly to ourselves on a weekday in October.  Beautiful lake and scenery.",
  "Millersylvania State Park offers a number of options for both day visitors and overnight campers. The park has an vintage state park feel with roomy campsites and old-style picnic tables. Swimming area is sandy and welcoming with free life jackets. Hiking trails abound! Close to nearby Olympia, Tacoma, and Seattle, this park is popular with locals and out of towners alike!",
  "This state park is close to downtown Olympia and has some great hiking and caping sites.  The level is not  too stressful and we even had elderly people who managed easily;y.",
  "Enjoyed a wonderful afternoon walking the trails. The best part was having a glass of wine in the charming beer garden in the middle of the park."
 ]
},{
 "name": "Lattin's Country Cider Mill & Farm",
 "address": "9402 Rich Rd SE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/1f/27/53/on-the-grounds-of-the.jpg",
 "tags": [
  "walking",
  "kids",
  "family",
  "food",
  "family",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d4427981-Reviews-Lattin_s_Country_Cider_Mill_Farm-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to take the grand-kids to pet and feed the farm animal.  We always have a good time.  When you are finished, you can always get some warm apple cider and an apple fritter.  On the way out, there are homemade jams, jellies, salsa and pies.  They usually have plenty of fresh fruit and vegetables to choose from.",
  "I went for a children's party I let my kids go in the petting zoo where children were stomping on cats throwing them around and I ended up walking out I told my kids you need to wash their hands but there is no soap no hand sanitizer at any other hand washing stations not even in the restrooms.\n Again these pettind zoo go unregulated enter at your own risk. \n For their face painters never wash their hands and between children they did not switch out the dirty water the paint brushes for the sponges and they did not have an ingredient lest on their paints. When I asked why she's not washing or switching out old sponges she replied I'm not spreading germs or diseases and I dont need too. \n How callous to put children at risk to save a couple dollars on supplies.",
  "We stopped here on our way to Olympia. There was a red barn which was the store and the cider processing area. We looked around the store at the apples which were much cheaper than in the grocery store and bought a container of apple cider and an apple turnover. There are little tables outside and we had our cider and turnover there. The cider was very good and the turnover was pretty good but could have used some more time in the oven. (See picture)",
  "I've since learned that the owners were deemed negligent in Washington State Court for the care of their goats, and are now unable to own or care for hooved animals for at least two years.\n\nTheir negligence led to the crippling of their goats as well as the advanced deterioration of their hooves. 18 goats were removed from their property.\n\nI also have firsthand knowledge of the owners' mistreatment of employees, their food products, and other animals. What appears to be a friendly happy family farm is a facade. Do not support this operation!",
  "My family and I went on a Saturday. There were no animals to pet like we initially thought there would be. My 1 year old did enjoy running around to look at the caged geese, chickens, ducks, and peacocks though. I just wish it was a little more interactive for her. The shop had delicious treats and the staff was friendly. Hoping to go back when more animals are out and about."
 ]
},{
 "name": "Amtrak Cascades",
 "address": "310 Maple Park Ave SE",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/de/f8/f3/amtrak-cascades.jpg",
 "tags": [
  "food",
  "kids",
  "walk",
  "food",
  "kids",
  "walk",
  "food",
  "kids",
  "walk",
  "drink",
  "performance",
  "free",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d14043052-Reviews-Amtrak_Cascades-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went round trip from Bellingham, WA and went to Vancouver, BC for the day.  At the time of this writing my kids are between the ages of 6-9 years old. This was their first experience on Amtrak and my third.\n\nLogistics--You'll need the proper documentation to enter Canada. The conductors check this before you're allowed on the train. When you arrive in Vancouver, there is customs and immigration at the train station. The process is similar to what happens at the airport (forms will be provided to you).\n\nPlan ahead for your activities. We went to Vancouver to go to the science center. It is about a 5 min walk from the train station to the science center. Also across the street from the train station is a public transportation/Skytrain station. This can get you just about anywhere in Vancouver\n\nI didn't see any food at the train station although there is signage that says there is an A&W. Services seem pretty limited. We ate at the McDonalds across the street.   Food on the train was pretty limited as well.  There are snacks, candies, pre-made sandwiches and salads, and a decent variety of drinks. I was expecting a dining car--a little disappointed there isn't one. \n\nDON'T BE LATE FOR YOUR TRAIN!!! They won't wait for you. We were there about 1.5 hours prior to our departure. Before your board, you go back through US Customs, then through Canadian Customs (there are forms you'll need to fill out) Again this is similar to what you would encounter at an airport. You'll need to hang on to your US Customs form as the train will stop at the US/Canadian Border. Border guards will check the train and collect the immigration forms there. \n\nFor our kids, we brought snacks and drinks and things for them to do. There are plugs that allow you to charge your electronic devices. \n\nOverall this was a great experience. It was a different way to travel. Yes is it much faster to drive and the train can run late. This for us was about the experience of train travel.",
  "We went round trip from Bellingham, WA and went to Vancouver, BC for the day.  At the time of this writing my kids are between the ages of 6-9 years old. This was their first experience on Amtrak and my third.\n\nLogistics--You'll need the proper documentation to enter Canada. The conductors check this before you're allowed on the train. When you arrive in Vancouver, there is customs and immigration at the train station. The process is similar to what happens at the airport (forms will be provided to you).\n\nPlan ahead for your activities. We went to Vancouver to go to the science center. It is about a 5 min walk from the train station to the science center. Also across the street from the train station is a public transportation/Skytrain station. This can get you just about anywhere in Vancouver\n\nI didn't see any food at the train station although there is signage that says there is an A&W. Services seem pretty limited. We ate at the McDonalds across the street.   Food on the train was pretty limited as well.  There are snacks, candies, pre-made sandwiches and salads, and a decent variety of drinks. I was expecting a dining car--a little disappointed there isn't one. \n\nDON'T BE LATE FOR YOUR TRAIN!!! They won't wait for you. We were there about 1.5 hours prior to our departure. Before your board, you go back through US Customs, then through Canadian Customs (there are forms you'll need to fill out) Again this is similar to what you would encounter at an airport. You'll need to hang on to your US Customs form as the train will stop at the US/Canadian Border. Border guards will check the train and collect the immigration forms there. \n\nFor our kids, we brought snacks and drinks and things for them to do. There are plugs that allow you to charge your electronic devices. \n\nOverall this was a great experience. It was a different way to travel. Yes is it much faster to drive and the train can run late. This for us was about the experience of train travel.",
  "We went round trip from Bellingham, WA and went to Vancouver, BC for the day.  At the time of this writing my kids are between the ages of 6-9 years old. This was their first experience on Amtrak and my third.\n\nLogistics--You'll need the proper documentation to enter Canada. The conductors check this before you're allowed on the train. When you arrive in Vancouver, there is customs and immigration at the train station. The process is similar to what happens at the airport (forms will be provided to you).\n\nPlan ahead for your activities. We went to Vancouver to go to the science center. It is about a 5 min walk from the train station to the science center. Also across the street from the train station is a public transportation/Skytrain station. This can get you just about anywhere in Vancouver\n\nI didn't see any food at the train station although there is signage that says there is an A&W. Services seem pretty limited. We ate at the McDonalds across the street.   Food on the train was pretty limited as well.  There are snacks, candies, pre-made sandwiches and salads, and a decent variety of drinks. I was expecting a dining car--a little disappointed there isn't one. \n\nDON'T BE LATE FOR YOUR TRAIN!!! They won't wait for you. We were there about 1.5 hours prior to our departure. Before your board, you go back through US Customs, then through Canadian Customs (there are forms you'll need to fill out) Again this is similar to what you would encounter at an airport. You'll need to hang on to your US Customs form as the train will stop at the US/Canadian Border. Border guards will check the train and collect the immigration forms there. \n\nFor our kids, we brought snacks and drinks and things for them to do. There are plugs that allow you to charge your electronic devices. \n\nOverall this was a great experience. It was a different way to travel. Yes is it much faster to drive and the train can run late. This for us was about the experience of train travel.",
  "Writing this as I wait to pick up my sister, traveling from Portland, OR to Bellingham, WA with her son. They could have rented a car but thought the scenery would be fun. Huge mistake. First, my sis tells me that the train isn’t very nice. They describe it as European style. Maybe take another trip to Europe Amtrak. Second, the train broke down half way. The staff were clueless, were not communicating with passengers AND CLOSED DOWN ALL THE RESTROOMS WHICH APPARENTLY DON’T WORK WHEN THE ENGINES DON’T!!! That last THREE hours!!!!  No bathrooms!! They even announced to not drink water or anything. Seriously!?! Third, the horn honking is constant. Sure it’s good for safety gambit it’s non stop annoying to passengers. Lastly, here’s a quote from my sis “They are incompetent. They literally just announced “we are just trying to figure out how to hook this up” about the new engine.” That’s encouraging. Yes. They announced that. Next when it did get going it was super duper slow. Left Portland at 3pm and was supposed to arrive at 9pm. It’s now 1:15AM and here I sit waiting. Don’t do it. Save your sanity. Travel another way unless this is your only option. ",
  "The Portland to Seattle train 518 is expected to be an hour past due.   I am to catch the connection back within an hour of arrival.  With one train being an hour late I will miss my connection. The staff are less than helpful and could care less that I am stranded due to their performance.    Amtrak is awful. Fly or drive.   The customer service is pitiful.",
  "518 service on Sunday 22nd December 31\\4 hours late into Vancouver, it was due in at 23:00 on Sunday night and finally arrived at 02:15 on Monday morning. I’ve always wanted to do a long distance journey in the USA and Canada and when my son landed a job in Vancouver, BC we thought we’d travel down to Seattle via the Amtrak Cascades, a dream fulfilled I hoped. Great going there apart from the weather spoiling the views, but coming back to Vancouver was a complete comedy of errors! An hour late leaving Seattle as we waited for coaches bringing people from Portland (line south blocked by mud slides) which was bad enough, but then after we’d got with 15 minutes of Vancouver we we’re held for nearly 2 hours whilst a freight train was manoeuvring in the sidings. During this wait, we had very little information, and the train crew didn’t seem to have a clue about customer service. We should have all been relocated to the comfier seats in Business class and offered at least a cup of coffee to compensate us. ",
  "I love taking the train to Seattle and to Portland.  It’s a great way to travel stress free while enjoying the scenery.  The Olympia Station is volunteer managed so I really appreciate the staff.  It’s a small simple station without any bells and whistles but it is clean and you feel safe.  You can park your car safely.  Intercity Transit has a bus stop, you can call a cab or call for Lyft/Uber to get into town which is a distance away.  There is free WiFi, snack machine and drink machine, plus clean restrooms.",
  "It was our first time traveling by train in North America. We had booked the 6:35 am train from Vancouver to Seattle, and arrived to the station a few minutes before the 6:25 cutoff, right about when they close the doors. We were told that we should have arrived one hour early without a good explanation as to why. We were told time and time again that the US Border Patrol agent would not attend to us, even after asking if I could speak to the agent myself. The Amtrak employee threatened to call the police guard because of my questioning, which I found disrespectful and unnecessary. He was not explaining himself and showed little sympathy for our urgent situation (we had a flight booked from Seattle for later that afternoon). The train was supposed to leave at 6:35 but didn't actually depart until 7:20. We were left to exchange our train ticket for the next bus (leaving at 9) as we watched those boarding the train inch forward in line for customs. A frustrating experience to say the least - extremely disappointed by the unprofessionalism and snarky responses from the Amtrak employee. I believe his name was Michael. Even an employee at the Pacific Central Station in Vamcouver agreed that it was BS and said that Amtrak has \"terrible customer service\". \n\nMorals of the story: arrive to the train station one hour before your train departs and don't rely on the Amtrak employees to be helpful. "
 ]
},{
 "name": "Woodard Bay Natural Resources Conservation Area",
 "address": "Henderson Bay",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/65/80/f2/woodard-bay-natural-resources.jpg",
 "tags": [
  "walk",
  "hike",
  "family",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d675933-Reviews-Woodard_Bay_Natural_Resources_Conservation_Area-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Easy short walk with views of the bay. Nice parking area and a canoe/statue was constructed out by the beach.",
  "Nice trails to clear your mind and appreciate the beauty of the Pacific Northwest.  Paved main trail that leads to a point where you can view an old railway.  Vegetation in this conservation area is beautiful.  There is a place to put in kayaks which would be great to discover the inlets.",
  "Love this area for it's real back-to-nature feel. Plus, you are rewarded at the end of your hike to an incredible view of Puget Sound. ",
  "This is the site of an old rail head for the lumbering industry that has been cleaned up and now is a beautiful PNW natural asset available to the public. Parking is available but a permit is necessary. No vehicle or bike traffic is allowed beyond the entrance. A gentle 1 mile paved pathway through the reforested area brings you to some tidewater areas with a variety of bird, mammal and marine life--spotted several seals, cormorants, herons, ospreys, two black tail deer...The area has informative signage relating to the history of the area, the native American tribes that first inhabited the  site, the ecology of the area,  the flora and fauna, and the reclamation efforts to return the site its original state. Very beautiful, tranquil spot for a 2-3 hour family outing.",
  "We had friends from AZ and wanted to show them our area a bit, and Woodard Bay was an excellent stop.\n\nA pretty spot, some interesting interpretive signage, easy to get to.  A lot of typical Puget Sound flora & fauna, attractive Northwesty beaches, a number of interesting birds.\n\nOur friends were quite impressed, and all so easy to enjoy."
 ]
},{
 "name": "Nisqually Reach Nature Center",
 "address": "4949 D Milluhr Dr NE",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0c/fc/c8/nisqually-reach-nature.jpg",
 "tags": [
  "history",
  "kids",
  "history",
  "kids",
  "walk",
  "family",
  "nature",
  "pets",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d4171780-Reviews-Nisqually_Reach_Nature_Center-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "At the mouth of McAllister Creek sits the Nisqually Reach Wildlife Center. This center is open Wednesday, Saturday and Sunday noon to 5 PM and is great place to take kids or just to visit on your own. \nThe building served as a residence and boat house for a boat rental operation years ago but that was before my time. Now it houses a very friendly educational center and small museum in one. The staff is very informative and well versed in the subject of natural history of the area. There is a salt water aquarium and a touch tank for kids as well as some taxidermy specimens and shells. \nThe setting is gorgeous, on the edge of a large estuary, just outside the window.\nThere are generally migratory and water birds and not uncommonly Blue Herons grace the area with their presence as a large rookery is situated just up the creek. \nParking requires a state permit which can be obtained with a fishing or hunting license or acquired when you get car tabs.\nMy boys and I spent a lot of time in this area doing lots of things including fishing, birding and just looking around. \nVisit this under advertised facility. Take the kids. You'll be back!",
  "At the mouth of McAllister Creek sits the Nisqually Reach Wildlife Center. This center is open Wednesday, Saturday and Sunday noon to 5 PM and is great place to take kids or just to visit on your own. \nThe building served as a residence and boat house for a boat rental operation years ago but that was before my time. Now it houses a very friendly educational center and small museum in one. The staff is very informative and well versed in the subject of natural history of the area. There is a salt water aquarium and a touch tank for kids as well as some taxidermy specimens and shells. \nThe setting is gorgeous, on the edge of a large estuary, just outside the window.\nThere are generally migratory and water birds and not uncommonly Blue Herons grace the area with their presence as a large rookery is situated just up the creek. \nParking requires a state permit which can be obtained with a fishing or hunting license or acquired when you get car tabs.\nMy boys and I spent a lot of time in this area doing lots of things including fishing, birding and just looking around. \nVisit this under advertised facility. Take the kids. You'll be back!",
  "Kayaking here is beautiful but try to time your trip to paddle in the same direction in the same direction as the tide.  The current is very strong!  There's a path for hiking that wanders through the reach with remarkable views of the sun, the Sound, and the mountains.  Birds are plentiful and you will most likely see eagles and herons as well as others.",
  "Great place to take a long or short walk on a clear, summer day if you want to enjoy a great view of southern Puget Sound. Some wildlife are usually visible so a nice added bonus!",
  "I’m not reviewing the nature center, but the Reach itself. I could have sat here all night. Just as the sun went down Mt Rainier turned pink for a few minutes, then disappeared into the night. My sister and her family are lucky enough to live just around the corner from here. My son and I were visiting from Illinois. ",
  "Beautiful area with great views. We were lucky enough to see several different kind of animals while we were there. ",
  "Nisqually Wildlife Refuge is full of wildlife whatever the season.  On this occasion we were lucky enough to spot a Bald Eagle, very exciting. ",
  "I really enjoy walking here with my wife, but it would be better if they allowed pets. If you stop by in the fall you can pick apples off of the massive trees up front."
 ]
},{
 "name": "Washington State Capital Museum",
 "address": "211 21st Ave SW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/ab/54/57/monument-olympia.jpg",
 "tags": [
  "family",
  "learn",
  "history",
  "tour",
  "walking",
  "tour",
  "walking",
  "history",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d150555-Reviews-Washington_State_Capital_Museum-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "My family and I had enjoy this place, it has so much rich history and the beauty within the building, evening outside is beautiful. I love for what it stand for and how the system is manage. I recommend this place for anybody that wants to learn about our justice system. Great history to learn for the whole family.",
  "All the reserved parking really put us off, there should be weekend signage.  The gift shop is terrific, walking around inside is amazing but DO NOT miss the guided tour.  Mark Greene was our tour guide and we enjoyed every minute.  His tour was the highlight of our trip to Olympia.  Having toured the capitols in Austin and Sacramento, this was every bit as much of a treat.  You get to see both chambers of the legislature, the beautiful and elegant formal reception room, and a million details that make you proud of what we the citizens have here.",
  "All the reserved parking really put us off, there should be weekend signage.  The gift shop is terrific, walking around inside is amazing but DO NOT miss the guided tour.  Mark Greene was our tour guide and we enjoyed every minute.  His tour was the highlight of our trip to Olympia.  Having toured the capitols in Austin and Sacramento, this was every bit as much of a treat.  You get to see both chambers of the legislature, the beautiful and elegant formal reception room, and a million details that make you proud of what we the citizens have here.",
  "It's a well done area though small.  Lots of interesting facts about Washingtonian's and the history of the area.  Very enjoyable.  ",
  "WE have been visiting all the State Capital when we travel if we are within reach and this one didn't disappoint. Love all the capitol buildings. Most seem almost abandoned these days ..... Sad",
  "Very disappointed!  We took a train from Seattle to visit the Capitol and the State Museum planning to spend a great deal of time at the Museum especially.  We were sorely disappointed once we got there to learn in spite of all the listings for this facility it no longer exists.  Not to be nasty but Olympia has very little to do and we were forced to sit 5 hours in the train station awaiting the return train trip.",
  "I've visited this museum since the 1960s, with its revolving displays on Washington artists, local history, and a now neglected native plant garden, this was a small local gem of a museum. In recent years the state increasingly transferred most of its museum functions to the Tacoma museum, and our little museum struggled and was eventually pushed under. A real shame that now what remains of this once fine museum is a building that neoliberal forces put on the rental market, the carriage house now used as a public rental space, and the law hosts outdoor movies on Friday nights for neighborhood middle class people, who don't mind that the host reads plot summaries--complete with plot twists and surprise endings--from Wikipedia entries before showing classic films.  A real shame this museum is no longer the small local showpiece it once was."
 ]
},{
 "name": "Mima Mounds Natural Area Preserve",
 "address": "Waddell Creek Raod",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/34/91/16/there-are-many-acres.jpg",
 "tags": [
  "walk",
  "walk",
  "history",
  "walk",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d6899513-Reviews-Mima_Mounds_Natural_Area_Preserve-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you love geology, are a curious person who loves the out of doors, or you love prairies, you must see the Mima Mounds.  While out of the way, they are interesting formations and often covered with prairie-loving vegitation.  Do go during the time the camus flower is in bloom!",
  "Went on trail walk on a Tuesday morning.It was sunny and beautiful with the dew shimmering in the ferns. The visitor tower is informative. Seriously, if you dig geology, don't mind a few gunshot sounds from the range, and bring a camera you will definitely have a good time!",
  "I went to the Mima Mounds for a fund raising event, and I'm glad I participated in that, for I did not find anything particularly interesting about it. Not worth the drive, especially if you have to drive more than 15 minutes to it. Save your gas and time.",
  "Trying to see all the local attractions and this has been list for awhile.  I was so thankful we did not bring the grandkids along.  Not a lot to see,plenty of weeds and grass. It is an easy walk. Discover pass required and no dogs allowed.  ",
  "We were very excited to visit in the height of butterfly season. Even with the weather a little less than ideal, we saw quite a few butterflies out. The wildflowers and the mounds are very cool if you haven't seen them before. The interpretation area is well put together, and the site steward is very friendly. \n\nThe biggest downside, and the reason for knocking off a star, is that there is a shooting range nearby. The constant sound of shots ricocheting off the hills kills a lot of the ambiance ,and the sound is loud enough to make it difficult to hold a conversation on some of the trails. ",
  "a lovely walk in a very unusual area! so glad we stopped and walked the southern loop but it would be very hot there if sunny! so be prepared for that! Beautiful wild flowers and interesting history of the mysterious mounds!",
  "Took our family here for a trip.  The mystery of the mounds is the best part.  We loved reading about the different theories.  Honestly its just a bunch of mounds in the ground.  Our kids rolled their eyes a bit :)\n\nWe still had fun.  And debated in the car on the way back what would have caused all of that. ",
  "Fascinating natural phenomenon that no scientist has been able to fully explain. Mysterious. Pioneers mistakenly believed they were burial mounds."
 ]
},{
 "name": "Olympic Flight Museum",
 "address": "7637 A Old Hwy. 99 SE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/33/f3/98/p-51-mustang.jpg",
 "tags": [
  "history",
  "knowledgeable",
  "knowledgeable",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d292589-Reviews-Olympic_Flight_Museum-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's not on the order of Boeing Museum of Flight, but if you are in the area it's definitely worth the time to stop by.",
  "Drop by and spend some time with a really good air museum. It's small compared to other national museums, but it has a good number of aircraft and static displays to see. Well worth an hour or two visit. You could spend more time depending how deep you explore the exhibits.",
  "This is a very small museum when compared to it's cousin in Seattle.  But do not be deceived, it is very well done and all the aircraft have, as I understand it, combat history.  The docents are very knowledgeable about the aircraft and there is a wonderful selection of aircraft to view and with which to become acquainted.  \n\nI would suggest that you will not need more than a couple hours, but that is enough time if you are travelling the West Coast air museum route.  If you plan it right, you could do both this museum and the Pearson Air Museum in Vancouver, WA in the same day.  Two little gems that don't receive the attention they deserve.",
  "interesting place and knowledgeable staff..air show going on so it was a little different than usual but still enjoyable",
  "Being an aviation lover, I wanted to check this museum out. It's a simple 1 hanger setup with a handful of aircraft on display. If you take your time you can spend an hour there. The cashier/staff will say they'll answer questions but all I got was a deer in the headlights look and no answers. That's ok if you don't know anything about planes but you should at least try to find out or learn something. Ex: \"Hey, I don't see any A10's on display - do you get any/have any/sell any A10 items?\"\n\nOutside of that, I understand there's an air show out that way in the summer that might be worth checking out."
 ]
},{
 "name": "WET Science Center",
 "address": "500 Adams St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/bc/39/28/my-kids-looking-at-samples.jpg",
 "tags": [
  "field",
  "family",
  "kids",
  "learn",
  "walking",
  "kids",
  "free",
  "learn",
  "kids",
  "free",
  "food",
  "kids",
  "kids",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d3440452-Reviews-WET_Science_Center-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "The LOTT (Lacey, Olympia, Tumwater and Thurston County) communities waste water treatment center has created a great science center about all things water.  Every aspect from conservation to jobs in the field is covered in a fun hands on way. It was technical enough that my Middle School age daughter (and I) were engaged, but there were also things that my grandson found fun.  On weekends they have interesting sounding family programs, but we were there midweek all by ourselves.  The only thing that was tricky, was the parking.  The lot is small, so get there early.  It also might be good to call ahead to avoid any school groups as the square footage might seem a bit small if a whole bus load of kids was there during your visit.",
  "This is a must for children and adults to learn about the treatment center here in Olympia.  There are many hands on experiments to try, a craft room, and for the adults...such knowledge about how our water is treated.  Very enjoyable!",
  "The WET Science Center is o.k. for a short visit.  They have some hands-on exhibits that the kids will enjoy such as seeing how much water you use for different home activities.  There are a couple of areas with preschool toys.  The Center is small and somewhat dark.  The atmosphere and staff are not as \"kid friendly\" as the Children's Museum next door, however, a combination visit is worthwhile.  The WET Science Center holds children's activities sometimes.  And the new outside plaza is definitely worth walking through, specially on a nice day.",
  "Very nicely located next to the Children's Hands On Museum and it's FREE plus even adults will learn a few things about water usage. ",
  "My kids have fallen in love with this place as have I.  The staff is warm and helpful, there are new activities every time we are there, and I love that my kiddos are learning a ton without even realizing it.  They also have great scavenger hunts with prizes that my six year old can't get enough of.  ",
  "Here’s the scenario:  Grandpa 72, Grandma 64, Granddaughters 14 and 10.  We brought them here so we wouldn’t be stuck in the house playing games or school.  It was free, a bonus, and it kept us busy for an hour and a half.\n\nThis place can be cerebral, but we latched onto a couple areas that required hands-on.  The 10 year old and G-pa worked on some plumbing for drainage.  It was quite fun arranging the parts so that sewage, a plastic whiffle ball, would pass through the piping.  We probably spent half an hour at this station.\n\nAnother fun, hands-on, area was a set of large plastic gears that actually function according to how you place them on a magnetic board.\n\nFor little kids, there is a mock kitchen for play.      \n\nOutside are several shallow, clear water ponds that are not for wading or drinking as they are using recycled water that may not be potable…not sure about that.  The walkways are lined with various plants that would be of interest to gardeners.\n\nWe found ourselves nearing lunch time, so we crossed the street to the Hands-on Museum which has a café.  It was too noisy with little kids, so we ventured over to the Capital Mall’s food court.",
  "We visited for a public presentation that was geared towards children and adults. It was very informative and entertaining. This was my first time here. Very well kept and up-to-date. There are a lot of interactive displays. Mostly for kids, but I found myself tinkering with some of them!",
  "A great place for kids and adults to learn about science and the world around them! Great day trip!!"
 ]
},{
 "name": "Heritage Park",
 "address": "5th Ave SW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/47/15/9e/heritage-park.jpg",
 "tags": [
  "walk",
  "walking",
  "walk",
  "nature",
  "walk",
  "walking",
  "walk",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d12087407-Reviews-Heritage_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "So much for a nice weekend to walk around the lake.  Thought it was cleaned up but nope.  Broken down RVs. Trash everywhere.  Needles if you walk off the path.   Homeless darting in and out near I-5.  \nI don't go to downtown Oly any more.  Now I won't go to the lake.   Will definitely avoid any events this year.   This was such a nice city several years ago an now its dirty and dangerous.",
  "We stopped here to go for a walk with our toddler. It’s a nice lake with a view of the capital building. There’s a walking path that goes around the lake. It’s a pretty good spot to go for a stroll on a warm day, but other than that, not too much else. ",
  "This is a great place to relax, walk, enjoy nature, and exercise.  Great views, and plenty of room to enjoy.  ",
  "There is a wide crushed limestone walking path that goes around the lake. It was relaxing to walk and watch all the locals walking their dogs. There was also a switchback trail up a hill to get to the capitol building. ",
  "I've been going here before it was called \"heritage park\". It was much better back then. I'd suggest if you have kids and do go to the park you keep your kids in sight at all times and expect to be panhandled quite often, at least. Also, don't leave anything unattended."
 ]
},{
 "name": "Mclane Creek Nature Trail",
 "address": "Delphi Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/9d/8a/02/mclane-creek-nature-trail.jpg",
 "tags": [
  "nature",
  "hike",
  "walk",
  "kids",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d6774404-Reviews-Mclane_Creek_Nature_Trail-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent the morning here viewing the large numbers of chum salmon on their spawning run up Mclane Creek. There were hundreds making their annual (first and last) trek back to fresh water to spawn and assure the continuation of the species. I never cease to marvel at this incredible life journey. \nThere are numerous viewing spots along the boardwalk and trail system that is well maintained. Access is easy on a paved entry way while parking was more than adequate on the weekday we were there. If you are a nature lover,give it a try, you will be pleasantly rewarded.",
  "An easy hike for children and elders.  Close to town, yet great jump into wilderness.  Reliable sightings of salamanders and dragonflies.",
  "Nice peaceful walk around the trsil. There are several pieces to the trail, you can do a shorter loop or take the longer one. There are several observation decks to view the wildlife.",
  "McLane has about 1.5 miles of hiking trails, through second-growth forest, wetlands around a beaver pond, and along McLane Creek. It is endlessly diverse, if you keep going back. In November hundreds of chum come up to spawn and die. In January endless rains help to dampen the smell of rotting chum. In March the red-winged blackbirds come back and everything starts to grow again. In May almost every plant is in flower, there are zillions of songbirds, and the newts are in love. In July the logs in the pond are crowded with turtles and there are lots of baby ducks. In September everything is sort of warm and sleepy and quiet and dry. Great place for birding or salmon-watching. Very popular with kids. You will need a Discovery pass (though in 8 years of hiking there I've never seen it enforced). Can be crowded on weekends. Explore a bit; you'll find lots of interesting trails besides the one around the pond.",
  "Always a welcomed escape into a miniature landscape with ponds and well maintained footpaths and plenty of trailside benches for nature watching. One word of caution however; the broken window glass often found in the parking lot is proof enough that some local hoodlums are taking the opportunity to break into the parked cars. This remains an unfortunate but chronic problem at an otherwise beautiful nature park."
 ]
},{
 "name": "Marathon Park",
 "address": "1011 Deschutes Pkwy SW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/33/3c/0e/photo7jpg.jpg",
 "tags": [
  "walking",
  "walk",
  "walking",
  "walk",
  "walk",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d6575465-Reviews-Marathon_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Literally, you can walk around the Capitol Lake which is a part of the Marathon Park location. it is about a 2 mile walk and for those who want a pleasant exercise option, this is among the best. the lake is scenic, there are always some folks walking the area and if you really want a work out, you can climb the trail up to the state capital campus. I like walking but you can jog the loop around the lake and take a break at the park or other places along the way. restroom facilities are at the park and so is parking. fresh air, green all around, and the ducks! try it.",
  "Literally, you can walk around the Capitol Lake which is a part of the Marathon Park location. it is about a 2 mile walk and for those who want a pleasant exercise option, this is among the best. the lake is scenic, there are always some folks walking the area and if you really want a work out, you can climb the trail up to the state capital campus. I like walking but you can jog the loop around the lake and take a break at the park or other places along the way. restroom facilities are at the park and so is parking. fresh air, green all around, and the ducks! try it.",
  "This is a lovely place for a stroll, it has beautiful views. The parking is tough though, it seems to be very busy, especially on a pretty clear day, which is few and far between in this area. Stop of for an hour or so if in the area and relax.",
  "The city put a homeless camp across the street from the park, making it extremely unsafe. Drug dealers park along the road and sell to the people in the homeless camp. \n\nIt used to be a beautiful, well lit, safe place to go walk or play Frisbee. The city clearly does not care about the people who live in the city having a safe outdoor space. \n\nThe park itself is beautiful but can't be enjoyed. A few years ago I would go there to walk alone often, now I wouldn't dream of it.",
  "Homeless are taking over capital lake. Not pretty or safe anymore for walks or running\nVery sad hoe city is doing nothing to keep residents and businesses safe. Olympia use to be a great city. Now it’s like Seattle, Los Angeles skid row and San Francisco.\nNo one I know ever goes downtown anymore especially at night.\n",
  "Marathon Park itself isn't much, a patch of grass and a restroom next to a lake that you can't swim in or boat on. However, it gives ready, central access to the Capitol Lake area and is the main place for people to park, and for groups to gather, prior to walking around the lake or enjoying its other attractions - mostly, bicycling, running, and birding. As such it tends to be quite popular during good weather at any time of year. If the parking lot is full there is also abundant parking along adjacent Deschutes Boulevard.",
  "lit at night to give a great spot to view the water and relax on the many benches looking over the waterfront. ",
  "Marathon park is a great walking park with large grass fields and pathways that lead around Capitol Lake. It is a great for jogging, walking, animals, or whatever suits your fancy. "
 ]
},{
 "name": "East Bay Public Plaza",
 "address": "325 Marine Drive NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/9c/49/7d/east-bay-public-plaza.jpg",
 "tags": [
  "free",
  "food",
  "kids",
  "walk",
  "art",
  "active",
  "kids",
  "walk",
  "kids",
  "kids",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d3440327-Reviews-East_Bay_Public_Plaza-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Such a fun area for young children! Baby to 5/6 yrs. shallow little concrete stream that is fun for littles to wade, sit and splash in. No food is allowed near for obvious health reasons but a close walk down the street you can sit in the grass along the water or at the farmers market. Go early because it gets crowded...not a lot of shade also so be aware with babies. Bring towels or s small chair to sit on and lounge by the side to watch kids.  Bathrooms located real close which is nice! Free too just in case your wondering :)",
  "A lovely, clean area for a short walk or just hang out and people watch.  Lots of cute and active kids to entertain you.   The art and landscaping are very attractive.  This area is at the core of Olympia which seems to have its own special positive energy.  Definitely worth a visit and it doesn't cost you anything except to feed the parking meter (Sundays you don't even have to do that)",
  "It's a great place for kids to come and have fun. The little stream is fun and it's a great spot for a break.  Beautiful setting.",
  "It's a great place for kids to come and have fun. The little stream is fun and it's a great spot for a break.  Beautiful setting.",
  "My kids LOVE going to the stream, it's a treat for them and I always attempt to pretend I'm sitting at the beach.  My only critique would be that I wish there was more shade and sitting areas.  Still, it's a fun place to spend a couple of hours with the kids.  :)",
  "The Public Plaza has a running play creek (during normal business hours of the Children's Museum) and bathrooms. It is fun to take our daughter to the creek the splash around and cool off on a hot day. ",
  "A cute place for the kids to splash around in for about 15 minutes.\nAlways clean, good bathrooms too.",
  "We wandered around after visiting the Farmer's Market. There were a lot of artisans with wares for sale and it was fun to browse. We also enjoyed looking at the boats and water. Good for an hour or so on a warm fall day."
 ]
},{
 "name": "West Bay Park",
 "address": "700 W Bay Dr NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/40/62/b4/west-bay-park.jpg",
 "tags": [
  "walk",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d6881311-Reviews-West_Bay_Park-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Again, \nNot a lot of things to do here, just come for  a walk.\nI suggest a little more interesting trip is to park at or near Percival Landing and head over to Capitol Lake and then walk under the 4th and 5th Street bridges to the park. Possibly an hour walk round trip. A nice place to go to sit and watch the scenery. ",
  "I visited this park on Monday in hopes of getting a glimpse of Mt. Rainier but no luck since there were low level clouds in the sky.  I just walked along the paths and saw Capitol Lake and viewed the Capitol Building from the West side and also saw the lumber mill with lots of logs being loaded.  It was a nice park for a relaxing scenic walk.",
  "West Bay Park is a great little public space with stunning views. It's a great place for SUP launching, relaxing, beach combing, and my favorite watching the Lakefair fireworks display.\n\nIt's not the \"best\" water front park in Olympia or Thurston county but it's a very good park, with low traffic and good open spaces. Just a note; there are no \"restrooms\" rather a handicap accessible Honey Bucket is on site. They don't always have TP or hand sanitizer stocked.",
  "This park provides an interesting Viewpoint of the opposite side of Olympia. If you walk up the driveway you can see the top of Rainier on a clear day.",
  "On a nice day, I recommend to stop for a few minutes and enjoy the view of the city and port of Olympia. Interpretive signs tell about the building of the park as well as the natural environment. It is a well maintained park by the city and has plans for expansion in the future."
 ]
},{
 "name": "Capital Mall",
 "address": "625 Black Lake Blvd SW",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e0/0a/32/capital-mall.jpg",
 "tags": [
  "adventurous",
  "unique",
  "walk",
  "food",
  "food",
  "eat",
  "food",
  "family",
  "food",
  "cheap",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d7183437-Reviews-Capital_Mall-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "The main mall is fairly compact with a nice variety of big box and more unique smaller stores. When you look at just this building the mall appears to be small- what you need to take into consideration is that on the same campus are many of the larger stores in their own buildings or mini strip areas. These include Party City, Bed Bath & Beyond, smaller stores like Chico's. There is plenty of parking available as well as a large transit station. You can drive and park or if you are alittle more adventurous walk from area to area.",
  "Just another Mall, but it is the only mall! So it has that going for it. Not worth a special trip but you can find things up there if you need.",
  "After doing some tourist type things in Olympia, my wife and I took our 2 granddaughters to the mall figuring there would be plenty of food choices in the food court.  Unfortunately, we found only 3 providers there and they got quite busy after we purchased our sandwiches at Subway.  Good thing we didn’t wait until after the 12:00 hour.  There is a Chucky Cheese, if that is your leaning. \n\nThe mall was able to sell us some items that the girls wanted.  There are plenty of nice shops.  Several burly security personnel were on duty, which made us feel more secure.  For easier parking we always park in the lot outside of the Chucky Cheese mall entrance.   \n\nIf you feel like splurging and are an older child or early teen, you can rent a motorized animal that can be ridden around the mall interior.",
  "It's a good sized mall with a lot of variety of stores.  The food court is crazy small though, just 4 choices.  There is a movie theater there, and a Chuck E Cheese as well.  After going to leave, I saw there were additional restaurants and shops you could only access from outside the mall too, which seems like a design flaw.",
  "This mall is very good. It is big and clean. It has the most famous stores and prices are reasonable. The food court is also good, if you want to eat something fast.",
  "My daughter and I went to this mall a couple days ago and she said “Potty” I Located a family restroom with Mom and toddler sized potty, changing tables, cars to sit in and play, games on the wall, breastfeeding rooms, tv’s and my daughter did not want to leave. We shopped, ate and rode the electric stuffed animals it was a good trip to the mall. Everyone that worked there was very nice.",
  "After doing some tourist type things in Olympia, my wife and I took our 2 granddaughters to the mall figuring there would be plenty of food choices in the food court.  Unfortunately, we found only 3 providers there and they got quite busy after we purchased our sandwiches at Subway.  Good thing we didn’t wait until after the 12:00 hour.  There is a Chucky Cheese, if that is your leaning. \n\nThe mall was able to sell us some items that the girls wanted.  There are plenty of nice shops.  Several burly security personnel were on duty, which made us feel more secure.  For easier parking we always park in the lot outside of the Chucky Cheese mall entrance.   \n\nIf you feel like splurging and are an older child or early teen, you can rent a motorized animal that can be ridden around the mall interior.",
  "Only 4 options for dining in the food court right now. Wish H & M didnt take up half the room with construction. \n\nThe movie theater was great with the new recliners. Tuesday cheap movie day is also excellent. "
 ]
},{
 "name": "Puget Sound Estuarium",
 "address": "309 State Ave NE",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b1/10/94/sea-cucumber-and-sea.jpg",
 "tags": [
  "kids",
  "free",
  "knowledgeable",
  "learn",
  "nature",
  "learn",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d8651085-Reviews-Puget_Sound_Estuarium-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Found this place by chance. Super fun for the kids to get an up front understanding of life in Puget Sound. Since it is not well known it is very quiet and interactive for the kids with the docent. Highly recommended ",
  "The estuarium has its own free parking lot with a few spaces. The facility is very small. The staff is very friendly and eager to be of assistance. They are quite knowledgeable on the subject matter. Most of the exhibits are about mollusks. You could spend an hour looking around, perhaps.",
  "We visited this facility to check it out for our grandkids and were fascinated by the place. There are multiple exhibits and informative posters. There are a number of tanks  obtaining sea life of various forms. The best feature, however, is the staff who are well trained and very informative and give guests tours of the facility. In this way they learn your interests and can direct you to area you might otherwise miss.\nI lost track of time checking it out.\nHighly recommended.",
  "This is my first review on trip advisor. After much travel and tourism, my trip to the estuarium today finally compelled me to write one! \nFirstly, the murals on the building are gorgeous, you can't miss them. I am new to the area, and the building was so central and easy to find, yet there was plenty of parking. \nAs I walked in, I was greeted warmly by Taisha. Taisha, a marine biologist, is an exceptional guide and so knowledgable about not only the content/creatures within the center/the missions and projects of the estuarium and their partners, but the entire sound and PNW ecology at large. I was so happy to have showed up early while she (and a helpful, knowledgable, friendly volunteer who I regrettably forgot the name of) had time to chat in depth before more visitors came in. \nAs more visitors came in, I observed that Taisha was able to naturally discern the individual interests of guests and focus on them, offering relevant, fascinating and often funny information. \nI imagine the children's programs are amazing from how they were described to me. As a teacher, I can see this place being an incredible asset to the community.\nI imagine children and adults both love to see the fish, anemones, crabs, etc be fed! So cool! \nI saw one kelp crab greedily snatch almost an entire cube of bloodworms and stash it under a sanddollar while stuffing her face left claw, right claw, left claw, right claw. If you take the time, each tank offers so much to see and behavior to figure out! \nI learned a lot about each organisms special adaptations. \nThere were live and preserved animals and plants that I could stare at for hours.\nInformation boards and displays with all sorts of insight about estuaries and what affects them. \nShort videos playing which were entertaining and informative.\nI actually spent quite some time looking though the book and pamphlet selection before I left, on a cozy seat, as well as a very well comprised binder of Puget sound organisms & articles about them. \nI left the estuarium with advice on how to  discover and immerse myself in the Puget sound, both in nature appreciation and culture, and knowing I would make a trip back to this center!\nBy the way, this place cost less than my morning coffee, and I would be absolutely happy paying triple for my experience, knowing the fee was going to an educational center with so much integrity and effective effort. \nIt was a couple of hours very well spent. \nSo much fun! Did not stop smiling until I left. \nThank you estuarium & staff. \n    ",
  "We were visiting Olympia on a day when the estuarium was not open, but they were nice enough to open for just the two of us.  The gal who showed us around was very knowledgeable and helped us learn a lot.  We had a great time."
 ]
},{
 "name": "Washington Center for the Performing Arts",
 "address": "512 Washington St SE",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/9f/ed/ec/fancy-carpet.jpg",
 "tags": [
  "walk",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d7313914-Reviews-Washington_Center_for_the_Performing_Arts-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Olympia is better known for it's somewhat quirky, earthy, hippie type lifestyle-but don't let that fool you.  It can easily compete with other (dare I say, more sophisticated) citiest, with it's top rated performing arts center.  The center is beautiful and there is not a bad seat in the house.  You owe it to yourself to enjoy a production at the center.\nParking is an issue, so be prepared to drive around a bit, looking for a spot, or walk from one of the lots within 5 blocks.  (It still beats paying $10-12 for parking in Seattle or Tacoma.)",
  "As I said before, tons of different things to do here.  Check out the calendar and pick some \"sure things\" or go to something \"out of your comfort zone\". It's all fun. ",
  "Olympia is better known for it's somewhat quirky, earthy, hippie type lifestyle-but don't let that fool you.  It can easily compete with other (dare I say, more sophisticated) citiest, with it's top rated performing arts center.  The center is beautiful and there is not a bad seat in the house.  You owe it to yourself to enjoy a production at the center.\nParking is an issue, so be prepared to drive around a bit, looking for a spot, or walk from one of the lots within 5 blocks.  (It still beats paying $10-12 for parking in Seattle or Tacoma.)",
  "I really don't think there is a bad seat in the house, and the acoustics are great!\nLast night we watched our 3rd show over the last 3 month. Each show has been superb.\n\nTry em, you'll like em!",
  "Not a bad seat in the place. Great acoustics! Friendly & helpful staff. Parking is always a challenge.",
  "My favorite event is the silent film series. They are accompanied by Andy Crows beautiful Wurlitzer Organ. I've also attended the comedy acts of Brian Regan and Gabriel Rutledge and laughed the whole time.",
  "the center was easy to find, although parking impossible. had to walk 4 blocks in 90° weather with limited mobility disabled elderly person. Outside area, doors, Windows were clean and neat. Box office was easy to find, no lines, easy to understand cashier. prices were extremely overpriced for a child's dance recital.\nPlenty of people at door to check tickets, great security. Lobby was clean and beautifully decorated. ushers also handed out programs.\nSound system was clear but very loud.",
  "My wife and I attended the 2017 Mrs. Washington Pageant on Saturday May 20th. The staff were pleasant and the drinks were great! It was a large venue, clean and the pageant was wonderful"
 ]
},{
 "name": "Regional Athletic Complex",
 "address": "8345 Steilacoom Rd SE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ab/a0/73/softball-diamonds.jpg",
 "tags": [
  "family",
  "walking",
  "kids",
  "kids",
  "walking",
  "kids",
  "pets",
  "walk",
  "kids",
  "family",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d12839250-Reviews-Regional_Athletic_Complex-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "The park is centered around the baseball/softball fields but there is so much more there.\nThe playground and the grass will give you a nice picnic surrounding.\nThey have plenty of parking. Some of the parking is on a gravel lot but the main lot is paved and landscaped.\nThe ball fields have artificial turf and when it is hot, the smell of \"burning\" rubber is disconcerting if not unhealthy.",
  "This 100-acre facility features spectacular views of Mt. Rainier. Five softball and baseball fields and six regulation-size soccer, football and rugby fields as well as 3 half Basketball courts.There are picnic and outdoor event facilities, playgrounds, concession stands, BBQ grills, two miles of walking trails, family restrooms. The playground equipment provides fun for small children and older children. The trails are fun and even a bit challenging.",
  "The RAC is great for softball games, soccer games, kids toys and fun. Concessions was not open when we attended, but our daughter was entertained. ",
  "Large playground, basketball court, covered picnic areas and small trails. There is also baseball fields. Great place for kids",
  "Nice large complex in Lacey. Soccer fields, baseball, and softball. At the SE corner of Marvin and Steilacoom Rds. in East Lacey. Area also known as Mushroom Corners. Great walking area as well!   Large play area for kids.  Can get crowded when a tournament Is going on. Worth a visit.",
  "Great place for a nice walk.  Many walkers, runners, children riding bicycles, children playing, soccer events.  Good place to socialize leashed pets and meet people.",
  "The RAC is great for softball games, soccer games, kids toys and fun. Concessions was not open when we attended, but our daughter was entertained. ",
  "This 100-acre facility features spectacular views of Mt. Rainier. Five softball and baseball fields and six regulation-size soccer, football and rugby fields as well as 3 half Basketball courts.There are picnic and outdoor event facilities, playgrounds, concession stands, BBQ grills, two miles of walking trails, family restrooms. The playground equipment provides fun for small children and older children. The trails are fun and even a bit challenging."
 ]
},{
 "name": "5th Avenue Bridge",
 "address": "5th Avenue SW / Deschutes Pkwy SW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/54/21/8d/5th-avenue-bridge.jpg",
 "tags": [
  "walk",
  "eat",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d2359766-Reviews-5th_Avenue_Bridge-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Took some of my co-workers there who had never seem the salmon. I never tire of watching the Salmon. Nice that they pitched sign there to remind people.",
  "The Bridge is a nice way to try to see fish at times, but isn't too much of an attraction. More of a segment on your walk around the lake. ",
  "Ease access place to watch seals eat salmon on their way to Capitol Lake and the Deschutes River to spawn in the fall. From late September to early November (changes with weather and runs from year to year) you can watch the salmon run, and get some idea of how lazy seals are--as they take one or two bites out of a salmon, play with it fore a minute them move on to the next one. Nice place to hang out for a half hour and watch the fish.",
  "Really peaceful, lots of different fish and of course, the salmon. Educational signs around, Quaint white bridge across the way. ",
  "This is a great walking area near the Port of Olympia and old town Olympia. Beautiful water views, restaurants and little shops. "
 ]
},{
 "name": "Olympia Weekend Flea Market",
 "address": "210 Thurston Ave NE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/c0/1c/f9/olympia-weekend-flea.jpg",
 "tags": [
  "unique",
  "walk",
  "free",
  "unique",
  "walk",
  "free",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d4375352-Reviews-Olympia_Weekend_Flea_Market-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Anyone who sets foot in a flea market should not expect order. Olympia's is packed from wall to wall. This is more of an antique or vintage unique market. A wide range of prices by vendor, but I have yet to walk out without buying at least one item that I got a good deal on. This time was an old metal zebra bottle opener. Some of the more common things to see include vintage glassware, kitchen items, brass decor, china, jewelry, clothes patches, furniture and knick knacks. it is located in a more industrial feeling area, but is safe. There are parking meters all over, but on weekends it is free. Vendors are friendly and some quirky as you would expect. They keep an eye on you, so don't take offense as shoplifting is unfortunately too common all over town. Worth a stop.",
  "Anyone who sets foot in a flea market should not expect order. Olympia's is packed from wall to wall. This is more of an antique or vintage unique market. A wide range of prices by vendor, but I have yet to walk out without buying at least one item that I got a good deal on. This time was an old metal zebra bottle opener. Some of the more common things to see include vintage glassware, kitchen items, brass decor, china, jewelry, clothes patches, furniture and knick knacks. it is located in a more industrial feeling area, but is safe. There are parking meters all over, but on weekends it is free. Vendors are friendly and some quirky as you would expect. They keep an eye on you, so don't take offense as shoplifting is unfortunately too common all over town. Worth a stop.",
  "A little of everything: furniture, jewelry, toys, records, coins, quilts, home accents, pictures, kitchen ware. Definitely a worthwhile stop before or after visiting the Farmer's Market. Friendly people and you never know what you may find!",
  "The flea market is pretty standard with loads of knick knacks and various \"things\". So much little stuff it is hard to focus. Nice people.",
  "Very Small and crowded with items but I found nothing I'd want here didn't think it was worth the trip",
  "I recently visited the Olympia Weekend Flea Market with family.  It's a flea market in an old warehouse-type building and like many flea markets it's got all manner of stuff - lots of dishes, art of various kinds, old scary stuffed animals, old records, furniture...  If you are on the hunt for some old stuff this is probably a good place to visit.   I'm not a regular visitor to flea markets so don't really have much to compare it to.  Seemed flea markety enough to me, though.",
  "If you enjoy masses to do-dads this is the place for you.  Booth after booth of vintage and antique items.  The folks staffing the place are friendly and happy to see you for the most part.  Prices are very reasonable.  This is a good place to do a reality check on all those things you are holding onto because you think they might be valuable.",
  "For weekend flea market, this was a great place for antiques. A very nice collection for people who love shopping for antiques. I really like the old book collection."
 ]
},{
 "name": "Bigelow House Museum",
 "address": "918 Glass Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "family",
  "history",
  "history",
  "knowledgeable",
  "family",
  "history",
  "tour",
  "family",
  "family",
  "tour",
  "family",
  "active",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g58653-d9996672-Reviews-Bigelow_House_Museum-Olympia_Washington.html",
 "source": "TripAdvisor",
 "reviews": [
  "Bigelow house is a look into the life of the homesteading  lawyer who built it and his family.  It’s unusual in that the house and furnishings stayed in the same family until becoming a small museum.  Filled with original furniture and musical instruments. The docents know the history well.  Totally worth a visit and the admission is nominal.",
  "The Trustees of the Bigelow House Museum have done an excellent job in preserving this fascinating piece of Olympian history.  The two docents were extremely friendly and knowledgeable.  Interesting artefacts.",
  "Bigelow house is a look into the life of the homesteading  lawyer who built it and his family.  It’s unusual in that the house and furnishings stayed in the same family until becoming a small museum.  Filled with original furniture and musical instruments. The docents know the history well.  Totally worth a visit and the admission is nominal.",
  "Beautiful Cottage Style pre-Victorian architecture built in 1840s for Dr. Bigelow who was the doctor for the entire territory and the native Americans. For decades was only house on the West-side of Olympia.",
  "With my parents (mid 80's) on an overcast day we headed for a museum.  All the better because this museum is located in a house!  Drive up to this residential house and throw yourself back three generations. To be immersed in the past with architecture, furniture, personal family articles and great stories while looking out the windows to modern homes was a kick. The docent that gave us the tour did a great job giving us insight into the details of the Bigelow family and the growth of Olympia. As a visitor to the capital city, it was a a fun way to spend the afternoon. There is a cover charge.",
  "We were amazed at how many unusual historical objects they showed us as well as all we learned of the Bigelows and early Olympia.  Imagine my surprise to discover this place when we moved here this year...my ancient kin...I am related back to 1620 or so...near as I can determine.  I came away feeling very proud of this part of the family too!!  They sound much like my side of the clan too...and it is a very well preserved place compared to others of like age we have seen in recent years.  Highly recommend a visit here.",
  "This was the first home built in Washington that was not a log cabin.  It was built by Harvard alum, Daniel Bigelow around 1852 after he arrived in the area by crossing the Oregon Trail.  After he married, he and his wife had 8 children and hosted a few important historical figures such as Susan B. Anthony.  Mrs. Bigelow was very active in the women's suffrage movement.  The house was added onto during the several years it remained in the Bigelow family or 1994.  It became a state house museum shortly before that even when the last of the family was living there.  Cheryl, our docent, was extremely knowledgeable and thorough.  The tour lasts about an hour and is well worth the time.  They only ask for donations; there is no set entrance fee."
 ]
}]
