[
{
 "name": "Musical Instrument Museum",
 "address": "4725 E Mayo Blvd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/55/78/f9/mim-exterior.jpg",
 "tags": [
  "music",
  "music",
  "family",
  "music",
  "music",
  "music",
  "music",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d1798067-Reviews-Musical_Instrument_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "1. Expect to spend at least five hours or more!\n2. Wear comfortable shoes!\n3. Take your camera, phone charger etc..\n4. For Musicians, music lovers etc...\n5. Bucket List Item\n6. All styles of music represented \n7. 777 Jackpot Rating!\n\nGo and see this place!",
  "Founded in 2010 by Robert J. Ulrich, former CEO and chairman of Target Corporation, the Musical Instrument Museum in Phoenix, Arizona, is the largest museum of its type in the world. Designed after the Musee de la Musique in Paris, France, and inspired by the Musical Instrument Museum in Brussels, Belgium, the MIM cost $250 million and covers about 200,000 square feet with two floors of galleries. The collection of over 15,000 musical instruments and associated objects includes examples from nearly 200 countries and territories and represent every inhabited continent. Some larger countries such as the United States, Mexico, India, China and Brazil have multiple displays with subsections for different types of ethnic, folk and tribal music. The museum also has a 299-seat theater for concerts and a cafe with indoor and outdoor seating. Among the most interesting displays is the Artist Gallery on the ground floor, which features exhibits for such musical artists as Elvis Presley, John Lennon, Pablo Casals and Taylor Swift. See clothes and guitar of Elvis Presley and Johnny Cash, Carlos Santana's guitar, Tito Puente's timbales, the Steinway piano used by John Lennon to compose the song \"Imagine,\" a Roy Orbison exhibit, Taylor Swift's Les Paul guitar and cordless microphone, an old-time Nickelodean piano player, an 1886 Model C Parlor Grand Piano and an array of instruments that shaped the North American musical landscape, including the sousaphone, ukulele and electric guitar.",
  "We spent about 6 hours in the museum.....it wasn't enough.  The displays were amazing with the collections of instruments, the video clips of instruments being played in a number of venues and the wonderful audio program was mesmerizing.",
  "A Special Event at MIM\n\nSince their opening, we have each been to the Musical Instrument Museum (MIM) several times. My wife and I attended a special charity event there, but got to see almost nothing of the museum, itself, as we were in the auditorium. My wife attended another event, but it was similar - almost no time to see the museum. I, on the other hand, did take family members, for a complete day at MIM, and did get to see nearly everything. In June, we got to see much more of the museum, while attending a business dinner on-property.\n\nThe evening began with much of the museum’s exhibits available to us, so we took the time to explore - something that my wife had not done before. We spent almost 2 hours in the main exhibits area, which features so many common musical instruments, including exhibits on many of the musicians, who made them famous, such as Ravi Shankar and his Sitar, and Wu Man’s Pipa.\n\nThe museum building, is architecturally interesting, more so inside, than on its rather basic exterior, and the exhibits are all well displayed, lit and many feature video monitors, playing the music of either the featured musician, or the featured instrument. We were given headphones, that tied into the videos, by proximity, so that one could privately enjoy the audio portion of the program.\n\nThough we only had the one large exhibit hall open, we easily filled the 2 hours, before we retired to the interior courtyard for a reception, and then dinner, catered by the museum. The service for the meal was very good, even with a portion being buffet-style, while a portion was served. Now, I do not know if the catering was done by the same staff, which cooks for, and serves meals in the little restaurant on-site? I should have asked.\n\nEven with our somewhat abbreviated visit, we both enjoyed the displays, and I think that at least two, had been added, from my previous visit, in 2017.\n\nNow, my wife and I just need to spend a full day at the MIM, and take it all in, plus dine at Café Allegro - make a full day out of it. Predicated on my visit with family (2 youngsters in the group), I would suggest at least 3 hours, with 4 being an ideal.",
  "We went on a Sunday afternoon upon the suggestion of a co-worker. I wish we’d started in the morning so we’d have more time. Upon entering, you are provided with headphones and as you approach the various exhibits, a short video(s) starts with music and performances. There are so many instruments from cultures around the world. It was a great geography lesson as well! Some areas were not open due to COVID, but there was plenty to see still. There is a performing arts center and restaurant as well.",
  "There’s so much to see.  Be prepared to spend hour and hours.  Every  genre of music and musical instruments  one can imagine and more.  Fabulous collect.  Great facility.  Several trips are required to experience the entire collection.",
  "Our second time in Pheonix, Arizona. Our Uber driver as we drove to our hotel, recommended the Musical Instrument Museum as it is near our hotel. It is an unforgettable experience. The museum has a vast collections of musical instrument all over the world! My daughter and I had an amazing \"around the world\" trip listening to music from various countries, cultures and an electric guitar exhibition. A hidden gem of a museum. Worth a visit. Who knew an Uber driver would give such great tourist advice. Of course he got a 5 star rating!",
  "We were blown away. As soon as we got our tickets, we were given headphones. Every time we stood in front of a TV screen, the program would automatically begin playing. Each program usually had 3-5 parts consisting primarily of examples of the music produced by the instruments displayed.\n\nAnd in case you think this might be a stuffy place, one of the first exhibits was of an empty guitar case with this identifying information: Air Guitar made of nitrogen, oxygen, argon, carbon dioxide, and dreams. The air guitar is played around the globe. World championships are held annually in Oulu, Finland.\n\nThe museum was overwhelming. A docent sent us to the “Artists Hall,” which highlighted particular artists and their instruments. Sometimes the displays included outfits or other paraphernalia from the artists, too. We loved watching videos of everyone from John Denver to Tito Puente. \n\nAs we wandered from continent to continent, we saw thousands and thousands of instruments. Most we’d never seen in our lives. We certainly didn’t know what they sounded like until we watched videos. \n\nWe were there about three hours and felt we’d barely scratched the surface. Since there are more than 15,000 instruments and artifacts from more than 200 countries across the globe, that was inevitable."
 ]
},{
 "name": "Desert Botanical Garden",
 "address": "1201 N Galvin Pkwy",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/ee/e6/d9/a-man-made-art-among.jpg",
 "tags": [
  "walk",
  "nature",
  "free",
  "tour",
  "learn",
  "art",
  "wander",
  "unique",
  "nature",
  "hike",
  "knowledgeable",
  "wander",
  "art",
  "walking",
  "art",
  "walking",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d109186-Reviews-Desert_Botanical_Garden-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "While we visited the Botanical Park years ago, it has really expanded and is an even more fascinating attraction in Phoenix today! We arrived at the park just moments before the next scheduled tour would be held. While we are normally not tour type of folks, we realized we stood to learn many things from a docent-led walk, and we were not disappointed. The docent we had was entertaining and well informed and had incredible props for her talk. You will learn much about cacti and succulents spending a day at this park, but you will learn so much more from a docent-led tour. I should mention the tour does not cover the entire park but just the heart of it. Then you are free to wander and enjoy the many offerings on your own. We enjoyed a snack at the Patio Café mid day, and were very lucky to see roadrunners, a jack rabbit, squirrels, quail, and two of the infamous Arizona javelinas.  It should be noted that javelinas can wreak much damage in a park like this, and park staff are attempting to safely trap these and relocate them away from the botanical park.  During our visit in January, we were surprised at the number of cacti with prickly pear and succulents with blooms and other plants in full bloom!  There are ample benches and chairs throughout the park to sit and quietly contemplate the beauty or simply take a rest. The paths are easily navigated by those on foot, with a walker, or even a wheelchair.  There is a marvelous plant shop and a lovely gift shop on the premises. There is a permanent exhibition of Dale Chihuly glass works, a marvelous complement to the nature of the garden, and while we were there, there was an Italian art exhibit, Wild Rising by Crackling Art, featuring more than 1,000 vividly colorful animal sculptures symbolizing sustainability and conservation.",
  "We visited the evening botanical gardens evening light show - an outstanding presentation of artistically illuminated  landscapes and vegetation with unique colors- a hillside is lit with majestic effect",
  "An amazing way to enjoy nature and the out doors in a relaxed way. Gorgeous landscapes and plants, many knowledgeable and helpful docents (volunteers), easy and numerous walkways, fun Butterfly Exhibit, and ample parking.\n\nYou can later enjoy an easy hike at next door Papago Park.",
  "Really interesting collection of desert flaura,well laid out with interesting themed loops. Took around 3 hours to see it all. Go early in the morning as it gets hot and busy.",
  "A wonderful place to stroll,good for all ages, with amazing cacti and flowers. This is a low key activity that can accommodate large and small groups. Go early in the day as it does get hot and remember to wear sunscreen.",
  "April and May are the perfect time of year to see cacti in bloom.  It is such a treat to see all the flowers and smell the floral fragrance.  Take your time and wander through the gardens.  An enjoyable visit for all ages.  Do bring some water as it can be quite warm in the gardens. Do arrive early if possible to avoid the crowds and heat.  Plenty of walking in the heat so take your time.  There is a snack bar and restaurant on site.  We enjoyed the repurposed art work of Michelle Stitzlein who uses hoses, bottle caps, license plates and other materials to create her work,  \nPlenty of parking and shady rest spots.  While most ages will enjoy the site, it is probably more geared towards adults.",
  "My mom was visiting and I thought the Desert botanical garden would be nice, not were we dissappointed. It was the luminaries and it was so poorly lot my poor mom couldn't see where we was going. Then what we were able to see was all catcus.I have one star because they did have a little concert, that was the only decent part. I drove a long way and paid a lot of month-old never again.",
  "Despite the heat, I thoroughly enjoyed my visit here.  A vast array of flora across different zones, accompanied by fascinating facts and historical information.  It is a very relaxing outdoor space where you can spend quite a bit of time just taking it all in.  There is plenty of learning too, for all ages.  A great place to spend a few hours.",
  "Out of all the botanical gardens I have been to this is definitely the most beautiful one! I went during the middle of March for spring break and there were so many gorgeous blooms. It was very hot and sunny so pack some sunglasses and a hat. Lots of walking to do but you can probably get through it in about two to three hours if you are pressed for time and can still see the whole thing.  While I was there they had a traveling art exhibit of different colored animals statues throughout the garden that were awesome photo ops. All of the photos I took here came out stunning.  They also had a butterfly garden that was included with your admission that was full of beautiful butterflies. The gift shop was kind of pricy but had really cute and unique things to buy. Overall, I definitely recommend visiting if you are in the area because it is honestly so picturesque and will be your favorite photos from your entire vacation!",
  "Unfortunately, a business trip in February was the wrong time to visit.  No blooms, no butterflies,  just a lot of cactus.  I am sure it's beautiful in the spring with blooms, just save your time & money and don't go in February.",
  "We went on a Sunday morning mid March. I am not a real desert plant kind of person, but this was a wonderful destination! The layout is easy to follow with a main path and areas off of that. The map helps a lot! We encountered several docents along the way that would explain things. We enjoyed seeing all of the recycled plastic animals. Several shady areas, drinking fountains and a few snack bars. I’m not sure I’d want to go in the summer!\nThere is a lot of education in the plant markings and plaques."
 ]
},{
 "name": "Camelback Mountain",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b3/75/6b/20160615-093309-largejpg.jpg",
 "tags": [
  "hike",
  "walk",
  "hike",
  "hike",
  "hike",
  "walk",
  "kids",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d260028-Reviews-Camelback_Mountain-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is the most unusual hike I have been on.  Coming down was just as challenging as going up.  I enjoyed the hike as much as the view.  This is NOT a casual stroll up and down the mountain. Lots of climbing over rocks for 3/4 of the trail.  Big rocks.  Go early both because of the heat and it gets busy. Easier to move around on the rocks with less people.  Also when the parking lot fills they don't let anyone else enter.  We went at 730 and the parking lot was 1/2 full.  It took us the same time up and down 1 hour 15 minutes and we are 50 years old in moderate shape.  Not sure if I would take children if you fall on the rocks you could really get hurt on the other hand I am sure there are some little boys who would love it (maybe with a helmet).  Carry a light pack with water or just water, a big pack will just make it more difficult, you will probably need to use both hands.",
  "So let's face it, Camelback Mountain is one of the natural icons of Phoenix and all the locals know about it. But as an experience, I can think of other local hiking that is more enjoyable and this is why: 1) Camelback Mountain is so popular that it was recently closed down to expand the parking lot only to reopen and find that the expansion is no where close to meeting demand either (when my Dad came to visit a number of years ago we ended up parking in a strip mall over a mile away because it was the only safe parking area where we wouldn't get ticketed, but then we had a mile walk to and from the mountain); 2) Crowds make hiking less enjoyable. Now I like a good workout, but I don't use hiking as my workout. However, a lot of people on Camelback Mountain do just that and run repeated loops up and down the mountain with headphones on and little care for people around them. There is nothing less fun than trying to enjoy a leisurely hike on a beautiful day and having people breathe down your neck because they are timing themselves and are running rather than hiking up the mountain; and 3) Combination of natural hazards and idiots. Camelback is a steep climb with loose rock. You know it's a little crazy when they build hand rails into the rock to help people scale the slick rock. It's a hike to take seriously, especially if you are new to hiking, out of shape, or even just new to the area. Without fail, every year people fall, are injured, or worst of all plan so poorly with lack of water that they have to be rescued from the mountain by helicopter. If you are new to Phoenix and are visiting between April and October, bring plenty of sunscreen or a hat and water, water, water. You don't want to be the idiot on the local news that we all laugh at.\n\nBecause Camelback is iconic though and people will want to hike it - try to go during the week if at all possible. Holidays can also be good times to go to beat the crowds. When it comes to weekends, get there at dawn or have a plan to wait until parking becomes available. You will get ticketed if you park illegally.\n\nOther great urban hiking options include Piestewa Peak (this is probably second popular so it too has issues), North Mountain, Lookout Mountain, South Mountain, the McDowell Mountains. Depending on where you are staying there are plenty of other options as well from the Superstitions to Estrellas. South Mountain is a Phoenix city park and is the largest municipal park in the country. There are a number of trail options that make it a little easier to find some solitude and that would be my suggestion for hikes on weekends - find a place with multiple trails so that you can take the path less traveled.\n\n",
  "We hiked echo canyon on camelback with a group of 7 of us, including 2 children under 12 and 2 seniors in their 60’s. Everyone was able to do at least part of the hike but only 3 of our group (ages 9, 29, and 62) made it to the very top. The bathrooms at the bottom are the only bathrooms and the water fountain at the bottom is the only water so use both before you head up. The bathrooms are disgusting but too be expected from public washrooms in this type of setting I suppose. The water from the fountain wasn’t great either so I suggest bringing lots of your own. Wear good shoes as there is a lot of loose rocks that do make the trail rather slippery in places. The views of the city from the top are excellent but even if you only make it part way up the canyon you will see a lot of natural beauty. Bobby’s loop is a nice simpler hike for those who want a bit of a challenge but don’t want to go up the mountain too far. ",
  "Very steep trail, wear good shoes! Was there the day after New Years and the weather was perfect for such an adventure. It was cool at the start, warmed a bit when sun came out from behind some clouds. Be ready for crowds, some people are running this trail so be ready to let them pass. Amazing views on the summit - bring your best camera. I took Echo Canyon Trail and I would certainly recommend it.",
  "Difficult hike to the top if you go completely across the mountain. But, the views from the top are worth any effort and sweat. Take lots of water. A must-visit for a once.",
  "Had a great walk up part of Camelback, moderate difficulty.Beautiful views of the cities in the area",
  "We took this hike with our two kids and we all made it to the top! We definitely took our time and went early in the morning so it wasn't too hot. We had a overcast day which definitely helped. Also get there early to get parking. As we were going back down the mountain you could tell how many more people had arrived. It's not easy but the views at the top are definitely worth it!",
  "This is a very physical hike/climb but worth every step.  Don't be intimidated by the more agile or in shape people who are climbing next to you.  We say a large range of ages, shapes and sizes climbing the mountain.  Best advise is to dress appropriately, good shoes, plenty of water and go at your own pace.  It is worth the view and the sense of achievement in the end."
 ]
},{
 "name": "Heard Museum",
 "address": "2301 N Central Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/49/f8/6f/20190121-105651-largejpg.jpg",
 "tags": [
  "history",
  "delicious",
  "learn",
  "tour",
  "art",
  "learn",
  "history",
  "art",
  "tour",
  "family",
  "free",
  "learn",
  "tour",
  "art",
  "wander",
  "walking",
  "delicious",
  "knowledgeable",
  "free",
  "art",
  "learn",
  "eat",
  "art",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d116632-Reviews-Heard_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "As an educator, I love getting the inspiration and knowledge that this treasure chest of a museum offers.  And you can also get a delicious lunch or coffee in a beautiful 1920s outdoor setting. \nThis visit I loved the artistry of Hopi jewelry designer Verma Nequatewa, the history of ”Josef Albers in Mexico” and the very compelling and emotional “Away from Home: American Indian Boarding School Stories.” \nThank you to the museum store for having the book “Education for Extinction” so that I receive further knowledge. \nThis is always a museum that deserves your time! ",
  "View artifacts of the Navajo and Hopi nations as well as contemporary jewelry, pottery, blankets, etc. Be prepared to be awed by the Heard's remarkable collection of Kachina dolls. Stop by the Heard Museum Shop and take one home!",
  "We went to see the Frida Kahlo and Diego Rivera exhibition. It was fantastic,and certainly worth the trip.  The Heard Museum is an great place ton learn about Southwestern native culture,and related art. You get an inside look into the different American Indian Tribes, their diverse culture and their tradition.There is an amazing gift shop and lovely cafe.We will definitely go back again.We took nthe guided tour which gave us a better understanding of the displays.",
  "Wonderful exhibits and live show featuring native americans. The pottery, art, culture and history of the native american people are beautifully displayed. Don't miss the opportuity if you desire to learn about the early settlers of the region.",
  "Do take the museum tour.  Pay careful attention to the mural in the central exhibit room.  See the sculpture garden.  Definitely visit the museum shop, one of the very very best native american artist stores in the United States.  Superb blankets, jewelry, pots.  And have lunch in the excellent cafe.  Don't miss the bookshop.",
  "We visited the Heard Museum on a relatively quiet, midweek afternoon in March.  The entrance and courtyard are very calm and soothing and we sat and soaked it all in for a while, with a coffee from the coffee shop.\n\nThere is a 'Books and More' shop with books - obviously - post cards and other small items.  The official Museum shop across the courtyard is full of exquisitely presented crafts, jewellery, ceramics, weaving and more, really high quality goods; easily the most tasteful museum shop I have visited.  Of course, such craftsmanship and quality comes at a price, so don't go in expecting to pick up a bargain souvenir.\n\nLots of statues and garden art to look at before you even enter the Museum proper, including a memorial to those Native Americans who gave their lives during conflicts.\n\nOn entering the museum we opted not to take a guided tour (free) but to wander around at our own pace.  Some of the galleries were closed but the exhibition on Native Peoples in the Southwest was extensive and fascinating; we particularly liked the video presentations where members of tribes were interviewed about growing up, maintaining their culture and reclaiming aspects of their land use - it was both informative but also upsetting, to see how much has been lost.\n\nThe museum building itself is the original house of the Heard family (obviously extended) and its courtyards and rooms are cool and quiet.\n\nUpstairs there is an exhibit about the Indian Boarding Schools.  We read that this exhibition has been in place for a number of years and has relatively recently been enhanced by video recollections by people who either attended the schools themselves or who have close relatives who did.  \n\nThese videos were playing on a loop on small, wall-mounted screens located around the exhibition and were very moving. Of course the museum is in the position of remaining neutral and just presenting the facts, but I found the whole exhibition deeply upsetting, so outraged at the abuses heaped upon the Native American nation and their families and the attempts to erase the culture from the next generation.  In the end I had to suggest to my other half that we left.\n\nWe went back out to the courtyard and sat in the sun for a while.  The visit had rendered us both reflective and my other half commented that he wondered what action of our present culture future generations would be looking back upon with horror; it is as if humanity doesn't ever learn from its mistakes.\n\nThe Heard Museum certainly warrants a visit, in fact I would almost say it is a must.  We were both informed and moved and saw it as a good way to start our holiday in Arizona.",
  "We spent almost two hours walking thru this amazing museum.  All beautifully displayed with very descriptive signs posted nearby.  Also had lunch in the cafe.",
  "This is a great venue to visit, hold an event, and the catering was well presented and delicious! We enjoyed the networking space prior to the formal presentation. Afterward, Mr. Grann did a book signing and the venue was perfect for all phases of the night - before, during and after!",
  "We've been to museums highlighting Native Americans throughout the West. Few if any have the numbers of items that the Heard has. Most of the museums we've been to are mostly historical (i.e., highlighting the histories of the artifacts and the Native Americans who created them). The Heard does both. It has historical artifacts and artwork. And modern items made recently by Native Americans.\n\nWe were impressed by the displays. Got brain tired looking at all of them. Didn't have as much descriptive information as we would have liked. After a while a pot  is just a pot unless you have some additional context and background.\n\nBut well worth the visit.",
  "This museum provides information on the arts and culture of tribal nations of Arizona.  Free public tours with museum admission led by very  knowledgeable docents. So interesting to learn about the similarities and differences between these nations. Many, many baskets displayed as well as a very large Katsina display make one appreciate the artistry and skill of the makers. Pottery and jewelry displays as well. Most sobering was a special display describing attempts by the U.S. government to \"socialize\" Native Americans by removing their children from families and sending them to Indian Schools. In the context of today it seems unthinkable and cruel. Museum Shop offers fine art; boutique bookstore offers books and gifts for one and all. We did not eat at the cafe. A cantina offers quick snacks and drinks.  It was impossible for us to see and take it all in in one afternoon. I would definitely return. My only complaint is the lack of seating areas, as someone else has mentioned. The \"museum shuffle\" does take a toll.",
  "My father and I visited the museum because we both love Native American Art and Artifacts.  This was the perfect place!  The museum is beautiful, we took our time to visit, stopped at the museum shop which is full of items for purchase.  We also had a bite to eat at the cafe which again was great.  I can't wait to go back."
 ]
},{
 "name": "South Mountain Park",
 "address": "10919 S Central Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ba/2e/60/south-mountain-park.jpg",
 "tags": [
  "hike",
  "knowledgeable",
  "hike",
  "hike",
  "hike",
  "free",
  "hike",
  "hike",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d109772-Reviews-South_Mountain_Park-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "South Mountain is actually a City of Phoenix Park, but if you are thinking swings and seesaws you will be sorely disappointed. If, instead, you are seeking myriad hiking trails of varying challenges, astounding city views, true desert landscapes, and knowledgeable park rangers, then South Mountain is the place. Definitely stop at the Education Center to familiarize yourself with the various trails, speak to the caring and insightful rangers, and make sure to purchase water before heading out on a hike.\n\nIt will help if you have a car as many of the park roads can lead you to astounding views of Phoenix and beyond. Even the road up to the radio antennae is worth the effort.\n\nA visit to South Mountain proved to be a quintessential desert experience without needing to travel out of the city!",
  "This was our 5th return to a rented house, which is only 500 steps from this entrance to South Mountain Park located at the top of East Pima Canyon Rd. If you're coming from the north, take Baseline Rd to S 48th St or from the south, take Elliot Rd to S 48th St and then go to the top of E Pima Canyon Rd, where you'll find a parking lot and a covered picnic area.  \n\nIt's an easy 1.2 mile hike from the start of the National Trail to the concrete bench, where you can branch off to several longer and more difficult trails. At this point, take a break to inspect the remnants of a large stone dwelling and outhouse. The dwellings were built by the workers who carved out these trails as part of President Roosevelt's \"Make Work Program\" during the Depression of the 1930s.\n\nYou can branch out in several directions for more of a workout along the ridges, Beverly Canyon, Javelina, Pima Wash or take the easy way back down the National to the parking lot.  Many groups of very young school children do this hike. If you're really fit, continue on the National up to Fat Man's Pass or discover the gorgeous natural tunnel at Hidden Valley, then come back on the Mormon Trail. Along the way, keep a lookout for petroglyphs, amazing boulder formations, coyotes, road runners and javelinas (wild pigs).  Remember your camera and take water!",
  "I'm a local in Phoenix so I visit South Mountain every few weeks. I usually hike Holbert Trail which starts at the main entrance (Central Ave) and you make a left turn right after the gate. It is a moderately difficult trail that is steep and it took me a hour the first time to climb up. But now it takes me 30-40 minutes to climb up and 15-20 to get down. There is a trail extension that leads up to Dobbins Lookout which has amazing views of the city.\n\nFor non-hikers who still want to get a nice view, you can drive up to Dobbins Lookout. The main entrance is a Central Avenue, take south and keep going. There are signs that will help lead the way. I'd be wary of driving up on Sundays as they sometimes close the roads on Sundays for cyclists. Be sure to check Phoenix gov website for schedules.\n\nI highly recommend anyone visiting Phoenix to go up and see the views!",
  "South Mountain is a hop, skip, and jump from downtown Phoenix. Overall, the views were fascinating, especially as the clouds lifted from the distant mountains. It's worth a morning of hiking and scenic views of Phoenix and the surroundings. Bring your camera and click away at the colorful flowers along the trail, tall cacti, and spacious mountainous environment.  \nThe hike to the top was overall easy for me even though I had regular sneakers on, which I wouldn't recommend.  Bring your hiking shoes/boots, since the trail can be somewhat of a challenge (for those who have rarely hiked) due to rocks in the path, gullies, and somewhat steep inclines at times. Hiking shoes/boots would help with support and traction. Sorry I left mine home. Next time I'll have them on. \nBring PLENTY of WATER. You'll need it. Have fun hiking.",
  "There are trails for every hiker and the best part is it's all free. Take some good shoes, plenty of water, and download the map for the best experience. The trails start at different points within the park so review the maps prior to going. I recommend the Ranger Trail as it was pretty easy.",
  "We have hiked South Mountain several times now on two different trips to Phoenix.  We really enjoy it!  You can take an \"easy\" trail or go for the more challenging.  Parking can be challenging if entering on the East side but you can park in the neighborhood if need be and hike in.  This last trip was our most challenging hike, but also very satisfying,  We hike the three ridges to the left of the East entrance.  Awesome views and a good hike.  Hiking down and the west end was a bit challenging as you have to scramble over rocks and the trails is not easy there, but I did it and I'm afraid of edges!  We continued to hike over another ridge before returning on the bottom flat trail.  Pretty good exercise.  Bring lots of water as you don't even realize you are dehydrated.  We also brought a few snacks for a pick up during the hike.",
  "Just south of Phoenix is the park appropriately named South Mt.  The road to the top is curved, steep,and busy but worth the trip.  There are pull-outs that afford you the opportunity for taking pictures.  Once on top the entire valley is visible. There are benches to sit and take it all in and a rustic bathroom building.  Be sure to continue up to the towers area that faces to the south.  Totally a different view.  The one unbelievable pain was the two wheeled pedal bicycles.  I think they are crazy to go up the mountain in the first place and cause issues for cars both up and down.  The narrow road leaves you no choice but to wait in some places.  Two hints; go on a clear day and take binoculars.  We will go back for sure.",
  "Went of a trail combi hike (Ranger, Knee Bees & Pyramid). It was about 14 miles and took about 5 hours.\n1/2 of the trail is overcrowded, but the other half pretty good. \nBe aware of the heat though, it is scorching - bring extra water (and then some).",
  "I scattered my husband's ashes there 2 years ago and since then I've been back with grand kids hiking.They also have horses there that you can ride, that's our next agenda.It's really a neat place to visit.",
  "This is an awesome park with a lot of good, marked trails.  I hiked alone while my husband was at a convention in February & never had any trouble with terrain, trails, people, animals, etc.  I definitely recommend!",
  "South mountain 🏔 park is one of the largest municipal park in the state of Arizona. Every time I try to cover one state park and this time I tired covering the Holbert Trailhead which is a moderate to difficult one. It took about 1.5 hours from start till the end with a company of lots of people on the trail about 2.5 miles of track. On the way you can see variety of flora and fauna on the way. Operating time are from Wednesday to Sunday during winter from 9am to 1pm and Saturday it’s open till 6 pm. Carry Sunglasses, hat, tissue paper, enough waters and energy bars.. Look at the map before you start the trek as there aren't multiple sign board.. Do start early in the morning before to avoid direct sun\nCheck for program on smeec.org as there various winter programs for the timing and fees. "
 ]
},{
 "name": "Piestewa Peak",
 "address": "2701 East Squaw Peak Lane",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/63/6d/a1/photo1jpg.jpg",
 "tags": [
  "hike",
  "hike",
  "hike",
  "hike",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d1453703-Reviews-Piestewa_Peak-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "There are a number of hiking trails to choose from....none compare to the Piestewa Peak trail 300.  This is not easy but certainly worth every step.  It is very crowded and the rocky terrain is narrow in parts.  Ample places to stop to look at the views of Phoenix and Scottsdale. Wear solid shoes, bring water, and be prepared for a difficult and strenuous hike.",
  "This is a relatively new park just a few miles (10-15 minutes) from Mid town Phoenix.  Went on a sunday afternoon in March.  Pretty busy place with limited parking.  We parked along road just outside of entry gates.  They are in the process of building picnic areas.  There is no drinking water available, so bring your own .\nPlenty of challenging hiking trails.  \nWe hiked the summit trail which started just inside the park gate.  Hiked up for about 40 minutes up to one of the peaks.  Trail keeps going but we were short on time.\nTrail was moderately  diffucult and fairly steep at times.  Lots of jagged rocks to negotiate and some 18-24\" steps to climb.  Seemed harder coming down.  Very scenic with great views of Phoenix.  Lots of areas to stop and rest.  A very fun and challenging workout. \nSeems like it would be tough on a hot day.  No shade and just a few porta potties. ",
  "My husband and I are avid hikers and this is a great option when visiting the Scottsdale/ Phoenix area.  This is a great adventure for a group of friends or families also.  Keep in mind that it is still an outdoor activity so dress accordingly and come prepared.  I would not consider this a hard hike for most people but, that being said, there are some parts that are a little steep or require so pretty good step ups over rocks; it is by no means a flat trail.  We hiked around 8-9 in the morning and the temperature was great.  Plan on about 2 hours and bring a bottle or 2 of water.  Also, we were able to Uber from Old Town Scottsdale for about $10 making this an easily accessible hike from local areas.",
  "Drove up on a whim. Well-developed park in the midst of building improvements, with pavilions and restrooms. Thankfully no dogs allowed on the trails.",
  "This is a very difficult but rewarding hike. My 24-year-Old son is the only one to make it to the top, the rest of us skipped the last 2 legs due to the steep climb. \n\nGORGEOUS views, but the trail was so rough going down it took almost the same amount of time as going up so plan accordingly! This was our 3rd hike in 4 days and this was by far the most challenging descent.",
  "If you're looking for some great exercise, take time to hike Piestewa Peak.  There is a fair amount of parking availability and you will need it as Piestewa Peak is extremely busy, especially on beautiful days so get there early.\n\nThe hike itself is gradual and if you are in moderately good shape you should be able to do it with relatively no problems.  Just make sure to hydrate, hydrate, hydrate...especially if you are from out of town.\n\nThe views all along the way are fabulous and if you are like me you chat it up with fellow hikers along the way.  Enjoy!",
  "Great view once you get to the top! It is not an easy hike , although I feel it is easier than hiking the Camelback Mountain! There are stairs made in the rock most of the hike. It took us about 2 hours to get to the top with a few stops to relax. There are quite a few stone benches on the trail that also give you a great view while taking a break! The way coming back took us exactly 45 minutes. Make sure you get water with you , as well as a snack . I did not get any snacks and I got so hungry by the time I got up there...lesson learned. As you get closer to the top , there are parts you have to climb that are a little harder , so they have some handrails installed of you feel like need a little extra help. I have seen any ages hiking , from babies in their dad’s backpack to more elderly people. Once you get to the top , the view is amazing, bonus point if you stay to see the sunset. The temperature was a little cooler up there, so bring a jacket if you are not hiking in the summer. We also got to see some nice yellow flowers and a cute bird ...not sure it’s name though. I am local to Arizona ( for 12 years now ) and I am surprised I have not done this hike till now. Great experience!",
  "I was visiting AZ for the first time and wanted to check out an easy hike since I would be solo and this was it! I ended up running parts and stopped for many pictures. It took me roughly a bit over 2 hrs I think? Well maintained trail, great little loop with fantastic views. There is a fee to go into the park."
 ]
},{
 "name": "Hole in the Rock",
 "address": "Papago Park Van Buren St. and Galvin Pkway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/93/4c/eb/a-view-of-the-hole-in.jpg",
 "tags": [
  "walk",
  "hike",
  "hike",
  "adventurous",
  "kids",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d126770-Reviews-Hole_in_the_Rock-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was a good way to spend an hour when a few of us had some time, A good walk around in the sun and some great view. Head over if you have some time to spare and the photos you can get do look fantastic. ",
  "This was an incredibly easy climb to a hole with not much to look at.  Did it just to say \"I did it\" but I could have spent my time with other, more interesting hikes/places.",
  "We came to Phoenix to visit colleges with our son and stopped here to go for a hike. It was insane how busy this place was. Too many people for my liking! Easy hike and the rock is really cool. Climbed up on back side. Worth a visit since its considered a point of interest. Beware of bee's. There was a couple beehives and signs posted!",
  "This is an easy little hike, but that does NOT mean it poses no danger.  My wife and I thought we’d stop by here for a few minutes and go up to the hole.  Simple enough, not a bad view, but coming back down.....there’s a tiny rock face section - not steep at all - but even with being careful and going slow, somehow my right foot slipped and left foot ended up behind me.  Next thing I know two kind gentleman are helping me down the rest of the way with a torn patellar tendon and surgery the next day at the nearby emergency trauma center.  I’m in good shape, have hiked several “real” spots where you have to do a little climbing and have never had an injury before this.  So once you get to the actual hole where the rock face is, think twice before taking it too nonchalantly.  Just two days before that, a college kid had to be airlifted out after getting g a concussion falling into the hole.  Don’t know his story or how that happened, but it did.  So just beware!",
  "We were looking for an easy hike to take the kids (10, 8, 4) on before tackling large mountian like Camelback. The hike was awesome- an easy trail to follow with plenty of off shots for more adventurous climbers. We will definitely go again next time we come to AZ. Our oldest has her sights on climbing to the very top. "
 ]
},{
 "name": "Papago Park",
 "address": "625 N. Galvin Parkway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/5d/5f/ac/one-of-the-fishing-lakes.jpg",
 "tags": [
  "hike",
  "historic",
  "walking",
  "walk",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d127197-Reviews-Papago_Park-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great easy hike up to Hole in the Mountain or just go for a picnic and a stroll around the pond. Beautiful tropical feel and lots of bird life. Close to Zoo and aquarium so you can make a day of it. Great little place. Good parking!",
  "Papago Park is a municipal park that covers 1,496 acres in the cities of Phoenix and Tempe, Arizona. Designated as a Phoenix Point of Pride, it is notable for its many distinctive geological formations, its wide variety of typical desert plants and such popular attractions as the Desert Botanical Garden, the Phoenix Zoo and Hunt's Tomb, the pyramidal tomb of Arizona's first governor, George W.P. Hunt, which is listed on the National Register of Historic Places. It also features picnic areas, several small lakes, hiking trails, bicycle paths, a fire museum, baseball and softball fields and a golf course. At one time, it also included a bass fish hatchery. Perhaps the park's most distinctive elements are the giant saguaro cactus and the red sandstone formation known as Hole-in-the-Rock, a major landmark that was formed six to 15 million years ago. But the most interesting story relating to Papago Park  happened on December 23, 1944, when it was a POW camp and the site of the largest mass escape from any United States prison camp during World War II. Called the Great Papago Escape, 25 German prisoners escaped the camp using a 178-foot tunnel. But they quickly realized they were ill-equipped to cope with the landscape and climate of the Arizona desert and surrendered. The last prisoner was captured a month later.",
  "While visiting ion April my wife and I visited the grounds of Papago Park.  The park contains the Desert Botanical Gardens (a must see), Hunt's Tomb, the Phoenix Zoo, walking trails and picnic areas.",
  "We loved his park. We spent a lot of time hiking here on spring break. It is a beautiful are with a lot of nice trails on flat land or leading up the mountains. We can’t wait to go back some day. ",
  "We parked over by the zoo and walked around through this park and to the hole in the rock. If you go here on the weekends, make sure you get here early. Can get crowded. Hard to find a parking spot. Cute pond with lots of wildlife. birds, turtles, lizards and more! Great place to have a picnic. They have tables that you can use. Was a beautiful February day. Weather was perfect!",
  "We’ve been to Papago Park before and liked it. So while visiting Phoenix we went there again today. The Park is really neat. There are a number of ponds with walkways between them. High on a hill is a stone arch that one could walk through. We went to the Park and walked around a bit. In particular we enjoyed the ponds and the bird life attracted to the ponds.\n\nAs always, was a nice time. Will be back.",
  "This was a great starter hike. The views were amazing and it is very close to the zoo and botanical gardens. It can get busy at The Hole in The Rock, so be prepared for a crowd. ",
  "Papago Park has many great hiking trails and attractions like the Big and Little Buttes, Hole in the Rock, and Papago Amphitheater. If you are an outdoorsy type person, you will love this park located near ASU, Tempe Town Lake, and Old Town Scottsdale. If you decide to visit Papago Park, I recommend downloading and using the Avem app, it shows you exactly what is at the park and then how to find whatever you're interested in. This includes restrooms, drinking fountains, and shaded sitting areas."
 ]
},{
 "name": "Chase Field",
 "address": "401 E Jefferson St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/a7/8d/c9/a-seat-with-a-view.jpg",
 "tags": [
  "food",
  "drink",
  "food",
  "tour",
  "tour",
  "field",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d104041-Reviews-Chase_Field-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Even if your aren’t a baseball fan put this on the list of things to do \n\nGreat atmosphere, friendly environment and a beautiful stadium ",
  "We saw the Atlanta Braves vs. the Diamondbacks on a hot afternoon, it was 107 at least outside but inside it was beautiful.  The park has great views from just about anywhere and the food choices are plentiful.  Parking was easy to find and didn’t break the bank, great ballpark Phoenix!",
  "The domed stadium is air conditioned, there are food and drink vendors aplenty and overall, this is a great venue to go to a ball game. Located in downtown Phoenix, it is close to hotels and restaurants, etc. ",
  "Enjoyed watching my two favorite teams (Chicago Cube & AZ DBacks) play each other in middle of summer in an airconditioned facility that still feels like the outdoors.  Every seat seems to have good viewing & fans were polite.  ",
  "We got lucky and had a veteran tour guide who gave us a quality tour of the workings of the ballpark as we as the Diamondback story ... my wife originally was not keen on the tour idea but ended up liking it as much or more than me ... for $8, a bargain experience ... had a great experience talking with the young man before the tour who runs the MLB shop ... really good employees",
  "Great place to watch a game and have some fun with whoever you bring with you. So get together with some folks and get out there and enjoy.",
  "My husband and I took the tour of the field one afternoon, and we had a really good time. We were able to see the visiting team's locker room, the home team's dugout, and the Hall of Fame. The tour takes about an hour, and it was interesting learning about the inner workings of the stadium.",
  "Chase field is one of the nicest mlb stadiums I have visited.  My wife who is not a baseball fan enjoyed the experience- which says a lot!  "
 ]
},{
 "name": "Wrigley Mansion",
 "address": "2501 E Telewa Trl",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/8d/eb/b1/wrigley-mansion.jpg",
 "tags": [
  "tour",
  "tour",
  "tour",
  "knowledgeable",
  "walking",
  "hike",
  "family",
  "tour",
  "history",
  "eat",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d275846-Reviews-Wrigley_Mansion-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was outstanding!  We had the leisurely tour & dinner afterwards...great!  Excellent bar stock (single malts...yumm) & brunch afterwards.  Great!",
  "This tour was well worth the price.  Some very interesting info about Mr. Wrigley.  A wise businessman and certainly a doting husband.  This mansion was a gift for his wife, not to be confused with the Catalina or Chicago ones!  And loved the story about the player piano.  Would definitely recommend.",
  "We toured the museum, and it was very interesting. The guide was very knowledgeable, and very pleasant. The player piano was the highlight. The decor was so nice. It is well maintained and we really enjoyed our tour. They gave us some extra time to look around when the tour was finished. ",
  "This is a fun fact filled tour.  The Mansion is no longer owned by the Wrigley family, but there is so much history to share. Our guide did a great job of giving us a view into the life of the Wrigley's. Additionally, we learned a lot about the growth of the City itself.  It is a bit of a hike to the front door from the lower parking lot. The signage of where to enter, if you are walking up, was not very clear. You can valet, but we did not see it until we parked below.I would reccommend valet parking, if it is not too expensive.  ",
  "We traveled with friends to Scottsdale. Our friend researched interesting places to eat and found the Wrigley Mansion.  We enjoyed an elegant lunch with excellent food.  The waiter gave us a brief history of the Mansion which sits above the Biltmore Hotel.  If you want a relaxing lunch in style with some interesting history, don't miss the Wrigley Mansion."
 ]
},{
 "name": "Phoenix Art Museum",
 "address": "1625 N Central Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/b4/00/66/phoenix-art-museum-entrance.jpg",
 "tags": [
  "kids",
  "library",
  "art",
  "free",
  "art",
  "art",
  "free",
  "art",
  "creative",
  "free",
  "performance",
  "art",
  "art",
  "art",
  "food",
  "unique",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d104038-Reviews-Phoenix_Art_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Established in 1959, the Phoenix Art Museum is the largest art museum for visual art in the Southwest United States. Located at 1625 North Central Avenue, it has 285,000 square feet of space and displays international exhibitions alongside its comprehensive collection of more than 18,000 works of American, Asian, European, Latin American, Western American, modern and contemporary art and fashion design. The museum also features a 300-seat public theater, a research library, studio classroom facilities, a kids gallery, a museum store and a cafe. Not to mention the 40,0000-square-foot Bennett and Jacquie Dorrance Sculpture Garden. The art collection includes Claude Monet's Flowering Arches, painted at his home in Giverny, France, in 1913. Visitors can admire American paintings by Gilbert Stuart, Georgia O'Keeffe, Robert Henri, Sanford Gifford and Marsden Hartley, European paintings by Monet, Pablo Picasso, Ubertini, George Romney and Jean-Leon Gerome, contemporary art by Carlos Amorales and Yayoi Kusama and 20th century sculpture by Max Ernst, Hans Arp and Aristide Maillol. Another interesting feature is The Hub: The James K. Ballinger Interactive Gallery, an interactive space for children. Perhaps the most popular cultural attraction in the Phoenix metropolitan area, the Phoenix Art Museum has hosted more than 400 exhibitions from all over the world, grown its collection to more than 18,000 works of art and been visited by millions of people in the last 60 years.",
  "What a pleasant surprise! beautiful architecture and landscape design, the museum hosts a beautiful and representative permanent collection with pieces from all around the world and different periods, and the temporary exhibits were all amazing, I went there 3 times during my stay, it had so much to offer. The store is great too. Definitively my favorite cultural thing to do in Phoenix",
  "My son and I went to the museum on Saturday morning while he was here on a visit.  I had not been there before but was pleasantly surprised at its accessibility from the freeway and the ample free parking.  There is a $3 AAA discount for admission.  There are a wide variety artistic styles, media, time periods and geographic areas represented in the collection including a Monet and a few other big name Impressionists, a Stuart portrait of Washington.  There are interesting multimedia exhibits.  My favorite exhibit is the gallery of miniature rooms from all different furniture styles.  The level detail that is contained in these little rooms is incredible.  You can even see out the windows of the rooms into realistic outdoor scenes. Amazing!",
  "I love the Phoenix art museum. Check with your bank to see if they run a special offer to visit. When we went they had black butterflies in 3D that sweep from  reception into the museum.  Which looked stunning",
  "I've been through the museum twice now; the second time as fun and insightful as the first visit. Going and revisiting Phoenix's permanent collections and discovering the new traveling exhibits it provides is exciting for me. I went late last year and got to see the Zodiac heads exhibition, and currently they are exhibiting Michelangelo's sketches (among other new features).\n\nThe collected art are both for the casual and refined tastes, with plenty of mixed styles and eras of work. I appreciate the fact that they have both local pieces, supporting a lot of local artists, and international works. The atmosphere was nice, there's plenty of room for strolling, and benches for rest/observances. Maricopa college students get in for free, others get similar discounts, and there's a whole weekly schedule if you want discounts or free parking. I'd recommend going on late evenings, or weekends, if you'd like to avoid the school trips that go there on tours.",
  "Great value art vs. $10 admission.  Free parking easy in/out just North of downtown on Central AVe.  About 2 hours to see it all.  Hard to follow the photo policy:  OK for museum owned art, NO for \"on loan\" pieces; look for camera w slash logo to be sure.  Not just a strong showing of Western Art, but had the depth of a major city's premier art museum.  If you have a creative brain cell, you will be stimulated.",
  "The collection of cars in the Legend of Speed exhibit was absolutely stunning. The cars selected were appropriate and whoever put the collection together knows what they were doing. They were technically innovative, beautifully preserved or restored, and attractively displayed. Ferrari, Ford, Maserati, Lancia, Alfa Romeo, all the best performance car manufacturers (if there was a Porsche, I forgot). And the Miller race car was amazing in both its innovation and execution. The original Franklin desert racer in its original condition was an unexpected pleasure to see. If you missed the exhibit, get the book. It is every bit as impressive as the actual exhibit. It is titled, predictably, Legends of Speed. There are two books with that title, look for the blue Scarab on the cover - the most beautiful front-engined sports car ever made.",
  "The motorcar racing vehicle display was great, the Ansel Adams exhibit was fabulous,the Western Art extensive and the inter-active \"Fireflies\" Kasura was a delightful addition. So, even though the museum is in some state of upheaval  due to previous poor management in the recent past, it was a very good trip and worthwhile",
  "It has been a few years since I was at the Art Museum and I forgot how good it is.  Leaving, my friend asked me what was best.  I replied that I was reminded of how broadly the word Art can be defined.  We saw the art of shapes and colours defined by the need for speed, by the amazing firefly exhibit, by the art of Pissaro and Ed Mell and of course the photos of Ansel Adams.  In short it was a wonderful 2 hours.",
  "I enjoyed this museum immensely, the gift shop is one of the best museum shops I've visited, including unique things like a put together yourself cardboard camera to enjoy yourself or share with children.  The only critical comment that I would agree with is that the layout could be confusing.  However there are helpful pleasant staff everywhere to point you to where you want to go.  Yes, it's smaller than  some museums but also larger than others.  The staff along with the exhibits made the experience well above my expectations.   On entering the museum I asked about a tree planted outside and the woman apologized and said she  was not familiar with the name. About twenty mins later she tracked me down, told me the name, the spelling and a brief summary.   I was looking a display of tires and a guard asked what I thought, we and several other visitors had an interesting chat about \"street art\" vs \"graffiti\".  He recommended an area to visit to see some examples of \"street art\" and I enjoyed the side trip which I would never have seen.   I was peering into the Kusama's infinity mirror room and a guard offered to take me in and out, again several people joined us and enjoyed her insight into the exhibit and artist.   I spent longer at the museum than I had anticipated and ended up having a late lunch at the Palette Restaurant. The food was great, the service accommodating and prompt, the location relaxing.",
  "We stopped at the Phoenix Art Museum to see yhe Ansel Adams photo exhibit.  That , of course, was great.  But, there is always something unanticipated.  They had an exhibition of race cars as art. Cool! Plus there were their usual exhibits of European and American paintings"
 ]
},{
 "name": "Echo Canyon Trail and Recreation Area",
 "address": "5700 North Echo Canyon Parkway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/0b/e6/98/mummy-mountain.jpg",
 "tags": [
  "hike",
  "free",
  "hike",
  "hike",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d563415-Reviews-Echo_Canyon_Trail_and_Recreation_Area-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was one of the most challenging/difficult hikes I’ve ever done, but it was totally worth it.  Go early before it gets hot and make sure you have plenty of water.  Needed both hands at times, so bring a backpack to put your water in, or a camelback.  Need good hiking shoes that have good grips on the bottom. Highly recommended if you’re an avid hiker. Not for beginners. ",
  "The Echo Canyon trail to the top of Camelback mountain is gorgeous, busy and not for the couch potato. Wear hiking shoes, bring plenty of water, phone service is good all the way to the top. Did I say bring plenty of water.  Don't bring your dog; just too crowded not to mention I think it's prohibited these days. The 360 degree view from the top is wonderful. Some spots require you to scramble up rock faces. There are spots where you can lose your way; watch the signs. ",
  "Climbing Camel Back Mtn on the Echo Canyon Trail was a very cool experience!!  It is more of a climb than a hike but worth the effort.  Go early in the day to beat the heat and the congested parking situation.  Definitely bring enough water and expect to get a great workout!!!   ",
  "Echo Canyon Trail is one of the two popular trails that will get you on the Camelback Mountain. We hiked here on the last weekend of February, when the weather got up to 27C (80F) which meant we needed way more time than anticipated to complete this trail. The trailhead is well marked, there’s facilities incl. water fountains (there are plenty of bees in this area!), and free parking. The trail goes steeply up and up, the terrain is rocky; there are a couple of spots where you may have to be on all fours or hold on to fencing/ railing or whatever you can find to hoist yourself up there. It was quite fun actually, however, with the beaming sun and hot weather, it turned out to be difficult for hubby (bigger guy, we also lacked in form after winter). We ended up taking many breaks and all in all it took us 90 mins to get to the top. Plenty of people on the trail, but it was a Saturday morning and a beautiful day. Saw plenty of beautiful plants including cacti, and many big lizards. The views are very rewarding throughout the trail. The way down from the mountain took us another hour, mainly because we were taking our time to ensure we don’t fall on the big boulders. Total time 2.5 hours, and a challenging but very doable beautiful trail. Highly recommended! Take more water than you think you’ll need, and good hiking boots.",
  "This is a double black diamond trail and it's labeled as such for good reason. While it's easily accessible in the Phoenix/Scottsdale area, it's not a simple climb. This is not a clean trail hike. You probably should have hiking shoes and expect to be climbing using all fours at times along the trail. At the top of Camelback you get some very nice views of the metropolitan area, but it's not the most nature-intense hike you'll ever take. Nonetheless, reaching the summit will feel like a great accomplishment and you can trek down the Cholla trail, if you want to get a ride back to your car or hotel. ",
  "For a middle aged American carrying a couple extra pounds, this was a great workout. Hiking soon turns into rock climbing and after an hour you have reached the top.",
  "Very nice free parking area with restrooms. A box of bananas and warnings gave us the clue that this hike was not for the casual stroller. Things started out gradual with a slightly inclined sandy trail but soon it moved to a staircase and then it became more of a bouldering exercise navigating up a rock face - some times there was a metal railing to grip on to. There are a few views prior to the trail getting really steep but it was a lot more intense than any of us expected despite the number of warnings. Still, a beautiful place to go and try out your endurance. ",
  "Wouldn't call tooking the trail as hiking. It was more like rock climbing. But owerall great experience with co-workers. At the top of the mountain great views to the city. Wear appropriate clothing and shoes. Also gloves helps a lot, especially when returning."
 ]
},{
 "name": "Phoenix Zoo",
 "address": "455 N Galvin Pkwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/1c/36/94/phoenix-zoo.jpg",
 "tags": [
  "walk",
  "tour",
  "walking",
  "family",
  "family",
  "walk",
  "walk",
  "kids",
  "walking",
  "walk",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d127047-Reviews-Phoenix_Zoo-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "I was very surprised at this desert zoo. The exhibits were very nice. Love the Savanna right as you walk in. Fantastic giraffe feeding station. Well worth the visit.",
  "The Phoenix Zoo, opened in 1962 and founded by Robert Maytag, a member of the Maytag family of dishwasher fame, is the largest privately owned, non-profit zoo in the United States. The 125-acre complex, located at 455 North Galvin Parkway in Papago Park, has over 1,400 animals on display and contains 2.5 miles of walking trails. It is divided into four main themed areas or trails: the Arizona Trail which focuses on American Southwest flora and fauna; the Africa Trail which features animals from Africa; the Tropics Trail which focuses on residents of the rain forests; and the Children's Trail, which also includes a petting zoo. The zoo also includes a sanctuary to care for animals that are endangered or unwanted. It expanded has expanded several times since the 1970s, adding new exhibits, landscaping features and visitor amenities. Most recently, two Komodo dragons were brought to the zoo and a new orangutan exhibit opened to the public. Specialty attractions include more than 30 cownose rays and southern stingrays in a 15,000-gallon touch tank that allows visitors to touch the rays, a Safari Train that provides a nonstop guided tour of the zoo, camel rides, a giraffe encounter and an endangered species carousel. The zoo also is home to three Asian elephants, one a former performer in  a circus. The Africa Trail showcases many of the most popular animals in the world, including African painted dogs, a baboon, ostrich, gazelle, white rhino, zebras, lions, giraffes and cheetahs.",
  "What a fantastic zoo. I want to write a review because of some of the more neutral/negative reviews. The Phoenix zoo might be one of the best zoos we’ve ever visited. We saw so many animals, many of which looked happy and healthy and were roaming around for us to see. Compared to other zoos we have visited, the enclosures were very nice, clean, and spacious for the animals. I thought that the cost of the ticket was very reasonable considering all of the animals that we saw. It was actually cheaper than other zoos we have visited! Our family loved the petting zoo and being able to brush a goat, the monkey village and getting to be up close and personal with the primates, and getting to see the zoo keeper feed the giant desert tortoise. \n\nWe don’t live in the area, but if we did, we would definitely get a family membership. ",
  "I've been visiting this zoo since 1963 - and I love how it has grown and evolved.  My husband and I have been members for years, as we live just a few miles away. There have been several new exhibits built in the last few years with lots of variety as you move through desert, tropical  and exotic exhibits.  What I especially love about the zoo are the special events.  They make it easy for corporations and private parties to host events, and they have a number of regular community events as well.   My husband and I were married at the zoo and had one of the most beautiful and amazing weddings and receptions ever!\n\nWatch out for peak times - holidays and weekend (especially during cool weather!) and allow plenty of time for parking.  It's worth the walk!  Lots of places to grab a bite (no indoor dining except for special events).  Bring sunscreen and a hat all year around.  ",
  "The Phoenix Zoo is overall a good zoo. Make sure to check the hours in summer as they are limited due to the heat. One of the highlights for most is monkey village where the monkeys will walk on ropes right over you. The otter feeding is another attraction that gains much interest. You can easily combine the zoo with the Botannical Gardens or other attractions in Papago Park area, ",
  "Get there early or the lines are crazy long with difficult parking. A few kid play areas but nothing special or memorable about the zoo.",
  "What a terrific way to spend a day and there are sooo many animals! This zoo has everything from farm animals to Elephants. Monkeys to flamingos. There were babies to Granddads walking and  visiting each and every display. There were plenty of places to stop and rest and zoo help to help you find what you were looking for. The tigers were very large (and lazy on this sunny, warm day. This is a great way to spend a day...with or without kids. This is for everyone.",
  "The Zoo is pretty sizeable (125 acres), and it takes quite a while to walk through it.  The collection and display of the animals is pretty impressive.  There is a great walk-through aviary.  The signage of the animal exhibits is excellent.\n\nLet me explain my average rating in the next three paragraphs.\n\nI expected a sizeable admission fee since the upkeep costs of the facility must be enormus.  But, I expected a map upon entry to the Zoo.  However, unlike the Arizona-Sonora Desert Museum and the nearby Desert Botanical Garden, the Zoo does not provide even one sheet of a photocopied map.  When I asked about that, I was told that there were Zoo maps scattered throughout.  Yes, there were, but for the lack of an individual map, I have marked my rating down a notch.\n\nWhen you are ready to leave the Zoo, you must exit throught the Gift Shop.  What a great marketing strategy, of course.  However, with multiple strollers trying to get throught, this is not a very efficient exit.  In fact, it was a mess.  The Zoo is, again, marked down for this.\n\nThirsty?  You better bring your own drinks.  A bottle of water or a cok will cost you $3.69.  Up the road, at the Desert Botanical Garden, they are a more reasonable $2.00.  This is price gouging to a \"captive\" group.  In fact, this reminds me of Disneyland prices.  Marked down for this.",
  "Been here a lot and have never regretted the trip.  Take you time and go as often as you can they have great events and are always fun to visit.",
  "We were not thrilled with our visit to the Phoenix Zoo. Upon arriving on a weekday, we found the parking lot very full. No ADA parking was available. Tickets were costly for admission and while most zoos and museums offer a person with a significant mobility impairment a complimentary pass for their caregiver who is necessary for them to access the space, we were told that the Phoenix Zoo only provides a complimentary caregiver pass to guests who have zoo memberships. Considering the size of any zoo and the terrain changing from paved to dirt and many hills to navigate it is not something a wheelchair dependent person is likely able to do without bringing someone to assist them. \n\nMany of the exhibits had obstructed views for our family member who uses a wheelchair. \n\nADA issues aside, it was an okay zoo with a lot of animals that were up and about while we were there. They did seem to have a Shoe Bill Stork but it was really far away and not in an area where guests could view it closer.",
  "We loved the giraffes the best.  Lots of opportunity for viewing and picture taking.  It was a hot day and many animals were not visible, probably in the shade somewhere.  I have only ever been to one other zoo in my life and that was the Calgary Zoo in Alberta Canada.  The Phoenix Zoo is very nice but the Calgary Zoo is much better.  Way more animals.  Not enough room to park at Phoenix Zoo.  We were there about 1 PM on a Monday and parking lot was full.  "
 ]
},{
 "name": "Children’s Museum of Phoenix",
 "address": "215 N 7th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ad/94/05/photo6jpg.jpg",
 "tags": [
  "walk",
  "kids",
  "structure",
  "kids",
  "kids",
  "structure",
  "family",
  "kids",
  "structure",
  "food",
  "art",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d1537397-Reviews-Children_s_Museum_of_Phoenix-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took our two toddlers here during our visit to Phoenix. We all had a great time. There’s a 3 story play structure when you first walk in that kids and adults alike love to explore. It’s like a McDonald’s playland x 1 million! Lots of offshoots and various routes for all to explore. All very safe of course. We then moved onto the various stations they have set up over 3 floors. This included a great arts and crafts area stocked with dozens of different items to help your little one create their masterpiece. Even the mirrors in the main floor bathrooms were cool! You’ll have to take a look as it’s hard to explain! ",
  "Love this place. we visit once or twice a year when visiting relatives in AZ and the kids look forward to it each time -formative memories here. love it",
  "The museum has 3 floors (levels) of things for the grandkids to play with. This is an interactive experience for the kids. The play structure will require you to crawl in some places while climbing. The noodle forest is also a favorite along with the pretend grocery store. Kids can paint here and do arts and crafts. I usually just let them play.",
  "I take the grandkids (ages 3 and 5) here nearly every time we visit in Phoenix and they never seem to tire of it. (We purchased the annual family pass.) There's usually something new in the mix, but they never seem to tire of the permanent features either (like the gigantic climbing structure, the pretend grocery store). There's a snack bar where a limited selection of foods is offered -- or bring your own snacks and sit out on the steps. There's an art room that rotates different D-I-Y projects for little ones and their adults to do together. (Aprons are provided, but wear clothes that they can paint in!) There are often special offerings which may or may not require additional registration (art or food making projects) and some special events like SNOW DAYS when snow is trucked in and dumped in the fenced yard. There's a gift shop, of course, with kid-friendly options -- you may want to hustle the kids past that. A separate room for \"under 4 yrs of age\" -- can be a good place to let the littler ones cool down and do some quiet play.",
  "We enjoyed the children's museum but found it better for younger children.  My daughter was 8 and she loved the climbing structure near the entrance and the arts & crafts room.  The other activities were a bit young for her.  Great facility for young children!"
 ]
},{
 "name": "Dobbins Lookout",
 "address": "North Summit Road South Mountain Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/35/61/e4/photo1jpg.jpg",
 "tags": [
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d10168854-Reviews-Dobbins_Lookout-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Do the hike to Dobbins Lookout.  It's worth is and you'll be rewarded at the top with good views of the city.  If you drive, it's just an old rock shell of a building with views.  ",
  "What a cool place. The drive up to the top was great and the view of the greater Phoenix area spectacular! Has a visitor area that has some good historical information and helpful rangers that gave us some great information on hiking trails in the park and which is appropriate for skill level. We took the Kiwanis trail which was easy-moderate and really saw some breathtaking scenery on the way up and down Southern Mountain.",
  "We thought maybe we could see a good sunset by visiting here.  The road is very winding with 15-25 mile speeds.  Very busy with bicycles and cars.  We had driven the Apache trail and felt this was more busy and curvy.  We ended up leaving after some viewing and photos.  Too busy, too hazy to see a good sunset and didn't feel it would be safe to drive those curves in the dark!  Glad we did it, but won't be trying it again! ",
  "We enjoyed our visit to Dobbins Lookout so much. Reflecting on our four days in Phoenix we easily decided this was our favorite. It was an easy drive to the top, be on the lookout for bicyclists. A couple scenic lookouts on the way up to the main lookout. Trails available too. (There is a place to use the bathroom at the top). Highly recommend!!",
  "I made the trip to Dobbins Lookout on my own and really enjoyed myself. The drive up was gorgeous, and following the speed limits was easy due to the sharp curves and turns. I did get stuck behind two separate bicyclists heading up, and finding a straightaway to pass them required patience. Once I made it to the top the cool wind and gorgeous span of desert and mountains gave me quite a lovely greeting. Since my husband has just gotten out of the hospital after surgery on a ruptured quad-patellar tendon from a hike, I stayed off the trails and just enjoyed the view from the point and stone lookout house. Glad I went but really sad my husband had to miss out. The ride down was easy but I pitied the long lines of cars stuck behind more cyclists. If you’re in there are, definitely go!"
 ]
},{
 "name": "Mystery Castle",
 "address": "800 E Mineral Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/5f/af/73/the-entrance.jpg",
 "tags": [
  "structure",
  "unique",
  "kids",
  "tour",
  "practical",
  "tour",
  "family",
  "unique",
  "knowledgeable",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d141819-Reviews-Mystery_Castle-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "When traveling, my wife and I are always alert to strange or unique or one-of-a-kind attractions. Like Mystery Castle in Phoenix, Arizona. Located at 800 East Mineral Road, in the foothills of South Mountain Park, it was built in the 1930s by Boyce Luther Gulley for his daughter Mary Lou Gulley. Constructed with a wide range of materials from stone, adobe, automobile parts, salvaged rail tracks from a mine and telephone poles and held together by an unconventional combination of mortar, cement, calcium and goat milk, the sprawling 18-room, three-story castle contains a chapel, cantina, BBQ pit and even a dungeon. Parts of the structure remain unfinished and modern conveniences such as electricity and plumbing weren't added until 1992. In 1948, Life magazine brought notoriety to the castle with a story describing how a young girl ruled over a Fairy Tale Dream House in the Arizona desert. It included a photograph of Mary Lou Gulley posing atop the cantilever staircase leading to the roof of the house. After the story was printed, Mary Lou and her mother began offering tours of the house. Today, Mystery Castle isn't so much a mystery as it once was, before the housing boom encroached close to the castle and its grounds, making it less isolated. Mary Lou Gulley died in 2010. The property is now maintained by the Mystery Castle Foundation, a non-profit organization. It has been designated as a Phoenix Point of Pride, well worth a visit.",
  "We came here, knowing very little about what to expect, and had a great time!\nGuides are very knowledgable.\nI won't talk about the Castle itself because I won't do it justice.\n\nJust some practical points.\nYou join into a group whenever you arrive and do a circular tour and leave when you get back to where you started (so you don't have to arrive at a particular tour time).  \n\nSome outdoor areas are HOT mid-day, but you can buy water or soda at a very reasonable price at the gift shop.\n\nSome of the younger kids looked a bit listless, but the adults had plenty of questions.  There is a lot to Look At but most things are Do Not Touch, for preservation purposes. \n\nThere is a porta-potty out front and it is surprisingly clean.  NO public toilets inside.\n\nNot great if you have significant mobility issues, there are stairs and uneven surfaces--part of the charm of the building.",
  "We heard of the mystery castle through people we met at our resort. This was the most interesting place to visit and see just how it was built and to see and hear of all the things that were in it. Over 8,000 sq ft, the most intriguing place, not expensive to tour. Takes about 1 hour 15 minutes to see. ",
  "We were looking for something to fill in some time. I gave my husband some choices and this is what he chose. So glad he did! This castle is phenomenal. So different from anything we have seen before. Our guide was great, full of information. A definite plus to our road trip.",
  "This is an interesting place. There is a good story and the guide was informative and enthusiastic. It was fairly inexpensive and quick.  I don’t need to visit again, but I’m glad I visited once. ",
  "I expected this castle to be unique and it did not disappoint on that. Basically, a man fled his family (due to TB) and came to the hot dry climate of Phoenix for a cure. Having no money (and living in isolation) he started to build his home from salvaged and recycled material. He continued to build one quirky place after another until he built a Castle for his daughter. That part I understand. \nI wonder ... Why?  When she inherited in her early 20’s there was no electricity or water so why stay. She actually lived there 60 years until passing in 2010. \nEclectic decoration makes you wonder ... Why?  ",
  "This is one of those \"lower tier\" tours that is a super value at $10 a head.  The story of the builder and the unique result of his efforts are well worth the price.  Our docent was knowledgeable and personable.  A definite stop to please you.",
  "Who knew that, after driving thru the vast somewhat anonymous south Phoenix suburbs you’d find a castle that is this distinct. That was built by a father with tuberculosis to fulfill his daughter’s dreams. That was built entirely by hand using found, used, and rejected materials. That still only partially has plumbing and electricity. That is literally the definition of ‘man made.’  Or ‘labor of love.’ It’s amazing to be looking out over the vastness of Phoenix from a place where every surface is covered in a mosaic of river rock, glass, tiles, and other desert objects. Where Saguaro furniture is next to huge native baskets and fine German porcelain dishes. And around every corner is another story. The docents who lead the tours are wonderful and loaded with stories and seem to be just as amazed by what they are showing you as you are seeing it. And they clearly excited because they know the next surprise that’s around the corner. You have to take the time to see the Mystery Castle when you’re in Phoenix."
 ]
},{
 "name": "Hall of Flame Museum of Firefighting",
 "address": "6101 E van Buren St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/ca/76/b3/piston-fire-engine.jpg",
 "tags": [
  "historic",
  "family",
  "tour",
  "knowledgeable",
  "kids",
  "learn",
  "history",
  "tour",
  "historic",
  "family",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d127090-Reviews-Hall_of_Flame_Museum_of_Firefighting-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have avoided going there for years on our trips to Phoenix thinking that it wouldn't  have much of interest, but we were really wrong. We spent over three hours there today looking and and learning about historic fire trucks and the story of firefighting, and we were really intrigued by everything we saw.  They had hand-pulled and horse-pulled fire trucks going back to 1725, and up to really modern ones. They had a very special truck from the 9/11 attack which had been restored, and several others of historical note.  We loved the video about a family that found and lovingly restored an old 1902 steam fire engine, and we saw a beautifully restored one in the museum.  In short,  this place is a treasure and really worth a visit.",
  "This is an amazing collection of firefighting equipment and other artifacts, including horse drawn pumping equipment dating from the 1700s and 1800s, as well as a large number of motorized fire trucks from different eras.  All the collection items are in excellent condition and well displayed.  Visitors are given a binder with detailed information on all the major exhibits to take with them during their tour, and the museum staff is very knowledgeable as well. A very interesting museum!",
  "It was an enjoyable place to spend a couple of hours.  We especially liked the massive display of fire department arm patches.  We used the index to find departments of interest to us.  Also it was fun to see the many fire trucks of all ages.  We'd recommend watching the video.",
  "Our friends were in town for Spring Training games and wanted to see the museum.  He is helping to restore a fire engine in California and found the displays to very interesting and helpful.\nIt is not a \"knock your socks off kind of place\" but there is much to see and it is not crowded so go at your own pace!",
  "There are six gallerys in the museum so be sure to allow 2 - 3 hours if you want to really absorb all they have. Fire fighting equipment from 1725 to 1961 including men or horse drawn wagons, motorized trucks, interesting helmet display, and a memorial to fallen fire fighters.",
  "I saw this entry in the guidebooks and was interested, so I stopped by after the Heard Museum.  This is a volunteer museum, so the exhibits do not have the polish of the Heard, but the work and love of the volunteers make up for it.  This museum has one of the most complete collections of firefighting equipment I have seen.  It also has collections of fire fighting equipment, and fire marks which is and overlooked area.  As a former fire insurance underwriter I was impressed over the collection and the information.  It is also a great place to take the kids.  It gives one a greater appreciation of firefighters and the dangers of their job.",
  "Loved this museum dedicated to the history of American heros, our fire fighters. This museum is absolutely packed with fire trucks from years gone by. All are in beautiful condition. The self guided, self explanatory tour is easy to follow and extremely informative. The size of the museum is overwhelming. There is even a children's section. There is a superb gift shop which has some really neat things as well. The staff  are very friendly and helpful. If you ever wanted to be a fireman as a kid or just want to see an amazing tribute to a noble profession and learn something on the way, I highly recommend visiting the museum if you're in the area. Or, if you are a local and haven’t visited yet, then shame on you!",
  "We have avoided going there for years on our trips to Phoenix thinking that it wouldn't  have much of interest, but we were really wrong. We spent over three hours there today looking and and learning about historic fire trucks and the story of firefighting, and we were really intrigued by everything we saw.  They had hand-pulled and horse-pulled fire trucks going back to 1725, and up to really modern ones. They had a very special truck from the 9/11 attack which had been restored, and several others of historical note.  We loved the video about a family that found and lovingly restored an old 1902 steam fire engine, and we saw a beautifully restored one in the museum.  In short,  this place is a treasure and really worth a visit.",
  "Huge fire fighting museum representing very early fire fight equipment through modern times from various states and several foreign countries.  Very well laid out with a carry along loose leaf binder explaining each exhibit. They even have trucks and equipment from the 9-11 World Trade Center. Great place to visit and will be back again.",
  "This museum is a tremendous collection of fire engines, helmets, 9/11 memorabilia, etc. The equipment dates back to the 1700's from Europe. It is extremely well organized by years. A book is offered to give extra information about each piece. I really enjoyed the film about the start of the Smoke Jumpers. There was a children's play area that was really nice. It only costs $8 for Seniors. What a bargain! I want to go back and see some things we didn't have time for.",
  "This museum far exceeded my expectations!  It is an amazing collection of fire fighting through the years.  I frankly expected to get bored long before my companions but we didn’t leave until closing and I found myself wishing for more time.  It is so worth a visit and a great place for families to check out. There are some videos about smoke jumpers etc which I thoroughly liked as well."
 ]
},{
 "name": "Phoenix Mountain Preserve",
 "address": "1431 E Dunlap Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/55/00/b1/trail-100.jpg",
 "tags": [
  "hike",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d146667-Reviews-Phoenix_Mountain_Preserve-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Glad that I stayed at a nearby resort as I was attending course in the resort.\nAble to go for multiple desert hiking trails here in the late afternoon.\nAble to see many birds and rabbits.\n\nA great spectacular view if you hike up to the radio station.",
  "Had myself a great hiking day, amazing weather so needed plenty of water. I did trail #8 which also had an \"a\" and a \"b\" which lead to great views of the city to the west of the mountains.  One thing to remember at this time of the year, when the sun goes down, it's dark and cools off very quickly so be prepared. I was blessed with a Supermoon that night which lit the last mile of trail, so cool!",
  "A large mountain area located in central/north central Phoenix, this park is ideal for virtually anyone looking to take a hike/walk in natural desert areas. A multitude of trails go throughout the area, so you can choose how far and how much undulation/elevation you want to take in.\n\nParking may be challenging on Saturdays when \"weekend warriors\" often flock here, but that is usually not an issue on other days (especially Monday - Friday). Arriving between 5 am and 7 am is also usually ok for finding parking space even on Saturdays.\n\nA number of trails are relatively flat but moderate undulating trails frequent the Dreamy Draw area.  North Mountain and Shaw Butte are also relatively moderate elevation hikes. The most difficult is the Piestewa Peak summit trail but that particular park also has many other side trails with much less elevation.",
  "The Quartz Ridge hike was only one hour, and we really enjoyed it. The path was covered with fist sized rocks. The elevation change was just under 200’, so could be a challenge. Lots of hikers, but not crowded. Very limited parking. The local mall has signs that say they tow hikers’ cars.  Luckily our rental was still there upon our return.\nI quite enjoyed the hike!",
  "We did the 304 trail and it was a easy enough trail. Having just come into Phoenix, we did Camelback yesterday so I was a little stiff and sore but wanted to take in some trails. The 304 was perfect. ",
  "We chose a trail near a neighborhood and walked up and down hills and across flat terrain for 2.5 miles. We saw beautiful trees and cacti, many birds, lizards, and a desert rat. ",
  "Fairly easy hike around Piestewa Peak. Takes about 2 hours. Some City views and some of distant mountains.",
  "A large mountain area located in central/north central Phoenix, this park is ideal for virtually anyone looking to take a hike/walk in natural desert areas. A multitude of trails go throughout the area, so you can choose how far and how much undulation/elevation you want to take in.\n\nParking may be challenging on Saturdays when \"weekend warriors\" often flock here, but that is usually not an issue on other days (especially Monday - Friday). Arriving between 5 am and 7 am is also usually ok for finding parking space even on Saturdays.\n\nA number of trails are relatively flat but moderate undulating trails frequent the Dreamy Draw area.  North Mountain and Shaw Butte are also relatively moderate elevation hikes. The most difficult is the Piestewa Peak summit trail but that particular park also has many other side trails with much less elevation."
 ]
},{
 "name": "Pueblo Grande Museum",
 "address": "4619 E Washington St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/7f/da/a3/house.jpg",
 "tags": [
  "history",
  "walk",
  "learn",
  "knowledgeable",
  "free",
  "kids",
  "tour",
  "learn",
  "history",
  "tour",
  "walking",
  "history",
  "kids",
  "walk",
  "art",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d109183-Reviews-Pueblo_Grande_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum and archaeological park is in the midst of the City of Phoenix (close by is the airport). It is an interesting and informative exhibit for all ages, about the life Hohokam people from AD 950 to AD 1450. The museum has indoor exhibits and an outside archaeological village which you follow through pathways. It’s so interesting to see how life was so many years ago. As one exhibit expressed - the Hohokam lived among the mountains surrounding Phoenix, that still exist today. It takes about 1-2 hours to absorb the museum and well worth the time for a step back into history..",
  "Although a small archaeological site compared to most others in the Southwest, Pueblo Grande Museum has great exhibits both indoors and outside. Learn about the lives of the ancient people who built some of the canals the city of Phoenix still uses today. Friendly and knowledgeable staff, a great indoor exhibit, and a short outdoor trail through an ancient Hohokam garden, ballcourt, and pithouses, one of them set up with artifacts inside. \nVery close to the airport, the museum is a perfect stop if your plane is delayed, or you have an hour or two to spare before your flight. Just don't walk the outdoor trail in the summer. ",
  "Pueblo Grande Museum is located on a 1,500 year old archaeological site once inhabited by the Ancestral Sonoran Desert people, archaeologically referred to as the Hohokam culture. It is easily accessible by the Sky Train and the Light Rail and there is a large parking lot with free parking. The museum is open 7 days a week October through April, and closed Sundays and Mondays, May through September.  Admission is $6 for adults, $5 for seniors, $3 for children over 6.\n\nThe outdoor 2/3 mile trail is a self-guided tour that takes you through a prehistoric Hohokam archaeological village site with a partially excavated platform mound, ballcourt, and replicated prehistoric houses. The Hohokam built canals for irrigation that are still in use today. \n\nThere are three galleries inside the Museum. The main gallery displays artifacts of the Hohokam and discusses the Pueblo Grande village site. The children’s hands-on gallery has activities to help kids learn about the science of archaeology. And the changing gallery features exhibits on various topics from archaeology, southwest cultures, and Arizona history. There is also a small museum store.",
  "Many of the artifacts in this museum were discovered underground when the area was being excavated for the Phoenix airport, and were preserved in the museum.  The museum shows the amazing ingenuity and creativity of the local native population who learned how to live in the desert by building canals and irrigation systems hundreds of years ago.  They give you a greater appreciate of the Native people who have come before and preserved this land for the current inhabitants.",
  "We enjoyed the walking tour and the museum. It was interesting to read the theories purported by the archaeologists and then connect them to what we saw. Sometimes we could see the potential connections and others we disagreed with. This is a great place to spend an hour or so if you find the history of the previous inhabitants intriguing.",
  "Even if you aren’t a first time visitor to the valley of the sun, you should put this small but extremely interesting museum on your to do list.  The museum is run by the City of Phoenix and is just blocks from sky harbor airport. The Hohoham people have been in the valley and this particular spot since 400 AD. That’s right. They built the first system of canals to irrigate crops, and lived a community life that traded from Mexico and California to Texas and Colorado. Simply amazing. Kids will enjoy the exhibits inside that explain all facets of life. And adults will be astonished by the remain of the mound on the grounds. Don’t miss this. ",
  "The outside area is the best. Very interesting walk around the ruins takes about 30 minutes.  Inside has a review with art a facts. Plenty of parking and $6 for adults.",
  "This is in part a exhibit of remaining structures from a village perhaps 1,000 years old, along with a small museum about what scientists currently think their lives might have been like.  You walk through the multi-level structures outside  There is a lot of good information.."
 ]
},{
 "name": "The Rosson House Museum",
 "address": "139 N 6th St Heritage Square",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/dd/9a/1d/exterior.jpg",
 "tags": [
  "tour",
  "history",
  "kids",
  "family",
  "tour",
  "knowledgeable",
  "tour",
  "history",
  "walk",
  "tour",
  "kids",
  "history",
  "tour",
  "knowledgeable",
  "tour",
  "tour",
  "walking",
  "knowledgeable",
  "tour",
  "knowledgeable",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d563438-Reviews-The_Rosson_House_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a beautiful Victorian house, the history of the house and all the rooms shown by the tour guide were excellent, it was very interesting.  I love these old houses, everyone should go and visit this Museum.",
  "Liz was very knowledgeable, engaging tour guide during our morning visit to Heritage Square and Rosson House; beautiful examples of dressing and daily living, enjoyable conversation.  If you enjoy touring fine examples of period architecture and the accompanying family stories/history, this is one you should take.  Roughly an hour guided tour of the house ($8-10 adults) then take a leisurely stroll through neighboring cottages. One is where kits to handcraft items can be observed or purchased-a great teaching visit for kids. Many early 1900s skills are displayed here and it's quite educational.\n\nMy photo is of doctor office in Rosson home, example of early medical tools and anatomy chart.",
  "Very reasonably priced, interesting tour of the Rosson House. The guide was amusing and interesting, and had lots of information about the history and restoration of the house. Tours every hour, on the hour.",
  "Get a pass to walk though the house and have lunch in the Square, always a pleasure to walk through and see it decorated for the seasonal celebrations. ",
  "We enjoyed a tour of Rosson House, named after the first mayor of Phoenix.  Meticulously restored to as close to original as possible.  Not handicapped accessible so be prepared to do stairs up the porch and up to 2nd floor.  One hour guided tour.",
  "I was glad we decided to take a tour of the Rosson House Museum at Heritage Square in Phoenix.  It had a great story to tell of life in the 1800s in Phoenix.  Our tour guide was exceptionally knowledgeable and able to answer all questions quite nicely.  After answering the questions she took it just a step further adding more information from the guest's question.  We were in a large group and sometimes it was difficult to get a good look at what the tour docent was talking about.  We had to hang back just a bit to get a good look.  The docent handled the larger group quite well.  There are a lot of steps which might be difficult for those who have problems climbing or going down stairs.  Kids who like history would enjoy this tour.",
  "The tour really adds meaning to what you are seeing outside and inside the restored original victorian home ... Tour guide did a super job pointing out interesting facts and items during the tour ... Well worth the price .... Very nice area",
  "Interesting historical house, beautiful and well restored. Interesting features to this Victorian house accommodates for the dessert climate.",
  "I was walking around downtown Phoenix and found an antique car show at Heritage Square.  While there I did the self guided tour of the first floor.  The staff on duty were very knowledgeable and willing to talk as long, or as short, as I wanted.  I nice attraction that I just happened to stumble upon.",
  "I enjoyed the tour of the house and was happy to see some things I have not seen before from that time period including the Gib doors and a medical anatomy board. The tour guide was very knowledgeable and friendly. It took about 45 min. They go on the hour so if you time it right, you can find one hour parking on the street next to the house for $1.50. You can not park longer than an hour though.",
  "This is a beautiful space! Unfortunately I was there when they were closed, but simply walking the grounds and enjoying the landscape was worthwhile. "
 ]
},{
 "name": "Wells Fargo Museum",
 "address": "145 W Adams St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/9a/be/fe/authentic-wf-stagecoach.jpg",
 "tags": [
  "history",
  "art",
  "history",
  "free",
  "learn",
  "free",
  "free",
  "free",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d546062-Reviews-Wells_Fargo_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whatever your opinion of Wells-Fargo now, no one can dispute its role in American history, particularly the history of the West.  This museum is a hidden--and free-gem--that relates company's history to the westward movement from the gold rush to modern times via the Pony Express and the stage coach.  Static displays, both individual items and complete setting are augmented by videos.  A wonderful way to spend a few hours away from the heat.",
  "This little museum is a treasure.  It contains a real stagecoach, guns,  office equipment (working telegraphs & telephones included) & safes,  old photos & signage,  original works of western art.  Its history of the west in its truest form,  Who other than Wells Fargo was there for it all !!  There are several interactive exhibits,  for children young & old.  There's short video stories of Wells Fargo as well as the Pony Express.  Admission is Free. Its both fun & informative.  You can expect to spend a good hour here.",
  "This is an awesome museum in the heart of downtown Phoenix. We visited this past October with our adult son, and 12 year old grandson. They both seemed to enjoy it as much as we did. You can learn all about how stage coaches were used, play with a telegraph machine, and have your image imprinted on a dollar bill. It's an amazing little museum, operated by employees of Wells Fargo. And, did I mention, it is FREE. Yep, the cost is nada!! Best bargain of the day. There is a little gift shop where you can purchase everything from fools gold to a pricy replica of a stage coach. All in all, it's worth your time.",
  "This museum has some great artifacts and memorabilia from the real Old West- including one of the signature stage coaches like the ones used by Wells Fargo in the past.  It's a small museum, but well worth a visit.",
  "I was not planning on going but I had lots of free time in downtown Phoenix and as I was wondering around I saw the sign so I decided to pop in.\n\nI was immediately greeted by a friendly docent who gave me some tips on features of the museum.\n\nThe museum had very interesting and diverse displays. I ended up spending about 45 minutes there and left with a much better understanding of the old west to say the least. It's certainly worth a visit if you are in downtown Phoenix.",
  "We enjoyed our visit to this charming museum that would be especially appropriate for children. There was enough displays to make it worth your while, but was not overwhelming. The free price of admission can't be beat.",
  "Not only was it easy to find, the parking was just across the street! The museum is all on one level and so very interesting! The artifacts, film, and art displays were great! If you find the Mexican coin, you will get a prize!\nAn added bonus is the Orpheum Theater (only open on certain days) 1/2 block away and the Police Museum about 1 block away.  All in all, a good day!!",
  "Our family of 5 spent  1 1/2 hrs here and enjoyed this place so very much.  Thank you for having wonderful staff on board who enjoy the exhibit as much as we did!"
 ]
},{
 "name": "Arizona Science Center",
 "address": "600 E Washington St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/ad/39/0a/filename-asc-building.jpg",
 "tags": [
  "knowledgeable",
  "free",
  "kids",
  "tour",
  "learn",
  "kids",
  "creative",
  "art",
  "nature",
  "family",
  "kids",
  "food",
  "tour",
  "history",
  "family",
  "kids",
  "kids",
  "kids",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d127070-Reviews-Arizona_Science_Center-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I went to the Arizona Science Center during the week while visiting Scottsdale the beginning of February. It is part of the the Association of Science and Technology Centers (ASTC). When you get a membership at a museum that is part of this, you get free general admission to any of them all over the 50 states and around the world. It's a great deal especially if you're traveling all over the 50 states like my wife and I are. \n\nOK, back to the review of the ASC. This museum is different and in a great way! It's mainly geared at kids, but there are exhibits and programs for adults too. If you're a kid at heart (like I am) you'll find this place amazing. Most of the exhibits are hands on and will grab your child's attention while actually teaching them something. One thing I've seen from some of the museums we've visited is the exhibits are static. Even I lose interest quickly with some of these. When they are hands on, you get to learn no matter what age you are. \n\nOn the first floor there's a huge area that explores all facets of the human body. There's an awesome display of the brain, which sections control what aspects of our body, etc. There's different 4 sections to explain the brain and each have questions with buttons that will light up the section(s) of the brain that would be used for the answer....so you can guess the answer and validate yourself immediately. There a brilliant display of the human body with four distinct areas of concentration and a simulated fluoroscope that you can pass up and down the body to identify things like the names of bones, the sections of the circulatory system, the digestive system and the nervous system. \n\nThe second floor was more geared toward technology. I specifically loved the display of the little robots on the screen. As you walked in the room and the camera caught you, they'd all turn around and wave. They'd interact with you based on what you are doing. It was pretty cool. There's also exhibits on computers and ham radios. It would be awesome if they had a station that allowed the kids to do some actual programming. My grandsons are doing this at home with a program (the name slips my mind at the moment) where they enter key words and control the movements of a little robot. \n\nThe 4th floor (i'll come back to the 3rd floor...my favorite) is small, but goes through a lot on the environment, power sources and bugs...even some live ones. The woman with the bugs was awesome and very knowledgeable about the bugs in AZ and the displays (even the live Madagascar Hissing Cockroaches).\n\nAs I said, the 3rd floor was my favorite. Part of this floor deals with the environment and the impacts on the earth. The main thing I enjoyed here was a 5 minute video presentation on natural forces on the planet covering lightning, wildfires, tornadoes, hurricanes, etc.  OK, sounds boring....it's anything but! There's a stage you stand on with 3 monitors in a circle, all playing the same video, AND there are effects! Big heat lamps so you can feel the wildfires and volcano, big base speakers under the stage, called butt kickers that help with the section on earthquakes and others, and a shower system so you can experience the rain from hurricanes and the storms that Arizona can experience. It was THE coolest exhibit I've seen so far in the museums we've visited! According to Chevy, who was this awesome woman giving a group of adults a tour of the exhibit, they are talking of expanding this to be bigger.....I hope they do.\n\nAll in all, just the general admission price is worth it. They also have other special exhibits, the planetarium and 3D movies that will cost extra though. Your kids will have fun and most likely learn a few things along the way. Even this retiree who is a kid at heart had a blast. If my grand kids live in the area, I'd definitely bring them here. And thanks to Chevy and all the people working there who made this enjoyable.",
  "This giant center is located in the Heritage Square area (aka Heritage and Science Center) , downtown Phoenix.\n\nThe idea to built a science center and keep it running so successfully for over thirty years by now is simply brilliant.  Arizona Science Center offers hundreds of hands-on exhibits, provides various educational programs for all ages and in many fields (physics, natural sciences, creative art, etc). Its multi-media programs, IMAX Theater  are fantastic. The Center is equipped with all modern technology, it also has a very attractive gift shop, service facilities, lunchrooms.\n\nWhen I was there, school buses picking up kids after visiting the center - everybody looked very happy and excited.\n\nA separate building Create at Arizona Science Center is a great idea for those who like to try a real hands-on creative experience in designing.\n\n",
  "SHORT REVIEW: *THIS IS A MUST-SEE MUSEUM*\n\nLONG REVIEW:\n\nI first went to the Arizona Science Center many years ago with my family. My little brother was a lot younger then, and my parents thought it would be a great place for him to hang out, and play with other kids, whilst in an educational environment.\n\nWe all were happily surprised, as there were also a lot of fun activities for adults too.\n\nI decided to check it out again this week, and see what's new, including the \"Pompeii The Experience\" exhibit before it leaves Phoenix.\n\nARIZONA SCIENCE CENTER & THE EXPERIENCE \n\nLocated in Heritage and Science Park in the heart of downtown Phoenix, the Arizona Science Center, a nonprofit corporation, plays host to 350 permanent hands-on exhibits, while providing interactive experiences to the 400,000 annual visitors every year.\n\nThe front desk has a very helpful and friendly staff. There were a lot of various packages depending on how long you want to stay and what you want to see. I decided on the day pass, and added the IMAX Wild Africa 3D, the Grand Tour of the Solar System, and of course, the Pompeii exhibit.\n\nAside from its permanent exhibits that earns it national attention every single year, the center has also featured a number of national traveling exhibitions and demonstrations. The current traveling exhibit is the Pompeii exhibit, which was very interesting. \n\nIn addition to its science center functionalities, the facility also hosts daily demonstrations in the Dorrance Planetarium, as well as their five-story, giant screen IMAX Theater. I enjoyed both.\n\nThe 45 minute Wild Africa 3D IMAX show was pretty predictable, basically just a National Geographic show; but it was cute and definitely great for kids too.\n\nBut the highlight was the Grand Tour of the Solar System, in the Dorrance Planetarium, hosted by astrophysicist and comedian, James. It was a very interactive, great for adults and kids; just a lot of great fun. At the end, there's a very cool \"space roller coaster\" show.\n\nDuring the summer, the center includes educational programs and hands-on science activities for visitors of all ages, plus a summer science camp, Adult's Night Out thematic events, preschool programs, and a Science on Wheels outreach program.\n\nPERMANENT EXHIBITIONS\n\nSome of the most notable residents of this Phoenix science center include: Many Hands Make a Home, an architectural exhibit about building in Arizona; My Digital World, an information technology exhibit; Get Charged Up, a gravity experimentation exhibit; Solarville, a visual and interactive astrological exhibit; and Forces of Nature, a multi-screened motion floor theater experience.\n\nARIZONA SCIENCE CENTER  (THEN & NOW)\n\nThe Arizona Science Center, previously known as the Arizona Museum of Science & Technology, was created in 1980 by the Junior League of Phoenix. \n\nTurned into a nonprofit in 1982, the center officially opened its doors to the public in 1984 with only 10,000 square feet of space. \n\nExperiencing tremendous success, with more than 87,000 visitors that first year, many of this first exhibits are still in the center today.\n\nBy 1988, the City of Phoenix awarded more than $33 million in disbursements for the center to move and establish a bigger, more grandeur home.\n\nConstruction began in 1997, with additional classrooms added in 1998.\n\nSince then, the center has grown to become one of Phoenix's most popular cultural attractions, serving more than 3 million patrons since opening the new downtown facility in 1997. \n\nThe facility today includes 40,000 square feet of gallery space, the theater, planetarium, multimedia classrooms, gift shops, food services, and lunch rooms.\n\nAs a futuristic science center, the actual architecture of the new facility reflects the nonprofit's commitment to abstract innovation. \n\nThe building blends influences drawn from geological events with urban design elements. \n\nA silhouette and horizon merge with the phenomena of light, water, reflection, and mirage that is designed to awe and inspire visitors.\n\nCONCLUSION\n\nI absolutely adored the Arizona Science Center, especially the Dorrance Planetarium. \n\nDefinitely consider visiting the Arizona Science Center the next time you're in town.\n\n5/5 RECOMMEND \n\nOF NOTE\n\n*The best parking is in the garage across the street.",
  "We  brought some out-of-country guests here to show them a \"science center.\"  My family had never been here before.  \n\nWhat I did not like right off the bat was that the entrance procedure was poorly designed.  We had purchased our tickets online and thought we could just proceed to get our tickets scanned at the entrance and quickly get in. Not so. We stood in a line which funneled into the same line that was for people purchasing tickets on the spot.  Even so, the procedure took much longer than needed and I realized the problem: the printed tickets did not have a smart code that could be scanned.  Also, a wrist band needed to be placed on each individual by a staff member.  Our time in line took 30 minutes.\n\nThe Arizona Science Center turned out to be much more of a learning center for children.  Don't get me wrong; we made the most of it, and being young at heart we enthusiastically engaged ourselves with the exhibits.  We had just expected this place to have a lot more in-depth, scientific displays on the history of scientific research in Arizona and perhaps the U.S. I'm not sure why we had this preconceived notion, but we did.\n\nAnyway, we ended up having a fun time, and it seemed as if our foreign guests did as well.",
  "Great for kids! Basic information about great things-weather, the human body, physics. Hands on to the max for kids.",
  "We generally are not attracted to science museums because they are typically oriented to kids-  and running over with kids!-  but this one has a lot of exhibits which appeal to everyone.  We particularly enjoyed a couple of the IMAX type shows on dinosaurs and rain forests-   really comfortable theater and well-priced movies, and we thought the current exhibition of Victoria the T-Rex was really well done and very interesting.   I hope we'll be able to include more visits to the Science Center on subsequent visits to Phoenix.",
  "Our family went specifically to see Victoria the T-Rex. She does not disappoint. That exhibit was phenomenal. (full disclosure... I am a huge dinosaur nerd) We arrived just before noon on a school day and at first were worried we had made a mistake as there were many school buses in the lot but all those kids left within an hour and none of those groups were in the special exhibit area. While it did require an extra ticket to view Victoria the T-Rex, it is worth every penny if you have even a passing interest in dinosaurs. The space is very accommodating for anyone using a wheelchair, elevators are easy to find and exhibits are made with space so everyone can access them. They even had an exhibit with two wheelchairs set up for a racing game and in all my years it was a first to see wheelchair use normalized in the kids area and encouraged kids to explore the use of a chair. Most of the museum seemed geared more towards elementary school age kids but our group of adults all had fun playing with the interactive spaces.",
  "Went as a chaperone with my grandsons third grade class. Place was out of control. A thousand kids running around like it was a playground . My grandson was done looking at things in one hour. Had the most fun throwing plastic balls around in the water area. I thought, at least I would get to see the T-Rex fossil. Nope, it cost extra. I’ve seen lots better in other cities."
 ]
},{
 "name": "Castles N' Coasters",
 "address": "9445 N Metro Pkwy E",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/17/b0/a9/photo6jpg.jpg",
 "tags": [
  "cheap",
  "kids",
  "kids",
  "family",
  "kids",
  "kids",
  "eat",
  "family",
  "food",
  "eat",
  "food",
  "daring"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d127164-Reviews-Castles_N_Coasters-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  " This place has 4 golf courses, a huge arcade, and the amusement park with many rides. My only complaint is there are no multi-golf passes. It would have been nice to try a few of their courses but I was too cheap to pay full price for each round. Beware - there are only 4-6 rides for kids under 40 inches. They are only 1/2 price but they also may feel left out. Rides are long so you definitely feel like you're getting a good deal! We'd love to spend a day here again if ever back in Phoenix.",
  "I've been coming here since the 1970s when I lived in Phoenix, and we visit every time we come back to Arizona. By far the best minigolf place I've been to. The courses are well maintained and there are four good ones to choose from. The arcade inside has a great variety of games. Bumper boats are also fun. It can get pricey, but really, it's just a lot of fun for the whole family, and even my adult kids ask if we can go when visiting.",
  "Took two teenagers there for something to do for the day and ended up enjoying it myself. The prices are good and they had much more to do than I expected. Had fun on all the rides, playing in the arcade, the miniature golf course, and even did the obstacle course and zip line which was terrifying and thrilling at the same time. The staff were friendly and helpful. Nice place to take kids and teens.",
  "I had never been to castles and coasters however, I had an opportunity through work for private party from 9 a.m. to 1 p.m. So I grabbed my nephew and we were off to castles and coasters.\n\nI wasn't sure what to expect when we arrived but I went in with an open mind and thought I would give Castles and Coasters a chance.  I am so glad I did.\n\nMy nephew and I spent a full day at castles and coasters and had a great time. The mini golf courses are very nice. These courses are fun, well maintained, and nicely laid out.  In fact,  all of the rides at Castles and Coasters are well maintained and a lot of fun. The park wasn't that crowded even after the special engagement hours ended.   We were able to go on the rides many times and didn't wait very long in line.\n\nCastles and Coasters  is bigger than it appears from the outside.  There are several rides in the back of the park so make sure you venture in that direction.  I think the most popular activity was thevzip line and the rope bridge out front. The line moved a bit slow but its worth the wait.\n\nGood rides, reasonable prices, and a helpful and accommodating staff.  It doesn't get much better.",
  "We had such a good time with this putt putt course. There are 4 courses and if you do not let your ball go in the 18th hole, you can do all four but after two sets, we were tired of it. It is clever and not as easy as it looks! The coasters were not going today as it was a cooler day but that made it great for golfing! This is a definite must for adults as well as smaller children....it is fun for everyone. Give it a try!",
  "We took our son and daughter here April 25th as part of a work retreat. The rides were all open and the lines were shot because it was a private party. The kids went on every ride except the Skydive, zip line and obstacle course. The obstacle course looked like a lot of fun but the kids were too timid to try it. They loved the coasters and bumper cars as well as driving the bumper boats. The arcade was just alright. If you golf, go early or in the evening as it's very hot! The only downside was the food selection- nothing but pizza, hot dogs, nachos and a really gross chicken sandwich. If you take a break and go eat nearby then this is a great family day location! Castles & Coasters- how about some salads or fresh fruit options so those who are feeling queazy have a greasy choice?",
  "Such a disappointment. Expensive... dirty, old and felt very unsafe. Pictures must be originals. Disrespectful people swearing, blowing smoke rings at my 7 & 9 yr old. And the worst part isTripadvisors... who we trust ....  had great reviews.  Wow..",
  "1. Went to the bathroom, started taking a poop only to realize no toilet paper. Then I thought I'll sneak out and get some paper towel. Nope, air dryers only. I did the best I could with toilet water only to find the sink was broken. I couldn't even wash my hands nor dry my ass. I got the manager and made sure I shook his hand before telling him my story. He shrugged his shoulders and offered nothing other than an apology. I'm guessing these workers want $15 also just like the fast food places that can't seem to remember to put napkins in the bag.\n2. Son wanted grilled cheese sandwich. Nope, out. Then he got cheeseburger and wouldn't eat it because it tasted funny. \n3. ATM broken\n4. Multiple games broken, no sign, just have to guess what works and what doesn't\n5. Pricing combinations of tickets are asinine.\n6. Parking spots are so skinny if you don't have a tiny compact car, you can barely open your door.",
  "Find you inner child and scream your lungs out on the roller coaster.  You will do a loop-de-loop on the coaster and lose your mind.  The facility is clean with plenty of parking.",
  "Ride operation for the place sucks and terrible about having respect for anybody but them slefs if you go to castles and coasters it's not worth almost $36 so don't go unless you want bad customer service at the rides I can't say names who has the worst of respect to anybody.unless they say sorry about that they will only get one star that's it. \n                Far well and goodbye",
  "Safe but some what daring rides. Great room with lots of video games. Worth the entrance just for the video games. Slightly overpriced but really cool at night."
 ]
},{
 "name": "Cholla Trail",
 "address": "Cholla Lane Camelback Mountain",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/fe/13/52/cholla-trail.jpg",
 "tags": [
  "hike",
  "drink",
  "walk",
  "walking",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d4043987-Reviews-Cholla_Trail-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very difficult hike, my short legs couldn’t get over many of the rocks/boulders. Dangerous at times. Didn’t make it to the top, but got a great workout in. Don’t go when it’s warm. Take water and snacks and good grip shoes. ",
  "Fun and challenging trail due to its steep incline while negotiating rocks and boulders the entire route. The quick rise allows great views of the region. Must be able to climb and occasionally pull yourself over large boulders. Great city and mountain views at peak. The boulders make initial descent difficult.  Surprised at how many older ( ages in 60’s maybe early 70’s) managed the trail. Many stopped short of the summit but a few went all the way. Crowds at top may diminish the desired tranquility many are seeking but most people were respectful.  Brought a liter and a half to drink on a day with temps in low 70’s and finished it all. 2 liters a very good idea. Took me 3 hours round trip with 20-30 min rest at top.  Not used to such hikes then allow 4 hours and rest often.  Top shape people run it and make it round trip in a little over an hour.",
  "And very easy. Very desert. Cholla Mountain is pretty. Do on a nice sunny day. Easy walk. Can do 5-7 miles all easy walking. Bring water and snack. ",
  "I’ve now hiked to summit of Camelback mountain from both trails. The Cholla trail is a nice gradual hike for first 30/45 minutes but second half of trail is downright dangerous for novice hikers.  That is where it gets its reputation as the easy hike to Camelback peak. After that midpoint, it requires significant climbing and purposeful hand and foot holds to navigate. It was not always enjoyable.  I strongly encourage novice/casual hikers to consider the Echo Canyon trail as your first option for reaching the summit. Yes it has a single demanding leg where the assistance of a handrail is required but it does not have any of the steep cliff edges the second half of the Cholla trail has. Yes it has demanding rock climbing but at no point do you confront the same level of dangerous cliff edges as the Cholla trail. I would like to see the safety/rescue statistics for each trail to make a complete judgement; but, imho as a regular hiker not advanced or expert by any means, you have a much better chance of reaching the peak and not turning around/abandoning your hike on the Echo Canyon side. I’m just saying.",
  "This is a double black diamond climb. This 1/2 is more of a hike but then it gets hard very quickly.  Take plenty of water and if you are a male over 225lbs, you better be in good shape as this is a very hard climb.  "
 ]
},{
 "name": "The Phoenix Theatre Company",
 "address": "100 E McDowell Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/ef/76/ce/phoenix-theatre-photo.jpg",
 "tags": [
  "music",
  "theatre",
  "delicious",
  "performance",
  "performance",
  "free",
  "music",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d1143908-Reviews-The_Phoenix_Theatre_Company-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "Ten of us attended the Million Dollar Quartet show and loved the intimate theater where all of the seats are fabulous!! We were close to the stage and felt like were part of the cast.....enjoyed the story, music and cast that were all extremely energetic!! Parking was easy, no traffic getting in/out and nice bar set up. Will definitely go back.",
  "The Phoenix Theatre offers performances by professional and local talent! We've seen several plays that have been excellent, including Godspell, West Side Story, and recently, ELF. The casting is superb, because every cast member appears to be a perfect fit! Everyone at the theatre is welcoming and helpful. There are four theatres located within that one location for your convenience. While you are there, be sure to arrive early so you can take advantage of their delicious on sight bar and restaurant. I give 5 stars for both the theatre and for the restaurant. Interested in some cool trivia about the theatre? Look for the framed letter and photograph from Steven Spielberg. When Steven was 17 yrs old, he was looking for a theater to debut his first film - and it was this little jewel in the desert that hosted it!",
  "There was a mix up with the performance and the ticket manager went out of his way to help us.  He found two tickets to the afternoon performance for us and West Side Story was an incredible performance.  \n\nWe will definitely return to this venue.",
  "We went to see Million Dollar Quartet because we saw this production on a cruise ship a few years ago and LOVED it. These guys had great voices BUT the performance was only average compared to the one we saw on the cruise. I was VERY disappointed that we were not allowed to take any photos even without flash. You would think they would want the free advertisement!",
  "Ten of us attended the Million Dollar Quartet show and loved the intimate theater where all of the seats are fabulous!! We were close to the stage and felt like were part of the cast.....enjoyed the story, music and cast that were all extremely energetic!! Parking was easy, no traffic getting in/out and nice bar set up. Will definitely go back.",
  "We saw Americano! here. It's a local production based on a local youth who found out that he was not in the U.S. legally. The show was great. The venue was beautiful. Bar and restaurant on premises. Ample parking. All seats at the Mainstage (the theater itself) are good seats. Friendly staff too.",
  "We saw ‘The Million Dollar Quartet’, which was outstanding.  But any production viewed in this small, classy venue would be great!",
  "We purchased tickets to see the Sound of Music while we were visiting from out town for Thanksgiving. Our 11 year old son loved it! The afternoon matinee was at a perfect time to grab a snack in the lobby restaurant/ bar prior to the show.  The theater is small so every seat was fabulous.  The show was exceptional! \nThere was a lovely woman who greeted us upon arrival and made us feel very welcomed. A definite must do while in Phoenix. "
 ]
},{
 "name": "St. Mary's Basilica",
 "address": "231 N. 3rd Street, at Monroe Street Downtown",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/b3/ac/5d/st-mary-s-basilica-in.jpg",
 "tags": [
  "historic",
  "structure",
  "music",
  "historic",
  "family",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d524692-Reviews-St_Mary_s_Basilica-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "St. Mary's Basilica in Phoenix, Arizona, or officially known as The Church of the Immaculate Conception of the Blessed Virgin Mary, was dedicated in 1915 and listed on the National Register of Historic Places in 1978. Located at 231 North 3rd Street, at Monroe Street, it is the oldest Roman Catholic parish church in metropolitan Phoenix and is significant for several reasons, which is why so many locals and tourists visit the Mission Revival-Spanish Colonial Revival structure with four domes, of all denominations. It is home  to Arizona's largest stained glass windows collection and a 26 rank pipe organ built by the Schantz Organ Company. In 1987, Pope John Paul II visited St. Mary's and addressed crowds of thousands from the balcony on the facade, two years after elevating the church to the rank of a minor basilica, the only one in Arizona. The principal symbols of its status as a basilica, the Tintinnabulum (large bell on a column) and the Ombrellone (large gold and red umbrella), are displayed prominently in the sanctuary. And the Stations of the Cross, while not painted, are cast in high relief and highly visible. The center of worship for the Diocese of Phoenix, St. Mary's is known for maintaining a traditional form of liturgy featuring the pipe organ, choir, men's schola and a wide range of music from traditional Gregorian chant to Renaissance polyphony and contemporary composers in its services. The church has been staffed by the Franciscan priests since 1895, four years after the church was founded and the congregation met in an adobe structure that later was replaced by the current edifice.",
  "A beautiful church with Franciscan Friars as Priests\nWelcoming congregation \nBuilt in the Italian Style with beautiful stained glass windows",
  "Located in the downtown area of Phoenix, this church is not only the place of worship, but at the same time it is a great architectural and historic landmark. The Basilica is well over a hundred years old, and since 1978 it is listed on National Register of Historic Places.\n\nThe stained-glass windows and the dome are powerfully beautiful, and the courtyard outside the Basilica with the statues of Pope John Paul II, Mother Teresa, St. Francis, the images of the Blessed Virgin Mary on the walls, the fascinating sculpture Circle of Peace - all this and the shade of the trees and green lawns create a wonderful, quiet and  peaceful atmosphere of the whole area.\n\nIt was just a pleasure to spend some time at St. Mary's Basilica. It is truly magnificent.",
  "The Bishop's basilica... should be a very nice place and this one does not disappoint. We enjoy our annual (when my family gathers in Phoenix for a week)  Sunday worship at this beautiful church.",
  "A beautiful church!  The mass was wonderful and I felt so welcome.  This will be my church every day I visit my step son.",
  "Beautiful Church, beautiful services. Father Michael gives the best sermons. He is excellent at tying in current events with biblical stories, and inspiring people to treat each other with kindness. ",
  "The church is in the middle of the city. It was built on the original site of the first catholic church in the area. It is also historic in regards to its age and the visit of Pope John Paul II. The inside of the church is well decorated with statues of the pieta, Virgin Mary, etc. The pew where Pope John Paul knelt is also preserved and displayed near the entrance of the church. A very good place for prayers and contemplation.",
  "It’s nice but we have seen much more beautiful basilicas. Nothing special. The special thing was Pope John Paul II was there on my birthday "
 ]
},{
 "name": "Ak-Chin Pavilion",
 "address": "2121 N 83rd Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/fb/00/ae/cricket-pavilion.jpg",
 "tags": [
  "music",
  "food",
  "food",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d563413-Reviews-Ak_Chin_Pavilion-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was my first time going to the facility. I wasn’t expecting to be outdoors but it also had an indoor appeal. You could be under the covering, seated in stadium style seating or standing in the grassy areas. The show was awesome. My second time seeing Mary J and first for Nas. The eating area reminds me of going to the carnival. Different booths to choose from. The only thing I didn’t like was again a women’s purse has to be the size of your hand. You had three options. Leave your bag in the car, buy or bring clear plastic bag or leave you bag at a stand for them to watch. I choose a clear bag. Was worried bag or contents would be missing.",
  "Great place under the roof even in the summer heat...the ceiling fans and mister were great..wonderful music, drinks, and food. I will be back for three concerts in 2020",
  "The seats were excellent the fans kept it cool enough to enjoy the concert on what was a very hot night.\nThe drinks are very expensive, $19.00 for a can, yes, can of wine, but that can is really two small glasses of wine, so relatively speaking it was $8.00 a glass.  Mostly though, be prepared for big prices on drinks.",
  "The concert we attended was excellent even though the weather was not.  It was hot as expected but later on it got very windy and then it rained.  Because we were under a roof of sorts, we didn't get wet and luckily the weather didn't affect the concert.",
  "Easy to get to, plenty of parking (free) and tons of food booths (a little pricy). Hot dogs are $6, corn dogs $6.50, beer $14, etc.. Entry lines were smooth and quick. Seats under the pavilion were great when the sun was out, however the heat stayed trapped, were as lawn seats would have been better. I noticed there seemed to be more of a breeze. Overall, it's an alright venue. Take advantage of the water mist...you'll need it:)"
 ]
},{
 "name": "Arizona Capitol Museum",
 "address": "1700 W Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/38/92/f1/arizona-capitol.jpg",
 "tags": [
  "historic",
  "history",
  "history",
  "free",
  "history",
  "free",
  "tour",
  "history",
  "history",
  "history",
  "free",
  "tour",
  "history",
  "free",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d104043-Reviews-Arizona_Capitol_Museum-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Arizona State Capitol in Phoenix was the last home for Arizona's Territorial government until Arizona achieved statehood in 1912. Initially, all three branches of the new state government occupied the four floors of the statehouse. As the state expanded, however, the branches relocated to adjacent buildings. The 1901 portion of the Capitol, located at 1700 West Washington Street, is now maintained as the Arizona Capitol Museum with a focus on the history and culture of Arizona. It features over 20 exhibits focusing on contemporary, historical and artifacts from state-owned collections. Most sobering is an exhibit detailing the sinking of the USS Arizona at Pearl Harbor on December 7, 1941, including a piece of the the formal 59-piece silver service and enormous silver and copper punchbowl that were removed from the battleship for cleaning prior to the Japanese attack and a piece of the superstructure that was salvaged afterward. There also is a timeline of events pivotal in making Arizona a state, the original offices of the Governor and Secretary of State and the historic Senate chambers and House of Representatives. VIsit the rotunda floor of the State Capitol Building where Senator John McCain lied in state on August 29, 2018, see the U.S. flag that flew on the USS Arizona when it was sunk and a model of the USS Arizona. The building is topped with a weather vane similar to the Winged Victory of Samothrace, which is visible through a skylight from within the rotunda.",
  "Four floors of interesting aspects of the history of Phoenix and Arizona. It is free to enter and well worth a visit. From the museum there is a large garden of remembrance strewing for about a half mile which was though provoking.",
  "My parents visit all the state capitols and were blown away by Arizona's. At the time, all of the china and silver from the ship, Arizona had been collected from being dispersed to other ships and was on display. That is typical. Add to your to do list!",
  "The Arizona State Capitol has a free museum that tells you the history of the state. There is currently a USS Arizona display and a Phoenix Suns display on the 1st floor. The 2nd and 3rd floor are dedicated to the history of Arizona and how it became a state. There are some interactive displays and children's activities. There is free parking on either side of the capitol. Get there early and you should be able to avoid school and senior groups ",
  "We are visiting all 50 state capitols and this museum is about as close as Arizona has to a state capitol.  They have their Senate & House of Representatives in buildings on each side of the museum.\n\nWe loved the Saguaro Cactus out front.  We even saw the bird that made his home inside of it!  They have petrified wood outside too.\n\nInside the museum is very musty.  I believe the tour guide was a volunteer because she wasn't very professional.  When I asked if we could visit the Senate & House chambers, she asked if I meant the current ones in the adjacent buildings or the old ones in the museum.  I said the current ones.  She then lectured me on how I was not allowed to go there since it's a secure building and since I wasn't invited to be there, I had no business going & was unwelcome!  So we settled for taking photos of the buildings from outside.\n\nThe area around the buildings was beautiful and well kept up.\n\nIt is worth your time to stop & see the buildings and grounds.  Don't forget to look for the bird living in the cactus!",
  "The old part of the state capitol complex has been turned into a museum that covers three floors. It's very detailed in giving the history of the state. Sadly, back in the 1950s when modern, boxy architecture was ruining city skylines, the state of Arizona thought it would be a good idea to move the executive offices to an ugly high-rise at the back of the old capitol, and to add two equally ugly office buildings, one at each wing, for the new Senate and House chambers. When the House and Senate are in session visitors may attend though the gallery on the third floor of each building, but don't expect anything stately.",
  "We do state museums in every state we visit.  This one was very well done. We learned a lot about Arizona's history that we did not know.  Set up as it was back in the day. ",
  "The attack on Pearl Harbor is a pivotal event in U.S. History. This exhibit makes it personal, with info about some of the heroic Arizona natives on board that tragic December day in 1941. And it's free. Afterwards, head to nearby Novel Ice Cream Shop for some of the best I've cream you'll ever have.",
  "Lots of displays, creations across the street. Well worth roaming around especially early in the AM. ",
  "Both the capital building and the memorials across the street are a great place to visit. Just packed full of Arizona state history, even the capital building itself is interesting.  Especially interesting was the artifacts from the USS Arizona a Pennsylvania-class battleship sunk at Pearl Harbor and the numerous paintings. They actually have the entire ships silver set.  \nTour with a docent if available, as very knowledge and pleasant to talk to (mostly students when we went).   Free",
  "This was our capitol #20. We loved the guided tour and highly recommend modifying your trip to have a guided on the Friday afternoon tour. We would not have learned as much without the guide. We enjoyed the scavenger hunt too. Who knew the Rough Riders trained in Phoenix prior to heading out? "
 ]
},{
 "name": "Japanese Friendship Garden of Phoenix",
 "address": "1125 N 3rd Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/81/24/8c/pond.jpg",
 "tags": [
  "walk",
  "nature",
  "kids",
  "history",
  "sampling",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d2558107-Reviews-Japanese_Friendship_Garden_of_Phoenix-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "I stopped here in the middle of the day to just sit around the water. It is a really peaceful place, with benches or rocks to sit on around the water. The pond has huge fish that rise to the top and ducks, they even have a small waterfall. The sites and sounds of this small park is stress relieving. ",
  "Loved this place. Beautiful scenery, wonderful setting, glorious waterways, and lovely fish and ducks.",
  "Hard to believe this is right in the city, because once you get inside, walk the peaceful green paths, stroll by the Koi ponds and feel the shade of trees, you'll feel like you've been transported to somewhere else.\nHelpful tip: Do read about the Etiquette of the Garden. There is reverence and history to the reflective nature of a Japanese Friendship Garden. All ages can enjoy its beauty.\nIf you DO need to take the kids to burn off steam prior, there is a big, nice public park directly adjacent to the Garden, and it is great for that very purpose.\nThe Japanese Garden has special events which are worthwhile, too.\nWe attended the inaugural \"Devour The World\" Event in  February and it was lovely. We arrived right at the beginning and got to see the grounds transform into night time while sampling a great array of local foods and beverages. ",
  "We visited the garden to pass some time on a rainy day while we waited for a nearby salon appointment. \n\nThis place was so beautiful! Especially on the rainy day when we visited. \n\nSo peaceful and lush. Beautiful spots for pics. \n\nFun to watch the koi fish. It looked like lots of flowers will be in bloom later in the spring, but for now we saw irises popping up. \n\nVery nice entry fee of $10. Student and seniors receive discounts. \n\nI highly recommend a visit. We spent about 40 minutes here, but could sit and enjoy it more on a non rain day, there are benches throughout. Restrooms and gift shop (very reasonably priced).",
  "Been coming for years but was very disappointed this time. The prices were raised to get in and you can no longer feed the fish. There were a lot less fish to see. When we first started going there you could sit on the grass and relax in a beautiful setting. Now you aren’t allowed off the path and there are only a few benches in the whole place. We won’t be back. ",
  "It is a good place to walk around and relaxed.  Took about 45 minutes to see it all.  Pond with fish and statues.",
  "The Japanese Friendship Garden of Phoenix is a small, sweet, zen garden. I enjoyed an hour in the garden before heading off to the airport (nearby) at the end of my southern AZ vacation. I can see this place being a respite in the summer months as it even has a little bit of shade which isn't easy to come by in Phoenix. (They have some yummy popsicles in the gift shop. I had mango.)",
  "I stopped here in the middle of the day to just sit around the water. It is a really peaceful place, with benches or rocks to sit on around the water. The pond has huge fish that rise to the top and ducks, they even have a small waterfall. The sites and sounds of this small park is stress relieving. "
 ]
},{
 "name": "Orpheum Theater",
 "address": "203 W Adams St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/77/c3/41/20190212-140451-largejpg.jpg",
 "tags": [
  "tour",
  "history",
  "historic",
  "performance",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g31310-d563426-Reviews-Orpheum_Theater-Phoenix_Arizona.html",
 "source": "TripAdvisor",
 "reviews": [
  "The details are spectacular and the acoustic amazing! Definitely worth the drive as we live in the West Valley. Seats were comfortable and thought it shouldn't matter the show was amazing!",
  "We went to a musical presentation and also took a tour of the theater, which has a fascinating history and many interesting features.  It has a really great theater organ from the old days of silent movies which sounds wonderful but is hardly every played.  I wish we could hear a concert on it.   But the theater is a nice venue for many kinds of programs, and i look forward to visiting there again.",
  "Theater is opulent, seats are comfortable, sound and lighting for performances are great. Such a historic beatiful venue.",
  "a few days ago we saw Shen Yun performance.   Very impressive, amazing , educational experience in an artistic way.   Both, the orchester, the instruments and dances just transported you to another world.    Truly mesmerizing.",
  "What a wonderful trip back in time to see a beautiful theater!\nIt has been refurbished and shows the love the city of Phoenix and the people have for this grand old place! The tour was about an hour and so very informative!\n"
 ]
}]
