[
{
 "name": "State Capitol",
 "address": "500 E Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/30/1b/18/exterior-of-sd-capitol.jpg",
 "tags": [
  "tour",
  "tour",
  "history",
  "walk",
  "creative",
  "tour",
  "tour",
  "walk",
  "art",
  "history",
  "tour",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d145432-Reviews-State_Capitol-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The State Capitol is a most beautiful building during the Christmas season! A must see for travelers to see the Beautiful Christmas Tree Decorations.\nThe Capital Lake is also a plus for feeding the geese and fish! Give it a try!",
  "Beautiful Italian marble and a very interesting self guided tour script you can follow anytime on your own.",
  "As a TripAdvisor Traveler seeking to see all 50 State Capitols, a visit to Pierre and the State Capitol of South Dakota were \"must visits\" for me. Pierre is located in Central South Dakota and is the second smallest city containing a state capital in the United States.\n\nThe capitol building is located on a hill and surrounded by a beautiful park that contains more than 50 types of trees and shrubs. It is also the only capitol served by an artesian lake. \n\nEntering the capitol, we joined a tour of the State's Supreme Court and received an interesting presentation on the history of the court and its chambers. Our tour guide provided us with a description of the interior of the capitol building and its highlights. She also encouraged us to take the self-guided tour of the capitol. Our tour included seeing the large murals in the capitol rotunda, visits to the house and senate chambers, and a trip to the governor's office to have his receptionist \"stamp\" my \"Capitol Collections\" book. All in all, our visit lasted about 90 minutes and provided us with a most enjoyable tour of this state capitol.\n\nA  \"must see\" when visiting the capitol complex is its \"Eternal Flaming Fountain,\" located on the northwest side of Capitol Lake and a short walk after exiting the capitol building. It is in a beautiful setting and an impressive memorial to war veterans.",
  "If you can make it there during December to view the Christmas trees, you will enjoy it!  The trees are decorated by a variety of associations, and the decor is so creative.  Small children will especially enjoy all the beautiful trees.  The building itself is so beautiful, and add in all of the Christmas decorations, and it's a treat for the eyes.  Feeding the geese is a fun time too.  Bring spare shoes, so you can change shoes before you get back in the car.  Lots of geese means lots of poo.",
  "By all means, come to Pierre and see the beautiful South Dakota State capitol building.  I must say I was most impressed. Its in white marble, and has just beautifully artistic decor.  Lay out was nice, steps are easy to navigate and staff is pleasant and helpful.  If you are quiet and respectful, you may look in on a session of the State legislature - be sure to turn cell phones off and take off you hat!\n\nIt has a beautiful grounds too, with a lovely lake to one side.  Pierre itself is a very small town that the Missouri river runs through, but their State Capital complex area is a must see! (Oh and please remember in South Dakota, Pierre is pronounced \"peer\" or \"pier\" and not the French way!)",
  "Wonderful architecture. Booklets are available for you to tour the building at your own pace. See the hall of portraits of former Governors, and the displays of the First Lady's Inaugural Ball Gowns (replicas). Fun little things like look for all the blue tiles and the heart-shaped tiles. Very Proud to have this in my state.",
  "I have to travel to Pierre to see the 100 Christmas trees decorated by organizations, businesses, and towns.  It was well worth the nearly 8 hours in the car.  If you like Christmas trees and decorations and lights, you won't be disappointed.  My only disappointment is that they do not have a guided tour of the capitol building.  Even once a day would certainly enhance the experience, as opposed to using the self guided tour brochure that is available.  I have taken guided tours of capitol buildings in other states, and they are so much better and more enjoyable than a self guided tour.",
  "We love visiting capitals because they reflect the people and values of each state. This is a lovely building with a self guided walk through. You can certainly see it in under an hour. Equally interesting though, is to walk around the Governors walk and the life size bronze statues they are erecting around the area.",
  "The capitol right now has a lot of scaffolding as it is being cleaned and restored. Inside it is really nice to see, history of course, and the rotunda is very beautiful. It is a smaller capitol without the dramatic art of Nebraska or Missouri, but well worth the visit. Outside the gardens and the lake add a lot to the ambiance of the setting.",
  "Actually my sister and I stopped to take in the beautiful building. If you get a chance to stop please do. ",
  "This in itself is worth going to Pierre. We took the self-guided tour on a Sunday mid-morning, and had the building basically all to ourselves. The architecture is absolutely astounding, and the history in this building makes it all the worthwhile. It's situation right next to Capital Lake, and I would definitely recommend going down to the fallen soliders monument and taking a walk around the lake."
 ]
},{
 "name": "Cultural Heritage Center",
 "address": "900 Governors Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/cb/ee/93/cultural-heritage-center.jpg",
 "tags": [
  "history",
  "learn",
  "walk",
  "kids",
  "history",
  "food",
  "history",
  "history",
  "history",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d123644-Reviews-Cultural_Heritage_Center-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This center is one of a kind. From the moment you walk through those doors, you are transported back in time to the history of pioneers, Native Americans, and even to the cold war, where you learn about SD's role and missile silos. If you love history, this is definitely worth your time.",
  "This museum is a must see for Pierre visitors.  The exterior architecture is beautiful.  Parking is readily available.  The entry fee is inexpensive. Exhibits feature the indigenous population, homesteaders, miners, railroads, farmers, ranches, and government and are accessible for children and adults.  Plan to spend one to two hours here.",
  "This is a wonderful museum with a great display of Native American life and artistry. A tipi to visit and then stop in a settler's sod house, see an original stage coach move on to gold panning and mining. A few interactive activities for kids. I think the displays will keep them engaged even though many are behind glass. ",
  "A couple hours wasn’t long enough to view all the exhibits, so I’ll be back.  The exhibits are exceptional in detail and show the history of South Dakota from multiple perspectives as they move through historical events using museum pieces, narratives, photos, audios and videos.  The history of the various Native American tribes, Homesteaders, immigrants, military members, women, and politicians, was comprehensive and beautifully displayed.  Of course there are historical events that are at times difficult and heart wrenching, and the exhibits are honest in their depiction.  Due to time restrictions I had to quickly go through the exhibit on the missile silos located in western South Dakota, but what I saw was fascinating. To end my visit I walked through the museum shop filled with many books, pottery and home items, food and jewelry pieces.   What an enjoyable afternoon.  Well done!  ",
  "This is a very good hands on museum. You can touch buffalo fur, build a bomb shelter, pretend to be a telephone operator on the old switch board. Our favorite was the KELO tv history with Captain 11 and old tv commercials.",
  "Great job of curating and archiving our states history and past. I loved seeing Captain 11’s uniform.",
  "Not a big or boring \"museum\". This center is laid out as a timeline walk through the history of South Dakota. It is very nicely done, informative and interesting. We learned a lot and got a better appreciation for the struggles and fortitude of pioneers.",
  "If you are interested in history, this is a must see place to go!  Loaded with historical artifacts and displays, the history of SD is portrayed.  Very enjoyable and educational."
 ]
},{
 "name": "Oahe Dam",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/98/7b/47/oahe-dam.jpg",
 "tags": [
  "tour",
  "walking",
  "free",
  "learn",
  "learn",
  "learn",
  "learn",
  "walking",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d145431-Reviews-Oahe_Dam-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We drove out to the visitor center and saw a 5 minute video, then started a 1.5 hour private and free tour with a friendly ranger.  We learned about the construction of this enormous dam, then drove down the hill to continue a tour of the power station.  Lots of explanation of the huge generators and just how electricity is created there.  The tour continued downstairs, walking around the generators.\naround the generators.  It is very scenic there and there is a chapel/historic missionary school there to tour as well.  Can't say enough good things about our tour and enthusiastic guide, Cassandra.  There are some nice picnic tables there but it was too hot today to stay outside.  Great sign in the ladies' room too.",
  "This dam was officially christened by President John F. Kennedy in 1962.  It was the largest earth-rolled dam in the world for over 40 years.  Its the largest dam on the Missouri River and you can drive from one side of the 1 mile dike to the other.  A must to see from the air and/or ground.  ",
  "This is a large earthen dam with tours that allow you to view the turbines and learn first hand how the dam works. An elevator takes you down, down, down. It is a bit noisy but it is very informative. Stop by the visitor center for hands on educational information on the dam and area wildlife, then go to the campground for fishing from shore, various well groomed trails, and a sandy swim breach with clear cool water. The cabins and campgrounds are on the state reservation system. There may be immediate availability on weekdays or if you come along after a cancellation on the campgrounds.  The dam tours are usually available same day. ",
  "This is a large earthen dam with tours that allow you to view the turbines and learn first hand how the dam works. An elevator takes you down, down, down. It is a bit noisy but it is very informative. Stop by the visitor center for hands on educational information on the dam and area wildlife, then go to the campground for fishing from shore, various well groomed trails, and a sandy swim breach with clear cool water. The cabins and campgrounds are on the state reservation system. There may be immediate availability on weekdays or if you come along after a cancellation on the campgrounds.  The dam tours are usually available same day. ",
  "This is a large earthen dam with tours that allow you to view the turbines and learn first hand how the dam works. An elevator takes you down, down, down. It is a bit noisy but it is very informative. Stop by the visitor center for hands on educational information on the dam and area wildlife, then go to the campground for fishing from shore, various well groomed trails, and a sandy swim breach with clear cool water. The cabins and campgrounds are on the state reservation system. There may be immediate availability on weekdays or if you come along after a cancellation on the campgrounds.  The dam tours are usually available same day. ",
  "This is a large earthen dam with tours that allow you to view the turbines and learn first hand how the dam works. An elevator takes you down, down, down. It is a bit noisy but it is very informative. Stop by the visitor center for hands on educational information on the dam and area wildlife, then go to the campground for fishing from shore, various well groomed trails, and a sandy swim breach with clear cool water. The cabins and campgrounds are on the state reservation system. There may be immediate availability on weekdays or if you come along after a cancellation on the campgrounds.  The dam tours are usually available same day. ",
  "I love looking at the lake from the overview just a mile or so above the dam.  The chapel at the Visitor Center is awesome.  But the best view of all is looking down river and the Oahe Downstream Area.  It is just beautiful and walking the Cottonwood Trail in the downstream area is a great time.",
  "The first overlook traveling north from Pierre on Route 1804 seems to be the best. A map shows the location on the Missouri River where Lewis and Clark had an altercation. The small museum at the Visitor Center on the dams was enlightening. Aside from information about wildlife and dam management, there’s more data about Lewis and Clark expedition.",
  "The Missouri River valley is an attractive place - rolling hills and bodies of water. I wouldn’t go out of my way to come and see the dam but if you’ve never seen an earthen dam it’s impressive. It looks just like a levy until you look below and see the power plant - I kept looking for a bypass but there wasn’t one. Here is a downstream photo, we were there at sunset. ",
  "We missed the tour and the ladies working told us where to go to see different things about the Dam. It's incredible. Loads of beautiful spots for pictures (slight smell of dead fish) very interesting place for all ages!",
  "Tours: Memorial Day to Labor Day: 10 a.m., 1 p.m. & 4 p.m., seven days a week. We missed the last tour of the day. Drove and walked around and read information plaque. Started operation in 1962 which JFK visited and dedicated 2 generators. I would stop again to take the tour if traveling through."
 ]
},{
 "name": "Flaming Fountain",
 "address": "700 E Broadway Ave on the Capitol Grounds next to Capitol Lake",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/d9/35/80/flaming-fountain.jpg",
 "tags": [
  "unique",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d277937-Reviews-Flaming_Fountain-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Flaming Fountain has been fired up again. Several reviewers had stated that the flame was extinguished because  the natural gas mixture was too low. Last night, to our surprise, we saw this unique fire and water display at the South Dakota war memorial. The best time to see this is at dusk. For our selfies, we captured the Capitol in the background with the flame.",
  "A very nice little memorial. It's worth the short walk from the capitol building. Pause and reflect on those that serve so we can enjoy our freedom. ",
  "The area by the Capitol Visitor Center is a nice little area.  The Flaming Fountain and then the war memorials are all nicely done.  Must visit when in Pierre.",
  "Nice honoring of those who served in WWII, Korea , and Nam. I was disappointed that the memorial for WWI was not grouped with these. That monument is accross the street from the Capital. ",
  "Located on the State Capital grounds along the Capital Lake. Memorial dedicated to South Dakota veterans who served in Korea, Vietnam and World War II. Absolutely loved the life size military statues."
 ]
},{
 "name": "South Dakota Discovery Center",
 "address": "805 W Sioux Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/b8/9c/03/k-nex-construction-zone.jpg",
 "tags": [
  "kids",
  "kids",
  "kids",
  "free",
  "affordable",
  "family",
  "kids",
  "kids",
  "kids",
  "kids",
  "family",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d277928-Reviews-South_Dakota_Discovery_Center-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "A must stop if you have kids. Exhibits change, our kids are ages 2-9, they all love to stop whenever we can. Great way to spend an hour or two",
  "We come here often and our kids love it.  There are a lot of activites to do and they can be entertained for a couple of hours.  The staff is incredible, the place is clean and has great exhibits.  A great stop for kids and families.",
  "Great place, open space and what awesome place for kids.  Keep up the good work....the Staff is very kid friendly.",
  "First, I need to say that this is a great deal. Entry is like $4 for adults and $2 for kids or $40 a year for a family, which also allows you to visit MANY other science centers for free. Because of our membership, we've been able to visit both the Nashville, TN and Columbus, OH science centers free of charge. \n\nSecondly, the first thing you might notice is the size. Yes, it is smaller than most other discovery/science centers in bigger cities, but Pierre is not a big city. What it lacks in size, it makes up for with exhibits. \n\nThree, there are a lot of exhibits in a small area and they change several times a year. My kids (ages 1-9) find almost all of them interesting. They are also looking forward to the new Discovery Town coming soon. \n\nFourth, this place has classes going on for kids Pre-K to 5th grade most of the year. They are all affordable too and interesting. My boys can't wait for Lego class again this summer. \n\nFifth, their small 'store' has a lot of interesting and varied gadgets, toys, and other science related items. These are decently priced and sometimes they have them on sale as well. \n\nOverall, this is a great place year round for parents and young kids. ",
  "A great place to keep the kids busy...and learning!...for an hour or two.  A great resource for anybody who's got young kids visiting Pierre.  A few repairs needed on some of the activities, but there's plenty to do and very little opportunity for kids to \"get into trouble\" :)! Reasonably priced.",
  "A must stop if you have kids. Exhibits change, our kids are ages 2-9, they all love to stop whenever we can. Great way to spend an hour or two",
  "We come here often and our kids love it.  There are a lot of activites to do and they can be entertained for a couple of hours.  The staff is incredible, the place is clean and has great exhibits.  A great stop for kids and families.",
  "If you are looking for something for a couple of hours it’s great.  But is similar to most other children’s play centers, but a lot smaller.",
  "I've stopped by and brought my kids to this place a handful of times. Pierre is the mid-point of between us and other family on the other side of the state (we each live a couple hrs drive away). Each time we stop, my kids have a great time. This past Christmas season we met up with my sister and her family. The cousins had a lot of fun! I enjoyed the planetarium we saw about a year ago.",
  "Loads of fun to be had if you have 30 minutes or 3 hours. Couches were great for me to relax on while the kids played. Safe and clean environment. Even I enjoyed it."
 ]
},{
 "name": "Trail of Governors",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/87/ca/6d/trail-of-governors.jpg",
 "tags": [
  "historic",
  "historic",
  "learn",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d10584690-Reviews-Trail_of_Governors-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Governor Samuel Elrod in front of the Historic St Charles Hotel. On the base is a QR code that will display his biography on your phone.",
  "In June, 2019, the bronze statues of three more of South Dakota’ s former Governors were added to the Trail of Governors.  The Trail now features the sculpted likeness of 25 of the 31 noted individuals who have served as chief executive.  Scheduled to be completed with the six remaining in June of 2021, the Trail is the only undertaking of its kind in America.  The Trail has become a major attraction in Pierre, surrounding the State Capitol and leading its followers on an historic trip through the business district to the banks of the beautiful Missouri River.  Each statue is accompanied by a QR code enabling those who wish to learn more of the life and times of the Governors via a smart phone or tablet.  South Dakota and the Capital City of Pierre are proud of these great individuals who have so ably served the state.",
  "Take a walk around downtown and shake hands with SD's history!  The governor statues are actually pretty cool and each offers information about the person- and his years of service to his state",
  "It was really unusual to see these lifesize statues of past Governors in the streets around the state Capitol. With each statue (there are currently over 20) is a short piece of narrative about them. Really good idea. ",
  "There are now 22 life size bronze statues of the 30 former Governors of South Dakota on the Trail of Governors in state capital of Pierre.  "
 ]
},{
 "name": "La Framboise Island",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "hike",
  "nature",
  "walk",
  "walking",
  "walking",
  "historic",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d278656-Reviews-La_Framboise_Island-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Being a poor sleeper I usually get up early and go for a walk. During a few days visiting Pierre early in the morning I went for a stroll along the river and noticing a causeway I followed it to what turned out to be this nature park. There are maps by the trailhead that can explain the park's features much better than I, but if you like to hike, make a stop here.",
  "The island has a lot of paths for walking and biking. It is large enough to get a good workout. Bird watching is great here with all of the trees and bushes. There are other animals to watch for possibly including rattlesnakes. I did not see any snakes though. ",
  "We stopped for a picnic lunch here.  I packed a cooler and needed to make sandwiches.  The picnic area was infested with mice and covered with their droppings.  The place was gross.  We didn't bother to go look through the trails; I just wanted to leave.",
  "Laframboise island has many hiking trails and is a great place to archery hunt in city limits. There are several flocks of Turkey, coyote and Pope and Young class whitetail deer. There are hardly any hunters to compete with come and try it you will be surprised at how many deer you see just walking the trails. Spot and stalk is seldom used in this area but the deer are used to people walking by and just stand still till you are past.",
  "It was a pretty fun area to hike. All flat and surrounded by the Missouri River. Very pretty with a couple historic markers on it."
 ]
},{
 "name": "Fighting Stallions Memorial",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/f7/af/dc/fighting-stallions-memorial.jpg",
 "tags": [
  "art",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d277936-Reviews-Fighting_Stallions_Memorial-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "There is a nice little path to go check out this memorial.  If you are looking at the Flaming Fountain you might as well check this out also.  Nicely done. ",
  "This art is supposed to honor those state employees killed in a tragic plane crash. I like the memorial part, but don't find the statue appropriate.",
  "First, it's really a violent depiction of two horses fighting. What that has to do with a plane crash or governor is beyond my comprehension. The other reviews are correct in that they need some informative signage explaining why a governor and business heads need a statue of horses fighting. The plane didn't even crash in South Dakota. Anyway, it's easy to get to from the capital building. It seems to me that the statue is better suited for a museum. There are more cows than people in South Dakota so why didn't they just have a large bull or cow statue instead.",
  "I almost wrecked my car when I saw these two stallions and got fixated trying to determine what was happening.  Stop and view the fight.\n",
  "This piece is on the grounds around the capitol and is a tribute to victims of a plane crash.  The plane was carrying the governor and five others and all perished.  The grandeur and the physicality of the statues make it a great piece.  Stop by as your walking around."
 ]
},{
 "name": "South Dakota State Historical Society Museum",
 "address": "900 Governors Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/82/41/e9/entrance-from-society.jpg",
 "tags": [
  "family",
  "tour",
  "structure"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d8389790-Reviews-South_Dakota_State_Historical_Society_Museum-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Many interactive displays that would amuse and interest children while still exhibiting count less galleries to fascinate adults.",
  "We were here going some family research. The archive staff were just incredible! We helpful and knowledge and polite. We cant thank the enough. ",
  "The museum is well thought out and contains any number of items of interest.  They are presented well, very good dialog backing up the displays.  Recommended for all.  ",
  "Native vegetation was transplanted to the front yard after construction.  Only a modern building face shows, the whole building is underground.  Many beautiful displays inside.  Only about three dollars for entrance.  Don't miss it.",
  "this was far and away the most surprising stop on our tour of central South Dakota. Travelling with a retired teacher, there was no way to escape it, but I thought I would be fatally bored for the hour or so we would visit. We wound up spending almost two hours totally engaged with the exhibits and the information. Architecture students will want to visit just to see the structure which is essentially earth-berm set in the side of a sloping prarie grass covered hillside. great view of the capital, river and town to boot. Really, don't miss it if you are in Pierre."
 ]
},{
 "name": "South Dakota National Guard Museum",
 "address": "301 E Dakota Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/24/b3/bf/south-dakota-national.jpg",
 "tags": [
  "history",
  "free",
  "learn",
  "kids",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d277929-Reviews-South_Dakota_National_Guard_Museum-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of interesting guns and weaponry, but the best feature of the museum were 7 enormous binders containing write ups of every South Dakotan that died in WWII. The files contain both those who died from enemy action as well as those who suffered accidents resulting in their deaths. Great place to find out about relatives or an aunt's old boyfriend. ",
  "I'm a veteran. On a rainy day I decided to stop in and have a look around. They have a nice collection of military history inside and out. A small gift shop has a good selection for all ages. Staff are friendly. I've returned here several times.",
  "The SD National Guard Museum is doing a GREAT program for our local kids in summer camp teaching them about World War I!! Staff does an amazing job and such a great FREE learning experience for our kids! Including hands on projects to help them learn even more!! The museum is free to all! It has been renovated and has many items inside and outside to look at. The staff is friendly and goes above and beyond. FREE, informative, fun stop for all to enjoy!! ",
  "Well setup museum! Rich in history and worth the visit!! Look forward to visiting again in the future as they update it often.",
  "Museum was interesting and well kept and clean. They had some big things housed outside airplanes tanks etc:   My husband enjoyed it more than I just because I am not that interested in that sort of thing. I did find something however that I found interesting They had displayed a old Military large wood stove complete with a cook book showing how much is needed to feed a 100 people...."
 ]
},{
 "name": "Grifin Park",
 "address": "700 S Washington Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "unique",
  "kids",
  "hospitable",
  "family",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d10516139-Reviews-Grifin_Park-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very tasty! Very friendly! Fast service! Just passing thru town. Unique little restaurant. Gave us directions to the park so that we could enjoy our meal in the outdoors by the river.\n",
  "This little park in next to the Mighty Missouri River, most people just drive by and that is great for me, nothing like have a park to yourself",
  "Wonderful place to meet with a large group of various ages. Playground equipment, a pool, the riverbank, beach, ballfield, and many picnic shelters. Also adequate parking. Our group had no reservations but we were able to easily find a comfortable spot. Kids and aduts found it very relaxing. Lots of shade and sun both.",
  "Watched a couple of baseball teams play, believe they were Class A and provided a nice evenings entertainment.  Met some locals who were hospitable and friendly!",
  "Whether a quiet drive or slow stroll, one can enjoy the riverbank with some fishing and others walking enjoying the scenery.  Excellent family atmosphere in the park."
 ]
},{
 "name": "Bill of Rights Brewery",
 "address": "1601 N Harrison Ave Ste 5",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/52/9c/07/20180616-204044-largejpg.jpg",
 "tags": [
  "sightseeing",
  "family",
  "food",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d12600209-Reviews-Bill_of_Rights_Brewery-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "After a hard day of sightseeing I yearned for a craft beer and seeing this place recommended on Trip Advisor I headed there for a cold one. Unfortunately this place wasn't there. A neighbor said they closed some time ago. There should be a way to remove these listings that no longer exist. ",
  "Our family stopped here to try their beer and enjoyed both the place and the beer. The woman working the bar was very friendly as were the customers.  They have a nice variety of beers which we sampled via flights.  They had some unusual styles with spices and other flavorings that were very good. Overall, a very good experience.",
  "Stopped in with some friends while on vacation. Had a flight and then shares a few beers that we liked best. Really good brews and super friendly staff. They have popcorn with tons of seasonings available, as well as other snack items. Decor is really cute and patriotic themed. Glad we went.",
  "Had a nice chat with owner and one other guy...we were the only customers on a Thurs afternoon.  Shared a flight of 4 beers with spouse so we could sample them all.  Excellent.  Hope this guy does well as Pierre needs a place like this.",
  "New brewery as of April 2017, the only one in Pierre.  Very nice tap room.  Food is limited to popcorn, pretzels, chips.  Brews were really good.  Worth a try if you like craft beer."
 ]
},{
 "name": "Dakota Spirit Distillery",
 "address": "3601 Airport Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d17990521-Reviews-Dakota_Spirit_Distillery-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Definitely worth checking out.  Bickering Brothers or Dakota Spirit Distillery is a must see local attraction.  If you just want to check out how Whiskey is made or have a great conversation with the local Distiller or try any of their fabulous products (Whiskey, Vodka, Brandy or Coyote 100) stop by.  We had a great time touring the facility, learning the whole process and of course trying some of the different products that they make.  Ended up buying a few bottles to share with friends.  I highly recommend the Whiskey."
 ]
},{
 "name": "Hyde Stadium",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d12591071-Reviews-Hyde_Stadium-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful views to the hills on the west side of the Missouri River. Ample stadium seating for baseball games with your choice of covered seating or open to the sun. Bring your stadium chairs to the covered seating as they are concrete open seats. Concessions and bathroom facilities very nice. Hopefully your team wins and it will be a day of perfect weather! Take a walk around the adjacent Capitol Lake while your team warms up and you'll get your exercise too."
 ]
},{
 "name": "St Charles Lounge",
 "address": "207 E Capitol Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/3d/b5/2d/st-charles-lounge.jpg",
 "tags": [
  "music",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d12295571-Reviews-St_Charles_Lounge-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We stopped in on a recommendation, and it was fantastic. The Owner happened to be In, and we talked about different cocktails, ideas, and honestly, just a super friendly staff with a hell of a story. \n\nWill absolutely make this place a priority to stop in next Time im in Pierre.",
  "The bartender \"Nate\" makes excellent cocktails. My favorites are the Cucumber Collins & the Mai Tai.",
  "Definitely the best cocktails in town! the St Charles Lounge is getting better and better. This is the only place we go to for a drink! In summer there are tables outside, in winter it's cosy and friendly inside. Good  music, fantastic yummy cocktails..."
 ]
},{
 "name": "Bob's Lounge Inc",
 "address": "114 W Dakota Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/35/08/d8/1er-septembre-2019-a.jpg",
 "tags": [
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d5835178-Reviews-Bob_s_Lounge_Inc-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our hunting guide told us about Bob's Lounge and we are glad to have stopped in. The place is small and reminds you of a place where \"everybody knows your name\" The locals residents who frequent the place could not have been nicer and it is the perfect place to stop after a long day of pheasant hunting. Pop corn is free and Sabrina made sure that our bowl stayed full. Collection of bottles around the bar are worth seeing!",
  "You can tell the Bob's is an older place and that has been frequented for years.  It is small in side.  Prices were good and so were the drinks.  They have a jukebox which is fun.",
  "Bob's has been an institution in Pierre for over 50 years.  The place for locals and visitors to hang out after work or on weekends.  They have the best popcorn in the area and it's free.  Come from out of town and the prices will seem like - free, currently under $12 for a bucket (5) beers, your call!  Have fun."
 ]
},{
 "name": "Prairie Pages Bookseller",
 "address": "321 S Pierre St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d10515962-Reviews-Prairie_Pages_Bookseller-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had an absolutely great visit, the owner took great care of us. She was very knowledgeable about local authors and made special orders so our books were at home before we were. Definitely deserved the Retailer of the Year award that was displayed by the cash register.  Terrific customer service!"
 ]
},{
 "name": "Long Branch",
 "address": "351 S Pierre St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/5d/3e/1b/longbranch.jpg",
 "tags": [
  "food",
  "delicious",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d5840197-Reviews-Long_Branch-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": [
  "LB has delicious food, drinks, and a great atmosphere. Fun place to get together with friends. They are family-friendly.\n    Very popular during lunchtime and offer a variety of foods.",
  "We stopped here for a drink and found it to be very dirty inside.  The staff wasn't friendly and even though we were sitting right at the bar, we waited quite a while for a drink.  I'm not sure what the problem is here but I wouldn't recommend it.",
  "Looks like a great place for evening entertainment - pool tables and more!!\n\nFor lunch it was a great place for a ruben sandwich!!  Service was great!\nKinda wished I was in town for another night to go see the nightlife here......",
  "Just a normal bar and grill in downtown Pierre. About an average experience for what one would expect."
 ]
},{
 "name": "River Charters",
 "address": "",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d19616713-Reviews-River_Charters-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": []
},{
 "name": "Major League Adventures - Day Tours",
 "address": "316 Ft Sully Trl",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/96/17/fa/getlstd-property-photo.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g54760-d7898913-Reviews-Major_League_Adventures_Day_Tours-Pierre_South_Dakota.html",
 "source": "TripAdvisor",
 "reviews": []
}]
