[
 {
  "name": "Roger Williams Park Zoo",
  "address": "1000 Elmwood Ave",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/8f/e5/81/free-roaming-sloths-explore.jpg",
  "tags": [
   "food",
   "family"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Visited the Zoo on a unseasonably warm day in February. It was very nice especially for a 4 and 6 year old, they loved it. The displays and zoo overall was very well kept and clean. We will definitely visit again.",
   "We love Roger William's Zoo! They have all the \" typical\" animals you find in a zoo. There are lots of things to do. It's a great place for people of all ages. They rent strollers, wheelchairs and electric scooters if you are in need of them. Employees in the park are so nice and helpful. They have typical fast food so if you want a nutritious lunch I suggest you bring a packed lunch. It's a great place to spend the day!!!",
   "We visited on a rainy winter day and we may have been the only people there. This zoo is lovely. We understood that with the rain we wouldn’t see all the animals. But we got to see many of them since multiple enclosures included an indoor viewing area in addition to the outdoor area. We even saw some animals that we haven’t seen in any other zoo yet. I can definitely see this place getting crowded in the summer or during special events. ",
   "We visit this zoo in the evening ever October for their annual Jack-O-Lantern display, a very special night, walkthrough the zoo and view lit up artwork on pumpkins, there is music in each section, concession stands with great snack before entering the path, brought my mom in a wheelchair, it’s is a concrete/gravel path.  Excellent Autumn event to attend, close park near by to visit in the daytime has Swan boats, a carousel and just gorgeous Mother Nature at her finest for Fall foliage!",
   "The zoo at Roger Williams park in providence Rhode Island was fun, a little small but lots to see and very family oriented"
  ]
 },
 {
  "name": "Rhode Island School of Design Museum of Art",
  "address": "224 Benefit St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a7/03/c5/rhode-island-school-of.jpg",
  "tags": [
   "walk",
   "family",
   "unique"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We had a wonderful visit to the museum on a rainy Tuesday. Like other reviews have noted there are so many periods and mediums to enjoy.  From classic statues to modern installations of multi-media.  This week we were lucky enough to catch the remix of the classic \"Raid the Icebox Exhibit\" by Andy Warhol.  The museum has a wonderful flow from room to room and it's so easy to get lost in the variety of art. To see art from the The Hudson River School, Pollock, O’Keeffe, Picasso, Gauguin, furniture, ceramics, Frank Lloyd Wright, glass work, tapestries, furniture and so much more was a real treat. There is a sense of whimsy and innovation around every corner - like the current Disco of artwork!  It's a wonderful sampling to expose your family to.  It's the right size that it will not feel like they are trudging on and on.  2 - 3 hours should do it easily.  If you have time, stroll up the hill to visit the campuses of RISD and Brown.  You'll want to go back to college.  \n\nOne tip:  Parking is extremely limited.  If you can walk, take an Uber or bus there you'll be better off.",
   "The RISD Museum is filled with items made by students and faculty and the exhibits change so you will always see something new and engaging.",
   "Very varied  and interesting collection including Monet, Picasso , Renoir and an Egyptian Mummy As well as architecture . Very worth while.",
   "Fine museum with something for everyone of every age! Wonderful paintings both contemporary and traditional, a huge carved buddah, a mummy and sarcophogus, Japanese swords, and too many more wonderful things to mention. Do not miss!",
   "RISD Museum of Art was bigger than I expected. The Gorham exhibit was fascinating and informative. The \"Raid the Icebox 2\" exhibits were terrific. A re-do from 50 years ago when RISD invited Andy Warhol to raid the icebox (storage) and create an exhibit, this year RISD invited 10 current artists to do the same. So fun to see the unique ways  to show the artwork."
  ]
 },
 {
  "name": "Historic Federal Hill",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/da/a2/c8/historic-federal-hill.jpg",
  "tags": [
   "delicious",
   "food",
   "food",
   "experience",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Lots of good food. This area was entirely Italian until about 15 years ago and has a number of excellent established Italian restaurants at a variety of price points. More recently it has acquired Mexican, Indian and several other sorts of restaurants. In addition, it has lots of pleasant atmosphere, including parades and street festivals, as well as authentic grocery stores and bakeries in which to purchase a variety of raw and prepared delicious Italian foods.",
   "Federal Hill is full of Italian Restaurants. In the summer you see a lot of people walking up and down Atwells Ave. There are so many restaurants to choose from, shops to visit or you can just sit on the square and enjoy the fountain. There is a little park that has checker/chess boards painted on the tables if you're interested in playing. You always see older Italian men sitting across from the square reminiscing & drinking coffee or smoking cigars. Along with a bunch of restaurants to choose from there are cigar bars if that's what you're craving. There are bakeries, steakhouses, Chinese food, hair salons, nail salons and places you can have your Tarot Cards read. If you are the dancing type come at night and you'll find a lot of Dance Clubs that are open until 2 in the morning. Back in the day there were Mafia all over the Hill but it's not like that today. There were even \"hits\" that made the front page of the Providence Journal Bulletin. Today it's a foodie's dream. ",
   "Have eaten at several Federal Hill places but have found equally good restaurants, outside the area, at more reasonable prices.  Yes, it has charm but so do many others.  However, if you want to experience an outstanding dessert place there, go to Pastiche. As people say, \"Their desserts are to die for! \"",
   "Federal Hill is Providence's version of a \"Little Italy\" in other cities. Given that Providence is a renowned restaurant city, one would expect the restaurants on Federal Hill to be excellent.\n\nOne would be correct.\n\nMy favorite is Massimo, on Atwells Ave., but I have never had anything less than a fine meal at any of the restaurants I have visited on the Hill. There is also Mexican and Chinese, by the way. There are also wonderful provisioners, like Venda Ravioli (MUCH more than ravioli!). Add some nice little parks, and you have the makings of a fun day trip for walking, lunch and provisions, or destination dining for dinner.",
   "Excellent Italian delis here - lots of choice of eating places and a nice atmosphere, easy walk from town"
  ]
 },
 {
  "name": "Rhode Island State House",
  "address": "82 Smith St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ef/e5/fc/photo3jpg.jpg",
  "tags": [
   "free",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "On my recent trip to Providence,I went to the Rhode Island State House.This idea of mine was provident.The free tour of the state capitol was very informative.I saw the interior of the spectacular dome,the original Royal Charter of 1663 which granted religious freedom to all who settled in Rhode Island,and Governor Gina Raimondi's State Reception Room.I saw fine portraits by Gilbert Stuart(\"George Washington\")and American Historic Painter,Emanuel Leutze's portrait of Civil War Hero and Rhode Island Governor Ambrose Burnside.",
   "We visited the State House on October 1. After the security check we went to the library on the second floor for the guided tour. Unfortunately the chamber and senate are closed for renovations.",
   "This building is at the end of an uphill walk facing the street so that it's full beauty is seen. It is classic with it's dome and structure, just beautiful. Unfortunately I cold not get in the day I was there but even from outside, it was worth seeing.",
   "We really enjoyed our tour as it gave us a lot of information on the state and the building itself was absolutely stunning.  Make time for this stop!",
   "A nice and beautiful state house. The security was so good that he allowed me to come in even though it was already after office hours. It was a beautiful inside and out. There were a lot of memorabilia on display. The dome inside is beautiful."
  ]
 },
 {
  "name": "Water Place Park",
  "address": "Memorial Boulevard",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/cb/73/05/water-place-park-and.jpg",
  "tags": [
   "delicious",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Went during the day in winter. I realize that’s not exactly prime visiting time but we were hoping to have a nice lunch along the river. None of the restaurants seemed to be open yet. There were some men smoking pot under a bridge. Even in sneakers the cobblestones were brutal on my feet.",
   "Even in daytime, even when there is no Waterfire, Water Place Park and Riverwalk offer one of the most spectacular views of downtown Providence and Providence Place mall any time of the year.",
   "The concierge staff was awesome. The handicapped access room was clean and easy to use, breakfast was delicious, location was perfect 👌",
   "...or a day!  This area is beautiful and seems to be progressing with new beautification projects and areas to enjoy the waterfront.  This was my first time to Providence and this is a great place to start!",
   "Nestled in downtown Providence, the park and river walk is a great place to spend a few hours with lots of restaurants and bars to enjoy. Try to see a Waterfire Illumination if possible."
  ]
 },
 {
  "name": "Brown University",
  "address": "1 Prospect St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/ae/f5/0d/dept-of-economics.jpg",
  "tags": [
   "walk",
   "walk",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "What can I say?  I love the Brown U campus. I went to college there and it was nice then, and maybe even better, now.",
   "I took a walk around this amazing campus and was amazed by the beauty of its architecture. It's only fifteen minutes from downtown Providence. ",
   "Brown is a beautiful university in the center of Providence. Take a walk through the center of the campus and admire the architecture. Like most campuses in cities it extends well beyond the main green and has buildings scattered about.",
   "Not much to do for tourists. The grounds and buildings are beautiful but I can't see any reason to make a special trip just to see it. ",
   "A good Saturday morning walk through beautiful grounds. As with any urban campus, the buildings sprawl out from the main campus a bit but overall if you want a respite from the city, you won't go wrong here. Check out the great front gate!"
  ]
 },
 {
  "name": "Roger Williams Park",
  "address": "Elmwood Avenue",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/69/52/51/roger-williams-park.jpg",
  "tags": [
   "history",
   "experience"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "The park is very beautiful, it has a big pond that has ducks, geese and swans that frequent it and many monuments that tell the history of the park and providence.",
   "With its numerous trees and shrubs of many varieties, Roger Williams Park offers a wonderful opportunity for \"leaf peeping\" without taking a drive into the country.  And you can also feed the ducks and Canada Geese that hang around the pond and elsewhere in the park.",
   "We visited in November and were still very  impressed with the beauty of this park. We can only imagine how wonderful this place is when \"in season\". The park has numerous walking paths and hiking \"trails\". It is spread out over a large area and is extremely well maintained. When you are in this park, you are actually in the heart of Providence, RI but you in no way get that feeling. As you experience the outer perimeter of the park you think... \"how lucky would I be to live in one of those homes?\", as there are neighborhoods that abut the park. Unless you notice that, you would never know you are that close to civilization. This park is a hidden gem!",
   "I was in the beachy part and my flip flops came off when I was doing a cartwheel. \nI found the left one but the right one is still there.\nIt was blue with a yellow thong.\nI had to leave it there because a goose chased me. \n\"Honk Honk!\" It said \"Honk Honk Honk!\"\nPlease contact TripAdvisor if you find my flip flop. \nI was by the bushes with all the bees",
   "We stopped here early before going to the pumpkin spectacular, it is a lovely park with many places to stop, relax, read, picnic, play. The casino is AMAZING. We were able to go inside. Drove through the park and stopped many times to take pictures and just enjoy the beautiful fall scenery. Wish we had more time to spend there- night time swan boats, carousel."
  ]
 },
 {
  "name": "Providence Performing Arts Center",
  "address": "220 Weybosset St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/32/db/87/providence-performing.jpg",
  "tags": [
   "history",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "My husband got tickets for the symphony here, Romeo and Juliet. Absolutely amazing and customer service was great ",
   "Very nice theatre to see a show at very good price. Happen to be walking by while visiting Providence and saw that a Bronx Tale was playing. Got lucky and scored half price tickets fir $44. ",
   "PPAC (Providence Performing Arts Center) is a beautiful place to see a show. There is a parking garage right across the street and plenty of places near by to eat before the show. One place to eat, right around the corner that I would recommend is Bravo. PPAC is beautiful inside. It's the place in Providence to see off Broadway shows and shows that were on Broadway. We've seen Annie, Godspell, Stomp, Blue Man Group, Mrs. Robinson and the Nutcracker. Too many to name. The inside of the theater is beautiful and the people who work there are extremely nice. I would highly recommend the PPAC if you want to see a show in Providence.",
   "The PPAC is full of history and tradition.  This building is your classic theatre with high beautiful ceilings.  I have season tickets so have been to many shows.  Some are terrific others not so much but always an enjoyable night.  There really isn’t a bad seat, even second balcony while a little far away is great.  The seats are a little small unless you are in the lodge.  Over the last few years they started allowing food and beverages in the seating area.   Would recommend this for anything from a first date to a 50th wedding anniversary.",
   "Over the years we have seen some wonderful productions at PPAC.  Among our favorites: Les Miserables, Jersey Boys, Miss Saigon, Phantom of the Opera, Book of Mormon and so many more.  We have never been disappointed!"
  ]
 },
 {
  "name": "Benefit Street",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/82/08/68/nice-walk.jpg",
  "tags": [
   "history",
   "kids",
   "walk",
   "run"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We had a very short time to see anything in Rhode Island. We chose to drive Benefit Street and saw the 1st Baptist church being taken care of. Although these may not be the #1 tourist attractions on tripadvisor, we enjoyed them immensely!! So much history. We went on to Plimouth Plantation that same day and also enjoyed that. It was at the end of September 2019 and we thoroughly enjoyed our one day in Rhode Island!!",
   "A great street and restoration area to explore. The Rhode Island Historical Society regularly has tours of the section of Providence, and they are worth enquiring about. The docents are knowledgeable and the walking tours are not too strenuous.",
   "Benifit street!\n>clap clap<\nwhere all the kids meet!\nclap clpa<\nget a sandwich with meat\nat Geoffs' \nand see some art on the street\nclap clap\nthere's a fountian that's sweet\nclap\nBenifit street!!!",
   "We decided to go to Providence from Texas on a whim and it turned out great. The people are friendly and the areas like Benefit Street near Brown University is wonderful for strolling. ",
   "This is a great area with many beautiful old buildings. However, you have to walk very carefully and make sure you don't get run over by a crazy driver. Some drivers won't stop at a crosswalk.  Make sure you're health and life insurance is updated. "
  ]
 },
 {
  "name": "The Stephen Hopkins House",
  "address": "15 Hopkins St Corner of Benefit & George Sts.",
  "avg_visitor_review": "5.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/4f/b8/54/governor-stephen-hopkins.jpg",
  "tags": [
   "history",
   "free",
   "history",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Stephen Hopkins was the founding father and governor of Rhode Island and signatory of the Declaration of Independence. George Washington had stayed at this house. Their are many gorgeous artifacts and heirlooms. The tour is fascinating and highly recommended.\nThis is NOT the house of Stephen Hawking the English theoretical physicist, cosmologist, and author - as one of the reviewers posted.",
   "Informative tour provided by dedicated volunteers. I've lived in Providence for nearly 20 years and have passed by this place many times. I'm ashamed to admit I never knew its history. ",
   "Mr.H opkins himself brought our tour to life, not a boring, staid museum visit by any means.highly recommend.",
   "Took tour of Stephen Hawkins house will visiting Providence. Good history about Hawkins, his story and signing of Declaration of Independence. Tour is about an hour and is offered for free. Hours are limited, we got lucky to there when they were open. ",
   "So much history! Great tour with Alex, our fabulous guide. In a great location that we found just walking around the Brown area. And it’s Free!! We would definitely recommend!"
  ]
 },
 {
  "name": "Providence Children's Museum",
  "address": "100 South St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/b3/47/52/providence-children-s.jpg",
  "tags": [
   "drink",
   "run",
   "kids",
   "learn",
   "free",
   "kids",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Great place to take small children. My toddler loves almost all of the exhibits here. The water room is on the first floor and is his favorite, but we always save it for last because he usually gets wet. Even with the smock on, water can run down his arms onto his shirt, and also he can get his shoes wet. Bring a full change of clothing so your little one can leave dry. Bring some rain boots to wear to keep feet dry. There is a parking lot that gets full on busy days but you can always find a parking spot at a meter within 1-2 blocks of the building. There’s a lunch room to eat and drink (bring your own) and numerous rest rooms with changing tables on the two floors. Your child will have a good time here! ",
   "If you are looking for a super gift for families that have young children, a season pass to the Providence Children's Museum is a great one to consider. The Museum has many, mamy hands-on exhibits for children of all ages (less so for adolescents). They can have fun, be loud, and it is all part of the learning.",
   "We have taken several of our grand kids here. They love it! Always a worthwhile trip. Plenty of places to play and learn. I like that the gift shop was turned into a room for snacks.",
   "Took grand children for a Sunday morning day out. \nHad a great day.  Discovered lots of fun activities both inside and outside with water play a big hit. \nReasonable admission prices but no discounts for Seniors.",
   "We love coming here almost as much as the kids.  The water activity room is awesome, but be careful you will ultimately get a little wet....if your child is younger or messy suggest bringing a change of clothing just in case. Bathrooms on each floor with stools for the kids ( also great if your little one is potty training). Themed rooms and pretend play.  The staff does a good job to keep the areas organized.  Some of the rooms like the Boat are very cramped so when your child runs in to play it can be hard to keep your eye on them at all times. The museum also had a great area for snacks and lunch which is kept clean. They do not serve food.  Storage area for coats and diaper bags ( free)."
  ]
 },
 {
  "name": "Providence Train Station",
  "address": "100 Gaspee St",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/fd/55/14/ta-img-20170416-112521.jpg",
  "tags": [
   "drink"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "A nice,convenient location and easily navigable. We train into here from Boston (and back) on the MBTA commuter rail. Small, well-kept and centrally located. Can also catch shuttle bus from here to other locales in Providence.",
   "Rather than driving or flying to areas near Providence, the Amtrak trains bring you to the Providence Station in 2-3 hours with no stress of driving on roadways or the inconvenience of bad weather. The station is heated with enough room to stay inside waiting for a ride (also Enterprise will pick you up if you want to rent a car). The station is modest in size and amenities but also without the crowds and noise of bigger stations. It would be nice if the elevator were closer to the escalator for going upstairs from the tracks, but that is the only downside.",
   "Crowned by its impressive rotunda, the Providence Train Station  serves both Amtrak and MBTA intercity trains. It is convenient to downtown, the Convention Center, Providence Place mall and the Dunkin' Center. It has ample indoor parking for a fee as well as short-term metered parking on the street.  ",
   "The train station was clean, organized and efficient.  Taxi's are waiting outside to take you to your downtown destination, or a car rental office as I did.  Providence is an old town with a young vibe.  Loved it.",
   "We've traveled in and out of the Providence station several times and find it very easy to navigate. Small in size, but large enough to get a bite to eat or something to drink, and to sit and relax while waiting for the train.  Rental car services are not available right at the station; however, call Enterprise in downtown Providence to reserve a car ahead of time. Someone from Enterprise will pick you up when you call them upon arrival, and also take you back to the train station after you return your car. Works out pretty well!"
  ]
 },
 {
  "name": "DePasquale Plaza",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/76/4b/f9/fountain-centerpiece.jpg",
  "tags": [],
  "source": "TripAdvisor",
  "reviews": [
   "There is a huge fountain in the middle of this square and sitting ot it's edge on a warm summer day is just a real treat. Sit htere and watch a varity of people going by and enjoy the ambiance of the area. It is surrounded by Italian eateries and in season it is strung with Christmas lights above it all. Very scenic.",
   "What a perfect place to watch the Columbus Day Parade. Best seat in the house. The Square has several restaurants where one could eat an amazing Italian meal. This seems to be the center plaza where everyone congregates at. A beautiful fountain is in the center, a perfect place to take pictures. Each of the restaurants seem to have outside dining options as well as seating inside.",
   "The main plaza in the Federal Hill section. Has lots of restaurants around it as well as love music at times. Worth strolling though if you’re in the neighborhood. ",
   "First time in Federal Hill and absolutely loved DePasquale Plaza!\nThe vibe, the people, everything about this place is amazing!!!",
   "it was so much fun.  Live music at night and on the weekend afternoons.  Fun place to people watch from the bar at our hotel. "
  ]
 },
 {
  "name": "Providence Athenaeum",
  "address": "251 Benefit St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/10/3b/e3/photo0jpg.jpg",
  "tags": [
   "family",
   "kids"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Our family of four loved this museum, it had an incredible variety, was just the perfect size to keep the kids entertained and the exhibits were incredible. Highly recommend. ",
   "I highly recommend you pop by- it's by everything in Providence and won't take up too much of your time. When I was there, there were students studying everywhere so we crept about quietly for a few minutes just to soak up the vibe. Excellent library!",
   "Wandering along the paths in Swan Point Cemetery gives birdwatchers an opportunity a chance to see a wide spectrum of species from owls and woodpeckers in the trees to swans and wild turkeys on the ground any time of year. ",
   "We had 1 day in Providence.  We usually love to stop by libraries especially when our children need a break from the other tourism stuff.  We did the self-guided Raven Tour.  We purchased Athenaeum stickers & post cards.  We read a few books in the Children's section & frankly could have stayed here for a the afternoon.  This library was cool & we are glad we stopped by.",
   "We simply loved it. The ambience has to be experienced to understand.\n\nMy wife is an avid reader and could have stayed there all day ... the names on the shelves are amazing. For me, I enjoyed sitting and reading the paper. There was no effective aircon, so best to visit on a cooler day.\n\nDelightful! Highly recommended."
  ]
 },
 {
  "name": "Seastreak Ferry",
  "address": "25 India St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/4e/4d/1b/our-ferry-offers-all.jpg",
  "tags": [],
  "source": "TripAdvisor",
  "reviews": [
   "Everything went well. It is a clean ship with friendly people. We enjoyed a smooth ride across and enjoyed the scenery along the way.",
   "Seastreak bus picked us up near hotel. The actual ferry ride from provedence to newport was nice and took about an hour.  On the return from Newport back to Providence were told there would be shuttle waiting to take us back to downtown Providence.  Well, that didnt happen, after about 10 mins in kind of a sketchy part of town and no shuttle in sight made call to Seastreak and they seemed to be confused about any shuttle service offered?  Ended up spending $15 to get back to hotel.",
   "We drove from Providence to Newport one day and took the ferry round trip the next. The ferry was absolutely the best way to go, avoiding heavy traffic and dropping you right in the busy Newport harbor area where you can easily get an Uber to the mansions or other sites. The trip itself is invigorating!",
   "Very reasonable. no worries about driving in Newport or parking. Drop off is great location close to everything. Beautiful ride past lighthouses, beaches and the Newport Bridge.  Great way to see Rhode Island from the water.\nFireworks under the lite up Newport bridgewere awesome.",
   "We booked ferry to Marthas Vineyard months before due travel date but due to Hurricane Dorian travel was in doubt. Arrived at terminal and reassured trip will go ahead until 15 mins before departure when cancelled as no available berth on the Vineyard. No fault of Seastreak and am glad to say that they immediately provided a full refund of ticket cost and valet parking fee with an apology. Very dissapointed not to travel but would return if in this area again as excellent service provided in adversity"
  ]
 },
 {
  "name": "Swan Point Cemetery",
  "address": "585 Blackstone Blvd",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/c3/91/f5/grecian-swan-point.jpg",
  "tags": [
   "peaceful",
   "walk",
   "historic",
   "walk",
   "peaceful",
   "walk",
   "history",
   "peaceful"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "While it admittedly feels a bit strange to be reviewing a cemetery, I felt that it truly deserved a mention as a gorgeous place to enjoy either a peaceful walk, drive, or meditation spot. The area was impeccably well-kept, even when I visited in the winter, and I can only imagine how beautiful it must be in the spring when all the plants are green and blooming. \n\nThe cemetery itself is mostly historic, and if you have time to explore you can find the graves and monuments of famous Rhode Islanders, such as the writer H.P. Lovecraft. If you meander to the far back, you can overlook the water and enjoy the view and stillness. \n\nThe only caution I would give is that it can be a bit maze-like, so be sure to remember where you are going or download a map (I found one online) unless you are blessed with a great sense of direction!",
   "A tree museum and a cemetery - it is a beautiful place to walk.  If you can be there when the trees bloom in the Spring you are in for an added treat.",
   "We visited this place on October 2. In the office building you can get a map and a booklet with the principal monuments and graves. There are several bronze monuments.",
   "I use Trip Advisor for everything and now I can add advanced planning to my list. Unfortunately we lost two very special friends this past year and both are buried here. I have also been there to visit these loved ones graves to pay respect. Not sure how to explain it, but there is this serene and peaceful feeling every time I have been there. It is a 200 acre park like cemetery. \n\nWe made plans to visit with Linda and learned so much from her. My husband and I were both pleased that we chose our final resting place. We also met the Foreman of the Cemetery Jim who was so pleasant and kind. There is so much history here and let's face, we are all going to need a final resting place. My husband and I both felt at peace with our decision and the grounds, trees, and entire landscape are meticulously cared for. \n\nIt is a beautiful place to walk and enjoy the grounds! There are lots of birds and we even saw a flock of turkeys walking around.",
   "Beautiful 300 acre cemetery. Walking around you can tell that a lot of care goes into this place daily. The trees are beautiful and there is an area along the water that is peaceful. "
  ]
 },
 {
  "name": "Providence Place Mall",
  "address": "1 Providence Pl",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/30/6c/ac/louis-at-providence-place.jpg",
  "tags": [
   "food",
   "experience"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Very impressed with Providence place mall. Easy parking and access to all floors.Definately bigger and better than our local Cape cod Mall. Worth the drive.",
   "It is no surprise that prestigious Nordstrom's left this mall.  This mall is a hang-out for teenagers.  I did not feel safe here.  Reports of incidents have made the newspapers.  ",
   "Your racist manager kicked me out last night after 45 seconds in your restaurant. He screamed at me. He threatened to call the police. I hope you understand how disgusting this location is. Perhaps the entire company, considering no action has yet to be taken.",
   "Made an excursion in Providence to Providence Place. I love that this mall has indoor parking--although finding a spot can be a chore.  There are so many stores in this place and I don't believe we explored the entire property.  The food court was okay; a bit disappointed that vendors didn't offer trays to carry food; made carrying bags and food a bit tricky & clumsy.",
   "We came from nyc to providence Rhode Island and visited this mall for the Black Friday and it was a great experience "
  ]
 },
 {
  "name": "John Brown House Museum",
  "address": "52 Power St",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/c2/5f/01/photo1jpg.jpg",
  "tags": [
   "family",
   "history",
   "historic",
   "history",
   "family",
   "history",
   "walk",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "The Benefit Street tour starts from the John Brown Museum. You have to book advance and it is a great way to find your way around the historic sites of Providence. Geographically, the tour covers a distance from about the middle of Benefit Street down to the northern end of the street; and historically it roams from the earliest settlers right up to the modern day. The history of Brown University, and the mega rich Brown family who set it up, are inevitably a big part of the story. The family patriarch John Brown features prominently and our guide didn’t shy away from Brown’s less than proud history of slave ownership. There’s also a visit to the Providence Athanaeum, site of some Edgar Allan Poe scandal, and a tour of the First Baptist Church of America, which looks exactly as you would hope a New England church to look. The tour does take a very long time and our teenager was getting a bit fed up at the end, but it was interesting and we learned a lot.",
   "Recently,I visited the John Brown House.My visit was a fruitful experience.The guide at this house museum was very well-versed in Rhode Island History.I learned about the life of John Brown,a very prominent figure in the history and growth of Providence.I saw the house's shadow rail staircases.I saw some nice American paintings by Robert Feke,Alvan Fisher(\"View of Providence From The Cove\")and Henry Kinney(\"Moses Brown\").",
   "If you are in Providence this is a must see if you want to get an understanding of local history and the movers and shakers during colonial times and the early years of the republic. The Brown family has obvious ties to Brown University. A tour of the Historic home will last about 1-2 hours; it makes sense to take the guided tour to get a better appreciation for the home and history of the Brown family. One of the interesting things which the tour guides do not shy away from is the fact that the Brown family did have ties to the Atlantic Slave Trade. They cover the complexities of this very controversial time in history. If in Providence I really believe this should be a stop you make. Well worth the price of admission.",
   "I was in Providence on a business trip and only had a few hours of spare time. I chose to visit this gorgeous historical house and made my stay worthwhile. You can listen to an audio, read a brochure or have a guide walk you through the details of this magnificent house. George Washington supposedly stayed there and gave it a five-star rating. The best thin is that it only cost me $10.",
   "This house has a lot of history, If you have about an hour take the audio tour\nmoderately priced and the staff are friendly and knowledgeable"
  ]
 },
 {
  "name": "Thayer Street",
  "address": "Thayer Street",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
  "tags": [
   "family",
   "kids",
   "food",
   "food",
   "kids",
   "food",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I love going shopping and eating one Thayer St.. There are just so many great small shops and restaurants that cater to every age group. Lots of course for the college age kids as Brown University is in their backyard so to speak. and within just a mile or so from other private schools and colleges.However the adults from all over the State know it is a hub for nice clothes and good food. You can get just about anything on this strip from a bagel to a high end meal. From a pair of socks to custom made suits.Low prices,High prices. Remember,not all the kids have a rich dad or mom..Most of these kids are one thing and that is for the most part, very,very,smart.You do not get into Brown unless you are  smart.and the private schools and other colleges in the area tend to get the smart ones as well. This street is smart,it caters to every person who comes here.and it does it just so well. It is a fun place and you will just have a good time and get some great items as well.\nThe food is really good quality or it will not last here.So,Thayer st.calls to you. bring your whole family. They will love it here.",
   "Some of the best Greek food I have ever experienced.  Finding parking is a very big problem especially when Brown and RISD are in session but still worth it.",
   "Awesome street filled with shops and restaurant. Definitely check this street out if your in Providence looking at schools. The perfect street for college kids to gather, eat, etc. the Brown University Book Store is in Thayer Street. The best place to go grab a bite to eat while exploring the beautiful campuses of RSID and Brown. Everything from Ben & Jerry’s, Shake Shake, Chipotle, pizza, pita, smoothies, fro yo, Starbucks. I know my kid would have plenty to choose from while in college here. ",
   "Super hungry recently and spotted the Chipotle from the corner of my eye. Went in and the vibe in this place is great. The line moves ridiculously fast and the food was amazing. I had a chicken bowl with brown rice and black beans and a side of their house made vinaigrette and left super satisfied and craving more menu options. Will definitely be back",
   "Thayer has a bit of everything including a wide assortment of restaurants which serve food from a wide variety of nations.  Andreas (Greek) is especially good.  But, many of the little hole in the wall cafes serve very good food. Very international.  Lots of shops with funky and avant guard objects to buy.  Parking can be a little dicey depending on the time of day and it is metered.  A great place to stroll and share a meal."
  ]
 },
 {
  "name": "India Point Park",
  "address": "Gano Street",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ca/57/69/photo2jpg.jpg",
  "tags": [
   "peaceful",
   "walk",
   "walk",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "At the head of Narraganset Bay. Well appointed and offers nice views to the south. A peaceful green space just off downtown.",
   "Situated on the shore of the Seekonk River and Narragansett Bay, India Point Park is a lovely place with wonderful views.\n Super for sunbathing in warm weather, a leisurely stroll, or walking dogs as I used to do when I still had dogs. ",
   "We were staying at the Hilton Garden Inn, which is right across the street from this park. There is a walking trail, benches, fishing and a playground, on the water. It is a nice spot just to walk and look out over the water. Peaceful.",
   "Went for a walk on Sunday along waterways in Providence city. Walked past India Point Park and saw many mobile food stalls in a Food Festival. Have to pay $20 for entry ticket. ",
   "Came here today for the seafood festival. It was a nice spot on the river. Would be a nice place to stroll or hangout. Did not see a playground."
  ]
 },
 {
  "name": "Roger Williams National Memorial",
  "address": "282 N Main St",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/1e/c7/a9/roger-williams-national.jpg",
  "tags": [],
  "source": "TripAdvisor",
  "reviews": [
   "A very nice green space in the middle of Providence. A fitting tribute to Roger Williams and his efforts to establish a civil existence in the New World. Small and beautiful!",
   "This could easily be the smallest national park in the US.  It is about two blocks long.  The main attraction, the Roger Williams water source was fenced off.  The visitor's center has helpful park rqngers and five minute video.",
   "It was nice to talk to the officer in the visitor center. She was very well informed and personable. Liked the white board comments too.",
   "Free parking, small visitor's center. My son printed the Junior Ranger booklet from the website at home so he had most of it filled out before we got here. We watched a 5 minute video about Roger Williams, who seems to have had such modern ideas for his time. We spent about 15 minutes here and then we were done!",
   "A nice spot in downtown Providence. With that being said there is not much to see here, but if you’d like a quick stroll it’s a nice spot for it. "
  ]
 },
 {
  "name": "Roger Williams Park Botanical Center",
  "address": "1000 Elmwood Ave",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/1a/5f/de/tropical-sites-and-feels.jpg",
  "tags": [
   "walk",
   "walk",
   "kids",
   "low",
   "run"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We went to the Botanical Center while visiting the park. The cost to get in is nominal (less than $5 per person). There are several green houses to walk through as well as outdoor gardens. They really have a lot to see, although I'm sure it's prettier in the Spring. They even have goats! Worth the cost of the visit for sure.",
   "It was a very clean but small property. It was worth the price ($5 entry). A few greenhouses and outdoor gardens. When we visited there was a hawk stuck in one of the greenhouses",
   "The greenhouses can be warm so you take a chance when having a wedding in July. However, the weddings and receptions are scheduled after 6PM, which helps. Spring and Fall weddings are perfect for this venue, but those dates go quickly. The staff is really great too.\n\nIf you are like me, because the greenhouses are so wonderful, it is a perfect location for a wedding celebration.",
   "We had a nice walk through the gardens and it only costs $5 each to get in. The goats and koi pond were a nice addition, but the outdoor gardens were on the small side. ",
   "It’s a lovely garden, A bit relaxed with weeds showing here and there, empty spaces missing plants, some plants are not doing well. We still enjoyed walking and let the kids run. Considering the price is very low, you kind of get what you paid for. "
  ]
 },
 {
  "name": "The Providence Flea",
  "address": "475 Valley St WaterFire Arts Center",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/79/f9/5b/aerial-view-of-pvd-indoor.jpg",
  "tags": [
   "walk",
   "food",
   "experience",
   "unique"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Went for morning Sunday walk along Providence River. Passed by Flea Market and bought a freshly made lemonade. A lot of stalls selling home made handicrafts.",
   "The best place to find unique items, including vintage and hand crafted.  Great selection of vendors.  Indoors in the winter and outdoors in the spring & summer.  You can also find the best food trucks in Providence!  I always find something new and fun each time I go.\n\nPSA: This is not a yard sale experience!",
   "Has some of the most original items in Rhode Island. Great for Christmas gifts. Some of the highlights are pottery, candles, body products, vintage clothes, art, jewelry.",
   "Small venue overpriced not like advertised was disappointed . Free parking a plus Tshirts sold for 39.99 by a vendor found for $10 in stores.",
   "Went to the flea for the first time this summer.  Have to say I was quite disappointed.  There were very few vendors there and the ones that were had things that were quite expensive.  When you see flea market you think, recycled, used, or lower priced.  While I did enjoy some of the vendors, I have to say we did the whole market in under an hour.  It's in a pretty spot but that's about the best I can do."
  ]
 },
 {
  "name": "Prospect Terrace",
  "address": "Congdon St. and Cushing St.",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/68/a0/4b/view-of-providence-downtown.jpg",
  "tags": [
   "hike",
   "walk",
   "history",
   "run"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "An awesome overlook for the city. There is an impressive statue of Roger Williams here, as well, but the panoramic view of Providence and back north is well worth the hike up here.",
   "I think at some point there may have been a great view from here but the trees in front are so tall, most of the view is now blocked. An uphill walk for very little view.",
   "This is where you go to see the panorama that greeted Roger Williams (with a lot fewer buildings, or course). The park is lovely and you get a good sense of the city from this high point.",
   "Whenever we have guests and want to give them an overview of Providence we go to this park.  It is a wonderful place to talk about the history (both colonial and modern) of the city.  And not a bad place just to chill out either.",
   "I found this place while on a run on College Hill, and came back to watch a sunset with my girlfriend.  It might be the best view of Providence that you can find.  It's a nice place to share a quiet moment with good scenery, definitely worth a stop."
  ]
 },
 {
  "name": "Wickenden Street",
  "address": "",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/9e/64/89/pub-sign.jpg",
  "tags": [
   "walk",
   "walk",
   "food",
   "family",
   "unique",
   "unique",
   "food",
   "unique"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Went for nice walk along Wickenden Street neighbourhood. There are a lot small cafes,  hair saloon, restaurants, etc. ",
   "this street is so unique with all of its shops,restaurants,and other neat things to see and do here. I love to shop here as you can get items made by some of the shop owners. Great food at restaurants serving foods you may never have had before. American food to foods from all over the world. The shops are for the most part small but packed with goods again from all over the world.A great family trip with everything a short walk away.  Everyone will have a great time and you will have discovered a whole new world of shoping. I love my trips here and always come away with a new treasure and have had a great meal. I love the restaurants here but I have made it a hunt to always go to a different place each time. I have learned so much about foods of the world in this way. A go to location.",
   "Great place to find unique gifts by local artists.  Fun shopping with my daughter over the Christmas holidays.  ",
   "Great Food and Atmoshere. Friendly staff and clean environment. I would put it on my list when in Providence, Rhode Island",
   "My daughter lives on Wickenden Street right across from India Point. They have many activities there on a regular basis, including a Flea Market every Sunday. Sometimes theres entertainment, sometimes food trucks. It's all good. But one of the best parts about the street are the unique shops on nearly every block. Many artistic shops with items from local artists and it's fun to just stroll down the street and look-but not so easy to go without buying something you fall in love with."
  ]
 },
 {
  "name": "Providence Art Club",
  "address": "11 Thomas St",
  "avg_visitor_review": "5.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/68/bf/cc/old-world-style.jpg",
  "tags": [
   "food",
   "historic"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "... and sometimes challenging.  The current exhibit (opened mid August) is sort of a tribute to the horror writer H P Lovecraft and may not be to everyone’s taste but still interesting.  In both galleries.  There is parking in the small lot off of Benefit St",
   "I went at the invitation of a friend of a friend who is an artist and member of the club. The food was very nice, the atmosphere great for discussion among a group of friends, quiet and elegant. ",
   "Went to the recent small pictures exhibit.  All from local artists and all under $300.  Really fun in such a beautiful building.  Will be back next year! ",
   "We went to their members show and there was work after work that I would like to own.  The building is a classic and the art inside in show after show is great. They have a small parking lot off of Benefit St.  In Providence put this on your list",
   "I've enjoyed the variety of the artwork. Though small, they display the art beautifully, the building is historic. The exhibits excellent. Great for a group that wants a little art but not a huge museum.\n"
  ]
 },
 {
  "name": "The Vets",
  "address": "1 Avenue of the Arts",
  "avg_visitor_review": "5.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/50/47/72/the-vets.jpg",
  "tags": [
   "historic",
   "experience"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We are lucky to have so many beautifully restored historic buildings in Providence with The Vets being one of them. They host some great oldies groups and also have a series of performances for school children such as Harriet Tubman/The Underground Railroad and others. Conveniently located off Rt 95, near Providence Place Mall and Renaissance Hotel.",
   "No matter which event you decide to pick, the supreme delightful orchestra along with solo instrumental or solo vocalist, this venue allows us to experience the finest works of Tchaikovsky, Mozart, Beethoven, Brahms as well as the Unforgettable Overture of 1812! It is truly an utter joy to return year after year to hear such marvelous vivacious musical creations in such a beautiful theater, it's worth the trip!",
   "The orchestra seats offered plenty of legroom and were generously sized.  The auditorium was beautiful;  the staff were v very courteous.  ",
   "I went to the Cruel Intentions: The 90s Musical at The Vets Memorial Auditorium spur of the moment on the last evening of a business trip. I had such a wonderful time! I was able to buy tickets at the door and all the staff was nice and helpful. The event was well managed with a courteous audience. I didn't know what to expect of the off-broadway musical, but any expectations I I had were blown away. I loved the production and the venue.",
   "First time at the Vets. Went to see the Red Hot Chili Pipers. Beautiful venue. Polite, friendly service. Great location. Right next to Providence Place Mall,  Renaissance hotel and many great restaurants. "
  ]
 },
 {
  "name": "Providence College",
  "address": "1 Cunningham Sq",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/37/00/9a/providence-college.jpg",
  "tags": [
   "tranquil"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Providence College is a special place in a tranquil Northeast college campus setting with manicured grounds and traditional brick buildings. Courtesy and strong values rule the day among the 4000+ underclassmen students. If I were to select one word to describe PC, the word would be that the tremendous Faculty, Staff, and Administrators CARE.  ",
   "My son and I went there for his advising/registration day.  It was a beautiful campus and I look forward to him starting there as a freshman in Fal 2019!",
   "Great school& beautiful grounds.\nPeople very friendly & helpful .\nDon’t miss the Chapel! And of course the basketball games.",
   "My daughter and I went on a college tour and participated in an information session.  The campus is absolutely beautiful!  The grounds, athletic fields, and the furnishings were immaculate!",
   "College tours are all about the buildings and the tour guide (and the weather). We were blown away by how beautiful Providence was... it is immaculate.  The school may not be for everyone but the campus itself sure is....  beautiful campus in a working class area of Providence... but really you are cut off from the world in this little bubble... Great student union, great athletic facilities, great feel to campus... well done Friars!  Great tour... beautiful campus!"
  ]
 },
 {
  "name": "Dunkin' Donuts Center",
  "address": "1 La Salle Sq",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/17/e2/a1/dunkin-donuts-center.jpg",
  "tags": [
   "drink",
   "walk",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Why go to Boston and literally pay 10x more for tickets for an event when you have this option?  If you have young (or older!) children who want to see quality live ice hockey, spend $38/ticket instead of the $400 in Boston.  Great restaurants, quality hotels within walking distance, reasonable parking make this a no brainer.  Providence Bruins hockey (AHL) is good, fast paced hockey.  A 24 oz can of beer cost $13 for reference.  We sat in the 6th row behind tunnel for the player for $38.  What a deal.  Marriott offers two hotels within walking distance for about $200/night, parking $30/night at the hotel (cheaper in some of the parking garages) and you can walk to Federal Hill for an outstanding Italian meal in 5-7 minutes before or after the game.  Also a couple of nice pubs outside the venue where you can actually get a seat after the game and sit and talk with a drink (we went to Murphys) - but head right over there because there will be a crowd if you wait too long.  Also college hockey, basketball, Globetrotters, concerts.  If you can't already tell, I am a huge fan of this venue!!!",
   "Went to recent Providence College basketball exhibition game. Nice venue to watch game. My biggest gripe is the outrageous prices charged for concessions. \nSoda $6.25\nBottle of water $5.00\nSmall popcorn $9.00\nCan of Beer $13.00\nAnd so on and so on. \n\nThere must be a point where it is considered price gouging. \n\nGonna have to wait till I hit the lottery in order to go to another event at this venue\n\n",
   "My daughter loves John Mayer so we went to his concert here on the way home from the Cape. I paid $30 to park directly across the street and it was worth every penny because we waited less than 10 minutes to exit lot and hop onto 95, which was just a few miles from venue. The venue seats around 12,000; we sat in section 230. Aside from a giant, annoying piece of equipment hanging from ceiling and blocking view of center of screen, we felt close to the stage. This size venue was great for an artist like Mayer. The concession areas were mobbed and lines frustratingly  blocked walking paths. I’ve never seen so much beer for sale in my life. The DD stands sold only coffee and hot chocolate. Concession food looked unappetizing. The fried dough stand sold a decent-tasting snack. Providence is a small, easily navigable city. I’d return to this venue despite the few minor annoyances. Close to Federal Hill for a good meal. ",
   "Service was slow. Limited selection since they had started closing procedures 2 hour before closing.",
   "It was with much anticipation that we went to see James Taylor and Bonnie Raitt in concert.  The venue proved to be a more intimate setting for a concert and both the graphics and audience participation were fantastic!  We would go back to see another concert!"
  ]
 },
 {
  "name": "First Baptist Church in America",
  "address": "75 N Main St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/77/34/35/igreja-ao-fundo.jpg",
  "tags": [
   "history",
   "historic",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I was really excited about visiting the first Baptist Church in America, however, was very disappointed that it was closed during my visit and there were no signs of when it would open.  ",
   "A beautiful church with tons of history as well. It’s close to many other sites and within walking distance of bars, restaurants etc. ",
   "It seems that every decent-sized town in the United States has a First Baptist Chuch, but THIS is The original FIRST Baptist Church in America!  Got that?  Good!",
   "I gave it a very good because it’s still a great historic building but right now it’s covered in scaffolding. 2.00 a person gets you a tour which is still very interesting. Learn all about Roger Williams and the need for religious liberty. Neat place.",
   "Now here is some religious history for you!  Seeing the first baptist church in America. It is an outstanding building that is currently getting some cleaning so you see plenty of scaffolding on the outside. Located in a beautiful part of the city and within easy walking distance form several other sights. "
  ]
 }
]