[
{
 "name": "Roger Williams Park Zoo",
 "address": "1000 Elmwood Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/8f/e5/81/free-roaming-sloths-explore.jpg",
 "tags": [
  "music",
  "nature",
  "food",
  "kids",
  "food",
  "walk",
  "food",
  "music",
  "nature",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d105259-Reviews-Roger_Williams_Park_Zoo-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visit this zoo in the evening ever October for their annual Jack-O-Lantern display, a very special night, walkthrough the zoo and view lit up artwork on pumpkins, there is music in each section, concession stands with great snack before entering the path, brought my mom in a wheelchair, it’s is a concrete/gravel path.  Excellent Autumn event to attend, close park near by to visit in the daytime has Swan boats, a carousel and just gorgeous Mother Nature at her finest for Fall foliage!",
  "We had a fantastic day! We got to see our favorite animals and my kids discovered the red panda making it their new favorite! We got the opportunity to have our faces painted and feed the giraffe, pet goats and alpacas and even pet an armadillo, we also went on a camel ride too! \nThe food was pretty good, with several options, even healthy choices! \nThe zoo was very clean, the staff very nice and the biggest question at a zoo..... how were the animals living conditions: immaculate! The animals looked happy, healthy, well fed and their home/enclosures were very clean.",
  "I have always loved this zoo! Roger Williams Park Zoo is an amazing place to visit because it allows people to get hands on with the animals as well as provides a great educational experience! The walk around the zoo is easy and fun and you get to travel through a variety of continents and the wetlands area. The zookeepers definitely do a great job caring for the animals, as all of the animals are in great health and live a great life! Would definitely recommend that you pack your own food due to the quality and cost and there are many places to picnic throughout the zoo! Definitely worth a visit!",
  "Visited the Zoo on a unseasonably warm day in February. It was very nice especially for a 4 and 6 year old, they loved it. The displays and zoo overall was very well kept and clean. We will definitely visit again.",
  "We love Roger William's Zoo! They have all the \" typical\" animals you find in a zoo. There are lots of things to do. It's a great place for people of all ages. They rent strollers, wheelchairs and electric scooters if you are in need of them. Employees in the park are so nice and helpful. They have typical fast food so if you want a nutritious lunch I suggest you bring a packed lunch. It's a great place to spend the day!!!",
  "We visited on a rainy winter day and we may have been the only people there. This zoo is lovely. We understood that with the rain we wouldn’t see all the animals. But we got to see many of them since multiple enclosures included an indoor viewing area in addition to the outdoor area. We even saw some animals that we haven’t seen in any other zoo yet. I can definitely see this place getting crowded in the summer or during special events. ",
  "We visit this zoo in the evening ever October for their annual Jack-O-Lantern display, a very special night, walkthrough the zoo and view lit up artwork on pumpkins, there is music in each section, concession stands with great snack before entering the path, brought my mom in a wheelchair, it’s is a concrete/gravel path.  Excellent Autumn event to attend, close park near by to visit in the daytime has Swan boats, a carousel and just gorgeous Mother Nature at her finest for Fall foliage!",
  "The zoo at Roger Williams park in providence Rhode Island was fun, a little small but lots to see and very family oriented"
 ]
},{
 "name": "Rhode Island School of Design Museum of Art",
 "address": "224 Benefit St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a7/03/c5/rhode-island-school-of.jpg",
 "tags": [
  "walk",
  "art",
  "nature",
  "history",
  "unique",
  "art",
  "free",
  "art",
  "sampling",
  "family",
  "walk",
  "art",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d104606-Reviews-Rhode_Island_School_of_Design_Museum_of_Art-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I visited the RISD Museum in Providence, Rhode Island on Sunday, July 14, 2019. This is an excellent museum with all galleries well laid-out and nicely curated with an outstanding collection of various types of art.  All the write-ups throughout the museum were quite educational and interesting addressing cultural, historical, political, social and religious aspects of the art, depending upon what was applicable.  The special exhibit on Gorham Silver was exquisite and definitely worth seeing.  This museum is definitely a hidden gem!!\n\nOur visit to the museum took about two hours, based on the amount of time available to us, but it could easily have taken well over 3 hours to be able to absorb and appreciate all the artwork on display. We definitely needed a map to get around the museum because of the way all the galleries are connected throughout multiple floors and buildings.  The only real drawback to this museum is parking.  Fortunately, we were able to find a space on Benefit Street, a convenient walk to the museum.  However, finding a space may not have been easy if school was in session. \n\nWe really liked the 18th and 19th Century American exhibits, especially related to the Pendleton House rooms.  These included the rooms with the titles: ‘The China Trade Room’, ‘The Well-Furnished Farmhouse in Providence’, ‘Two Generations of Rhode Island Cabinetmakers’, ‘Cabinetmaking in Newport’, ‘Gambling Collectors - Tea Pots’, and ‘The Charles Pendleton’s Library’.  All the furnishings in these rooms were very impressive.  Even the curtains were beautiful.  Touring these rooms was like a walk back through time.\n\nThe Ancient Greek and Roman exhibits were nicely arranged with many objects, such as, bronze, metals, Roman Jewelry and coffins, coins, sculptures, Greek Funerary, figures from different cultures and vases, vessels and flasks for the Greek Gods and Goddesses and much more. All the objects displayed in these galleries were well preserved.\n\nThe European Art featured very impressive paintings by many masters under multiple classifications such as ‘Painting Modern Life’ with Impressionists using new techniques in their brushstrokes, ‘Painting Landscapes’ with a heightened regard for nature and ‘Abstracting Modern Life’.  All these paintings were beautiful.  \n \nThere was Religious Art from the 1300s with emphasis on Material and Meaning.  Also in the 1300s there was an ‘Unearthing of the Past’ where the ancient pasts of Greece and Rome were rediscovered by European artists and there was a cultural, movement called Humanism during the Renaissance era, encouraging curiosity about nature, the world and individual expression, which was very interesting. In addition, the artwork within this gallery addressed ‘Trade Across Cultures’, ‘Venice and the Marketplace’, and ‘Imperialism and Production (1686 – 1851)’ where there was an exchange of techniques and materials. There was also a section/gallery on the different aspects of the ‘Artist’s Profession’ as it related to European art in the early 1800s.  \n\nThe Art of Ancient Egypt – from 5,000 years ago emphasized the funerary traditions with a rather impressive mummy on display. The art was for a functional or ritual purpose and words and pictures were combined to convey a unique meaning as depicted in the ‘Understanding of Egyptian Objects’ display, which addressed the interesting principle of mixed perspective among other aspects of this art.  \n\nThe Asian Art included very nice Japanese emerald and clay, devotional and funerary objects, including Budha and a gallery representing insects with ‘A chorus of Chirps, Hums and Buzz’.\n\nThe Costume and Textile and Quilt Galleries were impressive as well as the Modern and Contemporary art, including very elegant and unique clothing and furniture.  \n\nThe Print Making – Visions and Revisions was quite educational with displays regarding ‘Aquatint and Goya’, ‘Etching and Rembrandt’, and Mezzotint Engraving.  The write-ups for these displays addressed the processes involved with these techniques in art and were definitely quite educational.  \n\nSpecial Exhibit: ‘’Gorham Silver – Designing Brilliance 1850 – 1970’: \n\nThis exhibit addressed the many aspects of Gorham Silver and illuminates the heights of Gorham’s industry, ambition, artistry, technology, creativity and innovation.  The history of the founding of Gorham was addressed with its beginnings in a small workshop to its significant growth as depicted in the display ‘Gorham Silver and American Industrialization’.  Through machinery and equipment, the company had sufficient size and power to handle silver as though it was putty. with something for everything. \n\nThe Classical Design and Source Materials were addressed as well as the Gorham Workbench which displayed the processes and tools used to create Gorham silver.  ‘Design Inspirations and Influences’ were depicted with the ‘Restless Laboratory’ where the silver went from a Classical to Japanese Design with the American Aesthetic Movement and the desire to fulfill social aspirations.  ‘Creating Gorham Silver’ illustrated the most perfect system with an effective network of organizational practices and a well-managed inventive approach.  The ‘World of Styles in Providence’ were also on display.  This was a very impressive and well done exhibit with many pieces of exquisite silver on display within it, definitely worth seeing.  \n\nWe recommend a visit to this museum and hope that you have the opportunity to enjoy it as much as we did. It has a real lot to offer, much more than what I mention here!!.",
  "I visited on a Sunday afternoon (free admission) and was impressed with their diverse collection of art from ancient Egyptian artefacts to contemporary works of art from all over the globe.  I ran out of time to see as much (as thoroughly) as I would have liked.  Thanks would definitely go back; it’s such an incredible resource for a fairly small city but a true jewel !",
  "A small museum that has some amazing pieces - a wonderful unknown Van Gogh a great collection o german porcelain, and some absolutely beautiful sculptures and impressionist paintings. A must go to museum if you are in Providence. ",
  "We had a wonderful visit to the museum on a rainy Tuesday. Like other reviews have noted there are so many periods and mediums to enjoy.  From classic statues to modern installations of multi-media.  This week we were lucky enough to catch the remix of the classic \"Raid the Icebox Exhibit\" by Andy Warhol.  The museum has a wonderful flow from room to room and it's so easy to get lost in the variety of art. To see art from the The Hudson River School, Pollock, O’Keeffe, Picasso, Gauguin, furniture, ceramics, Frank Lloyd Wright, glass work, tapestries, furniture and so much more was a real treat. There is a sense of whimsy and innovation around every corner - like the current Disco of artwork!  It's a wonderful sampling to expose your family to.  It's the right size that it will not feel like they are trudging on and on.  2 - 3 hours should do it easily.  If you have time, stroll up the hill to visit the campuses of RISD and Brown.  You'll want to go back to college.  \n\nOne tip:  Parking is extremely limited.  If you can walk, take an Uber or bus there you'll be better off.",
  "The RISD Museum is filled with items made by students and faculty and the exhibits change so you will always see something new and engaging.",
  "Very varied  and interesting collection including Monet, Picasso , Renoir and an Egyptian Mummy As well as architecture . Very worth while.",
  "Fine museum with something for everyone of every age! Wonderful paintings both contemporary and traditional, a huge carved buddah, a mummy and sarcophogus, Japanese swords, and too many more wonderful things to mention. Do not miss!",
  "RISD Museum of Art was bigger than I expected. The Gorham exhibit was fascinating and informative. The \"Raid the Icebox 2\" exhibits were terrific. A re-do from 50 years ago when RISD invited Andy Warhol to raid the icebox (storage) and create an exhibit, this year RISD invited 10 current artists to do the same. So fun to see the unique ways  to show the artwork."
 ]
},{
 "name": "Historic Federal Hill",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/da/a2/c8/historic-federal-hill.jpg",
 "tags": [
  "food",
  "food",
  "delicious",
  "food",
  "delicious",
  "walking",
  "food",
  "walking",
  "parks",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d108526-Reviews-Historic_Federal_Hill-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "I live in Federal Hill and love it. With the stately buildings along Broadway to the restaurants and shops on Atwells Avenue.. Terrific Italian food which rivals the North End in Boston, South Philly.  And a true gem is Roma's on Atwells Avenue. Try the subs, pizza, pastries.  All fantastic.  Unfortunately the neighborhood is becoming less and less Italian like so much of RI these days. Sad.",
  "Federal Hill is a neighborhood in Providence, RI which is also known as Little Italy.  While visiting Providence for the Columbus day holiday, we found ourselves in the middle of a great street festival in Federal Hill. Even though the festival was to take place on Friday, Saturday and Sunday, we went on a Saturday.  The street was a combination of a county fair atmosphere with a sidewalk restaurant/bar competition.  Every bar and restaurant had outside tables, tents and service.  The food offerings were mostly Italian food and seafood.  Fresh oysters, mussels, clams, and just about anything else could be found.  Pizza and pasta also abounded together with $3.00 beer.  Also making the scene, was fried dough (Elephant Ears) candy apples and other county fair staples.  Everyone paraded down the middle of the closed street, food in hand, or sat on a sidewalk/street table.  It was loud, it was colorful and downright fun.  The only problem was that once you decide to leave, you start down side streets and it becomes evident that the neighborhood is not in the best condition.  It seems like it is not up to par with other areas of town.  Although Atwells Avenue is a great street to go have a meal and a beer at the numerous bars, the architecture is not bringing anyone back.",
  "When in Rhode Island, or the surrounding areas, you really need to see Federal Hill.  This is the best restaurant scene in RI.  It's as close to the North End in Boston that you can find.  \n\nI suggest Old Canteen or Siena.  Old Canteen has more of an authentic feel to it.  Like being in an 80's mob movie.  Siena is more upscale.  However, they are both great. \n\nAs for the Hill...you cannot go there with stopping at Venda Ravioli and taking home some delicious cured meats and fresh imported cheeses. \n\nThe nightlife is pretty wild but isn't as safe as it was years ago.  So, I'd recommend dinner and drinks on the Hill, but partying in downtown Providence afterwards.",
  "Lots of good food. This area was entirely Italian until about 15 years ago and has a number of excellent established Italian restaurants at a variety of price points. More recently it has acquired Mexican, Indian and several other sorts of restaurants. In addition, it has lots of pleasant atmosphere, including parades and street festivals, as well as authentic grocery stores and bakeries in which to purchase a variety of raw and prepared delicious Italian foods.",
  "Federal Hill is full of Italian Restaurants. In the summer you see a lot of people walking up and down Atwells Ave. There are so many restaurants to choose from, shops to visit or you can just sit on the square and enjoy the fountain. There is a little park that has checker/chess boards painted on the tables if you're interested in playing. You always see older Italian men sitting across from the square reminiscing & drinking coffee or smoking cigars. Along with a bunch of restaurants to choose from there are cigar bars if that's what you're craving. There are bakeries, steakhouses, Chinese food, hair salons, nail salons and places you can have your Tarot Cards read. If you are the dancing type come at night and you'll find a lot of Dance Clubs that are open until 2 in the morning. Back in the day there were Mafia all over the Hill but it's not like that today. There were even \"hits\" that made the front page of the Providence Journal Bulletin. Today it's a foodie's dream. ",
  "Have eaten at several Federal Hill places but have found equally good restaurants, outside the area, at more reasonable prices.  Yes, it has charm but so do many others.  However, if you want to experience an outstanding dessert place there, go to Pastiche. As people say, \"Their desserts are to die for! \"",
  "Federal Hill is Providence's version of a \"Little Italy\" in other cities. Given that Providence is a renowned restaurant city, one would expect the restaurants on Federal Hill to be excellent.\n\nOne would be correct.\n\nMy favorite is Massimo, on Atwells Ave., but I have never had anything less than a fine meal at any of the restaurants I have visited on the Hill. There is also Mexican and Chinese, by the way. There are also wonderful provisioners, like Venda Ravioli (MUCH more than ravioli!). Add some nice little parks, and you have the makings of a fun day trip for walking, lunch and provisions, or destination dining for dinner.",
  "Excellent Italian delis here - lots of choice of eating places and a nice atmosphere, easy walk from town"
 ]
},{
 "name": "Rhode Island State House",
 "address": "82 Smith St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/ef/e5/fc/photo3jpg.jpg",
 "tags": [
  "tour",
  "free",
  "library",
  "learn",
  "history",
  "tour",
  "library",
  "history",
  "tour",
  "free",
  "library",
  "independent",
  "history",
  "unique",
  "tour",
  "historic",
  "free",
  "tour",
  "library",
  "structure",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d104609-Reviews-Rhode_Island_State_House-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Take the half hour free guided tour, worth your time. See the House and Senate chambers, the library, portraits of former governors, portrait of George Washington painted by our very own Gilbert Stuart and learn about the history of this beautiful building. Dome is a beautiful piece of architecture.",
  "Unfortunately it i not open on the weekend, but if you can go during the week, the State House tour is really good. They are usually led by Johnson & Wales students tourism students. They give you good history, interesting facts and take you into both the senate and the house, the governor's reception room (WOnderful view from the balcony) and the library (absolutely gorgeous). Also be sure to see the original state charter.  The Royal Charter of 1663 was a document granted by King Charles II of England to the Colony of Rhode Island and Providence Plantations. It allowed settlers in Rhode Island to govern their own colony and guaranteed their individual freedom of religion. It is a beautifully illuminated scroll and you can see it upclose!",
  "Last minute planning and suggestion from a fellow visitor has me touring the state house. Looks like a nice building outside. Touring it sounds like a decent time-filler idea during my limited stay. It turned out to be phenomenal , eye-opening, enriching learning experience!\nThe legislative and executive branches of Rhode Island government run in this building. Built in late 1800's by famous architect McKim, Mead & White , whose works include Boston Public Library and NY Penn Station, the State House is a beautiful unique building. Materials chosen include marble from Georgia & Italy, real 24K karat gold painted by feather, oak & mahogany wood, etc, make this gem an architectural wonder! Awesome paintings and murals. The 4th largest free standing dome building has the bronze \"independent man\" on top!\nGuided Tours run every hour from 9 am to 3 pm. To my fortune, I attended the last daily tour at 3 PM as Ann the experienced librarian guide offered me a one-on-one tour! Lot of rich history & Stories, from the Native American times & United States Founding to Civil War & WW II. See the government happenings of senate and house of representatives activities. Meaningful rooms to see include: \n(1) The governor's meeting room, with real gold trim work and a reknowned, expensive George Washington portrait \n(2) Senate Chamber\n(3) The House Chamber\n(4) Charter Museum : The original 200+ year old and preserved declaration of independence from Rhode Island is housed here.\nProvidence Rhode Island represents independence, freedom , and revival : Take this free guided tour and see for yourself why this is a must-see!",
  "On my recent trip to Providence,I went to the Rhode Island State House.This idea of mine was provident.The free tour of the state capitol was very informative.I saw the interior of the spectacular dome,the original Royal Charter of 1663 which granted religious freedom to all who settled in Rhode Island,and Governor Gina Raimondi's State Reception Room.I saw fine portraits by Gilbert Stuart(\"George Washington\")and American Historic Painter,Emanuel Leutze's portrait of Civil War Hero and Rhode Island Governor Ambrose Burnside.",
  "We visited the State House on October 1. After the security check we went to the library on the second floor for the guided tour. Unfortunately the chamber and senate are closed for renovations.",
  "This building is at the end of an uphill walk facing the street so that it's full beauty is seen. It is classic with it's dome and structure, just beautiful. Unfortunately I cold not get in the day I was there but even from outside, it was worth seeing.",
  "We really enjoyed our tour as it gave us a lot of information on the state and the building itself was absolutely stunning.  Make time for this stop!",
  "A nice and beautiful state house. The security was so good that he allowed me to come in even though it was already after office hours. It was a beautiful inside and out. There were a lot of memorabilia on display. The dome inside is beautiful."
 ]
},{
 "name": "Water Place Park",
 "address": "Memorial Boulevard",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/cb/73/05/water-place-park-and.jpg",
 "tags": [
  "walking",
  "walk",
  "delicious",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d105261-Reviews-Water_Place_Park-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Providence's Water Place Park and Riverwalk was a pleasant discovery, even in the winter.  I can imagine enjoying summer time dining here with the river fire and gondolas.  Will return again in warmer weather to check it out when outdoor dining is open.  All cities with urban waterways should try to recreate San Antonio's Riverwalk and Providence has a nice example.  It's very close to hotels, the state capital, Providence Place, etc.",
  "Waterfront park is great for walking, jogging, picnicking or lounging. It’s a very pretty area where it once wasn’t so attractive. ",
  "took a morning stroll with my wife along one side of the river, many very old buildings of varied architectural styles beautiful flower plantings along the walk as well.",
  "Went during the day in winter. I realize that’s not exactly prime visiting time but we were hoping to have a nice lunch along the river. None of the restaurants seemed to be open yet. There were some men smoking pot under a bridge. Even in sneakers the cobblestones were brutal on my feet.",
  "Even in daytime, even when there is no Waterfire, Water Place Park and Riverwalk offer one of the most spectacular views of downtown Providence and Providence Place mall any time of the year.",
  "The concierge staff was awesome. The handicapped access room was clean and easy to use, breakfast was delicious, location was perfect 👌",
  "...or a day!  This area is beautiful and seems to be progressing with new beautification projects and areas to enjoy the waterfront.  This was my first time to Providence and this is a great place to start!",
  "Nestled in downtown Providence, the park and river walk is a great place to spend a few hours with lots of restaurants and bars to enjoy. Try to see a Waterfire Illumination if possible."
 ]
},{
 "name": "Brown University",
 "address": "1 Prospect St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/ae/f5/0d/dept-of-economics.jpg",
 "tags": [
  "art",
  "library",
  "walk",
  "tour",
  "learn",
  "walk",
  "free",
  "tour",
  "library",
  "learn",
  "history",
  "historic",
  "history",
  "walking",
  "library",
  "walk",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d108524-Reviews-Brown_University-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Buzzing with thought, Brown offers a lot to the community as well as its student body. There are always lectures to attend, but one can also enjoy a walk through the campus and find inspiration in the architecture and outdoor spaces. The university houses many fine collections. Check out the John Hay Library to see war collections from lead soldiers to civil war memorabilia. Or go to the List Center to find the latest in student art.",
  "I'm currently travelling around the US and as someone who has always succeeded in academics, the Ivy League schools have always fascinated me.  As a recent English university graduate, I was excited to learn about university life in America and Brown is the first Ivy I've visited.  My stay in Providence was short and as a result, I visited the campus on a Sunday.  Usually this would have been fine, however what I didn't know is that it's Spring Break this week and so most of the students aren't here and most of the facilities (including the visitor's centre) are closed.  I planned to walk around the campus myself, however without a map or guide, I wasn't really sure what I was looking at.  I asked a student if she could point me in the right direction and she kindly offered to give up her free time and tour the campus with me!  I was delighted.  I was able to get a tour from an authentic college student and hear all about her experiences.  Students like her as a credit to this university.  She shared some interesting fun facts with me and gave me an insight into student life.  If you're planning a visit, whether you're a prospective student or just interested in the school like I was, I would strongly recommend just asking one of the students if they would mind even sparing 10 minutes of their time to give you a basic rundown of the university!  The tour was the highlight of my day!",
  "Although there are a few \"modern\" buildings, most of the Brown campus is filled with classic New England college and university architecture dating from the eighteenth and nineteenth centuries -- and with few exceptions they are a marvel to behold.  Visitors can explore the campus on their own or join a tour given by especially trained and well-informed student tour guides (to really learn the most about Brown this is the way to go).  Going into such buildings as the John Hay Library gives an insight into the rare and special collections of books and manuscripts that Brown possesses; and dropping in for a snack or light meal in the Blue Room (located in Faunce House) isn't a bad idea either.",
  "Brown University covers quite a bit of territory up the Hill from the RISD campus and the court building.  It is definitely work the time to stroll through the campus in order too appreciate the beautiful architecture and to get a sense of history.  Parking in the area of the University can be a challenge, but if you circle long enough, a spot generally opens.",
  "We don't have a connection to Brown; we visited out of curiosity.  The campus is very beautiful and as we explored it, we discovered many little treats -- exquisitely carved stone doorways, museum-quality portraits in a room with a beautiful historic organ and stained glass windows (Sayles Hall), a row of buildings that looked like a museum of American architectural history (along Prospect Street between Waterman and George), and a toy soldier collection in Hay Library.  Get a campus map at the student center information desk (on Waterman Street where it intersects with Brown Street) and plan to spend a couple hours walking around.  On-street parking can be hard to find, and much of it requires feeding quarters into a meter.  Try the visitor parking lot, entrance on Brook Street just south of Waterman Street, where you can pay in advance, about $3 per hour.  Don't forget to see the extraordinary rare books on display in the John Carter Brown Library on George Street.",
  "The front gates are worth the trip, make sure you take a camera...this University has a beautiful campus.",
  "What can I say?  I love the Brown U campus. I went to college there and it was nice then, and maybe even better, now.",
  "I took a walk around this amazing campus and was amazed by the beauty of its architecture. It's only fifteen minutes from downtown Providence. ",
  "Brown is a beautiful university in the center of Providence. Take a walk through the center of the campus and admire the architecture. Like most campuses in cities it extends well beyond the main green and has buildings scattered about.",
  "Not much to do for tourists. The grounds and buildings are beautiful but I can't see any reason to make a special trip just to see it. ",
  "A good Saturday morning walk through beautiful grounds. As with any urban campus, the buildings sprawl out from the main campus a bit but overall if you want a respite from the city, you won't go wrong here. Check out the great front gate!"
 ]
},{
 "name": "Roger Williams Park",
 "address": "Elmwood Avenue",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/69/52/51/roger-williams-park.jpg",
 "tags": [
  "walking",
  "walk",
  "music",
  "family",
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d531789-Reviews-Roger_Williams_Park-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to walk your dog, jog, walk and bike through. I would love to see a farmers market here one day, with a little more activities. Or even a volleyball, badminton, ets set up.  It doesn't have the same feel as Boston Common or Central Park, not even close to it, but in the city this is a good place to escape to for some quiet. Lots of cars do zip through here as it connects to other areas and neighborhoods so do be careful when walking on the roads.",
  "If you have Asthma be careful and bring Kleenex if you come during the summer. You can get a bad case of the sniffles if you don't watch out. Overall- amazing",
  "Hidden jewel in center of urban area. Tropical flowers in greenhouse, Van Gogh like perennial gardens, unusual tree and bush specimens. Many events planned during year, such as photography contest, fairy festival, and live music concerts. Admission only $3.00. Open 11 am to 4 pm Tuesday through Sunday, closed Monday. Inexpensive, relaxing family outing. A \"don't miss\"!",
  "The park is very beautiful, it has a big pond that has ducks, geese and swans that frequent it and many monuments that tell the history of the park and providence.",
  "With its numerous trees and shrubs of many varieties, Roger Williams Park offers a wonderful opportunity for \"leaf peeping\" without taking a drive into the country.  And you can also feed the ducks and Canada Geese that hang around the pond and elsewhere in the park.",
  "We visited in November and were still very  impressed with the beauty of this park. We can only imagine how wonderful this place is when \"in season\". The park has numerous walking paths and hiking \"trails\". It is spread out over a large area and is extremely well maintained. When you are in this park, you are actually in the heart of Providence, RI but you in no way get that feeling. As you experience the outer perimeter of the park you think... \"how lucky would I be to live in one of those homes?\", as there are neighborhoods that abut the park. Unless you notice that, you would never know you are that close to civilization. This park is a hidden gem!",
  "I was in the beachy part and my flip flops came off when I was doing a cartwheel. \nI found the left one but the right one is still there.\nIt was blue with a yellow thong.\nI had to leave it there because a goose chased me. \n\"Honk Honk!\" It said \"Honk Honk Honk!\"\nPlease contact TripAdvisor if you find my flip flop. \nI was by the bushes with all the bees",
  "We stopped here early before going to the pumpkin spectacular, it is a lovely park with many places to stop, relax, read, picnic, play. The casino is AMAZING. We were able to go inside. Drove through the park and stopped many times to take pictures and just enjoy the beautiful fall scenery. Wish we had more time to spend there- night time swan boats, carousel."
 ]
},{
 "name": "Providence Performing Arts Center",
 "address": "220 Weybosset St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/32/db/87/providence-performing.jpg",
 "tags": [
  "theatre",
  "walking",
  "eat",
  "theatre",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d290617-Reviews-Providence_Performing_Arts_Center-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Not bad for Providence, but Boston gets the production companies.  Also, parking around here can be expensive, look around before you park.",
  "We saw The Moody Blues at the Providence Performing Arts Center last week. A fabulous concert in a truly fabulous theater. It was our first visit to PPAC (shame on us) and we were quite impressed with the beautiful old concert hall. We had pretty good seats 30 rows from the stage but with seating for only 4000, there does not seem to be a bad seat in the house. The elegant surroundings might have you feeling under dressed! There is a parking deck is directly across the street but fills quickly so you may want to arrive a little early.   ",
  "Went to see Book of Mormons.........had great seats!!  Show was very good! Had a nice cocktail during intermission. great Historical building, can't wait to go back for the next show!!!!  Hint: DO not park directly across the street in garage, unless you don't mind waiting 30-40 minutes to get out.",
  "My husband got tickets for the symphony here, Romeo and Juliet. Absolutely amazing and customer service was great ",
  "Very nice theatre to see a show at very good price. Happen to be walking by while visiting Providence and saw that a Bronx Tale was playing. Got lucky and scored half price tickets fir $44. ",
  "PPAC (Providence Performing Arts Center) is a beautiful place to see a show. There is a parking garage right across the street and plenty of places near by to eat before the show. One place to eat, right around the corner that I would recommend is Bravo. PPAC is beautiful inside. It's the place in Providence to see off Broadway shows and shows that were on Broadway. We've seen Annie, Godspell, Stomp, Blue Man Group, Mrs. Robinson and the Nutcracker. Too many to name. The inside of the theater is beautiful and the people who work there are extremely nice. I would highly recommend the PPAC if you want to see a show in Providence.",
  "The PPAC is full of history and tradition.  This building is your classic theatre with high beautiful ceilings.  I have season tickets so have been to many shows.  Some are terrific others not so much but always an enjoyable night.  There really isn’t a bad seat, even second balcony while a little far away is great.  The seats are a little small unless you are in the lodge.  Over the last few years they started allowing food and beverages in the seating area.   Would recommend this for anything from a first date to a 50th wedding anniversary.",
  "Over the years we have seen some wonderful productions at PPAC.  Among our favorites: Les Miserables, Jersey Boys, Miss Saigon, Phantom of the Opera, Book of Mormon and so many more.  We have never been disappointed!"
 ]
},{
 "name": "Benefit Street",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/82/08/68/nice-walk.jpg",
 "tags": [
  "walk",
  "historic",
  "walk",
  "tour",
  "historic",
  "walk",
  "historic",
  "walking",
  "walk",
  "history",
  "walking",
  "knowledgeable",
  "art",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d105266-Reviews-Benefit_Street-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took a short walk from our hotel, crossed the rivers, and ascended the hill past the first Baptist church to benefit Street.  There are plenty of colonial era and newer homes with interesting architecture.  Worth the walk.  Highly recommend.",
  "The houses have almost all been restored.  Be sure to stop by the historic John Brown House.  This is a nice walk.",
  "There are so many beautiful and historic buildings to see along Benefit Street. If you want to experience Benefit Street with a guided tour check with the Rhode Island Historical Society at the John Brown House Museum where Power St. meets Benefit St.  Along Benefit Street, you can check out the Providence Athenaeum, Brown University, RISD, as well as, admiring the exterior of many restored private homes.",
  "This is a great street to walk through the historical homes of Providence. Most have placards on the front that tell when they were build and in some cases moved there. Nice architecture and leaves you wondering what it would be like to be there back in that time. Well worth the walk or very slow drive. If you do drive it the street is two way but narrow so keep an eye out for traffic and pedestrians.",
  "Benefit Street is one of Providence's treasures. Beautiful homes from the 1700 and 1800's line the street and virtually all have been restored. Brown University owns a few of them, but most are privately owned.  Parking can be a hassle when school is in session, but at night or during the summer, it's pretty easy to find spots.\n\nAfter your stroll, head over to Wickenden Street for quaint shops, coffee and cafes.",
  "This is a beautiful street and what postcards are made of! The street is as beautiful during the day as it is at night. Night time, however, brings out a charm that takes you back in time. The street is absolutely gorgeous in the fall and spring/summer. The bricks are hundreds of years old and most of the houses are historic homes which mean that the lighting and facade have to be approved by the Historical Society. If you like Beacon Hill in Boston, you'll love Benefit Street. If you're visiting Brown or RISD, make sure you visit Benefit. Many Brown students live on this street for off campus housing since it's safe and very close to campus. The campus is a two minute walk, one street away. Bring your walking shows and take your camera out because it's a charming street with postcard views.",
  "We had a very short time to see anything in Rhode Island. We chose to drive Benefit Street and saw the 1st Baptist church being taken care of. Although these may not be the #1 tourist attractions on tripadvisor, we enjoyed them immensely!! So much history. We went on to Plimouth Plantation that same day and also enjoyed that. It was at the end of September 2019 and we thoroughly enjoyed our one day in Rhode Island!!",
  "A great street and restoration area to explore. The Rhode Island Historical Society regularly has tours of the section of Providence, and they are worth enquiring about. The docents are knowledgeable and the walking tours are not too strenuous.",
  "Benifit street!\n>clap clap<\nwhere all the kids meet!\nclap clpa<\nget a sandwich with meat\nat Geoffs' \nand see some art on the street\nclap clap\nthere's a fountian that's sweet\nclap\nBenifit street!!!",
  "We decided to go to Providence from Texas on a whim and it turned out great. The people are friendly and the areas like Benefit Street near Brown University is wonderful for strolling. ",
  "This is a great area with many beautiful old buildings. However, you have to walk very carefully and make sure you don't get run over by a crazy driver. Some drivers won't stop at a crosswalk.  Make sure you're health and life insurance is updated. "
 ]
},{
 "name": "The Stephen Hopkins House",
 "address": "15 Hopkins St Corner of Benefit & George Sts.",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/4f/b8/54/governor-stephen-hopkins.jpg",
 "tags": [
  "walk",
  "tour",
  "historic",
  "free",
  "knowledgeable",
  "tour",
  "history",
  "tour",
  "tour",
  "history",
  "tour",
  "tour",
  "history",
  "free",
  "tour",
  "walking",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d531803-Reviews-The_Stephen_Hopkins_House-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "The house is small but well displayed with objects that reflect the time period, the inhabitants, and the political affairs that were happening during the18th century. The variety of objects made it possible for the conversation to go in many directions depending on interests. There are no ropes or gated areas in the exhibit rooms, which makes it feel more authentic, and nothing was inaccessible as the rooms were displayed as if the owners had just left. The docents were well informed and engaging, not something we found at the other two museum we visited that day. \n\nWe had arrived 20 minutes after closing but we were greeted with a smile and an apology for not being able to accommodate us. The docent encouraged us to walk the exterior, which has lovely gardens and fantastic views. After we strolled through the gardens the door opened and another docent asked if we wanted a quick walk-thru of the house as they closed up. Unexpected and appreciated, this illustrates how much the all-volunteer staff are dedicated to sharing this resource with the public...thank you.",
  "My wife and I visited Providence to see a few historic properties around Brown University. The memorable one was not grand but one lived in by several generations on the first governor of Rhode Island. You must take the free guided tour presented by very knowledgeable docents. The house dates from the early seventeen hundreds and is full of authentic period pieces. ",
  "We had a wonderful visit to this fascinating historical house, the oldest house in Providence; lived-in by a signer of the Declaration of Independence; and with a bedroom where George Washington slept. The docent did a phenomenal job of bringing the historical period to life. I'd highly recommend to any visitors to Providence with even a slight interest in our history. I am a novice in American history, and I visited with a friend who is a college professor of history, and we both loved the tour.",
  "Stephen Hopkins was the founding father and governor of Rhode Island and signatory of the Declaration of Independence. George Washington had stayed at this house. Their are many gorgeous artifacts and heirlooms. The tour is fascinating and highly recommended.\nThis is NOT the house of Stephen Hawking the English theoretical physicist, cosmologist, and author - as one of the reviewers posted.",
  "Informative tour provided by dedicated volunteers. I've lived in Providence for nearly 20 years and have passed by this place many times. I'm ashamed to admit I never knew its history. ",
  "Mr.H opkins himself brought our tour to life, not a boring, staid museum visit by any means.highly recommend.",
  "Took tour of Stephen Hawkins house will visiting Providence. Good history about Hawkins, his story and signing of Declaration of Independence. Tour is about an hour and is offered for free. Hours are limited, we got lucky to there when they were open. ",
  "So much history! Great tour with Alex, our fabulous guide. In a great location that we found just walking around the Brown area. And it’s Free!! We would definitely recommend!"
 ]
},{
 "name": "Providence Children's Museum",
 "address": "100 South St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/b3/47/52/providence-children-s.jpg",
 "tags": [
  "eat",
  "drink",
  "free",
  "kids",
  "eat",
  "drink",
  "learn",
  "kids",
  "organized",
  "food",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d105260-Reviews-Providence_Children_s_Museum-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to take small children. My toddler loves almost all of the exhibits here. The water room is on the first floor and is his favorite, but we always save it for last because he usually gets wet. Even with the smock on, water can run down his arms onto his shirt, and also he can get his shoes wet. Bring a full change of clothing so your little one can leave dry. Bring some rain boots to wear to keep feet dry. There is a parking lot that gets full on busy days but you can always find a parking spot at a meter within 1-2 blocks of the building. There’s a lunch room to eat and drink (bring your own) and numerous rest rooms with changing tables on the two floors. Your child will have a good time here! ",
  "On a rainy day or sunny, toddlers and young ones need to be kept occupied with different activities often. Here, they will be kept busy all the time. There are things to touch and play with which would keep your little ones busy for a couple of hours. Hopefully, by then, it’ll be nap time.",
  "This is a nice museum for kids. There are a lot of wonderful activities for them, and even on a day when there are lots of kids around, it still was a pleasant experience. It is easy to get to, parking is free (although the lot was filling up by 11am), and for the price it’s a great 3-4 with kids. The water room is great, especially for younger kids, and my 7 and 9 year old enjoyed the upstairs rooms with the interactive ship and store. If you had to choose between driving into Boston or driving into Providence for a children’s museum, I’d say this is the better and less stressful choice. ",
  "Great place to take small children. My toddler loves almost all of the exhibits here. The water room is on the first floor and is his favorite, but we always save it for last because he usually gets wet. Even with the smock on, water can run down his arms onto his shirt, and also he can get his shoes wet. Bring a full change of clothing so your little one can leave dry. Bring some rain boots to wear to keep feet dry. There is a parking lot that gets full on busy days but you can always find a parking spot at a meter within 1-2 blocks of the building. There’s a lunch room to eat and drink (bring your own) and numerous rest rooms with changing tables on the two floors. Your child will have a good time here! ",
  "If you are looking for a super gift for families that have young children, a season pass to the Providence Children's Museum is a great one to consider. The Museum has many, mamy hands-on exhibits for children of all ages (less so for adolescents). They can have fun, be loud, and it is all part of the learning.",
  "We have taken several of our grand kids here. They love it! Always a worthwhile trip. Plenty of places to play and learn. I like that the gift shop was turned into a room for snacks.",
  "Took grand children for a Sunday morning day out. \nHad a great day.  Discovered lots of fun activities both inside and outside with water play a big hit. \nReasonable admission prices but no discounts for Seniors.",
  "We love coming here almost as much as the kids.  The water activity room is awesome, but be careful you will ultimately get a little wet....if your child is younger or messy suggest bringing a change of clothing just in case. Bathrooms on each floor with stools for the kids ( also great if your little one is potty training). Themed rooms and pretend play.  The staff does a good job to keep the areas organized.  Some of the rooms like the Boat are very cramped so when your child runs in to play it can be hard to keep your eye on them at all times. The museum also had a great area for snacks and lunch which is kept clean. They do not serve food.  Storage area for coats and diaper bags ( free)."
 ]
},{
 "name": "Providence Train Station",
 "address": "100 Gaspee St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/fd/55/14/ta-img-20170416-112521.jpg",
 "tags": [
  "organized",
  "eat",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d561332-Reviews-Providence_Train_Station-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "It is a train station located in downtown Providence.  It has both Amtrack and MBTA lines. It is easy to get to, and parking is available. The architecture is not impressive, but inside the station is clean. If you arrive before your departure there are a few options; you can sit at the benches, sit outside in the grass (weather permitting), or sit at the cafe. The cafe is cute, with fresh coffee, sandwiches, and pastries. However, it does get crowded, since MBTA tickets are sold at the counter too. The MBTA ticket line was a ten minute wait, and the line was so long it wrapped around the cafe. I would have bought my ticket on the train instead of waiting in line, but the station recently changed its policy so that there is a $3 fee for passengers who buy tickets on the train. Be prepared to bring cash because they don't take cards. There is an ATM located inside the station, but it was out of order.",
  "This is Providence Train Station . The  main waiting room is a rounded hall with wooden benches . There is a coffee shop which sells quick meals and take out sandwiches and salads and drinks. An ATM machine , restrooms are available . The dome  roof ceiling  has an opening  that lets the sunshine in",
  "It is a train station located in downtown Providence.  It has both Amtrack and MBTA lines. It is easy to get to, and parking is available. The architecture is not impressive, but inside the station is clean. If you arrive before your departure there are a few options; you can sit at the benches, sit outside in the grass (weather permitting), or sit at the cafe. The cafe is cute, with fresh coffee, sandwiches, and pastries. However, it does get crowded, since MBTA tickets are sold at the counter too. The MBTA ticket line was a ten minute wait, and the line was so long it wrapped around the cafe. I would have bought my ticket on the train instead of waiting in line, but the station recently changed its policy so that there is a $3 fee for passengers who buy tickets on the train. Be prepared to bring cash because they don't take cards. There is an ATM located inside the station, but it was out of order.",
  "A nice,convenient location and easily navigable. We train into here from Boston (and back) on the MBTA commuter rail. Small, well-kept and centrally located. Can also catch shuttle bus from here to other locales in Providence.",
  "Rather than driving or flying to areas near Providence, the Amtrak trains bring you to the Providence Station in 2-3 hours with no stress of driving on roadways or the inconvenience of bad weather. The station is heated with enough room to stay inside waiting for a ride (also Enterprise will pick you up if you want to rent a car). The station is modest in size and amenities but also without the crowds and noise of bigger stations. It would be nice if the elevator were closer to the escalator for going upstairs from the tracks, but that is the only downside.",
  "Crowned by its impressive rotunda, the Providence Train Station  serves both Amtrak and MBTA intercity trains. It is convenient to downtown, the Convention Center, Providence Place mall and the Dunkin' Center. It has ample indoor parking for a fee as well as short-term metered parking on the street.  ",
  "The train station was clean, organized and efficient.  Taxi's are waiting outside to take you to your downtown destination, or a car rental office as I did.  Providence is an old town with a young vibe.  Loved it.",
  "We've traveled in and out of the Providence station several times and find it very easy to navigate. Small in size, but large enough to get a bite to eat or something to drink, and to sit and relax while waiting for the train.  Rental car services are not available right at the station; however, call Enterprise in downtown Providence to reserve a car ahead of time. Someone from Enterprise will pick you up when you call them upon arrival, and also take you back to the train station after you return your car. Works out pretty well!"
 ]
},{
 "name": "DePasquale Plaza",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/76/4b/f9/fountain-centerpiece.jpg",
 "tags": [
  "eat",
  "food",
  "walking",
  "walk",
  "walking",
  "active",
  "eat",
  "music",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d116254-Reviews-DePasquale_Plaza-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "There is a huge fountain in the middle of this square and sitting ot it's edge on a warm summer day is just a real treat. Sit htere and watch a varity of people going by and enjoy the ambiance of the area. It is surrounded by Italian eateries and in season it is strung with Christmas lights above it all. Very scenic.",
  "If sitting by a bubbling fountain and listening to the world's best renditions of Frank Sinatra tunes tickles your fancy, you've got to check out DePasquale Plaza on Providence's Federal Hill neighborhood.  It's the closest you'll come to Italy this side of the Atlantic Ocean!",
  "De Pasquale Plaza is the center of the Atwells Avenue Federal Hill area.  It is bounded by the two Venda shops/restaurants.  To the right is a store where you can select a live chicken and have it prepared for cooking.  (Never did this).  Behind that shop on Spruce Street is Pastiche which serves fine desserts.  Not to be missed.  To the left and to the right of the Plaza are international restaurants (many of which are Italian), grocery stores and shops.  A great place to start you visit to the Hill.",
  "DePasquale Plaza is for EVERYONE.  Stroll past the fountain where children throw coins and wish to return.  Enjoy multiple restaurants with Italian flare. Buy prepared food from Venda Ravioli, eat at Costintino's, stay over at Dolce Vita or pick out a fresh live chicken for the butcher to prepare.  DePasquale Plaza has it all. But there is more!  On Wednesday and Sunday nights there is a live band compliments of Costintino's and enjoy either listening to oldies or even dancing in the Plaza!  Around the corner on Spruce St is Pastiche which blows you away with their coffees and homemade desserts.  Enjoy!",
  "This is a nice area to walk through in the evenings or on a sunny day. It's close to several restaurants and there's always people walking through. The fountain is pretty and it's a calm place. ",
  "DePasquale Plaza is a great spot, especially in nice weather, for couples, families, friends, etc.  A number of fine outdoor restaurant options, mostly Italian - grilled pizaa to fine dining to dessert and gelato.  A very active summer evening and weekend spot with hundreds of people walking, sitting and enjoying.  Often, there's live entertainment ranging from a guy doing a very good Sinatra to a weekly Karaoke contest (grand winner goes to Vegas).  Easy access to the rest of Federal Hill and dozens of other restaurants.\n\nIn Providence ... must go!",
  "There is a huge fountain in the middle of this square and sitting ot it's edge on a warm summer day is just a real treat. Sit htere and watch a varity of people going by and enjoy the ambiance of the area. It is surrounded by Italian eateries and in season it is strung with Christmas lights above it all. Very scenic.",
  "What a perfect place to watch the Columbus Day Parade. Best seat in the house. The Square has several restaurants where one could eat an amazing Italian meal. This seems to be the center plaza where everyone congregates at. A beautiful fountain is in the center, a perfect place to take pictures. Each of the restaurants seem to have outside dining options as well as seating inside.",
  "The main plaza in the Federal Hill section. Has lots of restaurants around it as well as love music at times. Worth strolling though if you’re in the neighborhood. ",
  "First time in Federal Hill and absolutely loved DePasquale Plaza!\nThe vibe, the people, everything about this place is amazing!!!",
  "it was so much fun.  Live music at night and on the weekend afternoons.  Fun place to people watch from the bar at our hotel. "
 ]
},{
 "name": "Providence Athenaeum",
 "address": "251 Benefit St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/10/3b/e3/photo0jpg.jpg",
 "tags": [
  "tour",
  "library",
  "library",
  "family",
  "kids",
  "library",
  "tour",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d105267-Reviews-Providence_Athenaeum-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had 1 day in Providence.  We usually love to stop by libraries especially when our children need a break from the other tourism stuff.  We did the self-guided Raven Tour.  We purchased Athenaeum stickers & post cards.  We read a few books in the Children's section & frankly could have stayed here for a the afternoon.  This library was cool & we are glad we stopped by.",
  "We simply loved it. The ambience has to be experienced to understand.\n\nMy wife is an avid reader and could have stayed there all day ... the names on the shelves are amazing. For me, I enjoyed sitting and reading the paper. There was no effective aircon, so best to visit on a cooler day.\n\nDelightful! Highly recommended.",
  "This is a private library on the east side of Providence. Even though it is private, they let people come in and look around. It has been visited by Edgar Allen Poe and others!! A must see if you like books, historical sites, or architecture.",
  "Our family of four loved this museum, it had an incredible variety, was just the perfect size to keep the kids entertained and the exhibits were incredible. Highly recommend. ",
  "I highly recommend you pop by- it's by everything in Providence and won't take up too much of your time. When I was there, there were students studying everywhere so we crept about quietly for a few minutes just to soak up the vibe. Excellent library!",
  "Wandering along the paths in Swan Point Cemetery gives birdwatchers an opportunity a chance to see a wide spectrum of species from owls and woodpeckers in the trees to swans and wild turkeys on the ground any time of year. ",
  "We had 1 day in Providence.  We usually love to stop by libraries especially when our children need a break from the other tourism stuff.  We did the self-guided Raven Tour.  We purchased Athenaeum stickers & post cards.  We read a few books in the Children's section & frankly could have stayed here for a the afternoon.  This library was cool & we are glad we stopped by.",
  "We simply loved it. The ambience has to be experienced to understand.\n\nMy wife is an avid reader and could have stayed there all day ... the names on the shelves are amazing. For me, I enjoyed sitting and reading the paper. There was no effective aircon, so best to visit on a cooler day.\n\nDelightful! Highly recommended."
 ]
},{
 "name": "Seastreak Ferry",
 "address": "25 India St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/4e/4d/1b/our-ferry-offers-all.jpg",
 "tags": [
  "free",
  "walk",
  "economical",
  "tour",
  "walk",
  "free",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d10584190-Reviews-Seastreak_Ferry-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "We drove from Providence to Newport one day and took the ferry round trip the next. The ferry was absolutely the best way to go, avoiding heavy traffic and dropping you right in the busy Newport harbor area where you can easily get an Uber to the mansions or other sites. The trip itself is invigorating!",
  "I had a wonderful time as a first time trip and on the Seastreak Ferry, I attended with my professor and some classmates from college it was great being on the top deck I stay up there the whole trip admiring the scenery. loved it thank you for providing great service.",
  "This is a great ferry service linking two of Rhode Island’s most popular destinations. The trip takes about an hour total, and I had a pleasant ride on the open-air deck up top (but the boat can kick up some spray every now and then so be prepared to get a little wet if you want to sit up top). You get some beautiful scenery along the way, like Newport Harbor, Pell Bridge, the skyline of Downtown Providence, and probably 10 different lighthouses. There probably aren’t many better ways to see the Ocean State than from the water, so if you’re vacationing in either Newport or Providence, think about visiting the other city by ferry for a day trip! (And don’t worry, it’s easy to get around once you dock: in Providence, a free shuttle service will bring you downtown, and in Newport, you’re a 5-minute walk from the heart of downtown and next door to the bus station.)",
  "This is a great, economical, fun way to get to and from Newport. The ferry is passenger only (bikes are OK) and there is both indoor and outdoor seating. The ride through Narragansett Bay & Newport Harbor is stunning. The price for a senior is only       $10 per senior for a round trip ($20 non-senior). Be sure to bring a jacket or sweatshirt if you sit outdoors as the ride is windy.",
  "Skip the search for driving directions, skip the drive, skip the search for parking. Simply look to the Seastreak ferry for a simpler way of traveling from Providence to Newport. We booked return tickets online. The tickets came to my phone by email. We chose the 9:30am departure. Boarding was efficient and there was plenty of comfortable seats onboard and large windows to enjoy the view. The ferry docks just a short walk from the central visitor’s center in Newport. Easy to connect to the trolley tour tour of your choice. The ferry departed and arrived on time. We returned on the 5:00pm ferry after an enjoyable day in Newport. Thanks to Seastreak for a great day!\n",
  "nice quick and cheap return ferry. Free wifi and small snacks and drinks available to buy. Outside seating if not to cold",
  "Everything went well. It is a clean ship with friendly people. We enjoyed a smooth ride across and enjoyed the scenery along the way.",
  "Seastreak bus picked us up near hotel. The actual ferry ride from provedence to newport was nice and took about an hour.  On the return from Newport back to Providence were told there would be shuttle waiting to take us back to downtown Providence.  Well, that didnt happen, after about 10 mins in kind of a sketchy part of town and no shuttle in sight made call to Seastreak and they seemed to be confused about any shuttle service offered?  Ended up spending $15 to get back to hotel.",
  "We drove from Providence to Newport one day and took the ferry round trip the next. The ferry was absolutely the best way to go, avoiding heavy traffic and dropping you right in the busy Newport harbor area where you can easily get an Uber to the mansions or other sites. The trip itself is invigorating!",
  "Very reasonable. no worries about driving in Newport or parking. Drop off is great location close to everything. Beautiful ride past lighthouses, beaches and the Newport Bridge.  Great way to see Rhode Island from the water.\nFireworks under the lite up Newport bridgewere awesome.",
  "We booked ferry to Marthas Vineyard months before due travel date but due to Hurricane Dorian travel was in doubt. Arrived at terminal and reassured trip will go ahead until 15 mins before departure when cancelled as no available berth on the Vineyard. No fault of Seastreak and am glad to say that they immediately provided a full refund of ticket cost and valet parking fee with an apology. Very dissapointed not to travel but would return if in this area again as excellent service provided in adversity"
 ]
},{
 "name": "Swan Point Cemetery",
 "address": "585 Blackstone Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/c3/91/f5/grecian-swan-point.jpg",
 "tags": [
  "hike",
  "nature",
  "history",
  "walk",
  "historic",
  "walk",
  "walk",
  "history",
  "walking",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d561334-Reviews-Swan_Point_Cemetery-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "I like to go down by the river in the back with binoculars and camera.  There are always a wide array of creatures of nature; especially red-tail hawks.  The fall colors are amazing! There is a trail that leads along the river that is splendid albeit littered with fallen trees from recent storms.  But that's okay, it just makes your hike that much more interesting and your work out a little more intense.  Totally pay attention to how you got in there or you may need your GPS to get out again@",
  "The gravestones and monuments are beautiful, breathtaking.\nThe history will amaze you.\nDo some homework before you go, it is a expansive place and you want to map out your interests.",
  "This is a quiet place, good for a thoughtful walk through towering trees. Many of the graves are pre-Civil War. Visit the final resting place of Sullivan Ballou, who wrote the beautiful letter featured in Ken Burns' Civil War series.",
  "While it admittedly feels a bit strange to be reviewing a cemetery, I felt that it truly deserved a mention as a gorgeous place to enjoy either a peaceful walk, drive, or meditation spot. The area was impeccably well-kept, even when I visited in the winter, and I can only imagine how beautiful it must be in the spring when all the plants are green and blooming. \n\nThe cemetery itself is mostly historic, and if you have time to explore you can find the graves and monuments of famous Rhode Islanders, such as the writer H.P. Lovecraft. If you meander to the far back, you can overlook the water and enjoy the view and stillness. \n\nThe only caution I would give is that it can be a bit maze-like, so be sure to remember where you are going or download a map (I found one online) unless you are blessed with a great sense of direction!",
  "A tree museum and a cemetery - it is a beautiful place to walk.  If you can be there when the trees bloom in the Spring you are in for an added treat.",
  "We visited this place on October 2. In the office building you can get a map and a booklet with the principal monuments and graves. There are several bronze monuments.",
  "I use Trip Advisor for everything and now I can add advanced planning to my list. Unfortunately we lost two very special friends this past year and both are buried here. I have also been there to visit these loved ones graves to pay respect. Not sure how to explain it, but there is this serene and peaceful feeling every time I have been there. It is a 200 acre park like cemetery. \n\nWe made plans to visit with Linda and learned so much from her. My husband and I were both pleased that we chose our final resting place. We also met the Foreman of the Cemetery Jim who was so pleasant and kind. There is so much history here and let's face, we are all going to need a final resting place. My husband and I both felt at peace with our decision and the grounds, trees, and entire landscape are meticulously cared for. \n\nIt is a beautiful place to walk and enjoy the grounds! There are lots of birds and we even saw a flock of turkeys walking around.",
  "Beautiful 300 acre cemetery. Walking around you can tell that a lot of care goes into this place daily. The trees are beautiful and there is an area along the water that is peaceful. "
 ]
},{
 "name": "Providence Place Mall",
 "address": "1 Providence Pl",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/30/6c/ac/louis-at-providence-place.jpg",
 "tags": [
  "walking",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d105262-Reviews-Providence_Place_Mall-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nothing’s missing out of this mall! No empty storefronts lined up by the dozens here! This mall has everything you could want and more (except for a Chipotle). Bring your walking shoes because you’re going to need them. ",
  "Shopping, shopping and more shopping!  Dave and Buster's, Movies, I-Max 3-D, (my favorite!), CheeseCake Factory, Providence Waterfire.  And so much more to choose from!  Did I mention shopping and shopping and shopping?  Awesome place always!",
  "This mall was a total game-changer for the city when it was first built, and it’s still a great place to go for shopping, food, and entertainment. And even if you don’t need to go shopping, this is probably the best place in Providence to park — the garage has very low rates and the mall is connected to downtown via the skybridge and the Omni Hotel. If you’re visiting the city, you should check out the PPM.",
  "Very impressed with Providence place mall. Easy parking and access to all floors.Definately bigger and better than our local Cape cod Mall. Worth the drive.",
  "It is no surprise that prestigious Nordstrom's left this mall.  This mall is a hang-out for teenagers.  I did not feel safe here.  Reports of incidents have made the newspapers.  ",
  "Your racist manager kicked me out last night after 45 seconds in your restaurant. He screamed at me. He threatened to call the police. I hope you understand how disgusting this location is. Perhaps the entire company, considering no action has yet to be taken.",
  "Made an excursion in Providence to Providence Place. I love that this mall has indoor parking--although finding a spot can be a chore.  There are so many stores in this place and I don't believe we explored the entire property.  The food court was okay; a bit disappointed that vendors didn't offer trays to carry food; made carrying bags and food a bit tricky & clumsy.",
  "We came from nyc to providence Rhode Island and visited this mall for the Black Friday and it was a great experience "
 ]
},{
 "name": "John Brown House Museum",
 "address": "52 Power St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/c2/5f/01/photo1jpg.jpg",
 "tags": [
  "history",
  "tour",
  "family",
  "historic",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "historic",
  "history",
  "tour",
  "free",
  "music",
  "food",
  "tour",
  "family",
  "historic",
  "history",
  "history",
  "tour",
  "family",
  "historic",
  "history",
  "walk",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d104608-Reviews-John_Brown_House_Museum-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Recently,I visited the John Brown House.My visit was a fruitful experience.The guide at this house museum was very well-versed in Rhode Island History.I learned about the life of John Brown,a very prominent figure in the history and growth of Providence.I saw the house's shadow rail staircases.I saw some nice American paintings by Robert Feke,Alvan Fisher(\"View of Providence From The Cove\")and Henry Kinney(\"Moses Brown\").",
  "If you are in Providence this is a must see if you want to get an understanding of local history and the movers and shakers during colonial times and the early years of the republic. The Brown family has obvious ties to Brown University. A tour of the Historic home will last about 1-2 hours; it makes sense to take the guided tour to get a better appreciation for the home and history of the Brown family. One of the interesting things which the tour guides do not shy away from is the fact that the Brown family did have ties to the Atlantic Slave Trade. They cover the complexities of this very controversial time in history. If in Providence I really believe this should be a stop you make. Well worth the price of admission.",
  "This house has a lot of history, If you have about an hour take the audio tour\nmoderately priced and the staff are friendly and knowledgeable",
  "The John Brown House was the first mansion built in Providence, Rhode Island and is located at 52 Power Street on College Hill (bordering the campus of Brown University). The house is named after the original owner and one of the early benefactors of the University, the early American merchant, statesman and slave trader, John Brown (declared a National Historic Landmark in 1968). http://www.rihs.org/museums/john-brown-house/\nDuring our visit in July, the house/museum was open until 4:00 and it was almost 3:30 when we arrived (too late for the guided tour). They did let us take the audio tour and we were told that we could stay until 4:30. Admission prices: Adults $10, Senior & Students $8 and Children 7-17 $6. The audio tour is very extensive; we had to fast forward to finish the visit in time. The audio worked well for most of the time but we found that the sections narrated by the male were a bit hard to hear and we could not change the volume. It was a lovely house with a great history. We found the newer (early 1900's) additions especially interesting. The bathroom off the master bedroom was really nice and visitors are allowed to enter this area for a closer look. Check out the surround shower; it takes a close look to see where the water comes out. \nIt was also nice to have a few hands on things for children (and adults) to examine. The parlor had small boxes of smells - ship, mahogany, rum cask, gunpowder, dirty linen (ugh).",
  "We visited the John Brown House museum in November of 2017. The lady at the front desk, Gabriella George was very nice and suggested the audio tour, since we were a little tight on time. She was right. It was wonderful. It took us through the house and explained everything. It gave us insight into how people lived a century or more ago.\nThe place is magnificent. Do not miss the bathroom near the front desk or the bathroom upstairs. I'm not kidding. Interesting! It's so great not being rushed and taking in everything.",
  "Throughout July and into August (for 6 weeks on Thursday evenings at 6:30pm) head to to the  John Brown House for the RI Historical Society Concerts on the Green. The venue is lovely: open air on the grass, which is gently sloped like an amphitheater. The music varies week to week and year to year -- American Band, Greg Abate, Duke Robillard, Pendragon (Celtic), and Magnolia (Cajun) are pretty regular with another that varies from Latin jazz to Beach Boys tribute. some food vendors on the spot. Join the RIHS and the concerts are free.",
  "The Benefit Street tour starts from the John Brown Museum. You have to book advance and it is a great way to find your way around the historic sites of Providence. Geographically, the tour covers a distance from about the middle of Benefit Street down to the northern end of the street; and historically it roams from the earliest settlers right up to the modern day. The history of Brown University, and the mega rich Brown family who set it up, are inevitably a big part of the story. The family patriarch John Brown features prominently and our guide didn’t shy away from Brown’s less than proud history of slave ownership. There’s also a visit to the Providence Athanaeum, site of some Edgar Allan Poe scandal, and a tour of the First Baptist Church of America, which looks exactly as you would hope a New England church to look. The tour does take a very long time and our teenager was getting a bit fed up at the end, but it was interesting and we learned a lot.",
  "Recently,I visited the John Brown House.My visit was a fruitful experience.The guide at this house museum was very well-versed in Rhode Island History.I learned about the life of John Brown,a very prominent figure in the history and growth of Providence.I saw the house's shadow rail staircases.I saw some nice American paintings by Robert Feke,Alvan Fisher(\"View of Providence From The Cove\")and Henry Kinney(\"Moses Brown\").",
  "If you are in Providence this is a must see if you want to get an understanding of local history and the movers and shakers during colonial times and the early years of the republic. The Brown family has obvious ties to Brown University. A tour of the Historic home will last about 1-2 hours; it makes sense to take the guided tour to get a better appreciation for the home and history of the Brown family. One of the interesting things which the tour guides do not shy away from is the fact that the Brown family did have ties to the Atlantic Slave Trade. They cover the complexities of this very controversial time in history. If in Providence I really believe this should be a stop you make. Well worth the price of admission.",
  "I was in Providence on a business trip and only had a few hours of spare time. I chose to visit this gorgeous historical house and made my stay worthwhile. You can listen to an audio, read a brochure or have a guide walk you through the details of this magnificent house. George Washington supposedly stayed there and gave it a five-star rating. The best thin is that it only cost me $10.",
  "This house has a lot of history, If you have about an hour take the audio tour\nmoderately priced and the staff are friendly and knowledgeable"
 ]
},{
 "name": "Thayer Street",
 "address": "Thayer Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "eat",
  "kids",
  "food",
  "walk",
  "history",
  "walk",
  "food",
  "food",
  "family",
  "kids",
  "food",
  "eat",
  "kids",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d116250-Reviews-Thayer_Street-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Awesome street filled with shops and restaurant. Definitely check this street out if your in Providence looking at schools. The perfect street for college kids to gather, eat, etc. the Brown University Book Store is in Thayer Street. The best place to go grab a bite to eat while exploring the beautiful campuses of RSID and Brown. Everything from Ben & Jerry’s, Shake Shake, Chipotle, pizza, pita, smoothies, fro yo, Starbucks. I know my kid would have plenty to choose from while in college here. ",
  "Thayer Street is a very popular area for students and the rest of us! It's an eclectic concentration of coffee and ice cream shops, has a variety of restaurants of many ethnic offerings, and a number of retail shops. It is also home to the Brown University Bookstore, which also sells a large variety of Brown University logo clothing, gifts and trinkets. This area is a great place to visit and have some fun! Check it out!",
  "Thayer St is a mix of chains like CVS, Starbucks, Chipotle and Urban Outfitters, a Post office, hair salon/barbershop and a few stores with character. There are also restaurants and bars, as well as the Brown bookstore. Some fast food burrito, pizza, and bagel shops provide good snack options.The CVS has no pharmacy - no way to get prescriptions, which is very inconvenient for those who live on college hill without a car, as the nearest pharmacy is a long walk away. There are a few large empty store fronts, which is unfortunate. There used to be a sporting goods store from a small chain, but that closed, which is hard to believe as of course college students want sneakers, running and hiking equipment and attire, as well as patagonia and north face outerwear. And there are not many places to shop for clothing other than Urban Outfitters. Another large storefront has been closed for years - used to be a 24 hour store, but now is an eyesore. Parking can be tough, and if you use a credit card, the minimum number of minutes you must purchase is more than you usually would want for quick errands. There are no more parking meters - must pay at central kiosk and then place piece of paper in dash, which is annoying in bad weather.  \n\nBagel Gourmet Ole is a great bagel shop - best in Rhode Island. And Blue State Coffee, though a small chain, has a good vibe for Starbucks haters. But prices are similar!",
  "Thayer Street is in  the heart of Brown University and the Rhode Island School of Design campus area.  There are a number of unusual shops and some great restaurants along the way.  Parking can be challenging but once parked, it is a great place for a walk.  There is a movie theater, college bookstore, eateries, and centuries of history to view.  It is a great area to explore.  Winter can be tough with all the snow we have had.  Wait until the weather breaks.  Fall is a great time.",
  "Thayer has a bit of everything including a wide assortment of restaurants which serve food from a wide variety of nations.  Andreas (Greek) is especially good.  But, many of the little hole in the wall cafes serve very good food. Very international.  Lots of shops with funky and avant guard objects to buy.  Parking can be a little dicey depending on the time of day and it is metered.  A great place to stroll and share a meal.",
  "I love going shopping and eating one Thayer St.. There are just so many great small shops and restaurants that cater to every age group. Lots of course for the college age kids as Brown University is in their backyard so to speak. and within just a mile or so from other private schools and colleges.However the adults from all over the State know it is a hub for nice clothes and good food. You can get just about anything on this strip from a bagel to a high end meal. From a pair of socks to custom made suits.Low prices,High prices. Remember,not all the kids have a rich dad or mom..Most of these kids are one thing and that is for the most part, very,very,smart.You do not get into Brown unless you are  smart.and the private schools and other colleges in the area tend to get the smart ones as well. This street is smart,it caters to every person who comes here.and it does it just so well. It is a fun place and you will just have a good time and get some great items as well.\nThe food is really good quality or it will not last here.So,Thayer st.calls to you. bring your whole family. They will love it here.",
  "Some of the best Greek food I have ever experienced.  Finding parking is a very big problem especially when Brown and RISD are in session but still worth it.",
  "Awesome street filled with shops and restaurant. Definitely check this street out if your in Providence looking at schools. The perfect street for college kids to gather, eat, etc. the Brown University Book Store is in Thayer Street. The best place to go grab a bite to eat while exploring the beautiful campuses of RSID and Brown. Everything from Ben & Jerry’s, Shake Shake, Chipotle, pizza, pita, smoothies, fro yo, Starbucks. I know my kid would have plenty to choose from while in college here. ",
  "Super hungry recently and spotted the Chipotle from the corner of my eye. Went in and the vibe in this place is great. The line moves ridiculously fast and the food was amazing. I had a chicken bowl with brown rice and black beans and a side of their house made vinaigrette and left super satisfied and craving more menu options. Will definitely be back",
  "Thayer has a bit of everything including a wide assortment of restaurants which serve food from a wide variety of nations.  Andreas (Greek) is especially good.  But, many of the little hole in the wall cafes serve very good food. Very international.  Lots of shops with funky and avant guard objects to buy.  Parking can be a little dicey depending on the time of day and it is metered.  A great place to stroll and share a meal."
 ]
},{
 "name": "India Point Park",
 "address": "Gano Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ca/57/69/photo2jpg.jpg",
 "tags": [
  "music",
  "walking",
  "food",
  "kids",
  "walk",
  "walking",
  "history",
  "walking",
  "walking",
  "walk",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d12927187-Reviews-India_Point_Park-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "India point park hold summer food and music festivals. They keep the park so clean and there is no vagrants that hang around. I come for the seafood festival and the carribean festival, its the perfect weather to be right by the water . Parking is also very good here, if you can't find any lot parking then there is plenty of street parking within walking distance. ",
  "I visited this park while I was at the hotel just crossing the road. The park has a nice paved walk way for a run, walk or biking and also offers a lot of parking spaces for visitors and a playground for kids.",
  "Located across the river from downtown Providence, just off  I-195 (the Cape Cod route), this gem of a park provides greenspace, walking and biking paths (link to the Blackstone River Bikeway), playground, picnic space and wonderful views of Narragansett Bay at the confluence of the Seekonk and Providence Rivers.  Markers along the route trace the history of the area from its origins as a major port in the 1700's to a steamship landing and railroad yard in the 1800's, and finally as a hulking metal scrapyard into the 20th century, when a visionary woman, Mary Sharpe, recognized it's potential and started the movement to restore the Point.  Easily accessible from the highway as well as from the nearby Hilton Garden Inn (which is how we discovered it), it is a wonderful place to visit, even if only for a short stroll. Thinking of packing a picnic and taking a break here next time we head for the Cape!",
  "At the head of Narraganset Bay. Well appointed and offers nice views to the south. A peaceful green space just off downtown.",
  "Situated on the shore of the Seekonk River and Narragansett Bay, India Point Park is a lovely place with wonderful views.\n Super for sunbathing in warm weather, a leisurely stroll, or walking dogs as I used to do when I still had dogs. ",
  "We were staying at the Hilton Garden Inn, which is right across the street from this park. There is a walking trail, benches, fishing and a playground, on the water. It is a nice spot just to walk and look out over the water. Peaceful.",
  "Went for a walk on Sunday along waterways in Providence city. Walked past India Point Park and saw many mobile food stalls in a Food Festival. Have to pay $20 for entry ticket. ",
  "Came here today for the seafood festival. It was a nice spot on the river. Would be a nice place to stroll or hangout. Did not see a playground."
 ]
},{
 "name": "Roger Williams National Memorial",
 "address": "282 N Main St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/1e/c7/a9/roger-williams-national.jpg",
 "tags": [
  "history",
  "tour",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d267897-Reviews-Roger_Williams_National_Memorial-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was nice to talk to the officer in the visitor center. She was very well informed and personable. Liked the white board comments too.",
  "The Memorial & history of Roger Williams is very interesting. The surrounding park is lovely but my favorite thing was the wonderful views of Providence. The park is in the Brown University area and certainly worth the stop.",
  "All People need to visit this National Memorial! This is a little oasis in the midst of Providence dedicated to Roger Williams and the birth of Rhode Island and Providence Plantations. The NPS Ranger was more than able to explain the history and significance of this wonderful site.The history of religious liberty was born here in 1663 and the significance cannot be overstated. Please check out the NPS site to get the history of this site prior to visiting. Also the NPS Center has a great selection of books and material to help make your tour more exciting.\n\nEveryone should visit .........",
  "A very nice green space in the middle of Providence. A fitting tribute to Roger Williams and his efforts to establish a civil existence in the New World. Small and beautiful!",
  "This could easily be the smallest national park in the US.  It is about two blocks long.  The main attraction, the Roger Williams water source was fenced off.  The visitor's center has helpful park rqngers and five minute video.",
  "It was nice to talk to the officer in the visitor center. She was very well informed and personable. Liked the white board comments too.",
  "Free parking, small visitor's center. My son printed the Junior Ranger booklet from the website at home so he had most of it filled out before we got here. We watched a 5 minute video about Roger Williams, who seems to have had such modern ideas for his time. We spent about 15 minutes here and then we were done!",
  "A nice spot in downtown Providence. With that being said there is not much to see here, but if you’d like a quick stroll it’s a nice spot for it. "
 ]
},{
 "name": "Roger Williams Park Botanical Center",
 "address": "1000 Elmwood Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/1a/5f/de/tropical-sites-and-feels.jpg",
 "tags": [
  "kids",
  "walk",
  "creative",
  "kids",
  "unique",
  "creative",
  "walk",
  "walk",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d7745986-Reviews-Roger_Williams_Park_Botanical_Center-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "I actually had no plans for the visit and I decided to see what this beautiful botanical place was about. Very cool! It is amazing with detail information. I am not sure if little kids will enjoy the long walk but for adults its a plus. I recommend comfy shoes and clothes, stay cool if your out on the summer and if you have any elders make sure they are also comfortable. You will not have any regrets upon visiting it is peaceful and amazing. wink!",
  "This is the 4th year of the Fairy Garden show where almost a hundred fairy houses are sprinkled around the botanical center among the plants and trees. It is just magical - so creative!  It makes you inspired to go out and make a fairy house from your yard.  There is a scavenger hunt for younger kids and a botany hunt for older kids and adults.  It's a great way to spend an hour or so in a beautiful location with creative inspiration.  It only lasts until May 1st so be sure to go soon.",
  "The botanical center is a great place to visit any time of the year but is especially nice with cold winter days - you can pretend you are away in the warm weather.  It is especially great now with the fabulous Ceramic Show - tucked in among the plants are unique, wonderful examples of all types of ceramic works - it's truly amazing.  You have to go quickly - the show only lasts until next weekend. But, after that there is the magical Fairy Garden exhibit - where the master gardeners create incredibly creative fairy houses.  The fairy garden exhibit is a must for both young and old. The Botanical Center is one of the top things to see in Providence.",
  "We went to the Botanical Center while visiting the park. The cost to get in is nominal (less than $5 per person). There are several green houses to walk through as well as outdoor gardens. They really have a lot to see, although I'm sure it's prettier in the Spring. They even have goats! Worth the cost of the visit for sure.",
  "It was a very clean but small property. It was worth the price ($5 entry). A few greenhouses and outdoor gardens. When we visited there was a hawk stuck in one of the greenhouses",
  "The greenhouses can be warm so you take a chance when having a wedding in July. However, the weddings and receptions are scheduled after 6PM, which helps. Spring and Fall weddings are perfect for this venue, but those dates go quickly. The staff is really great too.\n\nIf you are like me, because the greenhouses are so wonderful, it is a perfect location for a wedding celebration.",
  "We had a nice walk through the gardens and it only costs $5 each to get in. The goats and koi pond were a nice addition, but the outdoor gardens were on the small side. ",
  "It’s a lovely garden, A bit relaxed with weeds showing here and there, empty spaces missing plants, some plants are not doing well. We still enjoyed walking and let the kids run. Considering the price is very low, you kind of get what you paid for. "
 ]
},{
 "name": "The Providence Flea",
 "address": "475 Valley St WaterFire Arts Center",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/79/f9/5b/aerial-view-of-pvd-indoor.jpg",
 "tags": [
  "art",
  "food",
  "food",
  "food",
  "kids",
  "food",
  "delicious",
  "free",
  "creative",
  "eat",
  "food",
  "walk",
  "unique",
  "food",
  "art",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d13197969-Reviews-The_Providence_Flea-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Not what I think of as a typical flea market.  There is a lot of exceptional original art and the whole place has a funky, artsy feel.  The food trucks offered a wide variety of eats for shoppers.  The location on the water and the fun, lighthearted vibe were a welcome departure from the ordinary.  ",
  "Great food, fantastic vendors and all-around fun day out! Great place to shop for local goods and support all the artisans in the PVD area! ",
  "I love visiting the Flea!  There really is something for everyone- a great variety of vendors from handmade jewelry and other creations to vintage and antique items.  There's an assortment of food trucks (and sometimes even a flower truck!).  The Presto Strange O coffee truck seems like a weekly guarantee and it's amazing.  We bring our kids and they love the waterfront area- watching the kayaks and ducks is probably one of their favorite things about the Flea.  I bring a small stroller and have no issues using it on the grounds.",
  "Love the food trucks, love the antique wares and the booths with imported goods too. I could do with a bit less of the handcrafted tchotchkes (\"decorated\" furniture, repurposed liquor bottles, etc.) but it's almost all original and interesting. Come early for the best selection or late for the best prices!",
  "Aw, I’m so enamored with The Flea. I enjoy both the indoor and outdoor versions but there’s something very special about the South Water Street location. \n\nWe’re pretty much regulars and more often than not we leave with one or several fun finds. We’ve bought some great old industrial stools, vintage metal signs, gifts for almost everyone we know, hand crafted items, delicious snacks, even a henna tattoo! The vendors are all so friendly. It’s also just a nice area for a stroll by the water.  \n\nWe love our Sundays at The Flea. Parking is not usually a problem, just go past it up S Water St or try Main Street or Benefit. I think there’s a lot you can pay to park in on S Water as well.",
  "The location of the Providence Flea in the summer months is a revitalized spot by the canal, so relax and enjoy the water view. Shop at a huge variety of local, creative, one of a kind vendors, and eat just about anything you can think of from one of the many food trucks that are always by the side of the road! There are vegan and GF choices too! Parking was actually easy to come by and free! ",
  "Went for morning Sunday walk along Providence River. Passed by Flea Market and bought a freshly made lemonade. A lot of stalls selling home made handicrafts.",
  "The best place to find unique items, including vintage and hand crafted.  Great selection of vendors.  Indoors in the winter and outdoors in the spring & summer.  You can also find the best food trucks in Providence!  I always find something new and fun each time I go.\n\nPSA: This is not a yard sale experience!",
  "Has some of the most original items in Rhode Island. Great for Christmas gifts. Some of the highlights are pottery, candles, body products, vintage clothes, art, jewelry.",
  "Small venue overpriced not like advertised was disappointed . Free parking a plus Tshirts sold for 39.99 by a vendor found for $10 in stores.",
  "Went to the flea for the first time this summer.  Have to say I was quite disappointed.  There were very few vendors there and the ones that were had things that were quite expensive.  When you see flea market you think, recycled, used, or lower priced.  While I did enjoy some of the vendors, I have to say we did the whole market in under an hour.  It's in a pretty spot but that's about the best I can do."
 ]
},{
 "name": "Prospect Terrace",
 "address": "Congdon St. and Cushing St.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/68/a0/4b/view-of-providence-downtown.jpg",
 "tags": [
  "hike",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d280453-Reviews-Prospect_Terrace-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "An awesome overlook for the city. There is an impressive statue of Roger Williams here, as well, but the panoramic view of Providence and back north is well worth the hike up here.",
  "I think at some point there may have been a great view from here but the trees in front are so tall, most of the view is now blocked. An uphill walk for very little view.",
  "This is where you go to see the panorama that greeted Roger Williams (with a lot fewer buildings, or course). The park is lovely and you get a good sense of the city from this high point.",
  "Whenever we have guests and want to give them an overview of Providence we go to this park.  It is a wonderful place to talk about the history (both colonial and modern) of the city.  And not a bad place just to chill out either.",
  "I found this place while on a run on College Hill, and came back to watch a sunset with my girlfriend.  It might be the best view of Providence that you can find.  It's a nice place to share a quiet moment with good scenery, definitely worth a stop."
 ]
},{
 "name": "Wickenden Street",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/9e/64/89/pub-sign.jpg",
 "tags": [
  "unique",
  "walking",
  "historic",
  "food",
  "drink",
  "art",
  "family",
  "walking",
  "walking",
  "walk",
  "unique",
  "family",
  "food",
  "walk",
  "unique",
  "food",
  "unique",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d116252-Reviews-Wickenden_Street-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to find unique gifts by local artists.  Fun shopping with my daughter over the Christmas holidays.  ",
  "A perfect thing to do when you just want to enjoy the day. There is an amazing coffee shop, antique shopping, artisan shops, a variety of restaurants and plenty of parking. It is also within walking distance to a park by the water, downtown, and RISD museum is 1/2 mile away. ",
  "Take a stroll along historic Wickenden Street and grab a drink or food at one of the many restaurants and coffee shops along the way. This area was primarily a Portuguese neighborhood at the turn of the twentieth century and is now inhabited by hipsters and college students ",
  "Wickenden Street is a great place to spend an afternoon.  It is a walking street with plenty of off street parking, mostly behind the businesses.\n\nThere are several great breakfast / lunch places on the street.  Cafe Zog, Coffee Exchange or Brickway andFellini's Pizza to name a few.  Dinner later might find you at Sakura Indian or Abyssinia Ethiopian or Z Bar.\n\nThere is a family owned hardware store, an art supply store, a custom framing shop, a computer repair store and a teriffic consignment shop.\n\nInterested in browsing?  You might check out Round Again record store, Curiosities Gift Shop, Mister Sister Erotica (a person friendly non pornographic shore.  You'll meet Devin the owner, usually sitting outside chatting with people).  There is also an ice cream shop, great hair salons.  Also, don't miss The Peaceable Kingdom, just off Wickenden.  They've hunted the world to bring you the most interesting clothing, artifacts, decorations, etc in the area.  Its just off Wickenden, and worth finding!\n\nThere is so much to see and check out, you might want to spend a little time on Wickenden Street.  Breakfast, lunch, dinner and plenty of things to do an see inbetween!",
  "Good restaurants - Andreas and Paragon and Shark Sushi are our favorites, great people watching and grab a coffee at Au Bon Pan, or shop in the sute stores - good weather activity is best because parking is limited.",
  "A perfect thing to do when you just want to enjoy the day. There is an amazing coffee shop, antique shopping, artisan shops, a variety of restaurants and plenty of parking. It is also within walking distance to a park by the water, downtown, and RISD museum is 1/2 mile away. ",
  "Went for nice walk along Wickenden Street neighbourhood. There are a lot small cafes,  hair saloon, restaurants, etc. ",
  "this street is so unique with all of its shops,restaurants,and other neat things to see and do here. I love to shop here as you can get items made by some of the shop owners. Great food at restaurants serving foods you may never have had before. American food to foods from all over the world. The shops are for the most part small but packed with goods again from all over the world.A great family trip with everything a short walk away.  Everyone will have a great time and you will have discovered a whole new world of shoping. I love my trips here and always come away with a new treasure and have had a great meal. I love the restaurants here but I have made it a hunt to always go to a different place each time. I have learned so much about foods of the world in this way. A go to location.",
  "Great place to find unique gifts by local artists.  Fun shopping with my daughter over the Christmas holidays.  ",
  "Great Food and Atmoshere. Friendly staff and clean environment. I would put it on my list when in Providence, Rhode Island",
  "My daughter lives on Wickenden Street right across from India Point. They have many activities there on a regular basis, including a Flea Market every Sunday. Sometimes theres entertainment, sometimes food trucks. It's all good. But one of the best parts about the street are the unique shops on nearly every block. Many artistic shops with items from local artists and it's fun to just stroll down the street and look-but not so easy to go without buying something you fall in love with."
 ]
},{
 "name": "Providence Art Club",
 "address": "11 Thomas St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/68/bf/cc/old-world-style.jpg",
 "tags": [
  "art",
  "art",
  "historic",
  "food",
  "art",
  "art",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d290573-Reviews-Providence_Art_Club-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went to their members show and there was work after work that I would like to own.  The building is a classic and the art inside in show after show is great. They have a small parking lot off of Benefit St.  In Providence put this on your list",
  "I've enjoyed the variety of the artwork. Though small, they display the art beautifully, the building is historic. The exhibits excellent. Great for a group that wants a little art but not a huge museum.\n",
  "... and sometimes challenging.  The current exhibit (opened mid August) is sort of a tribute to the horror writer H P Lovecraft and may not be to everyone’s taste but still interesting.  In both galleries.  There is parking in the small lot off of Benefit St",
  "I went at the invitation of a friend of a friend who is an artist and member of the club. The food was very nice, the atmosphere great for discussion among a group of friends, quiet and elegant. ",
  "Went to the recent small pictures exhibit.  All from local artists and all under $300.  Really fun in such a beautiful building.  Will be back next year! ",
  "We went to their members show and there was work after work that I would like to own.  The building is a classic and the art inside in show after show is great. They have a small parking lot off of Benefit St.  In Providence put this on your list",
  "I've enjoyed the variety of the artwork. Though small, they display the art beautifully, the building is historic. The exhibits excellent. Great for a group that wants a little art but not a huge museum.\n"
 ]
},{
 "name": "The Vets",
 "address": "1 Avenue of the Arts",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/50/47/72/the-vets.jpg",
 "tags": [
  "food",
  "cheap",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d7679255-Reviews-The_Vets-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I have attended several concerts at The Vets (technically Veterans Memorial Auditorium) to hear the Rhode Island Philharmonic Orchestra, an excellent group of musicians. The Vets auditorium is an absolutely perfect venue for such performances: beautiful interior, great acoustics, and good seats in all parts of the theater. We had balcony seating and never thought we'd be better off in seats below us. Parking a short distance away at the Providence Place mall is inexpensive. And if you're from out of town, consider dining in the city as part of your trip--Providence is a food lover's dream.",
  "This place is by far the best place to see a show. It is beautiful inside. Drinks are pretty expensive, but same as every other venue. Seating isn't bad. Great view no matter where you sit.",
  "I recently attended a show here.  I got the \"cheap seats\" for only $20 on the upper balcony, and had no trouble seeing the stage.  The staff is friendly and the theater is just beautiful.  There are plenty of bathrooms and drinks are reasonably priced.  I will certainly come back for more shows.",
  "We are lucky to have so many beautifully restored historic buildings in Providence with The Vets being one of them. They host some great oldies groups and also have a series of performances for school children such as Harriet Tubman/The Underground Railroad and others. Conveniently located off Rt 95, near Providence Place Mall and Renaissance Hotel.",
  "No matter which event you decide to pick, the supreme delightful orchestra along with solo instrumental or solo vocalist, this venue allows us to experience the finest works of Tchaikovsky, Mozart, Beethoven, Brahms as well as the Unforgettable Overture of 1812! It is truly an utter joy to return year after year to hear such marvelous vivacious musical creations in such a beautiful theater, it's worth the trip!",
  "The orchestra seats offered plenty of legroom and were generously sized.  The auditorium was beautiful;  the staff were v very courteous.  ",
  "I went to the Cruel Intentions: The 90s Musical at The Vets Memorial Auditorium spur of the moment on the last evening of a business trip. I had such a wonderful time! I was able to buy tickets at the door and all the staff was nice and helpful. The event was well managed with a courteous audience. I didn't know what to expect of the off-broadway musical, but any expectations I I had were blown away. I loved the production and the venue.",
  "First time at the Vets. Went to see the Red Hot Chili Pipers. Beautiful venue. Polite, friendly service. Great location. Right next to Providence Place Mall,  Renaissance hotel and many great restaurants. "
 ]
},{
 "name": "Providence College",
 "address": "1 Cunningham Sq",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/37/00/9a/providence-college.jpg",
 "tags": [
  "art",
  "tour",
  "walk",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d2412234-Reviews-Providence_College-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is the only college/ university in the U.S. run by Dominican Priests. It is coed. They won the men's NCAA hockey championship in 2015.  Basketball is Division 1. Went to the NCAA championships last year. Student body is warm and welcoming. The Dominicans are a teaching order this the education is top notch. Only 1000 students per year. They are building a state of the art business school. Do not need to be Catholic to attend however the Judeo Christian ethic and teaching principles are very evident. The campus is fairly well enclosed in a working class neighborhood. Campus is beautiful and growing. There are opportunities to be involved in an activity(ies). Student/academic services are terrific. They will help students succeed. Students are not anonymous here.",
  "While in Providence we took a quick trip to Providence College. A very quick trip. Not much time is needed to walk around the area/campus, take in the architecture and visit some of the facilities. It’s nice. That’s all. I’m sure a guided tour would’ve been more enjoyable but this did the trick as we took yet another early morning walk.",
  "This is a Dominican College, with very interesting old buildings, as well as modern up-to-the-minute facilities.\nThe Ray Treacy running track is just one of the many fantastic sports facilities there. \nStudent accommodation is high standard, with many students in top-of-the-line apartments .",
  "Providence College is a special place in a tranquil Northeast college campus setting with manicured grounds and traditional brick buildings. Courtesy and strong values rule the day among the 4000+ underclassmen students. If I were to select one word to describe PC, the word would be that the tremendous Faculty, Staff, and Administrators CARE.  ",
  "My son and I went there for his advising/registration day.  It was a beautiful campus and I look forward to him starting there as a freshman in Fal 2019!",
  "Great school& beautiful grounds.\nPeople very friendly & helpful .\nDon’t miss the Chapel! And of course the basketball games.",
  "My daughter and I went on a college tour and participated in an information session.  The campus is absolutely beautiful!  The grounds, athletic fields, and the furnishings were immaculate!",
  "College tours are all about the buildings and the tour guide (and the weather). We were blown away by how beautiful Providence was... it is immaculate.  The school may not be for everyone but the campus itself sure is....  beautiful campus in a working class area of Providence... but really you are cut off from the world in this little bubble... Great student union, great athletic facilities, great feel to campus... well done Friars!  Great tour... beautiful campus!"
 ]
},{
 "name": "Dunkin' Donuts Center",
 "address": "1 La Salle Sq",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/17/e2/a1/dunkin-donuts-center.jpg",
 "tags": [
  "drink",
  "walking",
  "walk",
  "walking",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d543215-Reviews-Dunkin_Donuts_Center-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Why go to Boston and literally pay 10x more for tickets for an event when you have this option?  If you have young (or older!) children who want to see quality live ice hockey, spend $38/ticket instead of the $400 in Boston.  Great restaurants, quality hotels within walking distance, reasonable parking make this a no brainer.  Providence Bruins hockey (AHL) is good, fast paced hockey.  A 24 oz can of beer cost $13 for reference.  We sat in the 6th row behind tunnel for the player for $38.  What a deal.  Marriott offers two hotels within walking distance for about $200/night, parking $30/night at the hotel (cheaper in some of the parking garages) and you can walk to Federal Hill for an outstanding Italian meal in 5-7 minutes before or after the game.  Also a couple of nice pubs outside the venue where you can actually get a seat after the game and sit and talk with a drink (we went to Murphys) - but head right over there because there will be a crowd if you wait too long.  Also college hockey, basketball, Globetrotters, concerts.  If you can't already tell, I am a huge fan of this venue!!!",
  "Went to recent Providence College basketball exhibition game. Nice venue to watch game. My biggest gripe is the outrageous prices charged for concessions. \nSoda $6.25\nBottle of water $5.00\nSmall popcorn $9.00\nCan of Beer $13.00\nAnd so on and so on. \n\nThere must be a point where it is considered price gouging. \n\nGonna have to wait till I hit the lottery in order to go to another event at this venue\n\n",
  "My daughter loves John Mayer so we went to his concert here on the way home from the Cape. I paid $30 to park directly across the street and it was worth every penny because we waited less than 10 minutes to exit lot and hop onto 95, which was just a few miles from venue. The venue seats around 12,000; we sat in section 230. Aside from a giant, annoying piece of equipment hanging from ceiling and blocking view of center of screen, we felt close to the stage. This size venue was great for an artist like Mayer. The concession areas were mobbed and lines frustratingly  blocked walking paths. I’ve never seen so much beer for sale in my life. The DD stands sold only coffee and hot chocolate. Concession food looked unappetizing. The fried dough stand sold a decent-tasting snack. Providence is a small, easily navigable city. I’d return to this venue despite the few minor annoyances. Close to Federal Hill for a good meal. ",
  "Service was slow. Limited selection since they had started closing procedures 2 hour before closing.",
  "It was with much anticipation that we went to see James Taylor and Bonnie Raitt in concert.  The venue proved to be a more intimate setting for a concert and both the graphics and audience participation were fantastic!  We would go back to see another concert!"
 ]
},{
 "name": "First Baptist Church in America",
 "address": "75 N Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/77/34/35/igreja-ao-fundo.jpg",
 "tags": [
  "walking",
  "history",
  "tour",
  "tour",
  "history",
  "walking",
  "history",
  "tour",
  "historic",
  "learn",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60946-d267892-Reviews-First_Baptist_Church_in_America-Providence_Rhode_Island.html",
 "source": "TripAdvisor",
 "reviews": [
  "Now here is some religious history for you!  Seeing the first baptist church in America. It is an outstanding building that is currently getting some cleaning so you see plenty of scaffolding on the outside. Located in a beautiful part of the city and within easy walking distance form several other sights. ",
  "I spent a Sunday morning attending church here and was in awe of the stunning architecture both inside and outside.  There's no bright colors, no splashy murals or fancy stained glass windows, just simple walls and pews inside boxes as they used to do many years ago.  The congregation was a bit on the small side but I was impressed with the ethnic diversity.  It's been said that Sunday morning is the most segregated hour of the week in the US, but that's not the case here.  I was also impressed by the emphasis the church puts on helping others and living their faith.  But I was a bit surprised to find out the current pastor is a woman.  While not uncommon in other Protestant faiths, I've found that Baptists seem to lag behind in putting women in the pulpit.  I did, however, thoroughly enjoy her sermon.  Afterwards, I didn't stay for the tour but went downstairs with the others for lemonade and cookies.  Everyone was very warm and welcoming.",
  "There are many \" First\", churches in Providence! If you do know the history of the founding of this State, know that it began with religious freedom!\n\nThis building is a part of the skyline, at night, it's aglow, and, the luminescence remains a symbol of the promise of true freedom!\nTake the tour or see it on a Sunday, either way, worth the visit!",
  "I was really excited about visiting the first Baptist Church in America, however, was very disappointed that it was closed during my visit and there were no signs of when it would open.  ",
  "A beautiful church with tons of history as well. It’s close to many other sites and within walking distance of bars, restaurants etc. ",
  "It seems that every decent-sized town in the United States has a First Baptist Chuch, but THIS is The original FIRST Baptist Church in America!  Got that?  Good!",
  "I gave it a very good because it’s still a great historic building but right now it’s covered in scaffolding. 2.00 a person gets you a tour which is still very interesting. Learn all about Roger Williams and the need for religious liberty. Neat place.",
  "Now here is some religious history for you!  Seeing the first baptist church in America. It is an outstanding building that is currently getting some cleaning so you see plenty of scaffolding on the outside. Located in a beautiful part of the city and within easy walking distance form several other sights. "
 ]
}]
