[
{
 "name": "North Carolina Museum of Natural Sciences",
 "address": "11 W Jones St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/95/28/11/the-north-carolina-museum.jpg",
 "tags": [
  "walking",
  "food",
  "knowledgeable",
  "field",
  "kids",
  "unique",
  "history",
  "free",
  "theatre",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d103570-Reviews-North_Carolina_Museum_of_Natural_Sciences-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent multiple rainy Sundays here, we love this museum so many different sections, they have a butterfly exhibit,a sloth exhibit, dinosaurs, fossils,Arthropods and many other things highly recommend this museum the best in the state ",
  "Plan to go again.  We took 2 grandchildren there and they were amazed for 2 hours.  We only go to two floors.  Arco exhibit was terrrific.  (One negative is the display gets afternoon sun and is almost blanked out.)  Fish bones hanging from the ceiling - oh my.  Live demonstrations by knowledgeable docents - how many questions can an 8 and 10 yo have?????   Sat in the cafe right up next to the butterfly room - - fantastic half hour!  (Food only so-so.)  \nTerrific tanks and displays about NC fish and birds.  Children delighted by displays that showed ecology although some tech dependent were not working so well.  Flip up cards were neat attraction - simple non technology dependent displays that taught well.  \nLike I said, plan to go again and wear better walking shoes.\n",
  "Visited this museum on my daughter's field trip and had an amazing time!  We only spent two hours here, but could have easily stayed for a full weekend.  Four floors of exhibits, including many live animals (they claim more than the NC Zoo!)  \n\nThey also have a wonderful (kind of hidden) discovery center where kids of all ages are engaged by the friendly staff.  Lots of hands-on activities in this room to keep everyone's attention.",
  "I visit this museum because I love dinosaurs. The museum provide unique specimen which can not be found elsewhere.",
  "I took my daughter here when she was in elementary school. We went to the science lab and actually did a DNA test! I am sure you can't have a better experience at a museum. History museum is down a block or two",
  "It was a beautiful day in Raleigh and we extended our time downtown to see a few more sights. The museum was well designed, featured so many different exhibits, and was free! The Science of Star Wars was a fun show in the Daily Planet Theatre.",
  "\nmy teenage grand kids were amazed by all there was to do here. We spent several hours here and loved every minute of it. There was so many interesting exhibits andan awesome gift shop here. Its a must see!!!!!",
  "super displays and special events. not to be missed. all ages will have a wonderful time there. My favorite: Bug Fest!"
 ]
},{
 "name": "North Carolina Museum of Art",
 "address": "2110 Blue Ridge Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/b1/e3/a4/filename-rodin-garden.jpg",
 "tags": [
  "art",
  "free",
  "art",
  "unique",
  "free",
  "art",
  "music",
  "walk",
  "tour",
  "art",
  "food",
  "art",
  "art",
  "walk",
  "free",
  "art",
  "music",
  "free",
  "creative",
  "art",
  "free",
  "walk",
  "knowledgeable",
  "art",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d137058-Reviews-North_Carolina_Museum_of_Art-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Admission to the museum of art is free, and we went to see the Audubon exhibit in the east building, expecting to see a number of his prints hanging from the walls. Instead, we got to see 4 original bound volumes of his work. Each one was opened and turned to a beautiful plate this is not only an artistic work, but a most important historical series of paintings. The African exhibit was very nice as well. The west building  has galleries of great art from Egyptian times and Rome, and the great masters of Europe. The Catholic religious art was stunning in both its beauty and in its not-so-subtle message of religious salvation. This complex is a world-class art museum.",
  "Visit to the museum is easy, but for the special exhibitions, reservations recommended before you go.   Small directional signs direct you to the beautiful buildings and grounds.  Free Parking area is very nice, and easy for handicap accessibility.   Staff is extremely helpful with assistance and information.\n\nTickets can be purchased on-line for special exhibition -- you can carry them on your phone electronically, making it just a swipe when you enter the building.  The staff is amazingly helpful even when opening doors and providing directions as well as art commentary.  \n\nWe went to The Beyond: Georgia O'Keefe and Contemporary Art.   Surprisingly broader in scope of contemporary art than I expected, I was a little disappointed the O'Keefe works were brief, but I found the artists works that were inspired by her quite expansive and informative.  It was curiously fun to experience the variety of works inspired by O'Keefe.  Fortunately, photography is permitted (without flash) so we are able to follow up on our interests.\nThe professional displays and explanations of the works of others, with O'Keefe quotes printed along the walls gave insight into Georgia's personal and artistic life, so the exhibit made up for the lack of the number of her personal works shown.\n\nThis is not my first visit to the NCMA -- it is always delightful to enjoy the permanent collections in Galleries of the main museum area -- American, Italian and Dutch paintings as well as the Rodin statues.  (I cannot wait to go back in the summer for the outdoor Rodin patio and to check outdoor performances).\n\nWe make it a point to go hungry – the Iris restaurant inside the main Museum building is a delightful Dining Room with casual atmosphere for brunch or lunch  -- Reservations would have been helpful, although, the hostess took our phone number and paged us within a half hour for seating.   The menu is extraordinary and reasonably priced for the unique cuisine.  We had quail on a salad on our previous summer visit, so decided to enjoy duck on Risotto and    The salmon always tempts me, but this time I selected the BBQ sandwich with fennel slaw, a superb choice.  While I tentatively resisted the sweet potato fries, the greens I ordered lightly tossed with a mustardy vinagrette was a perfect savory companion.  \nThe cappaccino is a perfect finish for me (as I cannot resist the wonderful fragrance of freshly brewed coffee) but my table couldn’t resist the salivating dessert menu – mostly the upside down walnut cake (huge wonderful walnuts were the crust!)",
  "I have visited the NC Museum of Art repeatedly over the last quarter century or more.  While the permanent collection grows and is worth visiting (including a wide range of art styles and eras and including some outstanding silver items in the Judaic collection), in recent years I have most often gone to view an exhibit put together by the curators at the museum – Rodin, Rembrandt, and today both Renaissance Paintings from Venice as well as Masterworks of Ansel Adams selected by the artist himself.  These curators definitely earn their pay!  These special exhibits usually require a fee in the neighborhood of $15 to $20.  And typically they are sold at specified hours to limit the crowd in the galleries.  But unless it’s the first or last week of the exhibit or a weekend, there is a good chance to walk in and purchase tickets on site.  \n\nThe museum has grown over the years and now includes two buildings.  I personally find design of the newest (industrial modern?) to be underwhelming, but that’s just me.  The surrounding grounds now include outdoor sculptures, trails, and places to just sit in the grass.  I observed picnicking today.  The museum’s educational mission includes regular classes (often associated with the current exhibits) as well as outdoor music and film events during the summer.  \n\nExhibit space is usually ample and comfortable.  Lighting is always an issue for artworks, but I can usually find a spot where the light is just right because the rooms are seldom overcrowded.  And I can usually get within inches of the artworks without reprimands from the guards.  I do have a complaint from today’s visit and I hope the museum staff monitors these reviews.  I usually do not join a guided tour in an art exhibit and try to respect those who do.  And if there is only one I can usually work around it.  Today there was one small group that always seemed to be either around the work I wanted to see or hovering over my shoulder until I moved.  Tour groups tend to surround a work of art to the point that others are excluded.  I can usually work around that.  Today there were three such groups as I worked through the exhibit.  All were small (about10), but some of the leaders were annoyingly loud.  I found them so distracting that I began to wish that if the museum is charging me a fee, then I would like to know that I’m not going to be bothered by tours.  I feel a bit petty about this complaint; I have worked around it in many museums and often will hover to pick up tidbits from the guide.  But multiple tour groups in a short time just got to be annoying today.  Fortunately, they moved on and I got my chance at the art works.  Two splendid exhibits for one modest price!",
  "I've been a member of NCMA for 30 yrs.  I also worked in events/catering  there at the museum for 6 yrs.   It is a beautiful museum with impressive collections of art!   The outdoor park and grounds are lovely.  In the warm weather when the water lilies are blooming in the Rodan garden is one of my favorites.    NCMA is a great place to have a wedding or special event too if you are considering venues.    Don't miss the restaurant--the food is excellent.....and The Big Oak for Sunday Brunch is a must have!   Movies on the Lawn in the summer and the outdoor concert series are always a blast!",
  "We enjoyed 2 hrs at this impressive art collection.  More accustomed to the museums in Boston and New York, we weren’t sure what to expect.  But the NCMA is an entirely satisfying experience with many important pieces.  Don’t be put off by the stark building exterior, as the display spaces within are modern but attractive.  We had a great time.  And don’t miss their terrific cafe for lunch! 👍",
  "We really enjoyed the museum - the regular exhibits, the special exhibit and the outdoor sculpture garden.  \n\nFor us, being from Los Angeles, the outdoor sculpture garden is a fantastic thing.  Wide open spaces and trees that are a lovely walk even without all the cool sculpture. Our daughter and son-in-law walk their dog there, they have free movie nights, etc. A wonderful outdoor public space.\n\nThe regular exhibits are spacious and pleasant to walk through, gives you time and space to enjoy them. They have exhibits from ancient to modern, good overall selection of art and artists.\n\nThe special exhibit of \"Light Color Sound\" was very interesting to people of all ages. We enjoyed it very much. Note: as the population of Raleigh grows and more people come to these special exhibits, they may need to do what they do in bigger cities...require people to reserve a time. People were standing in line for nearly an hour to see the Light of Life exhibit.",
  "is The NCMA has developed from a small unimpressive museum a few decades ago to a first-class art museum with a great permanent collection  and fabulous special exhibits.  A recent example iis the Frida Kahlo/Diego Rivera exhibit earlier this year.  The growth of the museum to add more permanent collections and an outdoor music pavillion for concerts, and the large outdoor walking/hiking areas all add to the attraction of this great museum.",
  "They have a very nice collection of Rodin sculptures in open well lighted area.  We were also impressed with their Egyptian display.   They have a very nice gift shop with creative items for sale.   Admission is FREE.",
  "For several years Laura Boyes has selected and introduced movies shown seasonally in the Museum’s Lecture Hall. She is moviediva.com.  These movies are usually shown on a weekly basis in the Fall/Winter and early Spring. Formerly they were seen on Friday nights, however, now they are shown on Sunday afternoons at 2pm. Her selections are mostly not mainstream and often older movies, but well done. Check the online NCMA site for upcoming films - you may be surprised and delighted!",
  "The NCMA is a wonderful museum.  Not just saying that out of home grown pride, that its also an opinion offered by knowledgeable art lovers from across the country.  The collection is somewhat small but this allows a visitor to take it in without be overwhelmed.  Special touring exhibits are displayed in a second building, with an admission charge, while the main building is free.  If time and weather permit, allow yourself a half hour or so to walk the grounds, which display a wide array of sculpture.",
  "We attended with teen children and thoroughly enjoyed the gorgeous temperatures for February. The art inside was a beautiful atmosphere but I recommend taking a hike to observe the outdoor art. There are maps and trails with distances available. It’s a great place to let kiddos of all ages run and play, don’t forget the dogs are welcome too!"
 ]
},{
 "name": "Pullen Park",
 "address": "408 Ashe Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/14/1d/5b/pullen-park.jpg",
 "tags": [
  "eat",
  "walk",
  "historic",
  "theatre",
  "kids",
  "free",
  "cheap",
  "historic",
  "kids",
  "walking",
  "affordable",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d277317-Reviews-Pullen_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Ride the small train, authentic merry-go-round, paddle boats, enjoy the park swings, picnic shelters, walk around the lake, eat ice cream, lot of fun activities here.",
  "Lots to do here! They have a historic carousel, a small train for the kids, indoor and outdoor pools, pond with paddle boats, a large playground for the children and very large grounds are with huge old oak trees. They even have a theatre! Beautiful!",
  "This place is our local Disney world, a gem of a place for our preschoolers\n \nGreat train ride, scenic, esp when trees and flowers in bloom, well kept park and well maintained train, carousel, etc. Highly recommend and worth the drive. $1pp rides are wonderfully priced.",
  "What a fantastic place! If you have young children and you’re looking for something cheap or free, this is a great place! There is a historic carousel, a fun miniature train and great playgrounds for all ages. There are beautiful Bridges, a nice little lake with paddleboats, and some picnic structures. The sprawling park is one of the oldest in the country and one of our popular places in the city. When we went it was cold but still lots of things to see. The people who run the rides are very friendly and they are very cheap. Each ride is one ticket per person $1.50 per person. This is also a popular place for portrait photography.\nThere is a café that people recommended but I did not try it. I was in town with my kids for a different event and decided to take them there to get them to burn off some steam before a long drive home.\nI highly recommend this place!",
  "Great place for families. Has pedal boats, train, playground and carousel. Dogs leashes are allowed too. ",
  "A very spacious, well kept park that has lots to do for all ages.  We went on a holiday so the park was closed, but still had a great time walking around and playing the playground.\nWe will come back when the rides are open and spend more time.  Plenty of parking and a great place for families.",
  "Great place to visit with a toddler! Our 2 year old loved the train and carousel, as well as the playground areas. Rides are super affordable and park is well kept and  dry clean!",
  "We came here as a funday with the family and we really liked the train ride and the carousal ride.It was very fun although the only downside is parking is very limited so better come early!"
 ]
},{
 "name": "Marbles Kids Museum",
 "address": "201 E Hargett St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/69/fc/38/marbles-kids-museum.jpg",
 "tags": [
  "cheap",
  "kids",
  "art",
  "family",
  "learn",
  "kids",
  "art",
  "music",
  "kids",
  "family",
  "affordable",
  "food",
  "kids",
  "kids",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d149465-Reviews-Marbles_Kids_Museum-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Definitively worth it! It is wonderful for younger kids (up to 7y.o.), however, the upper levels have some interesting areas that can be fun for all ages. They have lots of hands-on activities and colors. many activities are educational and fun. It is super cheap! I paid $45 for 3 adults and 3 kids. They also have one area of carpentry that was quite interesting! My son made something with a piece of wood and he was allowed to take it home (the highlight of the day!). The museum has lots of engaging activities in 4 levels, so you can choose what to do. The outside area is also very relaxing if part of the group needs a break. ",
  "Omgosh i can't say enough about Marbles Museum. We had no idea what it was and had won tickets in an auction for a local school. We had a blast here. We travel as a family with my 2 kids, husband, and brother in law and we all really enjoyed this place. There was SO much to do. There's a huge baby play room, the most amazing dress up area for the little kids, pirate ship, water play station, submarine, and oversized games in the bottom level. Upstairs was a teacher and parents dream I would love to have this near where we live. They had an art area, a sewing area, sports zone, lego area, woodworking area and the kids get to learn hands on. It was amazing. I love that they have many place to have smaller kids something to do for their age near stuff for the bigger kids. My husband played with the baby in building blocks while I took my son to woodworking and built using scraps of wood. They had many place to change and feed babies placed around both floors. I would highly recommend this place. It is definitely a perfect family trip especially if you're looking for something to do indoors. My son still talks about it and wants to go back this year. ",
  "This is the best play Museum that I have ever been to, and we have been to quite a few. You cannot beat it and it is very reasonably priced. In fact we loved it so much that we went back the very next day. There is just so much to entertain the kids and get their creativity flowing, from the pet vet center, tv station, ambulance, pirate ship... to the art area, little hockey rink, basketball hoops, other aports type activities, the multiple outdoor areas including water, music and the children's garden, piano steps, multiple engineering and stem areas and activities throughout the museum- it's endless! If we lived in the area, we would honestly be there at least once a week. Plan on spending at least two hours but you can easily stay there for much longer.",
  "It has many activities for children. Spaces related to traffic, transportation, under the sea, city, craft",
  "Marbles is a great place to take children ages 3 to 10 yrs old.Perfect place to spend those rainy days. They have wonderful learning stations for every age group.\nDon't miss out on the spooky Halloween costume party.The Christmas party is magical for the whole family.  Great place for grandparents to take their grandchildren.  Be sure to look into the family pass....great deal.",
  "We love Marbles! Super affordable and a great place for frazzled moms to go park it and let toddlers run wild for a bit. Everything is educational while being super fun to play with. There is something for every age group and every personality. We love the money exhibit with the balls and the piggy bank that drops them on you, we loved around town - great enclose area for younger kids with awesome train table, dress up, tons of play areas. The newer electricity exhibit is fun. Parking is super easy in the garage across the street. I have absolutely nothing bad to say about Marbles. The Pogo cafe by the IMAX is great food with lots of healthy kid options. Better than Durham's Life and Science museum IMHO and lots cheaper too. Get a membership. It's a no-brainer.",
  "Luckily ended up staying overnight in Raleigh on the first Friday of January 2020, since there is a ‘first Friday’ special in which the museum is open until 7pm and only costs $3 per person after 3pm. My 8 year old son had a blast, we were here for 1.5 hours and only left when it closed! I’d say this is about the upper age limit that kids might enjoy this place, as it seems more targeted to toddlers and preschoolers, but there were still lots of fun things for him to interact with. ",
  "We loved our morning at Marbles. Lots to do for toddlers, but it was SUPER crowded, even right after opening at 9am. We especially loved the art area upstairs, as well as the basketball court! Will definitely visit on future trips to the area."
 ]
},{
 "name": "North Carolina Museum of History",
 "address": "5 E Edenton St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/fd/9e/eb/museum-complex-downtown.jpg",
 "tags": [
  "tour",
  "history",
  "history",
  "tour",
  "walking",
  "food",
  "history",
  "kids",
  "free",
  "family",
  "history",
  "history",
  "history",
  "field",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d144856-Reviews-North_Carolina_Museum_of_History-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "The sheer breadth of the displays is awe inspiring. If you are trying to soak in all the information that are on display - I believe one day is not enough. But a quick tour is also possible to move in a out of the rooms of exhibits. Breadth wise the museum covers from the weapons and artifacts from the American CIVIL war, to WWI to WWII to Spanish American war to the inventions of industrial revolution, to the early American Indian lifestyles, to invention of Aircraft, to history of such popular American sports as Football and basketball. I also came to know the fascinating story of Carbine Williams - one of the most prolific inventors of superior guns.",
  "Full of interactive exhibits, presentation of NC history from the original Indian population, early European settlement, civil war, reconstruction and Jim Crow, and economic/agricultural background.  A real learning experience without the work!",
  "Most of the first floor is taken up with a walking tour through the history of North Carolina from the Native Americans through the Scots-Irish pioneers, the Revolutionary War, the Civil War and the Wright Brothers.  A very nice mix of hands-on touchable activities, videos, furnished rooms and written exposition.  The gift shop has an excellent selection of North Carolina made products--jewelry, food, soaps, etc-- and books. ",
  "I enjoyed the museum, some of the exhibits were not working, overcrowded with busses of school kids the day I went. We need this for our kids, so I support the funding of the museum. ",
  "This is easily one of the best museums I have ever visited. First, a great, clean building located across from the State Capitol building. The exhibits are interactive, huge, and are expertly laid out. Tons of interesting artifacts, and a room for everyone in your party. We went during the Women's Quilting exhibit, there was a sports exhibit, a toy exhibit, and the History of North Carolina exhibit (there were more, but we were short on time). The gift shop was also wonderful. You can grab a Cheerwine, and a souvenir to represent your favorite part of the museum. I am glad this was one of two things we were able to do in Raleigh.\n\nOur party consisted of an 82 year old, 50-60 y/o, 30 y/o, and 8-12 y/o (family group).  The museum is accessible, has open seating areas, restrooms on every floor. It was free the day we visited, but I didn't check in to whether or not it was free all the time. Anyway, great for the whole fam!",
  "My wife, son and I spent a few hours touring the museum. This museum is very well done. The have many interesting displays that tell the history of North Carolina. I highly recommend a visit to this museum.",
  "The museum exhibits follow a time line from prehistoric to modern history.  We were only able to cover half of it during our 4 hour visit.  Lots of interactive opportunities, places to sit and rest and excellent exhibits.  ",
  "Hadn't been there in a while, but went for an elementary school field trip and was AMAZED.  This might be old news to some, but the exhibits were great and there was plenty of them. NC history walk, toys, life size malt shop, sports hall, and local youth. I didn't get to slow down and read much with 4-8 yr ago olds, but I went back another time, to revisit.... Planning on going back again.  Thus was the best I have ever seen the museum, and I have lived in Raleigh over 20 years. I highly recommend."
 ]
},{
 "name": "Umstead State Park",
 "address": "8801 Glenwood Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/fb/38/cc/umstead-state-park.jpg",
 "tags": [
  "hike",
  "art",
  "walking",
  "nature",
  "nature",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d126594-Reviews-Umstead_State_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Although I have been to the Harrison entrance to Umstead, this was my first time going in the Glenwood entrance.\n\nIt's a little longer drive to get to the parking lot than at Harrison, but it is shady and beautiful along the roadway.\n\nWe walked down to Big Lake and then took the 2.8 mile Sal's Branch loop. Lots of elevation change and a nice, wide path. Not many other folks out on a Monday morning so it was pretty quiet, except when a jet was revving up for takeoff from RDU. You really don't hear that on the trails on the Harrison side.\n\nRegardless, this is a nice place to take a break from the summer heat!",
  "Twice in the past 6 months, I have visited the Raleigh-Durham area for youth sports activities, and on both occasions, I had the pleasure of running in Umstead Park.  What an incredible resource!!! On the first occasion, I entered through Crabtree Creek and rounded the Sal's Branch loop three times to create a longer run.  Even though I started by 10 a.m., the July heat and humidity were daunting.  That said, the trail was well-shaded, relatively cool and a fantastic surface.  On the next visit on an early December morning, I used the Reedy Creek entrance and ran the Company Trail, which was also very well-marked and maintained, varied in terms of terrain and offering great scenery and surfaces.  Full of walkers, runners, people with their dogs, mountain bikers, collegiate running teams, Umstead is clearly well-loved and used by many.  As a visiting runner, you cannot go wrong here.  Even though I was new to the park, I easily found parking, restrooms, trail maps and drinking fountains.  I highly recommend making a detour to run the trails here; it will be one of your best memories of your stay!",
  "Went hiking in the park and didn't want to leave! Well marked trails, pleasant hikes though the forest and very pet-friendly. almost everyone, including us, had one or more dogs.",
  "We've biked and hiked the trails at Umstead and they are all well maintained, scenic, and fun.  Weekends can be crowded, but during the week, the trails are wide open.  Some of the bike trails can be steep. Hiking trails are mostly flat, but lots of tree roots, rocks, and a few critters keep it interesting.  So glad this land was preserved for future generations.  Take a hike, you won't regret it.  Better yet, at Umstead, you won't get lost and there are trails and bike rides for all levels of expertise. Fun!",
  "This park if made for runners, bikers, and hikers.  I was able to do a nice long 10K run each morning of the week and do trail running, run by the lakes and rivers as well as on pine needle covered trails, rocky roads, or dirt trails.  Some trails are hilly so check out a map for beginner and intermediate trails. Worth a try if you want a nice run while in Cary, North Carolina",
  "This park is great, with everything from ponds to trails.  The trails range from short and easy to long and strenuous.  Can get really busy on weekends when the weather is nice. I like to swing by in the afternoon on weekdays, you will have the place to yourself.  I def must see and visit park in Raleigh though!",
  "About the only negative is the lack of parking when there is a nice day.  Over the years as the \"home-owners\" began to build up around this State Park and begin their \"not in my backyard\" cult, the pressure on parking mounted along with the abuse of the park's users.  \n\nThe trails are excellent for running, cycling, and just walking.  Try parking at the Art Museum and cycling or running up the Reedy Creek approach.  That is my favorite.",
  "Even after the annexation of more and more by tremendous Raleigh growth, this place still is excellent for hiking and nature walks. Great place to take teen Sunday School Classes for the day.",
  "Super park - on route to RDU. We stopped on the way to the airport and had a nice sunny March morning. Wish we had longer....",
  "This park supports many hiking groups and families looking to get out into nature. The trails are beautiful. You truly feel as if you are away from everything. We love this place.",
  "The park is a safe and a clean place for hiking for both adults and kids.  It has a camp ground, nice trails, and areas for a picnic."
 ]
},{
 "name": "Historic Yates Mill County Park",
 "address": "4620 Lake Wheeler Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/5b/92/e7/half-hour-guided-tours.jpg",
 "tags": [
  "walk",
  "tour",
  "learn",
  "history",
  "free",
  "learn",
  "kids",
  "walk",
  "history",
  "nature",
  "walking",
  "walk",
  "tour",
  "wander",
  "free",
  "tour",
  "walking",
  "walk",
  "history",
  "walking",
  "learn",
  "field",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d2253923-Reviews-Historic_Yates_Mill_County_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "A lovely setting - trees, lake, old mill, and a great museum with lots of wonderful information.  Very kid friendly as well, with hands-on things to do.  I felt like we learned a lot about the area and the people who used to live there.\n     After the museum, we walked down a trail to the old mill.  It wasn't open when we were there - I think there are specific hours for that -- but it was a nice walk anyway.  I will warn that there are a lot of snakes in the stream on the other side of the mill.  I think they are water snakes and should not present a danger (there are signs about them), but just keep an eye out.  One of our group is deathly afraid of snakes, but she made out and was still able to enjoy the outing.",
  "Yates Mill is a great place to visit to learn some of the history of the area. There is a museum where you can learn about the mill and they also offer tours on selected days. I've done three tours now and love watching the water wheel so much I will likely do more of them. \n\nThe museum has more in depth exhibits since I was there before. There are videos that show the mill at work and a diagram where the equipment is located in the mill. \n\nI took the Heritage Tour and it was $5 and you get the background history; see the water wheel operating; and get to see the first level of the mill. Volunteers lead the tours and you will learn a lot.",
  "Right now I noticed they are only doing actual tours guided tours on Saturdays. So call before you go.\n\nWe went on a weekday and more able to walk freely around the property but not into the buildings. The scenery is absolutely stunning and knowing that it was built around 1750 is absolutely amazing. \nIf you going to the welcome center you will learn many different facts about the mill and it has a great hands-on learning resource for the kids. \nA great way to spend the afternoon. I learned that the original mill was destroyed and rebuilt in the 1800s. It’s called yates mill because that was the owner most recently that owned it for the longest period of time. It is still a producing mill to this day and you can see the demonstration on Saturdays. You can buy a bag of 2 pound cornmeal, white or yellow for five dollars. Made authentically on the grounds. Parking is free,\n\nIf you found this helpful, please click the helpful but in below, I really appreciate it!\n\n",
  "Yates Mill is the only working water-powered mill in Yates County, NC.  Walking around the grounds, one can just imagine what it was like to live in the area back in 1750 when the mill opened operation.  The lake and grounds are wonderful and beckons a walk in nature.  If you are going to visit, check out their webpage to see when they are going to offer tours of the mill.  If you’re into history, this is a must see while visiting Raleigh, NC.",
  "Loved the hide around the gardens and the tour of the Mill and of the Information Center.  Was nice weather so could enjoy the outdoor weather and got great pictures of the lake and the Mill.",
  "We arrived mid afternoon and missed the 2pm tour.  The visitor center however has an extensive amount of information regarding the mill with a couple of short videos also.  very interesting how over 200 years ago someone put together a series of gears and belts driven by water power to grind grains into meal.  it is free to wander the grounds and walk the trails.  there are 3 or 4 trail options and they are all well marked and easy walking as long as there have been no recent rains.  there is a small fee for an actual tour of the mill.  this was well worth stopping in and investigating",
  "I have lived in the area for over 30 years and just made my way to Yates Mill -- I drive by it every day.  I spent an lovely afternoon walking around the pond, visiting the park house to learn about the history and then visiting the mill.  Such a beautiful setting.  Some of the trail at the mill is a little steep and some is rocky so just be aware.  A new place to take a lovely stroll.",
  "Lovely afternoon walk, fairly flat on groomed trails, nice reflections on lake...Mill was established before the American Revolution....Nice learning space for field trips with exhibits and outdoor classrooms."
 ]
},{
 "name": "JC Raulston Arboretum at NC State University",
 "address": "4415 Beryl Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/4b/78/dc/in-the-middle-of-winter.jpg",
 "tags": [
  "walk",
  "unique",
  "free",
  "free",
  "knowledgeable",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d126597-Reviews-JC_Raulston_Arboretum_at_NC_State_University-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I took a quick walk through this facility and really enjoyed our time there!  Trees and plants are well-marked, and there are a variety of gardens.  The Rose Garden was my favorite!  More plants were blooming and this facility was much larger than I expected.",
  "This is a unique and ever changing landscape of the infinite variety of plant life on the planet.  Curators of the gardens are passionate about ensuring that each plant is correctly labeled, easily grown in this biome, and accessible.  Public tours are offered each Sunday, the gardens are open year round and there is no admission charge.",
  "We became acquainted with the Arboretum through Almanac Gardener, a public television program from UNC-TV. It's a great free attraction for anyone with an interest in gardening and/or lovely gardens from North Carolina State University. Open everyday at 8, we recommend you visit in May or early June early in the day before it gets too hot or crowded. Do you know that they actually have a Sequoia growing here? You'll also find Xerox and Scree gardens as well as conifers, a Japanese garden and all the perennial borders you can imagine. The lesson here, apparently, is that you can grow most anything in North Carolina if you put the right plant in the right place. There are over 6,000 plants here. So find the rose, redbud, monocots or geophyte you didn't think you'd see all in this amazing Arboretum.",
  "February - Saturday in Raleigh - not sure what to do - love the outdoors.. Just walked and submerged in the beautiful surroundings although most were brownish and battered by the cold weather. Definitely a place to go when you're in Raleigh. I am visualizing how charming this place will be come spring time! Guess I'll have to return to find out!",
  "A must see if you like gardens. My wife and I spent the weekend in Raleigh and this was a highlight. They offered free tours with a knowledgeable guide. We spent nearly two hours in total and it was a wonderful afternoon. Lots of variety, lots to see in a relatively small, but well laid out space. ",
  "A useful outdoor adventure as we experienced some early blooming trees.  Nice Japanese garden.  Very kid-friendly.",
  "Lovely place to walk in any season. It’s small enough to cover most of it is about an hour. Benches located in pretty settings (e.g. rose garden!)",
  "This place is amazing! Enough space for everyone not on top of each other even with lots of people exploring around. Nice place to sit and have a picnic, read a book, meditate. The flowers and sculptures are lovely. I cant wait for spring to go back when the flowers are in bloom!"
 ]
},{
 "name": "State Farmers Market",
 "address": "1201 Agriculture St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/f0/b8/5e/giant-hibiscus-nc-state.jpg",
 "tags": [
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d149466-Reviews-State_Farmers_Market-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great variety great quality and friendly service\nYou can beat the market\nA most stop in raleigh\nOne of the buildings everything sold in it must be grown in North Carolina insuring fresh produce",
  "Farm to table is the current chic restaurateur catchphrase......well dodge the high-priced trendies and bring fresh goodness to your own kitchen. Especially if you visit on weekday mornings, you are sure to bump elbows with some great local chefs, competing for the same greens and fruits and tubers and legumes that you can select from a host of NC farmers (always 3 dozen and more stands available).  Be mindful of the season and your geography as you won't ever find local pineapples or locate fresh strawberries in October.  But there is so much more to peruse - dozens of flower, herb and shrub sellers.  A fully enclosed building where you can snag cheeses and candies and locally preserved jellies and sauces and farm-fresh meats and NC coastal seafood and baked goods and wines and ciders and honeys and home decor treasures and soaps and garden decorations and crafts on and on and on.  If you are like me, you will spend more money and a longer stretch of time taking in all that is on offer - and grab a bite at the seafood restaurant (yummy) or Farmer's Market restaurant before you leave. Central NC residents are incredibly lucky to have such a gem so easily accessed in southern Raleigh. Top notch!",
  "We recently took guests who were from Iowa, Illinois and Georgia, all agricultural states themselves, to shop at the Farmer's Market for sweet corn, tomatoes, peaches and other produce in season in July.  Those of us who live fairly close can take this wonderful market for granted but our guests were very impressed.  There is such a range of produce in season and in the summer this is the best spot to find tomatoes, melons, peaches, berries, eggplants and there is quite an array of varieties of fruits and vegetables.  In addition you can get fresh flowers, flowering trees, plants and herbs, baked goods, NC seafood, NC pork products and sample them at the NC Seafood restaurant or the Farmer's Market restaurant.  Area cooks go here to start their farm-to-fork adventures.  Our Iowa guest thought the sweet corn was perfection; our Georgia guest said the peaches were better than she could find at home this summer.",
  "Great variety of seasonal, locally grown produce as well as garden & landscape plants, interior/ exterior home decor, restaurant, sweet treats like fudge & ice cream, novelties and more.  Parking is very rarely an issue and access is right off the beltline.  Open seven days a week which is very convenient.  If you know what you want, you can be in and out in no time, but if you want to browse, give yourself a few hours to take it all in.  Oh yes, it's all weather protected so you can go rain or shine.",
  "I recently went to the farmers market for the first time with a few friends who were visiting. We went towards the end of the day and a lot of vendors were either packing up and leaving or already gone, even though there were still 3 hours left. The vendors that were there had a ton of great produce and other products. The complex is huge so make sure you give yourself lots of time to explore. We are planning on going back in the summer in hopes that there are more vendors, more produce, and warmer weather since it is mostly outdoors.",
  "One of my favorite things to do is go to farmers market and select fresh local produce and baked goods.  This one was superior!  So many selections plus an I closed building where you can get local. Cheeses and jams, jellies and sauces. On Saturdays there is also a flea market at the fairgrounds. Full fun day!",
  "Ended up buying the candied pecans & loads of kettle corn of interesting flavors, old bay, sriracha? Okay they're good. Also some purple-colored green mustard & kale. However, not impressed when charged $4.50 for this tiny pack of candied pecans. Sorry but the $5 German pretzel was not edible. Otherwise nice place to check out.",
  "We drove out of our way to go here on a Friday morning knowing that its february and it would not be like the peak of summer.  However, when we arrived, the only vendor open was selling firewood.  In the next building over, there was a vendor in a shop that looked like it might be a trinket shop that was open as well.  There were many cars that drove up and turned around in just the few minutes we were on site, so it was not just us hoping to visit the market this day.  We came from out of town and had been looking forward to going here for weeks. ",
  "Our visit was somewhat disappointing because of the time of year we visited.  There were a very limited number of farmers and vendors and most of the vendors were closed on a Wednesday.  The world market was also closed..and we really would have enjoyed going in there!  I give an Excellent rating because youc an tell from what little we did see during other times of the year it would be a great place to go to.  Great prices on fresh produce and the quality was excellent.  Friendly staff in all the booths we did walk through.",
  "in season  fresh foods , stores with the spices and flavorings you ever want, meat and cheese,  old fashioned candy and soft drinks.  great seafood restaurant  and other restaurant with breakfast and county cooking",
  "We went thinking we would find something for lunch and pick up a few snacks for our return trip home.   We enjoyed taking with the farmers, about how they raised their goods, and purchased far more than expected.   We got fresh eggs, carrots, kale, apple cider, jam and bread baked that morning.   We were pleasantly surprised by how much we enjoyed the market.  "
 ]
},{
 "name": "Neuse River Trail",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/7c/f3/62/skycrest-bridge-on-the.jpg",
 "tags": [
  "food",
  "walking",
  "walking",
  "walk",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d4371266-Reviews-Neuse_River_Trail-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "I want to recommend The Bike Guy shop which is located by the Neuse River Trail. Rob Atkinson, the owner, was very nice & helpful. We rented bikes for half day. The trail is beautiful and easy to ride. We just loved it. Bring food and bathing suit and you can easily spend a full day biking.",
  "I live near this trail and it is a great place to stroll, run, jog, bike, skate or rollerblade. It is extensive in length with many areas to get on and off the trail. There is convenient parking for those who don't live in the neighborhoods. It is peaceful and calming.\n",
  "The Neuse River Trail is a well-maintained, paved trail that crosses back and forth along the Neuse RIver.  There are plenty of options for public parking and easy access, but no restroom facilities along the way.  Wonderful for walking, running and cycling!",
  "This trail is amazing spanning Wake County all the way to Johnston. Starts at Falls Dam and goes farther than I’ve yet to discover. Was able to train for many distance races of the half and full marathon variety. Course does not overwhelm with hills which is impressive considering the area. Plenty of access points in neighborhoods and running beside river is pretty cool experience. Only issue I have encountered is low spots can get a little wet and during cold months that means ice. ",
  "Nice parking at the top of the park off 401. Quiet and a great walk right beside the Neuse River. Great for runner, bikes, dog walkers and walking paths. ",
  "Great trail for running/biking. Beautiful scenery and many access points. Well maintained. Can be crowded at times.",
  "We walked the main trail back to the the dam and explored around that area. It was absolutely beautiful and we can't wait to go back!",
  "Not a great trail walk, better for cycling if you want to get deeper into the trails. Was expecting to see the falls within walking distance"
 ]
},{
 "name": "PNC Arena",
 "address": "1400 Edwards Mill Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/d3/68/cc/1450763045158-largejpg.jpg",
 "tags": [
  "food",
  "walk",
  "food",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d616449-Reviews-PNC_Arena-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Five of us attended a Carolina Hurricans game at PNC arena. We had great seats.  Parking is always a problem if you park right at the arena as it is difficult to exit after the game.  We always park a a nearby office complex and walk to the arena.  At the arean there are plenty of food vendors offering a great variety of food and drinks.",
  "This is Raleigh's premiere entertainment arena. They have everything from sporting events, concerts, circus, conventions, etc..I've been there many times and have never been stuck in traffic when leaving an event. Obviously when that many people are leaving all at once there's going to be some bit of waiting in line to exit, but the traffic always flows easily; there are so many different exits and the parking lot attendants are good at what they do that I've never had a problem. Dropping off and picking up people is also a breeze. There is a special area right next to the building especially for that. Inside the arena is also laid out nicely. Never any problems with seating, getting food etc... Security is tight so be prepared to have your personal belongings checked!! That's always a good thing to make everyone feel safe. \nhttp://www.thepncarena.com/",
  "\nThe arena was great, parked close for $10, sound was good.  Don't need to pay to sit in the premium floor seats, the first tier of spectator seats are great. ",
  "We decided to stop by the arena on our road trip up north, and really liked the location, about 20 minutes from the city, and only 10 minutes from the airport. ",
  "Went there with family to see Sir Paul McCartney.  We had seats in the upper level  but the view of the stage was great.  Would go there again ",
  "Went here before the Covid stay at home order was put in place. The facility was extremely cleaned and the crowd to see Billie Eilish was easily handled. A clear bag policy was in place and there was plenty of notice before you even got to the stadium about it. Parking was $30 but we walked over from the Four Points by Sheraton within 7minutes. They sold food/drinks at the arena that looked pretty good but we ate before we came so didn't try that. ",
  "Went for a concert here last week.  Not impressed with this venue.  First they charge THIRTY DOLLARS for parking!!!!!\nMy hubby is 6 feet tall and was VERY uncomfortable in the small seats.  Not nearly enough leg room for someone his size or taller.\nNot sure what the engineers were thinking when they designed this place.  We will NEVER go back to this place for a concert.\nVery disappointed.....\n",
  "I nearly injured my testes on a recent trip to the PNC arena. The chairs are painfully small. I would be willing to pay double for a larger seat. I nearly threw up when my testes were forced together trying to fit into the seat. I was uncomfortable and had to sit at an angle. My testes hurt for days."
 ]
},{
 "name": "Frankie's Fun Park",
 "address": "11190 Fun Park Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/2d/da/20/frankie-s-fun-park.jpg",
 "tags": [
  "family",
  "food",
  "drink",
  "family",
  "eat",
  "kids",
  "walk",
  "kids",
  "eat",
  "family",
  "approachable",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d1581475-Reviews-Frankie_s_Fun_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was a fun place to go! Everyone was very nice, there are 2 18 hole putt putt courses,as well as a water park and batting cages as well as go carts and a driving range to boot! What a blast I had there with my wife.we place on revisiting this fun park again soon",
  "Frankie's Fun Park is a great place for the whole family. You could end up spending the whole day here and not realise it.\n\nThey have an 18-hole miniature golf course (you can select from 3 different paths) with cute little sea-themed decor. They have a huge laser tag arena, which was great fun! There are batting cages (you can set the difficulty level), go-karts, bumper boats, 3-D ride, a bunch of other activities and loads and loads of arcade games. They also have a really cool rope course called Sky Trail Ropes, which is 3 stories tall. You cross various obstacles and bridges of varying difficulty while being suspended. It is totally safe, yet thrilling and enjoyable. You also get a great view of the park. The place also has a restaurant that serves decent food. The nachos and ice drink were good.\n\nThere is ample parking. The prices are really reasonable. Do get your slots for laser tag, go-karts, miniature golf, and batting cages early, as it may get full. I would totally recommend this to anyone seeking a whole day of fun.",
  "We went here with family for dinner which their hamburgers were great and their cheese pizza was great too!  A little bit expensive but it was nice to eat there and walk to the other side and start playing games.  My kids loved the games!  It was a little sad that some of them were so expensive like 2.00 or more to play one game but we set a limit on the cards for our kids and let them loose.  There is more then just games there, there is lazer tag, a giant indoor spider web, a 3D video game, mini golf, rides outside, batting cage, go karts and a lot more!  After getting prizes for the kids we went outside and played mini golf on one of their 4 courses.  It was a blast!  This place is expensive but if you are looking for a place to go for a few hours while it is raining (which it did while we were there) it is the place to go!",
  "Visited Frankie's last night while in town for the NC state fair. While the kids were spending all my money in the arcade, hubby and I visited the Chilling Lounge. Our bartender was Stella, she was AWESOME!! She made great suggestions and even better drinks. We will be back to see her when we come back to town..",
  "In the area where we live there is nothing like Frankie's. We live in our local bubble most of the time and rarely go to that side of town. We've definitely missed something. Frankie's arcade area is impressive! Variety is the word. Outside there are amusement style rides and three eighteen hole mini-golf courses. We had plans for dinner so we didn't eat there but will another time. Frankie's works on a card system. You choose how much credit you want on a card to use the games and entertainment. I wish we had something that all ages can enjoy closer to where we live. But now that we've been to Frankie's, we are planning our next trip.",
  "Updated games. Multiple go kart tracks. Super nice mini golf course. Great place to go with family or friends. I'm 28 years old and had an absolute blast!",
  "This site was amazing, they have lots of arcade games. There are simulation games and use of VR in one game. Also they have go karts outside which was really cool. Most activities are suitable for all. Their bumper cars are so cool, never seen any like them before.",
  "Had a night out with my friends and enjoyed the variety of virtual games they had.There was fun for both adults and kids. Only thing I disliked was the customer service. Staff need to be more approachable and friendly. Other than that, loved it!"
 ]
},{
 "name": "Lake Johnson Park",
 "address": "4601 Avent Ferry Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/db/ef/5d/20160701-115126-largejpg.jpg",
 "tags": [
  "hike",
  "hike",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d277319-Reviews-Lake_Johnson_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This a great figure 8 loop, so you can do the paved lake side, the unpaved side, or both.  Bathroom facilites are available at the boat house, and you can rent paddle boats and canoes.  There are also picnic pavilions and grills available.  Dogs are welcome.  Just blocks from NC State's campus, so there are lots of joggers.  Fun place!  Note: parking is limited, and on the weekends it is a real problem...",
  "Lake Johnson has a great atmosphere with MANY things to do. You can rent boats, hike, or take a recreational class offered such as yoga or wildlife identification. The only limiting factor is parking - there is oftentimes a very long wait time. What good is it to offer such a nice facility if you cannot get to it?",
  "This is a great place to walk, bike, hike, fish, canoe, kayak...you get the idea. The paved trail is about 2 miles around. It is just beautiful. You can also go off the paved trails if you want. You can bring your dog (as long as it is leashed and you clean up after it) people can't swim here, but your dog can if they want to fetch sticks in the water. I liked how clean the park was. Great park. Will definitely be visiting here again the next time I am in Raleigh.",
  "On a reconnaissance mission as we are planning a birthday party for a timeframe in April. The folks at the Visitor Center were very helpful.We saw the area around the Visitor Center. The Lake offers many activities and boat rental starts in April. Parking lots in two places, however if the weather is nice parking could be a challenge. The pavillions we saw were nice. In fact after our visit we reserved pavillion # 4. The trails are paved  which will be a benefit to some of the guests when we have our event. Grills are provided at the pavillion. Looking forward to coming back for the celebration party!",
  "The trail is nice and they offer boat rentals and such (although we have never used them), but the place has a few problems.\n\nThey have very limited parking. On a nice day, you may drive here only to realize the lots are full and you are stuck in a line of 5 cars waiting to park. This has happened to us a few times so we don't really bother trying anymore.\n\nAlso there is a lot of dog waste along the trail due to people not cleaning up after their dogs. We also have encountered people who have let there dogs swim off the leash by the dam even though it is illegal. Our (large) dog doesn't mind other dogs most of the time, but he has gotten into it a time or two with unleashed dogs here that have ran up to him/us.",
  "Went to scout this location for an upcoming OLLI course on the health benefits of spending time in forests. Lake Johnson is slightly off the beaten path (highways), and muted traffic noise still gets through the pleasant natural setting.  Paths are paved to increase access for people with mobility issues, and benches or picnic tables are strategically placed throughout the park.  As we were walking the path, a red-tailed hawk swooped past us - wow! The lake's lovely and serene. We'll be back.",
  "Visited the lake 5 times during July and  August for beach/ swimming. $7 fee per car per day. Clean beach, sand at bottom of water. Clean water. Restrooms/ changing rooms clean. Able to find shade to sit in . Picnic tables and charcoal grills available for use. View is beautiful. Was never crowded. Playground, volleyball court. Beach sloped doen gently, swimming area roped off.",
  "Went paddle boarding on a Tuesday morning. Beautiful lake, decent paddle board, mildewed life jacket (what can you expect, I guess). The staff on the lake were young and somewhat reluctant to really get hands on, but it was my first experience and I had a good time. $10 to rent the paddle board per hour. Goes until August 25th (I believe) and then only available on weekends."
 ]
},{
 "name": "North Carolina State University",
 "address": "2200 Hillsborough St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/f3/36/12/north-carolina-state.jpg",
 "tags": [
  "art",
  "historic",
  "library",
  "kids",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3381152-Reviews-North_Carolina_State_University-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "The best public school by it’s size and its infrastructures! NCSU is huge and is basically the heart of Raleigh. Even if you’re not a student/teacher you should go and visit, and buy some merch to support them.",
  "The campus has lots of character and the educational programs are top-notch. Salaries and job acquisition for graduates are always top-rated.",
  "Beautiful, college campus right in the heart of Raleigh. The campus feels separate from the city, very safe, clean and sprinkled with historic buildings and large trees. It has grown from its original campus and expanded to include a Centennial campus that mainly houses its premiere Engineering schools and a state of the art library with amazing study spaces for students. There are so many majors here and a great variety of cultures and people. They have a great welcome week for new students each Fall (Packapaloosa) that really helps the kids make friends and feel at home. Professors have been excellent so far! Go Pack!",
  "Wonderful old trees on campus grounds, historical buildings with lovely architecture, and famous old well. Disappointed in not seeing the historical confederate soldier statue--hope it is replaced soon.  Loved visiting!",
  "NC State is the largest university in NC, and located in the heart of the capital city. Despite its size, and being in the middle of a city, it is an attractive campus. NC State has an outstanding Turfgrass Management program, which is evidenced by the well-maintained lawns throughout the campus. The Bell Tower, located just off Hillsborough Street, is a popular gathering spot for students and friends who need a comfortable spot to take a break. The campus is a mix of older traditional buildings, mid-century modern buildings, and brand new additions. The main campus is located between Hillsborough Street and Western Boulevard, while the Millenial campus is across Western Boulevard. Millenial campus is an amazing architectural site- the fully automated library on that campus is definitely worth a visit.  NC State is a nationally known university and is famous for its engineering programs and veterinary school. "
 ]
},{
 "name": "Mordecai Historic Park",
 "address": "1 Mimosa St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/54/da/33/mordecai-historic-park.jpg",
 "tags": [
  "family",
  "historic",
  "history",
  "tour",
  "historic",
  "learn",
  "history",
  "tour",
  "tour",
  "family",
  "history",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d277318-Reviews-Mordecai_Historic_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband & I recently visited this historic house & park. Even though the day was hot & humid, the house & structures are cool & comfortable. Our guide, Marissa, was superb! She had a large group (our seniors as well as a family with small children, etc) and she made the presentation relatable to all, interesting, and fun. She really seems to enjoy what she does and it shows. She made history fun!",
  "This is the greatest place for our out of town visitors.  We never miss the trolley tour.  Excellent way to see the City of Oaks and learn the history of Raleigh.  LOVE the tour of the historic home.  ",
  "The employees, KJ and Ethan couldn't have been nicer.\n\nKJ's tour was informative and fun.\n\nDefinitely a place I would recommend to visit in Raleigh. ",
  "We did the tour and looked around.  We particularly spent time at the information / bookstore looking at where our family tree's branch resulted in our direct family history.  \nWe were very interested in the items their, particularly the Mordecai house.  We have lived in the area for many years and simply had not made the trip to visit, even with our joint family history.",
  "My husband and I stopped in to check out this lovely older home that also had a few other buildings that represented that time period and that were on the grounds. Toured a few of those as well besides the main house. Very Informative and lots to see. Great tour guide as well. "
 ]
},{
 "name": "North Carolina State Capitol",
 "address": "1 E Edenton St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/1f/d5/2c/north-carolina-state.jpg",
 "tags": [
  "tour",
  "historic",
  "history",
  "free",
  "tour",
  "history",
  "walk",
  "free",
  "tour",
  "library",
  "walk",
  "tour",
  "free",
  "structure",
  "history",
  "library",
  "walk",
  "history",
  "walk",
  "tour",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d126599-Reviews-North_Carolina_State_Capitol-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Capitol is a National Historic Landmark, it has been restored to it's 1840 appearance. It is open for self-guided tours Monday-Friday 8am to 5pm, and guided tours Saturday 9am -5pm for groups 20 or more. The self guided tour is very well done, provides information on each floor. There is also an elevator. It is a beautiful building, has lots of information on the history of NC. The marble steps are original and have several worn spots on them. Union Square that surrounds the Capitol has several statues and monuments worth seeing. The NC Museum of History is just across the street and both are free.",
  "The North Carolina State Capitol is home to the North Carolina Governor's office and staff. It is a National Landmark and built in 1840. When you walk in the rotunda, the domed ceiling is impressive. \n\nI took a behind the scenes tour so may have seen some areas not on the regular guided tours. There is a large safe as the building once housed the Treasury. The House and Senate Chambers can be viewed. The desks are original but the chairs reproductions. \n\nThere is a spiral staircase that goes up two flights to some extra rooms. Then a steep staircase with pen-checked stairs goes up to the domed area and roof. \n\nThis is a beautiful building full of history and worthy of a stop.\n\nThere are free self guided tours and free guided tours at certain times.",
  "It is a must see for anyone visiting downtown.  You can take a self guided tour of the interior which is very interesting.  You will see the old library and geology room plus the rooms where the Senate and House of Representatives met \"back in the day.\"  The grounds with all the statues should not be missed.",
  "Don't just look at the objects in the room, which are interesting but look at the workmanship of the molding, rails etc. They don't make them like this anymore. As you walk up the staircase see the worn steps. You can imagine all the people going up and down them back in the day. The objects in the room are interesting to see also. The old wooden desks and the potbellied stove. Linger a bit and just take it in. Its a step back in time. Enjoy! No elevators for public use, so be careful on the stairs. They have a small gift shop also.",
  "Friends of mine decided to tour State Capitols in all 50 states. I joined them for NC State Capitol tour.  It was fascinating, Beautiful building. I learned a lot and they said it was in the top 10% of all capitol tours. Highly recommend and I never would have even thought about it.  Book ahead to make a reservation and check tour times. It's free too.  Great for families",
  "My 16-year-old grandson and I had an early morning hour to kill in downtown Raleigh, so we stopped in at the Capitol Building. As far as we could tell, we were the first visitors that morning, and when we left 30-40 minutes later, we were still the only visitors. The 3-story structure has some beautiful architectural features and many portraits and historical items scattered throughout it. Our favorite areas were the State Library and State Geologist's Office on the third floor. Though I've lived in NC for 38 years, this is the first time I've gone into the Capitol, and I'm glad I did. It's an important part of the state's history and certainly worth a visit. Don't neglect to walk all around the outside of the building to enjoy the monuments, the old trees, and the well-tended grounds.",
  "Expressing our opinions while surrounded by dozens of North Carolina Highway Patrolmen and local police was wonderful.  I have never felt so safe as I did surrounded by authorities trying to prevent the spread of COVID-19.  The weather was wonderful, the local scenery and monuments magnificent and downtown parking was actually readily available.  Many, many other like-minded visitors were present and acted to make our visit a thrilling experience.  Being shoulder to shoulder with, and shaking hands with so many was a wonderful, wonderful experience.  Though North Carolina is a state ready to dump much of its essential history, it was highly visible in the local area.  The monuments to the state's people and the sacrifices they have made are outstanding.  It is a shame that current  local officials care not one iota to protect that for which North  Carolinians fought and died.  Magnificent area for strolling, thinking, and sitting on the many, many benches.",
  "The NC State Capitol building is neat. We went on a Sunday evening, so were not able to go inside. We did walk around the outside. It is an open yard around the entire perimeter with many neat statues and some interesting facts. The architecture is neat. Worth seeing, but I recommend going when you can get inside, otherwise you could probably skip this attraction if it takes away from some other activity.",
  "My wife, son and I toured the museum. I though it was nice but they were performing a lot of restoration and mush of the building was closed. Would love to come back when they are finished.",
  "Majestic building at the top of Wilmington St. Beautiful dome that can be seen from many spots. Highly recommended ",
  "This is an adult or older child tour.  It is free and very interesting but currently the 3rd floor is under renovation thus the 4 stars versus 5.  Lots of plaques to read - but for those interested in NC History this tour should be on your list!.  I recommend the state capitol tour followed by the NC Museum of History which is just across the street."
 ]
},{
 "name": "Carter Finley Stadium",
 "address": "4600 Trinity Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/a4/df/5a/florida-state-vs-nc-state.jpg",
 "tags": [
  "art",
  "art",
  "field",
  "field",
  "field",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3374942-Reviews-Carter_Finley_Stadium-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "There really isn't a bad seat in the house.  Tailgating is art of its own here.  Parking is not very accommodating if you don't have a season parking pass.  Avoid the east side for afternoon games as the sun can be brutal. ",
  "There really isn't a bad seat in the house.  Tailgating is art of its own here.  Parking is not very accommodating if you don't have a season parking pass.  Avoid the east side for afternoon games as the sun can be brutal. ",
  "When I walked into Carter Finley after the upgrades were complete, I almost hyperventilated it was so awesome. It is one of the top facilities in the country from the sky boxes to the field house.  \n\nThe architects did a great job of keeping the old and blending it with the new. It is beautiful. Putting the PNC Arena close to Carter-Finley only adds to the beauty of the property and takes advantage of joint parking.",
  "Set about 5 miles outside of downtown Raleigh. ....fantastic location and loads of parking . Great facilities. Recommended ",
  "This was my first game in years. The stadium is very nice! I sat with the students in the end zone that used to be a grassy hill when I went to school there. Great view of the field from there and just about anywhere. Nice large screens with replays and other info. The bathroom lines moved quickly. Parking without a pass meant parking at a business down the road and still paying $20, but getting out wasn't too bad. Be warned that many people stand up for most of the game, so you might have to stand up on your seat to see over others.",
  "very nice stadium.  good site-lines, everyone is close to the field.   plenty of amenities, restrooms, concession stands, etc.   parking is easily accessible.   ",
  "Great place to watch college football. Plenty of options for concessions and prices are about the average for stadium food.",
  "Carter Finley seats 60,000 plus.  All the seats on the sidelines are good  and the end zones are as good as any end zone seats.  Excellent concessions.  Prices not bad for sporting event.  You can leave the stadium at half time and come back in for the second half.  Wolfpack Fans are very passionate and supportive.  Bathrooms ... well it is a sporting event."
 ]
},{
 "name": "WRAL Azalea Garden",
 "address": "2619 Western Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/c0/29/88/wral-azalea-garden.jpg",
 "tags": [
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3913557-Reviews-WRAL_Azalea_Garden-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is an amazing number and variety of azaleas. You walk through paths that slope down a hill. Azaleas are thick and profuse. When you reach the WRAL back yard, there are other flower varieties planted along the garden perimeter, such as tulips. The path can be uneven and difficult for a person with limited mobility. ",
  "Very relaxing and beautiful area - you can sit down and listen to the birds and forget about the stresses of your life!",
  "We took a stroll through the garden before doing a tour of the studios.  Unfortunately, the azaleas were not in bloom, but several of the rhododendrons were.  They have a wide assortment of azaleas and I can only imagine how beautiful the garden is when they are in full bloom.\n\nThe gardens are well maintained and all the plants are very healthy.  They have good signage so you can identify different plants.\n\nOverall, a fun experience.  We will definitely visit again.",
  "This is called the Azalea Garden and the Azaleas are magnificent.  The grounds keepers keep seasonal flowers going year round.  If you are in the area, pack a lunch and go and have a picnic in the most beautiful place in this area.",
  "You've never seen a more spectacular showing of azaleas in one small space until you've seen this garden!"
 ]
},{
 "name": "Crabtree Valley Mall",
 "address": "4325 Glenwood Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/79/9b/cf/photo0jpg.jpg",
 "tags": [
  "food",
  "food",
  "walk",
  "learn",
  "food",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3578965-Reviews-Crabtree_Valley_Mall-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "So many shops to see. High end but also many smaller shops in all price ranges. The Cheescake Factory has great food and it is so pretty inside. A bit busy to park but once you do, pay attention to where you are so you can find your car easily. Other than that. My favorite shopping place.",
  "What does a Lego store have to do with this mall? It shows the diversity of shops from Belk and Macys to Lego. The same for its many eateries from Cheesecake Factory to Food Courts. Parking and traffic can be a bit of a hassle but there is plenty of both. The mall itself is huge, busy and seems safe.  A great place for a walk, eats and great shopping.",
  "My first time to Raleigh for business trip. This mall is nice and big enough to explore. There is food court with variety of foods. Clean and comfortable enough to enjoy your meal. About retail stores, not too many world brands, but still good enough. Good interior, easy to remember, and not too crowded. The only problem is how to reach the mall. It is difficult if you don't have your own vehicle. If you g by bus, you have to make sure you know the route and destination. Again, it is not a problem, because in my second time to the mall, I felt like one of Raleigh citizen...LOL. It was easy to learn the route, and when you get confused, just asked the driver. The people in Raleigh are friendly. ",
  "I live in Wilmington NC and its an outdoor beach community and its so refreshing to find an indoor mall. They are quickly becoming the dinosaurs of our lifetime but I truly enjoy an indoor climate controlled shopping experience in our humid environment. Bravo Raleigh...Take note wilmington!!!!!!!",
  "I visited this mall for the first time while on business trip in Cary NC. It was unique to me as some of the stores were in doors and some were out doors. The sales were great and the people were very friendly. I would definitely visit this mall again",
  "Arrived at hotel around 2:45 pm. A little early but ok if we had to wait for check in. They had no room available to us till 5 pm!!! They had allowed very late checkout for lasts nights guests (100 rooms).  People behind desk were very nice but this is not acceptable! People were swarmed in lobby for hours!! I was weepy & so upset as we had an affair to attend at 5:30 !!",
  "Still a clean, wide ranging variety of favorites.  There are several niche shops as well and don't overlook the vendors in the thoroughfares.  ",
  "Horrible parking areas and many areas unsafe.  Built in a former cow pasture.  Floods often.  Traffic in and out is risky.  Some good stores and restaurants. .  You are better off to drive 25 minutes to Streets of SOYTHPOINT in Durham."
 ]
},{
 "name": "The Raleigh Market",
 "address": "1025 Blue Ridge Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/fe/34/77/raleigh-flea-market.jpg",
 "tags": [
  "free",
  "food",
  "walk",
  "food",
  "cheap",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d6697597-Reviews-The_Raleigh_Market-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went Saturday morning to have a walk around. There is new stuff and old. There is an indoor part and an outdoor part. There are even some places to get food. A neat experience.\nParking is free but the later you get there the further away you have to park.",
  "If you love flea markets put this one on your list. Its located on the Raleigh fairgrounds near the Dorton Arena. You can find a wide variety of nostalgic items, fresh fruit and vegetables and knick knacks,  this flea market has it all! They even have food vendors available that sell fair favorite food.  Bring cash as many of the vendors don't take cards or you have to have a certain purchase amount.",
  "What to do in Raleigh-Durham area on a Sunday? I thought that I would start the day with a visit to the Raleigh Flea Market. \nThis is an open air/indoor market that is held on Saturday and Sunday at the North Carolina State Fair area. \nWhen I arrived at about 1130am, parking was busy. Luckily I saw someone pull out of a spot and I nipped in. \nFrom what I saw, the market is a mixture of people selling new stuff ( mainly inside, it is all new things, with the exception of an antiques seller at the far end of the building), and outside, there is a mixture of general bric-a-brac stalls and people selling some new stuff out there.\nI walked around for about an hour. There was lots of Tat. People trying to sell any old rubbish (and not selling some of it very cheaply either). The new stuff was generally NOT cheap.  A lot of the things could be purchased on line or in shops like Walmart for less. \nI “ummed and arred” on whether to buy a few things, but in the end decided against it. \nSummary When in Raleigh-Durham….don’t bother going to the Raleigh Flea Market…it’s not worth the effort unless you are a die hard market/car boot sale sort of person.",
  "Great place to relax and find unusual things. Enjoyed the inside vendors, which are there every week",
  "Recently spent a saturday afternoon at the flea market and was seriously disappointed.  I enjoy garage/yard sales but this flea market had a lot of just junk.  I was expecting more diversity in items and less junk.  There were not as many crafters as I expected.  Overall it was a disappointment.  On the plus side, it was easy to get to and had lots of parking.  Good variety of food trucks and food vendors."
 ]
},{
 "name": "Raleigh Little Theatre Rose Garden",
 "address": "301 Pogue St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/ef/ee/c7/pink-rose.jpg",
 "tags": [
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d277211-Reviews-Raleigh_Little_Theatre_Rose_Garden-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Rose Garden is a gem tucked away in Raleigh's Dixie Trail neighborhood.  Only one of three accredited rose gardens in the State, the Rose Garden boasts over sixty rose beds. There are varieties of hybrid teas, floribundas, grandifloras, miniatures, and antique roses.  The garden is surrounded by an arboretum of evergreen and deciduous trees.\nThe Rose Garden has roses in bloom all year and is open seven days a week.  There is a special feeling when you enter the Garden, which sits in a bowl-shaped setting.  You are surrounded by thousands of roses.  It is very quiet and calming.  You leave feeling relaxed and rejuvenated.",
  "Someone suggested this location for prom photos and it was a hit!  Their whole group lined up around the fountain and the photos were amazing. The garden is hard to see from the street and very unassuming. I imagine on a weekday it would be very peaceful and a great place to picnic or simply view the roses, trees and outdoor spaces. Such a lovely gem in the heart of Raleigh.",
  "We enjoyed a lovely day of October sunshine for wedding photos with the beautiful roses, outdoor theater and arbor for photo back drop.  What a stunning gift in Raleigh's back yard.",
  "Enjoyed the beautiful aisles of blooming roses in all colors. Many of the Roses were very fragrant as you walked past them.",
  "This is Raleigh's hidden gem, that even locals are not familiar with. This garden has hundreds of different roses. Each bloom is more beautiful than the previous one. Great for weddings, photography buffs and gardeners. To fully experience this gorgeous garden, set aside at least 1 hour. Introduce your family and friends to this garden, which can complete with Portland and it's reputation as the rose centre of the world. ",
  "A small but beautiful rose garden, filled with hundreds of roses of all colors!  Great spot for a break to \"smell the roses\" and get some nice pictures.",
  "Be certain to visit the Rose Garden in peak rose blossom season in the summer. The beautiful blossums and their scents are magnificent! ",
  "The Rose Garden is a gem tucked away in Raleigh's Dixie Trail neighborhood.  Only one of three accredited rose gardens in the State, the Rose Garden boasts over sixty rose beds. There are varieties of hybrid teas, floribundas, grandifloras, miniatures, and antique roses.  The garden is surrounded by an arboretum of evergreen and deciduous trees.\nThe Rose Garden has roses in bloom all year and is open seven days a week.  There is a special feeling when you enter the Garden, which sits in a bowl-shaped setting.  You are surrounded by thousands of roses.  It is very quiet and calming.  You leave feeling relaxed and rejuvenated."
 ]
},{
 "name": "Reynolds Coliseum",
 "address": "E Dunn Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/0b/c1/10/view-of-grand-hall-from.jpg",
 "tags": [
  "food",
  "historic",
  "family",
  "history",
  "library",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3701803-Reviews-Reynolds_Coliseum-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful building and renovation.  Very handicapped accessible with ramps, an elevator and prime handicapped seating.  Minimal food choices-hamburger, hot dog, pizza, nothing healthy like salads.",
  "Historic Reynolds Coliseum is brand spanking new due to a terrific renovation.  Now only seats 5,500 but is very attractive with nice seating and a big glass area where you can see through.  Nice historic information throughout including plaques and displays.  If you are on NC State campus this is a must.",
  "This is a great place to watch a game or an event.  The men's basketball team should move back here in my view--the small venue works for Duke, and it could have worked for NC State too.  The events that are staged here are fun--it is worth going to any sporting event here regardless of how \"excited\" you are about the event itelf!!",
  "Post renovation Reynolds is something to see. The old barn is sleek and modern feeling with a ton of amenities. Visit for the Hall of Fame and be sure to buy a ticket for the Kay Yow Game and see Wolfpack Women’s Hoops. Some patience is needed for leaving the parking lot but a visit to nearby Talley Student Center can make the wait worthwhile. ",
  "They have done a marvelous job remaking Reynolds. Called the Kay Yow court and the Valvano arena. How fitting for 2 legendary  coaches to be honored. Home of the Wolfpack woman and they are a class act with Wes Moore leading. Go see them. Big bang for your buck.",
  "the old barn is a great venue to watch sports, especially after the $33 million renovation several years ago.  Very family friendly.",
  "What a fantastic venue!! The hall of displays of Wolfpack athletics' history is wonderful!! And the court itself looks like a great place to catch a basketball, volleyball, or other game. Great job NCSU and go Pack!!",
  "Reynolds was opened in 1949 as home for NC State basketball and ROTC. For many years it was the largest on campus arena in the south and by far the toughest place for a visiting basketball team to play. It made Duke's Cameron Indoor seen like a library the crowd noise was so different. It was renovated a few years back and is now home to 5 sports - women's basketball, volleyball, gymnastics, wreastling and rifle. Plus it is home to the NC State Sports Hall fo Fame, Walk of Fame and all 3 ROTC programs. Plus the mens basketball team plays it's annual heritage game here and this spring was the host for 3 games in the NIT and the first rounds of the Women's NCAA Basketball Tourniment. We went to all 5 games and the atmosphere was outstanding - just like in the days whe the men won 2 NCAA Championships. Food service has improved tremendously and Reynolds is now air-conditioned. There is literally not a bad seat in the entire facility."
 ]
},{
 "name": "Shelley Lake Park",
 "address": "1400 W Millbrook Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/31/2c/24/my-running-place.jpg",
 "tags": [
  "walking",
  "nature",
  "walk",
  "walking",
  "walk",
  "art",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d562275-Reviews-Shelley_Lake_Park-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of parking areas around this park.  I’ve been walking round there for years,  last year was great because you could see eagles nesting.  It’s interesting, sometimes you can see turtles and a heron.  Good if you like wildlife.  ",
  "This is a great place to walk your dog if you have one,,ride your bike, play with your children, or just enjoy nature. I find it peaceful in the early mornings.  ",
  "Similar to Lake Lynn in design.  The thrill of eagles nests.  Great walking or running  trail.  Another gem of a Greenway Trail.",
  "Near my parent's home - a gorgeous park to walk/bike/run around the lake. Well maintained. Many birds and ducks along the walk.",
  "Very nice place to walk around. And they have a nesting eagle! There is an art center which frequently has small local exhibits next to one of the parking lots."
 ]
},{
 "name": "Historic Oakwood Cemetery",
 "address": "701 Oakwood Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/c2/67/f7/historic-oakwood-cemetery.jpg",
 "tags": [
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3317672-Reviews-Historic_Oakwood_Cemetery-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a must in Raleigh! The grounds are expansive and quiet and well maintained with many a neat stone to see. The craftsmanship alone is worth the trip, regardless of the urban legends. We spent far more time here than planned.",
  "As an avid cemetery lover I can say this place did not disappoint. It is really large, took me about 3 hours and I don’t think I have been everywhere. The place is about a 150 years old, so the graves don’t look ancient, most of them are well kept. It is still in use. I have been to quite a few cemeteries in the United States, this one is one of the best, hands down.",
  "I have visited cemeteries around the world and the Historic Oakwood Cemetery ranks right up there with some of the best.  Very peaceful and serene and definitely well maintained.  Definitely recommend strolling through and soaking in the history.",
  "As an avid cemetery lover, Oakwood is by far one of the best cemeteries I've visited! The atmosphere is peaceful and relaxing, and it is very well maintained and taken care of! Didn't have enough time to check out the whole cemetery, but I'm looking forward to coming back again in the future!",
  "I wished I had more time to really look around longer.  I found it odd  that flags for Memorial day were not out yet."
 ]
},{
 "name": "Lake Wheeler",
 "address": "6404 Lake Wheeler Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/0e/4a/92/lake-wheeler.jpg",
 "tags": [
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d277225-Reviews-Lake_Wheeler-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fished in a cold, strong breeze at Lake wheeler. No luck with the fish but still yr facilities all around with plenty of benches & very clean restrooms.",
  "Very quiet place to visit. The Lake itself is quite beautiful. There are numerous areas around the Lake for picnics and large get-togethers. I have never been fishing there but those that have really enjoyed it. It's just a short drive south of Raleigh.",
  "Great place to take young kids fishing. Suggest that you use Red Worms to be able to catch axvariety of small fish ",
  "Scenic and serene would be the two words that I would used to describe Lake Wheeler...Such a beautiful place to relax or enjoy a kayak or nice trail walk....A true hidden gem in Raleigh....Will be back when I am in the area regardless of the season.. Too beautiful to miss...",
  "I used to bring my son to this lake when he rowed in Highschool years ago but had never been on the water myself. I really enjoyed this paddle! I’m relatively new to kayaking but am quickly falling in love! This was my first paddle along side power boats so I was nervous but boaters on the lake were courteous  to small craft!  The best part is, cross under the road and an entire world opens up. It’s quiet and bird watching is plentiful. There are a lot of coves and Chanels to explore and all were navigatable in a kayak. I was out for almost 3 hours and did not run out of places to paddle.\nThe park itself was busy but not crazy and the staff I dealt with were pleasant and helpful. I will definitely return!"
 ]
},{
 "name": "Historic Oakwood",
 "address": "Franklin Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/cb/9d/db/historic-oakwood.jpg",
 "tags": [
  "tour",
  "historic",
  "walking",
  "tour",
  "historic",
  "tour",
  "historic",
  "walking",
  "history",
  "tour",
  "historic",
  "walking",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d258526-Reviews-Historic_Oakwood-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great self guided walking tour around the Oakwood Historic district with beautiful homes with beautiful Victorian homes. There is a lot of renovations going on and they have gone out of their way for amazing Halloween decorations....a must see...could be a little scary for very young children.",
  "If you love Victorian houses, this is a great neighborhood for a stroll.  Every year, they also have a Christmas season Historic Oakwood house candle light tour where several homes in the neighborhood open their doors to show off their decorated Victorian interior splendor.  This event has a nominal ticket fee for 3-4 hours of touring.  It is a wonderful experience",
  "I wish I could afford to live in this area.  The houses are all so beautiful and well-maintained.  I'll drive through on my way to work just to see the lovely abodes.  You can pick up a Historic Walking Tour map & guide at some of the local visitors centers (GRCVB Visitor Information Center 500 Fayetteville Street & Capital Area Visitor Center at the Museum of History 5 E. Edenton Street)\nA nice history lesson about architecture and the people & families who built & lived in them.  You can also visit the nearby Oakwood Cemetary for an additional dose of learning!  Walking the neighborhood is what I recommend.  You can take your time, read your guide and enjoy yourself at your own pace.",
  "not a welcoming location I was only happy when i saw the old Krispy Kreme shop and memories of my youth came flooding back.",
  "Great self guided walking tour around the Oakwood Historic district with beautiful homes with beautiful Victorian homes. There is a lot of renovations going on and they have gone out of their way for amazing Halloween decorations....a must see...could be a little scary for very young children.",
  "This was my second time visiting the Historic Oakwood section of Raleigh and I thoroughly enjoyed it all over again.  I love wandering around the streets looking at all of the lovely historic homes.  It is fun to imagine this area \"back in the day\" and what life was like at that time.  Lovely area of Raleigh.",
  "I wish I had the guid book.  I found it very cool to think about what has happend in this lovely neighborhood.  Beautiful flowers and trees line the houses with a ton of history!",
  "Followed the guide book we grabbed at the hotel and was disappointed.  The one open property had parking set aside but it was obvious that the people working in the area had taken all the spots."
 ]
},{
 "name": "Walnut Creek Amphitheatre",
 "address": "3801 Rock Quarry Rd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/18/67/58/full-view-of-stage-but.jpg",
 "tags": [
  "music",
  "walk",
  "eat",
  "walk",
  "cheap",
  "food",
  "drink",
  "parks",
  "wander",
  "family",
  "kids",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d6934989-Reviews-Walnut_Creek_Amphitheatre-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "this facility has great options for reserved seating or lawn seating. You can bring your own lawn chairs or blankets and enjoy the music. Not a bad seat in the place. Some angles behind columns have limited viewing to certain areas of the stage. And if there is inclement weather the lawn seats are not covered. And the last few rows of reserved seating are also uncovered. Parking is fairly easy and not an extremely long walk. ",
  "Venue is ok but some things are outrageously over priced This was a $ .50  sized 16 oz bottle of water $5 What the hell?",
  "Great experience.  It was our first time vising the Walnut Creek Amphitheater as we went to see Cheap Trick and ZZ Top on October 5, 2019. The warm up band started at 7: pm (band before Cheap Trick), and we arrived at 6:20. The parking was very easy as there were plenty of attendants to direct us to our spot. The walk was a few city blocks length, however, there were signs, paths, and people to direct us to the main entrance. Going through security was fast and easy without any issue. The entire staff working there (security included) was very friendly and professional. I think this had a lot to do with the crowd, as a majority of those in attendance were between 40-60 years old and very mature, which I think had a lot to do with the tone of the crowd and those working the venue. I believe this was because of the type of bands playing (older) had a lot to due with the friendly and peaceful atmosphere. We set in section nine (in seats) toward the back and could see with stage with no issues, plus is was not really loud in this area either. The prices for food were comparable to amusement parks and movie theaters, so if you decide to eat there it will cost more than regular dinning. As the third band started (ZZ Top) I coudl tell people started to drink more and we were a little worried about getting out of the parking lot with some people driving (they were not rowdy, just drinking more). So we left a little early before ZZ Top finished. Usually, we always stay until the last band is finished and the show is over. However, I am really glad we left a little early for this show as we had no troubles getting out of the parking lot before the show was over. This would have been a lot different if we stayed until the last band was finished. They key may be to arrive early and leave early. Overall, we had a great time and would go again if the right band was playing. I truly believe who you are watching and the type of audience they a track will have a huge impact on your experience here.",
  "Had a great time despite being really humid. We initially purchased lawn seats but decided to upgrade a few days before. The upgrade fees were higher here than they usually are at the Charlotte venue. Not sure if thats the decision of the venue or the artist ",
  "This concert was a last 'hurah' for our family before all the kids headed out to their respective colleges for the coming year. While there were other venues that were hosting the Heart/Joan Jett tour - we chose the Walnut Creek Amphitheatre due to the dates availabe within a couple of hours driving distance for us. \n\nPrior to the date of the concert - we decided to upgrade our seats. We were able to grab seating that gave us a PRIME view of the stage and both screens should the need arise. \n\nTraffic to this concert was a nightmare. I have never sat in traffic for the length of time that this concert required. The lines to go through security checks were longer than I have ever seen. \n\nUpon entering the section for reserved seating - we encounter individuals in our seats. They mouthed off a bit about moving - yet when I asked them to pull out their tickets and see if we were 'mistaken' they commented that they had lawn seats and moved to the row ahead of us. \n\nDuring the concert - we should have had a birds eye view. Nope - remember those folks who plainly said they had lawn tickets?? Well - the one gal would slide over the seats on 4 rows and then run from left to right in front of us, so our view was obstructed no matter which way we looked. \n\nMy husband finally complained to one of the workers who stated if they were in their seats there was nothing to be done. Now - do you remember that the folks were suppose to be IN THE LAWN section??? Yeah - the employee never checked their tickets and told us she would move us to a diff area. \n\nWe ended up being moved further back to an area that was half the price of what I paid for my upgraded tickets. We had an unobstructed view from the new location, so we left it at that. Fast forward a bit and then folks from the lawn area filled in all around us. How do I know?? The groups were yelling at each other that they came from the lawn because they saw the seats were open and NO ONE CHECKED THEIR TICKETS!! This was repeated over and over....so it was hard not to hear the statement. They jumped in the seats and an employee in the aisle never said a word. \n\nWhy is it that I pay for an upgrade and the employees working that area NEVER CHECK TICKETS to ensure those that pay for an upgraded experience are given such? Is it common for someone paying $20 for a LAWN ticket to just wander into the upgrades an no one checks??? \n\nNow - let's talk about the concessions and facilities. The women's bathroom was horrible. From the water standing in the floor to the insane B.O. smell permeating the air - the bathroom left a lot to be desired. As the concert progressed so did the mess in the bathrooms. No papertowels.....more standing water.....no soap.....it just went down hill as the night went on. \n\nPurchases....when you stand in line for concert T's....oh my!! The guys working would take folks behind you and not wait on people as the line formed. I finally had to say 'excuse me - we were here before the last 3 people you have picked to wait on' to get the items wanted. Terrible customer service. \n\nThis outfit needs a HUGE overhaul in the customer service, cleanliness, parking, and seating areas!! I have been to many venues that don't seem to have the issues that this location has. Lack of attention, poor employee service, and lack of anything other than making a dollar leaves me realizing that it is worth the drive and headache to pick other venues in the future."
 ]
},{
 "name": "North Hills",
 "address": "4350 Lassiter At North Hills Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/cf/7f/9a/north-hills.jpg",
 "tags": [
  "family",
  "food",
  "walk",
  "music",
  "walk",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d2657140-Reviews-North_Hills-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "This shopping area is very well laid out and definitely recommended for any first time visitors. The Regal movie theater has reserved seating and is very clean. Though it seems like there isn't enough parking available, the underground garage made it simple to park and access a variety of stores via the escalators or elevators. A pleasant variety of shops and restaurants over a wide set of price ranges, from fast food to steak houses and more. I'm not sure how it would be during the hot summer, but it's definitely family friendly on a pleasant December day.",
  "North Hills is a great location to go out and enjoy a date night. It  has great restaurant choices, shopping and movie theater all in one convenient spot.",
  "North Hills is one of the best places to shop in Raleigh. A variety of shops, restaurants, stores you can ever imagine. Convenient to Bus transit to/from Downtown. I go to North Hills when meeting with friends for dinner on weekends,  shopping, or just a walk around midtown.",
  "North Hills has some of the most upscale stores in town. But the nice thing about this large outdoor shopping center is that they also have low priced stores like Target also. \n\nThe same way for restaurants. North Hills has some of the more elegant restaurants in town but have lower priced to moderate restaurant such as Chick- Fil- A and Five Burgers also. It has an upscale Bowling Alley as well as a 14 screen Regal Movie Theater.\n\nIt is spread out on both sides is Six Forks road right next to the I-440 Beltline. One side has shops, a grocery store, restaurants and apartments. The main side also has a Renaissance Hotel along with many shops and restaurants.\n\nNice landscaped with streaming music makes it a nice outdoor shopping center there are also a couple entertainment areas for live music that play mainly in the warmer months.\n\nSo North Hills has it all. It is very spread out into three sections and makes for an interesting walk through.",
  "I loved North Hills because the shops were unique and different. I love small boutiques with original designers and lots of great items you don’t see in traditional shopping malls. North Hills also had your traditional upscale women’s and men’s shops, but I most enjoyed the women’s boutiques. Lou Lou’s had a great selection of jewelry and bags. Gena Chandler had wonderful beach cover ups. Monkee’s had some adorable 4th of July outfits. It was a great day."
 ]
},{
 "name": "Duke Energy Center for the Performing Arts",
 "address": "2 E South St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/8a/f3/96/progress-energy-center.jpg",
 "tags": [
  "performance",
  "eat",
  "walking",
  "learn",
  "theatre",
  "walking",
  "unique",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d3626500-Reviews-Duke_Energy_Center_for_the_Performing_Arts-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I attended a concert at this venue for the first time this week.  The Duke Energy Center for the Performing Arts is a beautiful Venue.  The seats we had were very comfortable and the sound was perfect.  We thoroughly enjoyed our evening.",
  "The NC symphony is a treasure. Seating is comfortable and sound system excellent. A most enjoyable evening with a wide range of genre.",
  "In the evening, we took in a performance by the accomplished North Carolina Symphony at the gorgeous Duke Energy Center for the Performing Arts. Youthful conductor, Clemens Schuldt, born in Bremen, Germany, mesmerized the audience with dramatic energy throughout the program, which included the Romanian Concerto by Gyorgy Ligeti, Violin Concerto in D Major, Op. 35 by Erich Korngold (both of these new to me) and the evening’s feature presentation, Brahms’ Symphony No. 2 in D Major, Op. 73.\n\nThe venue was beautifully lit at night in downtown Raleigh. For us Canadians, the ‘Duke’ appellation is far better known as a first rate University and a perennial basketball powerhouse, seemingly always to make its perilous way in the annual “March Madness” tournament into the exciting finals. \n\nThe Duke Energy Center for the Performing Arts actually consists of five impressive auditoriums including the symphony’s Meymandi Concert Hall, which opened in 2001. In a corner of the large lobby area, we listened to an informative pre-performance talk, and we discovered that it took Brahms a full 14 years to produce his first symphony; however, once he seemingly got the hang of it, he then knocked off this night’s symphony in a matter of only a few months.",
  "I agree with other reviewers that this sound in this venue is very seat specific.  You do want a good seat here.  DPAC in Durham has overall better sound/seat quality but lacks the character of this venue.   To make the most of this venue you need....1. a good seat. 2. a good parking place (you have options),  3. there are plenty of restrooms - learn where they are.  4. RUSH to the drinks during intermission - you'll appreciate it. 5. eat downtown.  Some restaurants are within walking distance others are on the \"R\" line which will take you there.  Best suggestion?  Take a \"rickshaw\" ride around town.  Have a meal at a local restaurant then \"rickshaw\" back.  Way cool.",
  "We go to this venue approxamatly 6-7 times per year. We did purchase the season tickets to the Broadway Series South plays. We were able to choose our own seats and keep these seat from year to year, if we choose. You can park across the street from the center in the NC dept. of Education parking lot and the men taking the fee ($5) will keep an eye on your vehicle until the lot is empty after the show. I like this lot. There is also parking in a garage across the street also for a fee and directly across from the theatre. The theatre itself is beautiful inside and out. It contains several different venues, the Memorial auditoriam and the Memande theatres as well as the Fletcher Opera house and I think one more. The memorial is the one where most of the Broadway plays are held. The ushers are very nice and helpful and the staff are great as well. We love this theatre and always have a good time, and its fun to dress up once in a while although you dont have to. There are plenty of restrooms and a small refreshment area inside where you can purchase (Hard and Soft) drinks and snacks before the show and during intermission. There are plenty of cafes and resturants in the area if you want to enjoy dinner before the show. I would not venture east past the mcdonalds as that area is not the best.",
  "The Progesss Center is sometimes to get to and find parking, so visit website prior to your show and check out parking so you won't be late. They have many venues from classical concerts to comedians.\n\nThe first time we went, downtown was under much construction so I was a little concered about safety walking to back to the car. But now the area is very well lit and easy to maneuver. If you get there early, go and enjoy one of the restaurants within walking distance before your show. Or have a drink/coffee after the show.\n\nOnce in the center, you will see how well it is maintained and the seating arrangements are well structured and easy to get to. \n\nStaff is friendly and very courteous.",
  "My husband and I attended a concert at this venue for the first time this week.  The Duke Energy Center for the Performing Arts is a beautiful Venue.  The seats we had were very comfortable and the sound was perfect.  We thoroughly enjoyed our evening.",
  "The NC symphony is a treasure. Seating is comfortable and sound system excellent. A most enjoyable evening with a wide range of genre.",
  "We went for An Evening With Chevy Chase. It was an eclectic crowd and the space and staff accommodated it well. Attractive and cozy yet accessible.",
  "Three venues here, of different sizes and age.  All three are terrific, with regular shows, concerts, ballet and opera available throughout the year.  The way back seats can be difficult for those of us with okay to bad hearing and eyesight, however the seats are all comfortable regardless of where you sit.",
  "I bought these tickets as soon as they went on sale. Mezzanine tickets for over $100 each!. Have tried for several years to get tickets to one of his \"book talks\".  Bought tickets through Vivid Seats instead of Ticketmaster because I couldn't get through. Didn't get to Center with proper documents, but the young man at the window was extremely rude, no help whatsoever. He stated they were a Ticketmaster venue and I might have to buy tickets again to get in. Fortunately, my daughter-in-law got through to Vivid and we passed through. Rushed through dinner to get there and then the show was more than 15 minutes after 7 before dimming the lights.  Then, a young local author came on and read a chapter from her book about Kudzoo.  Okay, rock stars have opening acts.\nSedaris makes no bones about he is not a \"speaker\". He simply reads from what he has written. We were prepared for that, however, we had to strain to hear every word. The acoustics were terrible. They should have had people all over the place testing the sound system. He doesn't have a commanding voice to begin with, and the fact you couldn't hear everything he said, was very annoying.\nAs much as I like him, his observations are so unique, he seems to have gotten on this rather depressive train in regard to his family. He needs to lighten up. Everyone has enough of their own family problems and need an escape, not a pile on."
 ]
},{
 "name": "Raleigh Convention Center",
 "address": "500 S Salisbury St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/7f/62/74/filename-img-2713-jpg.jpg",
 "tags": [
  "organized",
  "walking",
  "organized"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g49463-d1419925-Reviews-Raleigh_Convention_Center-Raleigh_North_Carolina.html",
 "source": "TripAdvisor",
 "reviews": [
  "Visited facility for volleyball tournament.  It was clean, organized and presented well.  With so many people for DAYS I was amazed and thrilled that the bathrooms were always clean and comfortable.  So far, one of my favorite locations for these tournaments.  However, parking nearby is very expensive. One day we paid 7 for an all day lot, another day 12 and refused the 20 lot.    A good bit of varience in a 1 block area!",
  "The Raleigh Convention Center  has been a great place for IBMA attendees. There is plenty of room and many rooms for showcases, Yet no so much walking that it tires you out. There are clean restrooms on every floor for your convenience, and ample parking space right next door.",
  "This is our second time here for the AAU National Karate Championships, and everybody at our dojo has commented on the fact that this is our favorite venue.  We all stay at the Marriott which is connected so we don't have to even go outside to get there.  The staff is very friendly and helpful.",
  "We evacuated here for the hurricane and it was not our best choice. The room was filthy- our 7 month old was able to easily find crumbs on the floor and other debris that he tried to jam in his mouth. I don’t expect white glove service at hotels but I also don’t expect to have to clean when I arrive at a hotel. ",
  "We recently held our annual conference at the Raleigh Convention Center and I was very impressed with the facilities.  Very large, open and clean.  A wide variety of spaces for meetings and classes.  Definitely a great venue",
  "I was an exhibitor at the Convention Center and was very pleased with how well organized everything was.  Set up, and take down was easy and guests were well handled.",
  "This event was good. I had not been to one before. I thought it would be bigger than it was. All the vendors were very friendly. The merchandise was very nicely displayed.",
  "Nice building, soaring ceilings, and lots of good spaces for meetings and trade shows. I was a videographer so got to go behind the rooms where the staff traveled. Lots of escalators but the elevators are strange, never could figure out which floors each served. None appeared to go to all the floors."
 ]
}]
