[
{
 "name": "Maymont",
 "address": "1700 Hampton St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/71/63/78/maymont-park-richmond.jpg",
 "tags": [
  "walk",
  "free",
  "nature",
  "kids",
  "walk",
  "walking",
  "nature",
  "walk",
  "free",
  "walking",
  "walk",
  "walking",
  "kids",
  "walk",
  "nature",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d258006-Reviews-Maymont-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "The whole park is wonderful \nWear comfortable shoes and explore all of it \nThe coy pond and Japanese garden are fun with stepping stones to walk on in the water\nWish we had packed a picnic lunch",
  "I have been coming to Maymont ever since I was a small child. This amazing park was once the estate of a wealthy couple from the city's Gilded Age. Explore Maymont's Gilded Age mansion, walk about the romantic Italian Garden, go down the hill and feel the tranquility of the park's Japanese Garden punctuated by its thundering waterfall, skip along and you'll catch a glimpse of black bears, eagles, deer, and buffalo in the wildlife exhibit, kids will love the exhibit that contains various farm animals, poke about the museum quality nature center with its aquarium exhibits and nature themed activities, other than that just relax in the well manicured park with its vast open spaces! It is free to enter the park. ",
  "They have it all: open grasslands for picnics, frisbee throwing, kid running, and sledding; petting zoo; nature trails for biking, hiking, and walking; beautiful Japanese and Italian gardens great for just taking it all in or for photo ops. I took my graduation pictures here and once even saw a wedding happening in the Italian Gardens! Take some time to explore the entire estate because there are so many nature-worthy experiences here.",
  "nice to walk around and enjoy the beautiful grounds. gardens are spectacular - be prepared to walk alot. it can be hot and humid so bring some water to stay hydrated.",
  "Maymont offers opportunities for paid tours and attractions, but we decided to stick to the free walk around the grounds. But our visit was at the end of the day (after being on our feet for over 8 hours) and I was wearing sandals. The steep hillsides and paths with very uneven stone pavers nearly brought tears to my eyes as I tried to walk from the entrance down to the Japanese gardens. I gave up after 45 minutes. Go and see this beautiful property, but wear sturdy walking shoes/sneakers, go in the morning when you have lots of energy, and be ready to face some seriously hilly terrain.",
  "Maymont is a Richmond treasure! It is 100 acres of beautiful space! The lawn is beautiful and lots of space to run and play. There are tours of the Maymont Mansion with only a $5:00 donation.  There is a playground and petting zoo for the kids.  In early spring, there are many baby animals to see and hold. The gardens are lovely with various trees and shrubs in bloom It is a beautiful wedding venue.There are also plant sales and holiday activities that occur. \nDonations are requested.Wear good walking shoes to walk on some of the steeper trails. Bring water & sunscreen and plan to make a day of it!",
  "If you plan on visiting Richmond, you must make time to visit here. Best times are Spring and Fall, on weekdays.\n\nI've visited here often here recently to combat quarantine fatigue.\nIn addition to the Japnese and Italian Garden, the mansion is also worth visiting it you get a chance.\nThere is no entrance fee for the park itslef.\n",
  "Lovely grounds to walk around and take in nature. Saw a wedding about to happen. Rolled down a hill like a child. We had a blast. Group of 7, ages 38-60",
  "SO happy when we found out YOU are  OPEN  (except for bathrooms) during this crazy time of stay at home.........mostly............We met another couple there and did our distancing,  as we saw everyone else was doing.......so MUCH besuty here from all the over 100 year old trees everywhere,the beautiful house (closed for now)all the many trails, so much to explore.......hope the waterfall is turned on soon........we LOVE  Maymont  as do all Richmonders  (we livein Midlo)\n       Tulips were amazing, I had come2 weeks ago and enjoyed the blooming trees\nAWESOME  GIFT is Maymont..",
  "I, like many others, are at home a lot now. Today I really need to see something different and beautiful so my husband and I went from our house in Williamsburg to Maymont. Thank you for keeping the grounds open. The landscaping is absolutely beautiful. The dogwoods are in full bloom, the tulips are too. My husband and I walked, had a little picnic and walked some more. We feel so much better. We are looking forward to touring the Mansion again sometime soon.",
  "We love the grounds at Maymont. It really is beautiful whatever season you visit. My son loves the animal area and my husband and I try to spend a good amount of time in the Japanese Garden. It is so serene and peaceful. The Japanese Maples are stunning the the fall. If you plan to go to the Japanese garden, bring your walking shoes."
 ]
},{
 "name": "Virginia Museum of Fine Arts",
 "address": "200 N Boulevard",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/95/61/a2/vmfa-exterior.jpg",
 "tags": [
  "art",
  "food",
  "tour",
  "eat",
  "walking",
  "art",
  "family",
  "free",
  "art",
  "music",
  "free",
  "tour",
  "art",
  "history",
  "walking",
  "nature",
  "walking",
  "free",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d267437-Reviews-Virginia_Museum_of_Fine_Arts-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Enjoyed my trip at the museum because:\n\n1) beautiful sculpture garden\n2) diverse collection of art\n3) superb highlights tour given by Linda (she had great interest and passion for the collection)\n4) nice cafe with reasonably priced food (given that it’s in a museum)\n",
  "Located in the heart of the city and easily accessible from I-64 and I-95, the VMFA offers a new experience every time we visit!  Whether it's taking in one of their world class visiting exhibits like Picasso or the incredible Faberge eggs, or walking through their limitless variety of permanent exhibits, you're in for a treat.  You can even take a break and enjoy a bite eat while you're there. There is no general admission charge, and you only pay a small charge for special limited engagement exhibits.  We have been members at VMFA for several years now, and I often think \"why did we wait so long to join\"?  I highly recommend you experience this \"Gem on the Boulevard in RVA\".  You won't regret it!",
  "A visit to the Virginia Museum of Fine Arts always reminds us how fortunate we are to have this asset in our community.  Over the Christmas holidays our family, ranging in years from 64 to 21, enjoyed an enriching afternoon at the VMFA viewing the fascinating present exhibition on the influence Edvard Munch (\"The Scream\")  had on the work of Jasper Johns: \"Love, loss and the Cycle of live\". No one in our clan is any kind of art expert, nor is that a requirement to be inspired by what we saw and the clear explanation of the story provided by the museum.  The exhibition runs until February 20.\nOn a more social plane, the VMFA also offers excellent dining selections, whether in the casual, yet efficient, Best Cafe, or in the more traditional Amuse Restaurant, a warm place to enjoy a glass of wine with companions.",
  "Came down to Richmond for a quick getaway for the wife. Primarily came to see the Terracotta Warrior exhibit (ends 3/11/18) but was impressed and surprised by the rest of the museum. Fabrege exhibit was another favorite of mine. Free to enter, special exhibits cost extra. Definitely worth a stop if you have a few hours to spare in Richmond.\n\nRestaurant and Cafe are nice. On weekends they do get busy, so plan ahead and snag a reservation. Or, do like we did and spot up at the bar. Full menu served at the bar. A seasonal menu that will be changing soon. Check it out!",
  "I am proud of my hometown museum. The collection is wide-ranging and the quality of the art on display is top notch.\n\nMany of the exhibitions are free; you may have to pay a considerable fee to view special exhibits but you can enjoy broad exhibitions of art from classic to pop. I have enjoyed the Fabergé collection since childhood and was sorry when it went on tour so am pleased to be reunited with some beloved and enchanting pieces (and may I put in a plug for the gift shop? GREAT pieces for good prices!)\n\nThe equine art collection is excellent if that is a genre that interests you.\n\nThe sculpture garden is especially pleasant in good weather. The piece \"Chloe\" is almost uncanny: I swear her expression changes as clouds pass and the sun comes out. \n\nSince I am a member, parking is free, but if you are from out of town and want to save a few $$ there is no lack of street parking within a few blocks.\n\nThere's free wifi and you can sit out in the sculpture garden to use it. Of course in these days and times security is an issue and I cannot advise on that point but it's fun to see folks using their devices while enjoying the pleasant landscape.\n\nYou can catch a bite in the cafeteria-style Best Café or treat yourself to a super meal in Amuse Cafe and enjoy the view of museum grounds from above while dining.\n\nThere are many free events from gallery lectures to the popular Thursday night Dominion Energy Jazz Cafe. In addition to the music there is fun light fare, thout the event is so popular be prepared for crowds. Check the calendar to plan your visit to this and any other event.",
  "Richmond has long been a destination for history geeks and genealogists. But \nwhat to do if you are the plus one? Drop your “other” at the Virginia Historical Society \nand head next door to the Virginia Museum of Fine Arts. The VMFA is an architectural   \ngem as well as home to a vast array of collections. From ancient classics to 21st Century \npop, the VMFA can provide visual presentations of almost any interest.\n\nAnd if you can schedule your trip in November of even years, the reward will be \nan inspiring show called “Fine Art and Flowers.” This event pairs specific pieces of art \nwith state garden clubs. The result is imaginative, inspiring and unbelievably fun. \n\nThe 60 pairings are scattered through out the museum, lending somewhat of a scavenger \nhunt feel to the event. Wear your walking shoes-it is a lot of territory to cover. If you attend on \nThursday or Friday nights, the trek can be aided by stops in the bar.  \n\nThe classic Italian Nativity scene, The Adoration of the Shepherds (1712) by Paolo \nde Matteis is interpreted with a single white rose glowing among concentric darkening flowers \nand foliage. The breath-taking result caused many visitors to sit in awe. The docents and security guards believed this was the most photographed presentation.\n\nMy favorite piece was the German Expressionist Ernst Kirchner’s Six Dancers (1911) \nfrom the Fischer Collection.  The raw brush strokes depicting six ballerinas with joining hands \nsomehow manages to convey the weightlessness of the dancers with the harshness of early\n                                                                                                                             \n20th Century Europe. The floral arrangement is of sticks mimicking the dancers’ legs while \nprecariously balancing pink mums, echoing the tutus in the painting. The flowers present a 3D \nsense of the unbalance that the painting creates.  \n\nMost fun is the “modern” art. For many people, including me, these works are very\n inaccessible. If it is titled White Square with Red Sphere, I see the flag of Japan (title and \nanalysis freely taken from Bosom Buddies). But put a floral arrangement next to one, and the \nentire piece becomes transformed.  \n\nCy Twombly’s Synopsis of a Battle (1968) appears to be a chalkboard with white chalk\n numbers, equations and lines. It reminds me of the visuals in A Beautiful Mind, and seems to be something seen in lots of classrooms. The floral representation is a black vase of a woman’s head with white lilies cascading out-somewhere between a large hat and Methuselah. Out of the flowers extend large sticks at aggressive angles. The two bring together the raw nature of war, the calculations of war and the goddess image of mythology. And in a rare understanding of the language of flowers, even I recognize the lilies to be a reference to death.\n\nFrom the obvious pairings (Georgia O’Keefe, any still-life) to American furniture, \ntapestries and screens, the Fine Art and Flowers Show is a delight that not only enhances the \nappreciation of the art, but also challenges the viewer to participate in wider analysis of what is \nseen. The VMFA is always worth the visit, flowers or not, because after all, it’s your art \nVirginia!",
  "Spent the afternoon walking around because we had no other plans. We were all surprised at how lovely this museum is. ",
  "Completely blown away. I felt guilty accepting the free admission to this incredible museum. The staff is friendly, the cafes are comfortable, and the galleries are nothing short of world class. Hopper, Matisse, Dali, O’Keefe, Rubens, on and on and on. This site is ranked #1 on TripAdvisor for a reason. My 13 year old daughter and I were stunned. Go!",
  "Great diverse exhibits. We enjoyed a special exhibit on hotel paintings and magazines.We also greatly enjoyed an exhibit of African artifacts and paintings, Egyptian artifacts and European Old masters.  ",
  "I was absolutely blown away by the size of the museum and the amount of items they had in display! I highly recommend it for anyone that's even just a little bit interested!",
  "The grounds house the 'Rumors of War' modern statue that is a response to the collection of confederate statues on Monument Row celebrating the southerners who lost the Civil War. Inside the museum is a standard collection of art that is well thought out and takes about 2 hours to see. Traveling exhibits round out the museum experience. "
 ]
},{
 "name": "Lewis Ginter Botanical Garden",
 "address": "1800 Lakeside Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/9d/2e/3c/a-million-blooms-runs.jpg",
 "tags": [
  "music",
  "kids",
  "walk",
  "walk",
  "music",
  "family",
  "delicious",
  "food",
  "walking",
  "knowledgeable",
  "cheap",
  "food",
  "family",
  "kids",
  "nature",
  "food",
  "walk",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d102958-Reviews-Lewis_Ginter_Botanical_Garden-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "OK, as a resident of Richmond, this is one of my favorite places to visit.  While there is an entrance fee, your donation opens to you a wonderful experience.   Japanese gardens, ever-changing blossoms throughout, walkways meandering through breath-taking floral displays, a kids area with a \"tree house\" that my adult kids and I love to visit overlooking a wonderful pond, a beautiful Conservatory with a butterfly exhibit that you can walk right into, and one of my favorites:  Flowers After Five in the summer . . . live music, dinner on the lawn, so much fun!",
  "Loved roaming around the gardens even though it was  hot hot hot!!! Shaded woodland garden, great hardscapes with gorgeous rock, beautiful ponds and fantastic children's garden area with the coolest tree house!",
  "I get a yearly membership pass to this botanical garden every year as a gift from my daughters. This is the best gift ever as it is used all year. I love to go to the garden in December for the Christmas lights and decorations, and there is always one night when you can bring your pooch for a small donation to the Spca to let your doggie in. The best part of the membership, for me, are the Thursday night music and food events held during the summer. Twice a month you can bring your dog in to enjoy the music with you. We get the dual membership which allows us to bring in one guest which is a nice way to bring in a family member. I love having lunch st the tea house which overlooks the Japanese gardens. I enjoy sitting outside for lunch and the prices are reasonable and they always have interesting and delicious items for vegetarians which is important to me because I get tired of just the usual pasta dish for vegetarian offerings.  I have eaten dinner at the tea house which is very special but pricey. I have eaten at the cafe in a quick pinch, but prefer the tea house. Always something new every year in the gardens to look forward to with new exhibits,and the butterfly exhibit is always worth a quick walk through. If you have children, the children's garden is worth the membership fee just so you can bring them there often to play.",
  "Comfortable shoes are a must;  you will do lots of walking.  And if you have pollen allergies, take a pill before you go!  But the flowers are wonderful and there are usually some knowledgeable gardeners working who are happy to answer questions.",
  "A few years ago, my wife \"dragged\" me to a Christmas lights show at Lewis Ginter, and the following year we became annual pass holders.\n\nThe regular social events are a great, cheap way to justify getting out of the house.  The pathways and walkways are well maintained and the flora is very well labeled.\n\nBe sure to check their calendar for weekly, monthly, and seasonal events.  You won't regret it!",
  "Lewis Ginter has long been a favorite with my family. Even if you think flowers are just \"nice\", you'll be surprised at how refreshing an hour or two spent here can be. The cafe has excellent, reasonably priced food and snacks, while there's a \"tea house\" for a slightly more restaurant feel. The gift shop is phenomenal! Don't miss the orchids and butterflies in the conservatory, and be sure and take the kids to the children's garden!",
  "a great experience, relaxing and a great place just to take a stroll and admire nature at its best or for a social event.",
  "We went to LGB Garden this past Christmas, which was fun because they had the Garden of Lights displays going on. One of the best things was the Tea Room, which has one of the best steaks around! Nice surprise!",
  "My girlfriend and I spent the afternoon in these beautiful gardens. There is a small cafeteria with a good food selection. We also visited the gift shop. Lewis Ginter also has various themed programs throughout the year. They have a butterfly program, spring flower, and Christmas programs. At Christmas you can walk through the park at night and it is beautifully lit up with thousands of lights.",
  "This is always a fun activity. The food is also excellent. I have never been to the Garden during the day but it must be very pretty!",
  "We went for the first time this year and really enjoyed it.  The lights and decorations were beautiful and we will most likely go again in the future!\nGetting to the garden, there was definitely a traffic bottleneck.  Once parked, the walk from the parking lot was not far from the ticket area.  They had several lines for ticket purchases and even though there were intimidating lines, I was thoroughly surprised how quickly the tickets purchase lines moved.  From there, you enter the gardens and go at your own pace.  We had 2 seniors in our group along with 2 young children (+ stroller).  All were able to walk around comfortably through the whole gardens, inside and outside.  There were decorations and lights that would appeal to all ages.  We spent about 2 hours to go through.  You could spend more time there but our group was done.   This was our first time to the gardens so we would like to return during the year to see the gardens without all the lights and decorations."
 ]
},{
 "name": "Virginia Capitol Building",
 "address": "9th & Grace Sts",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/76/4f/f7/virginia-capitol.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "free",
  "historic",
  "history",
  "tour",
  "free",
  "tour",
  "history",
  "walk",
  "tour",
  "art",
  "history",
  "tour",
  "tour",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d218814-Reviews-Virginia_Capitol_Building-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We didn't take a tour of the inside, however I wish we had.  It was later in the evening when we visited so we got to meet some politicians outside, one of which told my husband (who's from Ohio) what the state deal meant, which is beautifully incorporated into the design of the ground.  I was surprised at how large, beautiful, and how much thought/detail was put into the architectural design of our state's capital.  There is so much history in not just what goes on inside but also in the design of the building.  Highly recommend anyone who plans a visit to the Richmond area to definitely visit and be sure to go early enough to get a guided tour!",
  "The Capitol Tour is the best thing to do in Richmond.  The building is an amazing testament to the vision and skill of Thomas Jefferson, who designed it while serving as US Ambassador to France.  The wonderful tour guide, Martha, is knowledgeable, enthusiastic, helpful, witty, and charming.  She has an absolutely impeccable font of knowledge about the building and U.S. history and is eager to share her encyclopedic memory.  What a fun way to spend a few hours in Richmond.",
  "My wife and I haven't visited all of the state capitol buildings in the United States on our travels but we've seen more than 20 and, outside of the nation's capitol in Washington, D.C., I can't imagine any building and its surrounding grounds being more strikingly beautiful than the Virginia State Capitol in Richmond. Situated on top of a hill in the middle of Capitol Square overlooking the James River, the Virginia State Capitol building was designed by Thomas Jefferson and Charles Louis Clerisseau in France. Completed in 1788, it was the first Roman Revival building in America and the first American public building in the form of a classic temple with six massive Ionic white columns holding up the grand portico in the front. There is so much history here...two statues of George Washington, one inside and one outside, the chamber where Robert E. Lee accepted the leadership of the Confederate Army, statues of Patrick Henry, Thomas Jefferson, John Marshall, George Mason, Stonewall Jackson and Edgar Allan Poe and the Virginia Civil Rights Memorial. It was designated a National Historic Landmark in 1960 and a Virginia Landmark in 1968 and was added to the National Register of Historic Places in 1966. But perhaps the most extraordinary aspect of all happened in 2003 when the Virginia General Assembly approved $83.1 million for the renovation, restoration and expansion of the Capitol. The work was completed in 2007 with the most significant change being the construction of a 27,000-square-foot expansion beneath the hill on the south lawn. It provides for a visitor's entrance on Bank Street and an underground visitor's center where guided tours of the capitol building begin. Don't forget to stop at the Bell Tower at the corner of 9th Street and Bank Street in Capitol Square. Built in 1824-25, it is still used for ceremonial bell ringing but, most importantly, it how houses an outstanding visitor's center where tourists can obtain maps and pamphlets and information regarding tourism throughout Virginia. Capitol Square is located in downtown Richmond and is bounded by 9th, Capitol, Governor and Bank Streets. The Capitol is open free to all visitors Monday through Saturday from 8:30 to 5 and Sunday from 1 to 4. The Capitol Square Grounds, which also includes the Governor's Executive Mansion, are open daily from 7 a.m. to 11 p.m. The home where Robert E. Lee lived when he returned from Appomattox is a block away on Franklin Street. And the White House and Museum of the Confederacy is only a few blocks away.",
  "Take the tour it is worth it...especially since its free. The tour guides are amazing with their stories. The tour was very informative.",
  "You can sign up for a tour or walk around on your own. It's a wonderful piece of History but I highly recommend if you are in the area.",
  "What a surprise this tour was, so informative and even though there were protesters around the building and the Capitol was in session, we got a wonderful tour!  Highly recommend this tour!",
  "I have lived in Richmond area for 7 years and just thought the Capital was a lovely building of the state government. I finally went with some friends from my home state of California for the tour and it was amazing! I have been to over 40 historical places in Virginia so far and this was the best historical tour! Mrs. Snelling was our guide and she made history come alive! The art, the statues, the architecture; everything was beautiful! Virginia has a plethora of fascinating historical places to absorb but put the Capital tour on the top of that list!",
  "Tours are given hourly and we missed it, so did a self-guided tour until we caught up with the guide.  What a difference!  We are Virginians, but there is much American history to be learned/reviewed.  Free entrance and tour.  Parking sometimes a hassle - we used a garage a few blocks away."
 ]
},{
 "name": "Carytown",
 "address": "3166 W Cary St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/1b/e9/84/carytown.jpg",
 "tags": [
  "theatre",
  "eat",
  "brewery",
  "unique",
  "historic",
  "eat",
  "free",
  "walking",
  "delicious",
  "eat",
  "delicious",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d107159-Reviews-Carytown-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Cary State Park and Shop Center, more popularly known as Carytown, is an urban retail district lining Cary Street at the southern end of the Museum District in Richmond, Virginia. Built in the 1930s and opened for business in 1938, it was Richmond's first strip shopping center. It includes a mile-long stretch of over 230 shops, restaurants, galleries, boutiques and offices, many located in historical buildings. It also is home to Byrd Theatre, a restored movie palace that has operated continuously since 1928. \"Eat, shop and play,\" is Carytown's motto. Other say it is \"colorful, loud and fun.\"  What to do? Visitors are encouraged to (1) catch a movie at the Byrd, (2) try a famous restaurant, either New York Deli, which opened in 1928, or Can Can Brasserie, Richmond's best known French eatery, (3) satisfy your sweet tooth at Bakers Crust or Carytown Cupcakes or Sugar & Twine, (4) visit 300-acre Byrd Park, (5) stroll around Maymont Park, which is Richmond's answer to New York's Central Park, (6) enjoy the boutiques, either Clementine or Plan 9 Records or Urban Interiors or Ladies & Linen, (7) buy a book at BBGB Books and (8) have a beer at East Coast Provisions or The Daily or Garden Grove Brewery. Other popular destinations are Carytown Tobacco, Lex's of Carytown, Lou Lou Boutique, Cartwheels & Coffee, W. Hirsch Oriental Rugs, Belmont Butchery, Creme de la Creme, Ginger Thai Taste, Citizens Burger Bar and Bangles & Beads. Prepare to spend a day. It isn't Beverly Hills' Rodeo Drive. It more closely resembles Kansas City's Country Club Plaza. And that's a compliment.",
  "Carytown is now almost as equal an attraction as an area as is the historic Shockahoe Bottom.  There are many fine restaurants in Carytown, but it also has some unique botiques and shopping, as well as handy but mundane things like banks and grocery stores.  It is well lit, has a parking deck near the theater, and offers excellent French, Italian, Greek, Thai and others from Coffee shops to a wonderful NY style Deli.  My favorite places to eat are the Amour Bistro, and the Can Can Brasserie, which are even right across the street from each other. Their New Year's Eve and Watermelon street parties are becoming a Richmond tradition, and one that is welcomed by all. Go, plan to spend at least half a day, and more than half a dollar.....",
  "As noted by other reviewers, the descriptive word which rushes to mind for Carytown is \"eclectic\".  The several blocks of Carytown contain fabulous restaurants, cool cafes, delightfully dingy coffee shops, the world's greatest chocolate shop, tatoo parlors, ice cream shop, retro clothing stores, famous cupcake shop, an aromatic French bakery, bicycle shops, athletic stores, and a Richmond landmark: the Byrd theater for the cheapest movies in town in an old world setting.",
  "Carytown is a great walking area with lots of fun shops and delicious eateries! It can get crowded, especially on the weekends, so choose your timing wisely. There is lots of on street parking and free parking areas if you are not there at peak times.",
  "Even with the tattoo parlors and the beauty shops, there is still a lot of trendy shopping on Cary Street.  The Kitchen Shop is a great place to find hard-to-locate items and if you're into cooking, you will not want to miss it.  There's also a shop that sells herbs, spices, etc.--a little pricey but good for finding those difficult to locate spices.  There are a number of places to eat, pizza, Italian, coffee shopes, Thai, fine dining, etc.  It's a good place to take a leisurely stroll on a lazy morning or afternoon.  There is also an antique store and vintage clothing store.  Parking may be a little difficult, but you can generally find a parking space if you go there mid-morning.",
  "This trendy area of Richmond is full of small shops and delicious restaurants.  I love the paper store especially and also the store with all the French goods. Check for open hours as several places were closed on Easter Monday.",
  "Spent some time wandering around Carytown. Cute little shops and restaurants. Would come again as the shops were fun to browse. ",
  "This charming shopping district is worth a visit. We had dinner in a small sushi bar and wonderful ice cream in Kilwins. There is public parking in the side streets.",
  "I don't like shopping so maybe for a shopper this is a better time but for me I just didn't get it. It was weird collection of stores. It was fun to walk around until a ton of others show up and it was hard to walk on the sidewalks. Parking can be a ton  and of course you have to pay.",
  "Granted, it was spring break but it just wasn’t worth the effort. We were told that the point was to walk Cary Street and it was nothing special, kind of junky. Restaurants/bars mediocre. Maybe the residential is more interesting?",
  "An eclectic gem of stores and eateries near downtown Richmond. Many places to visit and walkable . Parking available for ow cost. "
 ]
},{
 "name": "Hollywood Cemetery",
 "address": "412 S Cherry at Albemarle St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/33/11/5f/hollywood-cemetery.jpg",
 "tags": [
  "tour",
  "tour",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d318453-Reviews-Hollywood_Cemetery-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "First let me say we didn't have time to do the whole tour but we drove around for 30 min and could've easily gotten lost but was able to find the 2 Presidents sites as well as the Confederate officers section and Jefferson Davis. It's just beside the James river and is so gorgeous!!!! I will be going back",
  "I didn’t take a tour but probably should have. The cemetery is very large, beautiful river views, several presidents, many Virginia governors, other notables, still a functioning family cemetery.",
  "Although I live outside Richmond on a farm and a house built circa 1790, I often drive into Richmond. On occasion, I head in early to insure I make my destination on time. Happily, if I find myself early, or my appointment ends early, I often head to Hollywood Cemetery to cool my heels, or center my mind. The cemetery itself is located in a quiet neighborhood and high on a bluff adjacent to the north bank of the James River. Those buried here represent the entire spectrum of Virginia families: many well above my pay grade, famous for their politics, philanthropy, industry and dedication to this cause, or that. Some sites hold several generations, other but one personage known to but a few, if any. Here to you will find the final resting place of Jefferson Davis, the last President of the Confederacy. The drive through takes you up one seemingly endless tree lined lane  to another, but always leading you back to the stone house at the main gate. Once again you are back to present day Richmond safe in the knowledge Hollywood Cemetery will be there for you to take a temporary rest among it’s many externals.",
  "huge cemetery with many historically important people and groups. You can drive around (and see everything this way), or walk around (it would take several hours to see everything). Another option is to drive to one of many small parking spots and walk around in that particular area. Beautiful views of the James river in the presidential area.",
  "I came to visit the graves of a few notable people like presidents Monroe and Tyler, and Civil War generals JEB Stuart and George Pickett. But I ended up staying for take in all of the gorgeous headstones. The cemetery also has a fantastic view of the river and downtown."
 ]
},{
 "name": "White House of the Confederacy",
 "address": "1201 E Clay St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/b0/5c/a1/white-house-of-the-confederacy.jpg",
 "tags": [
  "family",
  "history",
  "knowledgeable",
  "tour",
  "historic",
  "history",
  "organized",
  "family",
  "walk",
  "tour",
  "tour",
  "walking",
  "learn",
  "tour",
  "knowledgeable",
  "family",
  "history",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d108305-Reviews-White_House_of_the_Confederacy-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Highly recommend a visit here for any lover of American history. Our guide, Ana, was extremely knowledgeable about the Civil War era, as well as the Jefferson Davis family. She was also able to answer all of our questions. Felt as if we’d stepped back in time. \n",
  "It doesn't make sense to me but you can purchase a ticket to tour the White House of the Confederacy in Richmond, Virginia, then visit the adjacent Museum of the Confederacy. They are two separate attractions but TripAdvisor, for some unexplainable reason, has them grouped together for one review. Then, for another unexplainable reason, TripAdvisor allows for separate reviews on two other attractions that are operated by the White House and the Museum of the Confederacy--the American Civil War Center at Historic Tredegar Works in Richmond and the Museum of the Confederacy in Appomattox, Virginia, which opened in 2012. Go figure. Start with the White House of the Confederacy. Located at 12th and Clay Streets, it was built in 1818 in the Court End neighborhood and was the main executive residence of Jefferson Davis, the sole President of the Confederate States of America from August 1861 to April 1865. It was viewed as the Confederate States counterpart to U.S. President Abraham Lincoln's White House in Washington, DC. Since the late 19th century, it has been a house museum. It was designated a National Historic Landmark in 1960 and a Virginia Landmark in 1969 and added to the National Register of Historic Places in 1966. A guided tour of the mansion showcases Davis' second-floor office, many original furnishings and the railing on the east portico from which Davis' two-year-old son Joseph fell 15 feet to his death in the spring of 1864. Afterward, visit the adjacent Museum of the Confederacy or American Civil War Museum, which opened in 1896. It maintains a comprehensive collection of artifacts, manuscripts, photographs, Confederate books and pamphlets, 500 wartime battle flags, weapons, 15,000 documents and personal effects related to the Confederacy. Follow the history of the Civil War from Fort Sumter to Shiloh to Antietam to Vicksburg to Gettysburg to Chancellorsville to Appomattox. See items owned by Jefferson Davis, Robert E. Lee, Stonewall Jackson, Jeb Stuart and other prominent Confederate generals. The provisional Confederate Constitution and the Great Seal of the Confederacy are housed there. So is the anchor of the first ironclad warship, CSS Virginia or Merrimack, which fought the USS Monitor in the Battle of Hampton Roads in 1862. For historians, it's a treasure trove of artifacts and memories. For ordinary citizens, it's an education in an important chapter of our country's history.",
  "It's all there, well organized, thorough, beautifully restored, fascinating artifacts such as Robert E. Lee's personal campsite effects, Jeb Stuart's plumed hat and boots and spurs, historical information from Fort Sumter to Shiloh to Antietam to Chancellorsville to Vicksburg to Gettysburg to the Wilderness to Petersburg to Appomattox, everything you need to know about the Civil War, from the Confederacy's standpoint. Come to think of it, the Union doesn't have anything like it. It's the White House and Museum of the Confederacy at 12th and East Clay Streets in Richmond, Virginia, a few blocks north of the Virginia Capitol building. Start with a tour of Confederate President Jefferson Davis' White House with a very knowledgable guide. Built in 1818, it was Davis' executive residence from August, 1861 to April, 1865. Since the late 19th century, it has been a house museum that has been lovingly restored to its Civil War appearance. See the presidential entrance hall, Davis' office, the family rooms, where seven-year-old son Joseph died in the spring of 1864 after a 15-foot fall from the railing on the east portico, where Davis' personal secretary Colonel Burton Harrison lived and worked. When the City announced plans to demolish the building to make way for a more modern school building in 1890, the Confederate Memorial Literary Society was formed with the sole purpose of preserving the White House. After touring the White House, walk next door to the American Civil War Museum, formerly known as the Museum of the Confederacy, which was founded 25 years after Robert E. Lee's surrender at Appomattox. Opened in 1896 in the White House, the growing collection was moved in 1976 to a new building next door. Today, the three-story museum houses more than 15,000 documents, weapons and artifacts along with 500 original, wartime, Confederate battle flags along with personal items owned by Jefferson Davis, Robert E. Lee, Stonewall Jackson, Jeb Stuart, Joseph E. Johnston, John Bell Hood, Raphael Semmes, Wade Hampton and Lewis Armistead. Also on display is the anchor of the first ironclad warship, CSS Virginia. The museum also maintains a comprehensive collection of paintings, maps, manuscripts, books, pamphlets and photographs.",
  "This tour was a wonderful surprise, didn't know how beautiful the inside was, enjoyed walking around in here two different time, one with a tour guide.  I recommend that; learn ALOT.  loved standing next o the statue of Thomas Jefferson right where he stood... and oh the beauty  of  the dome on the inside; who knew??",
  "When we were on our way we thought we would only be there 30 minutes at most but then on the tour we were so engrossed by the stories and the artefacts that we ended up over an hour. Picked up a book on the life of Varina Davis by Charles Frazier from the gift on their recommendation and it was a great read. Will definitely become a movie. \nThe guides are super knowledgeable and helpful enjoy your tour",
  "When I'm asked by family back in Chicago why I retired in Virginia, the answer is easy, \"Because of all the original thirteen states, Virginia has more valuable history than any other. And, the history associated with the \"recent unpleasantness\" is best served here at the home of the Confederacy's only President Jefferson Davis.\"\n\nThe mansion is itself grand on all accounts: construction, layout, period furnishings and preservation. It's easy to slip back into the halcyon days of the Confederacy when President Davis worried over every aspect of the war surrounded by so many great Generals...Lee...Jackson...to recount but the creme de la creme of their number.  The museum, next door, holds a collection of memorabilia that entices my desire to possibly hide away so I can spend many more than the allotted hours  to sit and appreciate them. The staff is fantastic and makes one feel at home and not just a visitor.  Do stop in!",
  "Great tour of the Confederate White House. Worth a visit if you're a Civil War History buff, or enjoy history in general. There's a small store where you meet and purchase tour tickets, then the tour takes about 45 minutes. I think our tour guide's name was Morgan and she was extremely knowledgeable on the building and the Civil War in general. Great tour of the interior and an explanation of how the surrounding neighborhood looked originally and how it's changed since. Tour is worth it, gives you a perspective often overlooked. There are also some artifacts on display outside the building, one of these appeared to be a prop shaft from the CSS Merrimack (famous ironclad). The shop where you purchase the tour tickets also has bathrooms and some books and assorted items for sale. Easily reached on foot or via Uber.",
  "The home tour provided an insight to both the Davis family and the civil war.  Both were very interesting.  Our tour guide gave about a 45 minute tour of the home and answered all our questions.  The period furnishings were very interesting.  I only wish that we were able to tour the third floor."
 ]
},{
 "name": "Monument Avenue",
 "address": "Monument Avenue from Lombardy Street to North Thompson Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/3d/d3/e0/the-jefferson-davis-memorial.jpg",
 "tags": [
  "unique",
  "history",
  "history",
  "structure",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d278375-Reviews-Monument_Avenue-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "It was well worth the time to drive this avenue. The statues were very impressive. Please admire them for the time it took to tamke and the detail it went to creat them. Whether you are a interested in the Civil War, or not, the monuments are fantastic. . It's nice driving along the Avenue",
  "We got to hear about the history of this unique place of history and drive around each monument!!! The Confederate General's monuments are breathtaking!!! And the Arthur Ashe one is so gorgeous!!!!",
  "WOW, those monuments sure are awesome in person!  I didn’t realize how big they would be until we got there. My son and I drove to see them,and although we did not get out and explore, we did make numerous laps in the car to check them out.  It wasn’t busy at all on a Saturday afternoon and the general neighborhood is really nice to look at as well. I hope that these are not ever going to be removed. They are something to behold and an important reminder of Americans history.",
  "The Avenue consists of several monuments on most intersections. It's nice driving along the Avenue about 30mph and look at the monuments.",
  "Monument Avenue in Richmond is well worth the time it takes to go downtown and look over the monuments.  Whether you are a interested in the Civil War, or not, the monuments are fantastic and show a patriotism that we seldom see today.\n\nI understand fully that the men the monuments commemorate, except for Arthur Ashe, are from a bygone era and represent a time in our history that most don't want to remember or would rather eliminate.  But, the monuments are beautiful if only for their artistic value.\n\nI highly recommend that you go and make time for the monuments, and to go see the Virginia State Capital which is not too far away.  The Virginia Capital building is easily accessed using the underground tunnel from in front of the structure."
 ]
},{
 "name": "Science Museum of Virginia",
 "address": "2500 W Broad St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/c6/91/c2/science-museum-of-virginia.jpg",
 "tags": [
  "creative",
  "kids",
  "art",
  "kids",
  "free",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d279274-Reviews-Science_Museum_of_Virginia-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We always enjoy the exhibits and special presentations at the adjoining IMax theater. Most recently saw the Pompeii exhibit for Father's Day - just wish there was more!",
  "There was a large variety of activities including hands on activities, creative activities, a robotics workshop, and many others! My three boys (10,10, and 8) stayed without complaint for 4 hours! This is a great place for 2/3 graders and up. There seemed to be some things for younger kids (Curious George exhibit) but I’m not sure if there would be enough to keep the occupied long term! ",
  "We recently took our 7 year old granddaughter to this museum.  She had been to the Children's museum next door and we felt this museum would give her activities more suited to her age.  We were right.  There are a load of activities that will entertain older kids up to young teens.  She played for hours.\nThe first thing you notice about the museum is that it is a great repurposing of a beautiful train station.  The old Union Station building is a treat to see by itself.  Now it has numerous science activities and workshops, a café, a planetarium and numerous meeting rooms.  The three floors have activities from ecology to art to a cooking class and more.  The main hall houses activities ranging from a simulated hurricane room, to playing air hockey with a robot and a chance to physically race against various simulated animals.\n\nThe gift shop has a lot of science related gifts.  The planetarium has numerous shows and only adds $4 to the modest price of a ticket.  Parking is ample and free.\n\nGreat place to keep older kids entertained.",
  "I went with a big family.  Military discount is only for the member and not the family which was disappointing. The cost to visit was also expensive. The concessions were not fresh and do not have a lot of variety. \n\nAside from those things, the exhibits worked except for one which was labeled and they were interactive and interesting.",
  "Great museum with interactive displays throughout and lots to see. Set inside the previous Central train station, it's very open and easy to move about. Highly recommend seeing an Imax show. Lots of exhibits for everyone to see. The pendulum in the front lobby has been there for a long time and shows what time it is and monitors the rotation of the Earth, pretty fascinating to see. There are also trains on static display out back, even a photo of Elvis using the train station in it's heyday. Great museum worth a day trip.",
  "We have been here many times as it is perfect for a wide range of children and adults.  Offerings are always changing so it is always an option.  Was there with 3 grandchildren ranging from 10 6 recently.   On 6 year old wanted to play with wonderful construction items (wide and safe range of items) and build things in the FORGE area, but there was another grandfather with 2 children who had sequestered almost all the materials and space to build a large riding device.  This left several other children with odds-and-ends that were pretty much useless.  This can happen but what was sad was that three staff (looked to be in 20-30s) were sitting at a work table, on their computers, conversing with each other rather than paying attention to what was going on in the FORGE area.  This is not usual as the staff is normally very attentive, however this was so bad it is worth mentioning..",
  "Great fun. The racing was a  favorite for my 6 year old. Something for everyone.  Rat basketball so fun. The trainer was wonderful and welcoming. The Superpower dogs movie in the dome was special for all. Young woman selling snacks very polite and great smile.  Science Museum a definite must see - very hands on. Staff very nice. \nOnly complaint was they need more help in the cafe - only one staffer for awhile until another  finally showed up. Lost our order — ",
  "My wife eyes lit up and she said \"Pompeii? Sure, I'd love to go!\" And go she did. Though temporarily wheelchair bound, her excitement at things to see matches and exceeds mine at times and Pompeii-The Immortal City left no stone unturned. The displays, the effects of lighting, the gorgeous artifacts and descriptions, the awesome rich patina were all intertwined with the wisdom of the Roman Empire 2000+ years ago. The beginning and end were quite sobering as the first and last things to see were molds of the covered victims from the Mt. Vesuvius. AAA+++ exhibit."
 ]
},{
 "name": "St. John's Episcopal Church",
 "address": "2401 E Broad St Corner of E. Grace Street and 25th Street...facing E. Grace Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/57/23/27/st-john-s-episcopal-church.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "knowledgeable",
  "tour",
  "kids",
  "historic",
  "wander"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d318457-Reviews-St_John_s_Episcopal_Church-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Better known for Patrick Henry's famous speech, the tour guide gave a well informed presentation on the history of the church and how Richmond grew around the church. The church has seen a lot of history. Beautiful interior of the church and visitors are welcomed to come worship on Sunday.\n\nBest to call ahead or check their website as the the tour program does change with the season. They do have costumed tout guides and during the summer re-enactors. Also during certain holidays they have special events happening.\n\nThe church is not too hard to find, just get onto Broad Street and head east up the hill. Parking can be found on 25th, Grace and 24 Streets. Just pay attention to the street signs.",
  "I stopped here on a visit to the Richmond Area and took the guided tour. I learned so much about Patrick Henry and sooo much more about the events leading up to the American revolution. The guide was very knowledgeable and friendly. I highly recommend stopping here!",
  "Fantastic tour \nI got the chills when the guide showed us where Patrick Henry stood during his give me liberty speech\nWe toured the grave sites around the church after the tour\nThis church is very beautiful ",
  "Old Episcopal Church where Patrick Henry gave his inspired Give me liberty or give death speech.  Useful place to visit with kids learning about the American Revolution.",
  "Patrick Henry's \"Liberty or Death\" speech most definitely came alive during the reenactment of the Virginia revolutionary convention of 1775.\nThis lovely church, built in 1741 and a national historic landmark, still holds church services every Sunday.",
  "If you can arrange to visit on a re-enactment day it's well worth it.  If you can't, don't worry as the docents will make it a most interesting visit.  Due to the young ages of the children in our group she made it most intriguing for them by asking simple questions for them to look and find things as she gave more details for the adults.  Should be a \"must see\" if you come to visit the capitol of the Commonwealth of Virginia...",
  "Be sure to wander the graveyard and get the stories from the period-dressed gentleman. Poe's mother is buried here and there are many more interesting stories. Inside the church there is a lively lady to explain the events surrounding Patrick Henry's famous speech. My students, 11th graders, were very impressed.",
  "Not to be missed.  Excellent interpreters in period clothing. Parents, make sure your children know the important events that took place here."
 ]
},{
 "name": "Belle Isle",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/dd/9c/b6/belle-isle.jpg",
 "tags": [
  "hike",
  "history",
  "hike",
  "history",
  "walk",
  "history",
  "walk",
  "walk",
  "walking",
  "family",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d10067712-Reviews-Belle_Isle-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "How cool is a city with so much history and city fathers willing to make sure most all can experience it! This is a hike for you so a bad leg or in a wheel chair could be a problem but no impossible. The walkway over the James River is spectacular! I love to go park down there nice sunny days in Spring or Fall and have lunch I bought at Christopher's Street vendors. Go see it for yourself it is a great afternoon experience. Take a Picnic and please leave no trash. On warmer days bring a towel as you will want to get wet in the James!",
  "We walked along the river all morning with our friends and then made our way to Belle Isle. This was such a beautiful place to hike on through and the history behind it is interesting as well. There were some great views to be had. Make sure you're wearing good shoes, and don't be bothered by going a little \"off the path\" to explore.",
  "A really nice easy walk and easy access to view the river.  Nice and safe in the summer be careful in the winter as class 5 rapids can catch you of guard. ",
  "Belle Island is a great place to walk, ride, run or get away from the traffic of the city.  While the historical signage is in somewhat disrepair, it is still possible to get a sense of the history of the island.  The views of the river and city are spectacular.  There are several trails around the island.  The have lots of people on the weekend.",
  "A great outdoor recreation spot where you can go hiking, jogging, biking. They even have a simulated mountain bike trail. Could easily spend half a day here admiring all the old buildings. Worth checking out!",
  "This was a welcome breather from the bustling city of Richmond. Great place to get some fresh air and walk around. It's a little tricky to find the entrance, but well worth a visit!!",
  "Always enjoy visiting Hollywood rapid and the area around it! Also, the view from the bridge is exceptional, great for biking or walking!",
  "My husband is huge in family history and we went to Belle Isle in search of a monument and a deserted graveyard that is there.  We found both and it made him very happy!  It was a beautiful October day and there were many people riding bikes, walking with their dogs and children playing on the huge rock formations!  It is a beautiful place with a huge history!  \n"
 ]
},{
 "name": "Short Pump Mall",
 "address": "11800 W Broad St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/cc/63/b3/short-pump-mall-henrico.jpg",
 "tags": [
  "unique",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d6872163-Reviews-Short_Pump_Mall-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Interesting mall. I have been all over the world but this mall was...different. Granted, it was very cold outside but I did not find it very \"inviting\" or \"welcoming\". Maybe this is just a good example of the old saying that \"there is no accounting for taste\". Maybe it was just me. Not slurring the place; it was just...different. Was very clean and new looking. Lots of higher-end shops.",
  "Easily the best mall within a 75 mile radius of Richmond (no joke - no better till Virginia Beach or Stafford County). The mall is an open-air walkable complex that seems like it would be frigid in winter but is amazing and unique in the other seasons, of which Virginia spends the overwhelming bulk of the year in. The architecture of this place is incredible as a mix of Southern and Roman/Classical and really gives this place a comfortable, relaxed, elegant feel. The stores are plentiful and high quality and the common areas numerous. I noticed the common areas are also not carbon copies of one another but have a lot of unique designs and placements to them as well and often are in the form of courtyards. One thing to beware of - parking can be brutal and it can often be extremely crowded!",
  "I was surprised to find that there wasn't a single Foot Locker, Finish Line, Champs Sports, Adidas, or Nike shoe store there. The closet thing I could find was a Journeys, which must wasn't enough for me. The mall has a pretty good design to it however.",
  "Don’t like open air malls. Can’t go in one entry and shop unless limited shopping. Too spread out. Stores ok but drove to three separate parking so no backtracking. Food court lousy. Some restaurants ok. Easy to get confused on store locations. I like dinosaurs like enclosed malls. Mall is well decorated.",
  "If I don't want to cross tunnels & deal w/ lots of traffic, this is the closest Apple Store to Williamsburg.  Nice outdoor mall, it's clean and airy."
 ]
},{
 "name": "Edgar Allan Poe Museum",
 "address": "1914 E Main St # 16",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/6f/d4/e5/the-poe-museum.jpg",
 "tags": [
  "tour",
  "walking",
  "history",
  "structure",
  "walking",
  "library",
  "art",
  "tour",
  "family",
  "knowledgeable",
  "tour",
  "historic",
  "learn",
  "tour",
  "walking",
  "knowledgeable",
  "tour",
  "tour",
  "learn",
  "history",
  "kids",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d102747-Reviews-Edgar_Allan_Poe_Museum-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I’ve wanted to come here for years as we’ve passed it on trips up north. I’ve always been obsessed with Poe. I finally got the chance and I wasn’t disappointed. There’s tons of super cool artifacts and facts that tell the story of his life from childhood to death. There’s a little garden with a nice monument as well. They also have some black cats roaming around which was fun. There’s also a really nice gift shop with all kinds of Poe themed souvenirs (shirts, mugs, jewelry, DVDs, books, you name it). If you love Poe don’t miss it. I hope to be able to come back for some of the events they have like his birthday celebration!  ",
  "Highly recommend for those who follow our history and our literary geniuses. Opened in 1922, in The Old Stone House, the museum is only blocks away from Poe's first Richmond home and his first place of employment, the Southern Literary Messenger. Although Poe was not born here, he was raised here well into young adulthood after his mother's death. The tour is self guided and you can visit they website to download an audio tour as well. There are many artifacts within this museum from Poe's time. There are candelabras used when he wrote \"The Bells,\" as well as a writing desk. They have his boyhood bed, a walking stick, even a lock of his hair. You are not allowed to photograph inside the museum (although it is obvious some people break the rules). The Enchanted Garden are beautiful and you can see the 2 black cats roaming the property as well as a bust of Poe. There is a $6 fee to enter and discounts for students and seniors. They are open 10-5 Tuesday through Saturday and Sunday 11-5, closed on Mondays, The gift shop is nice as well and closes at 4:30. Being on Main Street, it is right on the way to or from St. John's Episcopal Church, where his mother is buried.",
  "What a splendid museum - well laid-out, informative descriptive signs, self-guided bliss.\nIt's situated in a run-down, but gradually up and coming, part of town - the delightfully named Shockoe Bottom, an Algonquian indian name.\nVisiting from England, where we're spoilt for museums, it would be easy to sound patronising about this little gem. But it really is a joy to look around.\nInterestingly, the building has absolutely nothing to do with Poe himself; it's just a handy old structure which has been preserved and therefore appropriated for its current purpose. It's the oldest surviving house from Richmond's original city limits, dating back to 1754.\nThere are numerous Poe houses dotted around the States - places he stayed in or lived in during his all-too-short life, but this is the only museum, and it's packed with memorabilia from his life, including his bed, a coffin you can pose standing up in, and various items of clothing and literature.\nThere's even a tiny library where you can sit and read a Poe short story.\nThe $8 entry fee also entitles you to meet two black cats who live here.\nSome of the objects stretch things a little. A piano which belonged to his sister, for instance. His soup ladle? A key to his trunk? A pair of socks?\nThe staircase is Poe's; salvaged from a house of his that was being demolished.\nAs we were walking round the small but intimate grounds linking the two or three buildings on the site, one of the black cats grabbed a butterfly that was sunning itself on the ground. We clapped our hands and the cat, distracted, dropped it. It flew off.\nIt somehow seemed appropriate.",
  "My wife and I have read a couple Poe poems but are far from being \"fan boys\". We found the museum to be neat and informative. Lots of artifacts from Poe and others in his life. \n\nLimited parking both in lot and street but worth the effort. No photos allowed in any of the 5 buildings but you can take pics in the garden. A lot of info covering his 40 years on earth. \n\nOnly $6 per adult. They offer discounts for veterans, students, teachers and military. Bus drivers have to pay full price😒! Caution very low ceilings if your more then 6ft duck! Building 2 going up the stairs is a doozy!!! \n\nBe sure to pet the black cats named Pluto and Edgar. ",
  "We stopped at the Poe Museum on a Saturday in February, as two of our family members are fans of the author's works. The parking is minimal, but if you can't fit in the small lot which holds about 8 cars, there is on-the-street parking during the weekend. You can take a self-guided tour, or join one of the guided tours, which we did. The tour guide was a young lady who was extremely knowledgeable about the life and works of Edgar Allen Poe. The museum is scattered through four separate buildings, connected by a garden which is probably lovely in the summer, and is frequented by two black cats, who live in the museum facilities. One of the buildings has exhibits on the second floor, which are accessed by very steep stairs, and with little headroom, but the other exhibits are fairly accessible. Some of the items the museum has on display are Poe's chair from his job at a publishing house, his cane, some of his clothes, and his trunk. As a non-fan of this author's work, I still enjoyed the tour, the well-displayed and marked exhibits, and especially the tour guide. There's a tiny gift shop as you enter the museum, full of many different items ranging from art prints to stuffed animals to mugs, etc. It was definitely worth a visit, and the admission price was quite reasonable, only $6.00 each.",
  "A very neat little, quick historic spot.  You learn a lot about Poe.  It does require a lot of reading as it's not a guided tour.",
  "My daughter's instructor in college made Edgar Allan Poe come alive (so thankful for great teachers) so we decided to visit the Poe Museum on a beautiful day!  We scheduled our visit around the guided tour schedule and I am glad we did!  Our tour guide was amazing and so knowledgeable.  It was fun to ask random questions and get the answers!  Having said that, if you already have a decent knowledge of Poe, I feel certain the self-guided tour will work well for you.  As an aside to this review, we walked to Station 2 for lunch and were very pleased with our meal.  We were also easily within walking distance to access the Canal sidewalk.  What a fun girls' day!",
  "We were going to go to the Poe Museum as soon as we saw it, because I've always been a fan of his work. However, I did not expect for them to have so many of Poe's possessions! That was really awesome to see! They have his childhood bed and staircase from the home he grew up in before it was demolished! I won't tell you everything, because you really need to go for yourself! It's really fantastic and they have some of the best greeters when your tour starts! ;) Definitely a must-see for Richmond!  ",
  "The tour guides are great. Pay for the tour you will learn alot about Poe. Didnt even know he spent most of his life here at Richmond. Always thought it was Baltimore.  The displays were very well done. Parking is the only downside.",
  "It’s a little fun filled educational museum with the history of Edgar Allan Poe. It will take a couple of hours. My kids found it interesting also. ",
  "A must visit for Poe and macabre story fans. It houses a stellar collection from this former Richmond citizen. The cats on the property are a nice touch. The staff are friendly and knowledgeable. Parking is at a premium fyi"
 ]
},{
 "name": "Virginia Museum of History & Culture",
 "address": "428 N Boulevard",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/26/f3/b3/the-virginia-museum-of.jpg",
 "tags": [
  "free",
  "affordable",
  "history",
  "art",
  "history",
  "free",
  "wander",
  "free",
  "history",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d102960-Reviews-Virginia_Museum_of_History_Culture-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Truly interesting permanent and changing exhibits.  Attractive and affordable (free parking, pay-what-you-will admission).  Landscapes of Virginia is a wonderful treat of Virginia geography and visual arts.  Current special exhibit re: Hamilton and his Virginia \"frenemies.\"  Outstanding special exhibit re: African American history and struggle in Virginia up now through February -- quite touching, well-contextualized.  Gift shop has a nice selection of books and gifts featuring legendary Virginia department stores.  Walkable to Virginia Museum of Fine Arts.",
  "I went to the museum this past weekend to have something to do on a rainy day.  As a native Richmonder, I'm ashamed to say this was my first visit.  I've always wondered what was in this building whenever I go to the art museum across the street.  Don't miss out on this museum!  It was absolutely fantastic.  We went for the WWI exhibit but loved everything.  My eight-year-old daughter spent the full 2 hours we were there actually reading the information and loved the interactive exhibits-especially the \"you be the judge in 1917\" discussing the treason cases during the war and the underground railroad choose-you-own-adventure style exhibit in the Virginia History hall.  There was so much to do and see-I can't believe it took me so long to check this out and I can see myself going back.  FYI-there is free parking in the lot directly behind the museum-the paid parking deck is for the next door art museum.",
  "I love state museums, and this one is one of the best.  Wonderful exits with a good core and often changing exhibits.  Good combination of artifact and interpretation, a superb gift shop, and wonderful staff.  It shares a parking garage with the Virginia Museum of Fine Arts and the fact that you can visit both on the same day is just incredible.  I'm not a big fan of the room of big paintings glorifying confederate leaders but it's a small part of the museum.  If short on time choose this over the Civil War museum at Tredegar.",
  "We ended up visiting here as a rainy day activity and it exceeded our expectations. We spent 2 hours here before being ushered out at 5 pm.(The guards were trailing us as it got close to 5 to make sure we were headed out).\n\nThe Story of Virginia exhibit in Rooms 7 and 8  was excellent and we took our time here. The Memorial Military Murals are not to be missed. Founding Frenemies exhibit was in final preparation for October 19 opening so we were allowed to wander through by the workmen, which led to Landscapes of Diversity.\n\nThe Determined: The 400 year Struggle for Black Equality was excellent to the extent we were able to spend some time there...but we did not finish since close to closing.\n\nParking is free and we were able to park our 23 ft RV in 2 spaces since not crowded\n\nBTW, we did pay the full requested donation on the way out - great value.",
  "This museum has an excellent timeline display of the history of Virginia. The room of civil war murals is interesting. So much history here starting with the first settlement up to the present.",
  "This museum was delightful. They have free parking and a suggested entrance fee (I paid the full $10). The exhibits are like a snapshot of the overall US History but more detailed. I really liked all the artifacts they had including some from the founding fathers. The weapons exhibit was also very cool as was the silver room. The one room that really caught my attention was the restored murals from the oldest part of the museum. The one of Lee and his generals was my favorite as they all looked just like their photos.  ",
  "We’ve lived in Richmond since 1985. This was our first visit. It is exhaustive and quite the entertainment for an afternoon or even a day, with a break for lunch. Lots of standing. We’re seniors... The story of 400 years of the African-American experience in Virginia is very impressive. Highly recommended. ",
  "This museum has good temporary exhibits as well as the permanent collection.  It is certainly worth a visit while in Richmond."
 ]
},{
 "name": "Virginia Capital Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/ee/0d/b1/signage-is-provided-for.jpg",
 "tags": [
  "walking",
  "walk",
  "walking",
  "tasting",
  "walk",
  "delicious",
  "winery",
  "food",
  "winery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d10121857-Reviews-Virginia_Capital_Trail-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a decent trail, it’s all paved from Jamestown Settlement to downtown Richmond and about 52 miles long.  The mileage markers are nice and perfectly set in place.  There are plenty of bridges, which are very nicely maintained and the trail as a whole is well-maintained.  The issue I have is that there are poor markings where you need them… Such as the start of the trail from the parking lot, I didn’t see any signs advising which trail was the start of this trail.  Also, in Charles City County, near the courthouse, the trail seems to turn into a sidewalk and then you end up in a parking lot.  I had to use a phone app to find out to follow the road through that town to get back out onto the trail on Rt5.  If there was a turn I missed prior, they did a very poor job with signage advising of this.  Also, once this happens, there’s poor signage to get you back onto the trail.  \nAnother sign issue would be the many signs they have along the route telling you how far to the next set of attractions… the font is too small to read as you’re riding a bike up to, without having to stop.  They need to make these signs much bigger.  It might be fine for those who are walking, thus going slow enough to read it without stopping as they walk by.  \nRestrooms are portable jons and are poorly managed as well. \nAgain, the trail as a whole is relatively flat and rather easy to ride and the folks along the way were friendly enough to wave me on rather than making me stop to let cars cross, thus allowing me to keep my momentum, which was really nice.  Definitely a “must do” for those who ride mountain or road bikes!",
  "My Girlfriend and I drove to Jamestown settlement parking lot and left our car their overnight.  Rode the trail from their to Richmond and spent the night in a hotel near the end of the trail in the old section of the city. The next morning we pedaled the 52 miles back to Jamestown.  Although there wasn't alot to see and do along side the trail, it was a pleasant and a fairly easy ride and one that we will do again.",
  "This trail was disappointing because it runs along Hwy 5. The trail itself was well paved, mostly flat, tree lined and safely off the hwy. We \nrode from Chickahominy Park ( near Williamsburg) to Charles City and back about 26 miles round trip. We enjoyed riding on a sunny fall day but the noise from cars and trucks was annoying. It’s a good ride if you’re in the area but I’m glad it wasn’t our main destination. ",
  "We had been wanting to check out the trail for a while, so finally committed to a beautiful fall day. We drove down from DC (less than two hours) starting around 7 am. Our parking destination was Dorey Park, which has tons of fields/activities/events and parking options. From there, we biked to the trail head, which is around mile marker 43 or so. The trail condition was fantastic - smooth pavement, some nice wooden bridges, rolling past forest areas, the VCU Rice River Center, bales of cotton, and a couple of plantations (well... plantation signs). Our goal was an out-and-back for a total of about 40 miles, with a turnaround destination at the Indian Head Tavern around mile marker 23, where we hoped to stop for lunch. Lucky for us, right as we started looking for the Tavern, they were putting out the Open signs, so we turned right in for lunch. It's a nice little tavern with both indoor and outdoor seating, super friendly service and delicious food (we don't usually have fried food, but indulged in some fried pickles and they were awesome). During lunch we scouted out the Upper Shirley Winery and Plantation, which was about 10 miles away en route back to Dorey Park (really about 8.5 miles on the trail, plus a mile down the road to the plantation). It was also lovely, with a huge building sporting wide front and back verandas (this is a big wedding venue), but also a wide expanse of patio and picnicking grass areas in the back, with some nice outdoor lounge furniture, fire pits, and a trailer camper from which they sold their wines by the glass or bottle and a pre-packed picnic basket. We stopped in for some wine and to listen to the jazz trio. We did feel a little awkward walking through the actual building in our bike jerseys - it felt so elegant that we almost turned around to leave, but finally found the \"backyard\". If you are in bike gear, might be better to just walk around the sides of the building directly to the yard (unless you want to do a wine tasting, which is in the main building). After about an hour here, we got back on the bikes for the last 12 miles back to the car, where we arrived around 2:45 pm. We did opt to stay overnight at one of the airport hotels, but drove the short distance into Richmond for dinner at the Boathouse in Rocketts Landing, which was another nice experience; however, we certainly could have just as easily driven back to DC in time for dinner. I highly recommend checking out this trail and making a lovely day of it! Visit those local businesses too - they made the experience special.\n\nWho we are: two age 50+ people who love bike tours, reasonably fit\nTemperatures on the day we rode: started in the low 50s in the morning, but rising to the 70s in the afternoon. Recommend layers for the ride, including gloves.",
  "Relocated to RVA and am trying to try all the local fun. Age 42 - relatively fit but haven’t ridden a bike in probably 25-30 years. For some reason I went in over confident that I could ride 20 miles to the winery and back on my first try. :-)\n\nRented a bike at The Kickstand ... and made it a whopping 5 miles before turning around. 10 miles total. The way out of Richmond is super hilly (IMHO). Very challenging. It was a beautiful fall day but I was struggling. The way back was much better and I was grinning like a school kid on the stretch from 7-11 back to the Kickstand. Also, I have no idea how bike gears work which probably didn’t help.\n\nI struggled but totally enjoyed it and can’t wait to try again to get to the winery!"
 ]
},{
 "name": "Virginia Holocaust Museum",
 "address": "2000 E Cary St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/ad/76/76/wow-10x-better-than-dc.jpg",
 "tags": [
  "art",
  "family",
  "free",
  "free",
  "learn",
  "learn",
  "wander",
  "field",
  "free",
  "tour",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d213659-Reviews-Virginia_Holocaust_Museum-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I visited with my family this past summer. It's something I think everyone should do once...I probably would not want to go back, it's really hard to take in. It's so well done and I really liked the beginning with the rise of the Nazi party, and how that happened in a western democracy.  The forces that came together can happen again and it makes you think about how far we have come (and not come) and at least we can look at this and hope to never ever repeat anything about it.  The museum takes you through the life of one family in particular and what they went through. It also highlights resistance and how people came together for good.  If I go back with out of town guests, which I would do, I'd just stay on the main hall and look at the wonderful art of area students that is on display there, art that is about positive themes of healing and love.  The museum is also free (they take donations) and there is a train car outside which makes it even more real. I like how it is smaller than the museum in DC. It is just as educational and powerful as the larger museum in DC.   The people at the front desk are very friendly and welcoming and while it's a really difficult place to experience in a lot of ways, it's very worthwhile and well put together.   Parking is pretty easily available too.",
  "Wasn't expecting much given the plain exterior,  but I was really blown away by this museum.   It tells a comprehensive story of the Nazi persecution of Jews and others, from the earliest rise of Hitler to the post WWII period.  It has a strong local element, provided through recorded stories of survivors who later emigrated to the US and settled in Richmond.  Numerous maps showing routes of transport and locations of ghettos and camps are very well done. and accompanied by supporting statistics.  Especially poignant is the story of the persecution in Lithuania.  There are images and stories of Christians who risked their lives to rescue Jews, as well as documentation of the cynical political decisions that led some refugees to be sent back, to be swallowed up by the death camps.  It is profoundly moving and speaks eloquently to our own time.  I have been to the holocaust museum in Berlin and Yad Vashem in Israel -- this affected me more than either.",
  "My children actually took me here for the first time about 12 years ago (my daughter was 16 and my son was 10).  They had went with a friend and continued to visit on there own in the summer while I was working.  I couldn't believe that they actually enjoyed it so much that they wanted to share it with me.  \nIts a very authentic museum, the tours are not guided but there is plenty of information at each exhibit showing how Jewish people had to live & hide. They also have lots of pictures of survivors and story's that mostly have been provided by people throughout the area .  There is no admittance charge but they do accept donations.",
  "I went to a school that did not teach about the Holocaust or slavery.  I am really happy to have museums like the Virginia Holocaust Museum where I can go and learn about the things that were not included in my school’s curriculum.  The museum is free to enter but they accept donations for the upkeep and general maintenance.  If you like to read the displays and take it all in, you will want to have an hour or two to be able to see the whole museum.  They also have a great bookshop and when we visited, they had some exceptional student artwork displayed.  It is so nice to see that it is being taught in other schools.",
  "Didn’t expect it to be as big as it was. It was really cool and you learn a lot of stuff. Expect to spend quite a while there if you actually wanna go through it all. Would definitely recommend going. We’ll go again!",
  "Visited with my teen granddaughters and husband. Reading about the Holocaust in school and actually see the exhibits, is so powerful. The video is an excellent way to start the self-guided tour. We were especially impressed with the Trial room.This is a neighborhood where you can visit Saint John's Church where Patrick Henry gave his \"Give me liberty\" speech. Wander the cemetery and tour the church. Then, a few blocks down on Main, visit the E A Poe Museum. Hungry? Three blocks toward the rail yards, you will find the best pizza ever - Bottoms Up. Take home some macaroons from Whisk bakery, also on Main. Great Field Trip for High Scool. Admission is free",
  "I did not realize this museum would be so powerful.  The Holocaust Museum in D.C. is only 90 minutes away but this institute can hold its own.  Covers a lot of material often overlooked in other displays such as the Baltics and other camps.   Traces the story from the rise of Hitler right to Israel.  A must see",
  "Sobering museum about the Holocaust. Free but does take donations. It is well laid out and easy flow from exhibit to exhibit. Lots of pictures and reading but excellent visual exhibits along the way. "
 ]
},{
 "name": "James River",
 "address": "22nd Street and Riverside Drive James River Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/7c/bd/3f/james-river-under-the.jpg",
 "tags": [
  "walk",
  "free",
  "family",
  "walking",
  "walk",
  "hike",
  "hike",
  "tour",
  "history",
  "walk",
  "walk",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d107160-Reviews-James_River-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I walked across the Potterfield Memorial Bridge on a sunny afternoon and thoroughly enjoyed it.  Found by accident, but clearly the locals love it, and I took ages to meander across, taking pictures of the glorious city skyline, the kayakers, the boarders on the water, the rapids and the greenery.  Stunningly beautiful scenery which seems to be sensitively maintained from an ecological point of view, and well worth a visit.  Thank you!",
  "This is a must see/do activity whilst in Richmond the views are beautiful. The walk along the river is fabulous. We saw Herons, turtles, a groundhog amongst other wildlife. Great being able to walk across the bridges to Browns Island and Belle Isle. Both of these are worth a visit especially Belle Isle with its Civil war historical connection. Don’t miss it. ",
  "If you're in Richmond, VA and looking for a free and enjoyable way to spend your time, visiting the James River should be #1 on your list!\n\nThe James River is a picturesque river that runs right through the heart of downtown Richmond. On any giving day you can find people wading, fishing, rafting, kayaking, walking the trails, or just relaxing on the boulders along the riverbank - the perfect way to end a day after exploring Richmond!\n\nThe River Walk along the James has been renovated and makes for a great place for a scroll or just enjoying the scenic views. \n\nBelle Isle is another favorite hangout spot along the James that can be reached via a suspension footbridge or by boulder hopping! Bikes are allowed across the bridge which leads to the many well maintained trails available to the public. \n\nA trip to the James River makes for a great family outing, date, day out with friends, or for a solo walk or jog. \n\nKeep in mind parking is limited and may be hard to find on a busy day; but if you're willing and able to walk, you will be able to find parking along the trail.",
  "Richmond lies on the Fall Line. That not only made it an important center for commerce in Virginia but it continues to make it a great urban kayaking. But if you're not a professional, have a great ride or hike on the many trails on both sides of the James River or the Islands in between. There are pedestrian bridges that provide a rapids-view of the River and prominent but accessible ruins. Don't ignore the River on a visit here because it is a great cool and refreshing escape from summer heat and provides miles of exploration all the way to some of the cities famous sites including Hollywood Cemetery.",
  "You'll be amazed at all the things there are to do and see on the James River. I've mainly spent my time along Tredegar Street and after several trips I have yet to see and do all there is. While you are there, take a hike over to Belle Isle and visit the Tredegar Iron Works. Don't forget to bring your camera and pack a picnic. ",
  "Richmond is one of the few cities in this country where you can experience class 1 through V - VI whitewater in an urban setting.  Summer is great for lazy rafting, spring and fall are more challenging!",
  "There is a lot you can do on the river. You can take tour on the river. You can walk along the river which is very nice walk.  The history part is Enslaved Africans were brought to the shores of the James River 400 years ago.",
  "The river has many access points. Some require a short climb or the use of a fixed ladder so beware. The walk on the pipe is the best; it's at the water's edge and is shaded in the summer. If you are looking for the heron rookery you need to be on the pipe for the best views. There are also several pedestrian bridges over the river from the downtown area - all are in good shape. ",
  "Water a pretty area.   Brought a colleague from Philadelphia to see Richmond.  He was really impressed with downtown and the River area.",
  "Enslaved Africans were brought to the shores of the James River 400 years ago. America should never forget this history and should learn that it was a time that America must heal from - even today.",
  "I walked across the Potterfield Memorial Bridge on a sunny afternoon and thoroughly enjoyed it.  Found by accident, but clearly the locals love it, and I took ages to meander across, taking pictures of the glorious city skyline, the kayakers, the boarders on the water, the rapids and the greenery.  Stunningly beautiful scenery which seems to be sensitively maintained from an ecological point of view, and well worth a visit.  Thank you!"
 ]
},{
 "name": "Canal Walk",
 "address": "12th & Canal Sts",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/0a/b8/29/canal-walk.jpg",
 "tags": [
  "walking",
  "walk",
  "walk",
  "walk",
  "art",
  "tasting",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d258529-Reviews-Canal_Walk-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Richmond has done a good job of cleaning up certain parts of their city. This is one that is done very well. It is very pleasant walking along the canal. Ther are many locations where you can walk on the path. Also after the walk there are very good restaurants that you can go to.",
  "Good after the Civil War Museum (Tredegar) - right next to it.  Also do the bridge walk (same place).",
  "We visited several outdoor attractions including this Canal Walk from the Great Shiplock Park to Belle Isle.  The middle section is too urban for me, but if you are biking you will get through that section quickly.  The best section is near Shiplock and then from the Pipeline overlook to Belle Isle.  Be sure to cross the pedestrian bridge west of Tredegar Ironworks to Belle Isle and walk those trails (or bike them). We did not have time to \"do\" Belle Isle this time, but have done so a couple of years ago. Look on a map on your phone for parking areas. There are garages, but street parking can be iffy.",
  "We visited on the second Fri of the month and not only did we get to see wonderful art, but there was Wine tasting. We had a lovely visit.",
  "Very pleasant walking the paved path along the canal. The location is very convenient to the pedestrian bridge to Brown's Island and over the James River, the Tredegar Iron Works, Civil War Museum and restaurants."
 ]
},{
 "name": "Agecroft Hall & Gardens",
 "address": "4305 Sulgrave Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/78/4d/7f/agecroft-hall.jpg",
 "tags": [
  "historic",
  "history",
  "art",
  "tour",
  "tour",
  "unique",
  "family",
  "tour",
  "history",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d318451-Reviews-Agecroft_Hall_Gardens-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I am not sure what I was expecting when I decided to visit Agecroft but I was stunned when I arrived. This house is amazing. It is a third of the original Agecroft that was built in England and had a five hundred plus history there before it was purchased by TC Williams and shipped to the states. The gardens were a little sorry but it is still winter so I could let it go. The staff was super helpful and the lady who turned out to be my guide showed me to the special exhibit and opened the gift shop for me. The house itself was fascinating with interesting history so different than you find in most US historic homes. It is a must if you are in Richmond. ",
  "Gorgeous Elizabethan garden, perfect view of the James River, this Tudor mansion, purchased by Mr. and Mrs. TC Williams in the early 20th century, dismantled and shipped to Richmond from England for reassembly overlooking the River - this is the place to visit for a step back in time.  Don't miss Shakespeare Under the Stars each summer - wonderful venue to hear and see tragedies and comedies by everyone's favorite Bard.",
  "It is surprising and stunning to visit Agecroft Hall. From its beginnings to its journey across the ocean to its spendor where it stands today, the manor is a testament to those who have the vision of the meaningful -- and the means to make it a reality. Stephen was our tour guide, and his exceptional knowledge, his obvious love of hstory and art and his warm personality are as much an asset to Agecroft as Agecroft is to Richmond and the world.",
  "What a gorgeous house - all the rich woodwork and the plaster ceilings are incredible. They have a lot of really unique pieces from the time period when the house was built. The tour was interesting and full of little tidbits that tie our world today all the way back to life in England 600 years ago. Well worth a visit.",
  "Thankful to the wealthy family who spent so much money diagramming the original layout and then moving about 30% of the house from England to Richmond, Virginia.  A must if you want to see what 15th century wealthy English society lived like and how affluent they were.",
  "The house looks very nice and has some history. Unfortunately, the tour guide for the tour that I went on did not seem to know their history. (For example, using \"servant\" and \"peasant\" interchangeably, saying that the windows were big to show off wealth because of the window tax while also giving a date for them well before the start of the window tax, etc.) The tour also discussed the house as if it were all built at the same time and reconstructed without any changes.\nI don't regret going, but don't rely on accuracy of the tour. I can't really review the gardens fairly because they looked very nice for February, that doesn't say much. It may be that other tours are much better -- it could have been fascinating with someone who knew what they were talking about.",
  "A great story about how this very old building came across an ocean to Richmond, wonderful museum -- do the tour of the home (anytime) and gardens (if it's growing season), Shakespeare in the summer, programs (like a 1600s English witch trial) throughout the year -- all well worth your visit.",
  "We went for the Lutes, Flutes and Singing Strings focus tour.  The entrances were dark as well as the grounds and the house.  If it weren't for a man with a waving flashlight outside we would not have known where to go.  Once inside we were told we were in for a treat. That's not what we got.  We got a 3 room tour in the dark.  There was an emergency light in one room and a very dim candlelight in another. For a tour that is supposed to be showing off old instruments it was seriously lacking.  We couldn't see the instruments or the photos that were passed around in the dark.  Save your money.  Go during the day."
 ]
},{
 "name": "American Civil War Museum- Historic Tredegar",
 "address": "500 Tredegar St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/df/5a/1f/american-civil-war-museum.jpg",
 "tags": [
  "free",
  "history",
  "historic",
  "walking",
  "history",
  "walk",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d209605-Reviews-American_Civil_War_Museum_Historic_Tredegar-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Tells the story from all sides of the Civil War, Home Front, Battle Front, Northern, Southern, Free Blacks and Slaves. Excellent interactive displays of information about battles and events.   A must see for history buffs.  There is a Ranger Station next door for information on other Civil Wars sites.",
  "With new stories from soldiers (both North & South), families (men & women), and African-Americans, this museum provides a balanced perspective in innovative ways. We all (ages 9 to 76) enjoyed this museum, and learned some new things. We shall return.",
  "Anyone who has any level of interest in the antebellum and \"bellum\" history of the U.S. During the mid-19th century has to visit this wonderful museum! It's main location is within the gorgeous Tredegar Iron Works building, the leading producer of munitions during the Civil War, overlooking the beautiful James River and Shockoe Valley within blocks of Richmond's Capitol Square and in a building next door to the magnificent White Hiuse of the Confederacy, and it is part of a series of historic sites (well-preserved battlefields) spread across Richmond and Petersburg. Even if you couldn't care less about the Civil War, the visual beauty of the building (and the associated battlefields) is worth your time and the trip. The actual museum has scores of interesting and well-researched artifacts and items from the war, and provides extensive information on what they are, what they mean and what they represent. You can spend a relaxing 1-2 hours touring the two buildings and walking the grounds, or several days diving into the full range of artifacts and exhibits, and touring the key battle sites (and nearby military hospital museum). Regardless, this center is worthwhile of a trip by any American and worth traveling a good distance to see and experience. It is as meaningful and as interesting as a trip to Gettysburg or the nearby Pamplin Historic Park (Breakthrough Battle of 4/2/65). ",
  "Well worth the time and expense ($14/senior).\n\nThe Museum has excellent exhibits and curation. It covers the War from a variety of perspectives of the people involved in the conflict in whatever capacity.  We spent almost 3 hours here, lingering with the exhibits since it was a rainy day.\n\nWe also went upstairs to check out the Greenback America  money exhibit but did not stay long.",
  "This is still a growing museum but the start shows it is going to be high quality \nThe experience and artefacts give a feeling for the civil war time and the walk along the river was informative reading the sign posts. Locals we met were very happy to point us in the right direction and tell us about great places in Richmond. They are rightly proud of their city ",
  "Just left this mini-museum. Only 2 rooms and a very short video. The few people visiting with us agreed that it is very incomplete and overpriced. Has great potential but definitely not there yet. I would not recommend at this time ",
  "Great exhibits and displays in this museum. It the chronological timeline on the Civil War takes you through a very thorough, unbiased exhibit on what happened with videos, sights and sounds. Spent alot of time reviewing every placard and taking it all in. Upstairs, there isn't much to see but you can exit and see the remnants of the Tredegar Iron Works, namely where the canals were and the machinery remnants. A lot of work was done on these grounds both before, during and after the Civil War to support the war efforts of the respective times. \n\nSome seem overly upset that the name has been changed, but it's impossible to see how this could be called a museum of the 'Confederacy' as it covers the War's history from all perspectives, and does it well. Nothing PC here, so it could be people are upset the Confederate flag no longer flies. Nevermind the fact it's the flag of an entity that was dissolved in 1865........155 years ago. The Confederacy lost the war. That's a fact, and whining won't change it. \n\nA great museum to see.",
  "I was shocked that an important part of our American history is not being told. Right of wrong, our children have the right to see the wrongs that our country has perpetrated. Please do not hide, remove, or destroy any of our countries history. It's just not fair."
 ]
},{
 "name": "Maggie L. Walker National Historic Site",
 "address": "110 1/2 E Leigh St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/d9/a9/81/exterior.jpg",
 "tags": [
  "tour",
  "family",
  "tour",
  "historic",
  "family",
  "free",
  "tour",
  "walking",
  "history",
  "tour",
  "history",
  "tour",
  "family",
  "history",
  "free",
  "tour",
  "historic",
  "walk",
  "tour",
  "historic",
  "family",
  "free",
  "tour",
  "knowledgeable",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d108510-Reviews-Maggie_L_Walker_National_Historic_Site-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a remarkable woman, It's amazing to think of all she accomplished during the time in which she lived. She chartered and ran the first savings bank founded by a black woman.  It was established in the Jackson Ward area of  Richmond, her community. She also established a newspaper and a retail store for her community.  All this was done in the early 1900's.  There is an informational video to watch in the visitor's center that is very good.  When the video is over, there is a guided tour of her home. Most of the items in the home are original.  Her family felt her legacy was very important and carefully preserved her home over the years.   It was a fascinating tour.",
  "This wonderful site starts with a 20 minute video of Ms. Walker's life and professional contributions to Richmond's African American community and beyond.  Follow-up with a tour of her home, with 90% of its original furnishings and insights into the lifestyle that Ms. Walker created for herself and her extended family, through her many professional accomplishments and community contributions.  Her impact within the civil rights movement, professional success, and personal tragedies combine into an inspiring story communicated through a visit to this historic site.  And, it's free.",
  "I complained the entire time that my mother made us go on this boring adventure, but it was actually fascinating! Love hearing about the lives of former residents that were dominant in an era where no one thought anything about them was special! If you can appreciate History, Black History, Women achieving in a man's world, then this place is a must see! We also went on the walking tour, and that was fascinating as well!",
  "I knew nothing about this place before I visited save what I read in the Park brochure. I lucked out and got a private tour of the house from of the rangers. Do not skip the introduction video as it is key to understanding this grand lady. Maggie Walker defied the conventions of the time based on her skin color and sex. She was a teacher, an entrepreneur and a community benefactor. Her history is awe-inspiring and I learned a lot. ",
  "Others have already explained the prominence of Maggie Walker and her importance in American history. I'll focus on some logistical items instead.\n\nFirst - go! Really great information and visuals. The rangers do a good job of spinning stories about Maggie, her family and her community.\n\nSecond - it's free!  Free parking, free movie, free house tour.\n\nCurbside parking is available down the street that runs beside Maggie's house.\n\nThere are stairs up to the top floor. They are narrow and steep. The stairs down the backside of the house are wider and less steep.\n\nMake time for this visit and you will be glad you did.",
  "I decided to visit the Maggie L. Walker National Historic Site while returning from Jamestown and considering going to Richmond National Battlefield.\n\nThe site is a very nice place to visit, however, I initially missed seeing the sign advertising the location and went around the block again.  Parking is somewhat limited in the area, but found a spot.\n\nI didn't have a lot of time for the visit, so did not watch the film, however, I was able to take a tour of the house.  It took about 45 minutes for the tour, and it covered both floors of the house you could enter most of the rooms.  One of the nice aspects was they allowed pictures to be taken inside the house.  Something not allowed at every site.\n\nI learned a fair amount about Walker that I did not know and was surprised to see her house had an elevator that was added by Mrs. Walker later in her life as part of the house.\n\nThe museum was small, as was the gift shop.  However the ranger was helpful, asking the guide to hold up for a few minutes so I could join the tour.\n\nThe actual site includes not only the house but a courtyard.  Also, if you walk to the front of the house, you can get some nice pictures of various houses located in the neighborhood.",
  "Don’t miss this!  It was the unexpected highlight of our Richmond trip!  Learning about Maggie Walker's life was very inspirational.  This National Park historic site is extremely well run.  The excellent free tour starts with a very interesting and expertly done local film on Walker's fascinating life.  Afterward is a tour of her grand home.  The furnishings are all original because the home went directly from the family to the NPS.  It is a very accurate portrayal of what it would have looked like in the early 1930s.  It includes many meaningful mementos that provide insight into Walker's life and times.  Our guide, Ajena, was first rate. ",
  "I was the only one visitor in the museum and it was great. I knew nothing about Mrs. Walker before visiting her house. But I was impressed very much by her biography, her character and great things she has done throughout her life.\nAll furniture is in excellent condition. It seems that the owners are now returning home. \n\nSpecial thanks to my personal guide (I forgot his name, I'm really sorry! :-(( \nSend him big regards from the Russian girl from St.Peterburg",
  "I was interested in this site because she was the first woman banker (I am a finance person).  The tour was very interesting.  The ranger was incredibly knowledgeable.\n\nMaggie Walker had a very interesting life.  Some parts were sad.\n\nI would recommend this site.",
  "More people should know about and visit this place. She is an unsung hero who has not received the recognition she deserves, for her amazing work and legacy.",
  "What a remarkable woman, It's amazing to think of all she accomplished during the time in which she lived. She chartered and ran the first savings bank founded by a black woman.  It was established in the Jackson Ward area of  Richmond, her community. She also established a newspaper and a retail store for her community.  All this was done in the early 1900's.  There is an informational video to watch in the visitor's center that is very good.  When the video is over, there is a guided tour of her home. Most of the items in the home are original.  Her family felt her legacy was very important and carefully preserved her home over the years.   It was a fascinating tour."
 ]
},{
 "name": "T. Tyler Potterfield Memorial Bridge",
 "address": "",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/b5/a3/d0/view-towards-city.jpg",
 "tags": [
  "walk",
  "kids",
  "walk",
  "unique",
  "walk",
  "walking",
  "walk",
  "tour",
  "walking",
  "history",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d11899074-Reviews-T_Tyler_Potterfield_Memorial_Bridge-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "This bridge is genius! Go when the sun is setting for some gorgeous photos of the river and city. I typically park on the southern side of the river so I can walk across, around the canal walks and then back over. The breeze is great when it's a warm evening.",
  "What fun.  The walk across this pedestrian bridge (plus bikes) has wonderful views as you cross the James River.  There are also frequent information markers along the way that add historical significance.  Kids love it two, it's not strenuous and very safe",
  "This pedestrian bridge offers some truly unique views of downtown and of the James River. Accessible from Brown's Island on one bank and from the Floodwall/Canal Walk parking lot on the other bank. \n   Definitely worth checking out, whether you're running, biking, or just taking a walk and checking out the sights!",
  "Located right next to the American Civil War Museum - Tredegar - spend some time walking over the James River.  Can walk across and back - 20 minutes total, or meander at the end, or combine with Canal Walk.",
  "A historical stop on the Segway tour. Sad but interesting history.  Great views of James River, rapids, and Richmond river front.  Walking bridge over James River with interesting Richmond Civil War quotes in the planks.  See photos.",
  "This was fun. After leaving the Tredegar Ironworks and excellent Civil War Museum, we walked across the bridge. Great views up and down the James River from a safe and substantial walkway enjoyed by adults, kids, and dogs. ",
  "It was a lovely leisurely walk across the bridge. It did have a lot of bikers and segways, so be careful of that congestion. On a clear day it was a nice view of the river and we could see the Capital up on the hill.",
  "It seems a strange place to incorporate the experience of the April 1865 fall of the city to the North in the Civil War, but the elements were sensitively embedded, beautifully maintained and told, and the setting is just stunning.  I thoroughly enjoyed my leisurely amble across the bridge - well worth the visit.  Thank you!"
 ]
},{
 "name": "Richmond Raceway",
 "address": "600 E Laburnum Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/f4/90/cb/richmond-raceway-s-four.jpg",
 "tags": [
  "family",
  "tour",
  "food",
  "drink",
  "organized",
  "field",
  "food",
  "music",
  "music",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d2648886-Reviews-Richmond_Raceway-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "We attended the Xfinity and Monster Energy races Friday and Saturday nights in September. The seats we had were great on the front stretch Friday night and in turn 2 on Saturday night. As usual we had a great time. This is our third time to go to the September race weekend. We always stay with family and they attend the race with us. The weather was very nice this year, not too hot like last year. Highly recommend this race to anyone whether a NASCAR fan or not. If you are not you probably will be by the end of the weekend.",
  "What a wonderful week!! Starting with the PWBA Tour Championships with Live TV finals in Wednesday to attending the Federation Auto 400 for a night race, WOW!",
  "The racing at Richmond is some of the best seen on the NASCAR circuit with it's challenging track layout and high banking,it gives the drivers a whole race track to get their way to the front.For fans that think it's all about the money,Richmond does not charge to park and they have regular shuttle service to and from the track to various parking lots.Racing people come to see racing but they are willing to talk to race fans from all parts of the country who are there for the same reasons.Plenty of rest room areas,plenty of food and drink offerings and some incredibly intense racing.",
  "If you are nascar you have to come here. best short track racing and its even better at night time. Every seat i bet is a good steat here at RIR.",
  "RIR Complex is more then Nascar. The complex hosts a number of different events depending on the time of year and type. On the west side arre the building where they hosts different holiday bazaars and exhibits/shows. Then the center piece of the complex is the Raceway (cannot miss it) and on the east side in the field/parking area is where they hos the annual Scottish Highland Games and Celtic Festival.\n\nI recently went to the Highland Games and have been going for several years. A few things I have learned:\n\n1.  Pay attention to the weather reports. This will affect on when people will go and arrive during the day.\n2.  Getting tickets, if you buy online remember they close off buying online tickets early. No problem buying tickets at the gate. Either way online/will call or buying at the gate, you still have to go to the ticket booth and then the entrance gate for the event.\n3. Parking can be an issue depending on when you get there. I go early so I can get close to the gate. As it gets warmer and sunnier, more people, more cars.\n4. Wear comfortable shoes, It can be muddy (if it rained) and you are in a field.\n5. This is one place where you will see alot of kilts. \n6. Food is expensive, remember it going to be mostly fair food. They do have tables and chairs but they do fill up fast. Doesn't hurt to bring you own chairs or blankets.\n7. Alot of vendors do take cash or cards. Spends just the same.\n8. Bring ID, they do serve liquor.\n9. They are pet friendly. You will see alot of dogs.\n10. Heavy athletics are the main attraction so the main field will get crowded.\n11. Live music.\n\nAs for Nascar, parking would be in the same fiekd as the Highland Games also north of the raceway on more pakring for Nascar. The surrounding neighborhoods, the local homeowners would charge you if you want to park closer, just be careful.\n\nThe downside to the event (Highland Games) is the weather at the time. Tickets, sometimes they just don't seem too organized. They really need to do a better job about setting up a will call line at the ticket booth. Parking and traffic. Restrooms are the portable johns. They do have plenty you just have to know where they place them. Normally to the left of the stage area and to the right of the food vendors near the entrance and towards the back area (south end of the field).",
  "Finally took my wife to the night races at Richmond Raceway. I’ve been there plenty of times with my son and friends. I finally talked her into going in the RV to the track. We stayed right across the street of the track. That wasn’t the best but we were close to the track. She actually enjoyed herself at the race. Had great seats too. Thanks to Vet-Tix.",
  "So this was supposed to be a Celtic/Irish/Scottish festival.  I purchased my ticket ahead of time and my daughter purchased hers at the gate.  The entrance was at Gate 4.  My daughter purchased her ticket at the gate closest to Gate 4, but because I purchased my ticket over the phone, I had to walk a long distance and to get my ticket and then all the way back to the ticket booth near gate 4.  There is NO WILL CALL at  the ticket booth, how stupid!!!!!!.  TOTALLY INSANE!!!!!!!!  No management at this event. This event opened at 9 am.  By noon I had to use the John,  ABSOLUTLY NO TOILET PAPER IN ANY OF THE JOHNS!!!!!!!!!!!!!!  VERY UNACCEPTABLE!!!!!!!!!!!!!!!!  They claim all the TP was STOLEN THE NIGHT BEFORE.  A N D ??????????  What IDIOTS!!!!!!!!!!!!  When I went to complain, they claim someone was coming.  I waited as long as possible (10 mins), but was given a napkin and wipes.  They never came with the toilet paper.  VERY uncaring PEOPLE.  NO MANAGEMENT AT THIS EVENT. Then to add insult to injury, this is a CELTIC festival not a BLUE GRASS festival.  The BG music was horrible!!!!!!!!!!!  They acted like they were all high on drugs.  I was so glad when ALBANACH got on the stage.  Richmond raceway needs to get their act together.",
  "This is a limited review as I drove around the facility and all the gates were locked.  I still got to see the stands and buildings. It's in a great location close to downtown.  I can't wait to see a race here some day.  Check ahead of time for access."
 ]
},{
 "name": "Tredegar Iron Works",
 "address": "500 Tredegar St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/b6/6c/3e/view-driving-in.jpg",
 "tags": [
  "parks",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d218815-Reviews-Tredegar_Iron_Works-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Closed October 15,2019, the day before we arrived. It is being relocated across the plaza to a new building.\n\nWe went to the American Civil War Museum in the same plaza. Well worth it. Cost was $14/senior.",
  "The iron works part is pretty small right now.  Most of what there is to see is in the adjacent Museum of the Civil War. The architecture of the new building around the works is really nice. I was hoping to see a lot more about how the cannon were cast and made during the civil war era.  There are basically a few artillery pieces to see and the remains of the water wheel. They could also do a lot more on the conflict of skilled labor with the slave labor brought in pre war. Now that the National Parks is involved, I think it will only get better.",
  "The iron works are interesting but this is just a visitors center for all the battle fields in the Richmond area. The civil war measum next door is separate with a separate charge. ",
  "Attached to the old Iron Works, which are now closed, this new museum (May 2019) is compact.  Many, many artifacts and lots of writing.  Some interactive displays.  I am not a Civil War buff, so I did not appreciate the details of each battle, but of course appreciate the scope of the museum.  Situated wonderfully, you can walk out of the museum and walk across the James River on the pedestrian bridge or take the Canal Walk, both of which i recommend on a nice day.",
  "This museum was incredible. Never did I think I would get to see General Pickett's sash from the Battle of Gettysburg or J.E.B. Stuart's infamous hat and boots. If you love Civil War history, do not miss this museum."
 ]
},{
 "name": "Altria Theater",
 "address": "6 N Laurel St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/40/27/a5/landmark-theater.jpg",
 "tags": [
  "food",
  "kids",
  "performance",
  "theatre",
  "theatre",
  "eat",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d564073-Reviews-Altria_Theater-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I just attended The Book of Mormon this last Saturday evening. It was our first time at the Altria theater. We enjoyed dressing up and having a date night in the elegant theater. Everything was beautiful. Each floor has a concession, bar, and bathrooms easily accessible to each section. The only advice I would give would be to get drinks and food before. We spent $50 dollars on 2 drinks, 2 waters, and a popcorn. This was almost the same price as our tickets. ",
  "Altria formerly known as 'The Mosque\" is place for Off Broadway performances and big named performers. It is a renovated Acca Temple built in the late 20's. It is an interesting place for performances it also offers interesting architectural features.  ",
  "Definitely worth checking out the inside if you can, especially to see a show! The decor is amazing all over the walls. It makes you feel as if you are in an exotic place like Istanbul. Look up at the ceiling once you are in the auditorium as well! Its absolutely stunning!",
  "After the Landmark became the Altria Theater, many upgrades and investments were made and it is apparent, The sound system is much better as is the overall feel. Parking can be tricky especially when parking in the garage. It can take a long time to exit after an event. Beware of obstructed view seats. They really do obstruct your view and can make for a very unpleasant experience.",
  "Went to see Blues Rock Concert Joe Bonamassa on March 19 2019 here and the Theater is absolutely beautiful it sits on the campus of VCU. Parking is right across the street and getting there is easy just a little ways off I 95 south.",
  "I was moved to tears when it started and enjoyed this show immensely. It was just a wonderful show and I am so glad to be able to see something as spectacular as this and only 40 minutes from my home. However, just because it was a cartoon did mean that toddlers would enjoy it. I had a toddler behind me that CRIED three times because she was scared. The mom and grandparent had to tell her what was happening because it wasn't age appropriate. Then she became sleepy and wanted to leave. 12 year old kids and up can enjoy the show but anyone younger is a waste of money. The fact that they disturb people that spent a bundle to hear them ask a hundred questions is just rude.\nLastly, Altria needs to spend some money on more comfortable seats. After intermission it is almost unbearable because they are hard and uncomfortable.",
  "Great place to see shows!   Everyone is helpful and nice.   Drinks and snacks available at all levels.   Parking can take sometime so arrive with plenty of time.",
  "Went opening night for Cats off Broadway at the Altria Theatre .  The venue is beautiful but found the seating cramped we were in the balcony so maybe floor seating is better.  The staff was friendly and helpful enter through metal detectors and bag check times we live in. Lines moving at reasonable pace.  Concessions located throughout theater but extremely pricey a bottled Pepsi and canned beer also $20. Clean restrooms and parking across street in parking garage $10 cash fee.  Maybe just me but found sound quality lacking hard to understand singers.  Over all we enjoyed the performance and would return to another show but will try different seats  next time.  ",
  "So very very disappointed in our visit.  When buying tickets for CATS back in November, I purchased tickets that was listed as \"best seats\".  I also referred to the photo that was provided on the website showing you what your view would be.  DO NOT GO BY THAT PHOTO.  False advertising! Had I known this theatre I would have never ever purchased the tickets at all.  The seats were absolutely awful.  I had to stand the entire show because I could not see.  I was lucky that I bought the tickets that I did, because otherwise I would not have been able to stand and would have spent the entire show staring at the back of a head.  Thank you Altria for ruining what I thought was going to be a great experience.  First broadway show I have ever seen and based on this experience, I do not ever want to see another.",
  "I have been to the Altria for several Broadway in Richmond shows. The quality of the performances (Hamilton, Cats, etc) is outstanding, and the theater is absolutely beautiful. Because it is an older venue, the seats aren't the most comfortable for taller/larger people, but since I'm under 5' tall, that didn't bother me. What is unreasonable is the prices for concessions. $27 for popcorn, bottled water and a beer. Insane! Will be back for the great shows, but will eat before arriving.",
  "This place is full of history and architectual beauty. You can stand or sit in this place and imagine yourself going back in time seeing the impression of the era when this building was built. You cannot take in all of the details that was placed in this building. If you get a chance to go to a show here please do, you will not be disappointed."
 ]
},{
 "name": "The Valentine",
 "address": "1015 E Clay St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/1e/4a/53/the-valentine.jpg",
 "tags": [
  "tour",
  "history",
  "tour",
  "walking",
  "history",
  "tour",
  "historic",
  "history",
  "tour",
  "knowledgeable",
  "family",
  "history",
  "historic",
  "tour",
  "history",
  "family",
  "learn",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d258528-Reviews-The_Valentine-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "The highlight for us was the guided tour of the 1812 Valentine/Wickham house, connected adjacently to the newer museum-displays building. A quiet Sunday morning, and we had the extremely knowledgable Kwami, conveying his insights into the people, the building, the restoration, and the collections.\nWe also enjoyed the diverse, self-guided exhibits, covering the history of Richmond  from the origin of Eskimo Pies to dugout canoes to ceremonial dress to a public display/vote of possible Monument Avenue redesigns. We liked but almost missed the video in the renovated part of the Wickham cellar, likewise the Edward Valentine sculpture studio outside by the sculpture garden.",
  "wonderful experience. very insightful. Thanks so much. I took a walking tour with St. Paul's Church on a Sunday in October and the tour guide took us around the Capitol building, Governor's mansion and more!",
  "Being new to Richmond, I liked seeing the history of the city. The exhibits were like the best 'This American Life' episodes-- engaging stories about interesting people. ",
  "Well laid out small museum that covers one floor. It has a variety of items and displays that tell of people and establishments that are meaningful to Richmond's distant and mre recent past. It can be best appreciated if you are from the Richmond area.",
  "Admission to this Museum includes a guided tour of the adjoining historic (1812) John Wickham House.  It is actually a \"twofer.\"\n\nOur Wickham House tour was conducted by a young woman, who was exceptional with her knowledge and presentation.  The Valentine, itself, is not huge with respect to exhibited materials.  However, what is exhibited is presented in a first class manner.  And, the signage is just outstanding (clear, concise, and very readable).  \n\nIf you're a Richmonder, a visit to this Museum, at least once, is a must.  I'm sorry it has taken me so long (15+ years) to come here a second time.",
  "Worthwhile to spend time there + it has grown and is a lovely series of bldgs and a beautiful yard too.",
  "For all out of towners - stop by Court End and the Valentine.  Wonderful place to show history of Richmond.",
  "Having toured almost all of the (many) historic homes in and around the Richmond area, we recently revisited The Valentine.  The Wickham House, which is attached, has period decor and a number of pieces original to the home and family.  Two floors are open and furnished. There is a small museum of items curated to represent the experience of all  groups who have resided in Richmond, starting with indigenous Indians.  A rotating exhibit space currently has information about the centennial of the 19th Amendment and Richmond women involved in the Women's Suffrage effort.\nOur guide, Kasie, was knowledgeable and personable.  Her obvious interest and enthusiasm for history made the tour especially enjoyable.",
  "The main museum shows items from all of Richmond's history but there is not that much to see. The mansion next door is included in the ticket and can only by done as part of a tour and is very pretty with a cool history. Cute yard with cafe, perfect for a quick break, all in the middle of downtown.",
  "From the pictures on tripadvisor I expected more. It was interesting but it is a collection of anything and everything. The owners collected what they thought was interesting. None of the collection was very valuable. It was interesting to learn how the family had made their money. Unfortunately we had a docent who had just started and was not able to answer all the question. Other than that it is still worth a visit.",
  "We had Groupons for the Valentine Museum and I'm glad I didn't pay full admission. It was just ok. Not as thorough an exploration of Richmond history as I expected. There is an old home attached to it which might have been more interesting. It wasn't open when we were there.  With so much to see in Richmond, I would skip this one."
 ]
},{
 "name": "Libby Hill Park",
 "address": "2801 E Franklin St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/67/84/2c/close-up-of-confederate.jpg",
 "tags": [
  "tour",
  "tour",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d6931619-Reviews-Libby_Hill_Park-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nice stop on our RVA Trolley tour.  It is on the top of a hill giving great high view of James River, Lucky Strike smoke stack and the city.  Area has interesting connection to the 1893 Chicago World Exposition.  Relaxing park area.  See photos.",
  "Loved the statue at Libby Hill Park!  It was one of the stops we made on the Richmond RVA trolley tour.  ",
  "My daughter, several of her friends and parents met at Libby Hill Park to take pictures before Homecoming. Several other groups had the same idea. It was a great spot to take pictures with views of Richmond in the background. There is free on street parking. ",
  "This was not on our agenda, but we were sure glad to have found it on our way home from St. John's Church.  Beautiful quiet park in a peaceful neighborhood.  Easy to park and take your dog for a walk.",
  "I come to Libby Hill Park several times every week to see the sunset -- it's always a wonderful show, as the sun sets behind Richmond's downtown.  The park also has a beautiful view of the river, which apparently is how Richmond got its name (according to an historical marker).  There is plenty of grass area and multiple park benches.  Since the benches fill up (yes, lots of people are there seemingly every night, with cameras for the sunset), I usually bring a folding camping chair.  There are two picnic tables overlooking the river view and a small very pretty garden of flower, with a fountain.  A nice way to end the day."
 ]
},{
 "name": "Fan District",
 "address": "West Main St and North Boulevard",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/7f/2b/e0/fan-district-homes.jpg",
 "tags": [
  "eat",
  "walking",
  "food",
  "walk",
  "family",
  "historic",
  "walking",
  "walking",
  "history",
  "eat",
  "walking",
  "food",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d279271-Reviews-Fan_District-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "My daughter and I spent an afternoon walking this wonderful neighborhood. There are blocks of beautifully restored homes . Many architectural styles are represented. Most  streets are shady and there are many places to stop and enjoy a bite to eat .",
  "We usually try to stay somewhere in The Fan.  There are lots of rentals, food and VCU campus is a close walk.  Only problem is parking.",
  "I moved to the fan a few years ago and love it! Great neighbors, restaurants/bars, architecture and it's close to all the best things RVA has to offer.",
  "My family and i spent an morning walking around this wonderful neighborhood. There are blocks of beautifully looking homes that my wife and daughter loved looking at.  Some are huge and historic. It was nice walking around it and then driving through it as well.",
  "Richmond's Fan District is a delightful, shaded, and walkable location to Carytown and its many shops and restaurants. With the wide porches and sidewalks, the dog-friendly neighborhood is a winner.",
  "Great walking or driving here to see decorative old houses.  Check out the nearby jewish history museum for very well produced history presentation about prominent business people from richmond.  ",
  "My daughter and I spent an afternoon walking this wonderful neighborhood. There are blocks of beautifully restored homes . Many architectural styles are represented. Most  streets are shady and there are many places to stop and enjoy a bite to eat .",
  "We usually try to stay somewhere in The Fan.  There are lots of rentals, food and VCU campus is a close walk.  Only problem is parking."
 ]
},{
 "name": "Pony Pasture Park (James River Park System)",
 "address": "4301 Riverside Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/06/43/fd/pony-pasture-park-james.jpg",
 "tags": [
  "walk",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d4495239-Reviews-Pony_Pasture_Park_James_River_Park_System-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "Love to return to the river in different seasons and ALL are good.  There are so many trails here, some I have yet to take because I fear getting lost.. yes that many.  I like to go with a friend who knows her way.    I love some of the huge trees along the way and the GIANT boulders on shore thanks to flooding and many in water.  Saw quite a few cormorrants this day; always a wonderful run or walk and bathroom is at beginning of trail near parking lot  FYI",
  "First visit on a chilly sunny day. Great trees, huge rocks, birds, and River. Some trails are covered with wood chips while others are simply soil. Most trails are wide enough for bicycle traffic. The occasional small beaches broken by boulders run along the River. Signs require bathers to wear life jackets if waters are high and fast. Has parking (reportedly limited in warm months) and good bathrooms but appears has too many people not following the rules.",
  "River view and small water craft access is outstanding. Good parking with ample rest facilities. Great hiking and biking is available at the park for beginner hikers or someone out for short period of exercise. Litter may be a problem but not one that would prevent me from visiting occasionally......",
  "I brought my 3 children on a Friday afternoon for a picnic by the water. It’s a beautiful location and it’s very nice to walk on the rocks in the river. I gave it such a low rating because it was filthy. We stumbled across a dirty diaper, A rotten, half watermelon, bottles and empty chip bags on the rocks and in the water. There was a family playing in the water next to us wearing their underwear instead of bathing suits. I will not be returning.",
  "I am fortunate enough to live close to this magical place and enjoy it regularly.  For a picnic, hiking or wading in the river, Pony Pasture is the place."
 ]
},{
 "name": "Rosie's Gaming Emporium",
 "address": "6807 Midlothian Turnpike",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/60/47/3c/your-jackpot-awaits-at.jpg",
 "tags": [
  "food",
  "delicious",
  "drink",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60893-d17741216-Reviews-Rosie_s_Gaming_Emporium-Richmond_Virginia.html",
 "source": "TripAdvisor",
 "reviews": [
  "I had a fun time at Rosie's . The food was great and the customer service was great also. I came in contact with a employee name Ebony. She was so helpful. And she came and checked on me while I was there . I will definitely be returning.",
  "Loved this gaming emporium.  My wife won big and the staff was fantastic.  Pamela at the caashiers desk was awesome and we will be back.",
  "This was my first trip Rosie's ,I went to the counter where you can cash in at.To ask questions about lottery tickets and the lady behind the counter was so helpful. She told her name was Pamela,she told me about the promotion and how to enter and that I could buy lottery tickets and cash them there . She was so nice , she made feel like I been knowing her so friendly .I will be coming back again and hope to see her. I'm from Durham NC and I had a great time",
  "I attend Rosie’s on Friday February 28th. I order the most delicious cheese burger with fries. Just thinking about is making me crave another one  now. But there was also the very delightful woman working that night. Her name was Mary she was vary caring about the dining area be clean and was very polite in make guests feel like they were at home. Thank you Mart.",
  "I have been several times.  I have seen certain bartenders, one in particular either flat out ignore certain types of guests or curse them out for not tipping.  Her Name was Eva. I saw one supervisor Lisa snatch a drink out of a customers hand and when confronted in a calm way she started screaming for security.  She is extremely rude to certain types of guests also. On the other hand Bartender Kaitlen is  an AMAZING  bartender. She k ow her drinks, is great with guests and always has a smile. Two other supervisors Jessica and  Josh are always kind and helpful to guests no matter what the situation is.",
  "Pamela is an amazing employee. Her service and friendly face is outstanding. Rosie's need more people just like her.",
  "Had a great time Malissa in the cashier area was extremely helpful and friendly. Will definitely go back.",
  "I had a fun time at Rosie's . The food was great and the customer service was great also. I came in contact with a employee name Ebony. She was so helpful. And she came and checked on me while I was there . I will definitely be returning."
 ]
}]
