[
{
 "name": "California State Railroad Museum",
 "address": "125 I St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/2f/65/68/a-large-attractive-bldg.jpg",
 "tags": [
  "history",
  "kids",
  "family",
  "historic",
  "history",
  "field",
  "history",
  "kids",
  "tour",
  "history",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d102772-Reviews-California_State_Railroad_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Railroad Museum in Old Town Sacramento offers an outstanding experience with a film, guided tours and fascinating restored train cars and locomotive engines.  There are docents in most of the exhibited cars that happily share the history of the car- the dining car and the mail car were particularly interesting. The history of the Transcontinental Railroad and its construction is vividly recalled in a series of displays. Exhibits provide information to engage both children and adults.  We visited with friends and their children aged 5 and 12 and both children found areas of interest from the model trains to the hands on electronics experiments.\nAdmission for adults is $12 and your ticket allows multiple reentry for that same day. The museum is open from 10-5 daily and you could easily spend several hours exploring the three story museum.",
  "Exhibit on the role of the Transcontinental Railroad in unifying the nation after the Civil War; large indoor play area for kids to play with toy trains; exhibit on train photography; exhibit on toy trains; and of course several trains to enter and explore (e.g., dining car, Pullman sleeper car, high speed rail car) -- in short, this museum has something to interest everyone in the family. Displays discuss the diverse set of Americans and skill sets that contributed to the construction of the Transcontinental Railroad and worked in the American railway industry through the decades.",
  "I live within less than half a day's travel from 3 of the greatest railroad museums in the country but this museum would top them even if they were combined into one museum. This museum is a railroad Museum, a history of Railroading in the West Museum, a toy train museum, a hands-on children's museum, and an out door museum with historic railroad buildings as well. Being set next to the Sacramento History Museum and in the the Old Sacramento Historic District, makes it an ideal place to visit and not require any transportation but your feet. Nearly every exhibit has a well informed volunteer ready to answer questions and provide information about exhibits. Depending on your interests, you can easily spend half a day to a whole day there.",
  "This is a wonderful museum at the north end of old town.  Huge and somewhat peaceful even with all the school and scout field trips.",
  "Great parts of America history and the great state of California to see and travel through time from the luxury dining cart to the sleeping quarters  and how the US mails was delivered and the men and women that make this great state moving forward in the 17 century A must see when you visiting Old Sac",
  "The Museum is extremely well laid out and the exhibits displayed in an artistic and imaginative way. Particularly the diorama of the trans-continental railway.\n\nA fascinating place for adults and kids alike. Highly recommended. ",
  "Decided to spend a couple of hours here as we hadn't visited for some time.\nSurprised there is no \"Seniors\" admission price. We happened to be in time for a 40-minute tour and history lesson of the Union Pacific from Bob. He is very knowlegeable and interesting to listen to.  Only the first of the large railway exhibits are  placed in a context - the Stanford locomotive and tender. The other loco exhibits are interesting close up and at least one loco and several carriages can be entered and viewed from the inside. We didn't get to see the movie show. Timings seemed to overlap with the tour. We did go up to the 3rd level  where there was one working model train (our American friends seem to call them Toy Trains). They were more toy than model were in G (Garden) Gauge. I was disappointed that there were no working HO or N scale layouts. We stopped by the Museum Store on our exit and resisted the temptation to buy a \"Casey Jones\" cap - in pink and other colours, as well as the blue-gray of the original. A pleasant couple of hours and children would love it as there is at least one self-build area.",
  "The Southern Pacific railroad had many miles of tunnels and snow sheds.  So to prevent their engineers and firemen from being suffocated they had special engines built called cab forward engines.  There only is one that still exists and it is in Sacramento at the California Railroad Museum.  While that is enough reason to visit there are a number of other steam locomotives as well as other pieces of unique railroad equipment. Regardless of how you feel toward railroads they did make America.  The museum has knowledgable staff to provide additional information.  It is worth the visit."
 ]
},{
 "name": "Crocker Art Museum",
 "address": "216 O St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/47/71/16/historic-crocker-mansion.jpg",
 "tags": [
  "art",
  "art",
  "family",
  "structure",
  "art",
  "music",
  "art",
  "music",
  "free",
  "art",
  "art",
  "family",
  "free",
  "history",
  "art",
  "historic",
  "art",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d105182-Reviews-Crocker_Art_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Crocker Art Museum has something for everyone. Exhibits of classic and contemporary art and artifacts on display and highly praised traveling exhibits also. We usually spend 3 hours per visit.",
  "A long-term resident of Chicago I regularly enjoyed visiting the Art Institute of Chicago. Now a resident of Sacramento and a member of the Crocker Art Museum I enjoy this museum equally. In terms of size there is, of course no direct comparison but The Crocker is a true gem judging on its own merits. The beautiful modern structure, filled with a wide variety of treasures--permanent and visiting--is well worth frequent visits. The integral Crocker Family home is an outstanding historical treasure and gives an in-depth and interesting view of life in mid-1800's. The Crocker's involvement in the Sacramento community is of particular note as it gives rise to all sorts of events drawing in folks from all walks of life in our city. The Crocker Café in the lobby is perfect place to share lunch or a light dinner with friends and family. We visit the Crocker frequently and always come away refreshed. The Crocker is accredited by the American Alliance of Museums (AAM) which is itself a basis for our recommendation you visit The Crocker.",
  "I’m so glad I became a Crocker member. I should have done it years ago. Enlightening films (they have their own theater), great café (with beer and wine), stunning exhibits both in the permanent collection and featured collections, music nights, art galas, special events for babies, seniors, on and on. It’s really not just an art museum but a lovely community space.",
  "There is art of all sorts,  lots of events in nearby park,  free\nclassical concerts in the museum, which was once a home.  \n\nThe exhibits vary, so check to see what is showing.   The museum  has recently been remodeled, with new rooms for\nart and music events.   On a summer's evening,  this can\nbe a very pleasant place to visit. \n",
  "The Crocker, while not on the same par with, say, the Norton Simon, offers visitors a few hours of breezy viewing. Toulouse Lautrec is on until the end of April and well worth seeing--with just a few sublimely placed lines, he made the dancer or singer he was publicizing come alive. There's one Bruegel amonst several Dutch masters I'd never heard of but were technically proficient in that cold, angular flemish tradition. Although I don't know much about African art (none really), I loved the collection of masks and headrests on display. (Before the African stuff, there are Indonesian pieces equally weird and wonderful and a nice prelude to the African stuff.) What an agreeable way to spend a few hours. Come eary if you can as parking can be difficult (esp. for people who find mobility challenging).",
  "We went as a family between 10 and 75 years of age.  There was something for everyone.  I loved the exhibits in the \"old Crocker\" (I'm the old one) while the youngsters liked the new exhibits.  I hadn't been since before the addition, but will be going again soon.  The new part seems to be a rabbit warren of rooms - so get a map!  They are by the elevators.  (I didn't see them util we were nearly ready to go).  I (personal opinion) didn't care for the modern \"art\", but it was very well displayed - and will be changed every couple of months.  They have kiddie rooms, wonderfully and imaginatively decorated where the tots can hang for a break and play.  There is also a nice cafe for a family break.  They have many special events during the year.  Parking is metered, so don't forget to pay!  We went on \"musuem day\" so the under 18's got in free and the adult price was $5. normally $12.  Surprisingly, it was never crowded even though there were incoming lines the whole time we were there. On the first Saturday B of A customers get in free.  So we ended up paying only $5. for five of us.  Then we splurged at the cafe - oh well.",
  "One of the few places in Sacramento that you can proudly show to visitors.  Wonderful older mansion from a bygone era, lots of history to the home itself, and a very nice art/painting collection to view",
  "Wonderful art exhibits. Regularly hists special events. Shown in a combo of modern and historic archiecture. Easy to get to and park. Near downtown resturants and cafes.",
  "This is another exhibit not to be missed.His work is primarily of California landscapes with many oils depicting California poppies and lupine and seascapes. As always, the exhibit is very well done. The exhibit  is on view until May 17, 2020. And, the gift shop has many beautiful \"poppy\" items.",
  "We went for the Granville Redmond exhibit, which was disappointing.  The museum had assembled an impressive collection of his work, most from private collections; however, his style was somewhat unexciting.  Pretty, but lacking something.  I will leave that to art critics.  The museum, however, is impressive....interesting architecture, great cafe, large shop and a lovely, if small, collection of European art 16th-19th c.  The Crocker house was amazing!!  So glad that we were able to visit!",
  "Had only a few minutes to quickly see as much as possible, yet I was very impressed and left with a taste of more. Looking forward to returning again for a few hours of peacefully walking around the exhibits."
 ]
},{
 "name": "California State Capitol Museum",
 "address": "1315 10th St Room B-27",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/82/44/8a/california-capitol.jpg",
 "tags": [
  "walk",
  "historic",
  "free",
  "tour",
  "free",
  "walking",
  "family",
  "tour",
  "art",
  "history",
  "history",
  "field",
  "tour",
  "tour",
  "walk",
  "historic",
  "free",
  "tour",
  "free",
  "wander",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d219610-Reviews-California_State_Capitol_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "To me this is our city's pride and joy.  A most beautiful building that luckily was saved due to an increase in patriotism during the Bicentennial year.  The building was seismic proof so many of it's roof top statues were removed. A display of the seismic proofing can be found in the basement along with a nice gift shop. Free tours are offered and well worth it.  Their is a big statue in the rotunda and tours take you inside the assembly and senate chambers with it's Czech lead crystal chandeliers, and walk passed the governor's portraits.  There are rooms of historic information, a film to watch and antiqued furnished rooms. Don't miss Arnold Schwarzengger's bronze bear in front of the governor's office and the hallway of county exhibits.  Due to security there is only one entrance now.  The capitol grounds with it's memorials, camilla garden, peace rose garden tree arboretum, and site of Res. Gerald Ford's almost assassination.\n",
  "As UK residents it is always fascinating to see how politics works in other countries. Have previously toured Capitol in Washington and several other state Capitols but were impressed with this guided tour. There are FREE guided tours on the hour every hour. Megan H our guide added a mischievous sense of humour as well as good factual input. We followed up the one hour guided tour with seeing the rooms exhibiting how things were in the past (1902, 1906 and 1933 - see photos) which are detailed on the self-guided tour leaflet. One interesting point - the door to a balcony was the original entry door but Megan H told us they ran out of money to add the staircase so used downstairs as the main formal entry door instead. We asked if anyone had gone on the balcony to wave to the crowds as Queen Elizabeth II of the United Kingdom does from the balcony of Buckingham Palace - surprisingly only one person has ever done that here - Queen Elizabeth II.",
  "This is a great place to visit with your family if you have an interest in California history, or if you enjoy learning and seeing art, and getting a peek at how local government works.\n\nThe capitol is situated in a large park with many beautiful shade trees, lush grass, and many walking areas.  The building itself is beautiful and meticulously maintained.  There are some art tiles installed outside one of the entrances that shouldn't be missed.  \n\nWhen entering, expect to pass through a metal detector and have your bag(s) searched, as this is a working government office.  Once inside, there are a lot of areas to explore.  Each of California's counties is represented by a diorama, and they line the hallways for you to check out.  There are a few impressive sculptures to admire, and many paintings throughout the building.  There are former government offices that have been preserved for viewing (behind a velvet rope), which are really fun to look at.  \n\nWe took a great tour with a friendly, enthusiastic guide.  On the tour, we were able to sit in on actual state government sessions, which was fascinating.  There is also a great, small gift shop which features books and the other typical museum stuff, as well as handmade art created by local artisans with disabilities.\n\nOverall, I was very impressed with the beauty and history of the capitol.  I would recommend it to anyone in the area!",
  "The must see if you are visiting Sacramento. The architecture of the building is amazing inside and out. The rotunda is breathtaking. Bring your camera because many beautiful photo ops. The grounds are immaculate. Check before you go because the hours are limited on the weekends and the only doors open are on the side of the building..",
  "We got to visit the State Capitol and were able to visit the Assembly floor as well as part of my son's Fourth Grade Field Trip this week. The history of the place is pretty interesting and you get to see the capital up close and personal. Probably the most interesting part was getting on the actual Assembly floor and having a personal talk there.\n\nThe architecture is beautiful and the grounds are well kept and maintained. It was very crowded the day we were there as there were a lot of other school groups taking the tour as well and, unfortunately, drizzling the whole time so we were all a bit cold and wet. \n\nThis is one of those tours that, if you're in Sacramento and have the time, include it in your itinerary. Budget a least an hour and bring a camera as the architecture is probably the best part of the tour. It's a beautiful building.",
  "As An Airline employee I have seen quite a few State capitals...CA offers up the best.. From the Gold lined Dome to the flower gardens outside you really get a feel for the stae. The walls deplict every County in the state and outside the capitalyou will find memorials to fallen peace officers, fallen firemen, Viet Nam Vets, and World War Two Vets.  You can get a guided tour or wonder the halls alone both are terrific. Do not forget to venture upstairs to beable to look down on the House and the Senate floors. After you tour the Captial you can head West on Capital Mall and run into the river and old town.  Parking is a little tough especially on week days using a pay parking lot is easier than hunting down a street spot with a meter. Unless you are lucky.",
  "To me this is our city's pride and joy.  A most beautiful building that luckily was saved due to an increase in patriotism during the Bicentennial year.  The building was seismic proof so many of it's roof top statues were removed. A display of the seismic proofing can be found in the basement along with a nice gift shop. Free tours are offered and well worth it.  Their is a big statue in the rotunda and tours take you inside the assembly and senate chambers with it's Czech lead crystal chandeliers, and walk passed the governor's portraits.  There are rooms of historic information, a film to watch and antiqued furnished rooms. Don't miss Arnold Schwarzengger's bronze bear in front of the governor's office and the hallway of county exhibits.  Due to security there is only one entrance now.  The capitol grounds with it's memorials, camilla garden, peace rose garden tree arboretum, and site of Res. Gerald Ford's almost assassination.\n",
  "Every traveler to Sacramento must go visit the Capitol Building and its great Museum. There is no charge to go, just be prepared to pass through a security screening and you are on your way. Do it!!",
  "On a day that was so perfect in every way, the California State Capital Building did not disappoint.\nThe free guided tour was informative and fun. As an Australian, it was enjoyable to see both the similarities and differences between governments. \nThe building itself was undergoing a \"facelift\" .. can I say that in California or is it \"cosmetic enhancement\"\nShe is beautiful anyway, but I am sure she'll shine after the shrouds are removed.",
  "It had been years since I've visited the Capitol, and it was fun doing so with my oldest son (now 25).\n\nI love the ability to just wander throughout without having to take an official tour. For the first time, I went up and down the halls looking at all the county displays.\nMakes me want to see if the Arizona Capitol lets us do the same.\n\nThe Capitol was being refurbished when we were there, so we didn't get to enjoy the wonderful lighting that usually comes in through the front windows. Wish I'd kept more photos, as there were so many lovely details throughout. ",
  "Road trip!  Today we visited our 45th US state capitol. Beautiful building and our tour guide, Eric did a great job."
 ]
},{
 "name": "Old Sacramento",
 "address": "1002 2nd St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/84/fa/82/main-street-of-old-sacramento.jpg",
 "tags": [
  "kids",
  "walking",
  "walk",
  "walk",
  "eat",
  "family",
  "kids",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d102771-Reviews-Old_Sacramento-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "I moved to Arizona from the Sacramento area in 2005. Some of my fondest memories were spent here in Old Sacramento from jazz festivals, walking the kids in strollers (was a bit of a challenge at times with the cobblestone streets and wooden sidewalks), and walking around hitting some of the great bars and restaurants. \n\nWeekends are always crazy, but on this particular day, my eldest son (now 25 who was born in Sac), and I took our time wandering through the different stores. We stopped at the historical building as the railroad museum was too pricey for us to just quickly go through.  We hit our old favorites like the toy and kite store, the salt water taffy shop, the olive oil sore, and my all time favorite, Enchantment, where I picked up some cards for my daughter and some incense.\n\nIt was nice walking around on this Sunday morning. Come early to find parking, as this is always a challenge. ",
  "Great place for families and visitors from out of town when you have to entertain when folks come to visit... Lots of things to see, shops, museums, the River, excellent choices in eateries for all price categories... Best time of year is the Tree Lighting and Light Show for Christmas... If you're coming to Sacramento, you have to walk Old Town... and if the River Cats (SF AAA minor league) are playing and it's a Friday or Saturday night... you'll get Fireworks.",
  "This is a lovely district open daily and open late heading into Christmas where families can visit and enjoy a walk around an old historically preserved part of Sacramento.  You can get a ride on a horse-drawn carriage, step into candy stores filled with all the old favourites, eat at a myriad of restaurants, toy stores selling toys of past decades, an incredible Christmas decoration store, clothing stores featuring cowboy apparel and costumes from a bygone era.  At Christmas everything is decorated, large Christmas tree in the town square where carols are sung nightly, tinsel on all the buildings, candy floss and popcorn sold on the street and a Polar Express ride especially for the children - children and adults come dressed in their pj's - all on a steam train.    A fantastic place to bring the whole family - young and old!!",
  "I love going here, not only has the original structures been preserved, the train museum is also here.  The shops are either tourist trinkets and eateries, or antique stores. Less than a mile west from Sutter's fort Museum.",
  "This is such a great place to take out of town visitors. Lunch and drinks on the Delta King, followed by shopping through Old Sac. Everyone had a wonderful time.",
  "I moved to Arizona from the Sacramento area in 2005. Some of my fondest memories were spent here in Old Sacramento from jazz festivals, walking the kids in strollers (was a bit of a challenge at times with the cobblestone streets and wooden sidewalks), and walking around hitting some of the great bars and restaurants. \n\nWeekends are always crazy, but on this particular day, my eldest son (now 25 who was born in Sac), and I took our time wandering through the different stores. We stopped at the historical building as the railroad museum was too pricey for us to just quickly go through.  We hit our old favorites like the toy and kite store, the salt water taffy shop, the olive oil sore, and my all time favorite, Enchantment, where I picked up some cards for my daughter and some incense.\n\nIt was nice walking around on this Sunday morning. Come early to find parking, as this is always a challenge. ",
  "We were staying across the street from Old Sacramento at the Embassy Suites, and we had a few hours before the concert at the Golden 1 Center. We took a stroll through the streets of Old Sacramento and in and out of the shops. Very nice historical part of Sacramento.  Maybe next time we'll have time to go through the railroad museum. ",
  "Loved walking the wooden plank walkways, the sounds, the candies  and the terrific restaurants.   Seeing the horse drawn carriages., et al. "
 ]
},{
 "name": "American River Bicycle Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/68/1b/7d/filename-img-1666-jpg.jpg",
 "tags": [
  "nature",
  "walking",
  "unique",
  "parks",
  "walk",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d142861-Reviews-American_River_Bicycle_Trail-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "This trail is one of the unique gems of Sacramento. Running from Old San to Folsom, it's a nature sanctuary, and while I'm there it's easy to forget I'm in the middle of a metro area with 2 million people. I've used it for walking and biking and either way is great. Yes, there can be homeless folks in the area, especially where closer to downtown, but I've never encountered any problems there. You can access it directly depending on where you are, or drive to one of the access points by Howe, Watt, Sunrise, etc., and go from there.",
  "And visit the fish hatchery at Nimbus Dam (Hazel Avenue and Hwy 50)!  Lots of wildlife and scenic  views.  A real gem in the middle of a metropolitan area.",
  "The American River bike trail is a great ride! Away from cars with frequent views of the river and cris-crossing through parks makes this an awesome experience every time you ride it.",
  "The bike trail has always been a great place to enjoy. And, now that gyms and many parks are closed it is even better. We  bike or walk portions of the trail between Sunrise Blvd and Folsom Dam. There are enough people to feel safe and yet maintain social distancing. Now there is an added bonus. The California poppies and other wildflowers are in bloom.",
  "We rode 12 miles round trip from River Bend Park to Sunrise Rec Area. It’s a smooth trail through fields and trees with lovely views of the river. We saw deer, turkeys, rabbits, raptors, ducks, egrets, and herons. Many bathrooms, drinking fountains, picnic spots, and places to access the river. Fabulous!",
  "Take a picnic, take pictures, take a minute to relax. Be EXTREMELY careful during the warmer days! The water moves faster under water!! ( than it looks from the top) appears. Enjoy!",
  "Once a quiet getaway is now a dump filled with filth and sadly, potentially dangerous people.  Sorry, but the homeless camps along the way have disturbed a once lovely local escape from the bustle of the city.",
  "January is when steelhead trout are spawning plus the end of the chinook salmon spawning season. Great views of this plus lots of other wildlife like deer, coyotes, woodpeckers, gulls, etc. The Nimbus Fish Hatchery is nearby also. "
 ]
},{
 "name": "Cathedral of the Blessed Sacrament",
 "address": "1019 11th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/1b/f3/ac/amazing.jpg",
 "tags": [
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d564705-Reviews-Cathedral_of_the_Blessed_Sacrament-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "It's a little hard to review a church, but this is a beautiful facility and home to the Bishop of Sacramento, Bishop Jaime Soto",
  "We attended a full mass there for a funeral.  What a beautiful cathedral and service.  We parked on I think 10th Street parking garage, but there is a closer parking garage on 11th Street",
  "A very well located cathedral in the walking section of town. Parking ok in front of capital. Well lit and with nice decorations",
  "Smallish cathedral but a have of peace and tranquility. Lovely building with some beautiful stained glass windows. Unable to explore too much was there was a service going on. ",
  "Very ornate Catholic church with all the bells and whistles from back in the day - statues, colorful wall paintings, serenity."
 ]
},{
 "name": "Sutter’s Fort State Historic Park",
 "address": "2701 L St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/fb/26/5c/photo1jpg.jpg",
 "tags": [
  "historic",
  "history",
  "history",
  "historic",
  "eat",
  "history",
  "kids",
  "history",
  "learn",
  "history",
  "kids",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d102770-Reviews-Sutter_s_Fort_State_Historic_Park-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you know California history this is a must . almost every well know and not so well known pioneer spent some time here . If you don't know his history read up on John Sutter and you will really appreciate his pioneer fortitude and how much he accomplished and contributed, giving you have a better understanding of why this historic site is so significant. this is a great place for kids,also check out the Indian museum and turtle pond  on the grounds . ",
  "The importance of California in the American Experience and in today's economy can not be overstated.  And this spot -- is where all that modern history started.  The surprise is that it is so accessible, simple and enjoyable.  If you have any interest in early American western expansion, in The Gold Rush, or in the politics and sociology of the European settlement of The West -- this is a must see.",
  "In the heart of Sacramento, Sutter's Fort is one of the most important historic buildings in the state and one of the largest and most extensive  buildings from the Mexican or Spanish eras of California history.  Although part has been reconstructed and renovated, part is also original.  \n\nIt was established in the late 1830s by John Sutter and was the first permanent European or Mexican settlement in the Central Valley.  Sutter obtained a land grant from the Mexican authorities to settle the Central Valley and built the fort at a natural transit point near the confluence of the navigable Sacramento River and what is now called the American River.  This settlement was instrumental in starting the Gold Rush for it led to the establishment of Sutter's Mill in the Sierras, and work there led to the gold discovery which sparked the Gold Rush.  It was also Sutter's Fort which the now-infamous Donner Party tried to reach and it was here where the survivors reached safety.  Finally, it marked the beginning of what became the city of Sacramento, one of the most important commercial and transit centres for the Gold Rush and Transcontinental Railroad.\n\nThe fort and grounds are extensive with many displays and often living history days.  It is worth spending at least a good hour here.  Being in the centre of the city, it is also near many places to eat and it is not far from the may other museums and historical sights in this city, which ranks as one of the most historic in the state.",
  "This is a well preserved artifact from the dawn of the California Gold rush. There are kids activities here as well as re-enactors.",
  "Took my grand-daughter here as she loves living history. Almost every saturday you can go here and see how the first settlers to California lived. There are re-inactors demonstrating everything from baking to basketmaking. Motion activated recordings tell you about the many facets of the fort. Once inside the walls of the fort you feel you have truly stepped back in time to the 1840's. Don't miss out on the doll from one of the surviving members of the Donner party.",
  "I've always loved this place because there is so much to learn there and being that I grew up in Sacramento, I've been there many time This was my husbands first time & with him loving history, it was hard to pull him away. ",
  "Right in the middle of a now major city and the State Capitol of California sits the starting point of the \"shout heard around the world\".  It is a rather subdued setting with white walls, wooden gates and non-paved  paths that was the seat of a visionary man who had no idea and was left behind when he found he had GOLD on his property.  This cluster of buildings rings of a more peaceful time of agriculture and Spanish Values imported to the \"New World\" and to remember this makes you think what old California must have been like.  This makes a visit here more meaningful because the outside ;resent world is blocked by the white walls if this past center of civilization.",
  "Sutter’s Fort was Sacramento before there was a Sacramento.  From here, volunteers rescued many of the doomed Donner Party.  It was Sutter who sent Marshall upthe American River to build a saw mill......and he discovered GOLD.  There are docents always there to teach pioneer skills.  Great trip for school kids and history buffs."
 ]
},{
 "name": "Capitol Park",
 "address": "1300 L St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/c4/42/40/plenty-of-wonderful-shade.jpg",
 "tags": [
  "walk",
  "walking",
  "comforting",
  "historic",
  "historic",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d142866-Reviews-Capitol_Park-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "A walk to the capitol buildings provided shade under trees from various countries as well as California. The rose garden is beautifully maintained and the Vietnam Memorial is reason enough to slow down and reflect. This park is a gem and should be included in your visit downtown. Californians should be proud.",
  "Spent several hours walking through the park.  The California Firefighters Memorial and the Vietnam Veterans Memorial should not be missed.  Park has beautiful orange and palm trees and love the peace garden.  My only regret is that I wish I could have visited in the spring when I'm sure the flowers are in full bloom.  Being born and raised in Philadelphia, I was impressed with the Liberty Bell Replica too!",
  "What a treasure in the middle of downtown around the California State Capitol.\nNow first note we spell \"Capitol\" with an \"O\" not an \"A\" since this is our the center of our state's government...\nThe Park includes a rose garden, a Vietnam War memorial, Valencia Orange trees and groves of historic trees specifically planted to highlight the diversity of our California ecosystem...if you are lucky, you will run into our State Police who are the California Highway Patrol (CHP) on horseback on patrol protecting our politicians and monitoring our homeless from setting up housekeeping...translates to, \"yes, you will be safe here\"...if you are observant, you will note the numerous cameras all over the park monitoring your every move...somehow I find that comforting and not disconcerting!\nDuring the noon hours, or during the fair weather, many a jogger will be making his/her way around the park....\nGo out, take in the sites, bring a lunch, stay awhile...\n\nLittle known factoid? Some folks have permission to harvest the Valencia Oranges and make marmalade out of the fruit since the are not good for eating on their own...our local market,\"Corti Brother's\" used to sell this marmalade...check it out!\n",
  "Visit the state Capitol in the spring and you would be rewarded not only by the historic building but by the grounds around it. Camellias and various other blooming plants provide a splendid spot to sit and contemplate the floral variety blessing this golden state. Docent led tours are a hoot and explain the workings of the government with humor and detail. The meaning of the state seal; find it here. The little museum on the first floor is often fascinating and is just the lure we all need to delve into deeper historical meat and potatoes. Visit   Chicory Coffee and Tea across L to enjoy a refreshment and a view of our splendid capitol building. Remember the access to the building is politely controlled so be prepared to wait a few minutes.",
  "Lying just east of the capitol building, this park is a delightful oasis in the middle of the city. It's a horticultural haven, with all kinds of interesting trees and plants. There's a rose garden at the east end. There are several memorials here and there. Spend five minute or two hours--whatever you have available.",
  "I've always loved walking around the Capitol.  All the way around it measures just a tad over 1 mile.  If you're into the sights around it there are plenty with the Rose Garden, The War Memorials and hopefully back soon the Koi pond.  There are many benches to take a break on while walking or a lot of grassy areas to sit down on and take in our wonderful sun.  During some walks I see groups of people doing exercise in one area and tai-chi in another area.  There is security usually very close which makes me feel as though this is a safe area to do walks or whatever.  \n\nThe length of a visit is solely on you so time is not important unless you're on a schedule.  \n\nThe site can be romantic, doing a picnic or just a casual walk.  \n\nIs this a must see?  That's a tough one.  I am happy to have found it so to me, it was a must see.",
  "In February and March, the camellia grove and magnolia trees are in full bloom! March through May, enjoy the azaleas and rhodies. Come May through October, the rose garden is incredible. ",
  "The park is an official arboretum with many types of plants, trees and flowers.  In January the camellias for which Sacramento is famous are in full bloom.  Try that in Buffalo!",
  "At the Capitol Park and its surroundings including the Capitol Mall, there is little to no police patrols, and lots of construction with dangerous and violent druggies scattered around waiting to harm and injure.  Be very, very careful.  The Capitol is a lovely building, but this is a very dangerous place.  I was attacked just a week ago, slammed to the ground and kicked in the head.  Robberies and thefts and harm here.",
  "Huge park with the state capitol building. Lots of different trees and places ot just sit and contemplate. ",
  "I always loved to go see the Christma Tree at Capitol Park in Sacarmento.  But this year, I was sorely disappointed with the one that Gavin Newsome, Governor of California, presented us with.\n\nit was tiny,  It had burned out lights. Ugh!   Merry Christmas to all  but hopefully next year we get to see a much better Christmas tree.\n\nI guess this was also tree number 2.  The first one they rejected and replaced it with this sad tree."
 ]
},{
 "name": "Sacramento Zoo",
 "address": "3930 W Land Park Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/e2/31/d5/tiger-1-he-was-far-enough.jpg",
 "tags": [
  "unique",
  "family",
  "kids",
  "knowledgeable",
  "affordable",
  "walk",
  "eat",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d127615-Reviews-Sacramento_Zoo-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Not huge, but they have a lot of animals in a clean well kept environment.  The giraffe exhibit is great as you go up a ramp to eye level with the giraffes.  There is a feeding experience as well.  The okapi are unique animals we have not seen at other zoos.  Stop by the reptile house to cool down on hot days.  Next time I want to take the little train around the zoo.",
  "I think this zoo is just the right size to take little ones to. Just as they get tired you have seen the whole zoo. The animals seem well taken care of and there is a good variety.",
  "If you haven't been to the Sacramento Zoo you need to check it out anew.  From the baby Snow Leopard to all the wonderful primates and of course the original tall boys it's a great family outing.  And don't miss the delightful gift store!",
  "I had not been to the Sac Zoo in some time. I brought the grandchildren here and it did not disappoint. The male Lion put on a show , just amazing. ",
  "We have a membership to the zoo, and we do not even have kids. Nestled right near William Land Park in Sacramento, you are able to get up close and personal with giraffes, lions, gibbons, meerkats, and so much more! With over 500 animals, including exotic and endangered varieties, there is something for everyone. They host special events, have a Zoo Train, and the staff are very knowledgeable about their inhabitants. There may be no way that you would ever think that all of these animals could be right in your backyard, but guess again! Please do something for yourself, and put this affordable outing on your calendar today...you will not regret it. No doubt that your children or grandchildren will certainly enjoy seeing the animals, but then again, so will you!",
  "We have lived in Sacramento for years but this was our first visit to the zoo.  We found parking on the street easy and only a quick walk to the gate.  We brought a lunch with us and had no problem bringing it into the zoo(there are tables throughout to eat at).  There is some construction going on for a crocodile area right when you walk into the zoo.  the train ride is to the left as you enter and is $4 PP and the carousel is $3 PP.  We chose to walk counter clock wise beginning with the flamingo's.  There were life-like dinosaurs through out the zoo and the zoo staff had fun adding hats and decorations to them to make them look less scary(we appreciated this as we had 5 young grandkids with us).  there is a good variety of animals here and you are able to see them really well.  the male lion was really sounding off while we were there and you could hear him from all over the zoo.  We loved the red panda's and the flamingo's.  We had a great visit and will definitely be back.",
  "Small but interesting with animals in settings that allow easy photographing. We enjoyed the staff who gave an informative talk on the chimps. Parking is free and the cost for a ticket is reasonable - we paid the senior fee of $16.50 per ticket.",
  "This is very small place with no more then 100 animals including squirrels. Their biggest accomplishment is how many garbage was collected...\nYou need no more than 30 minutes for walk through all expositions. All attractions work with 30 minutes schedule after that workers leaving and coming tomorrow in an hour but line of people are huge and you probably have no chance to ride with your kid.\nI will not recommend to go there unless you really have nothing to do."
 ]
},{
 "name": "Leland Stanford Mansion State Historic Park",
 "address": "cnr of 8th and 'N' Sts cnr of 8th and 'N' Sts, Sacramento, California",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/64/37/46/leland-stanford-mansion.jpg",
 "tags": [
  "tour",
  "knowledgeable",
  "tour",
  "tour",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d531943-Reviews-Leland_Stanford_Mansion_State_Historic_Park-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "My husband and I  had a tour with Robin, she was so knowledgeable and interesting . Robin, made the tour  so much fun. The property was amazing.",
  "I went there during Martin Luther King's holiday weekend, January 18th. The entrance of the house area does not say you have to go to the visitor center and wait for the hourly tour. It is easy to get misinformed because the visitor center cannot be seen when you enter the premise. So I went to the main door of the house. It was already a bit open, so when I fully opened the door there was a tour guide with long blonde hair yelling at me \"No You CAN'T!\" and slammed the door at me. I can't believe the tour guide did that to me. It was absolutely inconsiderate because there was no sign on the door saying \"Do not enter\". She ruined my whole day and I really do not recommend this place to anyone planning to visit Sacramento.",
  "kind of a racist and felt like intimidated if she cannot be understood right away, no sense of hospitality, very rude. She thinks she's better than anybody else there. So sad, the mansion was renovated to entertain people from around the world but she failed to do it locally. I hope she will undergo extensive customer service training or might as well put on a job that is not a frontliner. What a disappointment to a California National Park.",
  "Small group tours, lovely property, interesting details about some of the original uses and furnishings.  Owners were the Stanfords who founded Stanford University in honor of their son who died at an early age.",
  "On the side of the Mansion, you will find a gate and a sidewalk that leads you to the back of the property. There you will find the visitor center -- which I found more interesting than the well-decorated rooms of the actual house. There are souvenirs, but also a fine background on the Stanfords and the house's history over time. For some reason, I found the work environments of the Capitol tour much more engaging than these domestic spaces ... even though the architecture and decor were from similar time periods. There is a person at the visitor center to tell you when the next free tour is. And there's a persimmon tree, one of the biggest ones I've seen -- reported to be nearly one hundred years old on the house's property. You'll pass by it on the way to the visitor center. I felt as if this sight could be missed if you had to choose where to spend your day in Sacramento. I found the references to anti-Chinese sentiments by the politicians to be interesting"
 ]
},{
 "name": "California Automobile Museum",
 "address": "2200 Front St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/42/7b/a5/early-elegance.jpg",
 "tags": [
  "knowledgeable",
  "unique",
  "walk",
  "knowledgeable",
  "eat",
  "walking",
  "unique",
  "tour",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d127612-Reviews-California_Automobile_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Gem of a place!  All sorts of great cars with knowledgeable docents to fill in the fun facts.  The 3 hours we spent went by in a flash.  Loved that there are opportunities to touch and sit in a few old cars.  $10 adult entry fee is a deal.  Current special exhibit is about microcars, which we found very interesting.",
  "Went there with a buddy, they had cars from the late 18 hundreds to more modern cars.  Wonder display of Model A's and T's.  Also several unique and rare models.  Spent several hours Oooing and Aahing. My favorite car was the DeLorian for the 1980's.",
  "Visited on a beautiful Sunday afternoon.  The building is very spacious and there is plenty of room to roam.  The cars are arranged in chronological order with plaque details telling you what you are looking at.  We were lucky to have docent Burl Skaggs trailing along with us, he was very informative and fun.  There are tableaus and props that showcase the beautiful cars. From vintage to celebrity-owned to high-performance there is something for everyone.",
  "We have visited the museum several times. It used to be called Towe Ford Museum but has been renamed California Automotive Museum. Usually there are very knowledgeable docents about willing to share their knowledge but today they were short staffed and not very engaging. The museum was very cold, as no heat or air, so dress accordingly. The cars are in excellent condition and a lot of fun to walk around seeing the various models. We noticed the inventory was less than in previous years. It was a rainy day and the museum fit the bill.",
  "Well worth a visit as there's something for everyone. \n\nIt can be a little cold in winter on the concrete floors but it's worth it.\n\nA variety of display cars from the 1900s through to the present day.\n\nGood photo ops where you can sit in cars too.\n\nThere's also a gift shop and somewhere to eat.",
  "We like old cars & trucks. But, I LOVE old campers. Excellent special exhibit, well displayed and the descriptions were great. Visit soon because the end (of the special exhibit) is near ;-)",
  "4 of us went there and spent over 2 hours walking around the museum.  Great nostalgia and eccentric assortment of cars.  Definitely worth the minimal entrance fee we thought.",
  "This museum is unique, you can see vintage cars in great shape and most people tend to go back and think of their youth or childhood.\nIt is located in a place with lots of parking and close to the Sacramento Rive",
  "Fabulous collection of autos w a few motorcycles thrown in. Huge place. A gentleman  volunteer offered us a \"tour\" and my wife and I accepted. Big mistake. Instead of focusing on the vehicles he began telling us stories about Henry Ford and various anecdotes about people in the industry at the expense of talking about the cars!\n  At first we were polite but after about a half hour we told him thanks but that we would continue on our own! We were there to see the cars not to talk about Henry Ford.It was surreal. Once we were on our own looking at the most wonderful collection of autos. well worth a visit!",
  "We arrived at the museum with only an hour to spend; wish we had allowed at least two or three hours to enjoy the property. As we arrived we were invited to join another guest for a tour with a very knowledgeable gentleman. It was with regret we took our leave having seen just a small part of the museum. Usually we would have wandered around by ourselves; take the time for a tour and you will gain so much more knowledge of the history of the automobile. ",
  "We have been to California Automobile Museum 3 times in the past 7 years.  Enjoyable visit each time.  A wide selection of vintage and classic cars.  Well cared for."
 ]
},{
 "name": "William Land Park",
 "address": "1702 Sutterville Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/0a/35/fb/william-land-park.jpg",
 "tags": [
  "kids",
  "theatre",
  "learn",
  "walking",
  "kids",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d128260-Reviews-William_Land_Park-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Look out for a large group of Moms running around the park with their kids, getting in a great work out and setting the best example for their kids to see. Fun for everyone involved. It is a beautiful park with so much space, baseball pitches, golf course, pond, theatre, amazing photography hot spots. ",
  "This wonderful park, 240 acres in total, and first laid out and planted in the 1920s, provides a place of refuge, relaxation and/or fun for Sacramentans of every age, race, and interest.  The Zoo and Fairy Tale Town interest the tiny ones; also, feeding the ducks in the duck ponds.  Baseball diamonds for middle-schoolers.  A 9-hole golf  course, not too difficult but quite attractive, and not very expensive, for those trying to learn the game.\n\nOn every major holiday, the park is crammed with people from probably fifty national and/or ethnic backgrounds, all apparently enjoying a fun or relaxing time in close proximity to teach other.   It provides a look at the broad cross-section of diversity that is the real Sacramento in 2012.",
  "This park has most of what you want in an urban park - wonderful zoo, 9-hole par 3-4 golf course, several picnic and play areas, soccer fields, baseball fields, walking areas, jogging trail of about 2 miles, and Funderland (rides) and Fairytale Town (exploring) for the wee ones.  Tends to be busy on the weekends in good weather.  Get the first parking place you can!",
  "William Land Park is a Sacramento gem. We have been sheltering-in March 13th. We had to get out and WLP was a wonderful refuge. The flowers were in bloom, people were walking and practicing social distancing, kids were running and playing. About half adults were wearing masks???\nThere are picnic tables across the way but there was signage \"Do Not Use\" Dam this pandemic!\nI just live this park. \n",
  "Remarkable foresight to save this huge property and park.  A classic great city part, included open spaces, lots of green and trees and paths, softball fields, terrific 9 hole golf course, and a zoo.  bustling withe neighborhood activities ",
  "This place has it all from the 11 acre zoo to FairyTale Town and many types of recreation. You would never know it was once a swamp. You can catch fish in one of the two ponds, feed the ducks or enjoy a game of base ball on one of the baseball fields. Most of all I have enjoyed playing gold many times on the 9 hole course with two of the Best Holes in the Sacramento area (the par 3 3rd and the par 5 8th hole). There is  a carnival themed area with a small rollercoaster, train and merry-go-round. Great place to picnic on a warm summer day in Sacramento.",
  "Took my grandkids to Land Park to play on the play structures. They loved feeding the ducks and chasing the squirrels. Street parking can be a challenge.",
  "Daughter has moved to the area and places for kids to play are limited. This park is large and very accessible. The play areas are filled with playground equipment that all age children can enjoy. Lots of shade trees and benches for adults to watch the children play. Hubby played golf with our grandsons at the course in the park and said it was quite nice. Many other features of the park but we weren't able to visit, daughter said the Zoo is quite nice."
 ]
},{
 "name": "Tower Bridge",
 "address": "342 L Street",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/3f/2d/08/tower-bridge-sacramento.jpg",
 "tags": [
  "walk",
  "walking",
  "tour",
  "historic",
  "history",
  "walk",
  "learn",
  "structure",
  "eat",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d6394988-Reviews-Tower_Bridge-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "An interesting and historic lift bridge along the Sacramento River separating Sacramento, Sacramento county from West Sacramento of Yolo county.  The bridge does occasionally lift up for   boat crossings.  It was painted a rusty orange which has now oxidized to it's current gold color the color of the Golden State with it's gold rush history.  The bridge has pedestrian pathways on both sides.  Visitors can tour downtown Sac walking through Old Sac old town along the river piers and then cross the bridge and walk along the river shore pedestrian walk on the west side, or catch a baseball game.  Fireworks is shot off on west of the bridge during Fourth of July and New Years Eve. ",
  "Great to learn more about this iconic structure. Really good views from the walk ways on both sides, not to mention the glass flòor. If you have a rail csrd it is 2 for 1 entry, and well worth it. Even the engines are remarkable. Walk to the Belfast for coffee and cake afterwards.",
  "I work right next to this landmark.  It's a beautiful view from my office window.  And, an even better view of the capitol down the street. And, right next to Old Sacramento with lots of places to see and places to eat.     ",
  "We had a nice view of Tower Bridge when we were dining at Joe's Crab Shack in Old Sacramento.   Tower Bridge crosses over the Sacramento River.",
  "Historically, this bridge is unique and fascinating. The yellow color stands out as you’re driving old town and beckons your visit. Seasonally, they do a dinner fundraiser on the bridge. Look for it!"
 ]
},{
 "name": "McKinley Park",
 "address": "3330 McKinley Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d3/5c/60/photo2jpg.jpg",
 "tags": [
  "food",
  "library",
  "free",
  "kids",
  "family",
  "walk",
  "art",
  "drink",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d128384-Reviews-McKinley_Park-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a small park with nothing special about it--except the roses, when in bloom!--except for the friendliness and diversity of the people. It is not a grand attraction but a nice place to go for a few hours relaxation. There are no concessions so get some picnic food before hand.",
  "McKinley Park is a local favorite.  You will see that it is well used.  Everyday, no matter what hour, you will see residents and visitors enjoying this beautiful park.  On Saturdays during the warmer weather, a free Yoga in the Park session is held at 9 am behind the Rose Garden.  All are welcome.  Just come and bring your yoga mat.  During the winter the session is held indoors at the Clunie Clubhouse in the park and there is a fee.  In the warmer weather there is a small farm stand selling locally grown organic produce (generally May through October)..  Special events held at the park include a fun Easter Egg Hunt for young children, pancake breakfasts and, inexpensive book sales at the library branch inside the clubhouse to name a few.  Other attractions include a great playground for young children which a toddler area, the duck pond for viewing and feeding the birds, and a decomposed granite track around the park for joggers.  Also in the park is a pool which hosts various classes and lap swim programs.  Lighted tennis courts are available and the rose garden has recently been re-done to better accommodate weddings and special events.",
  "We have family that lives just under a mile from the park, so we come here when we visit. The playground is new within the last two years and is great for little ones and bigger ones up until about nine. The gravel jogging paths are popular and in good shape. The duck pond has  a nice selection of ducks for the kids to see just watch your step!\n\nThere is a lovely garden, however, I cannot comment as we typically come in the winter and do not see it in bloom. \n\nAs for the homeless population, yes there is one in the park. I have never had a problem with anyone here and I have run several times here alone and I am female. I think you are more likely to have a run in with an overzealous toddler at the playground than one of the guys hanging out in the park area. This is a city park and as such I think one just needs to be aware of their surroundings. \n\nAs others noted, this place is very popular on the weekends. \n\nThe bathrooms are not lovely but work in an emergency...",
  "During the COVID-19 pandemic the park had some visitors, all wearing masks and social distancing. The rise garden was in full bloom and the Canadian geese and Mallards were enjoying the pond with their new chicks.\n\nThe McKinley Vault is still under construction and the laughter of children was absent from the play area.\n\nStill a beautiful day a McKinley Park.",
  "We went to McKinley park to witness the changes... very disappointed. We love McKinley Park and often go on a weekend to walk around and enjoy the park. One improvement was the pond. The drunks or druggies passed out on the pathway in the rose garden was troublesome.\nIt is a shame that a few spoil it for the rest of us.",
  "I've been to McKinley Park to enjoy the stunning Rose Garden in the summer, as well as to play tennis a couple of times. I always make sure I get there with an empty bladder because all they have is a nasty Andy Gump. I'm not sure why the bathrooms there are always locked, but perhaps one day they will be open. Fingers are crossed, as I'd love to spend more time at that park. ",
  "Please love color and seek it out and if you do you will find it here. The roses bloom regardless of their color so what they give us is nothing they need. It is their equivalent of art: useless, impractical and so necessary. Benches are a good place to have a sandwich from Roxys while your eyes drink in this rose carnival. Enjoy.",
  "as a business woman i dont often take time to lets say \"smell the roses\" this park was reecommended to meas it was near my hotel. enjoyed walking thier walks and taking in the beautty of Sacramento outdoors."
 ]
},{
 "name": "Funderland Park",
 "address": "1350 17th Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a4/d1/f5/park-entrance.jpg",
 "tags": [
  "kids",
  "food",
  "walk",
  "kids",
  "kids",
  "walk",
  "kids",
  "kids",
  "free",
  "kids",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d630581-Reviews-Funderland_Park-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great place to take kids for a day out. Inside the wonderful William Land Park (also home to the Sacramento Zoo and Fairytale Town) this small amusement park is a perfect size for kids. An unlimited ride wristband is $19 and there are a good variety of rides. There is one ride for children smaller than 36” only. Children under 36” must have someone ride with them on all the other rides. And there is one or two that under 36” can’t ride. Went with my two granddaughters (ages 5 and 7) for three or so hours and took a picnic lunch. They have a small concession stand with hot dogs and popcorn, and snow cones, but you can also bring in your own food and they have number of shaded picnic tables, including group areas, or you can just go out to the main park area if you prefer. There are a lot of mature trees that provide good shade throughout the park, which helps tremendously on hot summer days. There is no entrance fee, only for the rides and concessions.",
  "From plain, trains to automobiles, even a little roller coaster and Mary Go Round to soft moving octopus to keep toddlers to pre-teens occupied",
  "Visited my niece and kids 11,6 and 4 and had a really good time at Funderland. The ride operators were super nice but held to the rules on height and weight, some more for the sake of the antique rides than passenger safety but that’s ok too. It’s nice to have tickets for rides and not an entrance fee, and parking was available with a short walk. I loved the roller coaster, just my speed!!",
  "Great little amusement park for the toddler to taller crowd. carousel, train, roller coaster, octopus ride, teacups and little autotopia cars. There's a log (water) ride, but often closed down. IIRC, the park didn't take cc for payment, so bring some cash. There's a snack bar there, but mostly snack foods (ICEE, hot dog, popcorn). If you want something better, I'd suggest bringing it and sitting at a park bench in the park. (Maybe go get a pony ride for $1-2). ",
  "Funderland has been around a long time, and the rides haven't really changed.  \n\nRecently, the log ride was removed to install a swing ride, but the condition of the log ride is indicative of the park as a whole these days.\n\nThe logs would become filled with water and would be unable to make it up the belt, which wasn't a very steep incline, and throughout the day, the ride would have to be closed to drain the logs.\n\nThey have tried to make small improvements here and there, but the fish ride was here 40 years ago, the dragon roller coaster, the little driving cars, the train---these rides have all been here for the past several decades.  The teacup ride is bumpy and loud, and needs an overhaul.\n\nI don't know who owns this park, but it could really use a fundraiser, or a Go Fund Me page, or something, in order to change it up a bit.\n\nThat said, little bitty kids will have a blast here.  Everyone loves the train and the driving cars, and the dragon roller coaster provides mild thrills for older kids.  Anyone over the age of 11 might not have such a great day here, though.  It's kind of a baby park.\n\nThey offer birthday parties, which is nice, so if your 7 or 8 year old is in need of a venue, this would be a good place for that.  \n\nIt would be nice if the park expanded its boundaries just a bit and added a few more attractions.  There isn't much they can do on the 4 acres they have now.\n\nOverall, the park is clean and nearly everyone who visits is cool, but once in awhile you'll bump into one of THOSE families who swear at their kids, and who smoke in the park.\n\nVisiting during the week, especially on a Wednesday is best.  \n\nThey offer books of tickets or wristbands so a person can customize visits according to budgets.",
  "This is a small area with kiddie rides for the toddler - pre-school set.  The rides are the standards - a train ride, a small roller coaster, little cars, etc.  The prices are a little high, but if you are a local or visit often, you can purchase an annual pass.  The place is fairly clean.  There is a small snack shop and eating area as well.  This is close to the Fairyland and the zoo, so you can hit all three in a single trip.",
  "Visited my niece and kids 11,6 and 4 and had a really good time at Funderland. The ride operators were super nice but held to the rules on height and weight, some more for the sake of the antique rides than passenger safety but that’s ok too. It’s nice to have tickets for rides and not an entrance fee, and parking was available with a short walk. I loved the roller coaster, just my speed!!",
  "Located in William Land Park, this histiric place is a great place to take young children. Our granddaughters are 11 and 8 years old and love the place. Entrance to the park is free. The only cost are rides and snacks. They have a great, classic Marry-go-round. It's a small park, so you can sit and watch the kids have fun from almost anywhere. We bought the unlimited ride package for the girls and with a coupon it was under $20. A good place to spend a lovely summer day for 2 or 3 hours. A picnic in Land Park is a good compliment to this visit.",
  "This is a great place to take kids for a day out. Inside the wonderful William Land Park (also home to the Sacramento Zoo and Fairytale Town) this small amusement park is a perfect size for kids. An unlimited ride wristband is $19 and there are a good variety of rides. There is one ride for children smaller than 36” only. Children under 36” must have someone ride with them on all the other rides. And there is one or two that under 36” can’t ride. Went with my two granddaughters (ages 5 and 7) for three or so hours and took a picnic lunch. They have a small concession stand with hot dogs and popcorn, and snow cones, but you can also bring in your own food and they have number of shaded picnic tables, including group areas, or you can just go out to the main park area if you prefer. There are a lot of mature trees that provide good shade throughout the park, which helps tremendously on hot summer days. There is no entrance fee, only for the rides and concessions.",
  "I have been going to Funderland Park for over 25 years. My children always loved this place now my grand children get to also enjoy it. Be aware that parking is a challenge if you do not arrive early but people are always coming and going so don't be discouraged. ",
  "There are a few placed in Sac you have to visit at least once when you have littles ones and this in once of those places.  Old time rides in a small venue"
 ]
},{
 "name": "Golden 1 Center",
 "address": "500 David J Stern Walk",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/f6/67/3d/this-is-the-picture-of.jpg",
 "tags": [
  "eat",
  "drink",
  "eat",
  "drink",
  "walking",
  "food",
  "food",
  "drink",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d11662834-Reviews-Golden_1_Center-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Golden 1 Arena in downtown Sacramento is a newly built venue that will host hundreds of concerts and sports events annually. Of course, it's also home of the Sacramento Kings NBA basketball team. \n\nYou'll need to plan ahead for parking (or transit). I recommend the Best Parking app to show the closest parking lots, including prices and availability. \n\nIf you're coming to attend a concert, the acoustics likely won't be right until mid-2017 as many factors will affect the sound quality and soundstage experience. \n\nBiggest drawback (for most) will be the cost. Ridiculously high food/drink prices will be off-putting for many. If you've the time, there are many excellent restaurant/bar choices within a few blocks of the arena, so you may choose to eat & drink prior to coming. \n\nIf you're here to eat and drink, bring a fistful-o-fifties 'cuz you'll need it. Lots of choices however, including local restaurants and on the top floor, the Sierra Nevada tap room.",
  "Golden 1 Center is not just for the Kings!  It is a great venue that has attracted many artists for concerts, etc.  It has also attracted lots of new businesses including shopping and eating businesses.  Look into using public transportation or services such as Uber or Lyft instead of parking, which can be challenging. ",
  "Golden 1 Arena in downtown Sacramento is a newly built venue that will host hundreds of concerts and sports events annually. Of course, it's also home of the Sacramento Kings NBA basketball team. \n\nYou'll need to plan ahead for parking (or transit). I recommend the Best Parking app to show the closest parking lots, including prices and availability. \n\nIf you're coming to attend a concert, the acoustics likely won't be right until mid-2017 as many factors will affect the sound quality and soundstage experience. \n\nBiggest drawback (for most) will be the cost. Ridiculously high food/drink prices will be off-putting for many. If you've the time, there are many excellent restaurant/bar choices within a few blocks of the arena, so you may choose to eat & drink prior to coming. \n\nIf you're here to eat and drink, bring a fistful-o-fifties 'cuz you'll need it. Lots of choices however, including local restaurants and on the top floor, the Sierra Nevada tap room.",
  "Had a lovely evening at the Maranda Lambert Concert fantastic as always \nThe venue is absolutely amazing plenty of rest rooms\nAnd facilities had an amazing time with my girlfriend",
  "Great place to watch NBA action, love the downtown arena and the feeling of walking around after a Kings win! Amazing improvement on ARCO (although I'll always love the old gym!) and still feel close to the action on the lower deck. The food at the concessions could be better though. Sacramento and the fans deserve this downtown gem. GO KINGS!",
  "First visit to Golden 1 Center  I was skeptical at first but the venue is spacious and fairly easy to navigate. The sound system was amazing and loved  the Monster truck show. ",
  "We came here for the Miranda Lambert Concert! Entry into the venue was rather easy, even with the large number of people.  First time here and it was easy to find our seats with the guidance of the friendly guides and ushers. The center was clean and the seats very good. The concert was great, sound and video displays too! Leaving and back to our hotel was also easy. ",
  "The Golden 1 Center is a very nice arena. Pretty new, lots of good food in the concourses but prices are seriously ridiculous. Went to the Kings/Spurs game and spent $24 for a pulled pork grilled cheese sandwich that was delicious and a Stella Artois beer. Needless to say that was my full enjoyment of food or drink at the Center. Ridiculous!! Location in town on that mall is great. Makes for a great pregame or postgame experience with all the restaurants and bars to choose from.  "
 ]
},{
 "name": "American River Parkway",
 "address": "Discovery Park to Hazel Avenue 4,800-acres of Public Park Along 23 Miles of River",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/01/34/96/photo1jpg.jpg",
 "tags": [
  "family",
  "parks",
  "nature",
  "free",
  "nature",
  "walking",
  "parks",
  "walking",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d128282-Reviews-American_River_Parkway-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "We parked at the fish hatchery at Hazel Avenue, unloaded our bikes and rode 11 miles down stream . . . and back.  It was 10:30 on Sunday morning and the trail was heavily used by walkers, runners, rollerbladers and bikers.  But even with this traffic, our group of three bikers had no problem keeping a 12-15 MPH pace.  The trail is sufficiently wide and well-marked through beautifully cool oak groves.  We watched a mother deer and her faun munch alongside the trail.  We could constantly catch glimpses of geese, mergansers, ducks and a Great Blue Heron on the river.  They seemed oblivious to the constant flow of rafts and canoes wending their way down stream.  Do the same ride on a week day morning and you'd think it was your own private game reserve.  The American River Parkway is precious vein of gold that runs through our communities.",
  "I've spent probably YEARS of my life riding up and back on the bike path.  It is like taking a step out of the urban environment into an ever changing reparian wooded park.  There are water fountains along the bike path so you don't have to bring tons of water.  Other large family parks pop up along the way.  Those large parks are great start/end areas where you can bring your family and have a fun day playing and BBQ'ing.  At one end (Folsom) is Folsom Lake.  Then you're near Old Town Folsom, the fish hatchery near Hazel Ave.  At the west end, the park begins (or ends) at the confluence of the American and Sacramento Rivers at a HUGE park, Discovery Park.  A short distance away is Old Town Sacramento and the Railroad Museum.  The ARP is simply the greatest asset to the Sacramento Area.  I love it.  ",
  "I love the Parkway. 15 years ago we moved within a mile of access to the parkway, and I became a regular runner on the trails. Over the years, I have seen deer, coyotes, beaver, otters,  squirrels, egrets, geese, ducks, heron, snakes and assorted other animals and birds. I never tire of the gorgeous scenery, views of the river, plants and wildlife. Truly a gem. ",
  "Best river outdoors experience in local Sacto area. Sacramento County has cut back on maintaining parkway and Ranger patrols. Lock your cars and watch out for the homeless folks. Autos pay for parking. Best by bike.",
  "The parkway is actually called the Jedidiah Smith Parkway, in honor of an early, pre-Gold Rush explorer. It stretches almost 30 miles from Folsom Lake to just south and east of the Old Sacramento junction of the American River with the Sacramento River. It is paved and well maintained. Parking at several access points along the way are numerous and some locations are even free. An annual parking pass provides very inexpensive, close-in parking for about $50.00. Day passes for $5.00 are also sold at key points. The Parkway is open to bicycles, skaters (not boarders), cyclists, walkers and joggers. Some parking in residential areas close to access points is controlled where it has become a nuisance for homeowners. Closer to Downtown Sacramento, periodic homeless encampments are at least an eyesore with trash and rare panhandling, and may cause safety concerns. In reality, few incidents that are truly threatening occur given the very large number of people who use the Parkway. Deer, coyote, rabbits and several birds, with local and migratory are sighted along the path, especially in early morning and dusk hours. Dogs must be on a leash. Walkers and joggers are asked to stay on the left side of the path, facing bicycle traffic. All in all, a respite in nature in a safe and clean suburban and  inner city environment.",
  "The parkway along the American River runs from downtown all the way to Folsom Lake, 30 miles away.  The bike trail is totally safe, off-road from the traffic where you can ride along the river and through several parks.  There are also many walking trails off the bike path, which can get busy with bike traffic, especially on weekends, or early morning when cyclists are zooming to get in their morning exercise before their days work.  Take a horse trail path and enjoy the serenity of the river, or take a picnic and enjoy the parks and nature.  We are so fortunate to have this awesome parkway stretching across our city and suburbs!  ",
  "For anyone that loves the outdoors this is a must.  Multiple picnic areas accessible by car and bike. American river. Is clean and very scenic.  Bike bath also has a shoulder for running and walking.  All the picnic areas have bathrooms.  ",
  "This is a LONG parkway. The further away from downtown, the better. Near the central city and Discovery park, it is impossible to avoid homeless camps including trash, hypodermic needs, and other unmentionable things. There aren't any real bath facilities. If you decide to walk the trails, be on the lookout for cyclists - there are been some very bad collisions with pedestrians. Better to walk on the levee along the Sacramento River starting near Broadway.",
  "American River Parkway was beautiful at one time, now it is trashed with homeless camps and irresponsible teenagers",
  "Lack of bathroom. Construction sites in the park. Homeless people walking around. Only the boat launching dock looks good.",
  "I have used this bike trail for over 100 times, and I continue to do this weekly.It is common to see families, friends, and outstanding cyclists.\n\nI started back in the 60's and I still bike with friends on weekly trips."
 ]
},{
 "name": "Sacramento History Museum",
 "address": "101 I St Open Seven Days A Week",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/05/70/02/sacramento-history-museum.jpg",
 "tags": [
  "history",
  "history",
  "kids",
  "tour",
  "knowledgeable",
  "tour",
  "history",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d3539208-Reviews-Sacramento_History_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Sacramento History Museum often gets overlooked because of its proximity to the Railroad museum - both are quite good and worth the time.",
  "This museum has important information regarding the history of Sacramento and California.  This is a great place to take the children.  Visit it in the spring so you can take the underground tours.",
  "This museum was larger than I thought and offers a whole lot more than I thought. A lot of the display is about the Gold Discovery and you can actually see samples of gold and gold embedded in quartz (which is all alarmed behind glass) and there was A LOT of kids activities where they could match questions and answers, open lids and see displays, and step up to displays to see closer. Very nicely done.  I was most fascinated to see the photos of Sacramento through the years. There was one that one of the volunteer costumed characters showed me of Sacramento before the Highway 80 corridor came through and one after.\nAlso a lot of agricultural machinery on display from 100 year old business still in existence.  Definitely worth the wait to get in and it's set up so you wind around and don't get confused as to where you are.  I'm looking forward to going back and taking some of the side tours.",
  "We planned to visit this museum in addition to the Railroad museum, but in the event the Railroad museum was closed, so we spent longer here, and took the old town/ underground tour. We learned such a lot about the development of the town in the second half of the 19th century and talked to knowledgeable employees who were ready to answer questions in a warm and friendly way. It wasn't that we had anticipated anything bad, or even mediocre, it just turned out to be really good.",
  "Next door to the CA railroad museum and in the heart of old town, it was very interesting.  Worth a look",
  "I actually visited in June 2018, however due to travelling all over the world for the last 18 months, I am just in the process of writing all the reviews.  This is quite a small museum and probably only takes just over an hour to see everything.  Its focus is more on artefacts and specific areas of history than general Sacramento history.  There’s an exhibit which focuses on the canning industry.  A small selection of the museum focuses on the printing press and another on the people and photographs of Old Sac.  The best exhibit in the museum though is the mining gold rush exhibit.  It covers the basic history but it also includes 4 cases of gold!  There’s gold attached to other minerals, gold speckles and flakes, gold nuggets and gold jewellery to show what the gold has become.\n \nTo be honest, other than the gold, the museum isn’t really worth it especially if you go to the Capitol and the California Museum as well.  However it is half off if you book one of their guided tours as well and this definitely is worth doing!  I did the Underground Tour which focuses on the flooding problem in the city back in the 1850-60s.  Our tour guide, Rose, was dressed in period clothing and she was very entertaining throughout the hour tour!  The tour starts above ground and offers two separate opportunities to go underground to the original city level.  The tour also includes some personal stories about people who lived in that time period as well as local businesses in operation.  There’s also an underground space which was cemented over the top of the original first floor which has preserved a lot of the belongings left behind from that time period which is pretty cool!  It was a really interesting tour!  I 100% recommend doing this!",
  "If you like history as I do be sure to chech this place out for yourself. \n\nAs a tourist I can't offer much on Sacramento history but the pictures, exhibits and stories give a well rounded of this fascinating city and it's past. \n\nClearly another of the hidden gems of a great city. ",
  "This little history museum is to the back corner of Old Sacramento. While small, it gave the history of Sutter, mining, canneries, floods and fires. It's well layed out, very colorful with lots of videos to watch...the third floor gold was a WOW!"
 ]
},{
 "name": "Loch Leven Lakes Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/5f/be/56/loch-leven-lakes-trail.jpg",
 "tags": [
  "hike",
  "hike",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d142481-Reviews-Loch_Leven_Lakes_Trail-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "We've made three visits to the lakes. Beautiful and accessible to most of California but plenty remote once you have made it up the trail. The trail is a little hard to follow in parts but provides a nice route if you are observant. Once we were a little tardy coming down at the end of the day and made a wrong turn which almost became a problem in the dark but I managed to find the path. Well worth the trouble to spend a day or if you are up to it carry a sleeping bag and spend a few days in peace and relative solitude. Snow closes the trail most winters.",
  "This trail is hard to follow in the beginning of the hike. We were able to navigate with a map app. Trail is easy to follow after you cross rail road tracks.",
  "While Sacramento was experiencing 105 degrees this weekend, we decided to run for the hills to hopefully cool off. Upon arrival and throughout the hike, we experienced 90 degree temperatures that were not as cool as we had hoped, and to put it frankly, was very hot. This being said, we brought plenty of water to last us for the duration of the afternoon, so that was a great start! The trail elevations range from 5680 to 6850 feet, so please be aware of this before approaching from the Sacramento valley. Also, this hike is listed as Sacramento, but is actually about 1 hour and 15 minutes away...so it is actually closer to Truckee off of I-80. The hike itself is a classic Tahoe forest trail including junipers, pines, and ferns. Bluebird days bring summer wildflowers like columbine, asters, and wild snapdragon. Beautiful views and clear lakes are up there waiting for you!\n\nHowever, let's take a few minutes to make you aware of some things that you may not have prepared for. First off, this is a dog-friendly trail, and only one of the many dogs we happened across was on-leash. Today, we saw just as many dogs swimming in the lakes as we did humans. Secondly, the trail itself is not clearly marked from either direction. While there are a few wooden signs nailed to trees saying, \"trail\", many of the directional trail markers are cairns that folks have left to hopefully point the way. We did get lost a few times, as the trail wandered through expansive unmarked granite slabs. Leaving middle lake to get to upper lake left us on a different adventure altogether, but we stayed level-headed and pushed forward. Lastly, if you have bad knees or ankles, this may not be the best hike for you. The moderate rating includes lots of steep uphill with switchbacks, making for steep downhills on the way back out. Altogether, the trail is 7.2 miles long total to upper lake (3.6 miles out, and 3.6 miles back). Get there early, be prepared, and wear good hiking shoes. Bring your trekking poles if you need them.\n\nAll this being said, we had a nice time and really loved the scenery and smells that Loch Leven Lakes had to offer. We also realized that this would be a great place to ease into preparing yourself for some longer backpacking trips, so get out there and enjoy it too!",
  "Just west of Truckee is this popular hiking trail just off I-80 between the Big Bend and Rainbow exits. I began hiking this trail in the late ‘70’s, many times in the ‘80’s, so it was time to go back again. The lakes are scenic with interesting rock formations nearby and smalll islands inside some of the lakes. We expected the larger crowd on this Sunday  day hike, and all the cars parked at the trail head was a good indicator, but by the time everyone is at the lakes you do not feel overwhelmed by that. What stood out to us was how much the trail has been impacted by erosion over the decades since we last hiked up.  After the first mile, past railway tracks, begins a mile or so of switchbacks through the forest leading to the lakes. This part of the trail is no longer a dirt path, but full of talus and scree - boulders and loose rock. It can be very dangerous and takes a lot of effort and slows you down, especially going downhill. Hiking poles help so much. Plus you gotta be in good condition. We were fine getting to the lakes, but the downhill part was long and difficult, especially after hiking to all the lakes. If my knee wasn’t in so much pain from the stress of descending, the hike would have been much better. Mostly saw people in their 20’s up there with us standing out as the gray haired ones. Glad I got up there again one last time but the trail leading to it was terrible.",
  "Moderate hike within about an hour from Sacramento.  Such a sweet discovery to hike for 4 miles and be treated to 3 mountain top hikes!  I go at least a couple times every summer.  Love it!"
 ]
},{
 "name": "Old Sacramento Schoolhouse Museum",
 "address": "1200 Front St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/dd/cf/3f/old-sacramento-schoolhouse.jpg",
 "tags": [
  "walk",
  "history",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d6740457-Reviews-Old_Sacramento_Schoolhouse_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Worth a quick visit and certainly if you have a school-age child with you, they should be fascinated with the comparison to their school. Volunteer guide/teacher is knowlegeable, pleasant and keen to inform..Free entry and, depending on child's reaction, should need 10-15 minutes of your time.",
  "I want to commend Ana Quintana who  is outstanding in customer service. She knows her repeat customers and I am always greated with a smile and a hug. In observing her she treats all her customers with kindness and efficiency.  I will wait as long as necessary to make sure I get Ana and heard the same comment from many others.  I requested to talk with Omar, the restaurant manager and he treated me with kindness and confirmed he had gotten lots of comments from others about Ana. I was impressed that Omar took the time to listen. \nPlease do whatever it takes to keep Ana because she represents your restaurant in a most positive way.  Also I have eaten there many times and always enjoy the great selection of foods.",
  "Clean, not much history demonstrated or detailed. It is a short walk to the other site seeing areas and restrauants/bars in the area.",
  "It's set up just like students will be coming in at any time! Staffed by volunteers who help make history come alive. ",
  "What a great surprise to find this little place. Lots of history, old newspapers and so on.  Just fun to read about the early years and trying to scratch out a city. "
 ]
},{
 "name": "California State Indian Museum",
 "address": "2618 K St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/56/43/de/20180617-170935-largejpg.jpg",
 "tags": [
  "walk",
  "history",
  "historic",
  "kids",
  "eat",
  "learn",
  "knowledgeable",
  "walk",
  "history",
  "historic",
  "kids",
  "eat",
  "learn",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d127632-Reviews-California_State_Indian_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wonderful museum with some really interesting exhibits on the native people of California, with great documentation and artifacts.  While the museum is somewhat small, its definitely worth spending an hour and is also located a couple minutes walk from the Sutter's Fort State Historic Site (located around the same park), which it complements well from a history perspective.  Definitely worth spending about an hour.",
  "First, the focus is on a few California tribes - nothing on the Plains Indians, their iconic costumes, or wars.  Perhaps this is why some were disappointed.  And not too much that would catch the eye for young kids.  The displays and the photographs are very complete, within their chosen, limited areas, and the descriptions are full of detail.  If you take the time to read them you will learn a lot.  I particularly enjoyed seeing samples of all the types of California acorns, their leaves, and how acorn mush was prepared, and its specialized utensils. (It was suggested that as much as 80% of their diet was acorn mush.)  And there was a good deal more on the huge variety plants used daily for eating, making rope, or thread, soap, etc. There are an impressive number of original artifacts (as well as a very knowledgeable and helpful docent).\n\nI was surprised to learn that if you pounded small animals and birds lightly, you could break up their bones, and then eat the entire animal.  And of interest was how these, and every thing else, was cooked, in a culture with no pots..  (And, how they were caught.) \n\nDress, culture, and ceremonies were also covered in some detail. \n\nMy wife and I have visited quite a number of Indian museums and certainly some were bigger, but this particular museum, while small, was still excellent and a bargain for $5.00",
  "This small but powerful museum is an historical representation of our early Native American societies in California. It has done a superb job of sharing an excellent historical preview of the lives of these tribal societies before, during, and after the fated invasion of the Spanish through an abundance of photographs, rich and authentic visuals and artifacts and documents.  It is a place of respect and humility. Children and adults should experience this educational awakening. This is a museum of reflection. I felt like a student again. This gem is awesome! This was our last day in Sacramento. Thank you!!!",
  "Good for adults that appreciate indian information, but for children it might be a challenge",
  "This is a very interesting place for anyone who wants to know about California's native people.  The Indian Museum is on the grounds of Sutter's Fort, and it's well worth a visit, especially if you are taking a look at the fort.",
  "I loved this small museum. Although it is small it is worth a visit especially if you are visiting Sutters Fort at the same time.",
  "This modest sized Museum is worthy of your thoughtful visit. The Native Ranger on duty brought several displays to life for us with his knowledge, insight and passion!",
  "Wonderful museum with some really interesting exhibits on the native people of California, with great documentation and artifacts.  While the museum is somewhat small, its definitely worth spending an hour and is also located a couple minutes walk from the Sutter's Fort State Historic Site (located around the same park), which it complements well from a history perspective.  Definitely worth spending about an hour.",
  "First, the focus is on a few California tribes - nothing on the Plains Indians, their iconic costumes, or wars.  Perhaps this is why some were disappointed.  And not too much that would catch the eye for young kids.  The displays and the photographs are very complete, within their chosen, limited areas, and the descriptions are full of detail.  If you take the time to read them you will learn a lot.  I particularly enjoyed seeing samples of all the types of California acorns, their leaves, and how acorn mush was prepared, and its specialized utensils. (It was suggested that as much as 80% of their diet was acorn mush.)  And there was a good deal more on the huge variety plants used daily for eating, making rope, or thread, soap, etc. There are an impressive number of original artifacts (as well as a very knowledgeable and helpful docent).\n\nI was surprised to learn that if you pounded small animals and birds lightly, you could break up their bones, and then eat the entire animal.  And of interest was how these, and every thing else, was cooked, in a culture with no pots..  (And, how they were caught.) \n\nDress, culture, and ceremonies were also covered in some detail. \n\nMy wife and I have visited quite a number of Indian museums and certainly some were bigger, but this particular museum, while small, was still excellent and a bargain for $5.00",
  "Considering the name I thought the place would be more. Small museum, lots of baskets, few artifacts. Sorry guys, LA's Autry Museum has you beat by far!",
  "This is the one place we highlighted as a \"donʻt miss\".  While there were interesting and well done exhibits, the extent of the offerings were very small.  As California and that area have many native tribes, we expected much more."
 ]
},{
 "name": "Governor's Mansion",
 "address": "1526 H St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/24/6c/c1/governor-s-mansion.jpg",
 "tags": [
  "tour",
  "free",
  "walk",
  "tour",
  "history",
  "tour",
  "parks",
  "walk",
  "history",
  "tour",
  "parks",
  "tour",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d127626-Reviews-Governor_s_Mansion-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "My mom and I parked nearby (Sunday parking on the street is free) and walked around the property. A Google search brings up an interesting article from 2015 about Governor Jerry Brown moving back into the mansion after restoration. And although not necessarily current, the CA Park Service has a good article which is basically the wording a tour guide used when the mansion was open for tours. \n\nThe house is beautiful and worth a stop. It didn't appear anyone lived in the house, but a door to the carriage house was open so I'm not sure. ",
  "I love Home tours and this one is great, enhanced by the factual and anecdotal knowledge revealed by the State park Guides as you travel through the reflection of Leland Stanford embedded in his former home. A must see, and only a few blocks from the Capitol, an easy walk.",
  "Enjoy a tour of the old Governor's Mansion. A lot of history in that old building. Well worth the time spent visiting. take the time while in Sacramento to check it out. You won't be sorry.",
  "Although we live in Sacramento, we had never visited the Governor's mansion so thought it was about time.  They have tours on the hour and are open from 10am to 5pm, Wednesday through Sunday.  The tours last from 30 minutes to an hour, based on the size of the group and questions.  Our tour had more children which made it fun but probably on the longer side (almost an hour).  The mansion was built in 1877 as a private residence but since the early 1900s, it was home to 13 of California's Governors.  Since the late 60s, it has been run by the State Parks.  You can see items from various eras--furnishings, TVs, phones, appliances, photos, footed tubs, clothes, dishes, etc.  The tour was interesting and informative for only $5.  We were sad to hear that this was one of the sites that was slated for closure due to the Budget.  Let's hope that somehow they can save it.   \n\nI posted some photos and review of my afternoon in Sacramento at: http://insightfultravel.wordpress.com/2012/02/19/sacramento-afternoon-in-february/",
  "The Governor's Mansion is a walk back in time and California history. The guided tours can be fun or irritating depending on your guide. But no matter what it great viewing. I like to go in Dec. because  it is decorated for Christmas .",
  "Although we live in Sacramento, we had never visited the Governor's mansion so thought it was about time.  They have tours on the hour and are open from 10am to 5pm, Wednesday through Sunday.  The tours last from 30 minutes to an hour, based on the size of the group and questions.  Our tour had more children which made it fun but probably on the longer side (almost an hour).  The mansion was built in 1877 as a private residence but since the early 1900s, it was home to 13 of California's Governors.  Since the late 60s, it has been run by the State Parks.  You can see items from various eras--furnishings, TVs, phones, appliances, photos, footed tubs, clothes, dishes, etc.  The tour was interesting and informative for only $5.  We were sad to hear that this was one of the sites that was slated for closure due to the Budget.  Let's hope that somehow they can save it.   \n\nI posted some photos and review of my afternoon in Sacramento at: http://insightfultravel.wordpress.com/2012/02/19/sacramento-afternoon-in-february/",
  "The neighborhood is run down and you are only able to view the outside of the home. I didn't feel very safe in the neighborhood on my own.",
  "I knew the home is not available for tour but since it is just few blocks from the Capitol, I decided to stop by for some photos.  It was weekday afternoon and there were no signs by the home stating it is a Governor's mansion.  The home is fenced in on 2 sides but you can still see the front entrance from the street.  I did see the governor's family playing in the backyard while I was there while security details kept watch.  ",
  "This perfect restoration  took years to complete but is exquisite .You don't get to go in because the Governor lives here but if if you are around on October 31st the Governor usually hands out candy in the evening  ",
  "My hotel was near this mansion and I walked by it several times, Finally I looked it up online. Although Google says that Governor Brown moved back in after an extensive renovation, there were no signs indicating that this was the governor's house and no signs of security in place, so I wonder if that actually happened. All you can do is get a look from the street. Not worth a special trip.",
  "Politics aside, this building is a nice building to look at for the outstanding architecture. I'm not downtown that often anymore, but its fun to walk around and look at the old building sometimes."
 ]
},{
 "name": "California Exposition & State Fair",
 "address": "1600 Exposition Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/b1/ea/0d/from-far.jpg",
 "tags": [
  "free",
  "cheap",
  "nature",
  "walk",
  "food",
  "parks",
  "art",
  "history",
  "food",
  "kids",
  "food",
  "kids",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d1418614-Reviews-California_Exposition_State_Fair-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wouldn't have gone without a deal on Groupon. Parking on-site was way over priced!  Found free street parking instead.  Had been looking forward to live concerts, not so interested in cover bands.",
  "\u2028\u2028On the Monorail you hear the narrator say that the State Fair is like Disneyland of the north. That WAS true.  It used to take THREE DAYS to see everything.  There were so many good attractions it felt like a Disney Theme Park.  But now, it takes less than one full day. \n\nThis year the EXPO BUILDINGS have almost nothing to see at all.  There’s less art in the art buildings.  The Silent Disco doesn’t look like a Disco at all; just cheap projections on the walls. Building 5 was something about video games. And Building 8 was completely EMPTY. \n\nEXPO BUILDING EXHIBITS OF THE PAST USED TO FILL THE BUILDINGS WITH THINGS LIKE...\nActual Props from sci-fi movies and TV shows. \nVintage Toys and Games. \nThe Ice Man Exhibit.\nAmusement Park History with items from old Amusement Parks.\nPeople showing and talking about Eagles, Raccoons, Owls and more... \n\nThere are less COUNTIES EXHIBITS than ever and none had the amazing waterfalls or mine tunnel walk through attraction, or buildings with animated figures in the windows.\n\nThe new WINE GARDENS are better than recent years. But years ago, the Gardens area was larger with several by landscapers hoping for a Blue Ribbon. \n\nNo one in the INSECT PAVILION talking about the insects any more. I asked. \n\nAlmost the entire FOOD FESTIVAL is beef or sweet stuff, and every item is very hard to find (even with the map).  One item could not be found at all.  Everyone we asked said that no one could find it. \n\nATTRACTIONS IN THE 1990s WHERE THE KID’s CARNIVAL IS NOW\n\n\u2028\u2028I LOVE LUCY EXHIBIT\n\u2028I will never forget the replica of Lucy and Ricky's apartment and kitchen with actual props from the show.  \n\nACTUAL TRAIN RIDE\u2028\nThere was a truly fun miniature train (brought to the Fair by a Train Club in Folsom) for adults and children of all ages to ride through a pretty large area for a few years.\u2028\u2028 \n\nAn OLD WEST TOWN for a few years.\n\nOTHER ATTRACTIONS IN THE 1990s\n\nBIG ANIMATRONIC DINOSAURS were in a huge tent like building between the Counties Building and the Jacuzzis every year. \u2028\u2028\n\nThere was a SHARK TANK one year.\n\nLIVE ENTERTAINMENT\nAlmost every one of the smaller stages used to have a big variety of really interesting, quality acts:  From Chinese Acrobats to International Folk Dancing to Karate Demonstrations and good bands.  But most of the stages now just have loud rock bands that are not very good. \u2028\u2028 And from what we saw this year, the Chinese Acrobat show is one guy spinning a plate. \n\nTHE MIDWAY\u2028\nUntil the late 1990s there was a quality carnival with an extremely tall FERRIS WHEEL at the west side of the carnival.  And at the entrance, there was a beautiful, large automated BAND ORGAN.  But in the late 1990s, something supposedly happened with the owner of that carnival, and the State Fair hired a new carnival owner who apparently does not own a large Ferris Wheel or Band Organ, but they do have a lot of duplicate rides. \u2028\u2028\n\nTHE FIRST HDTV WAS AT THE STATE FAIR\n\u2028The State Fair used to feature innovations of technology.  They actually featured the very first HDTV in existence one year sponsored by KXTV with nature photography shot by KXTV photographers.  Everyone was blown away by the exhibit.  But the State Fair does not feature innovations at all any more. \n\nCONCLUSION\n\u2028\u2028I don't know what can be done about this, but I do hope that some day someone tries.  I want to feel like I'm actually in a Disney Theme Park again, when I visit the formerly Great California State Fair!!",
  "The weather during the State Fair is always hot, but, its easy to cool off with the many water misters and going inside the exhibition halls. \nThe live stock exhibitions seem to get smaller and smaller each year.  This year, there were only rabbits.  \nEntertainment during the day was disgraceful.  With so much talent out there, they hire or get volunteers that are worst than karaoke. Better live entertainment happens at night.\nLots of rides and food.\nBut, food is very expensive.  The garlic fries were $8 for one potato worth of fries.\nThe BBQ tri-tip was even worst, $14 for a very small sandwich.  If beef was tender, that wouldn't have eased the pain of the price.   Best to go after a huge lunch.",
  "Very fun, lots of ride for little kids and a wide selection for teens/adults. It feels as if the stands that sell goodies gets smaller and smaller every year. Parking is ridiculous & it’s HOT. But if the heat doesn’t bother you it’s fun to go try the food go on a few rides play a couple games and have fun",
  "So Cal Expo has something for kids of all ages.\n\nFirst of course is the fair. Best in the state. deep friend errrr everything, wine tasting, animals, good entertainment. carnies, horse racing and lots of those fun, throw your money away, noy a chance to win a dirty stuffed animal, challenge booths."
 ]
},{
 "name": "The B Street Theatre",
 "address": "2711 B St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6a/f5/3f/the-b-street-theatre.jpg",
 "tags": [
  "theatre",
  "theatre",
  "music",
  "theatre",
  "theatre",
  "theatre",
  "music",
  "theatre",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d142815-Reviews-The_B_Street_Theatre-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "First, the \"new\" B Street Theatre is located in The Sofia Tsakapoulos Center for the Arts.  For many years, our favorite venues were (1 ) The Harris Center in Folsom, (2)  The Crest Theatre on K St., (3) Sacramento Community Center Theatre, and (4) Sacramento Memorial Auditorium. [It's not an accident that I left off the Golden 1 Center].\nUpon the opening of The Sofia...this incredible venue immediately jumped to #1 and has remained so.  The Sofia is simply the best entertainment venue the area has to offer: the best seating, the best acoustics, one of a kind performances...and, an unsurpassed value.  Our seasonal subscription includes 7 plays + 5 concerts of our choosing.  The plays have all been wonderful and the concerts:  Wishbone Ash, Ray Charles Project, Albert Cummings, Rick Estrin and the Nightcats, Al Jardine....incredible.  Plus, the artists come out into the lobby and mingle freely with the guests.  If you are not a member:  SUBSCRIBE!  Here's a great reason:  top class entertainment and the per person subscriber cost (12 events) is $140.00!!!  No, that's not a mistake.  $11.66 per person...per event!!!  Unbeatable.",
  "They kept the name but moved to Capital Ave and 28th Street.   New building for both the Theatre and Music Venue.  They have comedy shows also.  The bar in the lounge has a variety of drinks.  The seats are comfortable and the crowd is always friendly.  Get to the show early for the best seats.",
  "The Sofia Tsakopoulos Center for the Arts, home of the B Street Theatre is at 2700 Capitol Avenue in Sacramento.  This new center has fabulous seating and is a huge plus to downtown Sacramento.",
  "First, the \"new\" B Street Theatre is located in The Sofia Tsakapoulos Center for the Arts.  For many years, our favorite venues were (1 ) The Harris Center in Folsom, (2)  The Crest Theatre on K St., (3) Sacramento Community Center Theatre, and (4) Sacramento Memorial Auditorium. [It's not an accident that I left off the Golden 1 Center].\nUpon the opening of The Sofia...this incredible venue immediately jumped to #1 and has remained so.  The Sofia is simply the best entertainment venue the area has to offer: the best seating, the best acoustics, one of a kind performances...and, an unsurpassed value.  Our seasonal subscription includes 7 plays + 5 concerts of our choosing.  The plays have all been wonderful and the concerts:  Wishbone Ash, Ray Charles Project, Albert Cummings, Rick Estrin and the Nightcats, Al Jardine....incredible.  Plus, the artists come out into the lobby and mingle freely with the guests.  If you are not a member:  SUBSCRIBE!  Here's a great reason:  top class entertainment and the per person subscriber cost (12 events) is $140.00!!!  No, that's not a mistake.  $11.66 per person...per event!!!  Unbeatable.",
  "They kept the name but moved to Capital Ave and 28th Street.   New building for both the Theatre and Music Venue.  They have comedy shows also.  The bar in the lounge has a variety of drinks.  The seats are comfortable and the crowd is always friendly.  Get to the show early for the best seats.",
  "Just got out of the Forever Question, and once again truly believe that the B St Theatre is my favorite date night.\nSets, lighting and costumes were great, acting did not disappoint. You'll laugh and have a fantastic time with your sweetie!",
  "Love this new venue.  Wonderful, live music,plays.The sound is amazing all seats are wonderful.  And remember to check out the bar for a glass of wine.",
  "We have been supporters of B Street for many years. We loved the intimacy of the old theater. It was funky and fun. A very unique place.\nWe have gone to a few plays at the new one and while they were enjoyable the atmosphere was not.\nThe people working there were not friendly. The building too modern and cold.\nWe gave the rest of our tickets away and will not be renewing our membership.\nWish B st. would have taken notice of the beautiful New York Broadway theaters and not try to be so modern and tacky"
 ]
},{
 "name": "California Musical Theatre",
 "address": "1419 H St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/c0/67/20/photo1jpg.jpg",
 "tags": [
  "performance",
  "theatre",
  "performance",
  "theatre",
  "creative",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d4460158-Reviews-California_Musical_Theatre-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Easy parking (reserve on the website when you purchase your theater tickets!) All seats are good. We were row \"O\" and happy with sound and viewing. We saw Lin Manuel Miranda's 2008 hit \"In the Heights.\" Fantastic. We might just consider season tickets for next year!",
  "I love the layout of this Theater! The stage is in the center of the theater with seats all around. The seats don't go back too far so no one is far from the stage. My daughter loved The Wiz performance! The actors were really good and entertaining! We had a good time! The plus side of this being a smaller theater is that the lines for concession and restrooms don't get too long during intermission. We appreciated this after visiting larger theaters in the past and not having time during intermission to use the restroom. I will be checking their schedule to make sure I attend some more of the events at this theater! \n\nI used the parking garage next to the theater. I prepaid online for $5. I parked on the second floor and had no issue getting in or out of the parking garage. I can imagine there being an issue if you are parked at a high level. ",
  "I've never seen a bad show in this amazing theatre in the round.  There are no bad seats.  This is a real summer treat.  Be warned, tickets have lots extra fees added on. ",
  "We recently attended a performance of \"An American in Paris\" at this great theatre.  Sat in the Orchestra section and seats were very good.  Have seen several live performances at this theatre and have enjoyed them all but this production topped the charts for the best dancing/ballet, great singers and wonderful George & Ira Gershwin tunes.  Unfortunately the show will only be there until early June.  Looking forward to their next season and will definitely attend another show or two then.",
  "Music Circus, now out from under its tent and presented in the wonderful theater-in-the-round Wells Fargo Pavillion, is consistently excellent, and sometimes absolutely amazing.  We have been lucky enough to have enjoyed musicals in New York, Los Angeles, San Francisco, Long Beach and other locales, but have never seen shows as consistently well performed, directed, costumed and staged.  For several years, our season tickets have been directly behind the conductor, so we also enjoy not only the music, but the fine musicians, as well.  Music Circus productions of \"Ragtime,\" \"Cats,\" and \"Hunchback of Notre Dame\" are seared into my memory.  The use of an extremely talented deaf actor in the latter was a stunning creative decision by which we were deeply touched.  We have been able to see one rehearsal each of the last two years, an educational adventure, for sure.  The director of the play, as well as those of music, sound, lighting, choreography, stage movement (up, down and around on several levels) all give instructions more or less at the same time.  It's incredible to see each person in the production respond only to the appropriate voice.  Within a few days, out of all that cacophony comes a seamless production.  We couldn't recommend anything in Sacramento more highly.  If you are going to be a summer tourist, be sure to see what might be playing.  If you are lucky there might still be tickets available."
 ]
},{
 "name": "Old City Cemetery",
 "address": "1000 Broadway",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/62/c1/95/una-esperiencia-inolvidable.jpg",
 "tags": [
  "walk",
  "walking",
  "history",
  "tour",
  "walk",
  "family",
  "walk",
  "historic",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d142512-Reviews-Old_City_Cemetery-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Quite a place with it's rich history.  One really needs a guided walk to know all the various stories of this place, especially the hauntings.  One finds a lot of Screech Owls adding to it's mystic.  The cemetery is old and fun to walk through, just calm and peaceful as well.  It's other claim to fame is it's numerous antique roses, many which are only found here and no where else.  Their is various walking tours like halloween, roses and history depending on one's interest.  The rose society offers rose growing tips, rose cuttings for sale and ask for volunteers to do rose pruning.  I'm so glad this place was preserved. ",
  "You can schedule a tour with your visit.  Many iconic people are buried at this cemetery .  It's fun to go for Halloween.",
  "A great place to include in a walk through downtown or to walk. Long narrow lanes between monuments dating to the early days of Sacramento. You start out not looking at the names and dates but you can't help noticing and then you start dreaming of the stories buried all around and how they blend together in unseen ways that leave marks on us now. A good place to read poems aloud.",
  "My family and I visited the Old City Cemetery last year on a free-access day, a city-wide Museum day I think it was. We had a fun time exploring (so much bigger than you'd think). We even got to do a little geocaching. Make note of where the bathrooms are!",
  "right off the I80 freeway. Most of the city's historic figures buried here and wonderfully landscaped. Good place to take your dog for a walk as less crowded than the parks."
 ]
},{
 "name": "Sacramento Convention Center",
 "address": "1400 J St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6a/f7/44/sacramento-convention.jpg",
 "tags": [
  "drink",
  "food",
  "eat",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d1419963-Reviews-Sacramento_Convention_Center-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "As convention centers go, this one is not large for a major city. However it is smack downtown and conveniently located to gov't offices, over priced hotels, and the capitol of the 6th largest economy in the world. It has a small city feel, but can hold some decent sized conventions. Parking can be challenging after 8 or 9 am when a large convention is in play so arrive early. Services are not huge, limited to a few drink and dining establishments so plan on eating elsewhere if interested in something other than institutional food. Cheers!",
  "Sacramento Convention Center: perfect place for a large crowd. We spent hours visiting the venues and touring the centers. Parking can be difficult at times but usually it flows without too much hassle. Suggest you go early or during the week. Lots of restaurants throughout the venue. Take your time, don’t rush and just have fun!",
  "This was a very nice, well kept, large facility for a conference that I was there attending. I really enjoyed my time there, and everything was kept clean, including the bathrooms. Parking leaves much to be desired though. There is no convention center parking, so you have to park on the street or in paid lots around the area, which can be spendy.",
  "I have only been to the Easy Rider Show here, but it has  been a positive experience every time. If I get a chance to attend something else here that interest me I will. Also there is a lot of parking and cool places to eat nearby. ",
  "My husband and I had attended concerts at the Sacramento Convention Center. The staff is very polite and well-mannered.",
  "Great location to hold a convention. Near many hotels and some great restaurants. Currently being remodeled so I am sure it will only get better.",
  "Sacramento Convention Center, and the surrounding area, are not as confusing as may appear from the freeway and surrounding streets.  Well marked with good public access. ",
  "I've attended reptile shows, comic-cons, and Lego events here with my family. It's very large, but they make it easy to not get lost. Close to many food choices. I can't compare it to others (except for San Diego), but it's a great venue."
 ]
},{
 "name": "California Museum",
 "address": "1020 O St",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/62/61/3b/california-museum-at.jpg",
 "tags": [
  "history",
  "history",
  "history",
  "walk",
  "history",
  "historic",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d127643-Reviews-California_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you drive you must find parking in the area. There are several pay-to-park lots and some metered street spaces. Admission is paid in the gift shop. There are 2 floors of exhibits. Part of the second floor is the \"California Hall of Fame.\" One can get a good history of California by visiting the various exhibits.",
  "The Health exhibit, the early California Indian tribes experience, the \"RIGHTS\" movement, the Newest American project and the beautiful people of the world photos, the wonderful Women's exhibits, the famous people exhibit who contributed to California's growth and diversity along with the amazing Encina Preparatory High School story and the new Unity Center \"everyone has a voice\"... An important place to visit. An educational visual odyssey.",
  "Amazing California history with fun interactive exhibits; and exciting and cool CA Hall of Fame exhibition!",
  "The Gold Mountain exhibit was excellent, providing a timeline of the history of Chinese in America since the Gold Rush. Interactive displays and exhibits tell the story.",
  "I actually visited in June 2018, however due to travelling all over the world for the last 18 months, I am just in the process of writing all the reviews.  It’s not a massive museum; it took me about 90 minutes to see everything.  In additional to information about California becoming the 31st state and the discovery of gold, the museum also includes an interesting exhibit about the Japanese Americans who were imprisoned during WW2 after the bombings of Pearl Harbour; the exhibit includes artefacts and personal stories.  The museum also includes a few smaller exhibits which were interesting to walk through.",
  "If you drive you must find parking in the area. There are several pay-to-park lots and some metered street spaces. Admission is paid in the gift shop. There are 2 floors of exhibits. Part of the second floor is the \"California Hall of Fame.\" One can get a good history of California by visiting the various exhibits.",
  "The lovely friendly ticket person told us immediately that the most popular attraction is the one room on Japanese internment. Upon walking through the museum it clear why: it is the only diorama of artifacts in the entire museum not counting the completely random vintage \"diner\" booths at the bottom of the back stairs. There is no diorama on Missions, the gold rush, the movie industry... no artifacts, no displays, nothing on things you would consider historic to California. What there is are a a lot of pictures of individuals and a lot of text (such as Barbara Streisand: You could be forgiven for wondering what this Brooklyn girl has to do with California history). Its like a 3D Wikipedia page... read it at home and save $9 cause other than pictures, which you can see on line, there are no displays.",
  "I really enjoyed the museum! The staff was very helpful with getting our city passes for us :) which is a great deal."
 ]
},{
 "name": "Wells Fargo Museum",
 "address": "1000 2nd St Old Sacramento",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/94/58/c9/wells-fargo-history-museum.jpg",
 "tags": [
  "history",
  "free",
  "history",
  "free",
  "learn",
  "history",
  "history",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d127636-Reviews-Wells_Fargo_Museum-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a small museum in Old Town area of Sacramento, located quite closed to the Railroad museum and the Old Sacramento waterfront. The history of Wells Fargo is closely linked with the Gold Rush in California in mid nineteenth century and this museum does a commendable job of concisely chronicling that. Believe me, the museum is very small indeed. If you are really curious about reading all the exhibits in detail, you might take 15 minutes inside but in most cases you'll be in and out in 5 minutes or so! They had a working telegraph which uses the Morse code and it is connected real time with some other Well Fargo museums scattered at multiple cities across US, that was a fun exhibit. The exhibits were mostly about the history of Wells Fargo and Pony Express, the first mail delivery systems connecting the West with cities east of the Mississippi. The entry is free.",
  "I found this museum very interesting, especially the connection to Stage Coach robber Black Bart. I recommend researching this robber and his intense dislike of Wells Fargo!",
  "Small museum but packs a big punch.  It has memorabilia of the gold rush, early banking history, the pony express and the telegraph.  Even a corner is dedicated to the journalist Mark Twain.\nThe stair steps outside in the front is the original steps to the state Supreme Court.  And it's all free so it doesn't get better than that.\n",
  "It's a very small museum and a quick stop.  Still, they have a lot of interesting artifacts from the Gold Rush days, and it was educational to learn the history of Wells Fargo.",
  "Although the museum is small, there's a museum who's able to tell you a lot about the history of Wells Fargo and related stories during the time they first built it. Great to add this to your browsing route.",
  "My partner is a teller at a Wells Fargo Bank and this museum was so cool and interesting! We had a blast and I really enjoyed the fact there was an Wells Fargo ATM machine in the museum!",
  "Tiny but nice. What is special is that this is where Wells Fargo stood over 150 years ago.  ATM is there, convenient for getting cash, but this is a mini museum, not a service bank. Nice staff. My favorite atm! I just love to walk in here."
 ]
},{
 "name": "Arden Fair",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/90/3e/3d/filename-411217-10150994202616.jpg",
 "tags": [
  "food",
  "eat",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g32999-d142924-Reviews-Arden_Fair-Sacramento_California.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wow, so much has changed at the Arden Fair Mall. Beautiful new designs, lovely areas to shop, I’m very impressed! Great places to dine, too. Macy’s is one of the best. Don’t forget the See’s Candy. Lots of good options here and the restrooms are very clean. Can’t wait to return for more shopping fun at Arden Fair!!",
  "This mall is just what you expect, with a paradise of stores. It is 2 floors, with elevator, and the food court is perfect! Some stores, like LIDS, offer sports jerseys and you can CUSTOMIZE them yourself! Would definitely come back to Sac and visit this mall",
  "This is a nice mall with a good selection of stores. It has 2 stories and seems spacious compared to other malls I've been too. when we went it was beautifully decorated for Christmas.\n",
  "This mall and the area have long been known as a ghetto. \n\nOne would think that it's just males causing the problems but the disappointing reality is this place and area had had long term problems with female gangs and female hate groups.\n\nAnd now the media has reported that the Sacramento region, from Elk Grove to Roseville and inland are amongst the worst place in the country for singles.\n\nIt's sad because California just had one of the most powerful governors but the hate groups remain.\n\nDon't be surprised if your identity becomes known all over the area before you realize it. \nAnd this area contribute to the next generation of hate.",
  "While it is very convenient to get here as you can literally see the BUS 80 freeway from the mall parking can be difficult at times - especially during the holiday season. The mall is probably the oldest in Sacramento but has been remodeled.  There are many great restaurants but better to go on a weekday. There are also movie theaters so you can watch, shop and eat all at one place.",
  "First opened in 1957, the Arden Fair mall has woven its way into the cultural and economic fabric of Sacramento. In its 60+ year history this mall, much like the community that surrounds it, has seen both “boom” and “bust” periods. And like most malls in the country, it seems to me like Arden Fair is experiencing a moderate and prolonged “bust” period thanks to the growing proliferation of online shopping. That’s not to say the mall is barren – because it isn’t; however, I’m positive its seen happier times, traffic-wise.\n\nIn any event, despite being over 60 years old, Arden Fair is nicely maintained. In fact, it looks far newer than many malls half its age, so many a kudo should be given to management for keeping this mall looking relatively fresh and modern in comparison to its counterparts elsewhere in the country. And, despite the major increase in online shopping over, say, the last decade, this mall has been able to hold onto and/or bring in new tenants on a regular basis. Anchor tenants include: Sears (here since DAY 1), JC Penny, Macy’s and Nordstrom. Beyond the anchor stores, Arden Fair has over 160 stores and restaurants, including: American Eagle, Apple, Banana Republic, Bath & Body Works, BJ’s, Box Lunch, Cinnabon, Coach, Disney, Forever 21, GAP, Hot Topic, Journeys, Panda Express, Spencer, amongst many others. In short, there’s something in Arden Fair for everybody young and old.\n\nIt had been a good six years since I’d last patronized Arden Fair, so this was a good mini sort of nostalgia trip for me. In both cases, though, my visit was done more as a way to kill time rather than actively seeking out a shopping mall. The one difference between 2012 and the current day, however? I was actually looking forward to visiting Sears since this large retailer shuttered all of its doors in Canada in 2017. It’s funny how the mind works sometimes. All throughout my life, I never really cared much about Sears – or at least didn’t notice its value – but once it disappeared from the Canadian landscape, I rather missed it. Ironically, I didn’t end up buying anything at the Arden Fair Sears, but at least I got a nice photo of the SEARS signage . . . it’s the little things ;)\n\nWhile I wouldn’t go quite so far as “Visit Sacramento” and declare Arden Fair Mall a “jewel among the beautiful landscape of Northern California,” I will nevertheless concede that it is a nice mall to visit, both structurally and in terms of the variety of stores. However, unless you’re really big on shopping, I wouldn’t necessarily go out of my way to come here and instead would only use it as a time killer of sorts.​",
  "Wow, so much has changed at the Arden Fair Mall. Beautiful new designs, lovely areas to shop, I’m very impressed! Great places to dine, too. Macy’s is one of the best. Don’t forget the See’s Candy. Lots of good options here and the restrooms are very clean. Can’t wait to return for more shopping fun at Arden Fair!!",
  "This mall is just what you expect, with a paradise of stores. It is 2 floors, with elevator, and the food court is perfect! Some stores, like LIDS, offer sports jerseys and you can CUSTOMIZE them yourself! Would definitely come back to Sac and visit this mall"
 ]
}]
