[
{
 "name": "Schreiner's Iris Gardens",
 "address": "3625 Quinaby Rd NE",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/c0/fd/18/iris-bloom-season-visit.jpg",
 "tags": [
  "family",
  "field",
  "walking",
  "drink",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284689-Reviews-Schreiner_s_Iris_Gardens-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "For three short weeks in May, the Schreiner's Iris Gardens become one of the most beautiful spots in the world. The 10 acre display gardens are arranged in rectangular beds with multiple iris plants supplemented by rhododendrons, day lilies, oriental poppies and other flowers. This is augmented by circular beds of iris surrounding a flowering tree or large plant. The color combinations are excellent. This is heaven for a photographer.\nThere are plenty of chairs and benches to rest if needed. There is a flower shop and gift store. We came on a week day and our only regret was that the gift shop did not have hot drinks available. It is hard to believe that the gardens are within sight of the I-5 freeway. The commercial iris growing areas surround the display gardens. It only costs $5 per car to enter.",
  "We always enjoy visiting Schreiner's Iris Gardens around Mothers Day when all the flowers are in full bloom. Go early and enjoy the gardens mostly to yourselves. ",
  "It's an annual Mother's day pilgrimage for our family to go to Schreiner's. The German bearded irises are gorgeous! There's a showroom with cut flowers of all the types they have. You can order based on that, and the rhizomes are delivered at a later date. We bought 18 last year and got 4 as a bonus. They're all blooming right now.",
  "Beautiful Iris's. Never knew there were so very many varieties! Helpful personnel. Easy to grow, split, and grow some MORE!",
  "Ordering nearly ever year from the early 1970's Schreiner's Iris tubers were ALWAYS the biggest, plumpest and healthiest of any that I EVER received by mail. The results were ALWAYS amazing. After my health declined I had to stop gardening in 2005. I have since traveled to Salem to see Schreiner's incredible gardens. It was the most spectacular display of color and beauty I have ever seen or imagined. Walking the field I became lost in the magic of thousands of blooming Iris. Truly amazing visit that I recommend to any gardener or flower lover. I have visited 4 times in the spring during full bloom",
  "We enjoyed the variety of flowers and the beautiful setting. A very peaceful way to spend a spring afternoon.",
  "I have bought iris from them for years and this year I thought I would purchase a few daylillies. These plants are OUTSTANDING and I was shocked that every one of them purchased bloomed this year!!! Huge plants, both daylillies as well as iris. Really nice people and quality company!!!",
  "A spectacular display of Iris, you can walk the fields and then enjoy a cold drink while sitting in the breathtaking garden.  What a great opportunity to actually see the Iris before making a purchase.  I absolutely love Schreiner's and have been ordering from them for years!"
 ]
},{
 "name": "Salem's Riverfront Carousel",
 "address": "101 Front St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/ba/4f/75/photo0jpg.jpg",
 "tags": [
  "walk",
  "kids",
  "walk",
  "free",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d285220-Reviews-Salem_s_Riverfront_Carousel-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "The carousel is indoors and really pretty. It's next to a park and and has a pretty view of the river. You can also go for a walk or play simple frisbee. The parking can be pretty difficult depending on the temperature and day.",
  "The carousel and the park are great places to take kids. The parking is not great.You either have to walk a distance or be prepared to park downtown.",
  "Who doesn't love a Carousel?!?! This one is completely enclosed so it makes a perfect 'get-out-of-the-rain' activity. Granted the rides are only a few minutes long, but still, it's worth it! The kids love it! There is also a super fun park right nearby & bathrooms, so it is a great place to spend the morning or afternoon! Rides cost $1.50 or you can buy one of the bulk offers (the smallest being 18 rides for $20, which saves you $7). Multiple kids can ride on the same bulk coupon. \n\nNot sure if this is normal, but today when we went there were people working on building new 'horses' (actually it's a dragon, which my son thought was really cool!). They gave both of my kids a buy one ride, get one ride free ticket, so we'll be back soon to redeem those! ",
  "The Salem Riverfront Carousel is CLOSED. Not sure when it will reopen again, but it is closed due to the COVID 19 outbreak. It’s a wonderful place, and I hope life will get back to normal someday soon. \n\nThe little playground next door appears to be open, but there are warnings to stay off the slides and toys because these structures cannot be sanitized. \n\nPlease stay safe and healthy!",
  "Grandkids love this place.  It's always a treat when they visit.  On a nice day, we hit Riverfront Park and playground as well as the carousel.  Inexpensive and such fun",
  "The workmanship on the varied animals made us stay to watch the carousel. We found more than horses...a giraffe, a frog with a tennis racket, a covered wagon for the smaller children, and many of the horses with little fun surprises at the back of their saddles...a cat, an angel, and many more peeking out as the animals passed us. Inside the gift shop, we were encouraged to look at new animals being carved and others receiving some needed restoration and paint touch-ups. Beautiful workmanship!",
  "I took my niece and nephews to the park and decided to go into ride once. We ended up buying the stamp card so they could go several times. One more time they kept saying. ",
  "The carousel is a must for childern and adults who appreciate the hand painted horses on this year round ride."
 ]
},{
 "name": "Enchanted Forest Theme Park",
 "address": "8462 Enchanted Way SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/00/16/c7/2f/entrance.jpg",
 "tags": [
  "music",
  "eat",
  "kids",
  "nature",
  "performance",
  "theatre",
  "food",
  "free",
  "cheap",
  "kids",
  "food",
  "performance",
  "kids",
  "drink",
  "kids",
  "family",
  "theatre",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d124627-Reviews-Enchanted_Forest_Theme_Park-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "This amusement park is built into a hillside in the middle of the beautiful nature of the Oregon forests with natural trees, foilage such as huge ferns, and many other natural greenery. The entrance is lovely as you pass through the castle and the price doesn't break the bank!  Located 7 miles from Salem, it is a wondrous place to visit. Very pure and clean and green. Activities for every age, including hiking up and down paved paths right through the forest, tunnels to crawl through, carnival rides including the Bob Sled that is heart stopping. The western town is a blast, and the water show inside is colorful, with peaceful music to listen to as the show goes on and on in the dark room. You can even order pizza to eat while watching the show. The Irish band that plays inside a building makes one feel like they are in and Irish Pub! Children are welcome everywhere in this park! The singers in the band, the harp player is wonderful, and the dancing is inspiring!! This place is an entire day of fun and excitement for every age not just kids. The outdoor plays are a must see, and the haunted house is amazing. If you are going through Salem be sure to make time to stay a day and have more fun than you have ever had!!",
  "Best place I’ve ever been too. Takes you back to when you were a kid. All the nursery rhymes the seven dwarfs mine all the slides and tunnels. Theatre performance, the rides, the food. The haunted house, everything about this place is like no other. I will go back again! my teenage daughter, her friend and my little boy went with us. it was a blast!",
  "We recently visited Oregon and the Enchanted Forest was one of our favourite stops. We had two children in our group, 8 and 11, and there was so much for them to do and see! We loved the log ride, Challenge of Mondor, Ice Mountain, the Haunted House, the nursery rhyme features at the beginning -- all of it! It was like a mini-Disneyland without the big price and the long lineups. The staff was pleasant and accommodating throughout the park, and there was plenty of free parking. We hope to be back soon!",
  "We live near enchanted forest so have been dozens of times. We take our guests with kids there almost every year. Beautiful woodsy paths lead up the hill to visit Goldylocks, Snow White, and a variety of interesting characters. The path ends at a western town, haunted house and a outdoor theater where teenagers give fun paradies of fairytales. Worth the money, but spend the afternoon to get your money's worth, kids will want to run through more than once. Pack a lunch unless you like chicken nuggets and mediocre fair that's not cheap. We keep the cooler in the car and send grandpa to get it at the end of the trail. There are extras that cost more if you're  into rides, the panning for gold is a must for little ones that are rewarded with colorful rocks. Worth the visit but bring an umbrella and rain jackets just In case!",
  "We spent Friday at Enchanted Forest from 1030am-330pm and had a very enjoyable day. The park was clean and the employees were friendly. We rode the larger rides all once and the boys liked the Ice Mountain Roller Coaster best. I think that they enjoyed all of the slides, tunnels, and the Indian Caves more though because we spent a lot of time in those areas. If you are an adult looking for a good old fashioned slide, we slid on four that were perfect for grown ups.\n\nThe storybook lane was a nice entry into the park and the tunnel was a good start to our day. We noticed postings for the show as we walked in and were surprised by the theater performance, really enjoying the interactive 25 minute show. The kids participated and the adults couldn't miss the lines thrown in for their enjoyment. \n\nThe food was a great price for a park and tasty fast-food. We had hamburgers and corndogs with fries and cheesy fries. We also appreciated the fact you could bring your own food in. We brought a snack and drink with us and that was convienent; the food services is at the bottom of the hill but there are snacks throughout the park.\n\nThis was a great day with pre-teen boys  for about $100 for the group. \n\nMake sure you have coats or jackets; it is breezy in the forest and borrow one of the nice blue ponchos if you don't want to get too wet on the log ride. I might also suggest you weigh out the price of the ride bracelet or pay per ride. It worked out best for us to pay per ride and all tickets and bracelets can also be bought near the rides.\n\n",
  "It's not a flashy place, but I love the simple charm of this place, built by a dreamer!  Kids older than 11 probably wouldn't find it very fun, but the little ones loved it.  Be prepared to go down the Shoe Slide again and again and again! The paths are a bit steep and some of the rooms and passageways are narrow, so not very suitable for people with disabilities or large sizes!  For the adults, strolling in the mossy trees is a nice escape from the highway.",
  "Having went here dozens of times growing up, we decided to take our son there. \n\nIt was priced well above where it should have been. Nostagiac, but not worth a return trip",
  "Lots of fun to be had at this local place!  The Enchanted Forest is an amusement park located in Turner, Oregon, next to Interstate 5 just south of Salem. Creator Roger Tofte opened the park in 1971 after seven years of construction. Today, the Tofte family still owns and operates the 20-acre park.",
  "Grew up on fairy tales, so this place is an automatic win for me!! I love the legend and craftsmanship that is displayed through-out the park. Very kid friendly and most of the park is really for smaller kids to enjoy. I paid general adult admission ($13.50) and then got 3 tickets ($3) for the haunted house. I enjoyed walking around the forest and the haunted house was really cool. Not scary at all. Great FX and artistic set ups of different spooky rooms inside with creepy audio. Ended up watching the red riding hood theatre and expecting old school wolf in a big costume! Ha! Everything is very new age modernized for the youth. Grandmas on Instagram and there is a toxic masculinity joke towards the wolf that no doubt the kids didn’t get but it was a nice mix of kid humor and adult. Excellent actors as well!! Wolf was the bomb!! Loved his attitude as voice! Check this place out if you have any interest!! ",
  "I loved this place as a child cause it would creep me out and I have been there in 25 years. Me and my fiancé have gone 3 times this month and had an amazing time. Recommend get the bracelet to ride all rides unlimited times. Grab a pulled pork sandwich and Mac and cheese and enjoy the day. I’m sure will go again before they close for the season. I wish they did a Halloween spoke fest cause that would be awesome",
  "Sweet place to take 12 and under grandchildren. \nA little fantasy village in the forest. Not overpriced and lots of entertaining things to do. My grandchildren ages 5,6 & 9 love it."
 ]
},{
 "name": "Riverfront Park",
 "address": "200 Water St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/51/c4/a6/riverfront-park.jpg",
 "tags": [
  "walk",
  "walk",
  "walking",
  "walk",
  "organized",
  "walking",
  "walk",
  "nature",
  "structure",
  "kids",
  "walk",
  "unique",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d6949367-Reviews-Riverfront_Park-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great park in the heart of Salem, right on the river. This gives great sunset views, and some wild life too, ducks and Osprey when we were there.  There is a river boat available for dinners, etc. and the Carrousel is also here. There are also concerts and events, so check for a event schedule, to avoid crowds, or to join in. Soon there will also be a walk bridge that will connect to the Minto Brown park, this will add miles of paved trails, and a dog friendly park.",
  "Riverfront park is the place in town where all the events happen. The bite, concerts, festivals... everything is here. Well, except the fair. There's stuff there too... If you're from Portland equate this to riverfront park in Portland except smaller.\n\nOn a nice day, the place is pretty full, but there is a lot of room for everyone. Big green spaces, playground, and even a carousel. Parking can be a bit of a hassle, but if you're able to walk half a mile, park on the west side of Salem and take the footbridge over. It's a great walk and there's no traffic on the bridge.",
  "There is a nice playground for toddlers, though it can be busy on nice days.  The paved walking path provides a good view of the Willamette River and links via a sidewalk to a pedestrian bridge over the river.  There is a good 5k run using the park, bridge and into Wallace park on the opposite side of the river then back.  My only caution is that there is often a presence of homeless people but go with a buddy and be respectful.  I've never had a problem and often have run with my daughters here. I also have been to various events and concerts and the venue is great as long as the weather is decent.",
  "A good place to see another side of Salem as you view or ride the carousel, check out the sternwheeler and the river, take photos in front of the giant, colorful globe or stroll across the bridge to walk on the island. ",
  "This is a beautiful river front park in the heart of downtown Salem. Great wide walking paths the circle the entire park. We watched Bald Eagles fishing in the river, which was really amazing. The park has perfectly manicured grass and vegetation. They have benches and picnic tables as well as many mature shade trees to sit under.\nFor kids they have a beautiful carousel with hand sculpted animals. They often have popcorn, or hotdogs for sale near the carousel during summer months. \nThe park has a nice large play structure for kids, it is not shaded so surfaces can become very hot in the heat if the day during the summer. \nThe park also has many special events throughout the spring and summer that are always well organized.\nDuring these events parking can be a challenge since they only offer two Somewhat small parking areas. Overflow parking is in the streets of downtown.\nRiver Front park is also attached to Mintos Brown Park by a bridge, this park is primarily for nature lovers who prefer to walk on dirt paths.\nOverall I think this is the best park in Salem and would recommend it to anyone visiting Salem.",
  "The park is located on a branch of the Willamette River. The park is beautifully landscaped, has lots of picnic tables and bences, and is a great place to walk. The parking is a little far for older people or people with disabilities.",
  "The park is lovely and in places (bridge and globe) really unique. I loved the walk by the river.\n\nAccess from the city is odd in that one pavement route just ends in a 6 lane highway and no crossing.  The entire site has only one entrance so you may need to backtrack to the entrance. ",
  "While visiting downtown Salem, we walked from the Capitol Building to the Waterfront Park to ride the carousel. The indoor carousel is made up of many beautifully carved animals, each exquisitely designed. I am a grandmother and still love to ride carousels; this was one of the prettiest I've seen. The park is located on the banks of the Willamette River and includes 29 miles of trails."
 ]
},{
 "name": "Minto-Brown Island Park",
 "address": "2200 Minto Island Road SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/95/61/49/minto-brown-island-park.jpg",
 "tags": [
  "family",
  "walking",
  "nature",
  "parks",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d1447335-Reviews-Minto_Brown_Island_Park-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Best park for walking, biking with friends or family. Nature everywhere from deer, eagles, ospreys, hawks, owls, woodpeckers and much more. Great pathways and easy walking for acres. ",
  "Minto Brown Island Park is one of the best parks out there. It's a relaxing place to walk and everyone is nice to you and it's a perfect place to bike and bring your dog with. I highly recommend  going here if you want to start to lose weight.",
  "We rode our bikes here last summer. Trails are well-maintained. Nice, shady ride along the river. Very nice experience.",
  "This park is huge and has many different trails.  In the summer, when it's warm, we take the trail next to the river for a nice breeze.  When it's cooler, we take the inside trail where there is more sun.  I also love the dog park.  Many friendly people there and my dogs love it.  It is not fenced, so at first I was a little leary, but the dogs seem to stay away from the street and there is a trail that goes away from the street so I can make it work.  ",
  "This is an oasis in the middle of the city.   A beautiful place to walk, ride a bike or take your dog out.  "
 ]
},{
 "name": "Bush's Pasture Park",
 "address": "600 Mission St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ac/7f/e3/bush-s-pasture-park.jpg",
 "tags": [
  "walking",
  "parks",
  "hike",
  "family",
  "walk",
  "active",
  "walk",
  "art",
  "kids",
  "walk",
  "art",
  "kids",
  "walk",
  "kids",
  "walking",
  "parks",
  "hike",
  "family",
  "walk",
  "active",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d124622-Reviews-Bush_s_Pasture_Park-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is one of the finest parks in Oregon. It's easy walking, jogging, strolling, seeing people with children and dogs enjoying the outdoors. The rose garden is fabulous and the oak trees magnificent.",
  "This park has it all...trails that meander through beautiful landscaping, through the woods, beside a creek, around a very active sports-field, a soapbox derby track, 2 children's playgrounds, a greenhouse, a Victorian mansion that is open for tours, and a rose garden. People jog, walk, run, sit on benches, have picnics, take family photos, attend weddings in the rose garden's gazebo, hike in the woods, play tennis on the courts, cheer teams from the bleachers, paint, sketch, take photos, walk dogs, volunteer to maintain the grounds or give tours of the mansion, or just lie on the grass and stare up at the sky. Everything a park should be, and more.",
  "The park is covered in leaves and the trees have spectacular color at the moment. Nice walk around the park surrounded with beauty. Highly recommended.",
  "This is a great place for a walk or run and is dog friendly.  Be sure and check out the rose garden and Bush Barn.  Bush Barn has changing art exhibits worth seeing. There are playgrounds for the kids and plenty of picnic tables.",
  "This is a great place for a walk or run and is dog friendly.  Be sure and check out the rose garden and Bush Barn.  Bush Barn has changing art exhibits worth seeing. There are playgrounds for the kids and plenty of picnic tables.",
  "Last September I had a few weeks in Salem which I spent running in this park with my dog.  We parked near some quaint older homes and for the most part it felt safe.  Some areas in the park are a bit secluded and are sketchy, but most of it seems safe.  ",
  "Vary nice park knowable staff when answering questions about the park and home. It is a public park so you can throw a fesbie play fetch tag with the kids.",
  "This is one of the finest parks in Oregon. It's easy walking, jogging, strolling, seeing people with children and dogs enjoying the outdoors. The rose garden is fabulous and the oak trees magnificent.",
  "This park has it all...trails that meander through beautiful landscaping, through the woods, beside a creek, around a very active sports-field, a soapbox derby track, 2 children's playgrounds, a greenhouse, a Victorian mansion that is open for tours, and a rose garden. People jog, walk, run, sit on benches, have picnics, take family photos, attend weddings in the rose garden's gazebo, hike in the woods, play tennis on the courts, cheer teams from the bleachers, paint, sketch, take photos, walk dogs, volunteer to maintain the grounds or give tours of the mansion, or just lie on the grass and stare up at the sky. Everything a park should be, and more.",
  "Do you like to ride bikes in a scenic place? Do you like to run your dogs?\nThis is the place for you, \nNice picnic pavilion.\nIt even hooks up with Downtown Salem over the picturesque foot bridge.\nIf you suffer from Cottonwood like I do, don't go in late spring early summer.",
  "Nice parking area, building with bathrooms, play area for kids, paved walking trail.\nAlso includes a gallery. The entry has a rise garden. Well maintained."
 ]
},{
 "name": "Oregon State Capitol",
 "address": "900 Court St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/77/6a/5f/jardins-e-predio-belissimos.jpg",
 "tags": [
  "tour",
  "kids",
  "free",
  "history",
  "historic",
  "tour",
  "history",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d124623-Reviews-Oregon_State_Capitol-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited the Capitol building and enjoyed the excellent and informative free tour of the building conducted by a volunteer, and actually came back a couple of days later to take the tower tour that brings you up to the outdoor roof deck above the rotunda just below the golden pioneer statue. I recommend checking for tour hours BEFORE visiting unlike we did, but we felt it was well worth the 2nd visit especially for the kids. All free, and there is a nice little thoughtfully stocked gift shop by the information desk as well!",
  "Learning about the history of the Capitol building and the state of Oregon was very fascinating. You can actually see the both chambers of Congress for Oregon, as well as the governor's office that is used for like signings of special documents. As well as what the governor uses when he or she is on the news.",
  "We need to return to more thoroughly enjoy this beautiful building but enjoyed what we had time for; the historic murals, photo gallery, and a peak into the senate and legislative chambers. It was fin to observe a school group on a scavenger hunt! It started pouring rain during our visit so purchased an umbrella in their well stocked gift shop.",
  "Road trip!  Capitol # 43!  Our guide, Suzanne, made this capitol even better! Tours are on the half hour. We almost joined a school group but decided to wait when we were told the there were no school groups on the next tour. Great move as we were the only people on our tour.  Beautiful building with easy street parking close to the entrance.",
  "Oregon has many wonders and rich history. The Oregon Capital is no different and the walls are filled with knowledge for those who thirst for history.",
  "One of the most beautiful sites is when the cherry blossoms bloom. There are plenty of walkways and wheel-chair accessible. Benches line the walkways for a nice rest or photo opportunity. ",
  "The Oregon State Capitol is a bit different from other capitols.  The dome is more of a cylinder.  It is quite striking in appearance.  The murals on the interior are outstanding.  Worth a stop.",
  "Always impressed by the Oregon State Capital building with its gold man standing watch over the Art Deco marble building built in the mid 1930s after the previous capital was destroyed by fire. "
 ]
},{
 "name": "Gilbert House Children's Museum",
 "address": "116 Marion St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/e2/1d/ac/ac-gilbert-s-discovery.jpg",
 "tags": [
  "family",
  "active",
  "family",
  "active",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d124626-Reviews-Gilbert_House_Children_s_Museum-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "On our trip to Oregon (we are from Pennsylvania) our friends took us here to the Gilbert house. We very much enjoyed the maze playground outside. Well constructed with lots of places to climb though and hide when playing tag with the family. There are several slides, one being a spiral one with about 5 total spins. Sure makes u dizzy when getting out at the bottom. The indoor area was fun as well, but for our active family, the playground was the hit. We also packed a lunch and ate it there on tables outside.",
  "My niece, her 5 year old and I all had fun on the outdoor play area (evening thought it was a bit wet) and all of the many fun and educational rooms in the houses.   We especially liked the screen that continually changed and made all movements change -",
  "The Gilbert House has a wide variety of hands-on activities for young children with themed rooms spread through three houses.  We were traveling with a 3 year old, and she had a wonderful time.  Both the indoor and outdoor activities were entertaining and educational.  Don't miss the A. C. Gilbert Legacy of Play display.",
  "As Children museums go, this one is rates 2 thumbs way up! It has so many great features, learning, education and play areas. I will continue to take my Grandchildren back for  many years.",
  "On our trip to Oregon (we are from Pennsylvania) our friends took us here to the Gilbert house. We very much enjoyed the maze playground outside. Well constructed with lots of places to climb though and hide when playing tag with the family. There are several slides, one being a spiral one with about 5 total spins. Sure makes u dizzy when getting out at the bottom. The indoor area was fun as well, but for our active family, the playground was the hit. We also packed a lunch and ate it there on tables outside.",
  "Opening till 5 pm, it’s a good place for the young kids to have fun. They will love the playground and the slides. Exhibitions where they can explore, it costs 8$ per person.",
  "Gilbert House is the perfect place to take your grandkids from the time the can toddle until age 10+. Don't miss the memories you all will have.",
  "She had so much fun. So many things to do. Both inside and outside there were lots of activities. Pretty good value for the price. Granddaughter is 5."
 ]
},{
 "name": "Oregon State Hospital - Museum of Mental Health",
 "address": "2600 Center St NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/06/80/54/oregon-state-hospital.jpg",
 "tags": [
  "tour",
  "walk",
  "knowledgeable",
  "tour",
  "walk",
  "history",
  "family",
  "history",
  "unique",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d3561635-Reviews-Oregon_State_Hospital_Museum_of_Mental_Health-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "We did a quick road tour of Salem first.  Then we found a review of this fine museum on TripAdvisor.  \nDisplays of early treatment of mental illness, categories of psychiatric diagnoses. Interesting displays of treatments such as electroconvulsive and insulin shock therapy, the hydro tank and others.\nInteresting interviews with former patients.\nThe grounds were lovely and worth a walk. \nOne Flew Over the Cuckoo’s Nest was filmed here and there is footage.  There are also photos of the cast. I enjoyed reading about the cast members’ interactions with patients and staff, who also were casted in the film.",
  "This is a great hidden gem on the grounds of the Oregon State Hospital, where \"One Flew Over the Cuckoo's Nest\" was filmed. They even have the SAME TV shown in the movie. But Hollywood is only a small part of this informative site. The film about the cremations is riveting. The staff is very knowledgeable and helpful. One of the best stops I made in Salem!",
  "This place is amazing. The table that lobotomies were performed on is on display. People talking on old rotary phones as you pick them up to listen to testimonials about being a patient there long ago is mesmerizing and about how one doctor hung himself in a closet in one of the wards!! There are photos, a room where you can go inside and feel the eery darkened room with a bed and windown with bars on it, and many photos of the actors that played in the movie that was made there One Flew Over the Cookoos Nest,, even nurse Ratchet came back to cut the yellow ribbon on the day one wing was opened. This hospital has windows on every side designed so that patients can look out upon the manicured expanding lawns with flowers everywhere and see the natural light in thier windows. The museum is one of the most interesting I have ever seen, Photos, medical equipment, names and dates and diseases of why patients were admitted including one man that was admitted because he was sad he had lost his entire farm and everything he owned. Children were admitted to the hospital long ago and some never got released into the world again. If you get a chance go to this amazing place and spend a few hours, We did and we are happy that we went. It cost $7 each, and well worth every penny. You even see a straight jacket that was used long ago with blood on it.. ",
  "We did a quick road tour of Salem first.  Then we found a review of this fine museum on TripAdvisor.  \nDisplays of early treatment of mental illness, categories of psychiatric diagnoses. Interesting displays of treatments such as electroconvulsive and insulin shock therapy, the hydro tank and others.\nInteresting interviews with former patients.\nThe grounds were lovely and worth a walk. \nOne Flew Over the Cuckoo’s Nest was filmed here and there is footage.  There are also photos of the cast. I enjoyed reading about the cast members’ interactions with patients and staff, who also were casted in the film.",
  "Much more interesting than disturbing. A real eye-opener. My friend from out-of-state wanted to see the museum. I agreed reluctantly to tag along. This was a fascinating look at the history of one huge complex. This hospital is the largest I have ever seen, and with a background in healthcare, I have seen a lot. We arrived too late to spend more than 20 minutes at the museum, but it would definitely deserve a more extended visit.",
  "We stopped in with time to burn, and turned into a great choice. Super interesting about the origins of mental hospitals in general, and specially this one. Very sad to read how people put in here were simply committed by family members with no training in mental health. Sad history of Oregon. Also, all the abandoned remains of those placed here. So sad. Great history about 'One Flew Over the Coocoo's Nest' for fans.",
  "This is a unique niche museum. It’s low tech, with displays that have interesting photos and artifacts, but nothing that is really interactive.\n\nThe museum is more focused on the history of MH treatment at the Oregon State Hospital rather than a broader focus on mental health.\n\nThere was a small section dedicated specifically to the film “One Flew Over the Cuckoo’s Nest,” which was filmed there.\n\nIf you have an interest in the evolution of MH treatment from the mid-19th Century to present day, it is worth a visit.",
  "This museum is on the grounds of the beautiful Oregon State Hospital campus and includes exhibits about the state mental hospital's history, even including equipment like straitjackets and electroshock machines. Most people seemed to find the \"One Flew Over the Cuckoo's Nest\" exhibit interesting -- it even includes the TV from the movie.   Staff is very happy to answer questions.  After touring the museum, be sure to visit the memorial showcasing the copper cans containing cremated ashes of many of those who died at the hospital. It is a very respectful and beautiful site."
 ]
},{
 "name": "Willamette Valley Fruit Company",
 "address": "2994 82nd Ave NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/64/33/f9/happy-hour-9am-11am-pie.jpg",
 "tags": [
  "delicious",
  "delicious",
  "unique",
  "unique",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d3821127-Reviews-Willamette_Valley_Fruit_Company-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place is a little out of the way, but well worth it! All their pies are made right there on the premises. You can buy a slice with ice cream, or you can buy a pie to go, stuffed with delicious Oregon grown fruit. Great for a special occasion dessert. They even have happy hour early in the day for pie and coffee. They have a cute little gift shop with syrups and jams . If you have out of town visitors, take them here for pie!",
  "We love dole whip and this place has it! Pineapple and strawberry. They have awesome pies, scones, turnovers, and muffins as well as other great items you can't find in other places. Go for the dole whip and stay for the pie or take it home. Yum!! ",
  "This place is a little out of the way, but well worth it! All their pies are made right there on the premises. You can buy a slice with ice cream, or you can buy a pie to go, stuffed with delicious Oregon grown fruit. Great for a special occasion dessert. They even have happy hour early in the day for pie and coffee. They have a cute little gift shop with syrups and jams . If you have out of town visitors, take them here for pie!",
  "Cozy shoppe.  Lots of interesting and unique items.  Excellent staff.  Worth a visit.  The strawberry shortcake had the best homemade Whipped cream.  I'll be visiting again.  ",
  "We planned to stop by on our way to the Oregon coast , On my wife’s bucket list and we loved the drive there driving through the Willamette valley, it’s so beautiful! We were not expecting to be disappointed in the products, we bought a chicken pot pie, and two slices of pie and a strawberry freezer jam and several pie crusts to take home. First off we buy their pies at home and have enjoyed for years so why the slices of pie were not up to their standards? Who knows. Cute store and friendly help but we were just disappointed in their restaurant. They offer a ton of frozen and freshly baked items. You might enjoy it but we were disappointed!",
  "This unique eatery well off the beaten path, just west of Salem, OR, is a great place to have a slice of your favorite pie or to try a slice of something different, just for excitement. When we've been visiting my brother-in-law who lives in Salem, this is our \"go to\" place for a great lunch or just a piece of pie or a root beer float. I have never been disappointed in what I've been served. Also, you'll enjoy just shopping around the gift shop as it has items that are not usually carried any where else. The jams are fabulous. Don't miss this tremendous place to eat.",
  "Although a little out of the way this place was just what the wife was looking for. She purchased locally made jams. Also lots of nick nacks to purchase if you wish. We sample two pies and they were very tasty but time permitted us from try a whole piece or buying one.",
  "All of the fruit offerings here are EXCELLENT (I stop in whenever I go by!) but when they are serving strawberry shortcake, don't miss it!  And save room, because the servings are huge!"
 ]
},{
 "name": "Adelman Peony Gardens",
 "address": "5690 Brooklake Rd NE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/cc/9d/a5/plenty-of-closeup-photos.jpg",
 "tags": [
  "family",
  "free",
  "walk",
  "nature",
  "nature",
  "free",
  "walking",
  "walk",
  "free",
  "family",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d4290271-Reviews-Adelman_Peony_Gardens-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited this lovely garden in early June and every peony was in full bloom. In addition to the display garden beds are beautifully manicured gardens filled with a variety of flowers and seating areas. Inside the barn is a showcase of each peony that Adelman's sells. We purchased a beautiful bouquet to take to our hotel room. A really helpful brochure that is available at Adelman's is titled \"Gardening 263\" after the 1-5 exit number where at least eight family flower gardens/nurseries are located.",
  "Visited 3rd weekend in May and the display garden was in full bloom.  The garden is professionally designed and cared for and it shows.  \n\nI spent a day visiting three flower fields and display gardens in Woodburn in one day and this was by far the best display garden. (Adelman, Brooks, and Schriener are all very close together for a one day flower-viewing trip).\n\nThe garden is so well-designed it is a pleasure to view and walk through on a macro scale--colors, shapes, accessories all work to create a peaceful and pleasing space.  On a detail level, the flowers here are dense, vibrant, healthy, and beautiful, inviting closer inspection.\n\nIt's also possible to walk among the peony fields although they were mostly not yet in bloom the 3rd weekend of May.  They were full of promising buds just about to burst into color and based on the quantity of plants, I'm sure it would be a sight to see in full bloom.\n\nDefinitely worth the visit, and it's free to visit.",
  "A definite place to visit if you love peonies. Acres and acres of peonies that peak around Memorial Day week (if you’re from out of town, best to call beforehand and check the status of the blooms since bloom time is at the mercy of Mother Nature). They have pots of peonies that you can purchase as well as certain fresh cut blooms. They have shelves of cut peonies so you can see what they look like before making a purchase. Bear in mind that the actual area of peony acreage is not wheel chair friendly (dirt tracks).",
  "A definite place to visit if you love peonies. Acres and acres of peonies that peak around Memorial Day week (if you’re from out of town, best to call beforehand and check the status of the blooms since bloom time is at the mercy of Mother Nature). They have pots of peonies that you can purchase as well as certain fresh cut blooms. They have shelves of cut peonies so you can see what they look like before making a purchase. Bear in mind that the actual area of peony acreage is not wheel chair friendly (dirt tracks).",
  "Make sure you check their website for their openhouse dates, so you won't arrive and be disappointed.  But if you do find yourself in Salem area during the late spring, this has a beautiful display garden that is right around the farmhouse by the parking area. \n\nThe fields of peonies are a little walk away, but just so lovely to stroll among all the varieties/colors, just make sure you stop by the shop first to pick up a free catalogue, so if you are lucky enough to live where peonies grow/thrive, you can read and make notes about the varieties you prefer of the ones you are seeing as you are walking through the fields. \n\nThis is free to walk around during their open house time.\n\nNote:  You will want to wear good walking shoes that you don't mind being on grassy paths with.",
  "Free spot to stop off and see.  Only open for a couple of months so get out there.  you can buy flowers there too.",
  "We visited this lovely garden in early June and every peony was in full bloom. In addition to the display garden beds are beautifully manicured gardens filled with a variety of flowers and seating areas. Inside the barn is a showcase of each peony that Adelman's sells. We purchased a beautiful bouquet to take to our hotel room. A really helpful brochure that is available at Adelman's is titled \"Gardening 263\" after the 1-5 exit number where at least eight family flower gardens/nurseries are located.",
  "Very easy to get to from highway 5 . Lots of parking . It’s basically a private home with several small display gardens . Very well maintained. It is a wholesale peony nursery and they open their garden during bloom season to display their plants for sale . Inside their shipping building they set up a large display of fresh cut peonies in vases , all named . You can purchase some peony buds to take home as cut flowers . You can purchase some peony plants in containers also . They are near schreiners iris farms and a large hosta nursery too . Very enjoyable .",
  "A beautiful place to visit. The Adelman Peony Gardens are a smaller scale than the Wooden Shoe Tulip Farm or Schreiner's Iris Gardens. The peonies bloom later and last longer in bloom than the tulips and Irises. The Adelman Peony Gardens are laid out like a smaller version of Schriener's Iris Gardens. The peonies are mixed in with iris and other flowers. It is less crowded with visitors and is a much more relaxed experience. You can sit down and feel you have the whole place to yourself. There is no charge to enter.\nWhile we were in the gift shop, one of the workers came by and talked with us. Since it was early afternoon, she recommended that we also visit the nearby Sebright Gardens. This turned out to be a very nice suggestion and combining the two gardens was excellent.",
  "Visited 3rd weekend in May and the display garden was in full bloom.  The garden is professionally designed and cared for and it shows.  \n\nI spent a day visiting three flower fields and display gardens in Woodburn in one day and this was by far the best display garden. (Adelman, Brooks, and Schriener are all very close together for a one day flower-viewing trip).\n\nThe garden is so well-designed it is a pleasure to view and walk through on a macro scale--colors, shapes, accessories all work to create a peaceful and pleasing space.  On a detail level, the flowers here are dense, vibrant, healthy, and beautiful, inviting closer inspection.\n\nIt's also possible to walk among the peony fields although they were mostly not yet in bloom the 3rd weekend of May.  They were full of promising buds just about to burst into color and based on the quantity of plants, I'm sure it would be a sight to see in full bloom.\n\nDefinitely worth the visit, and it's free to visit.",
  "NOt all was in bloom for it was a little too early, probably the 3rd week in May would have been the best "
 ]
},{
 "name": "Elsinore Theatre",
 "address": "170 High St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/46/c7/85/elsinore-theatre.jpg",
 "tags": [
  "walking",
  "walk",
  "performance",
  "theatre",
  "performance",
  "theatre",
  "kids",
  "food",
  "tour",
  "theatre",
  "tour",
  "music",
  "learn",
  "history",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284685-Reviews-Elsinore_Theatre-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "The lobby is beautiful, warm and almost palatial.  The ushers and other staff are especially pleasant and helpful.  The theater makes great accommodations for the physicially disabled.  There does not seem to be a bad seat in the house.  There are a number of nice restaurants close by although parking is somewhat limited, especially if walking is a problem or being all dressed up and having to walk in the rain.",
  "Check the Elsinore's schedule, attend something, you will be blown away. Somehow the magnificent building will enhance any performance. \n\nNearly any even has an intermission and sells overpriced wine, but go ahead, it's for a good cause.\n\nThis Tudor-Gothic style theatre features modern seats that are comfy on the main floor. The \"Loodge\" and balcony may still have the old dangerous seats. Maybe not, don't quote me. However, it's been said that the Elsinore is acoustically perfect and the sound great from any seat.\n\nLook for the lovely stained glass on the second level. Also note there is a hard to see window depicting Elsinore Castle in ??? Bavaria? You can see this by standing across the street at Rice Time and looking up, or from the room in the attic where the projectionist used to sit when this was a movie theater.\n\nThere had been a trap door in the stage floor that exited into the largest dressing room in the basement, but I guess that's been taken out. Boo hiss.\n\n",
  "The theater is nicely restored and worth a visit for a movie or stage performance, but try to get there when the staff or a visiting artist demonstrates the organ.  It seems that each year we lose a great theater organ somewhere to demolition, sale to a private enthusiast, or neglect.  For kids who have not experienced a silent film with theatre organ accompaniment, it can be a very exciting and memorable experience.",
  "What a beautiful place to attend a concert. Nestled in downtown Salem, Oregon, it's a hidden jewel in the hustle and bustle of commerce. The interior work done to restore it back to the original architecture is amazing. There is not a bad seat in the house. By virtue of its size and seating arrangement you feel you are enjoying a personal concert. There are great restaurants nearby who feed you great food and get you out quick so you make your show. We're looking forward to watching the group Kansas in March and hope to see more of these concerts in coming years.",
  " A few years ago the powers that be, including many well heeled donors banded together to pump over three million into this place instead of razing it for parking. Amen.....  It is a terrific venue for  many different kinds of events. We have seen two huge musical acts, and sat Balcony first row, and mezzanine second row.  The building is a treat. sound ditto.  As impressed as we were, we signed up for one of the special guided tours they offer on Sundays. Ho boy. Five bucks to have an intimate and complete tour from the stage and dressing rooms to the tip top of the balcony, there is so much to see and appreciate in the updated restrooms and restored stain glass.  Got for it.",
  "The Elsinore is a beautiful old theatre that retains its early 20th century charm and flourish.   \n\nWe saw Colin Hay perform there and there wasn’t a bad seat in the house in this cozy theater.  \n\nGreat venue with friendly staff.  They serve beer and wine.  ",
  "The Elsinore Salem's lovingly-restored ornate theater from the 1920s, the heyday of silent films and vaudeville.  Many such theaters around the country, including Salem's neighboring Capitol Theater, have been torn down, lost.  So the Elsinore is not only a city treasure, it is a state treasure, and a national treasure.  And the folks who do the administration are working hard to bring class acts and community events to the theater.  Come see an event, and marvel again at the theater's beauty, serving still as one of Salem's beloved gathering spots.  ",
  "Salem has done a marvelous job preserving the Elsinore Theatre. We have seen the Eugene Ballet - Nutcracker, the classic movie - Moby Dick and most recently - A Taste Of Spain with the Salem Symphonic Winds and Al Andalus. The latter was superb with a marvelous combination of classical music and flamenco. \nOn Sunday we had a special treat. We did the monthly behind the scenes tour for $5 a person. You see the the Elsinore from the basement dressing rooms to the top level of seating. You learn the history of the theatre and the ongoing effort to preserve it. You see the stained glass up close. We even got to hear the Wurlitzer organ being played. Special treat for 1 3/4 hours. You go up and down a lot of narrow stairs."
 ]
},{
 "name": "Deepwood Museum & Gardens",
 "address": "1116 Mission St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/4e/6f/da/historic-deepwood-estate.jpg",
 "tags": [
  "art",
  "walking",
  "nature",
  "tour",
  "tour",
  "family",
  "history",
  "tour",
  "structure",
  "historic",
  "walking",
  "free",
  "walking",
  "art",
  "nature",
  "kids",
  "tour",
  "tour",
  "history",
  "walk",
  "art",
  "walking",
  "nature",
  "tour",
  "tour",
  "family",
  "history",
  "tour",
  "free",
  "knowledgeable",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284550-Reviews-Deepwood_Museum_Gardens-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Although we did have the opportunity to tour the Deepwood Mansion, we very much enjoyed walking through the lovely gardens, nature trail, and hot house. The borders were in full bloom and looked glorious! Close by is the Bush's Pasture Park which is filled with rose gardens and an art center. This was a great stop as we explored the greater Salem area.",
  "We had an excellent tour of the home. Our young female guide told us about the home and the 3 families that lived there. There are many photos but few family articles. However they supplement the family articles with items from the correct time periods. Two examples were a player piano and an early version of a record player. Both were operated and it was very nice experience. It is an old home on two floors and steep stairs need to be climbed. The city of Salem and the volunteer groups are to be commended for preserving this piece of Salem history.\nWe timed our visit so we could follow the home tour with a once a month guided tour of the gardens by Lord & Schryver volunteers. This greatly added to our enjoyment of the gardens since they described everything and answered all our questions. The gardens are extensive and much was in bloom. To our surprise, we were the only visitors on our tours.",
  "This turn-of-the-century home is an interesting but fairly typical historic house of the period.  It is well decorated, and the docents provide considerable information about changes to the structure over the years.  Of particular note are some fine works of stained glass. \n\nThe house tour, though, pales in comparison to walking through the gardens.  Even in early spring, when nothing is blooming, the gardens and woodlands are interesting.  I made a note to return when things are in full bloom.  There is a conservatory as part of the garden and extensive arbors.\n\nThere are public restrooms in the garden and good parking.",
  "Deepwood Estate in Salem is a 120 year old home built in 1894 with both formal English gardens and wild nature areas.  Tours of the home cost a fee and are open to the public at set hours.  They give you a glance at how an elegant home of over 100 years ago looked, and the furniture and clothing styles.  \n\nTotally free and magnificent are the gardens there are numerous formal garden areas to explore.  A wonderful greenhouse and then a wild natural area that is full of all variety of plants for children to explore.  The path runs by the creek.  \n\nAs a teacher, I took classes to Deepwood each spring to help identify different types of plants, flowers, and trees and to enjoy the difference between formal and natural gardens.  We often came at the same time as the Bush Barn Student art show so that we could view student art on the same day.  \n\nIt is a nice place to take a picnic lunch and explore a park-like setting that does not include a playground.  I taught primary kids and they always enjoyed looking at the house and grounds.  Peeking in the windows off the porch, and going in the greenhouse.  Simple exploring.  There are more walking paths and playground equipment at Bush Park right across the creek and you can get there over the bridge a block  South of Deepwood or by walking over the bridge on Mission Street.  ",
  "Deepwood is an incredible 1894 Queen Anne Victorian mansion. Full disclosure I volunteer as a tour guide at this lovely home. The house designed by local architect William C. Knighton is filled with stained glass windows designed by the Povey Brothers. Viewing the stained glass alone is worth the price of admission. Tip: Check the web site for tour hours. During summer tours are in the morning. Great way to start your morning exploring Salem. The gardens surrounding Deepwood were designed by Lord & Schryver. Tip:Tours take place on the hour if you arrive early take a stroll through the gardens. Restrooms are located by the greenhouse next to the parking lot.",
  "This is one beautiful home. Our tour guide provided so many details of the lives of those who called this place home. And what a home it was! Well worth the visit for the history, the life-stories of those who called it home, and how it has been lovingly restored and tended for the visitors lucky enough to walk through its rooms.",
  "Although we did have the opportunity to tour the Deepwood Mansion, we very much enjoyed walking through the lovely gardens, nature trail, and hot house. The borders were in full bloom and looked glorious! Close by is the Bush's Pasture Park which is filled with rose gardens and an art center. This was a great stop as we explored the greater Salem area.",
  "We had an excellent tour of the home. Our young female guide told us about the home and the 3 families that lived there. There are many photos but few family articles. However they supplement the family articles with items from the correct time periods. Two examples were a player piano and an early version of a record player. Both were operated and it was very nice experience. It is an old home on two floors and steep stairs need to be climbed. The city of Salem and the volunteer groups are to be commended for preserving this piece of Salem history.\nWe timed our visit so we could follow the home tour with a once a month guided tour of the gardens by Lord & Schryver volunteers. This greatly added to our enjoyment of the gardens since they described everything and answered all our questions. The gardens are extensive and much was in bloom. To our surprise, we were the only visitors on our tours.",
  "They have a day in December that they do a free event. They have a Santa available for pictures. I enjoyed the staff and volunteers a lot. It's a self guided tour which I like because it's at your pace. Yet there's plenty of people on hand to help you, answer questions and are extremely knowledgeable. They're very passionate about the property and keeping it preserved. I plan on going back for a guided tour and won't mind paying the fee.",
  "Plenty to see here and a great hot house with some fine tropical plants.  Well worth a visit.  Parking free and easy to access too."
 ]
},{
 "name": "Willamette Heritage Center",
 "address": "1313 Mill St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/b7/1d/2f/willamette-heritage-center.jpg",
 "tags": [
  "history",
  "food",
  "tour",
  "food",
  "tour",
  "free",
  "tour",
  "free",
  "historic",
  "knowledgeable",
  "historic",
  "tour",
  "learn",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284552-Reviews-Willamette_Heritage_Center-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Mission Mill Museum is the crown jewel here. I am a weaver, or was a weaver.... anyway I know a bit about looms, wool, carding, dying and spinning, so you can imagine why I found this museum SO awesome! But even my friend, who was NOT a weaver of any sort, loved it. It's like stepping back in time, you can just hear the machines running and see in your minds eye, the looms churning out fabric. The Mill Building is impressive, as are the several historical houses that were moved to the grounds. Watch the introductory movie then you won't have to read every word of the (lengthy) signage. Over-all, very educational and the grounds are lovely.",
  "Would love to come at Christmas. I love the history and intrigue of the museum both historical and industrial. Food, shopping, museum. Can be at own pace if self guided or an additional touch with the costumed guide.",
  "My husband, brother-in-law and I did a self guided tour of the old mill facility and thoroughly enjoyed seeing the beautifully preserved old buildings, equipment and wool processing. It was so interesting to see the machinery in action, and the photos and written information displayed in all the rooms lends itself to a self guided tour. At the end, there is a coin operated dispenser for food to feed the ducks, and we took full advantage of that as well!",
  "There is no charge to stroll through the grounds along the Mill race. Feed some ducks; admire the preserved pioneer buildings on the grounds. If you have time, stop by the museum (FREE on Tuesdays!) and arrange to tour the homes.  Details are here: http://www.willametteheritage.org/general_information.html",
  "There is no charge to stroll through the grounds along the Mill race. Feed some ducks; admire the preserved pioneer buildings on the grounds. If you have time, stop by the museum (FREE on Tuesdays!) and arrange to tour the homes.  Details are here: http://www.willametteheritage.org/general_information.html",
  "Attended a 2-day meeting at the Dye House here, and it easily accommodated our group of 30-35. The Dye House meeting space is very good and roomy, but the space can be noisy and echo-y. The operator might consider hanging noise-absorbing tapestries, panels, or cloth to cut down on this. Another bonus is the tasty cafe onsite, which provided our lunches after we preordered them in the morning. The staff is very knowledgeable, helpful, & friendly, too. There is also much to see onsite during meeting breaks, including historic buildings, exhibits, and stores selling arts and crafts. I enjoyed productive meetings here and would recommend it if you're looking for a meeting site in the Salem area. ",
  "This is one of the coolest places in Salem and very historic. It's an old mill where you can watch demonstrations of wool-making. Upstairs is a marvelous gallery with dozens of local artists. On the main floor are terrific shops for books and gifts. ",
  "We had intended on touring both the pioneer missionary homes and  buildings plus the old mill and new shops, but the tour of the Pioneer homes was so thorough we only had time for them. We were lead through the buildings by a very delightful and well informed docent. She wore period dress and stayed in character for two hours! It was very interesting to learn about the pioneer/missionary history of Salem; we look forward to returning in the future to learn about the mills as well. A well stocked gift shop adjoins the exhibits and buildings.",
  "If you're interested in textiles, or in Oregon history, or in how things are made, you will find something interesting at this combination museum/old woollen factory. I've lived in Oregon 28 years and didn't know anything about the Methodist missionaries who settled the Salem area, and about their impact on the natives. And I didn't know anything at all about how wool was made into cloth.  Allow about 2 hours to see all of the old buildings and the old factory. \nIt costs $8 but they do offer a number of discounts for AAA members, seniors, students, etc., so it's likely you will fit into one of those categories.",
  "Mission Mill Museum is the crown jewel here. I am a weaver, or was a weaver.... anyway I know a bit about looms, wool, carding, dying and spinning, so you can imagine why I found this museum SO awesome! But even my friend, who was NOT a weaver of any sort, loved it. It's like stepping back in time, you can just hear the machines running and see in your minds eye, the looms churning out fabric. The Mill Building is impressive, as are the several historical houses that were moved to the grounds. Watch the introductory movie then you won't have to read every word of the (lengthy) signage. Over-all, very educational and the grounds are lovely.",
  "Very nice entry. The restaurant can be improved and is run down.  There is a mildew problem in many of the exhibition buildings."
 ]
},{
 "name": "Willamette University",
 "address": "900 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/2b/dd/4e/willamette-university.jpg",
 "tags": [
  "food",
  "art",
  "eat",
  "food",
  "active",
  "art",
  "historic",
  "nature",
  "food",
  "art",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d124624-Reviews-Willamette_University-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Willamette is a gem of a liberal arts university, with an exceptional law school. The grounds are immaculate; great place to take walks in center of town. Goudy Commons has exceptional food for college campus. Look online for variety of musical events, and speakers. Top Oregon Law School for career placement.",
  "A beautiful campus, great student support and close to the town with great coffee shop and restaurants! ",
  "Willamette University is more than just an institute of learning. This is a very worthwhile stop for anyone in Salem. The campus is very pretty, with a shallow creek running through it, many green spaces for such a small college, and good architecture. Stop by the Echoing Wall, where you can stand, talk, and hear your voice reverberate back. If you have the opportunity, eat at the cafeteria: the food is actually quite good.\n\nThe college does great things, too, by being very active in the community. That includes hosting incredible sports camps, performing community service, and providing entertainment with a renowned theater program. They have had many Oregon Professors of the Year and even possess the 3rd largest art Museum in Oregon (Hallie Ford Museum of Art). Willamette is truly outstanding.",
  "This university is one of the oldest west of the Mississippi.  The buildings are mostly made of brick and are historic in nature.  Wandering around the campus is peaceful.  The Hallie Ford Museum of Art is on campus.",
  "Willamette is a gem of a liberal arts university, with an exceptional law school. The grounds are immaculate; great place to take walks in center of town. Goudy Commons has exceptional food for college campus. Look online for variety of musical events, and speakers. Top Oregon Law School for career placement.",
  "We came for Bearcat Days, what a beautiful campus, nice staff and very nice overall experience. Nice that it is right across the street from the state capital too. ",
  "During a visit to the State Capitol, walked a short distance to the University.  Lovely campus with red brick buildings, gorgeous fall leaves, a stream full of ducks, and gardens.  Definitely a pleasant place for a walk.\n\nThe Hallie Ford Art Museum is also on campus-it's on my list for my next visit to the area.",
  "A beautiful campus, great student support and close to the town with great coffee shop and restaurants! "
 ]
},{
 "name": "Salem Public Library",
 "address": "585 Liberty St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/1b/94/16/salem-public-library.jpg",
 "tags": [
  "art",
  "library",
  "free",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284677-Reviews-Salem_Public_Library-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very clean, covered garage parking, helpful staff, quiet areas, patrolled and safe, good area, and much more.",
  "Clean. Well-stocked magazine selection. Easy to reserve books in their system. Personnel working there are helpful. Nice place.\n",
  "Salem Public Library is adored by our community.  It was built years ago, but in a modern era, which looks and feels modern, with high ceilings and great openness and space.  The library seems to have the right balance between older-style personal service, and state of the art technology, which allows one to check out books without even opening them, and also check-out books online to read as e-books or listen to as audio books on your favorite devices.",
  "Parking is not free or cheap. The elevators were not working on the day of my visit.  \nAir conditioned, quiet. Some seating. Large children’s area. Meeting rooms in the basement ",
  "Wish that there were more of Janet Chapman's books and Fern Michaels.  The only ones that I could find of Fern Michaels were in hard bound, not paper back like I like to read."
 ]
},{
 "name": "Cristom Vineyards",
 "address": "6905 Spring Valley Rd NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/6b/29/27/beautiful-views-at-cristom.jpg",
 "tags": [
  "tour",
  "tasting",
  "knowledgeable",
  "delicious",
  "unique",
  "history",
  "nature",
  "knowledgeable",
  "tasting",
  "tasting",
  "knowledgeable",
  "history",
  "tasting",
  "tasting",
  "knowledgeable",
  "tour",
  "tasting",
  "knowledgeable",
  "delicious",
  "unique",
  "winery",
  "tasting",
  "knowledgeable",
  "history",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d534205-Reviews-Cristom_Vineyards-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "We thoroughly enjoyed our Estate experience at Cristom. We made reservations in advance and were the only two guests during the tour. Our tour guide was a sommelier and was extremely knowledgeable about all things wine, which was great because we felt comfortable asking a plethora of questions. We started out with a line-up of the three wines: 2018 Estate Rose (Eola-Amity Hills, Willamette Valley), 2017 Mt. Jefferson Cuvee Pinot (Noir Willamette Valley), and the 2016 Estate Syrah (Eola-Amity Hills/Willamette Valley). While we sipped on these wines, we played a bit of a smelling/guess that odor game which is used to help guests with identifying tasting notes. After enjoying those wines, we piled into the Cristom car for a drive around the vineyards. This was an incredibly unique experience as we've never been driven into and around the vineyards before. We visited several of their blocks and were able to sample pinot noir, viognier, and syrah grapes straight off the vine. It was also nice to look out from the top of the hill over the expansive Oregon countryside. We also stopped by a dirt pit and scrambled around that for bit, which allowed us to gain a better understanding of the soil types at Cristom. \n\nUpon returning to the tasting room, we enjoyed a charcuterie board along with our last four wines - all pinot noirs: 2017 AVA Series (Dundee Hills), 2017 AVA Series (McMinnville), 2017 AVA Series (Eola-Amity Hills), and the 2017 Eileen Vineyard (Eola-Amity Hills). We also got to sample a bit of the 2017 Jesse Vineyard Pinot Noir. All of the wines were delicious and well balanced - nothing was too earthy or too berry-flavored. They were all complex, velvety, and very interesting. Overall, our experience at Cristom was the best wine tasting tour and experience we have ever done so far and we would highly recommend it to anyone who is interested in learning more about wine.",
  "Despite the day being overcast, and lightly raining, the drive into the lot led us through a column of cherry trees with pink blooms. Parked right next to vines. We felt like we walked into the home of someone who happens to grow wine. Jeri, was prepping for a slow day, and she was bright, personable, knowledgeable, and made it a pleasurable experience. The people here are responsible stewards of the land, take care to involve other growers in the area, and as a standard, strive to handcraft the finest wine that they can from what nature gives. Kudos for the history, the matriarchs instilling these values in the succeeding generations, and continued success.",
  "Pinot noir here comes in many different bottles. They offer at least five different single vineyard Pinots. Do not over look the very tasty Pinot Gris which I think might be one of the best in Oregon. The staff was great to me and the site is beautiful. The tasting room is nicely appointed and a fun place to be.",
  "This is a great stop for tasting and a picnic. We have been here several times, and staff has always been welcoming and knowledgeable. We like the variety of pinot noirs from their various single vineyards, and especially the ability to purchase them in 375 ml bottles.",
  "Cristom Vineyards is a beautiful place.  I was on a hunt for great Oregon Pinot Noirs to send to a cousin back east who wanted a good pinot from Oregon.  Cristom has wonderful pinot noirs.  We were the only ones in the tasting room that day so we learned a lot about Cristom from the gal pouring the generous tastes.  There is a lot of history at Cristom, not to mention the fabulous views.  On our drive to the vineyard we were following our GPS when the GPS instructed us to board a ferry and go across the river.  We thought that couldn't be right, so we called the vineyard to ask about these strange instructions.  She said yes, get on the ferry, if we wanted to.  If not we would have to go back the (long) way we had already come, go into Salem (fighting traffic), go west out of Salem to the vineyard.  She said it was shorter to cross on the ferry.  We decided to forge ahead since we had come this far.  The ferry takes no more than six cars at a time and the crossing takes about five minutes.  The drive going this way is absolutely beautiful; and it beats the traffic going the other way.  It was an unexpected part of our drive, but it added to the overall wonderful experience we had at Cristom.  I purchased many (many!) bottles of pinot.  Not all of them, however, will be sent to my cousin!  Cristom is well worth a visit whichever way you go.",
  "Cristom Vineyards was one of the highlights of our trip to Willamette Valley! A beautifully scenic drive and equally stunning views from their tasting room/deck. The staff is knowledgeable, friendly and eager to assist. The variety of wines to try was a treat! We are already planning our next trip back here, next year. Highly recommend! ",
  "Aw you may know, there are hundreds of vineyards to choose from in Oregon.    We are so happy we stopped at this one.  The people are very friendly.  The premises is beautiful.   The views are stunning.  And the wines are excellent.  We joined their wine club and we are looking forward to enjoying their wine for a long time.",
  "We thoroughly enjoyed our Estate experience at Cristom. We made reservations in advance and were the only two guests during the tour. Our tour guide was a sommelier and was extremely knowledgeable about all things wine, which was great because we felt comfortable asking a plethora of questions. We started out with a line-up of the three wines: 2018 Estate Rose (Eola-Amity Hills, Willamette Valley), 2017 Mt. Jefferson Cuvee Pinot (Noir Willamette Valley), and the 2016 Estate Syrah (Eola-Amity Hills/Willamette Valley). While we sipped on these wines, we played a bit of a smelling/guess that odor game which is used to help guests with identifying tasting notes. After enjoying those wines, we piled into the Cristom car for a drive around the vineyards. This was an incredibly unique experience as we've never been driven into and around the vineyards before. We visited several of their blocks and were able to sample pinot noir, viognier, and syrah grapes straight off the vine. It was also nice to look out from the top of the hill over the expansive Oregon countryside. We also stopped by a dirt pit and scrambled around that for bit, which allowed us to gain a better understanding of the soil types at Cristom. \n\nUpon returning to the tasting room, we enjoyed a charcuterie board along with our last four wines - all pinot noirs: 2017 AVA Series (Dundee Hills), 2017 AVA Series (McMinnville), 2017 AVA Series (Eola-Amity Hills), and the 2017 Eileen Vineyard (Eola-Amity Hills). We also got to sample a bit of the 2017 Jesse Vineyard Pinot Noir. All of the wines were delicious and well balanced - nothing was too earthy or too berry-flavored. They were all complex, velvety, and very interesting. Overall, our experience at Cristom was the best wine tasting tour and experience we have ever done so far and we would highly recommend it to anyone who is interested in learning more about wine.",
  "This was our very first winery during our trip to Oregon, and it was an amazing introduction to Oregon wines. My boyfriend and I were there on a Wednesday, so the winery was not very busy. Holly was a fantastic person to take us through our wine tasting, and she was so personable and friendly. She is very knowledgeable about wine, and e learned so much about Oregon wines and Cristom. She even gave us the perfect lunch suggestion that was on the way to our next winery (Blue Raeven Farmstand in Amity has amazing sandwiches and pies for a quick stop between wineries!). We enjoyed the wines at Cristom so much that we left with several bottles to enjoy back home. This winery was still our favorite even after visiting several others in the area, and my boyfriend who is very into craft beer now loves wine because of Cristom. We will definitely be back when we are in Oregon again!",
  "Excellent wines & an extremely thorough tasting experience. Holly walked our group of 10 through everything from the history of the vineyard, to details about their wines, to all sorts of other wine-related topics. It was easily the best/most educational tasting experience our group received in the Willamette Valley...and we went through a large number of tastings during our stay. Highly recommended!"
 ]
},{
 "name": "Honeywood Winery",
 "address": "1350 Hines St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/d6/60/25/honeywood-winery.jpg",
 "tags": [
  "tasting",
  "tasting",
  "hospitable",
  "tasting",
  "knowledgeable",
  "tasting",
  "tasting",
  "tasting",
  "drink",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d534239-Reviews-Honeywood_Winery-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love their wine. The wine tasting is fun and a great way to find  out which ones of the wine a person likes best. One of my favorite o e is the raspberry one, but most of them are great. Definitely  a nice treat.",
  "Once again travelling thru Oregon when I saw a sign for this winery....immedate detour....same person was my server....unable to do much tasting as was traveling with my granddaughter...love the boysenberry (same as at Knott's Berry Farm)...this time I got some of the Niagara, some huckleberry, early muscat...well two cases later I was out the door..you can order this wine online and they give great discounts when you buy by the case",
  "We were familiar with Honeywood wines when we lived in Oregon many years ago but had never visited their tasting room.  On a recent visit to Salem from Arizona we decided to go and are so glad we did!  It's a lovely gift shop/tasting room and our hostess Crystal was so much fun, hospitable and knowledgeable.  Admittedly, fruit dessert wines will not be everyone's cup of tea (glass of wine :) but they are very delightfully different.  There is a tasting list provided and one can choose any five to taste with absolutely no tasting fee--remarkable in this day and age.  The glass is carefully rinsed with a few drops of the new wine between tastes so that the flavors can stand as distinctive.  There is a small selection of more well-known varietals--my husband was quite intrigued by the Merlot.  But the standouts were definitely the fruit wines--my favorites were the elderberry (a bit of an herbal or medicinal character?), the raspberry, and the Peach Supreme.  Think of cocktail additions, mimosas, even ice cream topping?  I purchased the raspberry and my friend got the strawberry--neither sickeningly sweet nor artificial flavored in any way, just fruit and wine.  An experience that still makes me smile!",
  "Got into Salem before most wineries would be open.  Saw the signs to Honeywood, not knowing a thing about it.\nHoneywood has grape wines, but I didn't taste a single one that I liked.\nI do not like fruity wines (think peach, cherry, blueberry).  They have a lot  to choose from.  They also offer meads.  I just don't like sweet-sweet-sweety-sweet wines, so I didn't connect with those offerings either.\nThe server was very enthusiastic and informative.  I ended up buying a bottle of elderberry wine which I'll use over ice cream some day - just because the server was so nice.\nI know there are people out there who like fruity wines.  This place is for you.\n$5 gets you a tasting of 5 wines, plus any re-tastes you might was to check on.  I doubt I'll go back, but there were other people there buying cases of Honeywood wine.",
  "One word Blackberry Mead “AMAZING “. You won’t be sorry. So good I had to buy 2 bottles. This is by far the best blackberry I have ever had. Wine tasting was nice basically 1.00 per tasting starting with 5 tastings. Just that wine gets 5stars\n\nWhile I do really like the wines and they have so many to choose from the service was not great, the patrons were more helpful than our server Crystal. One of the regulars were there and she even asked her was she ok since she wasn’t being very friendly, her words were, “this is my work face, I’m in work mode” well while that could fly I guess, in the wine business being friendly and talking about the product seems to be the key, being a people person is important seeing as so many different people come wine tasting. Our group of 4 was from Texas and we were pretty excited to try so many sweet wines, we mapped it out to drive all the way here from Portland making it our first stop, on our way to Lincoln city, but she didn’t seem like she wanted us there. She was short and just not friendly. We asked questions and got few answers, again the patrons there were helping us out more. Finally, we just bought what we we’re going to buy and left. Very disappointing. \n\nThey have lots of items for sale, however I loved that they had wine sleeves in different neon colors super cool.\n\nBecause the Blackberry Mead was so good I would go back. ",
  "Fruity Wines! This is the stop for you as long as you like sweet wines. They may have had a few dry ones but mostly sweet. I left with two bottles, so be ready to make some purchases. The tastings are a $1 per taste & I think I sampled about 12-15 of them 🤷🏽‍♀️. Unfortunately the downside to this was Crystal, our server. She just had a very unpleasant demeanor, almost a frown on her face. One of the other customers commented about it, asking if she was having a bad day. Crystal said she wasn’t, “this is just my work face.” Wow!! Well your work face wasn’t conducive to the happy environment you work in. But anywho, me & my friends had a good time despite her. ",
  "My husband and I were in Oregon for a weekend and covered a lot of the area in that short of time! We saw a sign for this place and decided to stop by. We are not huge wine drinkers, so although this is a state known for their vineyards, we hadn’t planned a stop at one.  Well, I am glad we did! We didn’t have much time, so were happy it wasn’t a huge area to explore- a tasting room and lovely gift shop. We tried a few of them- because I do like a sweet wine now and then. We took home a bottle of the Huckleberry, and also the Marionberry. We liked the Marionberry so much that I ordered a case that was delivered to my home in Wisconsin a month later! I wouldn’t have been able to haul that on the plane, so I do like the option of them shipping! I have included a copy of the brochure that was included in my box. This might take us a year to drink, but I’m guessing after that, we will order again!",
  "I love their wine. The wine tasting is fun and a great way to find  out which ones of the wine a person likes best. One of my favorite o e is the raspberry one, but most of them are great. Definitely  a nice treat."
 ]
},{
 "name": "Hallie Ford Museum of Art",
 "address": "700 State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/fb/ae/0f/photo4jpg.jpg",
 "tags": [
  "art",
  "art",
  "walk",
  "tour",
  "art",
  "walk",
  "art",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284549-Reviews-Hallie_Ford_Museum_of_Art-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "There was a special exhibit when we toured and it was fascinating. The permanent exhibits also are fine and well worth your time. ",
  "Really enjoyed visiting this little museum( felt a lot like a gallery)\nPermanent exhibits of ancient artifacts, coins,icons, eastern and western were a happy surprise. Downstairs modern Oregon artist works on display. Very nice, small but wonderfully curated, gift shop. Enjoyed my,stumbled upon it , visit!",
  "I can't believe this museum isn't better known.  As someone who grew up in Salem and now lives in New York, I actually try to stop here every time I'm in town because it's galleries are a pleasure to visit and everything is thoughtfully curated.  If you're even a little interested in art and happen to be in Salem, definitely put this at the top of your list.  The permanent collection is terrific, the Native American gallery is fascinating, and there's always something new on display.  The best part is that the whole place can be visited in an hour and a half, letting you see a little bit of a lot of things (from Roman coins to Jacob Lawrence to contemporary Northwest art) but never overwhelming you.",
  "This is a lovely little museum which is a delight to walk through.  If you are looking for old world masters be warned that this is not the National Gallery in Washington DC... the do have a small gallery of masters but no extensive display of impressionists, or renaissance masters.  Rather this is a well presented collection of different art which becomes a satisfying journey away from the current \"Trumpian\" disgust.  There is something for everyone.  Even though my wife and I have visited many European national galleries we still find this museum to be very satisfying, and visit two or three times a year.  Well worth the visit.  Watch for special exhibits to tailor your trip to your own tastes.",
  "From the exterior this looks like a small little museum that would take only a few minutes to tour.  Wrong!  It is quite large.  The lobby is an open and airy welcoming.  The artifacts are varied and interesting.  Instead of a few minutes of your time plan on a few hours to be amazed at all there is to see.",
  "With a rainy day in Salem there are only a few things to stay busy with. We decided to come check out the work at Hallie Ford. It was surprisingly good, although a tad expensive for such a small offering.\n\nMy favorite pieces were from local artists. And to see the Native American exhibit was also refreshing.",
  "There was a special exhibit when we toured and it was fascinating. The permanent exhibits also are fine and well worth your time. ",
  "This is a lovely little museum which is a delight to walk through.  If you are looking for old world masters be warned that this is not the National Gallery in Washington DC... the do have a small gallery of masters but no extensive display of impressionists, or renaissance masters.  Rather this is a well presented collection of different art which becomes a satisfying journey away from the current \"Trumpian\" disgust.  There is something for everyone.  Even though my wife and I have visited many European national galleries we still find this museum to be very satisfying, and visit two or three times a year.  Well worth the visit.  Watch for special exhibits to tailor your trip to your own tastes.",
  "Really well presented . Friendly helpful staff. The exhibitions are beautifully curated and presented.",
  "I had the good fortune to find another reason to make another trip to the museum has 2 floors and has an elevator if the stairs won't do.  As always we were warmly created and I brought a first timer. She had never been.  She is a bit of an artist herself. The slot machine art of the first floor made me laugh. Since art should make you feel something a laugh was great.  They art is changed from time to time so I like to go 4 or 5 times a year. The native center seems unchanged but I also seem to see new things each time a go.   I love the place. If you like ever changing art this place is for you, your friends and family.",
  "I have been visiting the museum since it opened.  Their shows and exhibits are always interesting.  One of Salem, Oregon's bright spots!"
 ]
},{
 "name": "Bush House Museum",
 "address": "600 Mission St SE Bush's Pasture Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/44/2d/5d/bush-house-museum.jpg",
 "tags": [
  "art",
  "learn",
  "art",
  "history",
  "tour",
  "art",
  "tour",
  "knowledgeable",
  "tour",
  "walk",
  "family",
  "history",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284684-Reviews-Bush_House_Museum-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful park and interesting are gallery.  We spent an hour in the gallery and appreciated the different art works by local artists. Well worth a visit.",
  "If you love historical buildings and gardens and want to learn some pretty interesting information about Salem, this is definitely a place you want to visit.  We went right before Xmas so the place was hopping.  Even in mid-winter, the gardens were lovely and it was so much fun seeing the beautiful old house in all its glory.  We marveled at how small the rooms were and ate up the information about who built it and why the setting was selected, who was the person behind the garden designs, etc. ",
  "I love old houses, and history.  And The Bush house is a beautiful house!  It is an 1878 Victoria two story house, built by Asahel Bush, who was editor of the Oregon Statesman newspaper 1851.The house was turned over to the City of Salem following the death of the last heir.  Reported in Paranormal circles, the Bush house is suppose to be haunted, but our tour guide flat rejected that notion. The grounds are beautiful, and the Bush Art Barn where local artists display their art works is behind the house.   Go visit.",
  "Beautiful park and interesting are gallery.  We spent an hour in the gallery and appreciated the different art works by local artists. Well worth a visit.",
  "We had a very nice historical tour of the house with a friendly and  knowledgeable guide. I would have liked to have been able to see the servants quarters and have had a bit more time to explore the house. But overall it was definitely worth the visit and not very expensive at all. The grounds are gorgeous.",
  "Having always wanted to see the museums of Salem, we put this on our list.  We got a private 1-hour tour with a docent of this 1870s house, complete with anecdotes about the onetime wealthy occupants. Loved looking at the furniture, china, wallpaper, etc., of the period.   You can actually walk through the rooms (this is not true at the Pittock Mansion in Portland, where the rooms are roped off).  \nWe got in with cumulative discounts for a) seniors over 62, b) AAA members, and c) veteran.",
  "We recently visited Bush House for the first time. It was a delight to see so many of the family possessions being maintained in the old house. There were plenty of photos as well. Our guide did a thorough job of explaining the history and answering our questions. It was an excellent hour spent learning a little about Salem's history.\nOutside the tulips were in bloom.\nThe house is on two floors and does require going up and down steep stairs.",
  "If you love historical buildings and gardens and want to learn some pretty interesting information about Salem, this is definitely a place you want to visit.  We went right before Xmas so the place was hopping.  Even in mid-winter, the gardens were lovely and it was so much fun seeing the beautiful old house in all its glory.  We marveled at how small the rooms were and ate up the information about who built it and why the setting was selected, who was the person behind the garden designs, etc. "
 ]
},{
 "name": "Bryn Mawr Vineyards",
 "address": "5935 Bethel Heights Rd NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/66/44/bc/view-from-the-tasting.jpg",
 "tags": [
  "winery",
  "tasting",
  "delicious",
  "knowledgeable",
  "history",
  "tasting",
  "winery",
  "family",
  "tasting",
  "delicious",
  "unique",
  "history",
  "tasting",
  "knowledgeable",
  "winery",
  "tasting",
  "delicious",
  "knowledgeable",
  "history",
  "tasting",
  "free",
  "tasting",
  "winery",
  "family",
  "tasting",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d3475903-Reviews-Bryn_Mawr_Vineyards-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very innovative winery with great Pinot - but also Pet Nat, Pinot Blanc, Dolcetto, Tempranillo - just a fantastic selection and they are all delicious!  The best views of the valley, a beautiful and comfortable tasting room with complimentary cheeses/crackers to pair with the wines.  Staff is fantastic and knowledgeable, love Jill and David there, so welcoming and genuine.  Fancy wine and tasting room but not bougie - really down to earth comfortable space.",
  "Spent a couple of hours here at the recommendation of another vineyard in the area & we were so glad that we did! Despite the size of our group (5 couples) & lack of reservation, Jon and his staff were more than accommodating and very friendly. We were greeted with bubbles when we came in & learned a little about the vineyard. Due to our lack of reservation, we chose to order a number of bottles vs do an official tasting. I'm sure they would have likely accommodated us but we didn't feel good about just showing up with that size a group without reservations for a formal tasting when the tasting room was pretty busy. \n\nAnyhow, we went through multiple bottles (Rosé, Estate & Reserve Pinots, Tempranillo, etc) & the across the board quality/consistency of the wines was notable. Jon (the owner) ended up joining us at our table for at least an hour and ran us through the history of the vineyard, talked about the wines & all sorts of other topics. Our entire group thoroughly enjoyed the visit with Jon (and the education he provided!).\n\nI think its also worth noting that the new tasting room (just opened) is beautiful, and the views....WOW! The views are hands down, the best in the valley. I could sit on that patio and take in the scenery for days.\n\nWhen it was all said and done, every single couple in our group ended up joining the Bryn Mawr wine club. Across the board best vineyard experience of the trip. Thanks Jon & staff!",
  "We came upon this winery a few years back, based on the recommendations of tasting room staff at Furioso. It was worth the drive south and the wines were delicious. We made it a point to go back on our next visit, and fell in love with their wines again. Signed up for their wine club and we've been enjoying the shipments from Denver. Can't wait to get back and experience the new tasting room. Love the family feel and warm welcome.",
  "Bryn MaBryn Mawr exceeded expectations both in the quality of wines, variety of grapes and hospitality of the team. We went on a Tuesday in the winter and were met by a roaring fireplace and knowledgeable staff who walked us through an overview of the Willamette Valley, the winter tasting menu and shared some history of the vineyard. The wines were nuanced and balanced with some unique varietals for the region.wr exceeded expectations both in the quality of wines, variety of grapes and hospitality of the team. We went on a Tuesday in the winter and were met by a roaring fireplace and knowledgeable staff who walked us through an overview of the Willamette Valley, the winter tasting menu and shared some history of the vineyard. The wines were nuanced and balanced with some unique varietals for the region.",
  "Very innovative winery with great Pinot - but also Pet Nat, Pinot Blanc, Dolcetto, Tempranillo - just a fantastic selection and they are all delicious!  The best views of the valley, a beautiful and comfortable tasting room with complimentary cheeses/crackers to pair with the wines.  Staff is fantastic and knowledgeable, love Jill and David there, so welcoming and genuine.  Fancy wine and tasting room but not bougie - really down to earth comfortable space.",
  "Spent a couple of hours here at the recommendation of another vineyard in the area & we were so glad that we did! Despite the size of our group (5 couples) & lack of reservation, Jon and his staff were more than accommodating and very friendly. We were greeted with bubbles when we came in & learned a little about the vineyard. Due to our lack of reservation, we chose to order a number of bottles vs do an official tasting. I'm sure they would have likely accommodated us but we didn't feel good about just showing up with that size a group without reservations for a formal tasting when the tasting room was pretty busy. \n\nAnyhow, we went through multiple bottles (Rosé, Estate & Reserve Pinots, Tempranillo, etc) & the across the board quality/consistency of the wines was notable. Jon (the owner) ended up joining us at our table for at least an hour and ran us through the history of the vineyard, talked about the wines & all sorts of other topics. Our entire group thoroughly enjoyed the visit with Jon (and the education he provided!).\n\nI think its also worth noting that the new tasting room (just opened) is beautiful, and the views....WOW! The views are hands down, the best in the valley. I could sit on that patio and take in the scenery for days.\n\nWhen it was all said and done, every single couple in our group ended up joining the Bryn Mawr wine club. Across the board best vineyard experience of the trip. Thanks Jon & staff!",
  "The view is beautiful from a lovely tasting room. I was so looking forward to the wine tasting as soon as we walked into the tasting room. We were greeted with a taste of bubbly before we even chose the wines we wanted to taste. This made me even more excited about this place. \nFor the wine tasting we were asked to sit at a table and they would bring the wines to us. This is when the experience faltered. We waited and waited while none of the staff seem to even look our way. I finally went back to the tasting bar to ask for my second tasting which I received but was reminded they would bring them to the table. After this the wines did show up in a timely fashion. However, the server was not overly friendly and ended up spilling wine from the spit bucket on my leg. They also offer free cheese which we did not receive until our last tasting. \nThis is most unfortunate because their wines are very good. But considering the $20 tasting fee and the level of service received I would not recommend this winery's tasting room especially when there are so many great wineries in this area.",
  "We came upon this winery a few years back, based on the recommendations of tasting room staff at Furioso. It was worth the drive south and the wines were delicious. We made it a point to go back on our next visit, and fell in love with their wines again. Signed up for their wine club and we've been enjoying the shipments from Denver. Can't wait to get back and experience the new tasting room. Love the family feel and warm welcome."
 ]
},{
 "name": "Salem Ale Works",
 "address": "2315 25th St SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/53/d1/c5/welcome-to-salem-ale.jpg",
 "tags": [
  "delicious",
  "food",
  "delicious",
  "food",
  "delicious",
  "food",
  "delicious",
  "food",
  "kids",
  "food",
  "drink",
  "delicious",
  "food",
  "delicious",
  "unique",
  "food",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d7289681-Reviews-Salem_Ale_Works-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "We have been back since the previous post. Delicious beers,  Partly Hazy IPA, Jefferson Pale Ale, Son of a Son of a Sawyer IPA and One Foot in the Black Dark Mild (Black Session IPA). They have expanded their kitchen menu and we had the Steak sandwich with fries. Yum!  Still, you need to go there! ",
  "Great beers, food, and customer service! Plenty of seating, but this is a popular place, even on weeknights. So, plan accordingly. Parking also can be a challenge, so bring your patience. $7 special on Tuesdays for flights of 5 was a great deal. We had the Big Bleu sandwich, Chicken sandwich, Apple Bacon sandwich, fries, and chicharrones. All were delicious. Definitely will return to try other items on the menu.",
  "Googled a craft brew place with good eats and local beer as we drove from Portland to Eugene.  We were extremely pleased with our find!  Nice gal behind the bar who shared good info about the beers offered and brewed at SAW, plus the sandwiches were excellent.  Enjoyed chatting at the bar with a couple of guys who live in Salem and told us all about SAW.  Definitely could have spent some more time, but needed to hit the road.",
  "Great beers, food, and customer service! Plenty of seating, but this is a popular place, even on weeknights. So, plan accordingly. Parking also can be a challenge, so bring your patience. $7 special on Tuesdays for flights of 5 was a great deal. We had the Big Bleu sandwich, Chicken sandwich, Apple Bacon sandwich, fries, and chicharrones. All were delicious. Definitely will return to try other items on the menu.",
  "Great beers, food, and customer service! Plenty of seating, but this is a popular place, even on weeknights. So, plan accordingly. Parking also can be a challenge, so bring your patience. $7 special on Tuesdays for flights of 5 was a great deal. We had the Big Bleu sandwich, Chicken sandwich, Apple Bacon sandwich, fries, and chicharrones. All were delicious. Definitely will return to try other items on the menu.",
  "This is a popular Salem establishment. We went with friends on the weekend. There was a good mix of families with kids and younger couples and singles. The beer selection goes beyond your usual IPA, Pilsner, Wheat, etc. So if you’re looking for a rotating variety of interesting and unusual options, this is the place for you. \nLet’s say you’re not into beer...or have a friend...\nThey have a food truck outside the business with reasonable food and amazing Rice Krispie treats. \nThey have Snapple tea, and a “Victorian” fermented lemonade that I can’t really recommend though if you like fermented, please enjoy! So do NOT purchase this lemonade for your picky kiddo! It’s non-alcoholic, but they will think it’s super weird! ",
  "Was on our way to Bellingham to visit a friend.  Stopped in Salem for the night after a 9 hour drive and consulted TripAdvisor for a brewpub with food.  SAW seemed to fit the bill.    Walked in around dinner time on a Thursday night.  Only about four tables and the place is pretty small.  Three employees standing at the bar and not one looked up or said anything when we walked in.  Stood there trying to figure out whether we sat ourselves or...still they were all looking at cellphones.  We finally walked up to the bar and asked about a drink and were curtly told to find a table and come back to order when we were ready.  Had to find our own menus and beer menu.  Wanted to leave right then but stayed for a beer.  Beer was actually very good but atmosphere and rude staff didn’t bode well for food so we left.  Found a great place in downtown Salem selling SAW beer cheaper than the Ale Works was but with good food and great employees.  Sad to see such a poorly run brewpub.  It isn’t hard to say hello and welcome customers - especially on a slow night!  Good beer doesn’t overcome terrible service.",
  "My buddy and I checked out Salem Ale Works (SAW) in early August while we were on our trip through Oregon.  The place is clean and well run.  Not a lot of seating (i recommend taking a table outside if the weather allows.  On Tuesday nights they run a great Burger and Beer special ($10--great deal!).  The burger was perfectly cooked, tasty and HUGE.  The beers are solid too.",
  "We have been back since the previous post. Delicious beers,  Partly Hazy IPA, Jefferson Pale Ale, Son of a Son of a Sawyer IPA and One Foot in the Black Dark Mild (Black Session IPA). They have expanded their kitchen menu and we had the Steak sandwich with fries. Yum!  Still, you need to go there! ",
  "Great beers, food, and customer service! Plenty of seating, but this is a popular place, even on weeknights. So, plan accordingly. Parking also can be a challenge, so bring your patience. $7 special on Tuesdays for flights of 5 was a great deal. We had the Big Bleu sandwich, Chicken sandwich, Apple Bacon sandwich, fries, and chicharrones. All were delicious. Definitely will return to try other items on the menu.",
  "On a recent trip to Oregon we made sure our travels took us through Salem and a stop at the Salem Ale Works.  We were not disappointed!  Great bar staff, fun people at the bar with us and delicious food - burgers are plentiful and yummy.  Both visits to this establishment have netted great conversation with fellow patrons and employees.  Wish we were going to be there on 2.16.19 for the Beer and Chocolate event.  They advertised some unique upcoming events which would be fun to attend.  We'll be back next time we are in the area!"
 ]
},{
 "name": "Coria Estates",
 "address": "8252 Redstone Ave SE",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/cb/d5/4f/the-vineyard.jpg",
 "tags": [
  "music",
  "tasting",
  "winery",
  "tasting",
  "tasting",
  "delicious",
  "music",
  "tasting",
  "food",
  "tasting",
  "free",
  "winery",
  "family",
  "food",
  "free",
  "winery",
  "family",
  "food",
  "music",
  "tasting",
  "music",
  "delicious",
  "winery",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d7697759-Reviews-Coria_Estates-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went recently and had a marvelous experience. We did the wine tasting with cheese and crackers. It was very peaceful with only a few people there. We enjoyed the outside sunshine at 800 feet with views of grapes in all directions. Because it was a quiet time, the lovely young woman at the counter brought each of the tastings to us outside and explained what we each wine was like. She also answered our questions and we learned it is much busier on weekends with music entertainment and the grapes had not yet been picked. A very peaceful afternoon. What a different experience from the nearby Willamette Valley Vineyards location which is crowded and not peaceful. We purchased 3 bottles of wine (tasting fee deducted) on the way out that we had enjoyed.\nOne warning. The Google Maps application provides the wrong directions and you go to a private home. However, there are signs to alert you of the problem and provide the correct directions.",
  "This was in a true vineyard!  Beautiful views on a hill!  Wine tasting very intimate for our group of 6!  Loved all of the wines and the server was awesome!  Definitely recommend this winery!",
  "We were visiting friends in Salem who are also oenophiles. They took us to this small vineyard in a lovely setting. There was only one employee and she was very busy but did a stellar job. We sat in a small area outside the tasting room and the server brought our wines out to us. The two pinot Gris were simply outstanding. The 2015 was dry and crisp with fresh pineapple, melon and pear notes. The 2014 had more fruit and I would guess there was some residual sugar but it was not sweet.  Enjoyable and refreshing wines and a good value at $24. The 2015 rose of pinot noir  was very good and a favorite for two of us. Strawberry and cherry notes followed by a crisp but not biting finish with overtones of red fruit. Delicious and not a sweet wine! The 2013 Estate Pinot is a light pinot but the fruit shines through. Notes of cherry up front and much more body then one would expect from its lighter color. Nice long finish. A great deal at $25 unless you are a pinot snob. The 2013 La Aurora is a much more elegant wine, well balanced and nicely structured. There is a floral nose with dark cherry in the mid palate. It finishes with a nice touch of oak and acid. One of the best pinots we tasted that weekend including $50 -$100 pinots we tried elsewhere. There is some potential for aging but I would enjoy it now or in a year or two. A great value at $35. We also had two nice cheese plates with local Havarti and Gouda and locally made crackers.Wine by the glass is available. One of my top 5 vineyard/winery visits this past year.",
  "We went recently and had a marvelous experience. We did the wine tasting with cheese and crackers. It was very peaceful with only a few people there. We enjoyed the outside sunshine at 800 feet with views of grapes in all directions. Because it was a quiet time, the lovely young woman at the counter brought each of the tastings to us outside and explained what we each wine was like. She also answered our questions and we learned it is much busier on weekends with music entertainment and the grapes had not yet been picked. A very peaceful afternoon. What a different experience from the nearby Willamette Valley Vineyards location which is crowded and not peaceful. We purchased 3 bottles of wine (tasting fee deducted) on the way out that we had enjoyed.\nOne warning. The Google Maps application provides the wrong directions and you go to a private home. However, there are signs to alert you of the problem and provide the correct directions.",
  "The 360 Views of the valley are amazing, well worth the ride on the narrow, gravel road to the top of the hill!  y husband and I took a small lunch and sat on their large patio enjoying the views and the wine to wash down our food on a warm sunny day! The tasting room is friendly, sells by the glass, and also has small eats. The wine is quite tasty as well!  We enjoyed the Rose. This would be a great place to see a sunset or have an event.  We will definitely visit Coria again on our next visit to Salem.",
  "Coria Estates is a gem in the rough... a small, family-owned and operated...rather new winery.  Wine that is on par with the best wines I've tried in Napa Valley, Italy, Oregon, Washington, et cetera... for a fraction of the price.  The story is compelling.  Family sells grapes.  Daughter goes to school, learns to make wine... now selling wine... Not any wine... amongst the very best Pinot Noir in Oregon... the best in my opinion and Oregon does Pinot Noir like no where else!  Their Chardonnay is incredible too, especially this year... with vanilla notes...and I don't even like Chardonnay.  :^)  It is really that good!  Great view, great food (cheeses, crackers, gluten free available, jams, etc.) friendly staff, great service, outstanding wine... I can't find a box to check negative... Even the bathrooms are squeaky-clean and well-maintained.  Overall, a charming experience that is the very definition of what visiting an Oregon winery should be.  Personally, I hate to write such a positive review as word of mouth will spread and this place will soon be not the quaint little gem it is today... so try to keep this review to yourself  :^)",
  "Coria Estates is a gem in the rough... a small, family-owned and operated...rather new winery.  Wine that is on par with the best wines I've tried in Napa Valley, Italy, Oregon, Washington, et cetera... for a fraction of the price.  The story is compelling.  Family sells grapes.  Daughter goes to school, learns to make wine... now selling wine... Not any wine... amongst the very best Pinot Noir in Oregon... the best in my opinion and Oregon does Pinot Noir like no where else!  Their Chardonnay is incredible too, especially this year... with vanilla notes...and I don't even like Chardonnay.  :^)  It is really that good!  Great view, great food (cheeses, crackers, gluten free available, jams, etc.) friendly staff, great service, outstanding wine... I can't find a box to check negative... Even the bathrooms are squeaky-clean and well-maintained.  Overall, a charming experience that is the very definition of what visiting an Oregon winery should be.  Personally, I hate to write such a positive review as word of mouth will spread and this place will soon be not the quaint little gem it is today... so try to keep this review to yourself  :^)",
  "We went recently and had a marvelous experience. We did the wine tasting with cheese and crackers. It was very peaceful with only a few people there. We enjoyed the outside sunshine at 800 feet with views of grapes in all directions. Because it was a quiet time, the lovely young woman at the counter brought each of the tastings to us outside and explained what we each wine was like. She also answered our questions and we learned it is much busier on weekends with music entertainment and the grapes had not yet been picked. A very peaceful afternoon. What a different experience from the nearby Willamette Valley Vineyards location which is crowded and not peaceful. We purchased 3 bottles of wine (tasting fee deducted) on the way out that we had enjoyed.\nOne warning. The Google Maps application provides the wrong directions and you go to a private home. However, there are signs to alert you of the problem and provide the correct directions.",
  "Will go again & again. Gorgeous view, delicious wines, tasty pairings, music. A must stop for a Willamette Valley vineyard.",
  "Liked every wine we tasted, LOVED the \"115\" and the Reserve. Will be back, especially in the warmer weather to enjoy the patio and the view. Our server Jason was great. We left with the flyer about the wine club. This might be the one for us.",
  "We discovered this beautiful little winery in May and have been back several times since.  We enjoyed it so much we decided to become members!  The wine is delicious, the views are spectacular, and everyone has been so kind and welcoming!  The picnic tables are the perfect spot to bring your own picnic (though they also have a delicious cheese plate). There’s room for young ones to run and play. Even our four-legged friend was welcome to join.  Such a great find!"
 ]
},{
 "name": "Bethel Heights Vineyard",
 "address": "6060 Bethel Heights Rd NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/bf/55/62/photo3jpg.jpg",
 "tags": [
  "tasting",
  "knowledgeable",
  "tasting",
  "tasting",
  "tasting",
  "winery",
  "family",
  "tasting",
  "walk",
  "approachable",
  "eat",
  "tasting",
  "tasting",
  "knowledgeable",
  "knowledgeable",
  "winery",
  "tasting",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d534180-Reviews-Bethel_Heights_Vineyard-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is by far one of my favorite vineyards in Oregon. They produce first class wines and the views from the tasting room are amazing. The staff is super knowledgeable and always very friendly.",
  "Beautiful setting in the Eola-amity Ava. Enjoyed a very nice flight of Pinot. Beautiful authentic Pinot is produced here. ",
  "Spent a wonderful hour chatting and tasting some fantastic wines from Willamette Valley. We learned a lot about the region and the nuances of wines in the valley. ",
  "We love Bethel Heights and belong to their wine club! They make wonderful wines, have a fantastic staff (Kate is the best), and are located in a beautiful setting with great views. If you are in Oregon wine country and want a great one-of-a-kind experience tasting very good wines, then Bethel Heights is A MUST!",
  "The sign is rather nondescript, but take the trip up the hill!  I was there on a raw, rainy day and it was absolutely gorgeous.  Tried a flight plus some offerings that were not on the tasting menu, all were excellent. \nI wish they served lunch, because the setting is perfect...the hostess did direct me to left coast vineyards for lunch.  This was a very nice suggestion and much appreciated.",
  "While visiting in Salem, my brother took us to his favorite vineyard. We weren't sure what to expect because our favorite vineyards in the Napa Valley are pretty special. This vineyard is located about 10 miles north west of the center of Salem. Make sure your GPS is working or you have a good map. You are driving through beautiful countryside so it is easy to lose your focus and miss a turn or two. The vineyard is located a top a small hill at the end of a nondescript dirt road. The winery is pretty plain when you park and walk towards the entrance. But in a few more steps you enter your destination and are surrounded by magic.\nThe tasting room is open and modern, surrounded by glass. The view through the floor to ceiling windows is beautiful beyond description. The winery found the best location in the valley. There is no place better where you can sample their wonderful offerings.\nWe purchased a bottle of wine for the group and went out on the patio. After a moment of re-arranging of furniture, we were all seated and enjoying a very young, but very well behaved 2015 Pinot Gris. Coupled with the shade and the beautiful view of the valley below, we had arrived in heaven.\nThe staff are very friendly, easy going, proud of their wines and not at all overbearing. They can talk wine with anybody, even dumbing all down for me! It doesn't matter what you think or know about wines, they make you feel like family who just arrived. They make you feel welcome, as if you just returned home.\nBefore leaving we each bought a selection of wines to be enjoyed on our travels around Oregon. There were many beautiful places we sat and enjoyed our Bethel Heights selections. But no matter where we were, the wines always reminded us of the special hillside where we know we will always be welcomed home like we are family.",
  "The great thing about the Willamette Valley wineries is the tasting experiences they offer through reservations and a fee (which varies and can be substantial, though worth it).  Bethel Heights offers the best of the best in their “Beyond The Blocks” tasting.   The setting (private room with a view of the vineyards), education (Kate was so approachable, helpful and knowledgable) and wine (their best of the best) made this the top wine tasting experience we’ve had (and we had a few of these).  This comes at a price (as previously mentioned), but is worth every penny.  Did we mention there’s enough to eat so that it’s a meal?\nP.S.  If you don’t want to spend the money on the reserved tasting, then just come to the tasting room and soak in the venue, view and wine!",
  "This is by far one of my favorite vineyards in Oregon. They produce first class wines and the views from the tasting room are amazing. The staff is super knowledgeable and always very friendly.",
  "Beautiful setting in the Eola-amity Ava. Enjoyed a very nice flight of Pinot. Beautiful authentic Pinot is produced here. ",
  "With outdoor seating.  Knowledgeable staff, wine interesting but not to my palate.   There seemed to be a Lot of regulars there so maybe it’s just me....",
  "We try to visit Bethel Heights each time we travel to Willamette.  This winery not only has outstanding wines, but has an inviting L-shaped deck off the tasting room with some gorgeous views of the valley. The tasting room has large windows and glass doors to the deck, so that the views can be seen from inside. Their Pinot Noirs are some of my favorites from Willamette, but this time’s visit was on a warm, sunny day, so we ordered a bottle of the Pinot Gris to enjoy on the deck. It was delicious, along with the fabulous landscape, with the Cascades off in the distance beyond the scenic vineyards. When visiting Salem or touring around Willamette Valley, this winery is a must to visit!"
 ]
},{
 "name": "Salem Saturday Market",
 "address": "Green Lot, Downtown Salem Marion and Summer Streets N.E.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/9f/bc/7a/salem-saturday-market.jpg",
 "tags": [
  "food",
  "walk",
  "eat",
  "food",
  "eat",
  "food",
  "organized",
  "unique",
  "food",
  "music",
  "food",
  "delicious",
  "pets",
  "music",
  "eat",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d284678-Reviews-Salem_Saturday_Market-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a great Saturday market! Food, flowers, crafts.  You name it!  Get there early for parking, or be prepared to walk a block.  Huge bouquets of flowers for only $10.00 I wish I lived closer, that would become a good bad habit. bought myself a handy purse, another booth some crystal earrings, another booth a hummingbird feeder.  really enjoyed watching the people and the space",
  "The market runs from April - October and while the first few weeks have fewer vendors, by May and June it is jam packed. There are vendors with everything you might want, from gluten-free baked goods, to fresh fruit and veg, eggs (organic, pastured or conventional), pork, lamb, the list goes on. You can find a gorgeous bouquet for yourself or a hostess gift, berries in season, and a food court with even more yummy food for everyone to eat. Convenient and large sized portapotties along with hand washing stations, tables to sit and chat, and locally roasted coffee make this a local hangout and tourist draw.",
  "The market runs from April - October and while the first few weeks have fewer vendors, by May and June it is jam packed. There are vendors with everything you might want, from gluten-free baked goods, to fresh fruit and veg, eggs (organic, pastured or conventional), pork, lamb, the list goes on. You can find a gorgeous bouquet for yourself or a hostess gift, berries in season, and a food court with even more yummy food for everyone to eat. Convenient and large sized portapotties along with hand washing stations, tables to sit and chat, and locally roasted coffee make this a local hangout and tourist draw.",
  "A fun lively atmosphere with organized aisles of foods in one area then rest scattered around. Fruits and vegetables this time of year are outstanding. Fun and unique artists with their wears. We enjoy all the choices of food. ",
  "This is a nice sized market that offers a really good variety of food, flowers, fresh fruits and vegetables, delicious breads, jewelry and artisan crafts.   \n\nThe market is kid and dog friendly, they have live music and plenty of parking.   ",
  "vary nice place to get veggies,cheeses of different kinds from around the valley and Oregon. There is also live music and bakery items and bread, as well as flowers to buy. pets are allowed but on leash and Please clean up after them. They sometimes also have popcorn as well to buy.  You can also eat lunch there as well as there are many food booths to choose from.   ",
  "A great place to stock up on freash ingredients. And also to try out some new and tasty food. A video variety of things to choose from.",
  "Very nice outdoor market, nice fresh fruits and veggies, local honey, assortment of teas, look forward to this market opening up again this next year "
 ]
},{
 "name": "Willamette Mission State Park",
 "address": "Wheatland Rd.",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0a/37/48/lovely.jpg",
 "tags": [
  "structure",
  "history",
  "learn",
  "walk",
  "walking",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d294421-Reviews-Willamette_Mission_State_Park-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "if you are like me and need to recharge outside away from the city,  this is a hidden gem.   you can go from downtown to peace and quiet in a matter of minutes,  its worth visiting in every season it changes so much. spring for obvious greenery,  summer, it is way cooler the town and lots of wildlife,  fall the colors are breathtaking, and winter it is almost deserted,  you can find you own piece of heaven ( under an umbrella if needed )",
  "Huge disappointment.  But still a pretty disappointment.\nHaving recently moved to the area, I went hoping to learn some history of the area.  I knew the Willamette Mission was established by Methodist missionaries in 1842, and wanted to see the mission.  Spoiler alert: there's no mission.  Apparently it was destroyed a long time ago or something.  There's not even a museum or visitor center here, but if you drive waaaaayyyy out to the back of the park and then find the hidden trail and walk for 5-10 minutes, you can see the \"ghost structure\" of the mission - which is like a ton of rebar or something forming the outline of a building.  Mind you, I didn't find this out until I came in the summertime.  The first time I came out here, most of the park was closed on account of flooding. FLOODING.  I mean seriously.  Doesn't it rain all the time in Oregon?  How do they not know how to deal with flooding?!\nHaving said that, they should change the name to like North Marion County Regional Park or something.  It actually is pretty in nice weather, and it's a nice quiet spot to have a picnic among wildflowers and walnut orchards.  Just don't expect much from this place.\nOh yeah.  And don't be fooled.  The brochure says there's a lake there.  There's no lake.  It's more like a swamp.  With a boat launch.  Gross.",
  "We enjoy the Willamette Mission State Park as it’s not far from our home. Nice walking trails. I enjoy the ghost structures of the former mission buildings. There isn’t otherwise as much to do here as at other state parks. ",
  "The Willamette River flows alongside this park. Lots of bike trails. The cottonwood trees are especially nice here as are the lupine when it blooms. You can play in the river on hot days.",
  "Check the website before you go, especially in winter. If the Willamette River is high, it floods the main road and the park is closed.  But there are other reasons the equestrian trails can be closed so check the website.  Also as an equestrian, you probably don't want to use the park during the Civil War re-enactment weekend.  Again, check the website.\nHaving said all that, it's a nice place to ride.  The parking area is huge, with plenty of room for everyone to park and  get in and out.  Watch for bees in summer at the porta-pottie.  Trails here are flat.  The get muddy in winter and dusty in summer, but they are easy.  There are several loops which you can string together for a 2+ hour ride, or you can make the ride shorter.  For all loops, some trails are out in the open and some are in the trees.  There are good map signs along the way indicating where you are in the park and on the trail system.  This is a good place to take young or inexperienced horses and/or riders.  \nThere is actually horse camping here.  It is ONLY for people with horses; there is no \"regular\" people camping at this park.  There are 4 sites, with 2 to 4 corrals at each site.  It's a lovely place to camp with your horse.  There is a park host camped on the grounds during summer, so you are not totally alone there, though they do lock the gate at night.  There is also a hiker/biker camp so there may be others camping in the park when you are there.  \nI feel it is a safe park.  I go there year-around, by myself and with 1 or 2 friends."
 ]
},{
 "name": "Salem Railroad Station",
 "address": "500 13th St SE",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/6d/6e/93/salem-railroad-station.jpg",
 "tags": [
  "hike",
  "food",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d13166350-Reviews-Salem_Railroad_Station-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Although this train station is small, it has been restored beautifully. It is a handsome building and a great intro to Salem.",
  "It's always fun riding the train and Salem's station is very nice, clean, bright, eclectic with historical artwork and the old world charm feeling. The Amtrak staff is always helpful, too. ",
  "This station is utilitarian. A good shelter from rain.....unless your boarding area is a hike down the tracks. Nothing special to recommend it.  It serves its purpose.",
  "Really impressed with the station and staff. Friendly and helpful. The train was delayed but kept informed. As a Brit, I was thrilled with the train itself, didn't have to haul heavy luggage as it was dealt with. Coach was comfortable and quiet, and announcements about buffet (food and drink), helpful and informative.  I could have quite happily stayed on the train!",
  "old remodeled train station with lots of the old station feeling.\nclean well kept with great service."
 ]
},{
 "name": "Cubanisimo Vineyards",
 "address": "1754 Best Rd NW",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/1c/bd/70/filename-img-4095-jpg.jpg",
 "tags": [
  "family",
  "tasting",
  "delicious",
  "knowledgeable",
  "tasting",
  "winery",
  "family",
  "tasting",
  "music",
  "history",
  "drink",
  "delicious",
  "winery",
  "food",
  "history",
  "history",
  "tasting",
  "tasting",
  "music",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d2268187-Reviews-Cubanisimo_Vineyards-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Celebrating the total eclipse in Salem on August 21 was a memorable experience--truly. And Cubanisimo Vineyards gave us not only a beautiful backdrop for such an event, but also delicious wines and a festive party complete with yummy Cuban tapas and a fun Salsa band. We had a great time! The owner visited with all the guests, and made everyone feel like family. The friendly and knowledgeable staff made wine tasting fun. We especially liked the Rosando de Pinot Noir and the Pinot Gris, but the Pinot Noir wines featured as part of the tasting were excellent too. Only a few minutes from I-5, it is well worth the stop. We will be back!",
  "We were greeted by a lovely young lady that was very pleasant and informative about all the wine and the vineyard.  Heading to Cuba in 2019 so thought this was an excellent choice while wine tasting in Salem this past week.  I enjoyed the Pinot Gris, the 2011 Rumba and the 2015 Estate Pinot Noir and purchased those to take home.  After tasting all of the wines we grabbed a bottle of the 2015 Estate Pinot Noir and sat out in the sunshine and enjoyed a beautiful Friday afternoon at the vineyard.  It's a little drive down the rocky path but well worth the drive.",
  "A soft Rose', spectacular Pinot Gris and four Pinot Noir with distinctively different notes-all superbly enjoyable. Beautiful grounds and seating to enjoy with family and friends. We had missed this location during the last trip because we did not travel far enough on entrance road. Worth the drive, much more enjoyable than vineyards at entrance of road in my opinion. For those that do not particularly care for Pinot Noir, this winery will school you. I was fond of the screw tops (although two bottles of Pinot are corks) and ambiance. Will definitely return and is a must GO if traveling in this area!! Beautiful!",
  "I visited Cubanisimo in late June 2019.  What a nice surprise.  We were coming home from the Petal Pedal Bicycle Ride in Silverton, and decided to take in a few Willamette wineries. I had the good fortune to travel to Cuba within the past 10 years, so when we saw the name of the winery I was curious, and my friend insisted that we had to check it out.  \nSo we did.  It was lovely.  The winery, home and vineyards sit atop a hill with terrific panoramic views.  The tasting room and terrazzo are delightful and sunny, with Cuban music playing quietly in the background.  The staff were personable and enthusiastic, and very informative about the owner's history.\nBUT! The wines are the real reason we all go to wineries, right?  The wines are well worth the stop.  We each decided to go for the full tasting flight for $15pp.  I think we tasted 8 wines(?).  They were all enjoyable.  For purchase I selected the Rosado de Pinot Noir 2017 and 2014 Rumba Pinot Noir.  I don't drink a lot of Rose, but in the summer I find it very refreshing on a hot day - it is not sweet, and it is very brightly colored.  My friend too purchased wine, but I can't for the life of me remember what she selected.\nThe service was very good.  We received our first taste at the bar, and were invited to sit on the terrazzo on the lovely patio.  Staff kept an attentive eye on us, and as soon as our glasses were ready, the next taste offering was brought to the table.  The terrazzo looks like it can easily accommodate 100 people.  There were 3 servers there that day and only one other table occupied.  We wondered how they might do when all tables are full, but they were great to us.  We were there close to 1:00p on a Sunday.  \nThe wine was served with salted fried plantain chips (Viva!) or you can purchase light food plates.  We stayed with the plantains.\nI highly recommend this lovely boutique winery and their delicious wines.  I look forward to a return visit.",
  "It is a beautiful drive up to the vineyard. Impressive sweeping views to the East of Hood and Jefferson. Excellently cared for grounds. Excellent service and explanation about their wines and history. We had a great experience. Wines are very nice!",
  "I can understand not liking the wine. These folks have a good history and some good reviews so the wine and us, just did not get along. However, the customer service was terrible. Two people behind the counter, both engrossed in a conversation with a single served customer? Even after getting their attention, no effort was made for a period of time. How dare we interrupt the conversation! We watched this play out for several customer until #1 broke away for lunch and ate it at the counter. Lastly, because we did not like the wine, we could not apply the tasting fee. Perhaps, a credit towards an accessory?",
  "My wife and I visited for an afternoon of wine tasting.  We honestly seem to be bother them for us being there.",
  "Very nice vineyard with some decent wines. I’m a white wine drinker so I don’t appreciate the red wines as much. The whites I really liked especially the 2017 Rosado de Pinot Noir and Pinot Gris. Grayson, our server, was really nice and made our wine tasting much more fun. She made a couple of suggestions of places to go in the area which we wouldn’t have known about. Really enjoyed our time here listening to Latin music. The owner is from Cuba and had some interesting items in the gift shop. Glad we stopped in for a tasting. We got a groupon for $15.00 a 7 pour tasting for two people. Also sold Cuban cigars in the gift shop. A good deal.  "
 ]
},{
 "name": "Bjornson Vineyard",
 "address": "3635 Bethel Heights Rd NW",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/35/21/83/getlstd-property-photo.jpg",
 "tags": [
  "tasting",
  "winery",
  "delicious",
  "walk",
  "winery",
  "tasting",
  "tasting",
  "winery",
  "kids",
  "tasting",
  "tasting",
  "tasting",
  "winery",
  "delicious",
  "walk",
  "winery",
  "tasting",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d13125400-Reviews-Bjornson_Vineyard-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Another winery told us to stop here. We are so glad we did. The vineyards and view are breathtaking. We sat outside on the patio and did the wine tasting. They gave us a few extra tastings. The service was great and explained things really well while also answering our questions. We ordered a charcuterie board which was delicious. They will tell you which wines to pair with which item so get this before the wine tasting. \nTheir wines are all great. Their atmosphere is amazing. You can even walk through the vineyards and taste the grapes. We can’t wait to go back. ",
  "Bjornson has a beautiful view, spacious, artsy tasting room, and outstanding wines. They were recommended by a local viticulture student for the quality of their tasting experience; her school brought her here b/c their tasting is so thorough and educational. Gerry and Barb, who usually wear Hawaiian shirts as uniforms, are super friendly, and impressively artful at their ability to engage people warmly, and hold fantastic conversations, thereby fostering meaningful memories, and lasting connections. On two visits, multiple people have said that they visit here to talk with Gerry. In a lot of winery research, I can tell you that Gerry is definitely the most legendary and cherished wine host within hours. As well, other staff members, including the owners are very down-to-Earth and gracious about answering questions and sharing their vision of the winery and the wines. There is a wine here for everyone, and the Chardonnay is Very special. The gentleman next to me said that Gerry is stellar at reading people, and after only 2 or 3 questions, he instinctively knows how to navigate. When I asked Gerry about this, he shared an amazing philosophy about the different types of wine drinkers/ buyers, and its is fascinating. You've got to make it out there when you have time to stay awhile, and hopefully, it is when Gerry is there. Dogs are welcome, and this is a favorite of many, many people, in and out of the industry.",
  "My husband and I were lucky to find this winery. It’s in a beautiful location on a paved road 12 minutes from West Salem. The owners Gerry and Barb are wonderful. The wine and complimentary cheese and crackers are fantastic. Don’t be shy to bring your dog or kids because they welcome all and have a lovely tasting room, patio and grounds with bean bag toss or board games. My husband and I have been there twice in the last month and look forward to some of their upcoming events.\n\nPam and Randy L",
  "A brand new tasting room with a view of Williamette Valley. The tasting room is comfortable with large windows that brings the view indoors. I like the wines, pinots and a new white, Auxerrois, that made me want just another taste. It is a very relaxing place to hang out with friends, nibble on meat and cheese and sip some pretty good wine.",
  "A brand new tasting room with a view of Williamette Valley. The tasting room is comfortable with large windows that brings the view indoors. I like the wines, pinots and a new white, Auxerrois, that made me want just another taste. It is a very relaxing place to hang out with friends, nibble on meat and cheese and sip some pretty good wine.",
  "Wish I could say nice things but Every single encounter I had with Patti the owner she treats me like crap I’m a second-class citizen according to her and she does not value me! I wish I could say nice things about them but she is absolutely undesirable and I don’t know why she hates me so much? This is not good sign in the hospitality business! Very unhappy with my relationship with this Vineyard owner! Angela Jones",
  "Another winery told us to stop here. We are so glad we did. The vineyards and view are breathtaking. We sat outside on the patio and did the wine tasting. They gave us a few extra tastings. The service was great and explained things really well while also answering our questions. We ordered a charcuterie board which was delicious. They will tell you which wines to pair with which item so get this before the wine tasting. \nTheir wines are all great. Their atmosphere is amazing. You can even walk through the vineyards and taste the grapes. We can’t wait to go back. ",
  "Bjornson has a beautiful view, spacious, artsy tasting room, and outstanding wines. They were recommended by a local viticulture student for the quality of their tasting experience; her school brought her here b/c their tasting is so thorough and educational. Gerry and Barb, who usually wear Hawaiian shirts as uniforms, are super friendly, and impressively artful at their ability to engage people warmly, and hold fantastic conversations, thereby fostering meaningful memories, and lasting connections. On two visits, multiple people have said that they visit here to talk with Gerry. In a lot of winery research, I can tell you that Gerry is definitely the most legendary and cherished wine host within hours. As well, other staff members, including the owners are very down-to-Earth and gracious about answering questions and sharing their vision of the winery and the wines. There is a wine here for everyone, and the Chardonnay is Very special. The gentleman next to me said that Gerry is stellar at reading people, and after only 2 or 3 questions, he instinctively knows how to navigate. When I asked Gerry about this, he shared an amazing philosophy about the different types of wine drinkers/ buyers, and its is fascinating. You've got to make it out there when you have time to stay awhile, and hopefully, it is when Gerry is there. Dogs are welcome, and this is a favorite of many, many people, in and out of the industry.",
  "We had the best experience with Barb, and the wines were phenomenal! They were so good we joined their wine club! Can't wait for our next shipment!",
  "Wow! Loved this place. The wines were delicious, the experience was amazing and the grounds were beautiful. I’m still dreaming of this place and I can’t wait to go back. We will definitely be returning."
 ]
},{
 "name": "Ankeny Vineyard",
 "address": "2565 Riverside Rd S",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/21/3f/c2/we-were-encouraged-by.jpg",
 "tags": [
  "family",
  "delicious",
  "unique",
  "creative",
  "food",
  "delicious",
  "tasting",
  "music",
  "eat",
  "food",
  "free",
  "winery",
  "eat",
  "winery",
  "tasting"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g52053-d534175-Reviews-Ankeny_Vineyard-Salem_Oregon.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful drive from I-5 to the location. Chances are the owner's dog will pleasantly greet you in the gravel parking lot. The outdoor seating is limited on the deck but the vibe is extremely friendly and the deck fills up rather quickly.  The open hearth pizzas are delicious, fresh and inexpensive. The wine list is adequate and reasonably priced and the wine glasses are really cute! Staff is very friendly and down to earth. Very homely place, relaxing and cozy especially toward sunset time when the best views are right from the deck. Really enjoyed the family feel of this place. Service can be a bit slow when seating is at capacity but if you have wine, then you have no worries.",
  "We've been to this vineyard several times and have always had pleasant experiences.  They have a nice deck with tables so you can bring your own picnic.  The views over the vally are quite nice.  They have a nice range of wines - a little something for everyone.",
  "A quiet day here so we had all of Matt's attention. Nice wines, good pour and info re the wines and the area. Look at a map and ignore your GPS. Ours took us on gravel roads over the mountain, but we used the map to go along the river back to town. This is a nice room in a pretty location and worth the trip if you go the right way.",
  "We loved stopping by this unique and lovely Vineyard and Bistro! They offer some food choices you won't see elsewhere, delicious and creative. Great Wine too! ",
  "My husband and I visited recently and had a wonderful experience. The wines were wonderful and the staff was friendly and helpful. We sat outside and enjoyed their wood fired pizza and a full tasting flight on the deck. Afterwards we took a stroll through the vines and from the top of the hill were able to see out over the rolling vineyard all the way to the coastal range. Despite being a busy holiday weekend we were very well attended to by the friendly staff, hope to return again soon. Willamette Valley has over 700 vineyards and is about 150 miles long but its tasting rooms like these that have an intimate feel and excellent wines that keep bringing us back time and time again.",
  "My wife and I came here with a Groupon on a rainy Saturday afternoon. At first we were the first ones there, but by the time we left, there were about a dozen people.\n\nI will say the wine was OK and the pizza was good. The one star rating? That is for the service, wow.\n\nWe were greeted by the guy who we later overheard saying he was the GM and his dog. He put his dog in a back room and though it kept trying to get out, he seemingly rudely kept pushing it back in there. \n\nWe had a Groupon as mentioned and that seemed to annoy him. It offered a pizza with our wine and even though he let us pay the extra $3 for GF crust, he was adamant that he could not and would not let us pay extra for more toppings...\n\nAt first when we got there I made a joke about how \"busy\" they were to which he replied that ya people always make that joke and it's not funny...\n\nWhen it came to the wine tastings, he poured and said little to nothing about any of them. He forgot a Pinot and when I made a joke about the Moscato (honestly a bad dad joke referring it to a cat) he literally did not laugh and said I hate you to me... Like my wife and I laughed...but he didn't.\n\nAs more people got there, it got worse. He seemingly could not handle us and my wife and I gave up and just took our wine and sat at the table. In interacting with a group of ladies in their 60s, he argued with them over them bringing in homemade chocolates and would not let them eat them, talked about how he smokes weed (to which they had no reply) and begrudgingly turned on the music and heat for them.\n\nOf note is as I said this guy said he was the GM and had been there for years. His actions may have at least been understandable had he been new, but it sounds like not only was he not new, but he was high up. \n\nThen another couple came in and had a Groupon, and they had the print out, but not a bar code. Instead of trying to be helpful, he basically kept saying this is no good and told them to get the app. It took them like 10 minutes to finally do so and he would not even serve them anything in the mean time. \n\nI myself worked in food service for nearly 10 years and have been all over to countless places and this is likely the worst service I can remember ever receiving in my life. Rude, inattentive, unwelcoming and laughable at best. \n\nThe food nor the wine here was not enough to help us ever consider coming back and I am sure we were not the only ones that felt that way that day.",
  "Stopped here after the Eclipse. Sitting at a table, not the bar. Poor service. Planned to buy wine and eat our packed lunch. No. Won't let us. $20 for two for five tastings. No intimacy with the staff, just various random servers. I am used to real winery owners and staff.\n\nFree tastings in Cal",
  "Winery tasting area is nice with outdoor seating. The staff was friendly and helpful with our questions about the area. The wines were good. $10 for tasting. "
 ]
}]
