[
{
 "name": "Big Cottonwood Canyon",
 "address": "Big Cottonwood Canyon Rd Uintah-Wasatch-Cache National Forest",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/eb/2c/a7/big-cottonwood-canyon.jpg",
 "tags": [
  "eat",
  "nature",
  "field",
  "walking",
  "unique",
  "walk",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d255182-Reviews-Big_Cottonwood_Canyon-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "This canyon is stunning year round! Warning: Take spring run-off seriously as it is entirely dangerous. Boulders tumble down the canyon waterway like Legos! The crashing sounds are tremendous and exciting, yet don't get too close! Otherwise, enjoy the vistas and the walks/hikes in nature and all the flora and fauna there to observe. This is a beautiful drive with lots of places to stop, eat, picnic, and enjoy Moter Nature at her finest!",
  "As retired 78-year-olds who love to travel, we are more prone to sight-seeing or walking on a beach than hiking or skiing or biking or certainly rock climbing. But all of that and more is on the plate in Big Cottonwood Canyon in Utah. Located in the Wasatch Range 12 miles southeast of Salt Lake City, the 15-mile-long canyon provides hiking, biking, picnicking, rock climbing, camping and fishing in the summer. In the winter, its two ski resorts, Brighton and Solitude, are popular destinations for skiers and cross-country skiers, snowshoe hikers and snowboarders. For sight-seers and folks who enjoy fresh mountain air, the canyon is accessed by The Big Cottonwood Canyon Scenic Byway, which runs its length to Guardsman Pass at the top of the canyon, allowing travel to Park City in the summer months. Hiking to the canyon's mountain lakes is a popular activity, with many trails leading to lakes such as Mary, Martha and Katherine. The canyon's most popular hiking trail, 3.1 miles long and very strenuous, leads to Lakes Blanche, Florence and Lillian. The canyon also is a frequent destination for Utah Native Plant Society wildflower walks and for University of Utah botanical field trips. Storm Mountain is a popular picnic site and S-Curve Area is a favorite gathering place for rock climbers. A drive through the canyon with your car windows open is as refreshing as a dip in cold water.",
  "Every canyon in Salt Lake County is unique. This is a gem. Whatever the season, there is a place to recreate, to picnic or just meditate. \n\nHiking to the falls at the \"S\" turns, Donut Falls, dining at Silver Fork and strolling along the board walk around Silver Lake, even stopping at the Heber Valley of Overlook along Guardsman Pass,  plan to spend hours. ",
  "Big Cottonwood Canyon is a beautiful place, and it is just a couple of minutes away from Salt Lake City.  There are countless hikes, campgrounds, and places to explore in both this canyon and Little Cottonwood Canyon, which is nearby.  Definitely a must-see.",
  "Any age group can find a hike in this area, starting from Silver lake board walk to a rigorous hike..\n",
  "The mountains around Salt Lake are really nice.  Big Cottonwood Canyon has great scenery and super hiking trails.  It would take a week to see it all (depending on snow fall.) ",
  "Unbelievable views and fall leaves. No better color and views of the canyon below. Make this a priority if you are in the area! I’m sure the views are stunning any time of year .",
  "We were in Salt Lake in the spring.  Unfortunately, our timing wasn't so great for hiking as there was still so.much.snow.  But the roads were clear and it was an amazing drive to the top."
 ]
},{
 "name": "Natural History Museum of Utah",
 "address": "301 S Wakara Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/34/0d/a5/natural-history-museum.jpg",
 "tags": [
  "history",
  "unique",
  "learn",
  "kids",
  "organized",
  "hike",
  "history",
  "tour",
  "eat",
  "kids",
  "history",
  "food",
  "tour",
  "history",
  "nature",
  "learn",
  "kids",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d2415414-Reviews-Natural_History_Museum_of_Utah-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Natural History Museum of Utah is not only situated in a beautiful location, overlooking the Salt Lake Valley, it is filled with amazing displays, interactive exhibits, a glassed-in room to watch paleontologists work on actual dinosaur bones, and a whole variety of things for every age.  Not to mention, the cafe is outstanding.",
  "The museum is relatively small, but it has a big-time, modern feel, and does a fantastic job of highlighting the things that are unique about Utah - especially the geology, and the dinosaurs! The displays are very attractive, and tell fascinating stories that really make you want to learn and explore more.  There are plenty of interactive features for kids and adults to enjoy.  Right now, the special exhibit is \"The Vikings\" and I think they've done a spectacular job of combining intriguing objects and relic with a thorough and highly interesting exploration of the culture.",
  "This is a must-see attraction for visitors and citizens alike. Perched on the \"bench\" above the valley the museum sparkles with a first rate new building that reflects the landscape, an incredible view, and totally engaging exhibits. But PEOPLE, it's the dinosaurs you come for and they couldn't be better: scary, close up, massively documented. Fun for everyone.",
  "I would highly recommend spending an afternoon in this clean well organized museum.  The dinosaur exhibit was phenomenal, and the history of the region is incorporated into the exhibit.  The views of the mountains and valley were spectacular.  This is a must see for couples and families alike.  If you like to hike, trails into the mountains run along side the museum, so bring your hiking shoes.",
  "The Natural History Museum has days you can go for a discount and we went on a $5 Museum day. Best deal around. The museum is large with several floors with exhibits to see. We used to go when the museum was on the campus of UofU. Now it is by Red Butte Gardens. We went during the Viking exhibit. The Viking exhibit was small but had lots of educational information. I always loved the Mineral and Rocks they had. This exhibit was located on the same floor as the special exhibit and was difficult to view with the crowds. You can take several hours to check everything out. You are not allowed to bring food or drinks into the Museum but you can eat at the Cafe. Just do it before or after your tour since you can't bring anything with you into the museum. There is some fun interactive activities for the young kids but most are geared for Elementary age. They also have a nice gift shop. You can go to the gift shop and purchase items without purchasing a museum entrance pass. It is located on the same floor to the entrance of all the exhibits. ",
  "Don't miss the exhibit on Level 5 about Utah's native Americans. Watch the video and take your time examining all of the beadwork.  Stunning.  ",
  "Google Maps guided me to the museum in NE SLC.  It's located on a hill with stunning views of the city and mountains.  Inside, I paid my admission and decided against the guided tour.   Dinosaur skeletons were arranged by era as I walked through history, eventually finding myself on the top floor and modern day.   I also explored the Nature Around Us rooms and desert dioramas.  Soup and Cuban sandwich in the cafe behind the gift shop were great.",
  "First of all I loved the setting and the architecture of the museum. Secondly, it's a great way to learn about the western landscapes and the Utah culture. \nThirdly, there are over 1.5 million objects on display. \nDid I mention the huge dinosaur skeletons?",
  "We went here with our adult children while visiting UT. Everybody loved the museum.  Very interesting.  From the dinosaur exhibits, to the paleontologists actually working, to the explanations of the various soil layers, to the explanations of the geography, to the Native American exhibit.  We spent 3-4 hours here and were not bored.  \nThere were a lot of school groups visiting while we were there.",
  "Excellent experience for all ages! Wonderful interactive exhibits and the kids loved the dinosaur area so much. Highly recommend this museum for anyone interested in learning about Utah and the west. ",
  "The NHMU is a fantastic museum. The variety of exhibits is amazing. From the history of the indigenous people, the dinosaur exhibits, how the Salt Lake was formed to the info about conservation and recycling. Everything was well presented and informative. One of the best exhibits was the observation deck on the roof. There is an amazing panoramic view of the Wasatch mountains and the Salt Lake valley."
 ]
},{
 "name": "Red Butte Garden",
 "address": "300 Wakara Way",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6c/1f/46/red-butte-garden.jpg",
 "tags": [
  "walking",
  "tour",
  "walk",
  "hike",
  "walking",
  "art",
  "creative",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d269627-Reviews-Red_Butte_Garden-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have been to botanical gardens all over the world, and the Red Butte Gardens are astonishing:  the variety of plants and trees, the immaculate condition of the flower beds, the signature, and the splendor of the setting all conspire to make a visit here a requirement for any visitor to Salt Lake City, plant lover or not.",
  "What a pleasant surprise this beautiful botanical garden and arboretum turned out to be. We stumbled upon it at the top of the University of Utah campus i'm thoroughly enjoyed our time wondering what they talk to the power man-made trails display gardens, walking paths and natural areas and hiking trails the red Butte Garden offered. The trails leading towards the water conservation garden, water pavilion garden, the fragrance garden, medicinal garden, and herb garden and a playful children's garden. They also have a rose garden and floral walkway that lead to one of my favorites the pear arbors.\n\nI highly recommend  this wonderful place to anybody who enjoys a stroll through the garden. I can't wait for a return visit.",
  "I've visited this garden over ten years now and it just keeps getting better and better! Beautiful terraced gardens, naturally planted in the cottage style, with fragrance, medicinal, and herb gardens, as well as a Rose garden, water features, little nooks for sitting, and a children's garden. A new xeriscape garden is being constructed. Lovely hiking trails up into the hills along the creek. In the summer, there is a tram tour conducted by volunteers at no extra charge that is really helpful for those who can't walk long distances. They now also have lawn performances in an amphitheater. What a treasure!",
  "One of my favorite spots in salt lake. The views are stunning. Even in February the gardens are nice, but when everything is in bloom, it is just sublime. This is a don’t miss spot in salt lake. ",
  "We have a membership to botanical gardens.  Red Butte was a fun place built into a hillside with beautiful views.  We were able to hike up on a trail for about a mile, as well as walking around the amazing rose garden area.",
  "Visited the garden on one of the hottest days of the summer, wished the weather permitted more hiking.  The gardens are beautiful and the views of the city and surrounding mountains are spectacular.  Hope I can get back in cooler weather.     ",
  "A friend recommended I visit when I was in SLC for a meeting. AS colleague and I went. Pretty area, little hilly, little wet/muddy due to recent weather. The creative areas they have planned for kids (when the plants grow/bloom) are lovely. I'd love to see something similar for adults. There was an art exhibit inside, too.  .  ",
  "This garden is extremely well-designed for both display and access, and the setting is beautiful, on an open slope nestled up to a creek and surrounded by mountains. There's an excellent gift shop as well."
 ]
},{
 "name": "Temple Square",
 "address": "50 W North Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/82/50/4d/the-assembly-hall.jpg",
 "tags": [
  "tour",
  "history",
  "delicious",
  "history",
  "history",
  "history",
  "free",
  "library",
  "family",
  "history",
  "food",
  "free",
  "walking",
  "music",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d103552-Reviews-Temple_Square-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "We spent many several hours one day in the Temple Square area.  We enjoyed the artwork, movies and history in the North Visitors Center, the replica of the temple in the South Visitors Center, the tour of the Tabernacle and Assembly Hall, the delicious meal at Lion House, and the Thursday night Mormon choir practice at the Conference Center.   The grounds and flowers are beautiful -and the outside of the Temple and the spires are magnificent!  The hours are very accommodating for visitors and the people are very informative and kind.  It was the highlight of our Salt Lake City day trip.  ",
  "We were amazed at the grounds and all the work to keep them as perfect as they are. We heard the organ play and found the history very interesting. Our guide helped us understand the importance to the Mormon religion and the scale and level of perfection spoke well of the church's level of commitment to the Temple Square.",
  "We visit Temple Square each year to see the Christmas Lights as a Family.It's was Awesome the lights were beautiful and the Christmas Spirit powerful . We also had our Company Christmas party at the Joseph Smith building with a Prime Rib Buffet it was Fantastic",
  "Temple Square (and the adjacent blocks) are to The Church of Jesus Christ of Latter Day Saints (AKA Mormonism) what the Vatican is to Catholicism.  \n\nWhile it is primarily a center of worship and church administration it is also of import to the history and ongoing culture of the city.  Do make time to check out the visitor center for information on the history and culture for which it is important.  \n\nIt is at its most beautiful in mid spring (late April to early May) when all the flowers are in bloom, or during the holiday season when it has beautiful light displays at night.  Unless you are specifically in town for church conference, steer clear the first weekend in April and the first weekend in October as members of the church come from all over the world and it will be very crowded.",
  "Temple Square (and the adjacent blocks) are to The Church of Jesus Christ of Latter Day Saints (AKA Mormonism) what the Vatican is to Catholicism.  \n\nWhile it is primarily a center of worship and church administration it is also of import to the history and ongoing culture of the city.  Do make time to check out the visitor center for information on the history and culture for which it is important.  \n\nIt is at its most beautiful in mid spring (late April to early May) when all the flowers are in bloom, or during the holiday season when it has beautiful light displays at night.  Unless you are specifically in town for church conference, steer clear the first weekend in April and the first weekend in October as members of the church come from all over the world and it will be very crowded.",
  "This is the #1 thing to see for first-time visitors. Arrive at noon for an organ recital. Two visitor centers would each take 15-20 minutes to see. The entire campus is 35 acres. \n\n- Gardens and views of the temple are found on the east side, very scenic for strolls. \n\n- Family History Library is a top thing to do, plan on a minimum of 30 minutes; no experience in genealogy necessary to enjoy it. Free poster sized family tree printed out for anyone. Open Monday to Saturday\n\n- Church History Museum is next to Family History Library and is free. Maybe 30 minutes to explore including a small gift shop. There’s a movie with a 180 degree theater screen (small). \n\nBeehive House is the pioneer home of Utah founder Brigham Young, with 30-minute docent led walkthroughs. \n\nLion House is another of Brigham’s pioneer homes, open for lunch and dinner cafeteria style, was on TV show Food Nation with Bobby Flay. Dinner rolls with honey butter are the must-try item. Good soups and pastries.\n\nJoseph Smith Memorial Building has scenic views and picture spots on top floor overlooking half of Temple Square, the lobby is ornate being a former luxury hotel. 3 restaurants inside the building, a theater that shows free movies made by the Church. ",
  "Beautiful buildings and grounds, located right in downtown Salt Lake.  You don't have to be Mormon to go there, and there are guides who will show you aound.  You can't go into the temple itself.  However, ther is ongoing construction at Temple Square right now that will last un til 2024.  You can still visit, though, and take lots of pictures.  Usually, the best time of year to visit is around Christmas, when the Christmas lights and nativities are set up.  Its one of the coolest things to see.",
  "I am not LDS, but wanted to see the beautiful Temple Square while visiting SLC.  It did not disappoint!  Lovely, green area with views of the Temple.  The Bee Hive house and more",
  "We rode electric scooters downtown and this place is a must see!  Beautiful grounds and downtown is so clean!",
  "My husband and I came with our three children to Utah in August and while in Salt Lake City we stopped at Temple Square.  We walked around for about an hour or two. There is metered parking along the streets surrounding the square or you can find parking structures.  We found parking on the street.\nThere are entrances to the square on each side of the block.\nOnce you enter and see the buildings in the square you want to gaze at them in awe.  The planters were also filled with flowers of all kinds.\nIn front of the main temple is a reflecting pool, where you can take amazing pictures.\nWhile we were walking around we were greeted by a volunteer that told us there would be a free organ concert in a few minutes.  We went inside the auditorium and stayed listening to a few songs.  It was quite impressive listening to the organist who also gave a short explanation of each song.\nThere are statues around the square that are of famous Mormons and founders of Salt Lake City.\nWe definitely recommend if you have some time in downtown Salt Lake City to come and check it out.",
  "The staff/docents at all the venues in Temple Square were amazingly accommodating and welcoming and informative and sincerely committed to enhancing our experience. We spent several hours enjoying artwork, architecture, and the cultural history of Temple Square. We only visited a few venues of the many there to experience, and we are eager to return one day to see and experience those things for which we had not enough time. The venues we visited this time around were: Assembly Hall & the surrounding grounds; the conference center (wow!); and the following day, which was a Sunday, we attended the Music and the Word service in the Tabernacle with the choir (beautiful!)."
 ]
},{
 "name": "Utah State Capitol",
 "address": "350 N State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/be/c2/12/img-20160621-064615-largejpg.jpg",
 "tags": [
  "tour",
  "unique",
  "free",
  "tour",
  "history",
  "free",
  "tour",
  "history",
  "history",
  "tour",
  "walking",
  "walk",
  "tour",
  "free",
  "affordable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d144020-Reviews-Utah_State_Capitol-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "After visiting 3 State Capitols in Denver, Cheyenne and Salt Lake City, I think the best one is that of Salt Lake City.\n\nI joined the tour that started at 11:00 a.m. We started the tour by looking at the map of Utah and the Governor's Gallery where pictures of the Utah 's Governors are on  display.\n\nWe proceeded to the upper floors where we visited the Senate Gallery, House of Representatives Gallery, Rotunda and its beautiful paintings and sculptures, Reception Room, Governor's Office, the Basement, etc.\n\nI admire the materials used in the construction of this building such as marble, granite, etc. Some are produced locally, others are from quarries in Atlanta, Georgia and those from Pakistan.\n\nTips: Join the FREE tour as some rooms are only accessible to Group Tours. Know that the hourly tour starts at 9:00 and ends at 4:00 pm daily from Monday to Friday. Take as many pictures as you like. Use the unique elevator instead of the stairs if you're inclined to do so.\n\nHighly recommended to visit.\n\n",
  "An absolutely amazing building, free of charge to enter, very helpful staff and a wealth of things to see and do.\n\nIt’s a living, breathing workspace so we were really surprised that there was no bag check at all and nobody guarding the Governor’s office. He wasn’t there when we wandered in but a couple of secretaries were and so was his deputy.\n\nWe were given a really helpful leaflet so we could take the self-guided tour. There was a special exhibition in the Gold Room, a history of the state flag, a focus on films made in Utah and much more. There was also a statue to a local guy called Farnsworth, who apparently invented the television. Has anybody told John Logie Baird?\n\nComing from Manchester, city of the worker bee, we were entranced by the beehive and honeycomb motifs everywhere, even on glass doors and floor tiles.\n\nWe went early and it was all very peaceful until the Chinese tour bus arrived. As ever, all they did was talk loudly and take selfies. Now, we’re used to this, not just in the USA, however, in this building there was a fascinating exhibition on the Chinese Railroad Workers part in building the transcontinental railroad and not one of them went to the top of the building to look at it and nor did their English speaking guide!\n\nIn one of the committee rooms the door was open and there was an actual meeting discussing Water Finance – now that’s what we call open government.",
  "We love visiting capitol buildings and this one is a beauty.  We really enjoyed our self guided tour, learning about the beehive, state flower and reading all the info about the Utah State Capitol. The materials used to make this building are beautiful.  Its worth a trip to visit if you like history.",
  "This is a wonderful old building full of great bits of interest. Take your time and look at things and read explanations.\n\nIf you can, go when the Utah Legislature is in session. It's very interesting to sit in the galley above the floor where bills are being debated and voted on. It's mostly nice to see how things work - sometimes there are inane, ridiculous bills that get passed and more important bills, like trying for a hands-free cell phone law, that get voted down. \n\nParking is difficult when the legislature is in session but there are spots out along the road. It's located in a beautiful part of Salt Lake City - the views from the hill are wonderful - take time to look at the outside of the building too.",
  "Went here on a Sunday, basically filling time before I flew home.  Wow, was I surprised.  Beautiful views outside, and the building was open and really interesting (and beautiful) on the inside.  Don't miss the very ground floor: each county in the state has a brass plaque on the floor, and there is interesting history.  Attended with my 19 year-old niece and we both really enjoyed it.",
  "Walking up to the capitol may be difficult for not so fit visitors; it doesn't look like it but is kind of a steep, longer than expected walk. Nice gift shop nearby with friendly staff. Self-guided tour in the building itself, nice and cool and beautiful inside!!!",
  "This is a huge building, and it is in a beautiful location.  You can take a tour of this building during the weekdays.  If you go here, make sure to visit Memory Grove.",
  "We visited this capitol early in March.  It is open with beautiful murals and artwork. A ornate design that is sure to be a pride of Utah.  ",
  "We rode electric scooters around downtown and decided to visit the state capitol. What a site this place is! Massive building is really neat to see! We came back at night and the way it lit up is really cool!",
  "We had no time to actually go inside the capitol building, but we walked the grounds and took lots of pictures. The day was stellar, so the views of the SLC area were stunning. The visitor center, immediately across the street, had lots of free brochures, maps, and travel guides for all of Utah, as well lots of awesome and affordable gifts and collectibles.",
  "Extraordinary and grand, like Washington but different. Wide open space around formal and in a beautiful location."
 ]
},{
 "name": "The Tabernacle",
 "address": "50 E North Temple (at the Temple Square Tabernacle)",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/5e/0a/df/pipe-organ-the-color.jpg",
 "tags": [
  "free",
  "tour",
  "history",
  "free",
  "music",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d107701-Reviews-The_Tabernacle-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "We visited the Tabernacle in early January and watched the organ recital, which occurs everyday at noon and is a Must See. Recital is 30 minutes.  Arrive early doors close  at noon.  While at Temple Square, also be sure to visit the North Visitor Center, Convention Center, and Assembly Hall.  You'll be amazed by the artwork in both the Visitor and Convention Centers.  We ended our day with eats at Nauvoo Cafe inside Joseph Smith Memorial Building - also another impressive place.  Temple Square grounds are kept impeccably clean and so tranquil; the artwork in the buildings are absolutely beautiful, and the sound of the organ is heavenly.  TIP:  The Tabernacle Choir rehearsals are open to the public Thursdays 7:30pm, which I hope to see next time I visit Salt Lake City.",
  "this is the place where the annual Christmas Concert is taped for TV... it is an awe moment being in the auditorium, It seats 4000 people, the Organ is huge, the living is impressive, each day there is an organ Recital at NOON free of charge , it will blow you away, especially when the Organist plays the \" Phantom of the Opera \"...",
  "If you get a chance, don't miss the opportunity to hear the organ.  There are periodic organ recitals open to the public and on certain nights you can attend choir rehearsals at the Tabernacle.  The acoustics are absolutely astounding in this building...you can really hear a pin drop all the way to the rear of the building as demonstrated by a speaker who was describing the building and the organ. You will be impressed!\n\nWhile there, look around the grounds at the beautiful flower gardens and take pictures of the Temple across the street.  It's worth the trip!",
  "Tour guides will give you a free demonstration of the acoustics and history of this building.  You can also attend free concerts when they are available. ",
  "We attended  the weekly Sunday morning service of the Music and the Word, where believers of all faiths are warmly welcomed to immerse themselves in the glorious and inspiring music of the Tabernacle Choir & Orchestra.  What a fabulous way to spend 30 minutes on a Sunday morning! Do not miss this!",
  "A place to go to when the Mormon Tabernacle Choir is doing their event. The sounds are incredible plus the organ and organ pipes are something to see. The building construction is very impressive.",
  "Whether you are a Mormon or not The Tabernacle is a sight to see.  Three levels of seating of 20,000 seats each.  The Choir rehearses every Thursday evening.  The building is a piece of art.  The Sisters gave me a demonstration of a pin and nail being dropped as well as a piece of paper being torn while at the  head of the church.  You could hear it as if you were standing next to them.  The acoustics is amazing!",
  "A must see! Even if you only make to the practice session, go.! I cant wait to go back for a concert!!! "
 ]
},{
 "name": "City Creek Center",
 "address": "50 S Main St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/02/f8/c1/nordstrom-court.jpg",
 "tags": [
  "food",
  "delicious",
  "free",
  "food",
  "food",
  "walk",
  "eat",
  "family",
  "library",
  "food",
  "history",
  "food",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d2692220-Reviews-City_Creek_Center-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Had a good time headed to this mall that spans a good-sized area for shopping in the town centre of Salt Lake City. From luxury brands to local brands, food variety was good which included Cheesecake Factory, where the cheesecake definitely was the star of the show and absolutely delicious.\n\nDo head over here for a spot of shopping and eating when in town. ",
  "We were here in SLC for over a week. Every day we said we would go check out the City Creek Center. Alas, it wasn't until our last evening that we actually got there. It's a beautiful, two story indoor/outdoor shopping center/mall covering 2 city blocks. It has a beautiful skybridge on the 2nd floor connecting the East and West portions of the center. \n\nParking is extremely easy, and inexpensive (free for the first two hours!). Over 100 stores. They have a very large food court, which includes a Red Iguana (popular local Mexican restaurant). Parts of the center reminded us of the beautiful shopping mall in Milan Italy.",
  "This indoor/outdoor mall is fun if you have some time to kill between activities.  Tons of stores (pretty much everything you need) and a large food court.  Located across from Temple Square.",
  "Even though it says the parking ticket will be validated at stores, not all stores do so it's better to Valet and tip. Enough of that. Take a seat. It's a must in any part of this Mall. It's so breath taking. They have all the Major Store and More. Parking is kinda of tricky so Take a picture of where you park it will help. Be prepared to walk , cause so much to see. It was enough store for everyone to see or for a solo to walk.",
  "I’m a guy and I hate shopping!  My wife took me kicking, dragging and screaming but I soon changed my mind as this was not a typical day of reluctant husband shopping.\nWords can hardly describe the experience you will have at City Creek Center.  Two city blocks in the heart of Salt Lake City were mostly demolished so that this mixed use creation could be built.  The office towers and upper level housing almost vanish as you stroll through the main level shopping area.  The developers have managed to recreate the old City Creek which used to run through town ages ago with a number of waterfalls and bridges over the meandering stream.  Trees, shrubs and flowers give you a truly outdoor ambience to the open sky above. The white noise from the stream is very relaxing and there are countless secluded benches and small tables to sit and relax, read a book, catch up on your e-mail or just people watch.  In case of inclement weather, a multimillion dollar retractable roof shuts out the elements.  \nIf shopping is your thing, the center is anchored by Nordstrom’s and Macy’s  and is peppered with shops like Tiffany & Company, Brooks Brothers, Pandora and dozens of other chic shops.  There are plenty of places to eat a full meal or grab a quick lunch or snack. City Creek Center has brought an infusion of activity into downtown Salt Lake and there are plenty of restaurants, sporting events, arts and theaters and other attractions nearby.  The grounds at Temple Square across the street are always colorful and pristine.\nThere is ample parking with numerous access points from all around the center.  Pay attention to the point you entered if you want to exit at the same place as you can easily drive two city blocks underground to find a parking stall closest to your favorite store.  Even if you exit from a different place, it is hard to get lost in Salt Lake with its wide streets and square blocks that are numbered sequentially north, south east and west from the Mormon Temple across from the City Creek Center.  For those not wanting to hassle with traffic and parking, Trax light rail runs the entire Wasatch Front and will soon connect to the airport.  There are several Trax stops at various points along the City Creek Center.\nWhat can I say? I parked myself on a comfortable bench and had a relaxing day while my wife and daughter enjoyed shopping to near exhaustion and they didn’t even max out the credit cards.  Things couldn’t get any better!",
  "We visit SLC periodically to do genealogy at the Family History Library and are very impressed with the City Creek Center.  It is a huge mall complex with two anchor stores, Nordstrom and Macys and a plethora of small retail stores.  It actually has a small creek running down the center!  It is open until 9 every night, BUT, because it is mormon owned, it is closed on Sunday!  The center also includes some good restaurants and a large food court, but the restaurants also have outside entrances so they can be accessed seven days a week. It also has plenty of parking.",
  "A lot of high end shops, but there are also quite a few restaurants and a good food court.  The inside ground floor of the Center has a lovely stream going through it with trout freely swimming.  ",
  "This mall is an indoor/outdoor mall with many high end shops. We enjoyed the Disney store because it was large with an excellent selection.",
  "I walked in and was greeted by the most friendly staff ever my favourite staff member was definitely Tako he helped with everything I needed",
  "The City Creek Center in Salt Lake City is a very centrally located, mostly indoor shopping mall with relatively exclusive shops. There is also a big food court. The atmosphere is upscale, nicely decorated if perhaps a bit artificial. ",
  "Quite an extensive range of shops in this downtown area. Large food court area. Well designed indoor and outdoor areas. Certainly worth a visit."
 ]
},{
 "name": "Clark Planetarium",
 "address": "110 S 400 W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/08/4b/89/clark-planetarium.jpg",
 "tags": [
  "free",
  "free",
  "theatre",
  "free",
  "walk",
  "free",
  "kids",
  "unique",
  "walk",
  "free",
  "theatre",
  "kids",
  "free",
  "free",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d531654-Reviews-Clark_Planetarium-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Clark Planetarium, located in what is known as the Gateway, is just south in downtown Salt Lake City. There are 10,000 square feet of free exhibits in the Theater along with a Planet Fun Store where you find any game or toy-related to space. This theater is the first digital dome planetarium in the United States.\n\nAt the planetarium, we recommend seeing one of the great IMAX movies. It’s been a long time since we’ve seen an IMAX movie, let alone a 3D movie. The movie that we saw was Secrets of the Universe, 3D. It was fantastic....highly recommend!",
  "We had a day to kill in SLC before our flight and several people told us to check out the planetarium.  The planetarium it’s self was free, the shows were very reasonable.  Each show in the dome theatre starts with a brief star show.  We saw Expedition Reef and it was great!  ",
  "This planetarium is perfect for curious minds. Grab a snack at the  concessions and catch a science related Imax or cosmic laser show in the awesome dome. Or, check out the free interactive activities for all ages. You can even walk on the moon or Mars! (It's under construction at the moment) Watch in awe at the three story audio-kinectic sculpture \"Newton's Daydream\". An enormous solar system greets you on the top floor and fun gadgets await you in the gift store. Some money may need needed, however this depends on what you do while your there. Be mindful the gift shop is right as you walk in. Other than you can go without spending a dime as there is no entrance fee.  Have fun",
  "This attraction only charges for shows, admission to many of the exhibits is free. This is nice because if you've got a large group, it's a great way to kill and hour or two.  The kids in our party the day we visited loved looking at Newton's Daydream, seeing what they weigh on other planets and the water vapor display. They also liked the screens where you can put yourself in a scene on another planet.  The littlest members of our party loved the little playground.  We saw a star show that was interesting and not too long for the kids to lose interest.  I'd say between looking at the exhibits and watching the show we were there a little over 2 hours.  You can get a parking voucher if you see a show or purchase something in the gift shop.",
  "A small museum, but full of educational activities that are interactive. Walk on Mars and the moon, and create your own tornado are some of the especially unique experiences. An IMAX theater with several different shows and star programs is a part of the experience. Fun for elementary aged and above. This is a favorite destination for my friends who are adults with intellectual disabilities. Many school groups are here during the week, but it is never too crowded on weekends.",
  "This was our first visit to Clark Planetarium in a few years.  There are a lot of exhibits on the dynamics of the planet, other planets in the solar system and meteorites.  There is also an Imax theatre and planetairum with several different shows each.  We saw an Imax movie but did not have enough time to visit the planetarium.  I may have missed it but would have liked to see a few more things on manned space flight. This is a good visit for kids, probably the 10-15 range.  I would strongly recommend it.  Admission to the exhibits is free, there is a charge for tickets to the Imax and planetarium shows.",
  "Great place . . . especially for free!  Tons of interactive exhibits that are fun for all ages!  The dome theater is super fun for a movie (movies in both theaters do cost).  Amazing gift shop/store with tons of toys, science and STEM activities for purchase.",
  "All free except the movies!  Many exhibits to interact with and learn from. Very reasonable popcorn prices!  Highly recommend!",
  "Great place with some fascinating exhibits. As well as some good general science exhibits, there is a pretty rare moon sample. You’ll also find lots of cool meteorites!",
  "We spent the best part of the afternoon in the Planetarium with our 17 year old Grandson. It was an ideal opportunity to discuss his post high school plans for college. He actually spent a significant amount of time telling me and his Grandmother about the exhibits. The IMAX show titled “Secrets of the Universe” provided him the opportunity to ask us about science related professions. It is a day the we will cherish and remember for ever. It is so rare today to spend quality one-on-one time with your Grandchildren. I highly recommend an afternoon in the Planetarium for any child that is actively considering a career in science. ",
  "Great visit, Probably the best exhibits for kids that I’ve seen in any museum or planetarium. Interesting for adults as well. We will definitely be back next time we are in Salt Lake City. Next time we will check out one of the imax movies as well."
 ]
},{
 "name": "Liberty Park",
 "address": "1100 E 600 S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/62/52/bc/liberty-park.jpg",
 "tags": [
  "family",
  "walking",
  "historic",
  "art",
  "walking",
  "free",
  "pets",
  "food",
  "family",
  "parks",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d140393-Reviews-Liberty_Park-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of fun activities happen here at Liberty Park: kick ball league, rollerblading, zen meetings, drum circle, hippy venues, family BBQ, valley ball leagues and tournaments, and a whole lot of walking.. ",
  "Liberty Park is the second largest public park in Salt Lake City, described as Utah's best example of the central park theme best exemplified by New York's Central Park. Located at 1100 East 600 South, the 80-acre plot of land features a pond with two islands and is the home to Tracy Aviary, which is located on eight acres of the park and maintains a collection of about 400 birds representing about 135 species. In 1860, the land belonged to Brigham Young, who planted varieties of mulberry, cottonwood and other trees. In 1881, Salt Lake City purchased the land from the Young estate. The following year, the 80 acres were introduced as a recreational area and officially named Liberty Park. In 1930, the Tracy Aviary opened. Today, the park, which was added to the National Register of Historic Places in 1970, offers such pubic facilities as playgrounds, restrooms, bowery, concession stand, children's play areas, picnic areas, large grassy areas, horseshoe pits, a swimming pool, basketball courts, volleyball courts, tennis courts, bocce ball courts, a 1.5-mile jogging path, seasonal amusement rides and a greenhouse. In the summer, paddle boats are available. It is a popular destination for joggers, rollerbladers and cyclists. In addition, the Isaac Chase Mill is located on the northeast corner of Tracy Aviary, off 6th East. Built in 1852, the mill is the oldest commercial building still standing in Utah. It was listed on the National Register of Historic Places in 1970.",
  "We walked around this park one evening after dinner (on a previous morning we went to the aviary there).\n\nIt is a beautiful medium sized park with lots of free parking, wheelchair accessible walking trails, a pond, tennis courts, basketball courts, beach volleyball, picnic areas, a greenhouse, small amusement rides (which were not open yet), fountains, folk art museum, etc. It really does seem to have it all. Every city should have such a lovely park.",
  "A beautiful green space with trees and so much more!    So many people love this park: families, pets, walkers, paddle boats,  bird aviary, tennis, swimming, food.  You never know what you will see here.  ",
  "One of my favorite places to go to get away from my office is Liberty Park.  It is absolutely beautiful, with large trees and green well maintained lawns.\n\nThe playgrounds are well maintained, and children seem to have a great time.\n\nThere are always families enjoying the summer at the park and many of them have the family dog come along to participate in the fun.  Even though the park allows dogs, they do require that they be on a leach and I have yet to see an owner who has not cleaned up after their pet.\n\nAs with all parks in major cities, there are homeless that will be enjoying the park.  This has not been a problem for me or my family, and I have only seen tents or shelters erected on a few occaisions.  Still, I would like to see a lawenforcement or security officer patrolling the park just to help ensure the safety of all, this is especially true because of the children that are always at the park. \n\nFor a fun day that doesn't cost anything I recommend you spend some time at Liberty park and have some fun. ",
  "This is an amazing a large park, what a great benefit for the city of Salt Lake.  The back drop is the snow covered mountains, beautiful.  We walked and walked and did not have time to see everything.  Take some time and enjoy.",
  "This is a huge park with lots of walking and green space, as well as lot's of playgrounds and shelter-houses/picnic tables. It can get very busy on weekends and evenings - parking can be a challenge. One of the urban gems of Salt Lake!",
  "The park is perfect for picnics, basketball, volleyball, and other activities as well! Highly recommend for daytime activities."
 ]
},{
 "name": "Tracy Aviary",
 "address": "589 E 1300 S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/3d/da/12/say-cheese.jpg",
 "tags": [
  "wander",
  "kids",
  "food",
  "food",
  "family",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d216552-Reviews-Tracy_Aviary-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "You don't have to be a birder to love this place. And it's not just for little kids - lots of fun for all ages! The bird show is excellent - very informative and fun! Wander the Aviary to see the beautiful and amusing birds. I've been to a private party in the rental facility here and it was a great venue. I think this is one of Salt Lake's hidden gems. ",
  "This is comparable to the aviary we saw in Flagstaff, AZ in that it is maintained with great care and provides many different, interesting observation aspects of various types of birds. You will see birds from all regions, some non caged, like the 50-something-year-old condor who takes a walks around the grounds with his keepers! Or the peacocks, ducks, etc. Others are in nice and accessible enclosures (you can get good pictures and get a sense of their environment--not too \"cage like\"). This is truly a gem of an aviary and it is located inside Liberty Park so you can go ride the rides and have a picnic afterwards.",
  "Have a walkabout through Tracy aviary and see all of the beautiful birds that are being loved and cared for!",
  "The Tracy Aviary  is located in Liberty Park.  Several acres of only birds, in a beautiful setting.  The birds a well cared for and living a wonderful life.  Great for all ages. Gift shop, food, and wonderful staff.",
  "I’m basically the lady I’m Home Alone 2 with the pigeons. I love birds. Is this you? Well here is the place for you. I’ve been multiple times and never ever get sick of it. The price is great, the birds are well looked after(I have my own little friend at home) and the grounds are great. The food offered when for sale is a good price and the gift shop offers good pricing too. ",
  "Visited on one of the hottest days of the summer!  Loved the displays, especially the owl area.  The bird show was well choreographed with several birds flying overhead.  Lots of information, family friendly.",
  "Happy family winter day trip.  Extensive world wide birds made a quick look into hours.  We stayed for hours.  Young adults & teens kept away from phones, paying attention & enjoying the array of habitats & corresponding birds.  Don’t miss the wetland.  Just like the rest of the areas, we found ourselves inside, with the ducks inches away, close enough to see them diving & swimming under clear water.  A joy to watch, accessible to walkers, & has a bench too.\n\nIt was a surprise to find some birds with big personalities.  The Toucan seems to love attention.  We enjoyed feeding the tame white goose by hand!  The bird shows were another way to get close to a variety of birds. \n\nThe staff are friendly & knowledgable & seem to enjoy our questions.  Thank you for giving us a perfect day.",
  "Two adults visited mid-week in the autumn, taking in the bird show (I held a falcon!), and we really enjoyed our morning! We saw some feedings too, as we walked the lovely grounds of the aviary. I learned quite a lot of new information, and I'm fairly old, so this must be an excellent experience for families with children! The signage is very good, and odor is well controlled. I swear, some of the birds (spoonbills) LIKE people!"
 ]
},{
 "name": "Salt Lake Temple",
 "address": "50 W North Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/41/82/b6/salt-lake-temple.jpg",
 "tags": [
  "tour",
  "walk",
  "unique",
  "family",
  "history",
  "walk",
  "learn",
  "family",
  "tour",
  "walk",
  "free",
  "structure",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d275214-Reviews-Salt_Lake_Temple-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Though the Salt Lake Temple has become somewhat obscured by the surrounding skyscrapers, it remains the heart and soul of Salt Lake City, and it is worth getting up close and personal to see firsthand the result of forty years' worth of a labor of love.  The exterior is full of symbolism of the Mormon faith.  Because it is a working temple, only LDS members with a temple recommend can enter.  However, in the South Visitor's center, there is a beautifully rendered scale model that shows the interior in great detail.  Also on the grounds of the temple is the Salt Lake City meridian, the red sandstone boulder that marks the very center of the city, on which the grid of streets was first built (it's a little hidden, so it's a bit like a treasure hunt to find it).  No visit to Salt Lake City is complete without a visit to Temple Square and its granite heart!",
  "Temples built by the Church of Jesus Christ of Latter Day Saints are sacred buildings to the Lord.  Entrance is only for those who have temple recommends to do sacred ordinances.  It is not a place to go sight-seeing, at least on the inside of the building.  The grounds afford a peaceful beauty to walk among the well-tended gardens and take pictures of the exterior of the amazing building.  There are missionary tour guides who are willing to answer any questions you might have.  These missionaries are usually young men and women who are paying their own way for two years to serve the Lord and are assigned at a place in the world not of their own choosing, but are willing to go where they are assigned and needed.  They are eager to share the gospel with people who are interested and want to know more about their church.  If you are there just to visit the temple but don't want to know more, just politely tell them so.  \n\nIf you would like the opportunity to experience going inside of a temple, watch for new temples being built, or older ones being re-furbished.  The temples are always open to the public for about a month before they are dedicated and closed to the general public and only those holding valid current temple recommends are allowed to enter.  The Washington DC temple is about to be closed for the next two and a half years for re-furbishing.  Watch for it being open to the public after it is updated and before it is re-dedicated.  This will be a once in a lifetime opportunity to enter one of the most beautiful buildings and experience it from the inside.",
  "It is so worth it to be worthy of a Temple recommend and experience the majesty of this unique,  beautiful building! ",
  "The Salt Lake City Temple, located on Temple Square in downtown Salt Lake City, is a must see attraction for the whole family. The temple was built by the Mormon pioneers, who carved the granite stones from the mountains, and hauled them down to the valley. It took 40 years of labor to complete. Many of the pioneers donated one day a week's worth of labor to help construct this building. It is beautiful, and shows detailed craftsmanship associated to the people of that time.\n\nThere are several other buildings located on temple square worth checking out as well, like the Tabernacle, whose roof was constructed without the use of nails. The acoustics in that building are incredible and sometimes if you're lucky you can listen to a rehearsal concert by the famous Mormon Tabernacle Choir.\n\nThe grounds are immaculate and bursting with colorful flowers in the spring and summer, and literally draped in lights during the Christmas season. Visit the contemplation pools, as they are very cool and reflect the surrounding buildings. \n\nThis is a place where you can either simply walk the grounds at your leisure, or take one of the guided tours that is available. Whether you are interested in the LDS faith or not, the amazing story of the early pioneers who settled this valley is truly remarkable and a valuable piece of American history. Family friendly for all ages.",
  "You don't have to be Mormon to appreciate good architecture, and the Temple certainly has it. This is an impressive building that accomplishes the goal of drawing the eye ever upward. To see an excellent cutaway model that reveals what is inside the Temple, head over to the visitor center. While there, be polite to the strategically placed missionaries, but don't take the baited attempts at small talk unless you want to be tied up in a long conversation for which they've already practiced. Just look around and learn from the helpful exhibits.",
  "If your looking for a pretty garden during the spring and summer, the temple grounds are where it's at, during winter beautiful lights, but watch out for young couples, they're always marriage proposals going on.",
  "Life is so crazy, and this place has often been where I have come to get away from it all and catch my breath. While I’m here I find that my mind is clearer, I’m more confident about the future, and I feel closer to God and my family. There’s a feeling here that you won’t quite find anywhere else. 10/10 would recommend.",
  "I didn't think people of other faiths could visit this place, but I was wrong. There is a big square with lots of tour guides.  The landscape and architecture are amazing and make for great photos.  There are also a lot of building with a lot of information and also interactive things you can do. ",
  "I didn't want to give the mormon church 10% of my annual income, so I couldn't visit the temple. Anyone can walk around the beautiful well groomed grounds.  Also visitors can attend the informational displays around the temple, but can't go inside unless agreement to pay 10% of annual income.  Seems like a high price to pay.",
  "The building looks like a castle from the outside.  Unfortunately it is closed down for 4 years for renovations and to make it further earthquake safe.  ",
  "A trip to Salt Lake City is not complete without a visit to the Salt Lake Temple.  Visitors to Utah have so many exciting destinations to visit that they really have to make choices of the places they will visit, but not visiting the Salt Lake Temple is like going to Washington DC and not seeing the White House.\n\nThe temple is one of the major landmarks of Utah.  It took fourty years to build and the craftsmanship is inspiring.  The attention to detail is amazing.\n\nDo not be afraid of being accosted by Mormons trying to sell you on joining the church.  There is plenty of information about the church and its founding without anyone talking to you, however, if you want to speak to someone about the church there are plenty of volunteers that can assist you with any questions you might. have.\n\nIf you get the chance, come during the Christmas season.  The lights, music and decorations are inspiring and you can't help to get in the Christmas spirit.  Just remember to bundle up because the temple is still in Utah where the average temperature hovers around the 30's that time of year.\n \nJust one other important point.  Your visit to this magnificent structure is free.  There are no costs to visit.  You may find free parking difficult, but the parking garages are resonably priced."
 ]
},{
 "name": "LDS Conference Center",
 "address": "60 W North Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/84/cf/a4/the-main-auditorium.jpg",
 "tags": [
  "art",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d2179845-Reviews-LDS_Conference_Center-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "The LDS Conference Center sports amazing architecture and art exceeded only by the staff/docents whose hospitality and graciousness were second to none. We spent a couple hours wondering and saw most of the three floors of this huge, fabulously designed conference center. Elegant, yet warm and welcoming. ",
  "The LDS Conference centre is a rather imposing facility just west of Temple Square. Very much part of the Mormon or Church of Jesus Christ of Latter Day Saints complex. This is were the choir sings when the Tabernacle is closed for renovations (as was the case when I visited). The Conference Centre was completed only in 2000 and features an impressive 7708 pipe Schoenstein organ, as well as extensive roof garden which is intended to extend the landscaping of Temple Square itself.",
  "We stopped by on a Sunday morning and were treated to a concert by the Mormon Tabernacle Choir. The venue is huge and beautiful.  The pipe organ is fantastic.",
  "I have attended conference here multiple times.  There are lots of ushers to help you find your seat, every seat has a great view and the A/V is amazing.  The facility is extremely clean and well cared for.  this is an amazing venue for any concert/cultural event.",
  "During the tour the guide explained that there was seating for over 70,000 people. It was a very beautiful building."
 ]
},{
 "name": "Ensign Peak Park",
 "address": "1002 N Ensign Vista Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/38/31/ba/view-to-the-downtown.jpg",
 "tags": [
  "hike",
  "hike",
  "hike",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d2226745-Reviews-Ensign_Peak_Park-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "I did this hike in sandals! I did get slightly winded since its mostly a steady incline, but overall a quick and fun hike!\nDefinitely try and time this to do around sunset because you bascially can see all of downtown salt lake once you get to the top!",
  "Great little hike (< mile) right behind the state Capitol building.  Street parking and a well marked and easy to follow trail.  Views are incredible. Go see where the original settlers surveyed the valley and decided to build the city. ",
  "After driving through a nice, kind of suburban residential area, you get to the trailhead with some interpretive signs. The hike to the first lookout point is super short and the view is awesome even from there (plus there's an interpretive sign up there labeling the view).",
  "Easy little hike up to the top of Ensign Peak. Spectacular views of the city in multiple directions.  The trailhead is behind the capital building through a residential area.  Parking is on the street.  We spent about an hour hiking and enjoying the view.",
  "We got there right at sunset and did not have flashlights other than our phones, i recommend bringing a flashlight if you go after dark.  the walk to the overlook was steep for a flat lander like me, but very rewarding view.  We could see the twinkling sprawl of the city, but could not see the lake in the dark.  "
 ]
},{
 "name": "Cathedral of the Madeleine",
 "address": "331 E South Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/79/3f/ff/cathedral-of-the-madeline.jpg",
 "tags": [
  "walk",
  "art",
  "unique",
  "walk",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d564569-Reviews-Cathedral_of_the_Madeleine-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Regardless of your Faith you'll enjoy your visit to this Catholic Cathedral located just west of downtown Salt Lake City. Check out the service times on Sunday & allow yourself 15~20 minutes to walk from most downtown Hotels.",
  "The Cathedral of the Madeline is conveniently located in Salt Lake City, Utah and an easy walk from the convention center and many hotels. The interior art work is beautiful. Take some time to examine their stations of the cross paintings located throughout the church...they are very unique. The parish offers Masses in both English and Spanish so check the Mass listings carefully.",
  "I went to mass here twice, at 5:15pm Wednesday and Thursday and had the blessing of hearing the boys and girls of the Cathedral Choir sing on alternate nights.  The Cathedral has been renovated in the not too distance past and is breathtaking.  Do not miss the weekday evening mass when this internationally famous choir sings!",
  "We visited twice while in town, early March.  This church is beyond beautiful.  The colors inside are amazing!",
  "Based on information from the Utah Office of Tourism (300 North State Street, SLC), we drove down the hill to South Temple Street for a quick visit to the Cathedral of the Madeleine. Beautiful stained glass, quiet time, interesting organ. Being Ash Wednesday the church was open and getting ready for services. We found parking on the side street easily. Would work this in with the self guided tour down South Temple Street as suggested by the tourism office, next time!",
  "We came last year and got a tour from Father Diaz, who is happy to share the story of how the cathedral was built. We're excited to come back during the Holidays to hear the Christmas Concert!",
  "Large frescoes may be the most remarkable feature of this beautiful cathedral.  However, the stained glass is gorgeous.  The organ is fantastically impressive.  Definitely worth visiting.",
  "If you enjoy a well designed building, you have to visit this Cathedral.  It's breathtaking and feels like you're in Europe somewhere.  Very special!"
 ]
},{
 "name": "Great Salt Lake",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/93/97/df/antelope-island-prong.jpg",
 "tags": [
  "history",
  "knowledgeable",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d103555-Reviews-Great_Salt_Lake-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Great Salt Lake, located in the northern part of Utah, near Salt Lake City, is the largest saltwater lake in the Western Hemisphere, the eighth largest lake in the world and the largest lake in the United States that isn't part of the Great Lakes region. It covers 1,700 square miles with an average depth of 33 feet. It is the largest remnant of Lake Bonneville, a prehistoric lake that once covered much of western Utah. The three major tributaries to the lake--the Jordan, Weber and Bear Rivers--deposit around 1.7 million tons of minerals in the lake each year. Because it has no outlet besides evaporation, it has a very high salinity (far saltier than saltwater). Due to the high density resulting from its mineral content, swimming in the Great Salt Lake is similar to floating. Although it has been called \"America's Dead Sea,\" the lake provides habitat for millions of native birds, brine shrimp, shorebirds and waterfowl, including the largest staging population of Wilson's phalarope in the world. The first scientific survey of Great Salt Lake happened in 1850, three years after the Mormons arrived, under the leadership of Howard Stansbury. The lake contributes an estimated $1.3 billion annually to Utah's economy, including $1.1 billion from industry (mostly mineral extraction), $136 million from recreation and $57 million from the harvest of brine shrimp. Despite pollution and natural \"lake stink\" caused by the decay of insects and other wildlife, the Great Salt Lake remains one of Utah's most popular tourist attractions. Antelope Island State Park is a popular tourist destination that offers panoramic views of the park, hiking and biking trails, wildlife viewing and access to beaches. There is a marina on the south shore of the lake at Great Salt Lake State Park and another in Antelope Island State Park. Single mast, simple sloops are the most popular boats. The lake is a great test of sailing skills with its sudden storms and expansive spread. Three resorts, each called Saltair, have been operated on the south shore of the lake since 1893. The current Saltair, completed in 1981, serves as a concert venue.",
  "A must see while you are in the area. You will be amazed by the smells, sounds (or lack of), brine flies and the sheer beauty! It is truly a site to see! ",
  "I'd been there 50 years ago, and the lake's still there.  Even on a cold, brisk day, it was very interesting. The visitor center has a great video on the natural and social history of the lake and SLC, and the staff was very knowledgeable -- he directed us to Antelope Island on the north side of the lake, which was GREAt in spite of fighting rush-hour traffic to get there.",
  "We visited in early March.  It is a fast 45 minutes from SLC.  It costs $10 for a car to drive in.  There is a visitor center, campground, beaches, and cafe.  \nI have been told that is is a smelly location in summer, due to the lake.  I did not experience in odor.  \nLots of wildlife, bison, were everywhere.  Beautiful views and lots of trails.  Many lovely overlooks.  \nI recommend this park",
  "Really enjoyed our experience. We learned a lot about the Mormons. It was a very, very cold day! Nice to meet the Mormons, they were very friendly. The lake was fantastic. Glad to know them!",
  "If you visit SLC you must drive the short distance past the airport to the visitor center and see the largest salt water lake in the Western Hemisphere.  \n\nThere was no park ranger at the entrance so the parking fee was voluntarily left in an paper envelope in a lock box.   There was a lot of available parking that day.\n\nI parked in front of the visitor center which was across from the small harbor.  Inside the center was a number of informative exhibits and videos about the lake and its history.  Bathrooms were also located here.\n\nOutside there was a separate observation area with more information and I was able to clearly see across the lake.  The strong salty smell hits you but was not too bad.  Only a couple of boats were out on the lake and I would like to get out on the water some day and see if it’s any different.  The nearby beach was a. It muddy and devoid of people that day.\n\nThe hills on the other side of the freeway made a nice backdrop covered in snow but it was offset by the chimney stack from the Bingham Canyon mine.  More information on the mine operation was located outside of the visitor center. \n\n",
  "Visited here while on a roadtrip/vacation as we have never been. I must say it's very beautiful here and a great city and place for pictures. This location is wonderful and will visit again",
  "Cold day, snowing and in the 30s. Still made the time to stop and see the lake. A bucket list item! Several people had the same idea. We were not alone "
 ]
},{
 "name": "Utah's Hogle Zoo",
 "address": "2600 E Sunnyside Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/e0/7e/01/nikolai-the-tiger.jpg",
 "tags": [
  "hike",
  "walk",
  "active",
  "active",
  "free",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d140833-Reviews-Utah_s_Hogle_Zoo-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Fun zoo. Reptile house is awesome. Grandbrat loves it, he's three. They have an outstanding bird show in the summer.",
  "What a day! We have been to Utah's Hogle Zoo quite a few times, but today was fantastic! They have a VERY cute little merry go round and train which are included in a membership! My kid could have done the merry-go-round 20 times if we had let him!\n\nThe best part about this zoo is that it's pretty clean, I LOVE the atmosphere and of COURSE the lion water fountain is an absolute MUST to take pictures with! :) \n\nWhile we were there, the polar bear was TOTALLY swimming and was ABSOLUTELY fascinating! The sea lions were also super active making for a fun and memorable trip! Definitely can't guarantee the animals will ALWAYS do that, but it was definitely one for the books! :)\n\nBring GOOD shoes to walk in! It's definitely a little bit of a hike from the entrance to the back/bottom of the park and back. They also have a splash pad, so if you're a smart mom, you'll bring the swim trunks or an extra outfit!",
  "We went here for the second time. Wow!!!! has it changed. They made it better. The Giraffe's have a bigger area to roam, the Big cats(Lions), have a nice big area, the Elephant's have a big area too. It is a lot nicer since we were there last. We enjoyed every minute of our visit.",
  "I’ve grown up around this zoo, it’s a frequently visited area. We visit maybe once a year. I can say the quality is less than I remember growing up and even say 5 years ago but it’s still a fun place to take my kiddo. It’s mostly accessible, but does have a huge incline in the majority of the park. They do offer electric wheelchairs for rent but I just have a manual one that my husband mostly pushes me for for long excursions like this and I can’t say how much that takes out of us.\nIt gets expensive, especially during boolights and zoolights which I feel is shockingly expensive for the value. They’re ok but you can probably skip these specialty events and just opt for day time visits.",
  "It’s been a few years since we have been to the zoo and decided to check it out. Lots of great changes continue to improve the experience and exhibits. We went on a cooler day, which allowed for much smaller crowds and active animals!",
  "Fun place to visit with an amazing collection of animals in such a small place. We always enjoy visiting. The Zoo lights are also fun.",
  "My husband and I visited Hogle Zoo on december. We arrived around 3:00 pm and ask at customer service if the zoo was available cause that day a lot of snow had fallen. The customer service man told us : yes the zoo is available to visit until 5:00 pm. We decided to pay the entrance fee and visit the zoo. There is no animals to see. Just to see the polar bear, grizzli bear, a goats, sea lion and an owl. The zoo had two lions on display and they looked very cold and a lot of snow around the lions. The zoo was clean and the trails was clean too. Atvthe the exit we ask again to the customer service because we paid the regular winter price ticket and there is no animals to see and he told us that he coudn’t refund the money. The only thing he could do was give us a pass for another visit. We explain that we was from another country just visiting Salt Lake City returning home next day and was not possible to have another visit to the zoo. Even so he\ncould not give us a money back. May be this is a great zoo but our experience was not good.  If the zoo did not have a full experience to the visitors should not be open selling a full winter ticket price. This was our experience and it was unfortunate. We just share our experience to another winter visitors if you are a tourist and does not have too much time like us.",
  "I enjoy seeing local ZOOs wherever I go. It's a nice way to spend some time outside, get some exercise and see some animals. \n\nMe and my friend decided to go on Wednesday, expecting it to be a bit more crowded, since admission is free every Wednesday in November and December. \n\nSafe to say it was a bit more than we bargained for. Sure, we could have turned around and come some other, non free day, but we already committed to the idea, so here we were. \n\nFirst, the challenge to find parking. We were quite lucky and didn't take us too long to find a parking spot. Yes, it was a bit ways away, but since we knew we would walk quite a bit that day, that didn't bother us. \n\nWe came around 10:30 a.m. and the parking lots and the ZOO itself were already packed. The ZOO opens at 10 a.m. \n\nThere were mostly families with kids, doing things that kids usually do - running, screaming, crying etc. so if that is not your scene, I would suggest to skip this place. \n\nThe ZOO itself is cute. Not really large, which surprised me a bit for it being a ZOO in a major city like Salt Lake, but the layout is nice and we saw quite a few animals. \n\nThe weather was beautiful if cool, which I am sure majority of the animals enjoyed quite a bit after the hot months of summer. \n\nThe ZOO has very nice indoor enclosures for birds, small mammals, reptiles etc. \n\nAll in all, not the best but definitely not the worst ZOO I've seen. If you have small kids, I would highly recommend - they have tons of programs for the small ones, play areas etc."
 ]
},{
 "name": "Smith's Ballpark",
 "address": "77 W 1300 S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/a7/16/17/smith-s-ballpark.jpg",
 "tags": [
  "field",
  "food",
  "field",
  "affordable",
  "kids",
  "unique",
  "food",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d4432910-Reviews-Smith_s_Ballpark-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were in town visiting and decided to catch a Bees game.  Beautiful ball field with spectacular view. Great gift shop, lots of food choices, and friendly and clean everywhere. Easily took the Trax green line from downtown hotel.  There are some homeless around, not bothersome, just be aware.  We were early, so we went across to the mini mart/gas station on the corner for a cup of coffee. Also there's a sports bar a block away it seems some wait there for game. There's not much cover if raining before gates open.  Definitely check it out. Lots of fun.",
  "Enjoy a major league ball game and if you do it on  the 4th of July  or Memorial day, you will also experience amazing fireworks!",
  "Triple A baseball in SLC is one of the best places to see a game. As you sit in the stands, or sprawl on the grass, there is not a bad seat in the house. Enjoying a game along the first base side allows you not only a gorgeous view of the Wasatch mountains, but also keeps the sun to your back when enjoying an evening game in the summer time. If you love to bask in the sun while downing your hotdog, then grab a seat on the third base line. ",
  "We LOVE coming to smith's ballpark, especially on a fireworks night! We're looking forward to going again this summer and letting our daughter run around on the lawn behind center field and taking a ride in the little choo choo train!",
  "Wonderful ballpark facing the Wasatch Mountains! Great range/variety of concessions, playground for kids, kiddie train and gift shop. Tickets very affordable with every seat having a nice view. Great way to spend a relaxing day watching good Class A ball!",
  "great ball park, as close as you can get without spending a fortune at the big leagues. Fun atmosphere.",
  "A truly unique baseball experience with a beautiful backdrop of the Wasatch Mountains. The food here is also surprisingly good for a minor league ballpark.",
  "Great view of the mountains, sit on the 1st base side to stay out of the sun.  Check the calendar for night games with fireworks, and bring the kids!"
 ]
},{
 "name": "Wheeler Historic Farm",
 "address": "6351 S 900 E",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/f5/f2/b7/wheeler-historic-farm.jpg",
 "tags": [
  "family",
  "kids",
  "historic",
  "learn",
  "family",
  "walk",
  "eat",
  "tour",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d140260-Reviews-Wheeler_Historic_Farm-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots to do here: playground, picnic tables, lots of shade, duck ponds, pavillions that can be reserved, petting-zoo format, and more.",
  "We were there doing family pictures what a fun place for a visit my grand kids loved the space to run around and play!",
  "The Henry J. Wheeler Farm, which was constructed in 1898 and added to the National Register of Historic Places in 1976, is one of the few remaining late 19th century farmsteads in the Salt Lake Valley that has not been lost to expanding housing and business developments of metropolitan Salt Lake City. Situated on a 75-acre plot of land at 6343 South 900 East Street in Murray, Utah, the historic complex includes an adobe and brick home and several outbuildings, all built in 1898. In addition to the Victorian-style, L-shaped, 11-room house, there are a granary, ice house, chicken house and work shed. A barn, also built in 1898, burned down in 1973. Together, the complex of buildings, along with the fences, trees, stream, ice ponds and roads, constitutes one of the few complete and operating homesteads in the Salt Lake area. The farm was established by Henry J. Wheeler, the third son of English Mormon converts, who came to Utah in 1852. Born in 1866, Henry grew up on his father's farm in the Murray area. After marrying in 1886, he built his own farm on this site. Built upon a granite foundation, the interior walls were made of adobe while the exterior walls were of ochre brick. The home has an entry tower at the nexus of the L. The bottom floor had a pantry, kitchen/dining area, formal dining room, bathroom, living room, parlor, large staircase and hall. Upstairs were four bedrooms with walk-in closets and one large central storage closet. The interior was distinguished by its fine fireplaces, high ceilings, cherry and oak woodworking and staircase. Today, with the addition of a blacksmith shop, store, reconstructed barn, amphitheatre and a large activity barn that functions as a multi-purpose center, the Wheeler Farm is fully functional with farm animals and crops that are overseen by Utah State University's outreach programs.",
  "You will learn how to milk a cow.  Make sure to be there on time for milking time.\nThere are all sort of farm animals.  Make your young children wear rubber boots when the  grounds are wet!",
  "This is an excellent place to take a walk, picnic, read a book, take pictures or ride a bike around. Can be quite busy when the Framers Market is going on, but the rest of the time it is usually quite calm here. In the autumn there is always families here taking family pictures. I do miss the days when they would have the Haunted Forest during Halloween season.",
  "Wheeler Farm is a working farm with lots of farm animals for children to see. It's always fun to stroll through, bring a picnic lunch to eat at the many picnic tables or in the fall visit the pumpkin patch. Love the many geese and ducks around. And for the little ones there is a play area as well. A horse drawn cart can bring you around the whole farm for a ride and sometimes there are ponies for children to ride as well. On Sundays there is a farmer's market in the summer. Been coming here for many years with my children and now grandchildren and still enjoy it very much. ",
  "We LOVE coming here to go on a stroll past the farm animals, get a ride on a tractor around the property, or to just stroll by the stream and ice ponds.  Great all seasons of the year, and a wonderful chance for photos.",
  "Wonderful place, friendly staff. I visited in winter so the store was closed fore the season. I didn’t make the house tour , but looked worth it. Beautiful property.",
  "We stumbled upon this place whilst we were having a drive around. It’s a park with farm animals and walking trails. There was no admission fee. There were not too many people around as it was chilly. Interesting little place.",
  "I was surprised to find there was no admission charge for the farm. \n\nIt's well kept with a petting area, antique machinery, gift shop and trails and gardens to explore. \n\nThe staff were preparing for Halloween when we were there and it looked like some fun activities are due to happen soon. \n\nThe wood carvings next to the car park were very interesting and well done. \n\nNice way to spend an hour or two.",
  "No much going on on a Sunday but the farmers market. Dog friendly I bet it would be a nice fall activity about a 3 mile walk around the farm. Cows, rabbits , sheep etc"
 ]
},{
 "name": "Mill Creek Canyon",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/28/6f/b2/mill-creek-canyon.jpg",
 "tags": [
  "hike",
  "hike",
  "walk",
  "hike",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d255181-Reviews-Mill_Creek_Canyon-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "There are so many different options of hiking and biking in this canyon, and you can even take your dog. SOme days are off leash too, just go early if you want to get a parking spot close to the trail head!",
  "For a good day trek, take the trail at the top of Church Fork picnic area and hike to the top of Grandeur Peak for an airplane view of Salt Lake City and \n a 270º view of the entire Salt Lake County.  Steep trail at times, and the only shade is near the bottom half.",
  "We went to Mill Creek Canyon over 4th of July weekend.  Its a very scenic canyon with a nice creek (Mil Creek); picnic grounds, and good places to hike and bike.\n\nWe also enjoyed a superb dinner at Log Haven.  Its one of the most romantic restaurants in Utah  When we were there there was also a wedding celebration in the court yard area.\n\nMill Creek is in the Wasatch National Forest.\n\nThere is a small fee to go there which one pays on the way out of Mill Creek Canyon.\n\nIt is a day use area only.",
  "But some gorgeous trails are up there. Some of the trails are closed for part of the year But you can still walk up if you want to. My favorite in Granduer Peak. ",
  "On Jan 1, 2020 the fee upon exiting the canyon increased from $3 to $5. I hope they actually build some new trails and make other improvements with the increased fee. That may be too hopeful. They have been collecting $3 for a long time w/o many improvements in recent years. There is often not enough parking around the trailheads on weekends. The existing trails are good, but there needs to be more of them and it would be nice if they interconnected. Anyway, go there but expect crowds on weekends. I was surprised to see cars overflowing the parking lots this 2019/2020 winter. The road is closed for winter about 1/2 way up the canyon and then opens on July 1st each year. The road above the gate is sporadically groomed for skiers and fat bikers, but there are so many people that hike up in boots it post holes the groomed road so badly it almost doesn't seem like it gets groomed at all. I hope with the fee increase they can increase the grooming frequency, but the increased fee has been in effect for 2 months and nothing has changed.",
  "There are so many different options of hiking and biking in this canyon, and you can even take your dog. SOme days are off leash too, just go early if you want to get a parking spot close to the trail head!",
  "There are some amazing trails here, but be prepared to share. Parking is almost always a problem and there is a $5 charge to LEAVE. You pay on the way out. We drove in once just to look, never stopped the car and left ten minutes later and paid $5 for the privilege. There was no place to park, so we left - and paid $5.",
  "Whether you like to hike, mountain bike, cross country ski and you like dogs, this IS the place.  Quick to access, spectacular trails and scenery.  I probably shouldn't be writing this review, though, because it's already crowded enough."
 ]
},{
 "name": "Salt Lake City Public Library",
 "address": "210 E 400 S",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/a0/c6/aa/salt-lake-city-public.jpg",
 "tags": [
  "library",
  "free",
  "eat",
  "library",
  "kids",
  "food",
  "creative",
  "library",
  "library",
  "unique",
  "library",
  "library",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d564580-Reviews-Salt_Lake_City_Public_Library-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Went to the library this week for a public screening of award winning film Sonita. The design is wonderful, and the auditorium is even better!! Perfect for movies, as well as conferences, meetings, and workshops. Atrium has coffee shop, specialty gift shop, and more. Parking in garage can get costly, so look to take TRAX if possible.",
  "I was looking for a free attraction to take the kids while visiting SLC. It was summer so I also wanted air conditioning.  There is expensive snack food in the lobby area so eat before you come. Or, you can bring food and eat on the roof. We rode the glass elevators up and down until we got bored with that then went into the library. We spent hours in the different themed cubbies on the children's floor. There are plenty of computers and things called books.  We found a comfortable couch and got a stack of books and sat there and read for hours. Then, for fun, we rode up the glass elevator to the roof and walked the big staircase that eventually  takes you to the ground floor. Then we walked back up the staircase. It gives you incredible views of the city.  Parking is expensive and they don't validate. So next time, if I visit again, I might take the train from the hotel and not have to pay for parking.",
  "As a frequenter of libraries and open critic of urban design, the Salt Lake City Public Library is perhaps the best modern library I have yet visited. It features a large open atrium that includes friends of the library book sales, a coffee shop, and a few local gift shops. It has tons of glass, and is a very comfortable place to sit and read, especially on cold Utah winter days. The Library stacks are easy to navigate, well lit, and pleasant to explore. The best parts are large children's level, which features creative reading spaces and play areas, and the roof level terraces that bring you above most of the City and view the wonderous mountain vistas. The Salt Lake City light rail has a stop right in front - definitely a plus for visitors and residents alike - and parking is not difficult either. The library is a must-see for bibliophiles, and those that appreciate well-done public spaces.",
  "We love coming to the library and enjoying the atmosphere and wandering around the grounds and enjoying the architecture. All you need is an ID for a library card!\n",
  "A fun place to visit if you get a chance.  The staff is helpful and knowledgable.  \n\nOnce you enter the library from the parking the enclosed walkway is lined with retail stores and makes you feel like you are in a very progressive faciility that has turned a library into a more enviting place than the library's of my childhood.\n\nYou actually enter the main library through glass doors where you can get on a glass elevator and go to different floors.\n\nThe library is a fun place to visit, but the unique style of the Salt Lake City Library is worth a visit.    ",
  "Building doesn't look anything like your average public library.  There are commercial shops on the main floor and you must take the elevator to the rooftop garden for the great views.",
  "See something FREE! What a beautiful building with stunning Views! The fountains outside the back of the building are very peaceful.  Charging stations for your phone on tables with spectacular views of the mountains!    There are shops to eat...get your hair styled and you can read a book in comfy cahirs and stare at the views!\n\nThe rooftop was closed due to high winds but the view looked great out there!\n\nAcross the street is the City Building which is also quite beautiful with a clock tower and fountains in the courtyard!",
  "Wow.  The inside entrance soars above your head and is awe inspiring.  There are shops and coffee shops inside the entrance and on the opposite entrance you can sit by the waterfall and view the architecture from that side which is very modern with sweeping windows and arches."
 ]
},{
 "name": "Memory Grove Park",
 "address": "370 N Canyon Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/63/3c/88/memory-grove-park.jpg",
 "tags": [
  "kids",
  "family",
  "history",
  "walk",
  "hike",
  "kids",
  "walking",
  "walk",
  "kids",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d149473-Reviews-Memory_Grove_Park-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Took my daughters dog . Leashed in the park.  Shade  water and then you start on the freedom Trail which is unleashed and your dogs can run around and play in the water. Fun for kids to lots of dogs lots of people. \nI parked across from the capital and walked down the switchbacks. ",
  "What a neat park! Lots of history here. Looks like a great place to go with the family, or to walk the dog! Very peaceful. The little creek flowing through the middle of it is neat.",
  "This is a respite from the city. Paved trail up to city creek for bikers, and a \"natural\" off leash dog trail next to a creek. This is a quick cool off for my dog when it is too hot to hike in more exposed areas. In early spring, the creek can run too swiftly for some dogs due to rapid melt, but by the heat of summer it is safe for most!",
  "Memory Grove Park was an unexpected surprise and seems to be a best-kept-secret in SLC. Though near the end of  winter among bare trees, the park remained splendidly bathed in natural beauty with a delightful stream running through it and lots of inviting trails, as well as wide-open grassy areas where kids and dogs romped. We wandered among the monuments dedicated to fallen soldiers of yore and climbed the  very do-able short trail up the ridge to where the capitol grounds adjoin and open out to some of the best views of the SLC area. Nestled in a ravine within the SLC limits, we followed our visit to the park with a who-cares-if-we-get-lost drive among the beautiful residential areas flanking the  east ridge of Memory Grove Park, where we encountered yet more incredible views of the SLC area.",
  "If you want somewhere to go for a walk or run then this is your place, nice area with families and people walking dogs etc",
  "Took my daughters dog . Leashed in the park.  Shade  water and then you start on the freedom Trail which is unleashed and your dogs can run around and play in the water. Fun for kids to lots of dogs lots of people. \nI parked across from the capital and walked down the switchbacks. ",
  "We walked to this park from the Hyatt House Hotel and it was way too far a hike in the hot sun. The park is beautiful with a creek flowing through it. It's a very lush and peaceful area. There are lots of elegant memorials /monuments around and about the park. There is a trail where dogs are allowed to hike on off leash but they must be on a leash in the other areas of the park although we saw lots of people not following the rule. I guess it's not enforced. Our dog had a blast on the trail. There were several families there having fun together and enjoying picnics. It was a pleasant place to spend time at.",
  "I enjoy going through Memorial Park every time I go to salt Lake City! Sometimes I just look at the park, and sometimes I read the writing on the monuments. The visitors are nice, but some let dogs off-leash illegally. "
 ]
},{
 "name": "Lake  Blanche Trail",
 "address": "Mile Marker 7 Big Cottonwood Canyon",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/89/83/64/blansh-lake-trail.jpg",
 "tags": [
  "hike",
  "walking",
  "hike",
  "walk",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d4860251-Reviews-Lake_Blanche_Trail-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "A moderate hike of 2 hr up and 1 hr down from the car park, Blanche Lake is a gem. The hike gets bit steep towards the end. Being winter didn't find too many hikers. The lake was frozen. The sharp peak at the backdrop is rather dramatic. Awesome all round views. I definitely want to hike here in summer too. Do carry water and snacks. In winters, micro spikes is advisable. ",
  "I was visiting St Lake and found this trail.  This is a medium difficulty trail and you have to be somewhat physically fit to do this.  It is uphill the whole way.  Most of the trail is well groomed but there are some areas which are rocky.  The trail took me about 2.5 hours to complete.  I was walking at a brisk pace since I didn't start till late in the afternoon and wanted to be done before it got dark.  Suggestion is to start early in the day and plan for around 3-4 hours depending how long you plan to stay at the top.  \n\nOne of the best trails I have hiked.  You can hear the waterfall in the near distant majority of the way.  Lots of shady spots along the way and large rocks along the trail to take a break.  Once you get to the top (by the lake) the rocks are beautiful.  The lake is gorgeous and I wish I had more time to just enjoy the scenery and inhale the fresh air.  Definitely a must do if you in St Lake.  ",
  "Get there early for parking in the small lot near the trailhead! It took us almost 3hrs to go up, with plenty of stops to take photos and rest (we are complete amateurs and had our 60yo mom with us). The trail is well marked and the view at the top (and also throughout) is worth the climb.",
  "This is perhaps my favorite Big Cottonwood Canyon hike; I've done it multiple times and never tire of it.  It's especially spectacular in the fall when the leaves change color, since the gamble (scrub) oak and aspen are all yellow, the maples are bright red, and the conifers are green.  When all those colors are seen against the lake and blue sky, it's just breathtakingly beautiful.  The trail also features numerous places where you can see glacial scarring on the granite.  And if it's not too crowded and you hike quietly, there is plenty of wildlife to see as well.\n\nOnce you reach Lake Blanche, there are less travelled trails down to two smaller sister lakes--Lake Florence and Lake Lillian.  There are campsites by each lake.  But be aware that if you hike down to them the only way out is to hike back up to Lake Blanche before descending on the main trail, since there are no cut-offs from the main trail to the lower lakes.\n\nThe hike begins in a small parking area which fills up quickly; it's not unusual to have to park quite a ways up the road on the shoulder and walk back to the trailhead.  The lower part of the trail features a small waterfall and is popular with families and young children, but you quickly leave that crowd behind as the trail starts to climb, since it gets very steep.  You ascend about 2,700 feet for about 3.5 miles before reaching Lake Blanche and it's unrelentingly uphill, and often without shade in the afternoon, so take plenty of water and plan on frequent breaks to catch your breath if you're not in marathon-running shape. The whole hike (not counting extended tin at the top of spur hikes) usually takes me around 3 hours, but I stop often to enjoy the view so it can certainly be hiked more quickly. But unless you're a trail runner, I'd count on at least 2 1\\2 hours.  Once at the top, you can see the entire valley open up below you as well as the gorgeous mountain scenery all around.  It's definitely a class-A mountain hike.  One of Utah's very best!",
  "The hike to Lake Blanche is probably the favorite of all the hikes in BBC. It starts as an average incline with a few steeper spots for about 1 1/2 miles. The final 1/3 is steep with many switch-back for an additional 1 mile. You can go any day of the week and feel comfortable since the path is well used. In the final mile, there are 200 ft. of rockfall, but it isn't schist. The hike rises appx. 2300 ft. It should take appx 2 1/2 hrs at an average pace. Lots of people don't make it to the top but all seem to enjoy it."
 ]
},{
 "name": "Kindig It Design",
 "address": "164 E Hill Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/e3/94/3f/photo4jpg.jpg",
 "tags": [
  "tour",
  "organized",
  "tour",
  "tour",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d10788485-Reviews-Kindig_It_Design-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are into cars you have to do this tour. The tours are on specific Fridays due to possible filming schedules. It easy to book a spot on line and the price is very modest ($5). We really loved that this was very personal up close experience of the amazing work and people at Kindig It Design. Brad was a great tour guide and led us on a full tour in and around over 20 projects in various phases of work. The tour took about an hour. Brad provided us with a lot of information that will enhance the enjoyment of watching Bitchin Rides!",
  "My wife and I had a tour on Friday Aug 2nd, This is the coolest places to tour a working custom car shop. This shop was super clean very organized. We saw 4 cars in the front showroom just waiting to be picked up after getting work done. Then we toured the back shop work area with around 20 cars an early 60's corvette, Early custom Chevy pickup, Karmann Ghia, Caddy convertible, Gullwing Mercedes, Mustang ect... on and on to many to remember in the shop along with one of Dave's personal VW 4 dr Van with a flat bed. Kevdogg's slammed white Chevy Suburban waiting for Dave to figure out the custom wheel type. Cameras are off limits in the back shop work area for good reason, some very cool custom work going on here. We had a chance to meet Dave and Kevdogg for a photo op outside. They were strapping down a sand buggy behind a motorhome heading out for some weekend fun in the mountains after a week of the hard work on all the customers cars.  If I am ever back in Salt Lake City I will tour this place again, Kindig it Design is AWESOME!!!! Terry Anway from Michigan",
  "As seen on TV Kindig-It- Design from the TV show on the \"Velocity Channel\", \"B&*%N Rides\". We made a trip into Salt Lake City from Yellowstone on our long cross Country trip this year to check out Kindig It. They have some really great customs on the show, and had to check them out. The week we were here, the crew was in Reno for the Good Guys Meet. So not very many cars to see. They are notorious for several builds and restorations, and just had to check it out. The 1968 Chevelle, \"The Atomic SS\", that they did was here, and the rest from the TV show were either with them in Reno, or hid inside the shop, which is off limits to the public. There is a show room that only had one car that was a stock looking Corvette. I did meet his daughter, Baylee, who runs the showroom was very nice and friendly, and allowed me a picture op with her, Thank you Baylee. There were several projects outside that we were allowed to look at, but were not allowed inside the shop. and I can understand that. When they return and get things set up in the new showroom area, it should be a better visit. If in the Salt Lake City Area, you may get lucky and see some of the awesome rides they build. I enjoyed it and there were only a couple cars to see, of which most were in various stages of builds. Worth a stop, especially if interested in Custom cars or appreciate killer rides. Trip advisor won't allow me to use the name of the show, but those that watch it know it.  B*&%n Rides.",
  "We made a slight detour on our drive into the States to visit the site of one of our favourite TV shows.  Unfortunately we weren't there on a day of a tour --- next time.\n\nWe visited the small showroom and gift area.  The cars are even more beautiful in person.  \n\nOn the way out, we saw Kevin in the parking lot.  We asked him if he would take a picture with two fans.  He was very generous with his time and we chatted for a few minutes before letting him get back to work.\n\nIf you're a fan of the show, it's worth the stop.",
  "If you are into cars you have to do this tour. The tours are on specific Fridays due to possible filming schedules. It easy to book a spot on line and the price is very modest ($5). We really loved that this was very personal up close experience of the amazing work and people at Kindig It Design. Brad was a great tour guide and led us on a full tour in and around over 20 projects in various phases of work. The tour took about an hour. Brad provided us with a lot of information that will enhance the enjoyment of watching Bitchin Rides!",
  "Visited on a Tuesday afternoon... Nobody around except a very polite and helpful guy in the store.  Sat in the chairs with Dave's poster between us so we can at least lie and said we met Dave.  Yes, our friends are not that bright. 🤔. Few cars to see. T-shirts are not screen printed but plastic applied decals. \n\nThey build a great car though!  So we bought shirts anyway. \n",
  "My husband is a huge fan of the show and while we were in Salt Lake City on vacation, he just had to go.  What a great tour of a custom car garage.   Biggest disappointment was Dave and Kevdog were off filming and not there.  The showroom is small with just a couple of cars, a beautiful Corvette and a awesome Lincoln, a small gift shop with T-shirts, hats, etc and then the offices upstairs.  After a brief introduction from Dave's daughter who led the tour we were taken back to the working garage.  NO pictures can be taken from this point on.   We watched the mechanics/designers as they worked on various cars around the garage.   The tour takes about 40 minutes or so, cost is minimal and held to only 10 people (I think) and it's definitely worth the trip if you're a car fan.  Great place .",
  "We were tuned away, they would not let us in because of filming.. nothing on their website to warn us ... we went out of our way on a trip from Houston  and they would not let us in........"
 ]
},{
 "name": "Salt Palace Convention Center",
 "address": "100 S West Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/8a/15/c6/salt-palace-convention.jpg",
 "tags": [
  "food",
  "food",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d1419968-Reviews-Salt_Palace_Convention_Center-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "HUGE Convention Centre!  Lots of room for vendors and visitors as well as many classrooms for workshops!  WOW!  Fabulous!",
  "Attending a genealogy conference.  Large spacious facility. Excellent staff.  Many food vendors to choose from. Facility is well maintained",
  "The Palace is huge! The staff was great plenty of food options for almost 10,000 people at the Roots Tech conference. Stairs, escalators and elevators are available. There is currently construction on one side which has the bathrooms closed on that side, however plenty of other available. ",
  "This is one of the biggest Conference Centers I've ever seen. You can literally walk for 20 minutes getting from one end to the other. There are a variety of rooms and spaces for holding events. Also, as a vendor, it's a fantastic facility for keeping clients comfortable. Quite often, convention centers can either be a little chilly or a little hot and stuffy when the rooms filled with people, but the temperature here was very comfortable throughout the entire building, which is a very big deal to me. An overall great experience.",
  "I have been here before to attend conventions and loved the place. This year however, there was some construction going on and they had the bathrooms closest to the dinner hall closed. It was a good 5 minute walk each way to get to the bathrooms from dinner."
 ]
},{
 "name": "TRAX Light Rail System",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/38/38/c1/the-train.jpg",
 "tags": [
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d10473661-Reviews-TRAX_Light_Rail_System-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a handy service to use when skiing in the Little Cottonwood Canyon. The ski resorts have partnered with the UTA, allowing your ski pass to have access to the bus and rail system. Easy to make a trip downtown and back",
  "I should have researched taking the TRAX from SLC airport as it has a station only a block and a half away from my hotel.  Take it for FREE in the local area or pay only $2.50 to go to or from the airport!  Wonderful transit system.",
  "Free if you are using downtown. It was easy to use, the timing seemed off, It is available late if needed. Double check on the time.  ",
  "A $2.50 fare from the SLC airport to downtown is fantastic and fairly quick with not too many stops.",
  "Since I had 24 hours between flights, I decided to visit downtown SLC on my own. TRAX was the perfect solution, and I took a direct train from the airport to Temple Square. The Rail System was clean and clearly marked. Seats were brightly designed, and there was adequate space for luggage and window gazing. Tickets were easily accessible, and there was a Senior discount. It was also handicapped equipped. Outdoor stations were well lit, and there were numerous panels describing the incoming and outgoing trains. I would highly recommend this inner city transportation system."
 ]
},{
 "name": "Eccles Theater",
 "address": "131 S Main St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/15/5c/8b/photo1jpg.jpg",
 "tags": [
  "performance",
  "eat",
  "walking",
  "performance",
  "family",
  "free",
  "theatre"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d12310893-Reviews-Eccles_Theater-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "Salt Lake new performing arts theater is simply terrific.  The acoustics are perfect and the seating comfortable and nicely aligned to allow viewing of the stage.  Multiple levels of seating with boxes in the wings make for a first class experience.   We attended the touring company presentation of “Wicked” and it was Broadway quality.  The performance stage appears to have all of the special tools to allow flying monkeys to come to life and sound quality that rivals anything on Broadway.   ",
  "What an amazing show! That cast was incredible! But this review is about the theater. What a beautiful facility. Very clean. I loved that the chairs were wide and you actually had leg room! It was nice to be able to purchase water and treats before the show. I was surprised that they actually sold alcohol at the Eccles. I was very impressed by the ushers and their helpfulness. Cant wait to see another show!",
  "The inside ceiling resembles a starlit night sky. From the Lion King 2017, to Kurt Bestor's Christmas 2018 (Hamilton and others in between), this theater has created memorable experiences for my loved ones. Great gift ideas for graduation, birthdays, etc. All genres of shows. A wonderful contemporary addition to Salt Lake's existing theaters. Inside restaurant, water feature, adequate restrooms, and excellent professionally dressed (black and white) smiling staff. Close level parking is wonderful. Theater experience at its best!",
  "We've been to quite a few shows at the Eccles. It's a great venue and hardly a bad seat in the house. Everyone we've ever interacted with there, from security to ushers to box office staff have been friendly and helpful. Seats are comfortable, the shows tend to start on time, and everything looks well maintained. Tickets tend to be spendy, but that's a reflection of the performers and not the venue itself, and they're actually cheaper than performances we've seen in other cities.\n\nThere's tons of parking nearby, curbside drop-off if you're taking an Über, and the Metro passes right by so getting there is no problem. There are tons of places to eat within just a few minutes' walking distance so you can eat before you catch your show.",
  "Have only been to this theater once and find the seating is excellent and the performance, \"Shen Gun\", was also excellent, particularly the amazing sets. The theater is fairly new and the ushers and concessioniors were accomodating and helpful. The theater is easily accessible by  \"TRAX\". ",
  "My wife and I are now into our second season with Broadway Across America at the Eccles center. We live in Idaho but the travel during the winter is worth the entertainment at the Eccles. We love the shows included with the season ticket package and the fact that we get preferential treatment for other activities. We will keep this tradition going for many years in the future. We were able to buy enough tickets to Wicked to take all of our girls to the show. It made for a wonderful family weekend in SLC.",
  "My husband and I have purchased season tickets for the Eccles Theater every season since they opened. We are delighted with most of the productions, and love sitting in the first row of the first tier. We have a perfect, unobstructed view of the stage, and the access in and out is very convenient. We always park directly across the street in the parking garage, and usually get free passes with our tickets. We also love that we can cancel a particular show and reschedule another. Best entertainment investment ever!",
  "Last night was my first visit to the Eccles Theatre and I very much enjoyed it. Show was Wunderbar - Eddie Izzard - and so was the venue. Easy to get to, parking garage near and inexpensive, and just beautiful. One full wall in the lobby was a giant screen on which Utah’s beautiful scenery was on showcase in video. Whoever did the cinematography was brilliant! Lots of people took photos of it, and no wonder.\n\nIf you get a chance to catch a show here, take it! Big enough to share with lots of people but small enough that it felt very intimate. "
 ]
},{
 "name": "Joseph Smith Memorial Building",
 "address": "15 E South Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/60/36/25/photo0jpg.jpg",
 "tags": [
  "music",
  "tour",
  "eat",
  "free",
  "food",
  "tour",
  "walk",
  "eat",
  "food",
  "tour",
  "food",
  "unique",
  "active"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d144018-Reviews-Joseph_Smith_Memorial_Building-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "The old Hotel Utah, now the Joseph Smith Memorial Building has a wonderfully beautiful lobby where you can sit and relax and at times enjoy light music.  There are many good restaurants in the building.",
  "Tour the amazing beautiful building, watch a free movie on Jesus Christ, or eat at one of the amazing restaurants on the top floor with a view of Temple Square below. ",
  "The elegant lobby still reminds of  the building's halcyon days as the grand Hotel Utah, where famous visitors to Salt Lake City always stayed.  It is now officially a dedicated church facility,  home to  several church administrative departments.  However, the lobby and other areas of the building are open to the public. Its restaurants rooftop restaurants offer spectacular views overlooking Temple Square.  However, they no longer serve what was once reputed to be the best coffee in town.  As a rule, they serve good food that is moderately priced.",
  "Once you come out of the elevators or simply walk in the Joseph Smith Bldg (formerly Hotel Utah)  you are greeted with elegance and grandure.\n\nTake a tour, host a meeting or reception, and enjoy a fabulous dinner all with some of the greatest and best views in Utah.\n\nWhen your done you can take a stroll around Temple Square, window shop at City Creek, and pay for underground cover parking.\n\nCheck for local events and schedules first, and revisit each season.\n\nEnjoy.",
  "I have been here several times over the years. I like the look.  Parking is an issue, but you can get comped at the restaurants.",
  "This building is stunning. The artwork and details are breath taking. Everyone is welcomed. I recommend it to everyone even if you're not of the LDS religion. It can be a bit pricey if you're thinking of having a wedding here. When we had our's we spent quite a bit For such a small cermony. If you have the chance to eat at hte Roof I hightly recommend it! Beautiful view and amazing food.",
  "The Joseph Smith memorial building, formerly known as the hotel Utah, is meant to impress and in all candor, it is impressive. Was built between 1909 and 1911 and used as a hotel until 1987. There are still three operational restaurants in the building. The manicured garden and pond in front of it on Temple Square are nice if you like a highly controlled landscape.",
  "Wonderful building but why name it after a man who has never stepped foot in Salt Lake - let alone this building.   Just weird.  I wouldn't go again.",
  "Our tour operator organised an evening meal in this fabulous restaurant. Situated on the top floor of this building, we had a beautiful view of the sun setting over Salt Lake. Food was buffet style with plenty of choice. Note that this is a church run facility and no alcohol is served. Would definitely go here again.",
  "To reiterate the subject title, the Joseph Smith Memorial Building is an extravagant, luxurious, posh Building to behold; a treat for your visual senses. \n\nIndeed, the Joseph Smith Memorial Building is sublimely beautiful both in it elegant exterior design, as well as for its noble, high-class, epicurean interior decor, design, and amenities. We were told by its internal Guide that in its glorious, century-old past, it served as a hotel, and hosted USA Presidents, and assorted entertainment-industry celebrities. Today, the Joseph Smith Memorial Building is a public venue and lounge, and an \"active museum\" of sorts. \n\nWhen you visit the Joseph Smith Memorial Building, please make it a point to go to the top floor. You will thus be treated to sublime, uninterrupted views of the Temple Square, and of the Temple itself. The view is spell-binding; it will render you speechless and breathless. Moreover, the panoramic view of the top floor affords you the vista of the expansive downtown Salt Lake City core.\n\nWhen you properly plan your itinerary -- and to mark any special personal occasion that you desire to bless with lush gallantry -- you may elect to dine at the top-floor \"The Garden Restaurant.\"  You may dine at a window-side table that extends to you the aforementioned beautiful view of the Temple, Temple Square, and downtown Salt Lake City. The Garden Restaurant on the top floor of the Joseph Smith Memorial Building renders an experience at the Joseph Smith Memorial Building truly unique and special. \n\nThe Joseph Smith Memorial Building is exclusively beautiful and calming, and most assuredly worthy of your time to visit, behold, dine, and experience.  \n\nI will return to the Joseph Smith Memorial Building as my personal \"go to\" venue whenever I am in Salt Lake City to dine at The Garden Restaurant with my girlfriend to further treat her like a Princess, and to properly set the regal mood of my sojourn to Salt Lake City.",
  "After breakfast in the Nauvoo, a cafe in the Joseph Smith Memorial Building, the volunteers gave good suggestions for activities. They explained the Giving Program - where you purchase an item in a vending machine and it is sent to a needy person. Additionally, with the  Christmas Holidays  they explained changes in the usual schedules in some buildings.  Local high school choirs were performing in various buildings in Temple Square area.  We thoroughly enjoyed the panoramic views from the 10th floor.  There are two upscale restaurants there too.  Then we arrived in time to watch a local High School Choir perform. They performed from the balcony which made it hard to both see and hear them. There are a variety videos available in the building.  Sorry our schedule didn't allow time to see some of them.  "
 ]
},{
 "name": "Land Cruiser Heritage Museum",
 "address": "470 West 600 South, Salt Lake City, Utah",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/fd/43/66/land-cruiser-heritage.jpg",
 "tags": [
  "unique",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d12229408-Reviews-Land_Cruiser_Heritage_Museum-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are a lover of the Toyota Land Cruiser or even if you just appreciate a beautiful collection of vintage vehicles this museum is an ABSOLUTE MUST!!!  An incredible collection of Land Cruisers dating back to 1953 through 2015.  You will find Land Cruisers from around the world, some utilitarian and some in beautiful mint condition.  There is also an extensive collection of Land Cruiser toys and models, as well as an awesome display of Land Cruiser pedal cars.  If you are visiting Salt Lake City or   a tourist in your own town, make sure you stop in for a visit - you will be wowed by the collection and knowledge of the curators!!",
  "What can I say, loved this place. As a former Landcruiser owner it has been on my bucket list for a while. The folks working there were very friendly and informative, they know their stuff. There is every model of Landcruiser ever made here and also the first one brought to the States. I was in heaven. Highly recommend even to folks that have never owned one. ",
  "Just visited the land cruiser museum. It is an amazing collection and the staff are friendly and helpful. Great gift shop too!  This is a must visit spot for anyone with an interest in cruisers, so many unique vehicles.",
  "Feeling a little nostalgic for my FJ40. There was a meticulous and beautiful example of it at the museum. Same color and year! Great collection of stock, custom, old and new Land Cruisers. I only wish you could see all of the vehicles for more angles. Space is at a premium, they have a lot of Land Cruisers on display... about a hundred!",
  "I've owned a couple of Land Cruisers and thought I knew quite a bit about their history. Well, I surely know a lot more now. This museum offers fantastic exhibitions on Cruisers both domestic and foreign. These are historically significant vehicles and this museum helps you to understand why. It's not just for Cruiserheads but for anyone with an interest in automotive history. I can't wait for a return visit.",
  "A must for any Cruiser Fan or 4x4 enthusiast!!! From the first model to the latest. Rigged out to stock.",
  "We were amazed how many different models of landcruisers were produced across the world . All the vehicles are in incredible and original condition. Would highly recommend dropping in and having a look . We spoke with Dan who has a outstanding knowledge of the inventory.",
  "TripAdvisor needs to be updated. I guess in the recent past the museum was free, but they do charge admission now as of October 2019."
 ]
},{
 "name": "Church History Museum",
 "address": "45 N West Temple",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/a2/94/79/church-history-museum.jpg",
 "tags": [
  "free",
  "family",
  "history",
  "unique",
  "learn",
  "history",
  "free",
  "family",
  "history",
  "learn",
  "free",
  "family",
  "history",
  "tour",
  "theatre",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d140739-Reviews-Church_History_Museum-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Family History Museum in Salt Lake City is an excellent collection of paintings, historical videos, and artifacts on the early history of the Church of Jesus Christ of Latter-day Saints.  Newly opened is an exhibit called Suffragettes that focuses on Mormon women being the first to get the vote in the US but then how The Edmunds Tucker Act revoked their right and how they got it back.  Another exhibit just opening is entitled Temples Dot the Earth.  This is a very interactive exhibit designed for children, but informative for all ages.\n\nDocents are scattered throughout the exhibit to answer questions, But you can choose how much time you want to spend exploring. Most people spend about 1.5 hours.\n\nFree, open Mon - Fri 9:00am to 9:00 pm and Sat 10:00 am to 6:00 pm.  Closed Sunday.\n\nFriendly atmosphere, lovely gift shop.",
  "This is one of my absolute favorite sites in Utah. While I'm not a member of the Church of Jesus Christ of Latter-day Saints, I would recommend this museum to any visitor to Salt Lake City as an opportunity to learn more about the religion that has played such a unique role in the city's founding and history. Because of my deep interest in Mormonism, I spent approximately five hours at this museum over two days, but since admission is free, your visit can be as long or as short as you want.\n\nThe first floor is focused on the history of the church in the 19th century. It's impressively curated, with one of the most memorable features being the 220-degree film of Joseph Smith's First Vision. However, I should note that some of the more controversial aspects of the Church's history are relatively glossed over in a way that may be unsatisfying to non-members. Little is said, for instance, about the practice of plural marriage, which is referred to in the exhibit as an \"Abrahamic trial of faith.\"\n\nThe second floor will likely be of greater interest to members. The exhibit Presidents of the Church explores the lives of past prophets through personal artifacts and multi-media displays. There are also several halls of religious artwork.\n\nBefore leaving the museum, I'd definitely suggest a stop at the excellent gift shop, where I purchased a beautiful Salt Lake Temple ornament and greeting cards by Utah artist Brian Kershisnik.",
  "This place is really nice in that they have quite a few original historical items here. Some of these items are just relics from pioneer days, but some have true historical significance. There are several first edition Books of Mormon and the original printing press from the first printing, I especially enjoyed the 180 degree film of Joseph Smith, and the exhibit on each of the prophets wherein they have various items from each of their lives, and focuses on their focus as prophet. They also have a really cool exhibit on the tabernacle organ. Very enjoyable, very interesting stuff, and very helpful docents. Also, I really like that they are complete and forthcoming about things whether they be flattering to the church or not. ",
  "We saw the great exhibition space devoted to the first voting women in the country in February--such a great opportunity to see how far we've come!",
  "Oh my. Always something to see and do here. Great activities for the whole family. Wonderful church history exhibits.  Be sure to view the First Vision video and the exhibition of the Smith Family.",
  "Great little museum to kill an hour in, learning all about the origins of the Church of the Latter Day Saints. I had almost no knowledge about Joseph Smith and the Mormons when I entered and in one hour was able to learn most of the significant details of this faith community including about its growth and existence in Utah. Also was able to ask several questions of the more-than-willing-to-help volunteers dotted around the museum. Well worth a visit even if you have no interest in joining the Mormon church. ",
  "The Family History Museum in Salt Lake City is an excellent collection of paintings, historical videos, and artifacts on the early history of the Church of Jesus Christ of Latter-day Saints.  Newly opened is an exhibit called Suffragettes that focuses on Mormon women being the first to get the vote in the US but then how The Edmunds Tucker Act revoked their right and how they got it back.  Another exhibit just opening is entitled Temples Dot the Earth.  This is a very interactive exhibit designed for children, but informative for all ages.\n\nDocents are scattered throughout the exhibit to answer questions, But you can choose how much time you want to spend exploring. Most people spend about 1.5 hours.\n\nFree, open Mon - Fri 9:00am to 9:00 pm and Sat 10:00 am to 6:00 pm.  Closed Sunday.\n\nFriendly atmosphere, lovely gift shop.",
  "Wishing to have a clearer insight into the church of LDS, I spent a winter afternoon on the manicured grounds of the beautiful buildings within the walled Mormon area. Missionary Sisters offered a complimentary tour, and graciously spoke about the different areas and their significance. The North Visitor Center housed intricate artwork and furniture, plus a miniature recreation of the new earthquake proof building that will be built during the next 4 years. The Tabernacle contained the magnificent organ with the outrageous acoustics that are famous  worldwide. I especially enjoyed the Church History Museum, a two story building filled with numerous artifacts and remnants of the beginnings of the LDS Church. The journey begins with a wide open theatre film, and continues with the historical development of the Mormon movement. There are interactive displays and educational discussions. My favorite areas involved  the Suffrage Women Rights and their path to voting in Utah. There is an elevator, and a lovely gift shop."
 ]
},{
 "name": "Great Salt Lake State Park",
 "address": "",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/5c/9f/9e/great-salt-lake-state.jpg",
 "tags": [
  "family",
  "learn",
  "walking",
  "nature",
  "learn",
  "learn",
  "walk",
  "hike",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60922-d272251-Reviews-Great_Salt_Lake_State_Park-Salt_Lake_City_Utah.html",
 "source": "TripAdvisor",
 "reviews": [
  "You have got to visit the Great Salt Lake State Park. I cannot personally float in any body of water without a flotation device. I was amazed that I could float easily in the Great Salt Lake. It is an amazing experience. Showers are available within a couple hundred yards of the lake, invaluable for rinsing off the salt layer deposited upon your skin. Like the Nike slogan, Just Do It!",
  "This park includes several paved campsites, a marina, visitor center, bathroom facilities and boat launch. I thoroughly enjoyed the incredible views overlooking GSL and learned a lot about the lake itself from the displays at the visitor center where the staff was very friendly. If one is looking to camp here, note there are just a small handful of sites (book far in advance). Day use and overnight fees apply. There is ample parking and several grassy and shaded areas feature picnic tables.",
  "This place was so beautiful.  We saw antelope, bison, rabbits, and birds galore.  I am from the South and we simply don't have scenery like this.  There is a nature museum/ gift shop where you can learn more about the resident animals.  I went with a friend but will be back with my family!  There is a fair amount of walking and such to do if you choose, but most things are accessible by car.  They do have an eatery there, although we didn't visit it.",
  "I love bringing visitors all the way out to the GSL.  The bison are amazing to watch, they are amazing animals.  It's usually also dry here if it's still snowy elsewhere as you get so much sun.  Nice hikes too.",
  "This is a small State Park and Marina that let's you get close to the Great Salt Lake.  There is a small visitor center with a deck and viewing area or you can go down the path to the lake.  If you have a boat there is a marina.  It is worth a visit to learn about this area.",
  "Was worth the drive out to see and learn about the Great Salt Lake. They have an informative short video and some displays in the Park Services building (modular) on site. When we were there, the ground around the lake was covered in krill and a little smelly, but it was cold enough to keep the smell down. Wear boots or shoes that can handle wet, if you want to walk along the lake.",
  "My son and I took a trip to see Antelope Island and were not disappointed. The drive to the island itself is not that bad, but be prepared for a decent drive if you decided to explore the island. Once you get on the island it is several miles if you are willing to drive to the end of it. About halfway back, there are excellent opportunities for hiking IF you are in good shape. The vertical altitude change for those hikes is over 1000+ feet (if I'm not mistaken), but the view would've been well worth it. We were flat-landers and would've probably passed out before we completed the trek. But, the scenery is beautiful. I would definitely return to hike the trails IF is was in better shape!!!",
  "For a few dollars you can drive and walk around the marina, see the tiny and kinda sad museum, and get some amazing views of the lake and some of its islands plus you can walk right down to the water and along the shore and rocks and salt deposits. I think the views and walking a few minutes to the water's edge and on the mud and brine and sand was totally worth the price of admission alone."
 ]
}]
