[
{
 "name": "Georgia O'Keeffe Museum",
 "address": "217 Johnson St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/c9/13/4c/galleries.jpg",
 "tags": [
  "tour",
  "art",
  "unique",
  "walking",
  "history",
  "art",
  "art",
  "art",
  "art",
  "knowledgeable",
  "organized",
  "learn",
  "art",
  "art",
  "history",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d787426-Reviews-Georgia_O_Keeffe_Museum-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a small museum, well set out with a mixture of O'Keeffe's artwork.  Flower pictures, abstract drawings, bone paintings, photographs, New Mexico landscape paintings and New York skyline paintings along with a short film and timeline of her life.\nThere was also a glass case containing her paint box and utensils.  I loved it!  \nWe downloaded the museum's app on to our phones and so we did a self audio tour which gave us time to properly look at the paintings.",
  "I cannot imagine anyone going to Santa Fe and not seeing the Georgia O'Keeffe museum.  O'Keeffe is the most famous of all the artists that Santa Fe is famous for, and her work is almost universally appealing.\n\nThe museum is fairly small, taking about two to three hours to see.  It features some very fine examples of O'Keeffe's best work as well as highlights of her life and pictures of places that inspired her.  The art is beautiful, and learning about her personal life and her artistic history is fun.  Finding that O'Keeffe decided early in her career to divorce herself from the popular artistic movements of her time and seek her own unique vision and style, and learning that most of her very famous flower paintings were created in New York, before she arrived in Santa Fe, and inspired by the countryside of Upstate New York.\n\nThe two film presentations offered are worth seeing, and relatively short.\n\nThe museum is located in extremely easy walking distance of most of the downtown hotels, and open at 9 AM, allowing you to spend a morning there and have the afternoon for other activities.",
  "When coming to the museum take time to watch the movie chronicling O'Keefe's life and art first to fully appreciate this truly innovative and versatile artist. The museum is quite small with only a few works but does manage to reflect the different phases of O'Keefe's artistic development. Would have liked to have seen some examples of her fashion, she evidently sewed much of her own clothing.",
  "I try to visit each time I am in Santa Fe. Nice space for art and always Georgia O'keefe paintings and photographs on view as well as special exhibits. Starting in mid April 2016 there will be an exhibit of O'keefe's water colors. Need to plan a return visit. Check to see if your local museum membership has a reciprocity with O'keefe, mine does and it is a nice benefit. Also I always enjoy browsing the gift shop, most of the time I find fun treasures to buy as gifts or to keep.",
  "Great if you like Georgia O'Keeffe art.  Convient to plaza and not too expensive.  Get there early and there is likely to be a lecture by the staff and also there is a good movie about her life",
  "A small museum, for sure. But that can be a good thing because you don't get so overloaded with inbound sensory information so as to become numb to the art. And, you don't feel like you have to rush through it to see everything. \n\nDefinitely watch the movies. \n\nNice to be able to take photos. Be on alert for the little signs next to ones that are not permissioned. A nice guard pointed one out to me in a very nice way as I was getting ready to shoot.",
  "This is not a large museum, but it gives a wonderful picture of Georgia O’Keffee’s development as an artist..  we easily spent roughly an hour here.  The staff was very knowledgeable and answered the questions we had with ease.  \nI would recommend a visit to Ms O’Keffee’s home and Ghost Ranch before the museum.  It gives you a well rounded picture of this woman’s journey as an artist that inspired the world.",
  "A very well organized museum that does an excellent job allowing you to learn more about the artist while viewing various works from different parts of her career.  If you have teens interested in art, they'll love it.",
  "We visited this museum when it was not too crowded which enabled us to see each painting clearly. We really enjoyed the video that showed Georgia O'Keefe's life. ",
  "As an art teacher Georgia O'Keeffe was an artist I had my students study.  It is amazing the contrast of her life and art dividing her time between New York and Santa Fe.  This is a must see museum not only of her art, but of her life and time line of history that shaped our country.",
  "Not a giant art gallery but the 8 minute video of her and the history gets you ready for 8 rooms of wonderful pieces. Was shocked how varied the styles she had during her long life. very close to the plaza so easy place to visit. "
 ]
},{
 "name": "Santa Fe Plaza",
 "address": "100 Old Santa Fe Trail",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/b6/99/d1/santa-fe-historic-plaza.jpg",
 "tags": [
  "art",
  "historic",
  "history",
  "food",
  "historic",
  "food",
  "historic",
  "music",
  "walk",
  "walking",
  "walk",
  "art",
  "history",
  "unique",
  "history",
  "food",
  "art",
  "eat",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d107439-Reviews-Santa_Fe_Plaza-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful plaza surrounded by lots of shops mostly upscale, selling clothing, footwear, jewelry and art, and numerous restaurants, some very casual and some upscale, plus several historic hotels, such as the La Fonda hotel. Great people watching, along with several historic church’s.",
  "Car show was going on so streets were closed to traffic\n This place has everything working for it, I applaud the city father's for this amazing gem! History, the arts, good food, shopping, music,etc...what more could you ask? Sunday seems like a great day but I would check event calendar. We loved it and can't wait to come back and shop!",
  "How can you experience Santa Fe without a visit to the Plaza?  You can't!  It's been the center of life in The City Different for hundreds of years!  What's there?  An historic monument in the center, the bandstand which often has performers, food carts, artists in booths on Palace Ave., the Native vendors across the street on Palace, benches, people, dogs, and at night, fairy lights in the trees.  Do not miss the Plaza!",
  "Perhaps the center of the universe, one cannot go to Santa Fe rightly without a walk around there historic Plaza.  The life of the city and much of the state sort of revolves around the Plaza, from historic hotels and restaurants, to Native American silversmiths and other craftspeople displaying their wares in front of the Palace of the Governors.  Often, there is New Mexican music playing in a bandshell.  Don't miss the monument in the middle of the plaza to \"The heroes who have fallen in various battles with the _______ Indians in the territory of New Mexico.\"  Where in 2017, a thoughtful citizens chiseled off the word \"savage\" before \"Indians.\"  The City Council showed great judgment to simply leave it that way!",
  "If you are visiting Santa Fe, you have to visit the Plaza. It's just a park looking area with benches. But the city is built around it. Take time to walk around and visit all of the shops. Most are really cute, local shops. There are a couple tourist traps and chains, but they are pretty hidden. Subway and Starbucks have MUCH better local alternatives!! My friend and I spent a whole afternoon just walking around and looking at shops. A lot of them have unique stuff. There are attractions on and very near the plaza, such as Palace of the Governors/New Mexico History Museum, New Mexico Museum of Art, Loretto Chapel, and the cathedral. There are several streets right off of the plaza that also have nice shops and attractions. We stayed about a 5-10 minute walk away, which was perfect. There are places located on the plaza but we were fine with walking a few blocks. There is limited parking, so staying nearby is a must unless you're on a very strict budget. While we visited one day, there was a huge demonstration and march to the capitol building, which was cool to see. One thing not to miss is the Native American artisans who are set up in front of the Palace of the Governors. You can't miss it if you're at the plaza. They have good wares and will bargain with you. We found a few very unique gifts there. They have strict guidelines for setting up shop there, so you can be guaranteed that you're buying authentic stuff. Just go!",
  "Take a stroll in the plaza.  There are so many stores to stop in, or just window shop.  Also, the many street vendors offer a large selection of hand-made gifts and food.  Depending on what time of day you go, there are also musicians that are out.  Parking may be the biggest problem you face, but it is worth it to enjoy this downtown delight and enjoy some history as well.",
  "The plaza and nearby buidlings retains much of the historical feel and architecture of the city and hasn't been overly modernized.  A good place to stop to decide what you want to see in the area.",
  "People were always in the plaza, visiting, just relaxing on the benches, and enjoying the scenery. Often, there were musicians on the plaza entertaining the people. ",
  "We got to the plaza early since shops don't open all at once. very nice place to sit and watch vendors prepare their spots, benchs galore.",
  "The Plaza is a quaint area that has everything. The shopping has it all from beautiful art and jewelry to a five and dime. There are many options to eat as well. The Loretto Chapel and St Francis of Assisi are located there too. ",
  "If you're looking for a place to eat or a place to shop, this is the area to visit. There are bars, restaurants, ice cream, coffee and a mini mall to browse through."
 ]
},{
 "name": "Canyon Road",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/24/28/59/siford-gallery.jpg",
 "tags": [
  "art",
  "walk",
  "art",
  "walk",
  "art",
  "nature",
  "unique",
  "walk",
  "art",
  "art",
  "walk",
  "tour",
  "art",
  "knowledgeable",
  "art",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d117221-Reviews-Canyon_Road-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "A short walk from downtown this mile or so of art galleries offers a bit of everything, from crafts to really good fine art. We found happy surprises in nearly every one. My painter friend and I are art lovers so looked at everything with interest and took two days to do it, which was made easy by the presence of good restaurants and a wonderful tea house. We never knew what was behind the next doorway, in the next room and often were wonderfully surprised.",
  "Aww the joy of spending Christmas eve on Canyon Road , the hot cocoa , the bon fires , Lights and joy of the many folks singing and real community event !! It was a spectacular evening ",
  "A great walk to view wonderful works of art, visit shops, and see and purchase something different, contemporary, and or southwest.",
  "Was not sure totally what to expect.  Such an amazing collection of art and galleries to see. The sculptures are fantastic. Loved the eclectic nature of the street.  Watch out for cars as it is a very narrow street.",
  "Plan to spend the day strolling the shops and galleries on Canyon Road.  There are many very exclusive but also unique galleries, offering everything from magnificent yard kinetic wind scupltures to oil painting, Navajo rugs, pottery, bronze sculpture, and jewelry - both new and antique.  Do no be aftaid to just browse and talk to the staff - if it is not busy in the gallery, the staff is very helpful, even if you aren't intending to spend $$$.  We learned a lot about Navajo rugs and antique silver/turquoise jewelry during our sojourn.  There are also some upscale retail stores for clothing, etc.  but no chain stores - those are for malls.  Be sure to wear or bring a rain coat, as the weather in the winter can change very quiclky and often.  In the winter, not all establishments are open on Sundays, but enough were open for us to enjoy.  Spoiler Alert - do not bring a non-shopper on this walk with you!",
  "There is so much to see here of all types of art, its impossible to take it all in almost. So, take your time and enjoy the beauty all around. Parking can be a little tricky, use the public pay lot or maybe the public transiet.",
  "We took a trolley tour of Santa Fe and the Canyon Road area was part of the tour. I wanted to go back and walk through the area but we didn't have enough time. I was there many years ago and loved that area. It looks more crowded now though, many more houses are art galleries now, not homes anymore. ",
  "It was a cold, dreary day and we did not see much action at the galleries so we just drove thru.  Would love to have come back on a sunny, warm day and walked from gallery to gallery",
  "Had a ball going in and out of multiple art galleries. Some of the art gallery staff very knowledgeable about the artist’s works, others couldn’t be bothered looking up from their cell phones/laptops. Be aware-lots of uneven, cracked sidewalks-not easy on the feet!",
  "if your into art then drive up this road. its about 8 blocks of none stop art galleries of all types and sizes. sprinkled in are a few bars and restaurants. find parking on the street and walk as the public sites charge an hourly rate. this is a four hour destination",
  "We were only in Santa Fe for the day, so we could only allocate a couple of hours for the Canyon Road district.  We barely scratched the surface of maybe a quarter to a third of the galleries.  Great artists!"
 ]
},{
 "name": "Santa Fe Opera House",
 "address": "301 Opera Dr",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/78/93/73/santa-fe-opera-house.jpg",
 "tags": [
  "unique",
  "theatre",
  "family",
  "performance",
  "delicious",
  "performance",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d107440-Reviews-Santa_Fe_Opera_House-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Took part in the opera festival and was not disappointed! My first visit to the opera house did not prepare me for its stunning design and location. It's built with two sides and a portion of the stage open to the fabulous mountain views.\n\nMost operas begin at 8 pm so you can see the sunset colours play over the sky and mountains.\n\nSeats are equipped with brand new technology providing your individual screen displaying the subtitles. Ample leg room and comfy seats round out the experience.\n\nThe theatre opens to several plazas to stretch your legs during intermission and bar service is also provided. An excellent gift shop with quality items will tempt your purse.\n\nA unique feature I thought was reserved for sports games only were the parking lot tail gate parties before the opera begins. Everything from draped tables with champagne and roses to picnic fare was enjoyed by many enthusiasts. You could tell they were having fun.",
  "We saw Madame Butterfly and it was amazing!!! Fun to tailgate before. Beautiful venue!!! Great experience for the family. ",
  "Last night, we once again experienced the magic of the preview dinner and the most beautiful opera, Madame Butterfly on it's opening night. Perfect weather meaning gorgeous sunset, views out the sides and back of the stage of the beautiful New Mexico scenery. \n\nDinner was once again delicious (choice of fish or beef with wine included) and an excellent background talk by Kathleen Clawson. We will come  next week just for the dinner and preview\n Highly recommended.\n\nButterfly performance with Kelly Kaduce and A.J. Glueckert was pure artistry. Everything was perfect.\n\nIf you go to Santa Fe Opera, spend the money for the preview dinner. It is well worth the cost and experience. Exit off of Opera Drive. Enjoy.\n \n ",
  "Wow ! this is one of the most outstanding opera houses in the world. They are very inovative in bring in some of the best artist from all over the globe. If you are looking to be throughly entertained you should not miss Opera Season in Santa Fe. The backdrop of the open stage is the Jemez Mountains in the distance. Evenings can be a bit cool, so be sure to bring a light jacket. No need to dress up, this is an open air oper house so be comfortable.\nEnjoy !",
  "Go. An outdoor opera house where the acoustics will amaze. The opera is held in the evening so take a jacket, but go to your seat early to watch the sunset go down behind the stage. Opera AND a Santa Fe Sunset ... WOWZAA!",
  "Wow ! this is one of the most outstanding opera houses in the world. They are very inovative in bring in some of the best artist from all over the globe. If you are looking to be throughly entertained you should not miss Opera Season in Santa Fe. The backdrop of the open stage is the Jemez Mountains in the distance. Evenings can be a bit cool, so be sure to bring a light jacket. No need to dress up, this is an open air oper house so be comfortable.\nEnjoy !",
  "I don't like opera and didn't really enjoy the one I saw here. But I've seen a few popular acts here, Robert Earl Keen being the latest, and it's fantastic and beautiful, and the sound is great.",
  "Santa Fe Opera is one of the best places to see any performance. It is world renowned and deserves it. I love its southwest open air atmosphere and the sound from the stage is impeccable. We saw Renee Fleming and enjoyed the whole evening, even though we had some rain and thunder. It just made it all the more dramatic.",
  "A must experience for Opera lovers- open air and protected at once. The sets were gorgeous and complimented by the beautiful natural setting. We were lucky to have both a sunset and lightening (far away) to add to the set. The performance is usually top notch and can be cutting edge. Laid back or dressy .",
  "Quite the venue — by virtue of its setting and très cool architecture. We loved our musical event which was as far from opera as we could swing it. We saw John Fogarty and his band. Sound was good, and we were in the mezzanine. Access and parking was smooth, too. ",
  "Oh my, the Santa Fe Opera House lives up to its hype. The theater is gorgeous, blending into the beautiful vistas perfectly. The open air only heightens the opera in my opinion. The acoustics are fantastic. I would caution against sitting on the far sides where one's view may not take in the complete stage. Also, bring a light sweater or a throw, for the evenings can get chilly in the high desert. I hope to return again next season."
 ]
},{
 "name": "The Cathedral Basilica of St. Francis of Assisi",
 "address": "131 Cathedral Pl",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/ad/6c/57/the-inside-of-the-basilica.jpg",
 "tags": [
  "tour",
  "history",
  "history",
  "history",
  "historic",
  "history",
  "sightseeing",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d123657-Reviews-The_Cathedral_Basilica_of_St_Francis_of_Assisi-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "It is a beautiful church, with its inspirational stained glass windows, grand arches and baptismal. Then there was the docent, Mary, who made our visit very special, by giving us a personal tour that was educational, explaining about La Conquistadora, learning the history of how it became a Basilica, the history of the relics, the history of the stained glass windows especially the story of La Conquistadora, how she is cared for, the celebrations that are around her. There was so much more. It was a sacred visit and we felt so connected to the cathedral and the holy spirit residing here. Thank you for a supernatural experience. \n\nIf you can join a tour of the cathedral it is well worth the time spent. ",
  "Stopped at the Cathedral to admire the history and attend Mass last Saturday.  Loved the architecture and history as well as service.  Glad I went.",
  "Stunning interior and exterior architecture, beautiful statuary inside and out, traditional stained glass including a beautiful rosette and dove, and a formal baptismal font. An iconic destination in Santa Fe.   ",
  "So much beauty and history. Open to visitors; check service times so as to not interrupt worship. Houses the oldest Madonna in the United States.",
  "Go in the evening to get so great pictures of this church. The building has historic as well as amazing character. Be aware this is a place of worship so keep your voice down and be aware of people praying inside.  ",
  "This is the Cathedral Basilica of St Frncis of Asisi and is well worth a visit.  Congregation was founded in 1610 and first church built in1610. Present church built in1886 and rededicated in 1986.  History, worship, awe and glory all in the visit. I praised Godfo His son as I walked through this church.  Don't miss the Statin of theCrss Praer Garden sculpted by Gil Singleton.  Each station brought me closer to Jesus. These is  the most realistic presentation of Jesus' journey to the cross I have ever seen. Praise God that this form of creativity brings us closer to Him.",
  "Unbelievable architecture and artwork. Definitely worth the time if you're in the square. The people are very warm and welcoming.",
  "A beautiful and peaceful cathedral.  Nice place to escape and relax after shopping and sightseeing.  What a blessing!",
  "Lovely place to pause and enjoy the light from the stained glass windows as it travels across the room. The gardens are really peaceful and restful.",
  "Quick stop into church, my friend was curious about my Catholic faith and there was a mass, so it was perfect for a discussion ",
  "The cathedral is so beautiful! As someone who was raised Catholic, I found it to be a peaceful and glorious space. It is free to see, however be prepared to pay $10 if you park in the adjacent lot."
 ]
},{
 "name": "Meow Wolf",
 "address": "1352 Rufina Cir",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/18/de/ef/there-is-a-diver-behind.jpg",
 "tags": [
  "art",
  "art",
  "kids",
  "unique",
  "music",
  "kids",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d10084963-Reviews-Meow_Wolf-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very fun immersive experience where you are encouraged to explore and interact with the rooms you encounter as you attempt to piece together the story line that unfolds all around you.  There were people of every age wandering about and having a great time, we made the trip to NM primarily to visit Meow Wolf.  Highly recommended!",
  "The museums, dining and Canyon Road are all interesting and well worth the time and money, but Meow Wolf is definitely the place to have the most fun in Santa Fe.  This is a great place - sort of Alice in Wonderland meets psychedelic trip meets amusement park fun house combined with multiple art exhibits from local artists.  Allow several hours to explore all of the passages and rooms.  When you thought you have seen everything you find a new area to explore.\nWe were there when it opened at 10 A.M. and it was not crowded, but by noon it was getting very busy.",
  "I visited Meow Wolf in November 2018, and I'm still enjoying my memories of the place and even dreaming about it! An amazing mix of art gallery, fun house, haunted house, and sci-fi adventure, I am desperately jealous of folks that live within 100 miles of it! I will be visiting again when I can and look forward to seeing the new upcoming locations!",
  "Wonderful day exploring the exhibit - I'm still not sure we found every corner of the place.  We live in Colorado and can't wait to see what the artists have come up with for the Meow Wolf in Denver.",
  "it was silly for me as an adult but kids would enjoy going from one maze to another. One room goes into another. It did not make sense to me",
  "We knew nothing about the exhibit prior to arriving in Santa Fe and walked over here at the recommendation of a fellow traveler who had children about the age of ours.  Turn's out it's a really unique and strange experience.  To get in, it's best to buy tickets in advance ($30, no discounts for teens) but we were able to get them as we waited in line.  They have timed entries which were 20 minutes apart while we were there, so we scanned a QR code on a sign in front and picked a time about 30 minutes out. They have separate waiting lines in front with the 20 minute apart times posted in them.  Once inside, keep up with your kids or arrange to meet them at a specific place and time as the 20,000 ft space is a labyrinth.  There's a theme and plot to the whole exhibit , which consists of dozens of rooms and spaces with different motifs, but it was so crowded when we were there that it was difficult to follow.  So, we spent a couple of hours checking out all of the interactive, audio, and visual exhibits while our kids did the same on their own.  After a couple of hours you will have probably seen everything or gone into sensory overload.    As an adult, I would have enjoyed it more without all of the unattended kids running around grabbing things, but, in fairness, they all seemed to be having a great time.  \n\nOnce you are out of the exhibit space, they have a nice coffee bar which also sells mixed drinks, wine and beer after 4 p.m.  \n\nIf you're a live music fan, check their calendar to see if any bands are playing - the stage is inside the exhibit and a great small venue.  It held 300 or so people, so you'll be near the bands while they play.  The show we went to was 18 and up, not all ages, and there are no drinks allowed inside the exhibit, but there are a couple of outside bars with access in and out for 21 and over guests.",
  "We went and enjoyed our time. We only spent about 90 minutes.  It was strange and fun! Lots to see and do. You can't describe the visit. So if you like new things, go check it out!  It is not a location that I would insist you go see! There are other experiences more fun and memorable. But that is just my opinion. ",
  "We had no idea what was going on or how to prepare for our trip. Either I missed it or there isn’t enough focus on HOW to obtain tickets. Tidbit: you gotta buy your ticket before you even show up, then you get in the designated line. \n\nIt was still a blast to walk through and immerse ourselves in the exhibit. Loved it. Just wish it was more clear about the way ticketing worked. Oh, and it’s $30 a ticket, yes, $30."
 ]
},{
 "name": "Museum of International Folk Art",
 "address": "706 Camino Lejo on Museum Hill",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/9f/7d/c1/lots-of-action.jpg",
 "tags": [
  "art",
  "art",
  "art",
  "food",
  "eat",
  "kids",
  "art",
  "art",
  "free",
  "tour",
  "tour",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d135699-Reviews-Museum_of_International_Folk_Art-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was an incredible museum with an amazing collection of miniatures -- over 10,000 o display that were beautifully presented.  I would go back to this museum in a heartbeat and I don't say that often.",
  "This by far is my FAVORITE museum in Santa Fe...I grew up going to this museum and still love to visit it now...their traveling exhibits are always awesome and the permanent collection is fun to browse on every visit...not to mention that the views of Northern NM are awesome from Museum Hill...in town during the International Folk Art Market?...the Market is a MUST for any art lover and your ticket to the market will get you into the museum too.",
  "Amazing museum located on the Museum Campus that celebrates the role of folk art in different cultures.  It beautifully demonstrates the commonality of different themes in very different cultures juxtaposing them so that the marked similarities are obvious. It also shows the role of toys in teaching children role playing before they assume adult life.  There was an excellent exhibit on the use of beads in different cultures as well as an exhibit on folk art as a means of healing community building in the face of great traumas.  This place is worth multiple trips.",
  "A wide varieties of countries are represented. Staff has done a great job of creating displays for art (dioramas of holidays, the Old West, small towns, etc.). Eat before you get there; the cafe is overpriced and the food is ordinary. The outside area is spacious, with places to sit or for kids to run around. Museum Hill is close to town and easy to find.",
  "So, we met our daughter and grand children there late one afternoon maybe 90 minutes before closing. Parking was easy and to say the plaza is spectacular is an understatement. Wonderful lay out, views, art. My disappointment came with the cost of admission. Ten bucks. No senior discount. Much cheaper for state residents. So, I stayed outside (folk art is not my passion) with my son in law and we enjoyed the plaza and a beer in the little restaurant. Other museums in Santa Fe seemed to be more accomodating to we out of towners and seniors and staff members were more friendly. \n\nSanta Fe is a beautiful place and fun to visit in the off season. By and large one can find much to do and see and there is a wide variety of cafes and restaurants. But some oddities, like no public rest rooms near the main plaza, a sometimes frustrating parking system (take a deep breath before using it for the first time and hope there isn't someone from Kansas ahead of you).",
  "A pretty drive (watch out for the many traffic calmers on the winding road) leads to a group of Santa Fe museums. The MIFA is the largest of the group. Enjoy the outside patio and labyrinth, then enter. The docent tour will focus on the permanent collection of folk art. This collection is tough to describe, because it is a diverse group of embroideries, wooden and clay dolls, weavings, metalwork; decorated paper, porcelain, ceramics, in short, every medium (at least everything I could think of) a folk artist has used to make folk art. The printed guide is difficult to follow, so it's best to sign up for a free docent tour. When I visited (midMarch 2013) there was also a fascinating exhibit of Mexican, Spanish, and colonial New Mexican kitchens (the exhibit purported to be about chocolate and mate, but I think it was misnamed) and a beautiful display of late 19thc and mid20thc Amish quilts. The gift shop is worth perusing because it is chock-full of reasonably-priced folk art - paper, jewelry, scarves, clay, beads, etc and books about the same - not the made in China junque that is sold in touristy souvenir shops. \n\nMuseum employees are very friendly and enjoy pointing out their favorites in the museum and giving advice about other Santa Fe attractions.",
  "My sister and I enjoyed our visit. The various exhibitions were well-curated with adequate background information provided. And Museum Hill is worth the quick trip out of town.",
  "This was a great way to spend an afternoon. We were hereover the Thanksgiving weekend with our 8 yr old Grandson. It was an inside day for Us, very cold. This weekend was good to go! Local artists were showing their work and we had good fortune to meet and discuss!  having a GPS is most helpful for finding the Museum. Well worth the trip!",
  "Thousands of dioramas (miniatures) from all over the world. The museum owns 10X more of these (over 100,000!) than they can display at once so they rotate them. Unlike many less-interesting museums that prohibit photography, this museum actually ENCOURAGES it! An amazing way to spend an afternoon.",
  "We made it to the museum just in time for the docent tour (2:00) which added so much to the experience. The museum is fantastic and appealed to my 9 yo grandson too. We never saw everything but that’s ok as I will definitely go back!!",
  "Did not have high Hope's for this place and ended up spending 2 hours and could have stayed another 2.   Thousands of pieces of folk art from all over the world. The special exhibits were pretty interesting also.    Go see it.  "
 ]
},{
 "name": "New Mexico State Capitol (Roundhouse)",
 "address": "Paseo de Peralta and Old Santa Fe Trail",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/04/78/46/new-mexico-state-capitol.jpg",
 "tags": [
  "art",
  "art",
  "creative",
  "free",
  "art",
  "unique",
  "art",
  "walk",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d534384-Reviews-New_Mexico_State_Capitol_Roundhouse-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "went late in the day but got to see all legislation areas and all three floors of fantastic art of all kinds. no matter your taste they have something there. all local New Mexico artists. very open and easy to see in an hour or so",
  "We wandered in and around this unusual State Capital building.  The Legislature was in session so it was bustling inside.  The design fits the area well, and large legislative chambers are always interesting to peak at, however there isn't much for a tourist to see or do inside.  Worth a 30 minute look.",
  "AAA Guidebook stated there was a permanent collection of art created by New Mexicans..and we had some time in our schedule.\n\nIt was better than expected. First There was a temporary exhibit entitled Out of the Blue, featuring contemporary fiber art, that opened days before our visit. Very interesting and creative art, generally seemed to be revolving around a water theme.\n\nWe then visited the permanent exhibitions on the upper floors of the state house. Again some very interesting and singular pieces of art. \n\nIt is worth at least and hour of your time and it was free.",
  "This is a must visit by all who wish to see a very unique capital. Art work an artistic design. Watching democracy in action",
  "This should be a must see. The art around two floors of the state capital was amazing. What a collection! Guests are free to roam the halls and enjoy the work. This is also a beautiful building. It is a .8mile walk from the Plaza or you could drive there.  We didn’t read much about the Capitol. You’ll spend about an hour at the most visiting."
 ]
},{
 "name": "El Rancho de las Golondrinas",
 "address": "334 Los Pinos Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e1/9e/b7/trip-to-el-rancho-de.jpg",
 "tags": [
  "music",
  "history",
  "food",
  "history",
  "kids",
  "historic",
  "history",
  "learn",
  "walking",
  "family",
  "history",
  "drink",
  "field",
  "food",
  "family",
  "nature",
  "learn",
  "walk",
  "tour",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d117438-Reviews-El_Rancho_de_las_Golondrinas-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "El Rancho de Las Golondrinas in Santa Fe , is a wonderful place to visit , it just not only offers an authentic experience of life style that bring you back a few centuries, we also learned about the culture , history and traditions that families kept alive till today . We not only busy once but so far about 5 times !!! It is ton of fun. The staff are amazing and they organize diversity of eventd full of fun activities . For instance, wine festival , Harvest Festival and Halloween celebration was outstanding amazing with customs , story tellers , Native dancers , Flamenco show , food , music so much fun !!! Highly recommended for families, group friends , tourist or locals . Lovely place to visit !!!",
  "A living history museum with quarterly special events such as the Fall Harvest Festival with sheep shearing, or apple press into cider, weaving and tin jewerly making.\nSpring offers knights jousting, falconery, fairy land and such delights for kids of all ages.",
  "South of Santa Fe lies an enchanting spot acres and acres to explore and experience  New Mexico history -crafts -Historic buildings -fields of corn adobe houses replication of colonial life pure delight",
  "This is a great partially recreated working rancho.  They have something scheduled year round and it is always wonderful.  It gets very very warm during the summer in this little pocket, so go early and take hats.  Learn to make tortillas etc. and see how people lived.",
  "El Rancho de las Golondrinas serves as a wonderful field trip for various elementary and middle school grades and an informative, destination for families and New Mexico history buffs. I have been there for both purposes. When Civil War re-enactment folks took it over, I was fascinated. Several significant Civil War battles were fought in New Mexico--victories by Union soldiers and the New Mexico Militia which prevented the Confederation from making inroads to Colorado and ultimately, California and access to incredible resources. On a hot day with a hundred students who may or may not have the right shoes, water or food, it can be an exhausting place to visit. Make sure, if you are going on a field trip, that you have a \"base camp\" set up with an adult, water and first aid--have students come prepared with water, hats, walking shoes and layers of clothing. If you are going on your own or with your family, also make sure you wear layers, a hat, and sturdy shoes. Wheel chairs, strollers and walkers are not easy to manipulate as the location is hilly with stair entrances into places like the old school house, mill and other sites. Check to see if the snack bar is open on the day you are visiting. Otherwise, make sure you bring the food and drink that you need for an outdoor excursion. Next time I would bring a sketch book and water colors as it's a lovely place to draw.",
  "This living museum is open over the warmer months and you will walk a bit, play a bit, commune with nature a bit, and learn a lot.   Very family friendly fun, good way to spend several hours outside a few miles out of town.  Wear sunscreen and bring water, expect to carry the kiddos some as they wear out.   No dogs allowed",
  "Golondrinas is a recreation of early pioneer days in New Mexico. There are docents dressed in historical garb, involved in daily activities (like weaving and spinning wool) of the time and ready to answer your questions. ",
  "They have lavender festival every year. Just amazing. Classes on how to grow lavender. Products containing lavender such a fish rub. Yummy from the Bar Be Q at home. Amazing people        to talk to and amazing artists. Please look up the date. It's in the summer. You will be thrilled you did.",
  "Great historical adventure! A real life view of a very basic way of life!! We has an excellent and informative tour guide.  Very enjoyable!!",
  "We arrived mid-day and began the self-guided tour using the map provided.  A reduced fee is charged for seniors.  We also purchased the $2 guide which added more information to our experience.\n  \nThe grounds are expansive.  After exploring the ranch structures at the front of the property, we walked the paths to other areas which included a wheelwright and carpenter shop, a school house, a blacksmith shop, a meeting house, and another village.  We easily spent two hours -- would have stayed longer, but rain arrived.  We visited the small museum and the gift shop; since it was still raining, we moved on to our next destination.  The time was well-spent.  El Rancho de las Golondrinas was a good introduction to New Mexico.",
  "This living museum is a great place to visit any time, with or without the family. In the summer, there are many weekend events but the ticket prices are fair and the experience fascinating and educational any day."
 ]
},{
 "name": "Loretto Chapel",
 "address": "207 Old Santa Fe Trail Between Alameda and Water sts.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/c7/c1/34/loretto-chapel.jpg",
 "tags": [
  "history",
  "history",
  "tour",
  "historic",
  "cheap",
  "walking",
  "history",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d123660-Reviews-Loretto_Chapel-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Famous for the spiral staircase leading to the choir loft and the sweet story surrounding its construction, this Gothic chapel, modeled after one in France, is a treasure, with a rose window, an elaborate altar, stunning ceiling, and beautiful stained glass, carvings, tile work, and sculpture. But you will marvel at the staircase, which appears to have no support. ",
  "We found the history of the chapel and its amazing staircase very interesting and the gentleman who welcomed us at the entrance was very friendly and able to answer our questions. Definitely recommend stopping by when visiting Santa Fe.",
  "The chapel is very beautiful and the suspended winding stair case is something to see... there is a small fee but it’s well worth to see the history of this place..",
  "When doing a walking tour (the best way to do it) of the historic area of Santa Fe, do NOT miss Loretto Chapel. It is stunning outside, but don't miss also going inside. Especially don't miss \"the staircase\" & the story behind it. If you are a first-time visitor to Santa Fe, your first stop should be the visitor center, to pick up a walking tour map. Then set out on foot & enjoy yourself! Be aware that parking is difficult to find near the historic area, so grab the first empty spot you come by. Bus service into the historic area is cheap & frequent, so if visiting during a particularly busy time, we park near a bus stop & take the bus.There are bus stops all along Cerillios Road, which is a main road into Santa Fe from the south.",
  "This was a spur if the moment decision-which turned into a very fun and interesting visit. I loved learning about the Chapel, the person who built the staircase and history of the area. The price was $3 which was worth it, nice gift shop and people were exceptionally friendly. Doesn't take long, so run by for some history of the chapel and Santa Fe!!\n",
  "A short visit is a good idea if you are in Santa Fe. Beautiful interior with some great architectural features.  Take the time to listen to the information, it is worth the 10 minutes to get to know this gem. ",
  "Wonderful story of the chapel and the building of the staircase to the choir loft.  Put this near the top of the list.",
  "I'd heard the Legend of Loretto Chapel from a co-worker who visited a decade ago and finally got the chance to see it for myself. The Basilica around the corner and a lot of other places had closed due to the alleged COVID-19 pandemic, so it was lucky for everyone that Loretto Chapel is now privately owned and no longer a Catholic church. The $5 entry fee wasn't bad to see a typically ornate old Spanish-influenced  chapel, but the staircase really is the star of the show. It's beautiful, and the legend adds a little bit of mysteriousness to its beauty. i recommend it.",
  "This was a quick stop on our trip to Santa Fe.  The story of this small church is fascinating.  We enjoyed the church and the gift shop.",
  "This lovely example of old world craftsmanship isn’t to be missed. I don’t want to spoil it, but there is a fascinating legend about it.\nThere is also a gift shop with lots of interesting items.",
  "This small chapel is unique because of it's spiral staircase.  The chapel itself ifs very pretty, no doubt, but pay the $5 admission fee to see and listen to the legend of how the spiral staircase came to be built. The story is played quietly on speakers in the chapel on a five minute or so  loop and it's truly amazing."
 ]
},{
 "name": "Ski Santa Fe",
 "address": "Highway 475",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/82/8d/cc/powder-day-at-ski-santa.jpg",
 "tags": [
  "organized",
  "family",
  "kids",
  "food",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d124601-Reviews-Ski_Santa_Fe-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a great couple of days on the mountain. We were lucky enough to have our children home for semester break. We had great snow, sunny days and pleasant helpful staff during our trip. Love being able to ski at such a beautiful spot.",
  "For our first family ski trip we chose Ski Santa Fe (we also stopped by Taos on this trip). Between Taos and SSF I'd take SSF. SSF looked a lot better organized and kid friendly. Their kids ski school had lots of staff who took good care of our two. We'll definitely be back.",
  "We skied a half day on Christmas. Staff was friendly and plentiful. We were able to quickly move thru the rental process and get to the chairlift. Staff was efficient in keeping lift lines short. The snow was good on the open runs. A nice place for beginners to ski.",
  "We snowshoed at Alpine Vista and it was awesome.  The only downside was some dog poo here and there.  Super quiet and great views.  REally nice people.  Go early to get a parking space as it is limited.",
  "This ski slope has the right balance between challenging and easy runs. There is something for everyone. The lines can be long after a storm, so get there early on those days. Also, be careful driving up and down the hill after it has just snowed because it is very steep. Ski Santa Fe is very good about updating their website with the latest snow depth and the number of runs open.",
  "Our first ski trip. Arrive early because it takes awhile to get boots that fit (go up one size). We took the lessons. They were helpful but the instructors move quick. A few people in our group felt as if they were left behind. It was not too busy, we didn't wait more than a couple of minutes for a lift. There were personnel on the mountain to slow people down near the intersections. We'll be back.",
  "We went here for spring break March 13-20 week but due to Coronavirus they closed Ski SF.  If you were hoping for snow you can still head up the mountain and pull off on the right at Big Tesuque in Hyde Park. It was beautiful and had feet of snow for sledding and play. We stopped at the ski shop before heading up and bought sleds for $15. The ski shop, Cotman’s (?),  was closed yesterday too though, so call ahead if you need gear.",
  "First time skier! Ski Santa Fe offers group or private lessons, and I spent the day with my instructor (Shane) and a small group. Shane was patient and got us on our skis quickly. By the end of the day, I was flying down the green hill.\n\nSki Santa Fe provides lots of lunch options in their cafeteria. Prices are a bit expensive, but the food satisfies and tastes great!\n\nParking is just down the hill a bit. Brings layers for varying mountain temps. Also bring cash for locker tokens. And if you want to drink, BYOB in a cooler in your car.\n\nWe will definitely return. ",
  "During the fall of 2019, two photographer friends and I went in search of yellow-leafed aspens in northern New Mexico and southern Colorado to shoot. We ventured into southern Colorado first, but we were too late: most of the aspens had already lost their leaves.\n   So we drove to Santa Fe and looked toward the ski basin, easily visible from many points in the city, and we could see massive swaths of yellow. So we located the road to the ski basin and began our ascent.\n   I had been on that road 35 years ago on a late winter ski trip, so I didn’t have a good frame of reference for what we would find. But were we ever in for a treat!\n   The road is paved all the way up, and there are plenty of pull-over-and-look spots along the way. The afternoon we went was clear and the pavement was dry, so traveling was easy and the vistas were breathtaking. Aspen leaves “quake”, and since they are translucent and shiny, they shimmer and glow with the sun behind them.\n   There is a park at the entrance to the basin itself that is ideal for picnics, and many aspens are on lawns instead of slopes, making taking beautiful group photos easy. Since the forest has evergreens too, the pallet ranges from dark green to spring green to bright yellow, with an very occasional peach-colored tree here.\n   I suggest you venture up there some fall. Be sure to take a windbreaker, water, and sunscreen, and at least some fruit.",
  "Back here for the first time in 15 years. Fantastic skiing conditions. Great adult beverages at Totemoffs. A bit chaotic and crowded on the Saturday of Presidents Day weekend. I'll be back.",
  "no crowds, reasonable prices and excellent multi-day program for locals.\nDuring the week, you will not encounter lift lines, nor crowded runs."
 ]
},{
 "name": "Museum of Indian Arts & Culture",
 "address": "710 Camino Lejo",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/51/15/20/greeting-statue-outside.jpg",
 "tags": [
  "free",
  "art",
  "history",
  "unique",
  "creative",
  "art",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d110198-Reviews-Museum_of_Indian_Arts_Culture-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are interested in Native Pottery, its History and Tribal/Pueblo Origins, as well as seeing art quality new pottery...you will love the new exhibits.  We were very relieved that the exhibit halls are not as over-heated as they had been in the past.\n\nThe Gift Shop has a wonderful selection of Native art of all kinds...jewelry, pottery, burden baskets, kachinas, soft sculptures, books and cards, plus other unique and creative art pieces.  Its very fun, reasonably priced and tax free.  There are also Christmas and Holiday ornaments, and cards right now.  \n\nMuseum pass holders of various tiers receive 10% discounts on everything.  20% when special sales dates are announced.  Check out the Sponsors Couple tier...it gets you into hundreds and hundreds of other museums all over the States.  Its a real bargain if you can take advantage of it.",
  "If you have any interest in American Indian culture and arts, this is a MUST see museum.  Give yourself around 2 - 3 hours.  Do not miss the gift shop - a great way to help support American Indian artist.\n\nThe pottery room is one of the most impressive displays of pottery in any museum throughout the world.  Watch the short film about how the pottery is made.  Then slowly go through the room looking at the pieces and those who the pottery. Then, find a style you like, an artist you like, and try and find ways to purchase their pieces (or the generation or two or three after the person you saw).",
  "The Museum of Indian Arts and Culture was my favorite on \"Museum Hill, \" but we enjoyed others too.  The outdoor bronze sculptures were amazing and the videos of pottery making were fascinating.",
  "We visited this museum one afternoon and enjoyed the art very much. I learned so much from the artwork and some of the traditions that the Indians had from early stages. ",
  "This museum is completely amazing. The exhibits do change during the year. I saw a 5,000 year old pot! if you have a guide which I did first time your education on Native Americans has a whole new perception. Not miss it. I go about 4 times a years just to sit in those spirits",
  "We will be back, because I know we missed things. Just so much to take in. The native art was breathtaking. Understanding pottery making was very educational. One of the most important stops you can make in Santa Fe",
  "As visitors from afar we appreciated this museum teaching us about the native cultures of the Southwest. We especially liked the video of Maria Martinez & learning about her traditional pot making.  The climate & geography are reflected in the various talents, traditions, & tastes of Southwestern art in this museum.  Thanks! ",
  "Visited on the Cultural Pass we bought earlier in the day. Not to be missed museum on the Hill. We spent almost 3 hours here.\n\nFavorites were the Here, Now and Always Exhibit, Beyond Standing Rock and Southern Athabaskans temporary exhibita, and the Lloyd Kiva Gallery."
 ]
},{
 "name": "Palace of the Governors",
 "address": "105 W Palace Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/fe/21/61/palace-of-the-governors.jpg",
 "tags": [
  "art",
  "family",
  "history",
  "art",
  "unique",
  "family",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d4868364-Reviews-Palace_of_the_Governors-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were visiting from Canada, and we learnt a lot about the state by visiting the Palace of the Governors. Buy a pass to see a bunch of the galleries in the area, it is the best value for the money. ",
  "  Not just anyone can set up their wares in the palace.  You are pretty much guaranteed that the items you buy are the real deal.  It is absolutely wonderful to talk to the artists.  They are very proud of their family art tradition and are happy to have you examine their wares.  Many of the artists take credit cards, but not all.  There is an ATM machine nearby.  The artists are there almost every day but the same artist may not be there on any given day.  Prices are very fair so buy the piece you want to avoid being disappointed if the artist isn't there the following day.  I bought a number of pieces of jewelry from a delightful artist named Jennifer.  She was very informative and I felt that she gave me a fair price.",
  "The Palace of the Governors is the focal point of Santa Fe.  Visits to the city should start here on the north side of the city's plaza.  The museum's exhibits and interpretation of the part it has played in New Mexico history are thorough and excellent.  The Palace is the portal to the modern New Mexico history museum across the courtyard.  There is a moderate admission fee.  The area around the plaza becomes congested during the day and on street parking is metered and can be difficult to find.  The museum has a very nice gift store with an excellent selection of books on New Mexico and southwest US history.",
  "We went to the Palace of the Governors twice to visit the natives who were selling their jewelry and crafts. It is wonderful but the prices are not any better than the stores. The natives make their living from selling their home crafted jewelry and that is important to know. ",
  "If you are looking for beautiful jewelry and pottery done by local artist this is the place to go.  In this market style pavilion you will also get to meet and talk with the artist.  It was a great opportunity to find out their process for creating the artwork as well as the meaning behind the symbolisms in their work.  Everyone was so friendly and talkative.  All vendors are licensed by the city to sell their artwork so I felt I was buying authentic traditional Indian artwork.",
  "Just off the plaza, a row of local people from nearby pueblos offering their crafts.  You can expect fair prices and no hassle.  They don't mind you just looking either.",
  "You will love the Native American Art. The family traditions in the making of the jewelry is amazing. Well crafted & unique. Buying from a street vendor seems very rewarding. We always stop to look every time we are in town.",
  "I lovef chatting with the Artists about their work. I found some jewelry and Christmas ornaments. None of it was cheap, but all of it was well crafted. I liked the artistry and uniqueness of the work here far more thsn anything I'd seen in the nearby shops."
 ]
},{
 "name": "San Miguel Chapel",
 "address": "401 Old Santa Fe Trl Lower Old Santa Fe Trail",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/4e/b2/2b/photo0jpg.jpg",
 "tags": [
  "structure",
  "music",
  "historic",
  "history",
  "unique",
  "walk",
  "history",
  "art",
  "history",
  "walking",
  "music",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d124600-Reviews-San_Miguel_Chapel-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "An outstanding example of preserved Adobe architecture, San Miguel Chapel is considered to be the oldest church structure in the United States.  The chapel is thought to have been built around 1610 and rebuilt and restored multiple times over the centuries.  The wooden altar screen dates from 1798 and its painting of various Saints date back to the mid 18th century.  Around the walls of the sanctuary are 14 stations of the cross carved of pine.  Just beyond the communion rail is a bit of the original dirt floor and sanctuary steps.  \nOn the afternoon of our visit a pianist and violinist were rehearsing for a concert and the chapel was filled with beautiful music.  Admission was a mere $1.00",
  "This historic old church probably dates as far back as 1610  and has a fascinating history through the centuries. The old original dirt floor can be seen as can its original bell. The building is so old the exterior buttresses were added at different times to support the aged walls. A visit here can help you unfold the generations of change and the different peoples who lived here in this old city. This is believed to be the oldest church in the US!",
  "We didn’t realize the oldest church in the USA was located in SAnta Fe, it was gorgeous, and such a unique and beautiful site. ",
  "I grew up in Northern New Mexico, after moving away I feel the value of what I grew up with.  This is the oldest church in New Mexico and still holds mass, where on occasion, will have people standing all the way out to the street.  One can feel the spirit of the building when standing in the oldest part of Santa Fe, in the heart of New Mexico.  The Sangre de Cristo Mountains in the eastern backdrop are the tail end of the Rocky Mountain Range.  Parking is difficult in this area, best to buy a day pass at the Sandoval parking garage and walk this area.  This being on the southeast skirt of all the interesting sights.  The great news is Upper Crust Pizza is just up the block and has great historical pics on the wall, fast service and the best pizza, calzones and salad deals!! Enjoy!!",
  "Read about the Chapel before you go....tons of history and well worth seeing if in Santa Fe. Be sure to check the hours or it may be locked when you arrive.",
  "You feel like you are stepping back in time when you step into San Miguel.  The altar backdrop in spectacular and the church is filled with gorgeous art from as far back as the 1600's.  Be sure to see the paintings on buffalo and deer hide.  If you visit on Sunday, please be reverent as there are Masses at 2:00 (Latin)and 5:00 (English) and beware the squeaky door!",
  "will only take about 30 minutes max since its not that big. but if you were from the 1600's you wouldn't be that big either.",
  "Be sure to look over the railing in the front to see the archeological dig results. This is the oldest church in the US. It was peaceful to visit a place where people have sought peace for 400 years.",
  "If you love discovering history then you have to visit the San Miguel Chapel in Santa Fe. It truly is a history treasure trove, with a hand painted board at the front of the church and the original foundations visible at the front of the church.",
  "We enjoyed finding, and walking through San Miguel.  It is small, old, and well cared for.  Thirty minutes is all you need to absorb it.  Okay to light a candle for loved ones inside.",
  "A beautiful chapel - the oldest church in the United States originally built around 1610 - with a long history.  The chapel is small and beautiful - well cared for to be sure.  \n\nThe concert was sponsored by a group Severall Friends and brought in two stellar professionals who performed in vintage instruments, harpsichord and 1660 violin. \n\nThe chapel itself is worth visiting ( a must) but if you have the chance to attend  a small and intimate concert in the chapel -  you will enjoy the chapel and the music - a magical evening."
 ]
},{
 "name": "Santa Fe Farmers Market",
 "address": "1607 Paseo de Peralta",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/27/dc/10/the-santa-fe-farmer-s.jpg",
 "tags": [
  "art",
  "food",
  "creative",
  "food",
  "eat",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d580947-Reviews-Santa_Fe_Farmers_Market-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "The farmers market is a fun destination year round. Check the hours and days prior to making the trek. The winter hours are a bit different. Bring a basket or bag to carry your veggies and goods home in. The prices are reasonable. Make sure you try the green chili cheese bread and / or fruit breads from the stand there (they are outside in the Summer and inside during the Winter months). There is a crafts market in the building to the West which is definitely worth checking out (furniture, leather goods, jewelry, rugs, etc.) The ristras at the Farmers Market are beautiful and hold up well. Enjoy your visit!  ",
  "This market is partially indoor/outdoors.  Good thing as today there was even a little snow.\nThey actually sold produce here, loads of different lettuces. Also tomatoes, leek, mushrooms, various breads.\nYou may want to come early as by 11 it is quite busy and line ups at some stalls are long.",
  "Quite a few local salves and art, as well as food. High quality produce. Meat and eggs, as well as goat milk, tend to go quickly. I highly recommend going early to avoid the crowds or if you’re looking for something in particular.",
  "This was a birthday celebration for myself and a first cousin,both turning 70.my daughter and son in law joined us. What a magical place.the market was a highlight with outdoor and indoor areas and all kinds of food and treats, and interesting local fare. So many artists and creative foodies,many varieties of local chili peppers,as well as local artisans with art,jewelry, clothing. Weather was perfect in late October and we even got a dusting of snow our last morning before leaving on the turquoise road to Albequerqe.",
  "This is a small area, but it’s absolutely overflowing with fresh vegetables, fruits, spices, beans, meats, and even non-food items like soaps, Lotions, CBD, Herbal blends, flowers, etc. We had a great time, and bought a lot!\n\nIf I lived in Santa Fe, I would come here every single week!",
  "A nice small market with all sorts of things southwest, all types of Chile powders, baked goods, jerky, and other items of the SW.",
  "We went during the weekend and the morning was bustling! There were many little shops selling all sorts of products from fresh vegetables to jams to soaps. It had a outdoor as well as indoor area (with the indoor carrying more ready to eat food). \n\nParking can be a challenge but it's possible. Do visit it at least once when you are in Santa Fe.",
  "We took a trip here on a busy Saturday morning and found some really interesting local food, crafts and artists selling their things. People were very welcoming and friendly and it was really busy. Just a short 5 minute drive from downtown where we stayed. Worth a trip to taste, smell and see lots of great things under a couple of roofs."
 ]
},{
 "name": "Nedra Matteucci Galleries",
 "address": "1075 Paseo de Peralta",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/47/27/11/the-sculpture-garden.jpg",
 "tags": [
  "wander",
  "art",
  "art",
  "art",
  "art",
  "art",
  "art",
  "historic",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d124569-Reviews-Nedra_Matteucci_Galleries-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "This gallery enjoys a long reputation for showing old masters along with contemporary artists who are masters as well. The Gallery courtyard is stunnning with many fine bronze sculptures.  Not to be missed.",
  "The Nedra Matteucci Galleries and sculpture garden are just spectacular. Museum quality art,  friendly helpful staff (zero sales pressure - if you’re buying the art can almost sell itself), lots of outstanding classic local (Santa Fe and Taos) artists. And though much of the Art will be out of the financial reach of most of us, the prices appear to me (and a couple of friends who are art professionals) to be appropriate. Plan to spend an hour or more to wander through all of the gallery rooms as well as the wonderful outdoor sculpture garden.",
  "I love going to this gallery!...my favorite part is the sculpture garden especially in the winter when it snows...they have a great collection of art and also an amazing case of jewelry...I highly recommend stoping in... ",
  "Don't miss seeing the Outdoor Garden with multiple sculptures and a lovely pond. Inside is an excellent collection of many Mexican Artists, (Zuniga, Castaneda and other modernists). All well displayed with helpful servers and sellers.  ",
  "I am not an artsy person, but I was overwhelmed with how cool this gallery is both inside and out.  If you only have time for one in Santa Fe, this is it.  Make sure you take in the architecture and back yard!",
  "If you like art or beautiful gardens, be sure to visit this gallery. This place is quite large with numerous paintings, sculpture, furniture and jewelry by some very notable artists. We were greeted with smiles the entire time we visited. Leave sufficient time to see it all and be sure to check out the garden area.",
  "We really should come back each and every time we are in Santa Fe.  I have been to museums that do not have the art that Nedra Matteucci Galleries displays.   We spend at least an hour to an hour and a half here and enjoyed every minute of it.  If you are in Santa Fe looking for art, come here.",
  "Amazing, fantastic,a must see experience! \nI have only been twice, but both times felt like a magical experience. The greeters/ curators are very welcoming and helpful, but allow you space to enjoy the beautiful sculptures and art.Every time I think of my visit I can feel like I am there. It makes me  smile...can't say enough !",
  "Wonderful, friendly staff, Old art from the Santa Fe Area.  There is an outstanding sculpture garden in back of the gallery.",
  "I am grateful to TripAdvisor for drawing my attention to this place that I probably would have otherwise missed.  It is a fantastic gallery in an historic space and a wide range of art on display (don't miss the sculpture garden).  The proprietors are very friendly and eager to converse about the artists on display.",
  "A gorgeous highend art gallery , stunning art in a stunning old house, and the gardens are a must see"
 ]
},{
 "name": "New Mexico History Museum",
 "address": "113 Lincoln Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/e1/ea/95/photo9jpg.jpg",
 "tags": [
  "free",
  "learn",
  "history",
  "tour",
  "history",
  "free",
  "tour",
  "free",
  "walking",
  "history",
  "historic",
  "history",
  "walking",
  "tour",
  "history",
  "tour",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d1459364-Reviews-New_Mexico_History_Museum-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "What an excellent museum!  Not only did I learn a ton about New Mexico and it's people, but I learned a lot about the history of the United States and Regional Wars that were glossed over in my High School history classes in the Northeast.  I spent a few hours here and read every single Museum Label, and never got bored.  \n\nIt's amazing how much of US and World History New Mexico has played a major role in - from the Colonies, to the Mexican-American War, to the Civil War, to the Atomic Bomb.  There was also a long-running special exhibit on Counterculture in New Mexico that was fascinating.  You also get free admission to the Palace of the Governors next door with your ticket.\n\nThis is a must-see if you are in Santa Fe.",
  "We spent several hours wandering around the museum.  There are two distinct parts - the Governors Palace and the newer museum.  If you time it right, you can get a free tour of the newer museum led by a docent.  It's definite worth finding out about when the tours are conducted.  We got a very good, unbiased, description of Santa Fe history, starting with the pre-Columbian native American cultures, followed by Spanish and Mexican explorations and colonization, and the wild west days, all the way up to the Harvey Houses and Harvey girls. ",
  "The New Mexico History Museum and the Palace of the Governors (both venues are connected and admittance to both is via a combined single ticket) beautifully present and describe the history of New Mexico.  We took the free guided tour of the Palace of the Governors which was excellent and provided great background information from which to further explore both museums.  \n\nIn addition, just outside the entrance to the History Museum we began our day with the 10:00 am guided walking tour of Santa Fe - approximately 1-1/2 to 2 hours, very informative covering historic sights as well as the current state capitol building.",
  "As Santa Fe residents, we have been to this museum more than once. The permanent exhibit gives you a very good overview of the state's evolution. Guided tours are available. Special exhibits really enhance the experience. Make sure you check the museum's schedule to see when these events are occurring.",
  "Who knew that one cool idea like the Harvey girls was part of such a fascinating story, or how deeply saddening the stories from the “Indian Schools”. Buy a day pass, you’ll be glad to come back to this or one of the connected museums after lunch.",
  "I can't get enough of the museums in Santa Fe. The old photographs pull me in and really show the history so well. Don't miss shopping on the street with the local artists too. ",
  "I loved walking through this museum all by myself because it was practically empty when I was there, about an hour before closing. It was well done and easy to visit. The museum shop is one of the best I have ever visited. ",
  "This museum is terrific in offering a thorough and honest portrayal of the history of the area. Allow enough time (two hours or so) to absorb the material and visual feast. I returned for a guided tour through the Governor's residence. Fascinating!",
  "We did a 10:30 docent tour and got a general overview. It was great for us. We did not see everything but we would definitely go back. \nI bought a few Native American things in the shop. \nThe artists outside in the Palace of the Governor’s portico were set up early every day in February. There were a few at 9 but as it warmed up more arrived. My daughter bought a pair of earrings and I bought some small pottery items.\n",
  "Very interesting exhibits within covering a long period of New Mexican History. Different focus than other museums in Santa Fe.\n\n We spent 3 hours between here and adjacent Palace of Governors. We only spent about 15 minutes in Palace since not all exhibits open. Definitely were able to cover entire museum.\n\nEssentially in center of town, close to many other sites.",
  "Surprisingly fun!\n\nIt’s a small museum, but quite well done, and I learned a lot while I was here. It’s not very expensive, and it’s right in the middle of town, so if you have any interest in New Mexico history at all, I definitely recommend it."
 ]
},{
 "name": "Dale Ball Trails",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/e5/64/a2/picacho-peak.jpg",
 "tags": [
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d7212551-Reviews-Dale_Ball_Trails-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "The trail was very easy to follow and the maps and markers are easy to read. The view at the top is great. ",
  "Wear proper footwear with spikes in winter, there was lots of ice!  Easy to navigate. I'm heading for 60 and did fine,  though did find a walking stick useful for balance. ",
  "We had a nice walk here as an alternative to the gallery strolling in town. There is an extensive network of trails (tip: take a photo of the map at the trailhead). The vegetation was pretty even in November. ",
  "A friend and I recently visited Santa Fe and hiked Dale Ball Trails on two different days going on two different loops. These trails were very EASY to navigate. The parking lot has a map, and all turns are marked where the path splits. Since I’m not really a hiker, I felt very confident with the way these trails were marked.\n\nWe went mid morning one day and early the next and both times, we saw people on the trail. There weren’t a lot and it was the weekend, but if you’re looking to get lost - you may want to look elsewhere. However if you’re like me and you just want to get out and move around without navigating gps or anything, these trails are for you.\n\nA lot of the trails do look the same, but the views are great. We did see a fair amount of scat on the trail, but no wildlife made its presence known to us.",
  "An easy drive from the center of town, easy markers, and very nice  views. Not difficult though we only went half way and turned around."
 ]
},{
 "name": "Cross of the Martyrs",
 "address": "600 Paseo de Peralta",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/59/6d/32/cross-of-the-martyrs.jpg",
 "tags": [
  "history",
  "walk",
  "walk",
  "hike",
  "history",
  "learn",
  "walk",
  "history",
  "walk",
  "history",
  "walk",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d123656-Reviews-Cross_of_the_Martyrs-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Just a few blocks from the plaza, this is a nice walk and history lesson. There are plaques along the path that tell the history of the area. if you continue along the path to the side, it is a short walk to the Ft Marcy ruins. The path is paved with stairs.",
  "Take a short walk to the top of the hill that supports the Cross of the Martyrs.  The view of Santa Fe is great and for all you fitbit enthusiasts it is good for ten flights of stairs, an easy paved path to the top. \n\n",
  "Only a short walk (20 minutes) from the main Square, the view is wonderful.  From here you can see the surrounding area.  During the hike up the paved path, you will learn about the history of the region from the installed signage.",
  "Just a few blocks from the plaza, this is a nice walk and history lesson. There are plaques along the path that tell the history of the area. if you continue along the path to the side, it is a short walk to the Ft Marcy ruins. The path is paved with stairs.",
  " Great views of the city with plaques the explain the history of this area going back before the Spanish arrived.",
  "Beautiful day turned into a beautiful sunset as we climbed the stairs to the Cross overlooking the city.",
  "Take a short walk to the top of the hill that supports the Cross of the Martyrs.  The view of Santa Fe is great and for all you fitbit enthusiasts it is good for ten flights of stairs, an easy paved path to the top. \n\n",
  "I recommend this climb around sunset because of the view it affords but you will need some light once up there to read the historic plaques posted that tell of the history of the location and of Santa Fe."
 ]
},{
 "name": "La Cieneguilla Petroglyph Site",
 "address": "Airport Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/47/0c/c1/this-spot-had-a-big-variety.jpg",
 "tags": [
  "tour",
  "hike",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d3671778-Reviews-La_Cieneguilla_Petroglyph_Site-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "i had just assumed there would be a check-in station, visitor center, tour guides, and/or tour maps, but it's a roadside parking area with a placard and foot trails. Like an Easter egg hunt, you just go. We found some of the petroglyphs on our own, asked other hikers about some, and followed the trails for a couple of hours. Pleasant diversion,  but would have planned differently if i would have known more about it.",
  "Excellent amazing mind boggling!! \nNot an easy hike as I have a bad knee but I took 2 poles specifically for the hike.  I could not have done it without the poles. \nWe were the only people out there at 10:00 on a Friday in Feb. \nMy 9 yo grandson LOVED it! He scampered all over the place and took pics for me of the ones out of my reach.\n",
  "This site is fairly easy access with a BML sign off the road. There are thousands of petroglyphs there. You should have good hiking boots and long pants some kind of hiking staff and I and I took leather gloves cuz you're probably going to have to do some rock scrambling to see some of them. You also need water.  You also have to be aware of rattlesnakes, we saw one but we're able to back away from it no problem and the axiom of know where your put your feet and know where you put your hands holds true when you're ever hiking through Rocky areas in the Southwest. Most of the petroglyphs replaced by Pueblo Indian people between the 13th and 17th century. There are many birds and kokopelli figures. The descendants of these people live along the Santa Fe River and the Rio grande. The Santo Domingo Pueblo in the Cochiti Pueblo are the main ones. Remember most petroglyphs are under and  escarpment so you'll have to scramble up to get to the pathway. There's not a lot of signage there's some but you have to use your since to know that they're up and underneath the cliff.if you can hook up with the guy that might be good maybe the Ciara club run some hikes there I'm not really sure.",
  "I found this place completely by accident while taking a casual drive down this road. You have to walk up a hill to get to where the petroglyphs are but it's absolutely worth it. Hundreds of petroglyphs!",
  "We liked the outing, but wish we had know the directions.  So from the parking lot, turn left at the fork near the sign board.  Walk to the opening in the fence.  Go through the fence, then you are kind of on your own.  Go straight up the side of the hill, which is covered in large rocks. The glyphs are on the side of the rocks at the top of the hill."
 ]
},{
 "name": "Atalaya Mountain Hiking Trail",
 "address": "Access from Parking Area at St. John's College",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/8c/62/62/photo0jpg.jpg",
 "tags": [
  "walking",
  "walk",
  "hike",
  "hike",
  "walking",
  "hike",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d3498636-Reviews-Atalaya_Mountain_Hiking_Trail-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Be careful about parking in restricted areas.  I saw a car with a boot in the St. John's parking lot.\n\nWe hiked this trail on March 11, 2020.  There were a few areas at the start of the trial that were muddy.  We were able to walk around most of the snow and ice that is patchy about 3/4 of the way up the trail.  There were only about 5 large area of ice in only very limited areas of the trail that we had to walk on.  We managed the ice well with hiking boots.\n\nWe walked a total of 7.4 miles including the walk from street parking, taking the easy way down (longer than the steep route), and walking around at the top to take photos.\n\nWe hiked slowly, took 30 minutes for lunch, and stopped for lots of photos so the round trip took us 4.5 hours.",
  " Top of the mountain top of the world feel to this place. Near the College. Easy access tp trails and wildlife in a matter of minutes.",
  "A great workout and enjoyable hike, even with some parts of trail snow packed.  Enjoyed the incredible views and watching the excited looks of multiple dogs taking their humans up the trail.",
  "You can start at St. John's college parking lot and hike up hill from there. I find the hike to be a bit challenging and we typically stop alot. But it is well worth the time. You end up looking over all of Santa Fe. \nWear good hiking shoe and a walking stick. It gets a bit hairy as you reach near the top--a bit more rocky and crumbly.",
  "This is a challenging and beautiful hike that is very worth the effort to complete it. It is very close to town so you will get views of Santa Fe, Saint John's College and walk by some beautiful homes.\nSome sections are very steep and the trail is a bit rocky. The trail starts in the 'upper' parking lot of Saint John's College. There are signs on the road before the parking lot but they are often hidden by tree foliage. \nWe've hiked this trail in all seasons (when snow is no longer on the trail) and in the hotter months, it's best to start early in the morning. One July, it was 100 degrees when we reached midway up! When we got to the top it was much cooler.\n\nOn our most recent visit (Sept 2019) there was a beautiful sunset (photo attached).\n\nBring lots of water and enjoy the views! (you will be proud of yourself when you complete it!)"
 ]
},{
 "name": "Randall Davey Audubon Center",
 "address": "Upper Canyon Rd.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/1e/a3/6b/entrance-to-center.jpg",
 "tags": [
  "tour",
  "walk",
  "nature",
  "tour",
  "walk",
  "tour",
  "nature",
  "nature",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d143971-Reviews-Randall_Davey_Audubon_Center-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "After you visit the galleries on Canyon Road, keep going up the road until you can go no more and visit the Audubon Center.  The road is unpaved but it is smooth enough.  This is a great place for a picnic.  While it is really not far from the galleries, it feels like it is.  There are 135 acres with trails, open Monday thru Saturday from 8 to 4.  There is a docent-led tour of the house and studio on Fridays at 2:00 and a bird walk Saturdays at 8:30 AM.",
  "This has got to be one of Sante Fe's hidden jewels! With a storm approaching, we stayed in town & did some hiking and bird watching for a couple of hours. It's a must do activity.",
  "Well groomed and well marked hiking trails, peaceful and saw lots of birds.  Also, staff provided helpful maps of area and also recommended Nature Conservancy down the road.  ",
  "After you visit the galleries on Canyon Road, keep going up the road until you can go no more and visit the Audubon Center.  The road is unpaved but it is smooth enough.  This is a great place for a picnic.  While it is really not far from the galleries, it feels like it is.  There are 135 acres with trails, open Monday thru Saturday from 8 to 4.  There is a docent-led tour of the house and studio on Fridays at 2:00 and a bird walk Saturdays at 8:30 AM.",
  "We had hoped to tour the Center on our recent visit. But of all the days, they were having an offsight staff meeting the day we were there and the Center was closed. And to further aggravate our trip, the trails were pretty slick and snow-covered.\n\nBut . . . that doesn't deteoriate from the Center itself. It's a neat place. We walked around a bit. And nearby are numerous trails. We'll return and hopefully they'll be open.",
  "This is a lovely place to visit, if only to enjoy nature. But it also offers the advantage of  learning more about a great conservationist and his work. \nI have taken student groups up here in the distant past to bird watch and enjoy being out in a green space.",
  "It's a 20-minute drive from the plaza, yet it's another world.  The wildlife is far more than birds.  Don't miss it.",
  "We went up here to get out of town and find a place to be in nature on winter solstice. It was a bit icy so we didn't walk very far, but did a nice loop around the property. Close to town but felt isolated and quiet. "
 ]
},{
 "name": "The Harrell House Bug Museum",
 "address": "556 N Guadalupe St Inside DeVargas Center Mall",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/a4/ea/73/amazing-collection-of.jpg",
 "tags": [
  "tour",
  "kids",
  "sampling",
  "tour",
  "kids",
  "active",
  "kids",
  "family",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d4570589-Reviews-The_Harrell_House_Bug_Museum-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "I really enjoyed this. Quite an impressive collection of bugs on display. We got a nice tour from the owner of the collection. He is quite proud of his collection (and should be) PLUS very informative and friendly. I got a chance to handle a couple of the insects: a tarantula, a millipede, a Madagascar hissing cockroach and a stone beetle. Creepy and cool all at the same time. The young man who was helping with this was very informative and genuinely seemed interested in the critters.",
  "Inexpensive way to spend a couple of hours with the kids. Most specimens are in large glass enclosures (dead), however, they do have a really fun sampling of live bugs such as spiders, scorpions, millipedes, cockroaches (cool ones, too!), and even snakes and amphibians, including some that children can hold under the guidance of an employee. The young man handling the animals was very informative and great with the kids, who ranged in age from about 4 to 12. He was patient answering questions, and I was very impressed with his presentation. My 2 year old loved it, as did his 7-yr-old brother and 4-yr-old cousin, and sent a good hour and a half looking around. ",
  "This was a great little escape for a Sunday afternoon. It was a bigger collection than I expected. I loved the bugs of course but there are also lizards and amphibians, including a monitor lizard that was quite active while I was there. There are also a few fish. Visitors are provided little flashlights so you can look in burrows and such for the critters. Small footstools are plentiful so kids can get a better look at things. Educational plaques accompany each critter. Once you finish looking at the live bugs, there's an impressive collection of pinned, preserved insects. Finally, you can sit at the end of your self-guided tour and hold some bugs. Yay! There's also a small gift shop at the front of the shop. It was great. We had an educational and entertaining time!",
  "Bugs are not my thing but when traveling with my grandson we always check out anything buggy! We’ve been to quite a few. What made this one five star was the excellent young man that worked there who really was full of info, very pleasant and really seemed to enjoy his job. \nWe came for the 4:00 feeding which was exciting because the creatures really responded and my grandson also enjoyed holding the bugs. \nIt is smallish and I thought the enclosures were too small and could be cleaner. \nWe stayed at Inn of the Governors which was excellent and got a “Kids Crawl” package which included passes to Harrell House. ",
  "This is somebody’s basement bug collection.\n\nNot only is it cheaply done, and extremely unprofessional, but there are lizards, frogs, fish, etc. forced to live in tiny, dirty cages. I was horrified!",
  "If you've got kids, take them here!  All sorts of live specimens as well as preserved.  Butterflies, beetles, roaches, a few snakes and turtles.  They seem to specialize in tarantulas.",
  "I read reviews of this museum and my kids were interested so we decided to go. I didn’t know that it is housed in the back of a large store that is located in a strip mall. This was not what I was expecting, but there were actually a lot of specimens to see. The man that works there is an expert on insects and told us a lot of good information. There was a chance to hold or touch several different insects and arachnids at the end. Overall it was a fun thing for a family to do, especially for kids who are tired of traditional museums. ",
  "very interesting place with lots to see. Much better than similar places in bigger cities. We were quite impressed and the kids loved it and talked about the rest of the day. "
 ]
},{
 "name": "New Mexico Museum of Art",
 "address": "107 W Palace Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/04/b8/5d/new-mexico-museum-of.jpg",
 "tags": [
  "organized",
  "art",
  "art",
  "history",
  "free",
  "art",
  "history",
  "art",
  "history",
  "art",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d1458256-Reviews-New_Mexico_Museum_of_Art-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum is delightful.  Great art, well organized and very interesting exhibits.  Friendly and helpful staff.  Don't miss the courtyard which is a lovely oasis of green and a fountain in a very arid climate.  Lovely gift shop as well.  Far less crowded than the O'Keeffe.  We thoroughly enjoyed our visit.",
  "I was in Santa Fe over the Thanksgiving weekend in 2017. NMMA was reopening on that Saturday (after maintenance and renovations) for it's 100th anniversary. And it was free!\n\nPersonally, I love this museum focused on the art of New Mexico. Given the focus, I take it on its own terms rather than comparing with similar museums elsewhere. The curators do a really nice job for the longer term exhibits and they really outdid themselves on these new exhibitions for the 100th anniversary. A note: The short term exhibits can be hit or miss, but that's fine with me. When they hit, they really hit. This is not a large museum, but the addition of more gallery space a few years ago really helped.\n\nHINT: Out of state admission is $12. If you don't have a natural interest in the focus of the museum, that may be high for you, especially given the smaller size. I suggest seeing this Museum with the New Mexico Culture Pass (which is a great deal). In Santa Fe, the New Mexico History Museum, Museum of Indian Arts and Culture, and Museum of International Folk Art, all worthy destinations, are included in the Pass as well. (Just seeing 3 of these 4 museums individually costs more than the Pass itself...plus there are other sites around New Mexico included.)\n\nKeith",
  "The building itself is a masterpiece of Pueblo architecture.  The collection is small, but includes works by a vast swath of well known artists.  Many are the result of a donation in 1968 by Rebeca Salsbury James which included works by Georgia o'Keefe, Alfred Stieglitz, Cady Wells, Paul Strand and Gaston Lachaise.  They have regular visiting exhibits and concerts.  Soon to celebrate its Centennial, Nov 25, 2017.  ",
  "Most recently we saw a shoe featuring the \"Art of the Guitar\", but the museum is also known for shows featuring patbreaking artists like Judy Chicago and the art of the Southwest.\n\nIf art is your thing, and it should be if you visit Santa Fe, you should visit this museum.\n\nNote:  If time permits, you should buy a museum pass which allows you to visit all of Santa Fe's excellent public museums, including the Native Arts, Folk Art , Hispanic and History museums",
  "This is a nice museum near the Plaza. It opened in 1917 and has NM artwork dating back to that era. There are classic, well known artists (o'Keefe / Baumann) on display, as well as, newer / less known artists. Don't rush through the courtyard near the entrance -- the murals are very beautiful and were commissioned in the 1930s (still look amazing). ",
  "When you want to take a break from the Santa Fe sales pitch, mall-like commercialism or just the heat of the day, stop into the New Mexico Museum of Art.  The walls of the museum portray a multitude of stories as seen through the eyes of the artists who have been inspired by the people and landscapes of New Mexico.  The magnificent building is also a work of art.  Take the time to appreciate the detailed murals in the auditorium and courtyard which capture New Mexico history and culture.  The Colors of the Southwest exhibit gave me a new appreciation of the artistic diversity and broad range of the New Mexico palette.",
  "While not necessarily a featured museum in various guides, it is worth at least an hour of your time. This museum was included in our combo tickets for Santa Fe Museums. We spent about 2-1/2 hours here.\n\nThere are some very interesting art, particularly sculpture, not seen in other Santa Fe museums. The murals in the atrium are particularly interesting.",
  "Stopped by and they had  the exhibit: The birth, death and resurrection of Christ. It was excellent, as was the rest of the collection. Might not be the biggest display but it was very nice and staff was very friendly.",
  "Museum of art Santa Fe:  A larger space than the O’Keefe museum.  Eclectic mix of modern and contemporary work.  The building itself is work of art. Yes yes yes.",
  "Being right off the plaza, makes this \"must see\" museum an easy to get to museum!  We were there just as an amazing Agnes Pelton exhibit was winding down (on it's way to the Whitney NY peeps).  The murals in the atria are so beautiful.  Take your time and enjoy.  Lots of good stuff to see here.",
  "This is a small museum with a large collection but only a very small part of the collection on display.  I was suprised by the limited number of art works on display and even more surprised by what was on display-  lesser quality art than what is seen in most of the galleries in town.    \n\nI had read that this museum had a number of Georgia O'Keefe's.  But not one was on display.  When I asked at the entrance desk, I was told that the museum did indeed own a number of O'Keefe's but that none were on display.  \n\nI would skip this museum.  It isn't worth a visit."
 ]
},{
 "name": "Hyde Memorial State Park",
 "address": "740 Hyde Park Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/1a/99/76/fall-colors.jpg",
 "tags": [
  "hike",
  "hike",
  "walk",
  "kids",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d123659-Reviews-Hyde_Memorial_State_Park-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Use hking shoes for trails, but there are also turnouts that afford incredible views across the miles wide valley.  The drive up and through the forest is stunning.",
  "Hyde park is just a few miles away from the city yet it feels like hours away, the scenery changes from homes and dirt to creeks and trees and beautiful rocks. The hiking trails are great and if you're around the first couple weeks of October the views of the Aspens changing colors is amazing. ",
  "We stumbled upon this park last minute and we’re glad we did! It’s in such a beautiful natural rustic setting close to Santa Fe! We hit it just right for the fall foliage. The most gorgeous scenery I’ve ever laid my eyes on. Go to the top of the mountain and pay the money to ride tram to the top! It’s $15 a person but so worth it for the pics you’ll have. Great place for camping or picnicking which we did. Get off the beaten path and do this:-) ",
  "Definitely recommend! The views are amazing! Park along the way and get onto the many trails for a hike. There are many places to pull over, but be careful because any drivers may stop in the middle of the road! The views are so amazing that I think people sometimes forget they are driving! I haven't seen any accidents, but it is something to be aware of. Enjoy the drive and take lots of photos! ",
  "When to a wedding at the Park, was really nice up in the mountains,the weather is colder than sante fe , take a jacket, nice place and has a campground near by.",
  "We hiked the Circle Trail and were so glad we did.  We parked at the trailhead where there is also a ski/snowboard shop and got a little information before we headed out.  We paid the $5 to park since it’s State Forest property and headed out - or should I say up?  We hiked up for a long time - the sign at the bottom warns you to be prepared to go up 1000 feet.  My sister’s fit bit said we hiked a total of 7 miles and went up 133 floors.  We accidentally took the short .25 Waterfall trail which was amazing since there was still ice on it and we got to walk on the semi frozen stream.  It was worth the short hike in and out since you just go to the waterfall and turn around.  We saw many dogs with great owners sharing the trails.  Dress in layers and take water and go early so you can follow the trail.  It’s not well marked but we just followed the obvious trail and confirmed when we saw a sign or bench.  It was a challenge with the elevation and climb, but take your time and take breaks to enjoy the views. Beautiful day just outside Santa Fe!",
  "We camped here for spring break with our young kids.  Pros: mountains and views spectacular, near Ski Santa Fe so can easily access the ski slopes quickly. Camp host and park rangers very nice and helpful.  Cons: only electric camp sites, has pit toilet.  No showers/bathrooms.  1 water main available up at the camp office only.",
  "The grandeur of the view was breathtaking.  Great hiking trails in the summer time. Can’t go to a Santa Fe without a drive up the park. You will be glad you did.",
  "Hyde Memorial State Park is small but nice.  We stopped at one of the fee stations upon arrival and deposited the envelope provided with auto information and a five-dollar bill. The visitor center was closed when we arrived and was still closed when we left -- I guess a mid-week day in October is off season.  Hyde Memorial SP looks like a great park for camping.\n  \nThe trails we took were well-maintained.  I was a little disappointed that so few aspens had changed color, but Mother Nature cannot be controlled.  We visited a couple of days before Santa Fe's first frost; I'm sure the park had more gold color a few days later.",
  "Having just moved to the Santa Fe area, I've had multiple people tell me that I must go to Hyde Park. \nI was blown away! Firstly, the thing that most impressed me is the number of picnic areas and group picnic/camp areas. They were everywhere. So arriving late on a weekend, chances are, there will be something available. But the interesting aspect of this, is the trees & vegetation are so think, very unlike down lower in town, each picnic spot retains a healthy amount of privacy. Very good planning.\n\nSecondly, the roads & access roads are well maintained. They are well graded, sided and I seriously couldn't find any potholes or washboard. Again, impressive.\n\nAnd thirdly, the trails are wonderful. There aren't too many, but they are taken care of, never too far from the road and well signed. \nHyde State Park is what I think of when I envision a state park. Excellent job New Mexico!",
  "Loved the forest and how much more green it was here. We followed a trail that was next to a creek. It varied from very rocky to mountain meadow with flowers and butterflies. I loved that there were no bugs! Instead of gnats flying around me, I was encircled by small moths. It was quite surreal. Bring water and I would say that you should be in fairly good shape. I run several miles every day, and had to stop and rest several times. Granted, I am from the east coast, so the elevation was getting to me. "
 ]
},{
 "name": "Old Fort Marcy Park",
 "address": "617 Paseo de Peralta Also access it by traveling 3 blocks up Artist Rd. and turning right",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/d3/82/26/old-fort-marcy-park-view.jpg",
 "tags": [
  "walk",
  "history",
  "walk",
  "walking",
  "history",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d143975-Reviews-Old_Fort_Marcy_Park-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Lots of historical plaques along the trail which were really cool. Walked back after dinner and heard the coyotes crying.",
  "Whether you brave the steps and pathway up the hill from Paseo de Peralta or enjoy the nearly level path from the parking area off of Kearney Ave, the walk to the cross affords an incredible view of the city and distant areas.  It is especially rewarding at night when it cools down a bit and the gentle breezes keep you cool while looking at the city lights and possibly a distant lightning show.",
  "Adjacent to Cross of the Martyrs, atop a hill overlooking Santa Fe.  Gave us an appreciation for the mountains that are so close to Santa Fe in many directions.  Fort Marcy was built in 1846 at the beginning of the Mexican-American War by the U.S. Army following the invasion and capture of the Mexican city of Santa Fe.  Fort Marcy was meant to protect the troops in case of a local uprising but never garrisoned soldiers or witnessed any gunfire.  Guns were, in fact, removed by the end of 1847 and the adobe walls began the slow process of erosion.\n\nOur visit prompted us to think about the very different cultures that have confronted each other in Santa Fe over many years.",
  "It's held in Marcy Park. Google for details. But you must go to get rid of of all the old stuff once! Can't miss! We locals love to chant burn burn. His eyes glow and he roars. Just the best! And you can put your one message as they build him. Way cool!",
  "I would encourage all Santa Fe visitors to take this in. It is a beautiful spot and I learned so much about the local history on the plaques along the walk. Very inspiring!",
  "We didn't spend much time here because it had snowed the day before and was very cold. We drove to the top and walked the pathway to the cross. Nice, informative signs are placed around the park. Great view of Santa Fe and the Sangre de Christo mountains.",
  "It's the grounds and park only, no buildings. There is a driveway with parking, but walking up the hill is a great workout and there are plaques with history along the way. Nice picnic area up top.",
  "Great place to view the city and surrounding mountains. One can easily see why the fort was built at this location. You can get some good exercise walking the trail from Paseo de Peralta the fort."
 ]
},{
 "name": "Wheelwright Museum of the American Indian",
 "address": "704 Camino Lejo",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/7d/b9/71/filename-p1019728-jpg.jpg",
 "tags": [
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d110197-Reviews-Wheelwright_Museum_of_the_American_Indian-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Happened on an exhibit of Melanie Yazzie and enjoyed the wonderful video they had of her, and of other artists exhibiting in their unbelievable jewelry exhibit.  The descriptions of the work and quotes from the artists throughout the museum made it a real pleasure.  ",
  "We have enjoyed this museum on countless visit -- it's small but each exhibit is well focused and well curated and very informative. It's like visiting a private collection and is more intimate than the larger museums and their gift shop is one of the best anywhere. Lots of authentic southwest gifts at reasonable prices and a very helpful staff.",
  "The Wheelwright is shaped like a hogan and showcases a small but always distinctive collection in its changing exhibit cases.  Downstairs is the Case Trading Post which offers Native American wares from the region in a reproduction of an authentic post.",
  "It's an incredibly interesting little museum with great exhibits. Every time they have a new exhibit they completely transform the interior space. Wonderful story behind the museum's origins and the Trading Post downstairs should not be missed.",
  "There was a superb exhibition of arts my contemporary Native Americans. it was fascinating to see how the current generation adapts tradition to coment on the current age.",
  "This Native American museum was very well done.  They have a jewelry exhibit of Native American jewelry that was amazing.  They also had some interesting art.  Well worth a visit.",
  "I’m glad I stumbled upon this museum. I love Native American jewelry, and they have an amazing collection here.",
  "I know this is a Museum, and the exhibits can be really great or just ok.  It’s a small museum so they can do some really different exhibits you will never see elsewhere.\n\nBUT THE BEST THING ABOUT IT IS THE TRADING POST DOWNSTAIRS.  Not if you are looking for trinkets and minor items, but if you are looking for genuine quality, by known and respected artisans, and books you will read, and art you will hang on the wall, this is the place to shop."
 ]
},{
 "name": "Railyard Arts District",
 "address": "South Guadalupe Street Between Agua Fria and Paseo de Peralta",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/c7/f1/2b/the-water-tower.jpg",
 "tags": [
  "art",
  "walk",
  "art",
  "art",
  "music",
  "unique",
  "walk",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d8670359-Reviews-Railyard_Arts_District-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Explored the Railyards district's restaurants (we ate at Tomasita's and Whole Hog bbq, both excellent), curio and collectible shops, art galleries, and Site Santa Fe art museum, well worth the admission of $10 general and $5 students and seniors. Nothing but restaurants open after 4 or 5 on weekdays, at least in winter, but plenty of time to explore during the day and no crowds! We stayed at the Sage Inn, an easy 1 block walk away, so we had easy access to go back a few times.",
  "Whether its the Saturday morning Farmer's Market, REI fix, great modern art museums, cool clothing, quaint restaurants or upscale hair salon - this is the place to find it all in Santa Fe!",
  "Has the best contemporary art galleries in town, great movie theater the violet crown, farmers market and great restaurants. Oh I forgot shops like REI and chicos...\nIf you only have limited time  to spend in Santa Fe, go hang out here. In summer you also have live music !",
  "Sana Fe is known for its many galleries, but the Railyard District is now home to several modern, bright galleries offering artists from around the world. galleryFRITZ, Charlotte Jackson, Evoke, and SITE Santa FE are some of my favorites. Plus, the Farmer's Market is on-site and REI and Violet Crown Cinema, too.",
  "This is a good place to walk around stretching your legs while seeing cool unique things to buy. The Sunday market is my favorite time to visit due to the availability of different wares",
  " Railyard area brings in the train from Albuquerque. This area includes the farmers market, a handful of restaurants and shopping. Violet Crowne is a main attraction here.",
  "I went to the Sunday Market. I liked the selection of art work there.  It is a big, sunny building. Each artist has enough room to showcase their wares.  I liked being able to talk to the artists, something that doesn’t really happen in most galleries.",
  "Everything that you could want is here: red chilis, ristras, baked goods, jewelry, and fresh produce."
 ]
},{
 "name": "Santa Fe Botanical Garden",
 "address": "715 Camino Lejo Museum Hill",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/c6/99/98/20180704-131626-effects.jpg",
 "tags": [
  "knowledgeable",
  "kids",
  "art",
  "nature",
  "family",
  "food",
  "walk",
  "wander",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d3611694-Reviews-Santa_Fe_Botanical_Garden-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "We absolutely adored this garden!! It is a lovely time of year, so roses are in full bloom, and lavender is coming into full bloom. But what added to the beauty of the garden is the bronze statue exhibit that has been placed all thru the garden. The statues are from different artists and of different genres, yet they fit so beautifully, and they pull your eye to different perspectives in the garden. \nWe spent a couple of hours there, and our only wish was that the garden was bigger. \nHighly recommend, at least thru the time if this exhibit, which is till May 2020. \nDocents are available to answer questions and are very knowledgeable ",
  "Went right after opening on Sunday-would recommended then or during the week to avoid crowds and kids.   Relaxing and currently they have a fabulous sculpture exhibit tucked into the gardens.  Gift shop is small but great.  Wear a hat, sunscreen and probably bring water if you aren’t used to the Southwest ",
  "I brought my children here for nature journaling. There was one of the best ethnic botanical heritage installations I have ever seen, although small a very pleasant experience. The bronze art sculptures of wildlife are striking and beautiful to complement the gardens. There is quite a bit of seasonal variation and perhaps best visited in Spring and Summer seasons. A great place to stop on Museum Hill while visiting other sites.",
  "Keep in mind what this garden is:  high desert at high altitude.  As a result, you may (or may not) enjoy this garden in the winter.  For those of us who are curious about what plants look like in their dormant stage and what \"winter interest\" they can bring to a garden, it's very good.  I hope they keep adding more plants to this garden that retain an interesting shape or color throughout the winter.  I'm sure they will as this garden is relatively new.  It may get an \"excellent\" from me next year.\n\nIt also is a very good site for viewing attractive ways to incorporate zuni bowls and other methods of water diversion into your landscape. \n\nLate spring, summer and fall are probably more interesting to the general public.   It is still small, so don't expect to spend hours here.",
  "Keep in mind what this garden is:  high desert at high altitude.  As a result, you may (or may not) enjoy this garden in the winter.  For those of us who are curious about what plants look like in their dormant stage and what \"winter interest\" they can bring to a garden, it's very good.  I hope they keep adding more plants to this garden that retain an interesting shape or color throughout the winter.  I'm sure they will as this garden is relatively new.  It may get an \"excellent\" from me next year.\n\nIt also is a very good site for viewing attractive ways to incorporate zuni bowls and other methods of water diversion into your landscape. \n\nLate spring, summer and fall are probably more interesting to the general public.   It is still small, so don't expect to spend hours here.",
  "Nicely laid out, quite compact (5acres), this garden is only 5 years old. There is a central grouping of fruit trees, with a combination of native plants along with plants that grow well/ are popular in this area. There is another area, located across an arroyo from the main garden, whose focus is on plants cultivated and/or used by First Nations and Hispanic settlers. The focus in this garden is plants used for food, medicine, or clothing. Very interesting. As mentioned, the garden is small but definitely worth an hour or two of your time. When we were there there was a special exhibit of sculptures by members of the Namingha family, who are well known artists in this area. The sculptures were beautifully arranged and well worth seeing.",
  " This place always has something special going on. From plays to events associated with the other museums. I have bought books and cards in the gift shop and enjoyed the musings from a knowdgeable staff.",
  "A necessary part of any trip up to Museum Hill.  Beautiful flowers, trees, sculptures. A great place for a easy and beautiful walk",
  "If  you are into the garden and want to understand more about the local plants -- visit this spot.  It is worth an hour or so to wander around and see what is featured or what looks the best in the season you happened to be there.  As  you would suspect lots of water tolerant plants -- including a few that I had not thought of even though I have a cactus and succulent back yard design.  Be sure to mention it if you are a member of your local arboretum -- then the admission is free as they are part of the national association. ",
  "Loved the sculptures nestled among  the plants at the Botanic Garden. The garden is just across the road from the museum s and you can walk to them. "
 ]
},{
 "name": "Santuario De Nuestra Senora de Guadalupe",
 "address": "100 S Guadalupe St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/65/f5/b4/santuario-de-nuestra.jpg",
 "tags": [
  "walking",
  "walk",
  "walking",
  "walk",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60958-d123658-Reviews-Santuario_De_Nuestra_Senora_de_Guadalupe-Santa_Fe_New_Mexico.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful grounds to stroll and great photo ops! Some grade changes, but easy to get around if you are somewhat limited in walking.",
  "My husband and I visited this church when we were visiting Santa Fe in September, 2019.  It was not open but we could walk around the outside and enjoy the beautiful architecture.  The rose garden is beautiful, too.  This church is worth a visit whem in Santa Fe.",
  "This is a very simple, but beautiful church that you should visit.  The roses outside the main door are absolutely gorgeous and they were in full bloom when we were there the second week of June.  Take time to stop and appreciate the vibrant colors of the roses and this lovely place of worship.",
  "Beautiful grounds to stroll and great photo ops! Some grade changes, but easy to get around if you are somewhat limited in walking.",
  "If you want a very short walk to stretch your legs, or want to buy a souvenir, or a cup of coffee, or a meal, you would benefit by stopping on the High Road to Taos. There are 2 churches, a small park and shops to visit. That is all.",
  "My husband and I visited this church when we were visiting Santa Fe in September, 2019.  It was not open but we could walk around the outside and enjoy the beautiful architecture.  The rose garden is beautiful, too.  This church is worth a visit whem in Santa Fe.",
  "Santa Fe's religious history is embedded in its culture and this lovely church is a piece of that.  It is the oldest shrine to Our Lady of Guadalupe in the country and was beautifully restored after about 200 years.",
  "This is a beautiful place to visit and spend some time in quiet.  So much faith has made this a must-see on any visit to Santa Fe."
 ]
}]
