[
{
 "name": "Abraham Lincoln Presidential Library and Museum",
 "address": "212 N 6th St Northeast corner of 6th and Jefferson",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/89/0f/7e/abraham-lincoln-presidential.jpg",
 "tags": [
  "tour",
  "library",
  "family",
  "nature",
  "library",
  "history",
  "theatre",
  "history",
  "knowledgeable",
  "food",
  "family",
  "library",
  "history",
  "history",
  "drink",
  "family",
  "free",
  "library",
  "kids",
  "tour",
  "walk",
  "family",
  "library",
  "family",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d270646-Reviews-Abraham_Lincoln_Presidential_Library_and_Museum-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "So know that the Library is mostly just for people to come and research - there is almost nothing that you can see if you go to visit.\n\nNow the museum is where it's all at!  The museum is really a great one. There are 2 movies and two sides of the museum - one shows Abe Lincoln's early life and one shows his White House and public life. Both sides were very well done.\n\nThere is also a Subway restaurant adjacent to this museum so you can go have lunch and continue your tour with little interruption.\n\nThere is a gift shop and restrooms here.\n\nWe spent almost 2 hours here.",
  "This is a great experience!  We drove 3.5 hours to Springfield from Chicago, without really much knowledge of what we might experience and it was just incredible.  We really enjoyed the two holographic exhibits, you felt like the holograms, especially the “historians” were real, and the special effects were great.  The most surprising part for me was the candor in which the library presents Lincoln.  Not in the usual “presidential library icon” but more in the context of all that he was dealing with, the division of the states around slavery, the hateful nature of the press, and the stresses within his family. It was fascinating.  The experience of his assination and his body laying in state was so real, you felt like you were there emotionally (no bloodshed or anything). It was amazing.",
  "I was here in early January 2018 and was one of a few patrons that day.  The staff may have out numbered the visitors that day and they were very helpful and informative.  As you enter the Gateway and then onto the Illinois Gallery, Mrs. Lincoln's Attic, Journey 1: Pre-Presidential Years, Union Theatre, Journey 2: White House Years, Treasures Gallery, Ask Mr. Lincoln, Holavision Theater presentation is impressive with its life like holograms. This is a must see for students of Mr. Lincoln, American history and the Civil War.  ",
  "Exceptional experiences....each \"Journey\" presents a treat for both young and old eyes and ears. The Lincoln family history is brought to life. The museum has many life like displays and two theatres. \"The Ghosts of the Library\" is, simply, amazing. Lights, lasers, holograms, etc., makes for a fascinating and realistic adventure. The other, an interactive program reviewing the Civil War is a close second.\nKnowledgeable and friendly volunteers will answer your questions. \nYou might want a light sweater or jacket as the entire building seems a bit cold...probably in an effort to preserve the many and varied artifacts. And, if you are looking for \"real\" food, (as opposed to  the Subway located on site) take advantage of the (same day of purchase) wristbands that allow \"in and out\" privileges and enjoy some local fare.",
  "Traveling from Wisconsin to Branson MO on spring break and decided to make a stop at the musuem. So glad we did! Boys ages 10, 12 and 15 loved it. I loved it!! and I don't even like museums as my history teacher husband would say.  All the displays were so well done and the technology incorporated made it super engaging for the pre teeners as well.  I was amazed at the new information I learned and how much I left LOVING abe.  Don't pay extra for the exhibit across the street, it is not worth it.",
  "A trip to the APL is an unforgettable experience.  I've been through it several times and never get tired of it.  You can spend a whole day there if you read/listen to everything and enjoy a Subway sandwich in the connected café.  The minimum time shouldn't be less than 2 hours to get your money's worth.  It can be toured randomly and be enjoyed, but when I take guests through or am asked for advice, I have found the order that follows to be most beneficial.\n\nLOBBY.  You get tickets and a wrist-band at the counter on the north wall.  Adults $15; Senior 62+ $12; Children 5-16 $6. This may seem a little steep to some, but a movie with popcorn and a drink is about the same price for 1.5-3 hours of sometimes forgettable entertainment.  This place is unforgettable and offers many wise and timeless messages from our greatest president.\n\nPLAZA.  Upon entering the Plaza, the vast size of this space and the life-like figures of the Lincoln family standing ready for group photo ops evoke a sense of awe, and also give an introductory preview of the high quality of the entire museum.  You'll want to have your photo taken with the Lincoln family while in the plaza, and many of the uniformed volunteers in the Plaza will gladly oblige in being your photographer.  I suggest this wait until you are waiting for a “Ghosts of the Library” viewing.  I first head immediately to the Union Theater to check the schedule for the \"Lincoln's Eyes\" production.  I like to attend this first because it tells the story of Lincoln's entire life, which then helps you put all the rest of the museum in context and better understand what you will see in the galleries.  If the next production is more than about 15-20 minutes off, I'll then go either to the \"Ghosts in the Library\" or the Illinois Gallery, which has a temporary exhibit that changes periodically through the year.  Either of these can be toured at any time during your visit, so they make good use of your time while waiting for Lincoln's Eyes.  While you are checking the Lincoln Eyes schedule, have another person in your party get the Ghosts in the Library schedule to help you minimize waiting time.  Checking these schedules is not necessary for those who love to sit and wait or stand in line for things.\n\nUNION THEATER.  This production portrays Lincoln's entire life via an on-stage video narrator coupled with multiple screens of photos, graphics and videos.  The sight/sound/feel sensory elements are of Disney quality and enjoyment.  It is my favorite part of the museum.  If you have the time, it's worth seeing as your first stop on the tour, and then, see it again just before you leave.\n\nJOURNEY ONE: THE PRE-PRESIDENTIAL YEARS.  After exiting the Union Theater, bear to the right and enter this gallery, which has a life-size figure of young Abe at its entrance.  This gallery walks you through his life from birth in Kentucky through his election as President.  The depictions of slavery are a poignant and sorrowful reminder of this shameful part of our country's early history.  After the room with Lincoln's law office is a room with TV monitors.  This innovative display portrays what the presidential race coverage would have been like had there been television back then.  Now-deceased Tim Russert provides election coverage and explains the views of the candidates.  This coverage cycles through about every 5-6 minutes, so I like to wait until the start of a cycle to enter this room.  In the next room, the many political cartoons criticizing Lincoln show quite vividly that journalistic courtesy was not a part of the journalistic landscape back then.\n\nGHOSTS OF THE LIBRARY.  Next, I head to this production.  If the next viewing is more than about 10-15 minutes away, I'll go to either the Treasures Gallery or the White House Years.  The Ghosts of the Library is a masterful presentation of the work that goes on in a Presidential Library via a live on-stage narrator and special effects.  During the presentation the “ghost” of Lincoln appears and speaks.  The special effects are superb and you leave asking, “How did they do that?” presuming your name is not George Lucas.\n\nJOURNEY TWO:  THE WHITE HOUSE YEARS.  This exhibit walks you through the rest of Lincoln’s life following his election as president, vividly documenting the stress and agony he suffered by his unyielding commitment to the Union and the founding principle of our country that “all men are created equal,” (as well as the loss of a second son while in the White House).  Photographs also document how much Lincoln aged during his white house years.  The display of his assassination at the peak of his life’s work always has me wondering how there could have been such non-existent security back then.  The massive room with his casket still causes me to become somewhat emotional as everyone contemplates what a loss his death was to his family and the country.\n\nTHE TREASURES GALLERY.  This exhibit has some interesting artifacts, but if you are on a schedule or are not a history buff, it can be covered in a short amount of time.\n\nTHE ILLINOIS GALLERY.  This room has temporary exhibits.  Currently (March 2015) the “Undying Words” are on display, providing copies of his greatest writings and speeches.  How a self-educated man who learned by fire/candle light could become so eloquent in his writings and speeches is nearly incomprehensible.  This gallery provides something new for those who come back every year or so.  It has contained such exhibits as:  Christmas trees of the US presidents; medical treatment during the civil war; art/photo displays and the like.  You can call the museum to see what this gallery is currently offering.\n\nMRS. LINCOLN’S ATTIC.  This room is great for the kids.  It has Lincoln/Civil War clothing that kids can don for a Lincoln-era photo, and a number of hands-on play items.\n\nTHE MUSEUM STORE.  This store has about every conceivable Lincoln souvenir you can imagine as well as many books about Lincoln and the Civil War.  And what visitor doesn’t want to depart the museum carting an 8-place setting of Abraham Lincoln presidential china and wearing a Lincoln top hat?\n\nPARKING.  If you come to the museum on a weekend, drive around the block to see if there is free on-street parking.  The block on the east side of the museum often has spaces available, or on the block south.  If on-street parking is full, use the parking ramp NW of the museum.  The cost is only $0.75/hr. so it’s a bargain compared to Chicago or any major city.\n\nUNION STATION.  This depot was been restored to its original design into a nifty display of artifacts from the movie Lincoln.  It also shows photos of the depot in various stages of use and decline, and then reconstruction.\n\nUNION SQUARE.  If you have time, walk through this urban park and view the various Lincoln statues.  You might like to be photographed conversing with Lincoln on a park bench on the west side of the square.\n\nOVERALL RATING.  The place is world class and an unforgettable experience for adults, youth and children.  Though avid history buffs may find it a little lacking in written historical documents/displays and a little too Disney-like, most (especially children and youth) will likely find the Disney-like features a plus.  And for avid history buffs, a short walk across the street offers thousands of books and historical documents for reading in the Lincoln Library.  If you have time, I also recommend that you tour Lincoln’s home and the Old State Capital while in Springfield.",
  "We stopped at the Abraham Lincoln Presidential Museum on our Route 66 trip.  The museum was great.  There were many interesting exhibits and lot of good information.",
  "I've been to the LBJ, Carter, and Eisenhower Presidential Museums in addition to this one, and this is the best (although Eisenhower's comes close).  Lots of information on Lincoln, family friendly, and helpful staff.  Some of the exhibits are permanent, some get rotated through.  Two theaters included with admission, both are excellent shows.  Visits in November are often rewarded with seeing a copy of The Gettysburg Address, written in Lincoln's own hand.  Between Thanksgiving and early January a good Christmas display, often with Civil War re-enactors.\nAlthough the name of the site includes a reference to the Presidential Library, the Library portion is primarily a reference service, usually with nothing to appeal to most visitors.",
  "It's great experience.. gives a lot of information about Lincoln and his life, his family. \nMany Inspiring One-Of-A-Kind Exhibits On Lincoln’s Life.\nIt's must visit place in Springfield, IL",
  "Great museum with high end holographic movies and considerable information you likely did not learn in school. If you don't have grandchildren to take, take your parents, they will love it.",
  "A must see in Springfield. I took my wife there for her first time and she said she absolutely enjoyed it would love to visit again."
 ]
},{
 "name": "Lincoln Home National Historic Site",
 "address": "413 S 8th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/b0/97/6c/lincoln-s-house.jpg",
 "tags": [
  "tour",
  "free",
  "tour",
  "tour",
  "free",
  "tour",
  "free",
  "historic",
  "knowledgeable",
  "food",
  "free",
  "historic",
  "tour",
  "tour",
  "family",
  "free",
  "historic",
  "tour",
  "free",
  "walk",
  "knowledgeable",
  "tour",
  "history",
  "tour",
  "tour",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d143197-Reviews-Lincoln_Home_National_Historic_Site-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This site, run by the National Park Service is well maintained and restored, with a visitor's center, a free guided tour of Lincoln's home, and several other restored homes.  We spent two hours which included a 20 minute tour of the home.  The book store in the visitor's center is very comprehensive.",
  "Part of a meticulously preserved four block area that recreates Springfield in the time Lincoln practiced law and served in the legislature, the home alone justifies a visit to Springfield. If a day visit, the home and museum are the top two attractions. Interesting to hear how the tour narration has changed somewhat over the years.",
  "The Lincoln Home (along with two blocks of other preserved pre-Civil War homes) is well worth a few hours of your time, especially since it is one of the very few National Park sites in Illinois.  Start in the Visitor Center, where a dramatized documentary does a great job of presenting the local Lincoln-- before the iconic Washington leader.  You need to get tickets here for a reserved ranger-led tour of the Lincoln Home itself, but they are free.  Then meander the grounds and step into a few other homes that now contain related exhibits.\nThe lot by the Visitor Center is paid parking, but I think it was only a few dollars.  Everything is walkable from there.",
  "First of all, it's free. Second of all, the National Park Ranger was very funny, very knowledgable and a very good tour guide! Keep in mind there's obviously no elevator so a few flights of stairs to climb. The stories were great and definitely gave us a feel for Lincoln, the town and the times. Highly recommend!",
  "Has to be in the top 10 historic sites nationwide. The entire neighborhood has been preserved--lots of money but probably well spent.  Come for your children or come for yourself, but come.  Lincoln is such an inspirational figure and this place is at the heart of the Lincoln story.",
  "The National Park Service operates the Lincoln Home which consists of a visitor center, and a neighborhood of homes preserved as they were in the 1850's.  Lincoln's home is the only one open to the public.  Tour tickets are available (free) on a first come, first served basis at the visitor's center.  We were there mid-week in April and had no problem getting tickets.  I imagine that during the summer and weekends, you need to get there early in the morning.  The park ranger who conducted our tour was personable and knowledgeable.  \n\nStreets are gravel and the sidewalks are boardwalk which help create the historic atmosphere.  The visitor center has some exhibits, a small gift shop, restrooms, and a very good movie.\n\nNo food available on site but there is an excellent restaurant just a block away - Obed and Isaacs.\n\nAccessibility:  limited; the boardwalks have ramps but the Lincoln house itself has steps at entrance, exit, and inside.",
  "The only house Abraham Lincoln ever owned is the centerpiece of this four-block historic neighborhood. Lincoln and his family lived in the two-story house from 1844 until 1861\n\nThis is a free guided tour. Our tour guide was amazing!",
  "Spend a about 45 minutes on the free guided tour of the Lincoln home.\nPainstakingly restored, some of the original furniture is on display Including mary Lincoln’s commode, and cast iron stove.\nPark service guides very knowledgeable.\nMust be able to walk upstairs.\nVery interesting film at the visitor center",
  "Had a wonderful time! Had the tour 2 pm on Sunday the 15th. Our tour guide was amazing! Thank you for a great time and history lesson.",
  "Our tour guide did a great job of sharing information about the Lincoln home and their neighborhood. Very interesting visit. ",
  "What not particularly big, and certainly not an all day outing, this site is completely free, and comes with a guided tour of the Lincoln home. A stroll down the wonderful street and the homes is great. When coupled with a short walk to other Lincoln famous sites it is a “must do”."
 ]
},{
 "name": "Lincoln Tomb & War Memorials",
 "address": "1500 Monument Ave Oak Ridge Cemetery",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/df/73/bd/lincoln-tomb-war-memorials.jpg",
 "tags": [
  "kids",
  "history",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d4310510-Reviews-Lincoln_Tomb_War_Memorials-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Impressive monument to one of our greatest presidents.  Beautiful location, friendly and informative staff and volunteers.  If you come on Tuesday evenings in June, July, or August, there is a retreat (flag-lowering) ceremony by Civil War Re-enactors where the flag that has been flying in front of the Tomb for the past week is given to someone in the audience.  Behind and below the Tomb is the public receiving vault, where Lincoln's body was kept for about 6 months when it was first brought back to Springfield.  In addition to the Lincoln Tomb, Oak Ridge Cemetery is the final resting place for 4 Illinois Governors.  Directly across from the Tomb is a mausoleum designed by Louis Tiffany.  Not too far away are several memorials for WWII, Korean War, and Vietnam War.  Driving around the cemetery near the Tomb you will see several Civil War monuments.",
  "The interior of the tomb is beautifully constructed with granite from many States and countries.  The entry rotunda ceiling is covered in palladium and the tomb area in gold leaf.  The bronze statues are smaller scale copies of full size statues elsewhere in the country and represent Lincoln at different points in his life.  This is a wonderful tribute to one of our most important presidents.",
  "The final resting site of America’s greatest president.\nSerious somber peaceful. Quotes from several of his speeches.\nHalf hour sufficient time to view ",
  "Definitely not a place for small children!!!!Rangers, Pallbearers, Caretakers, Ushers, or whatever, keep telling everyone to hush .  Be real quiet!!! is what you will remember from this boring event.  He's DEAD, he isn't going to wake up.  out of respect for little kids that you make them think he is sleeping is wrong.  If they are loud or not, they arten't going to wake him.. The whatevers should be more aware of what they are promoting here.. Can't wake him  Quit scaring the kids away.. Would never takes any kids to this event!!!!!!!!!!!!!!!!!!!!!",
  "absolutely worth the trip to see this beautiful place.  lots of history.   includes Lincoln's family as well."
 ]
},{
 "name": "Dana-Thomas House",
 "address": "300 E Lawrence Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/02/79/d4/20180518-152352-0-largejpg.jpg",
 "tags": [
  "art",
  "tour",
  "library",
  "tour",
  "tour",
  "practical"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d285325-Reviews-Dana_Thomas_House-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was an early commission for Frank Lloyd Wright and at the owner's request, one wall (and room furnishings) of the original Italianate house remain.  The property was called Sumac House, and the windows feature sumac leaves and the hanging lamps in the dining room feature butterflies.  The most amazing thing about the house is that virtually all of the furniture, art glass, and windows are original, as that was a condition of the purchase by the second owner.  This is an amazingly beautiful house.",
  "We really enjoyed the tour.  It starts out with a short film about the woman who commissioned the home.\nA very interesting person in her own right.\nThe tour takes in many of the rooms including the library, master bedroom, billiard room and bowling alley. Dining room. \nNo indoor photography allowed,  it outdoor is allowed.",
  "Who would of thought that Frank Lloyd Wright would have designed a house in Springfield, IL.?  Built in the early 1900's, it had several novel conveniences that eventually became common place like electric lights.  One very interesting feature was the bowling alley in the basement.",
  "Always a special time to see the Dana Thomas house is Christmas time. One Sunday evening before Christmas there is a candlelight tour. This really gives you the feeling of stepping back into the early 20th century. Frank Lloyd Wright left a jewel for everyone to see here in Springfield.",
  "When touring Springfield, Illinois try to get a tour of the Dana-Thomas House. The tours are especially nice around Christmas. Seeing this house will give you considerable insight to decide if Frank Loyd Wright was a genius or a narcissistic tyrant. Whatever you think of Frank Loyd Wright, the house is beautiful if not particularly practical."
 ]
},{
 "name": "Illinois State Capitol",
 "address": "401 S 2nd St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/3d/83/42/illinois-state-capitol.jpg",
 "tags": [
  "history",
  "learn",
  "art",
  "tour",
  "wander",
  "tour",
  "tour",
  "art",
  "tour",
  "history",
  "walk",
  "walk",
  "walk",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d144702-Reviews-Illinois_State_Capitol-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "For the 4th of July together with our son and daughter-in-law we had the opportunity to see the most beautiful building in our state of Illinois-The new State Capitol \nThe architecture is hard to explained \nThe pictures of the predecessors leaders who served in this building made me to understand the history of our state more clearly \nWe been visiting the Senate and State Representatives chambers \nI do recommend to everybody to go to see and learn from this piece of art building \nI guaranty you wouldn’t regret it",
  "It’s a gorgeous building filled with beautiful architectural features inside and out, as well as priceless fixtures and decor. Best to take a guided tour to get plenty of interesting facts and information about the building and the important people who have worked there.",
  "I went to the building by myself. It was a must do I heard. So you go through a metal detector and then you have the choice to wander on your own or a guided tour(unknown cost). I wandered. I would start on 4th floor and work your way down. It was fun just opening doors and checking out different rooms. The building itself was amazing. I would make this a must see if in Springfield!",
  "It is a gorgeous building and well worth seeing inside and out. Don’t give up on parking, just drive around until you see your garage or spot.",
  "Hi again---it's the travelin' agents from Consumers Travel World. We've seen many state capitol buildings and this is one of the better ones. Very high dome and very ornate design. Statues and paintings everywhere. A quick and informative tour (half-hour) by a friendly, well-informed young man. Visit at your leisure and level of interest since there is plenty to see.",
  "The capitol building in Springfield, Illinois is one of the most majestic buildings in the United States.  There have been a lot of  construction upgrades recently so it is a great time to visit. Try to visit when the legislature is in session (primarily scheduled days from February through May--look on ilga.gov website. Great for school groups or children to see the legislature in action. Tell your representative and/or senator that you are coming and they will likely meet with you and have your group recognized from the floor of the House or Senate.  Don't forget to look in on a committee hearing if there are hearings scheduled. There are guided tours that begin on the ground floor.  Ask to see the state seal at the top of the dome where sovereignty is misspelled as sovereignity!",
  "The Illinois capitol is one of the most impressive for exterior and interior both. The art and  the decorations are impressive.\nYou should take a guided tour. The tour guides are very nice.",
  "We did not do a tour. They were closed due to our bad timing. The whole world was shut down but they did allow walk throughs of the first floor and we met Joel who, a guide there, told us so much history and showed us around as much as we could see. He was wonderful! Thank you Joel!",
  "Area around capitol was nice and clean. Lincoln’s home was just a short walk away. Can walk anywhere on grounds you want. ",
  "This place is amazing just to walk around and explore. The building is beautiful. There are tours available if you want to know everything.",
  "I go to the Capitol often because I have family that works there. This building is one of the prettiest in our city. It’s open daily for tours. Just tell the security guard and they’ll direct you in the right direction. You have to stop in the center and look up at the dome. The stained glass is beautiful. My daughter and I stop and look up literally every time we go in. On the second floor look down from the rail. Sit in the gallery and view the house or the senate. The chandeliers in the House chamber are to die for. Also, it’s caused quite a controversy, but the west doors are also an architectural site to see. So many historical things have happened under this dome. It’s definitely a place to check out!"
 ]
},{
 "name": "Old State Capitol State Historic Site",
 "address": "5th & Adams Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/8e/4b/94/old-state-capitol.jpg",
 "tags": [
  "historic",
  "art",
  "wander",
  "history",
  "wander",
  "tour",
  "tour",
  "tour",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d107430-Reviews-Old_State_Capitol_State_Historic_Site-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "There are certain places in this country that give a citizen a sense of awe when they visit them; this is one of them.  It's the place where a man who became our greatest President learned the art of politics, and made his prescient speech about \"A house divided\".  Moreover, it gives you a real life picture of the workings of State government in the mid-19th century.  The rooms and exhibits are very well identified, and the docents are well-informed and eager to answer your questions.  A lovely building of great historic importance.",
  "You are welcome to wander around at your leisure.  This is a beautiful building, and it is so interesting to be able to see where both President Lincoln and President Obama each announced their presidential candidacies.\n",
  "I've been to Springfield numerous times but this place wasn't open, or else I was oblivious.  What a joy to finally get inside and see some beautiful rooms--the Supreme Court room is especially interesting...and Lincoln was there 234 times for cases.  Wow!  Many rooms seem reminiscent of Independence Hall in Philadelphia.  It doesn't take long to wander around--there are tours available, but we arrive at the starting time.  Soak up the history!  ",
  "This was an interesting visit.  The building itself was something to look at.  We were able to talk to some staff members and they shared some great information. ",
  "The place is amazing and If u are visiting Springfield u should visit this place. We completely enjoyed our guided tour.",
  "We completely enjoyed our guided tour. The docent was excellent and enthusiastic presenter. Well worth a visit.",
  "The place is amazing if you are nearby you should come here. There is a underground parking garage that you can Access this building from.",
  "Yes, there is an old State Capitol and a new State Capitol in Springfield, Illinois. The 1840 Old State Capitol is a great tour and a great photo op. The volunteer tour guides are great. It's only 100 yards, or 100 meters from the Abraham Lincoln Library and Museum, and across the street from Abraham Lincoln's law office, and only a few blocks from his home so you can see it all in one afternoon."
 ]
},{
 "name": "Illinois State Museum",
 "address": "502 S Spring St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/21/6c/a4/filename-ism-bldg-mc.jpg",
 "tags": [
  "history",
  "kids",
  "free",
  "kids",
  "kids",
  "art",
  "kids",
  "history",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d2283849-Reviews-Illinois_State_Museum-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "What a great surprise to visit this museum. It is a total Gem. If your into natural history this museum ranks more attractive to bigger well know museums that are in much larger cities. The displays are awesome and the scientific displays of past life is truly awesome. Don't miss seeing this museum.",
  "Give yourself several hours to enjoy this museum.  Excellent displays and good for all ages.  A clever use of multimedia too.  I didn't visit the basement, but the main floor and 2nd floor kept us busy for several hours.  I do wish they had a gift shop and a small cafe though.  Museum gift shops are a great way to raise extra funds for the operation.",
  "The Museum has survived the budget cuts and slashing by the soon to be gone administration.  The first floor displays are great for everyone, while there is also a great educational kids area in the basement.  The upstairs has some permanent dioramas, and fantastic rotating displays/exhibits.  Free admission for seniors, and modest charge for others. ",
  "This gem is a nice spot for kids as well as adults with captivating displays. Check out the paperweights!",
  "We enjoyed a couple of hours at the museum.  Went for the 4 year old and he enjoyed the hands on area, the animal bones and seeing the animals on exhibit.  The movie kept him interested.  He was ok with the art exhibit, but really enjoyed the science guy who was standing by the mastodon to answer questions... He really interacted well with our grandson.   They have special events for kids throughout the year.  We missed the Halloween event by days,,,",
  "Hubby and I enjoyed most of the museum. The art exhibits were  not interesting. This is great for kids studying Natural and American history. Although many people will argue about the scientists timelines and animal existence, the rest of the information is good. Many interactions for kids of all ages. The only negative about this museum is the parking.  There is NO parking on site. Parking area is 3-4 blocks away.",
  "Lots of native American artifacts...........and the dioramas are great.........they give you an idea of what life was like for the Kickapoo in Illinois.",
  "They have so much.  One area explains what the area looked like before european sttlers.  Fascinating.  Other areas have good artifacts.  Great art."
 ]
},{
 "name": "Washington Park",
 "address": "1501 S Grand Ave W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/ec/e5/34/it-s-beautiful-and-family.jpg",
 "tags": [
  "kids",
  "art",
  "walking",
  "art",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d8961493-Reviews-Washington_Park-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This beautiful tower of bells (played with a piano-like keyboard) is a Springfield landmark and has been played by world renowned musicians. Located in Washington Park it is a great destination for a pleasant afternoon. With great access to walkers, runners or bikers the park itself is a lovely spot to visit. One can picnic, visit the rose gardens or simply sit on a bench listening as the beautiful tower of bells is playing on any given day, but it’s certainly especially fun during the Carilon Festival or the Art Spectacular Festival (in September). If visiting Springfield, take the kids- they may not get another chance to see or hear this beautiful and rare instrument.",
  "This park is beautiful year round but it is especially beautiful in the fall around the end of October. The maple trees here are magnificent.  Make sure you take some time to take a stroll on the pedestrian walkway around the park. ",
  "Walking, playing, leaf peeping, listing to the massive Carrillon bells or going to one of the festivals held there from art, crafts, carving the pumpkins, the lit pumpkins, the rose garden and more.  Make a stop and enjoy!",
  "We very much enjoyed walking this park. However if you walk along the water there is geese Poopoo everywhere. Don’t get too close to them, they are not scared of you and will run near you.",
  "Enjoyed our visit, especially the carillon concert. The park features a large variety of plantings. I'm sure the city is budget challenged to maintain the grounds, but some of the plants and beds could use more attention."
 ]
},{
 "name": "Illinois Governor's Mansion",
 "address": "410 E Jackson St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/2a/e3/d2/the-outside-of-the-governors.jpg",
 "tags": [
  "family",
  "free",
  "historic",
  "tour",
  "art",
  "structure",
  "tour",
  "family",
  "historic",
  "tour",
  "walk",
  "tour",
  "walk",
  "tour",
  "learn",
  "tour",
  "history",
  "free",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d279105-Reviews-Illinois_Governor_s_Mansion-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was first time touring the Governors Mansion and we were impressed with the building, grounds, renovations, and furniture and artwork on display. Politics aside, Diana Rauner did a wonderful job overseeing the restoration and obtaining private donations for the project. Would like to go back and see how it’s decorated for Christmas.",
  "Built in the mid-1850s in the Italianate style, this 16-room mansion is one of the oldest historic residences in the state and one of the three oldest continuously occupied governor's mansions in the country. Today, it is mostly used for ceremonial purposes and as a house museum - the governor and his family has a private seven-room apartment on the second floor that is separate from the public spaces.\n\nAs one might imagine for a 150+ year old structure, there have been many restorations and updates over the decades. In the late 1890s, alterations to the exterior updated to include some neo-classical elements. Winter storms in 2014 caused significant water damage. Although limited emergency repairs were accomplished at the time, a more extensive renovation was undertaken in 2016, completed two years later in time for the state's bicentennial at a cost of  $15 million dollars (raised privately). Today, the public spaces are maintained to match a late 19th century appearance - this includes the furniture, wall and floor treatments, etc. One exception to this is the rotating gallery of art on display which is clearly very modern and something, that to this visitor at least, was somewhat jarring.\n\nWe took the roughly one hour free tour on a weekend afternoon with a group of about half-a-dozen. It was interesting to see the high-end 19th century interior details and the period furniture pieces. We were particularly impressed with the 17-piece suite of hand-carved bedroom furniture created by Illinois farmer William Bartels for the 1893 Columbian Exposition in Chicago. The tour was definitely worth the time.",
  "Road trip!  Following our visit to the State Capitol, we stopped by the Governor’s Mansion. This tour was outstanding and the tour guide provided a ton of great information and had answere for all questions posed by members of the tour group. The tour obviously focuses on the historic portion of the mansion and a few rooms that are still used, but don’t expect to see the current living quarters of the Governor and his family. A fun tour of a historic home. They recently completed a three year, $15 million renovation project and only reopened in July, 2018. Definitely worth the time! Note, no pictures are allowed inside the Mansion, but you can take all you want of the exterior. Also large bags and backpacks are not allowed onto the grounds.",
  "I was fortunate to also have been invited to a function there and have a great dinner in the mansion and a wonderful tour.  The governor may not actually use it but it is a building that is worth seeing especially if you get a great tour guide who can tell you interesting tidbits too.  Phyllis was our tour guide and she is outstanding.  I enjoyed looking at the furniture and the plates etc.  It has a beautiful spiral staircase and also enjoyed the story of the workman back in the 70's who was working in the attic and feet fell through the plaster and another workman saved him by pulling him up by his hair...he has a bald spot now.  The landscaping and flowers are well tended and add beauty to the outside.  Only open on certain days during different seasons so you will want to check your time of year and the hours open then.  If you need parking it is on street only but not hard to find.  If you are staying downtown you can just walk a few blocks as is right on a main street of S. Fifth.  ",
  "I was fortunate to also have been invited to a function there and have a great dinner in the mansion and a wonderful tour.  The governor may not actually use it but it is a building that is worth seeing especially if you get a great tour guide who can tell you interesting tidbits too.  Phyllis was our tour guide and she is outstanding.  I enjoyed looking at the furniture and the plates etc.  It has a beautiful spiral staircase and also enjoyed the story of the workman back in the 70's who was working in the attic and feet fell through the plaster and another workman saved him by pulling him up by his hair...he has a bald spot now.  The landscaping and flowers are well tended and add beauty to the outside.  Only open on certain days during different seasons so you will want to check your time of year and the hours open then.  If you need parking it is on street only but not hard to find.  If you are staying downtown you can just walk a few blocks as is right on a main street of S. Fifth.  ",
  "The tour is a half an hour at the most, but you learn a lot and see many different and interesting rooms within the Mansion. There is no cost and it is easy to find parking near by.",
  "This was first time touring the Governors Mansion and we were impressed with the building, grounds, renovations, and furniture and artwork on display. Politics aside, Diana Rauner did a wonderful job overseeing the restoration and obtaining private donations for the project. Would like to go back and see how it’s decorated for Christmas.",
  "Really enjoyed the experience of being in the Governors Mansion.\nMy favorite room was the Dining Room with the very long table and the beautiful chandelier.",
  "This is a free guided tour.  The guides will unlock the front gates to let you on the property near the appointed tour times.  Photos are permitted of the grounds and mansion exterior but not inside.  You will tour 3 floors.  The starting point is a short film about the mansion.  The guide will go over history of the families who lived here over the years and what different rooms were and are used for.  There are some beautiful hand carved pieces of furniture prepared by a self taught woodworker.  The stairway bannister is lovely.  They showcase different artists so while we were there it was more of contemporary art which sort of clashed with the old historical portraits and paintings.  It was a nice tour but we have been at more beautifully appointed Governor's mansions in other states so that is the only reason why we gave this one an average rating.  ",
  "Interesting.  Not long enough, time-wise, in my opinion. No photography allowed inside.  New rule since we visited, must make reservations 48 hours in advance.",
  "Great job done bringing mansion back to this stage. Interesting furniture inside. Great tours given from 1 to 4 pm. Your take almost one and half hours. "
 ]
},{
 "name": "Edwards Place Historic Home",
 "address": "700 N 4th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/49/98/65/edwards-place-historic.jpg",
 "tags": [
  "walking",
  "history",
  "family",
  "tour",
  "art",
  "historic",
  "art",
  "tour",
  "knowledgeable",
  "tour",
  "history",
  "knowledgeable",
  "tour",
  "art",
  "tour",
  "wander",
  "family",
  "art",
  "tour",
  "learn",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d2691159-Reviews-Edwards_Place_Historic_Home-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "I recently enjoyed a visit to the newly renovated Edwards Place Home and it was worth the trip!  This home's lower level has been fully renovated, and the attention to detail is extraordinary.  Walking through Springfield's oldest home was like like taking a step back in time - the furnishings and artwork are lovely, the authentic wallpaper was a nice touch, and the highlight was viewing the Abraham Lincoln \"courting couch\".  Our tour guide Erika was full of knowledge and stories of the home, and had great enthusiasm for the home's history.  We were told that the home's second level will be receiving an update in the next few years, and I will be returning to see those results too!  Plus, don't miss taking a look at the Nelson Family art gallery while visiting the Edwards Place - their rotating art exhibits are nicely done.",
  "The recent renovations have been meticulously and beautifully done, with great attention to historic and architectural detail.  A bonus is that Edwards Place is on the campus of Springfield Art Association, so one can take in a view of whatever exhibition is currently on display in the adjacent gallery.",
  "The mansion is and has been, an ongoing project. Our visit today was limited to the first floor, since they are installing carpet in the upstairs. The wood mouldings, carpeting and wallpapers are really a sight to behold. An open format, allows the visitor  to roam through the rooms freely. Certain artifacts are off limits, due to age and frailty, but that goes without saying. Tour guide is very knowledgeable, with a very pleasant and outgoing personality.  Well worth my time and probably yours too.",
  "Interesting home that played a minor role in Lincoln history. Tour guide was knowledgeable but a bit on the sarcastic side.",
  "A wonderful guided tour of the Edwards home.  They were best friends of the Lincoln.s. Beautiful furnishings and memorbilia of the times.  An art gallery where lessons are given is next door.   ",
  "A one hour tour in the Edwards home was worth the time. The home is recently restored and still a work in progress which made the tour that much more interesting. It is not a tour for children but is a house where you are not bound by rope lines and you can wander for close up views of the items. Our guide was very informative and enthusiastic. A visit here will round out your Lincoln tours and will be especially informative about Mary Todd.",
  "Mary Lincoln lived in the Edwards family home for a while, and some of the original items were out on display; they apparently rotate what is on display so you can go back and see new items.  Was slightly confused that it was \"attached\" to the art museum, but overall was a wonderful place!!! ",
  "Take the tour and learn some of the fascinating facts from this wonderful home. The rooms are so well presented and the guides dress in character to portray local residents.\nA nice little gift area blends in well as a tribute to the art association."
 ]
},{
 "name": "Lincoln Memorial Garden",
 "address": "2301 E Lake Shore Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/a3/03/57/one-of-the-many-paths.jpg",
 "tags": [
  "hike",
  "walking",
  "family",
  "family",
  "history",
  "free",
  "kids",
  "walking",
  "nature",
  "walk",
  "hike",
  "walking",
  "walk",
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d268962-Reviews-Lincoln_Memorial_Garden-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "I live 10 miles from Starved Rock State Park (where I have been a trail guide) and am even closer to Matthiessen SP, which means that some of the most gorgeous hiking venues in the entire state are practically in my back yard. So why do I even hike here, over 100 miles from home?\n\nI discovered this amazing place on my way home from a trip to the St. Louis area and it is now a must-stop either on my way to or home from the St. Louis area. I have some orthopedic issues and appreciate that I can satisfy my hiking need without having to strap on heavy-duty knees braces, as the elevation changes are not that severe. One can hike through the woods and then enjoy views of Lake Springfield.\n\nThe visitor center has restroom facilities, a small gift shop, and very helpful and friendly volunteers.  \n\nPLEASE NOTE: During the COVID-19 closure, the center will be closed. my last stop was in November or December 2019, so I'm not even certain that the trails are open right now. You will need to check with officials.",
  "Was awestruck with the trees in bloom and the native plants.  Went there for their wonderful yearly fundraiser of plants, trees for sale and just walking the short distance to the building for that enjoyed the garden immensely!  Staff were wonderfully helpful too!  Love this place!",
  "Lincoln Memorial Garden is a great area for hiking and snowshoe or cross country skiing in winter.  It is situated on Lake Springfield and is dedicated to family fun.  Special events include a pancake breakfast, plant sales, Christmas shop, and spring luncheon.  All are geared for families and home improvement of natural areas.  It is peaceful and is home for lots of wildlife especially birds.",
  "There are some great trails here for runners or walkers - some are along the lake - all are beautiful.  Don't bring your family pet - dogs are not allowed.  Paths are nice and can be used by all ages, including larger groups.",
  "The location is near the center of Springfield, IL. If you care to, a lot of history can be learned while visiting. The grounds are well kept and parking is easy and free. Don't forget to rub Lincoln's nose for good luck!",
  "Before having kids, my wife and I used to come here and nature walk as a way to relax on the weekends.  In fact, right after we were married and returned from our honeymoon, a nice man took a picture of us on one of the bridges and that picture is now in our home in a frame.  \n\nNow that we have two little toddlers we enjoy coming here on the weekends when the weather permits.  Both our kids love to walk through nature.  The lake (\"seaside\") views are extremely relaxing--enough so that they feel like Door County, Wisconsin.  The gardens and paths are well maintained, which makes walking the trails enjoyable.  There are some other larger gardens within 100 miles, but really if you want to stay local this is always a treat.\n\nDuring one of our visits, our two year old daughter got within 15 feet of a doe.  That's a memory we'll always have and I think the look on her face sums up my feeling of the Lincoln Memorial Gardens.",
  "I live 10 miles from Starved Rock State Park (where I have been a trail guide) and am even closer to Matthiessen SP, which means that some of the most gorgeous hiking venues in the entire state are practically in my back yard. So why do I even hike here, over 100 miles from home?\n\nI discovered this amazing place on my way home from a trip to the St. Louis area and it is now a must-stop either on my way to or home from the St. Louis area. I have some orthopedic issues and appreciate that I can satisfy my hiking need without having to strap on heavy-duty knees braces, as the elevation changes are not that severe. One can hike through the woods and then enjoy views of Lake Springfield.\n\nThe visitor center has restroom facilities, a small gift shop, and very helpful and friendly volunteers.  \n\nPLEASE NOTE: During the COVID-19 closure, the center will be closed. my last stop was in November or December 2019, so I'm not even certain that the trails are open right now. You will need to check with officials.",
  "Very pretty walking space and trails along the river and still space for our little one to run around.",
  "Basically a long walk through natural woods. Nicely maintained. It was nice to get away from the traffic for a while, but this should have been toward the bottom of our list of places to see.",
  "Lincoln Memorial Gardens is an undiscovered gym on Lake Springfield. It is 100 acres of wooded trails offering short medium and up to 5 miles of walking or jogging on wood chip covered paths. In the summer the paths are shaded by tall trees and shrubs in the fall leaves are everywhere and it is beautiful.",
  "I live withing walking distance to LMG.  It is a very nice wood-chipped trail(s) that reach the banks of Lake Springfield.  The paths are great for jogging."
 ]
},{
 "name": "The Lincoln Home Visitor Center",
 "address": "426 S 7th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/fc/21/c3/lincoln-home-visitor.jpg",
 "tags": [
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d12852815-Reviews-The_Lincoln_Home_Visitor_Center-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "There's buttons to push, movies to watch, and touch-able exhibits (not all exhibits are touch-able). Staff is friendly.",
  "Nice beginning for the Lincoln home tour.  Nice movie and the book store is nice too!  Friendly staff.\n",
  "It was a quiet day in Springfield, it was a Saturday.\nThus, we had a private tour of the house with a park ranger.  \nShe was knowledgable and answered all our questions.",
  "Great visitor center, there is where you get tickets for the House visit.   Good movie and small gift shop",
  "Stopped in to get the lay of the land as I set out on a city tour...had everything I needed, including maps and guides. Big model of the area to scope everything out. Friendly staff."
 ]
},{
 "name": "Henson Robinson Zoo",
 "address": "1100 E Lake Shore Dr",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/30/a3/bc/wolverine-came-to-greet.jpg",
 "tags": [
  "knowledgeable",
  "kids",
  "unique",
  "walk",
  "kids",
  "active",
  "kids",
  "walk",
  "drink",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d207432-Reviews-Henson_Robinson_Zoo-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Small zoo run by the Springfield Park Department.  Friendly and knowledgeable staff who are willing to answer questions about animals.  Small setting is perfect for toddlers and young children.  Playground inside the zoo is fun, and there is a city park just across from the parking lot.",
  "The zoo is located over by the Lake.  I've been to many a zoo but this one was quaint with an extensive population of animals.  We saw eagles, penguins, a sloth, snakes, monkeys and more.  Even saw a deer that wasn't in captivity.  Great education classes for the kids too.  Pleasant way to spend an afternoon in Springfield.",
  "This zoo is getting better every year. They are one of only a dozen or so zoos that have a wolverine. There are many unique animals and the African penguins love the warm weather and can be seen swimming as you walk in. Great education programs.and staff.",
  "This is definitely not a big city zoo, but it is a nice quiet setting to take a break for a few hours.  We packed a picnic lunch and took some time for our kids to play on the playground too.  We came to Springfield mainly to visit the Lincoln sites, but this was a nice addition to our trip.",
  "This provides a pleasant afternoon for families with young children. If you are familiar with \"big\" city zoos, this will seem quite small.",
  "This is a very small zoo but worth the time spent. It is the kind of place that you can take your time and explore without crowds or lines. I would suggest a couple of hours at least here. Check online for special events.",
  "This was a nice little zoo that families can enjoy. It's not as big as Brooktfield zoo but it's very enjoyable as they have an assortment of small animals and exotic birds to look at and they have an area where You can feed the goats which is fun.",
  "This is a fairly small zoo but well maintained.  Unfortunately is was a very brisk fall day and a lot of the warmer weather animals were off of exhibit but some of the others like the bears and wolves were really active.  Being a smaller zoo made it easier on our little kids, both toddlers were able to walk the whole zoo without any problems.  They really enjoyed the interactive elements like feeding the goats and ducks/fish.  All four kids loved the playground.  We probably spent 45 minutes there alone.  Total we spent about 2 hours here and saw everything.",
  "Really a nice little zoo right off the lake in Springfield!  First time I have been able to visit, because it has been closed the last few times I try (I’m usually here in winter). All of the animals were happy and healthy and my son loved the little train and all the lemurs.  If I could say any recommendations, I would love to see them open longer...  and maybe a bit more landscaping...  but other than that I really enjoyed it!  ",
  "We often visit the zoo in many different locations. This one was very clean and well kept. Limited on the number of animals but still enjoyable. The layout is easy to maneuver. We were pleased to find a number of species we'd never seen before.",
  "We were visiting from Ohio. We love animals so decided to stop here. This is a smaller zoo, but it is fairly easy to walk the entire zoo that way. There's special animals throughout, and there is a feed machine by the goats. Some of my favorite animals were: Sloth, Wolverine, Eagle, Lemur, Prehensil-Tailed Porcupine, White-Nosed Coati, and the Red Wolf. The day we went it was hot, and we were able to buy a low cal yet refreshing Bai drink at the zoo. We now buy them in cases at Sam's Club. If in the area again I would return here. It's not going to have the amount of animals a big zoo would, but there's plenty to see to keep you entertained for a few hours."
 ]
},{
 "name": "Illinois State Military Museum",
 "address": "1301 N Macarthur Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/56/2c/f1/illinois-state-military.jpg",
 "tags": [
  "free",
  "history",
  "history",
  "history",
  "free",
  "kids",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d3935576-Reviews-Illinois_State_Military_Museum-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This a nicely done small military museum. It is housed in a stone armory and has helicopters and other military vehicles in the front. Camp Lincoln, the National Guard post, is adjacent. The hours are limited but worth the time if they're open! And, it's FREE!!!",
  "The Illinois State Military Museum was a wonderful surprise.  It has a wide range of artifacts well displayed.  The museum shows the story of Illinois military history from 1812 until the present.  The museum's artifacts are often displayed in an interesting scene.  Depictions of WW1, WW2, Korea, and Vietnam use figures to bring the items to life.  It is an educational place to bring children to, yet it has many artifacts to interest the military history buff.  The size of the museum is nice.  You feel that you have seen many things, but it doesn't require hours of time.  \n      The museum has displays on two levels.  The second floor has an elevator for acess, and there are bathrooms located on the first floor.  The museum has a selection of gift items, as well as a book sale. ($5 a book/ two for $8)   There are two boxes for donations located in the museum.  \n     The museum also has an outdoor display area which has two helicopters, two howitzers, a tank, and an anti-aircraft mobil vehicle.   The museum has short operating hours.  On the Saturday we went, it was open from 1pm until 4:30pm.",
  "The Illinois State Military Museum was a wonderful surprise.  It has a wide range of artifacts well displayed.  The museum shows the story of Illinois military history from 1812 until the present.  The museum's artifacts are often displayed in an interesting scene.  Depictions of WW1, WW2, Korea, and Vietnam use figures to bring the items to life.  It is an educational place to bring children to, yet it has many artifacts to interest the military history buff.  The size of the museum is nice.  You feel that you have seen many things, but it doesn't require hours of time.  \n      The museum has displays on two levels.  The second floor has an elevator for acess, and there are bathrooms located on the first floor.  The museum has a selection of gift items, as well as a book sale. ($5 a book/ two for $8)   There are two boxes for donations located in the museum.  \n     The museum also has an outdoor display area which has two helicopters, two howitzers, a tank, and an anti-aircraft mobil vehicle.   The museum has short operating hours.  On the Saturday we went, it was open from 1pm until 4:30pm.",
  "There is a docent available to answer any question. Small but well worth the time. Being small it does have a crowd so it feels like you have the place to yourself.",
  "Went to the museum in hopes of seeing Santa Anna's wooden leg (still out for restoration until hopefully sometime in 2020. It's a small museum but loaded with history. Uniforms and the arms they used as far back as the Spanish American war. There are a few examples of A. Lincoln too (check out the board Lincoln used as a target with a Spencer rifle.Outside you can also see some of the tanks, helicopters, etc. that was used in different wars.",
  "Located in the 1903 Commissary Building (also known as the castle for its fortress-like architecture) at the Illinois National Guard headquarters at Camp Lincoln, this museum covers all of the wars and military actions that Illinois' service men and women have taken part in from the War of 1812 through the Global War on Terror. Their stories are covered in artifacts (the museum's collection contains over 10,000 of them, but not all are on display at any one time), images, battle flags, weapons, vehicles, dioramas and models, and information placards - often focusing on the actions involving individual service personnel in their own words.\n\nOn our recent visit, we had the gallery pretty much to ourselves - it is arranged in chronological order so it is relatively easy to follow. We were surprised by some of the artifacts on display - for example, there is a small block of wood with several bullet holes in it. At first glance, the response might be - so what? But, it turns out that this particular piece of wood was used for target practice by Pres. Abraham Lincoln when he was inspecting the new Spencer repeating rifle at the White House in 1863. The actual rifle he fired is in the Smithsonian, but the block of wood that bears witness to his shooting skills is here on display.\n\nUnfortunately, the museum's most famous artifact, the artificial leg of Mexican general Santa Anna which was captured by Illinois' troops during the Mexican War, is currently undergoing conservation (it'll be another three or four years before it is back on display according to curator we spoke with), but there is still plenty of interesting material to see - from a Spanish-American War era Gatling Gun to the shattered windshield of a Humvee which protected an Illinois Guardsman riding in the vehicle when it was hit in the Mideast. There are captured Confederate battle flags and helicopters from Vietnam. We even got a behind the scenes look at the new D-Day exhibit opening on the 75th anniversary of the invasion that will be on display for the rest of the year.\n\nWe spent over an hour here and learned a lot - best of all it's free.",
  "This is a small but interesting museum.  They have actual howitzers, guns and a Vietnam era helicopter on the grounds, great photo ops for kids and those so inclined.  The collection includes objects from all the wars since Illinois became a state, and relates those objects to Illinois soldiers that used them.  They also have a few dioramas depicting battlefield scenes.  It doesn't take long to visit and it is free.",
  "The Illinois State Military Museum was a wonderful surprise.  It has a wide range of artifacts well displayed.  The museum shows the story of Illinois military history from 1812 until the present.  The museum's artifacts are often displayed in an interesting scene.  Depictions of WW1, WW2, Korea, and Vietnam use figures to bring the items to life.  It is an educational place to bring children to, yet it has many artifacts to interest the military history buff.  The size of the museum is nice.  You feel that you have seen many things, but it doesn't require hours of time.  \n      The museum has displays on two levels.  The second floor has an elevator for acess, and there are bathrooms located on the first floor.  The museum has a selection of gift items, as well as a book sale. ($5 a book/ two for $8)   There are two boxes for donations located in the museum.  \n     The museum also has an outdoor display area which has two helicopters, two howitzers, a tank, and an anti-aircraft mobil vehicle.   The museum has short operating hours.  On the Saturday we went, it was open from 1pm until 4:30pm."
 ]
},{
 "name": "Camp Butler National Cemetery",
 "address": "5063 Camp Butler Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/03/85/e6/20160918-172803-largejpg.jpg",
 "tags": [
  "historic",
  "walking",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d3478491-Reviews-Camp_Butler_National_Cemetery-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Every time I go here it is so serene and beautiful.  I have been twice this year.  But really next time want to go visit the Civil War Confederate graves.  This was at one time a prison camp so some are buried here I believe in the Eastern section.",
  "I was so priviledged to be able to come to the cemetery. It was somber, respective and historic. My ancestor trained there prior to joining up with the Union out of Stephenson County. I am so proud to say he served with the Illinois 46th Company C . The information available was such a  fascinating read and I am most appreciative.. thank you.",
  "Camp Butler was established in 1861 as a training base for Illinois recruits joining the Union Army. It grew to become the second largest camp in Illinois (after Camp Douglas in Chicago). It also housed Confederate POWs captured at Fort Donelson. Conditions weren't always the best and several hundred troops and prisoners died while here, most from diseases like small pox, typhoid, etc. \n\nThese were the first soldiers to be buried here - the Confederate graves, located near the front of the cemetery, are marked with distinctive pointed tombstones. They also are set apart as they are not arranged in neat rows like the rest of the graves. In the early days, graves were not so carefully arranged. While all of the Union soldiers were eventually reinterred in the conventional rows, the Confederates were not, leaving them in their original somewhat haphazard arrangement.\n\nAfter the Civil War, the camp became a national cemetery and today servicemen from all subsequent wars are also buried here. The cemetery today covers some 50 acres.  There are relative few monuments - a small one near the Confederate graves, and a larger one in the \"new\" section honoring all of the U.S. military services. Near this are some small monuments to LST sailors, Seabees, and a RCT from the Korean War.\n\nThere is at least one Medal of Honor winner buried here - a sailor (Seaman John Catherwood for actions in the Philippines in 1911). While walking around, we came across a section with memorials for servicemen whose remains were never recovered, who were buried at sea, or who were cremated and their ashes scattered. Here, we found two more Naval personnel of particular - one lost on USS Utah during the Pearl Harbor attack and another lost when USS Scorpion was lost at sea in 1968. Of course, all servicemen are important, but these were two particularly well known historic incidents.\n\nWe found the cemetery very well maintained and a fitting tribute to these American heroes.",
  "This cemetery contains Veterans of all wars including  graves of Confederate Soldiers. It is on the outskirts of Springfield and easy to get to.",
  "A final tribute to those that served in our military service and their spouse.  My husband is buried there.  I have participated in Wreaths Across America and Patriot Guard honors here. Our National cemeteries are treasures. The people connected to them do a great job. Always stop in the office and tell them \"Thank You\"."
 ]
},{
 "name": "Ergadoozy Creative Play Center",
 "address": "1320 S State St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/df/c6/3b/getlstd-property-photo.jpg",
 "tags": [
  "kids",
  "free",
  "kids",
  "free",
  "kids",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d7066790-Reviews-Ergadoozy_Creative_Play_Center-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our kids love the park, but when it is tooo cold outside to play ergadoozy is awesome.  There are play areas for all ages.  This is not a placed where your kids play and you just watch, you can play with them and it is really enjoyable.  There is plenty of seating for adults that just want to watch.  Great price to pay for your child and adult is free.  After an afternoon of play the kids crash fast!  This place also is clean for all the kids running around the baby and toddler areas do not smell like diapers and they even have a bucket to put yucky toys.",
  "Have taken my grandchildren here on several occasions to run through the maze of nets, and climb, chase, and yell at each other. I on the other hand can sit with other adults and watch from a distance,read a book or use my iPad.",
  "Our kids love the park, but when it is tooo cold outside to play ergadoozy is awesome.  There are play areas for all ages.  This is not a placed where your kids play and you just watch, you can play with them and it is really enjoyable.  There is plenty of seating for adults that just want to watch.  Great price to pay for your child and adult is free.  After an afternoon of play the kids crash fast!  This place also is clean for all the kids running around the baby and toddler areas do not smell like diapers and they even have a bucket to put yucky toys.",
  "Our girls (ages 5 and 7) had a good time here. It’s smaller but nice and was not busy while we were there. Snack prices and gift items were all reasonably priced which normally we see these kinds of things marked up. It was a good place to let kids run off some energy.",
  "Our toddler loved getting a chance to run around and play after long stretches in the car. We loved the safe, clean environment and the variety of toys available. Stopped on both legs of our trip and will be sure to plan future stops when traveling through the area.",
  "Have taken my grandchildren here on several occasions to run through the maze of nets, and climb, chase, and yell at each other. I on the other hand can sit with other adults and watch from a distance,read a book or use my iPad.",
  "Stopped here to have some fun playtime. This spot has great play areas for kids, there’s a play spot for just about every age group up to 10/12ish. There’s a spot perfect for crawlers, toddlers, the main play area (with all the climbing, slides, etc.. that you see in the pics) is perfect for preschool up to elementary school kids (who still like to play on playgrounds). We will be back, for sure. The place is climate controlled so it’s perfect year round! Everyone must wear socks in play areas (no shoes) and bring some extra $ to buy some snacks! They do also have an expansive toy store for browsing and party rooms for events. "
 ]
},{
 "name": "Washington Park Botanical Gardens",
 "address": "1740 W Fayette Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/9c/c8/a7/washington-park-botanical.jpg",
 "tags": [
  "walk",
  "unique",
  "walking",
  "free",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d268963-Reviews-Washington_Park_Botanical_Gardens-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Well kept lawns, gardens, and trees. We always feel safe when we go there during the day. Good place for a walk or a picnic.",
  "My grandkids and I were riding bikes around the park as they live very near on Wiggins.  We stopped and walked through the greenhouse with orchids.  It was beautiful.",
  "Found this while walking around Washington Park. It offer 20 acres of outdoor and indoor gardens - ten different types of gardens with thousands of different varieties of plants on display with fountains, pergolas, benches, etc. too.\n\nIndoors, there is a round conservatory with a variety of tropical plants and a large green house (although the latter is not normally open to the public. For elongated penny collectors, there is even a machine with a unique botanical garden die. Admission is free.",
  "The visitor center is most excellent and is where you make your reservation for the Linoln Home Tour. They were very informative telling us all about the other homes on the block. A worthwhile experience.",
  "Don't forget to make a visit to the Botanical Gardens....especially pretty at Christmas time but has something year-round worth seeing! ",
  "Well kept lawns, gardens, and trees. We always feel safe when we go there during the day. Good place for a walk or a picnic.",
  "So, I had never visited this park/garden before (even despite going to Springfield tons of times) because it is a park, and I always thought “big deal”. This trip we visited it, and literally went back every evening because of how beautiful it is!  Truly a must visit!",
  "Disappointed is the best way to describe our thoughts. Flowers and gardens were spread out and the crews were busy watering. Sprinklers and hoses prevented us from browsing through several plantings.  Many of the beds (especially roses) were spent. Probably beautiful earlier in the year. The plants in the biodome looked stressed.   "
 ]
},{
 "name": "Knight's Action Park & Caribbean Water Adventure",
 "address": "1700 Knights Recreation Dr",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/51/c8/cb/20160730-131458-largejpg.jpg",
 "tags": [
  "kids",
  "family",
  "food",
  "family",
  "kids",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d2249778-Reviews-Knight_s_Action_Park_Caribbean_Water_Adventure-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to bring the kids on a hot day to play and get wet. They have lockers to put your valuables and plen6of lounge chairs.  ",
  "Went with my niece and after 3 years, we have made this a family get together tradition! \nThere are such a variety of things to do that you have to start early in the day to get it all done! Water slides, wave pool, great food and drinks and our favorite which is floating the Wild River on inner tubes! When close to or in Springfield, Il, Knights is the place to go for a full day of fun!",
  "We stopped in to check out the park. There is lots to do. Water slides, wave pool,go carts, mini golf, battling cages, amazing lazy river.\n\nFor a family with teens is great variety to entertain, also great for a family with little ones. We saw many areas for smaller children.\n\nWhile at first sight. I was a little skeptical about visiting. As this looks like an older theme park & looks like the paint is faded & makes you question how well maintained this park is....\nWe had a really enjoyable experience & trust that if we should visit again. We would have just as much fun. \n\n",
  "We had a fantastic afternoon at the park. Fair price and great fun for our children aged 7,11 and 13",
  "The park is very spaced out and has a lot of room.  It’s clean and provides the tubes.  Price is good and there are daily specials for different reasons- don’t buy tickets ahead of time the specials are not online just in person. If it rains they are generous enough to allow you to return free another day which happened to us our first day after just 2 hours.  We went back the next day and witnessed on the slides that you must walk over the bridge to get to little kids come down drop off the end of the slide and an adult or child come next landing on the kid - after which the parents stood in the pool to get their kids and then the landing area became a place to hang out and protect your child. The guard was comfy in her perch until Someone yelled at her to help those kids.  On the large slides it was common for smaller kids to hang out in the water at the bottom of the slide with the guard never telling them to exit the area knowing she had hit the button and another person was on their way.  This created a lot of anxiety in me. I also inquired about bringing in a cooler prior to going as I live on the west coast.  I was told they are not allowed and that they have a concession stand.  There were coolers everywhere with drinks and picnics brought from home.  They have a sign for no coolers but no one at the entrance to enforce anything. I did message through Facebook about both of these and Mr Knight advises he will be addressing these issues.  He took it as a threat that I told him I would be posting this- I feel parents should be prepared to protect their children if the guard is perched. If not for the laziness of the guards and the danger they presented by sitting in their perch instead of helping the small kids I would give this a 5 star. "
 ]
},{
 "name": "Lincoln-Herndon Law Offices State Historic Site",
 "address": "Sixth & Adams Streets",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/22/00/a0/photo1jpg.jpg",
 "tags": [
  "family",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d268966-Reviews-Lincoln_Herndon_Law_Offices_State_Historic_Site-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went into the visitor center for magazines and other informational packets. We picked up the Springfield hat scavenger hunt here and it made for an exciting hunt throughout the town. When you find 5 hats you can go back and get a sticker and patch. They were also friendly and told us about things in town.",
  "This site is currently being renovated, as of October 2017, but it is still nice to see the building where Abraham Lincoln worked as a lawyer.  You can drive by it and see the building and beautiful bronze statue of Lincoln and his family, or park outside the Old State Capitol and visit both sites at the same time.  A great chance to get a picture of Lincoln's life in Springfield.  I recommends!",
  "We visited this site years ago and found it fascinating--including the old post office. The site has been closed for restoration and we were told it was open. This was not the case and out grandchildren had to go away with the ideas they had of the law office from the Lincoln museum.",
  "It is very impressive this still is here for Americans to enjoy. For Presidential history fans this is one of those sites which add insight and appreciation to Lincoln. \n\nBe sure and add this to your Springfield Lincoln agenda.\n\nGo Enjoy!",
  "The law office and courtroom were closed for repairs.  However the lady at the information desk was very helpful with directions.  Disappointed I didn’t get to see it but understand things happen.",
  "We went into the visitor center for magazines and other informational packets. We picked up the Springfield hat scavenger hunt here and it made for an exciting hunt throughout the town. When you find 5 hats you can go back and get a sticker and patch. They were also friendly and told us about things in town.",
  "The Lincoln Herndon Law Offices are located across the street from Old Capitol in Springfield, Illinois.  The original offices were on the third floor of this building, but have been nicely reconstructed on the first floor, along with the post office, and serve as part of the downtown Springfield Visitors' Center.  The staff there are very helpful.  Some \"History Comes Alive\" events are held here.  A cool place to stop on a hot summer day of sight seeing.",
  "You cannot see the actual office on the third floor, but there is a recreated office on the first floor. It was neat but to me the biggest advantage was the Visitor Center staff providing all kinds of information about the area and things to do."
 ]
},{
 "name": "Southwind Park",
 "address": "4965 S 2nd St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/dc/b7/bc/another-flower.jpg",
 "tags": [
  "kids",
  "kids",
  "walking",
  "kids",
  "walking",
  "kids",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d12726859-Reviews-Southwind_Park-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "I took my 6 y.o. niece to the splash pad here. It is small, but the kids just need water. The grounds here are well-maintained. ",
  "Happened upon this very nice and beautiful park and couldnt believe how large, well manicured and interesting it was with its many trails, play areas, etc. This is an excellent example of what a public space should be like.",
  "Beautiful newer park in Springfield IL.  Nice smooth walking trails connect all areas of the park.  Several large and well appointed playgrounds.  Nice outdoor pavillions, as well as a beautiful indoor pavillion (Erin's Pavillion) for hosting larger events.  My kids love the splash pad that is accessible in the summer months.  We always have fun at Southwind Park.",
  "Located on the southern edge of the city, Southwind,is a nice place to spend time entertains the kids.  Walking trails are available as well as playground equipment, a small lake and picnic area.  The park is designed for everyon's use as everything is handicapped accessible.",
  "This park is perfect for kids of most any age. Our toddlers love the playground as well as the splash pad that’s open during the summer months. There a baby swings, slides, climbing structures etc. A small snack bar is open during certain times of specific days but I didn’t catch the hours. There’s a paved walking path and you can rent the outdoor pavilions for bday parties etc."
 ]
},{
 "name": "Grand Army of the Republic Memorial Museum",
 "address": "629 S 7th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/27/d2/75/photo2jpg.jpg",
 "tags": [
  "history",
  "free",
  "knowledgeable",
  "free",
  "history",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d3400312-Reviews-Grand_Army_of_the_Republic_Memorial_Museum-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Grand Army of the Republic (GAR) was a fraternal group for Union veterans from all services (Army, Navy, Marine, and Revenue Cutter - today part of the Coast Guard) that fought during the Civil War. It was founded in Springfield in 1866, so this is a fitting location for this free museum.\n\nThe 1,000-square-foot facility is housed in the headquarters building for the GAR's women's auxiliary, the Women's Relief Corps (WRC), an organization that still exists today to perpetuate the memory of the GAR by promoting \"patriotism, preservation, and conservation of historical artifacts and documents.\" It also grants scholarships. It has outlasted the GAR which ceased to exist with the passing of the last Union veteran, Albert Woolson, in 1956.\n\nThis museum has a display on Woolson and the final days of the GAR, but also goes back to the Civil War with many artifacts, photos, letters, etc. One of the most historically significant is a drum used by a soldier at Appomattox to beat reveille. Other artifacts are more mundane - eating utensils, wood carvings, swords, flags, firearms, etc. Of course, the history of the GAR itself is also covered in great detail - the national encampments, the various medals denoting officers of the organization, etc. There is even a section on the WRC.\n\nWe spent the better part of an hour here - the museum is fascinating, but something of a hodgepodge. Fortunately, the museum has a new curator with some professional experience, so hopefully more organization will follow. We found the staff here very friendly and happy to answer questions. The only negative is that the museum is only open Thursdays through Saturdays during April through October.",
  "We thoroughly enjoyed going through and looking at all the items in all the cases. We especially liked the gavels that were made out of trees from different battlefields. We been to several battlefields so it was fun to associate what we knew with the gavels. \n\nWe talked with one guide about a photo of civil war veterans taken close to the 50th anniversary of the battle of Shiloh. It was then that we realized my husband was at the point that it’s been 50 years since he served in Vietnam. Guess we are getting old!\n\nJust a great little quick museum. Well worth the time for what these boys gave up for us. ",
  "Well worth your stop.  They even have the American Flag from the Ford Theater when President Lincoln was shot.  This is just a very interesting and well taken care of place.  They do not charge admission, but visitors can leave a donation if they want--no pressure. Volunteer is friendly & knowledgeable.",
  "The GAR movement was a HUGE political force in its day and was a precursor to the American Legion another political force post WW1.  This museum is very small with sporadic hours but it is a must see if you are in the area.",
  "If the Grand Army of the Republic Memorial Museum wasn't located so close to the Lincoln home and other better known Lincoln related sites, we probably would have passed it by. We had a half-hour to kill and ended up spending nearly two hours touring the one-room museum which pays tribute to the Civil War veterans in the Grand Army of the Republic. It contains memorabilia, artifacts, papers, diaries, photographs, weapons, uniforms, medals, drums, currency, quilts, Union and Confederate flags, journals of the GAR dating to the 1870s and a complete set of the \"Official Records\" of the \"War of the Rebellion.\" Perhaps the prized possession is the American flag from the balcony of President Lincoln's box at Ford's Theater--the same one that John Wilkes Booth caught his spur in when he vaulted over the railing to the state after shooting Lincoln--also is on display. The museum, located at 629 South 7th Street, was established in Springfield in 1941. It was moved from its original location to its current address in 1963. Also on display are original tintype photos by famed Civil War photographer Matthew Brady. The museum is staffed by the National Woman's Relief Corps, whose members provide information on everything that is on display. Admission is free but donations are accepted. There is no gift shop on the premises but several magazines devoted to the Civil War are for sale. The museum is open Tuesday through Saturday from 10 to 4 but it is closed during the month of December.",
  "The Grand Army of the Republic (GAR) was a fraternal group for Union veterans from all services (Army, Navy, Marine, and Revenue Cutter - today part of the Coast Guard) that fought during the Civil War. It was founded in Springfield in 1866, so this is a fitting location for this free museum.\n\nThe 1,000-square-foot facility is housed in the headquarters building for the GAR's women's auxiliary, the Women's Relief Corps (WRC), an organization that still exists today to perpetuate the memory of the GAR by promoting \"patriotism, preservation, and conservation of historical artifacts and documents.\" It also grants scholarships. It has outlasted the GAR which ceased to exist with the passing of the last Union veteran, Albert Woolson, in 1956.\n\nThis museum has a display on Woolson and the final days of the GAR, but also goes back to the Civil War with many artifacts, photos, letters, etc. One of the most historically significant is a drum used by a soldier at Appomattox to beat reveille. Other artifacts are more mundane - eating utensils, wood carvings, swords, flags, firearms, etc. Of course, the history of the GAR itself is also covered in great detail - the national encampments, the various medals denoting officers of the organization, etc. There is even a section on the WRC.\n\nWe spent the better part of an hour here - the museum is fascinating, but something of a hodgepodge. Fortunately, the museum has a new curator with some professional experience, so hopefully more organization will follow. We found the staff here very friendly and happy to answer questions. The only negative is that the museum is only open Thursdays through Saturdays during April through October.",
  "Amazing collection of GAR Memorablia, civil war relics, pictures and display badges from GAR conventions.",
  "We went to this museum because it was something we had not seen and my husband is into the Civil War.",
  "We thoroughly enjoyed going through and looking at all the items in all the cases. We especially liked the gavels that were made out of trees from different battlefields. We been to several battlefields so it was fun to associate what we knew with the gavels. \n\nWe talked with one guide about a photo of civil war veterans taken close to the 50th anniversary of the battle of Shiloh. It was then that we realized my husband was at the point that it’s been 50 years since he served in Vietnam. Guess we are getting old!\n\nJust a great little quick museum. Well worth the time for what these boys gave up for us. ",
  "My husband and I went to visit this museum not realizing it was closed that day.  However, the curator saw out the back door and invited us in. It was a very interesting museum and he was very helpful about explaining things and showing us some very rare items including a diary.  We were so happy to have had a chance to visit as we are from Montana and probably won't be back.  It doesn't take too long to see everything and isn't far from the Lincoln sites.  I highly recommend it if you have an interest in the Civil War."
 ]
},{
 "name": "Union Station - Lincoln from History to Hollywood",
 "address": "500 E Madison St Historic Union Station",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/7c/c0/61/caption.jpg",
 "tags": [
  "library",
  "library",
  "library",
  "family",
  "wander",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d8837320-Reviews-Union_Station_Lincoln_from_History_to_Hollywood-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Train station with Lincoln memorabilia from Spielberg movie. Across the street from the Lincoln Museum and Library. Don't miss the statues in the small park behind the train station.",
  "Don't pay extra at the Lincoln Presidential Library to see the Spiegler film \"exhibit.\"  It takes all of 5 minutes and is not worth the money.  The Depot used to have a moving audio on Lincoln's farewell speech as he left to assume the Presidency, but no more.",
  "Don't pay extra at the Lincoln Presidential Library to see the Spiegler film \"exhibit.\"  It takes all of 5 minutes and is not worth the money.  The Depot used to have a moving audio on Lincoln's farewell speech as he left to assume the Presidency, but no more.",
  "The exterior is beautiful.  The interior is worth your while.  Usually, I don't like to read a lot of plaques on display walls.  But here, I wanted to read everything and absorb each artifact.",
  "We didn't have time to go inside the station (same ticket used from the museum), but the exterior of the building is very well remodeled to its original view.  There are train exhibits inside.",
  "There are historical items and pictures of Lincoln and family.  A miniature of his funeral trainand other train memobilia are displayed.  Only spent about 15 minutes but interesting.",
  "Not far from the Old State capitol you can easily locate Union Station and its pleasant park in front, its a charming area of Springfield and well worth a wander, lovely building.",
  "A few model train exhibits and history of the railroad but not much else.  It was included with our admission to the Lincoln Museum so we breezed through.  Would not have paid to see it otherwise."
 ]
},{
 "name": "Elijah Iles House",
 "address": "628 S 7th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/dd/d8/c2/elijah-iles-house.jpg",
 "tags": [
  "structure",
  "tour",
  "structure",
  "unique",
  "tour",
  "history",
  "tour",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d2664472-Reviews-Elijah_Iles_House-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "I've been a volunteer at the Iles house.  This house is not always open because it is all charity and volunteers.  Iles was a friend and neighbor of Abraham Lincoln and donated property for the Home of the Friendless.  Greatly and lovingly maintained with \"Summer Porch Chats\" on interesting topics.",
  "My wife and I lucked out in being able to see the Iles house after visiting the Lincoln Home site just two blocks away.  The house is only open two days a week, from noon to 4:00, since it is operated by a private foundation with docent guides.  Our docent, Connie Sims, was excellent.  The restoration has concentrated on the structure itself, not furniture and furnishings, though a few pieces of original furniture and paintings are on display.  A collection of antique watches is housed in the basement.",
  "We decided to visit here after we found that another place was closed.  It was a great choice.  When we got there Mr. Lincoln had just started talking about Gettysburg  We sat in on it and were very impressed with the talk.  The impersonator, Fritz, was fantastic.  He resembled Lincoln more than any we have seen.  Right down to the mole on his right side.  He does this at many of the Lincoln sites during the week.  There is a brochure with the times and places.  Our tour guide was Larry.  What a wealth of info.  We must have been there for at least 3 hours.  Not only did he talk about Lincoln and the place we were visiting but he talked about many other things and we added a lot to the conversation.  We then went downstairs to see the clock/watch exhibit.  The person putting it on, Farrell Gay, was there and we got a lot of info.  On our way back to our camper we happened upon the old Illinois watch factory he had told us about.  This is a must stop for anyone visiting Springfield, Il.",
  "parking was challenging, but it was well worth the stop on our trip.  room had original items, you could almost FEEL the past.",
  "My wife and I lucked out in being able to see the Iles house after visiting the Lincoln Home site just two blocks away.  The house is only open two days a week, from noon to 4:00, since it is operated by a private foundation with docent guides.  Our docent, Connie Sims, was excellent.  The restoration has concentrated on the structure itself, not furniture and furnishings, though a few pieces of original furniture and paintings are on display.  A collection of antique watches is housed in the basement.",
  "I've been a volunteer at the Iles house.  This house is not always open because it is all charity and volunteers.  Iles was a friend and neighbor of Abraham Lincoln and donated property for the Home of the Friendless.  Greatly and lovingly maintained with \"Summer Porch Chats\" on interesting topics.",
  "A couple blocks south of Lincoln's home is  the Elijah Iles home, the oldest existing home in Springfield. We got there at 11:45 a.m. on a Saturday and had to wait until noon when it opened.  The docent did a great job explaining the history of the home (it has been moved several times before getting to the 7th St. location) and pointing out interesting artifacts within the home including an oil portrait of Elijah Iles, an inlaid table, and a large armoire. Because of my husband's health, we had to cut short our tour of the 1st floor because he really wanted to see the watch and clock collection on the lower level. As we headed down the stairs, I was picturing a cluttered workbench with lots of clock parts piled up.  Was I wrong!  The collection of watches, clocks, and unique time pieces was beautifully arranged on the wall and in glass cases. We watched a short video about the Springfield Watch Co. and then had the pleasure of meeting the elderly gentleman who collected the items.  He, too, was a wealth of information and was obviously pleased to be able to share his knowledge.",
  "What an awesome piece of history is preserved here!!! Tour guides are very knowledgeable about the history of this location and the city!!! Very awesome tour, thank you so much!!!"
 ]
},{
 "name": "Great Western Depot",
 "address": "930 E Monroe St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/1c/2d/89/the-great-western-depot.jpg",
 "tags": [
  "kids",
  "history",
  "historic",
  "kids",
  "history",
  "history",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d3174496-Reviews-Great_Western_Depot-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is definitely worth the visit, just for its place in history. There is a great brochure and video that have Lincoln's farewell speech. There is also a really neat example of a telegraph you can try, which the kids really enjoyed. There are some pictures on the walls, a certificate given to the conductor that transported Lincoln's body and a ticket window. Don't allow much time here, 15 minutes is probably plenty. The downstairs is only open to the public. The upstairs is a law office now. Must see, but don't expect too much here. ",
  "This is a historic location for Lincoln Fans.  This is the depot that he departed from to head to Washington for his inauguration.  A large crowd gathered and he addressed them.  There is a marker and this is worth a quick stop while in springfield.",
  "This is definitely worth the visit, just for its place in history. There is a great brochure and video that have Lincoln's farewell speech. There is also a really neat example of a telegraph you can try, which the kids really enjoyed. There are some pictures on the walls, a certificate given to the conductor that transported Lincoln's body and a ticket window. Don't allow much time here, 15 minutes is probably plenty. The downstairs is only open to the public. The upstairs is a law office now. Must see, but don't expect too much here. ",
  "This is where Lincoln departed Springfield and headed to DC  - it is full of Presidential history. We went by, found a parking spot, and took some photos - they have two free flyers on a sign out front and it is, as you would expect, literally next to the train tracks. \n\nThere is a cool sign on the building next door which also makes a good photo. \n\nIf you are into Presidential history, this is a must visit.\n\nGo Enjoy!",
  "Memories of Abraham Lincoln on the campaign of 1860. Good video displays. Great building restoration.",
  "The spot at which Lincoln departed Springfield, the last time he set foot there, before he set off for Washington. It's a quick visit here, but a poignant one.",
  "This is an interesting display of model trains.  The entry fee is included with tickets for the Lincoln Museum.",
  "This makes for a quick stop but is part of history.  The outside lends that original look and it is stationed right next to the railroad tracks.  Inside first sit down and watch the film about Lincoln and his movement via train across the states towards Washington where he would begin his term as President.  This stop at Springfield was very emotional for him due to all his friends and neighbors coming out in support and to see him off.  There are some artifacts to look at and read about.  In the center is a metal ticket seller cage.  Can spend a half hour here tops.  Note the mural on the building across the street - cool!"
 ]
},{
 "name": "Air Combat Museum",
 "address": "835 S Airport Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e1/f0/a5/air-combat-museum.jpg",
 "tags": [
  "free",
  "kids",
  "learn",
  "nature",
  "history",
  "historic",
  "tour",
  "free",
  "kids",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d8384765-Reviews-Air_Combat_Museum-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a private collection stored in a hangar at the airport.  It has 2 flyable WWII fighters, the Corsair and P51 Mustang, the cockpit section of a MIG 15 that you can sit in, and several other restorable planes of lessor note.  Free, donation is really deserved.  Can be difficult to find, there is just a door with a small sign on the side of a hanger building - see the red circle in the picture.",
  "Great for a rainy day activity.  The kids can actually do hands on with the planes, the two cats are really friendly as mascots out there.  People are friendly too!  Only during the weekdays though so now with school starting make it a school holiday activity.  ",
  "While planning our two-day tour of Springfield, mostly to visit museums and shrines devoted to Abraham Lincoln, we noticed that there are other museums of a non-Lincoln nature that have been established in Illinois' capital city. One of the most interesting is the Air Combat Museum. Located at Lincoln Airport, it is the dream fulfillment of founder Mike George. It showcases the role of military aviation and features a collection of historic aircraft and aviation memorabilia that dates from World War II to the Vietnam War. As an historian, mostly of the Civil War, I also have an extensive collection of World War II books. So a quick trip to the Air Combat Museum was in order. I'm glad we took the time. George has collected 14 historic aircraft that were used during combat, including a North American P-51D Mustang and a Vought F44-5N Corsair. The museum purchases the aircraft, repairs them if necessary and pilots fly them, many times during air shows. The oldest flying airplane in the museum's hangar is the Mustang, which was built in 1944 and served in Europe during World War II. It was purchased in 1989. It was the most famous fighter plane built by the United States during World War II. It escorted allied bombers all the way to Berlin and back to bases in England. They also escorted B-29s to Japan and back. The Corsair was made famous by Major Greg (Pappy) Boyington, whose exploits were depicted in his book and TV show entitled \"Black Sheep Squadron.\" It helped to ensure the Bent Wing Birds' place in history. The museum also has non-military aircraft, including a Soko G-2 that was one of four similar aircraft used in the 1992 action film \"Iron Eagle 3.\" The museum offers daily tours and welcomes volunteers who paint, clean and rebuild parts of the aircraft. Some even get an opportunity to learn how to fly the aircraft.",
  "Nice collection of rare military collectibles. Easy to find with friendly staff. Strange to see a WWII half-track at an air museum.",
  "This is a private collection stored in a hangar at the airport.  It has 2 flyable WWII fighters, the Corsair and P51 Mustang, the cockpit section of a MIG 15 that you can sit in, and several other restorable planes of lessor note.  Free, donation is really deserved.  Can be difficult to find, there is just a door with a small sign on the side of a hanger building - see the red circle in the picture.",
  "Great for a rainy day activity.  The kids can actually do hands on with the planes, the two cats are really friendly as mascots out there.  People are friendly too!  Only during the weekdays though so now with school starting make it a school holiday activity.  ",
  "We were greeted by a fellow who was restoring one of the planes  and he gave us a very nice in depth talk about the planes.  ",
  "This is a great little museum. We visited this past weekend and had a great time viewing all of the aircraft, it even captured the attention of my teenage stepson! They have several military aircraft inside of an aircraft hangar that you can view and read about. The staff member that we met was very knowledgeable about all of them and spent quite a while just chatting about the aircraft with us. It was an educational and enjoyable visit for all of us."
 ]
},{
 "name": "The BOS Center",
 "address": "1 Convention Center Plaza",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/96/47/6e/photo1jpg.jpg",
 "tags": [
  "kids",
  "organized",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d1419888-Reviews-The_BOS_Center-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This beautiful facility also sponsors Cheer Contests, entertainers, kids shows and so much more.  Situated right next to a great hotel the Doubletree now it is so convenient for parking underground, hotel stay too!  ",
  "With the volume of teenage and young adults in attendance for this event the convention center was organized and the facility was clean.",
  "Over the past 3 years, I have attended our annual Legion convention, I'm impressed each & every year, how accommodating the center has been for our needs.  From educational booths, convention program, & receptions held in the basement, where a food table was available with vegetables, fruit, meat, drinks, etc for a large group.  Employees were able to keep up with empty plates & making sure there was enough food to go around. The only problem I could see, is that it would have been nice to find more seats, since we have a large number of seniors.  The food served was also very good & there didn't seem to be a any complaints.",
  "It's Springfield's convention center and place for concerts, etc. We have been there a few times for various events. I feel it could be a bit larger, but they always manage to do a pretty good job. It's right downtown so no room for expansion.",
  "Attended an event here recently, nothing too impressive but not shabby. Parking directly across the street was adequate and rather inexpensive. Venue was clean and staff helpful. Restroom was large and clean. Concessions were available but we didn't have a need."
 ]
},{
 "name": "Rees Memorial Carillon",
 "address": "1740 W Fayette Ave Washington Park - 1740 W. Fayette Avenue",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/f3/e1/e4/moonrise-after-the-festival.jpg",
 "tags": [
  "family",
  "walk",
  "tour",
  "music",
  "music",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d4102432-Reviews-Rees_Memorial_Carillon-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "Be sure to schedule your visit for a time when the exceptionally talented fella will actually be playing the Carillon.  It is outstanding!  Bring a lawn chair, sit and be entertained!  Make sure to step inside and see what it looks like from that side as well!",
  "Be sure to schedule your visit for a time when the exceptionally talented fella will actually be playing the Carillon.  It is outstanding!  Bring a lawn chair, sit and be entertained!  Make sure to step inside and see what it looks like from that side as well!",
  "If you are lucky enough to hear the carillon, you are lucky enough!  The carillon festival is a great opportunity to hear the sounds of different people from all over the world who are experts in playing!  A great family event.  Sometimes at lunch we can catch a beautiful song and what a treat!  Washington Park is the most beautiful park around, with a great playground and great place to walk or ride a bike.  Tennis courts are also on the grounds.  The Botanical Garden and Rose Garden are next to the Carillon.  Take time to see and browse in the beauty!",
  "Try to hit during the Carillon Festival in June but if not they have Christmas time concerts and/or just listen to the bells.  We are very fortunate to have this thanks to a very generous contributor in the past.  One of the best around the world!",
  "I would suggest checking their website before planning your visit. They have music concerts only at certain times. If it rains, they will not have the concert. Your visit will include an elevator ride and watching a video. However you will have amazing views from the top.  When we were there someone was practicing playing and that can only be heard from the inside. If for some reason you go during the times they have tours and it says on the door “will be back,” it’s because they can’t be open while having a tour and will close the doors.  Just wait, might take 30 minutes.",
  "Washington Park is home to a Dutch-cast 67 bell carillon, one of the world's largest, with a 5-1/2 octave range. It was a gift of local newspaper publisher and one-term state senator, Thomas Rees, who fell in love with Carillons while in Europe during World War I.  Housed in a bell tower near the botanical gardens in the park, the Carillon is used for concerts throughout the year.\n\nWe happened to be in Springfield at the start of the week-long international festival so decided to attend the first evening's concert. This consisted of alternating carillon and live band performances on a pleasant evening with the park and gardens as a backdrop. The band started with a selection of marches which was followed by the Dutch-born director of the Rees Carillon, Carlo Van Ulft, performing a series of classical selections. The band then returned for another short session and then Lisa Lonie, the resident carillonneur at Princeton University and two Philadelphia area churches, performed.\n\nIf you happen to be in the area when they have a concert, be sure to take it in - it is great music and a lot of fun.",
  "Great concerts during annual International Carillon festival. World renown Carilloneurs and a fireworks display icon one night of the many day festival.",
  "I have gone to a few Carillon shows and loved all of them, being in a beautiful setting and hearing the bells is just gorgeous.  A unique experience and gorgeous surroundings, pack a picnic. "
 ]
},{
 "name": "Hoogland Center for the Arts",
 "address": "420 S 6th St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d7331303-Reviews-Hoogland_Center_for_the_Arts-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love it when they have the arts on display and for opening night have a reception with the artists there to talk to you about their work.  We have been inspired to meet new artists and have bought some of their local work.  Also, a great place to see new young talent in the performing arts too.  So lucky to have this downtown!",
  "Fantastic show.  Broadway quality vocals and talent.  Highly recommend attending before this show ends.",
  "This visit was as guests of a company we use. Were not able to choose our seats and ended up with nowhere to put my walker. An older gentleman in a red coat came by and said I could sit a certain place \"for now\". I sat down on my walker. He later came by and told me I couldn't sit there as I was in the way of the people behind me. He then directed me to a proper place with folding chairs. I again sat on my walker as the chairs were hard and my walker seat is padded.\n\nWe thoroughly enjoyed the play and always have a good time when we go. It just seems like they could offer more seating for handicapped. \n\nGreatly appreciate the elevators and it's a beautiful facility.  Looking forward to our next opportunity to see a play there.",
  "We were in the very back row and we could see and hear everything.  20$, not bad for 3 hours of entertainment.",
  "The Hoogland is such a nice family theater to see great performances by young and older seasoned performers. They even have performances from well known performers. The place is well kept, tickets are not expensive but most of all a friendly environment."
 ]
},{
 "name": "Illinois State Fairgrounds",
 "address": "801 E Sangamon Ave",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/d9/77/a7/temporary-fix-for-my.jpg",
 "tags": [
  "food",
  "history",
  "food",
  "music",
  "free",
  "food",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d12830514-Reviews-Illinois_State_Fairgrounds-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This years Horse Fair had very little to offer for the equine people. vendors were way down. There were very food vendors or equine venders. Double Dan was the only clinician we enjoyed. The horse fair has went down drastically over the past years and we will probably won't be attending in the future. At least the coliseum was open this year",
  "I stayed here because it is close to the Lincoln history sites.  The Illinois State Fairground Campground is clean and well-kept.  Spaces are tight, especially for RVs with slide-outs. There are full hookups and it is reasonably priced.  During my 3-day stay, a careless employee with a weed eater behind the row of RVs inadvertently tossed a rock into my trailer window.  The window shattered, creating a 7-month logistic and bureaucratic hassle for me.  Illinois State Fairground did step up and take responsibility for the incident and paid for the window replacement.  My suggestion:  If you hear the mowers, stand guard by your RV!",
  "Some of the buildings on the fairgrounds are very historical. I have been to the car derbies, horse shows, the state fair, musical concerts, the farmer’s market, and food shows on these grounds. I am so happy the state fair was a success this year!",
  "I really enjoyed the fair. There were several spots to hear live music, which I love. \nThen you have to see the Butter Cow! Food was reasonably priced and exhibits were free. I didn’t go on rides but they looked fun. Highly recommend a visit there.",
  "We went on a Friday afternoon. It is so much to do and see. When you first arrive it doesn't look like much, but there seems like acres of area to cover. Fun rides, so much food. They even have an Ethnic area with all types of cuisine, Mediterranean, Jamaican, Mexican, Vietnamese, Chinese, Greek and more. The entry cost was $3 for seniors and $5-10 for adults. We primarily wanted to see Snoop Dog, who was on the Grand Stage. It was a nice mix of people. I would recommend it."
 ]
},{
 "name": "Cathedral of the Immaculate Conception",
 "address": "524 E Lawrence Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/8e/9a/0e/cathedral-of-the-immaculate.jpg",
 "tags": [
  "walk",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60887-d12864863-Reviews-Cathedral_of_the_Immaculate_Conception-Springfield_Illinois.html",
 "source": "TripAdvisor",
 "reviews": [
  "This church is so very beautiful that it is a sight to see just like we traipse over to Italy to see all the Cathedrals there.  Once you are inside look down the aisle, then look up at the very different ceiling.  Walk down front and take in all the beauty of the altar and paintings etc.  Something to see right here in Springfield.",
  "An absolutely beautiful church.  I think the monsignor finally retired,  but I used to really enjoy when he celebrated mass.",
  "This Catholic cathedral was totally restored a few years ago, and the majesty of the interior is stunning.  It is located in downtown Spfld, not far from the Dana-Thomas House, and Incredibly Delicious Bakery (Patrick studied in Paris)!  It's worth the time to visit and go inside, just make sure the church is open first.  This is also the home grounds of Bishop Paprocki.  ",
  "Attended wedding here and the church is spectacular.  Beautiful wedding. The ceiling and architectural was exquisite. Worth a stop to see it if you like old churches!    ",
  "Went here for to check out this awesome place of worship!!! What a beautiful Cathedral in the beautiful city of Springfield!!! This place is just beautiful and pictures don't do it justice!!! You have to come here and check out how awesome this Cathedral is!!!"
 ]
}]
