[
{
 "name": "Minnesota State Fair",
 "address": "1265 Snelling Ave N",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/d0/a0/59/state-fairgrounds-minnesota.jpg",
 "tags": [
  "free",
  "food",
  "music",
  "kids",
  "free",
  "music",
  "free",
  "music",
  "family",
  "walk",
  "food",
  "unique",
  "music",
  "food",
  "eat",
  "food",
  "art",
  "walking",
  "food",
  "performance",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d2322964-Reviews-Minnesota_State_Fair-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "For 12 days at the end of summer, everyone stops by the MN State Fair at least once. Many (most?) states have a state fair, but Minnesotas is generally ranked in the top two with Texas. \n\nCheck the website for convenient (and free) park and ride locations that drop you right at the gates. Excellent food options from the fan favorite cheese curds to our favorite deep fried pickle chips, to excellent roasted corn on the cob, and every kind of food you can imagine... on a stick. Check out the Blue Plate Group right by the drop off for excellent food and of course Sweet Martha’s cookies and Tiny Tim Doughnuts. \n\nCheck their website for free music concerts at several different stages during each day. The animal barns are fun (maybe a little less on hot days if you know what I mean) huge midway rides and a growing kids Midway. Lots of crafts and educational areas but we think it’s a riot to check out all the vendors in the grandstand- especially the my pillow - the best pillow you’ll ever buy. Also just fun to people watch. \n\nI’d suggest going in the morning and on a weekday when it’s less crowded but whatever day you go - you will find something you love. ",
  "We LOVE the fair!  Fun foods, plenty to do, full barns, lots of browsing (grandstand, merchandise mart), great music (lots of it free) and the best people-watching around.  We visit it at least twice every year.  Both my husband and I were in 4-H, so we love to see the animals and the exhibits.  (Week 1 is 4-H animals, The second week is FFA) \n  ",
  "A great place to go for everyone in the family. Things for the old and young. Foodies, wine & beer lovers, music lovers, sports lovers, animal lovers, international affair lovers, political lovers, craft &vendor lovers, carnival ride lovers and just being a Minnesota lover!! Find what suits you at this great get together. \n\nTips: \nGo on a weekday, typically smaller crowds\nIf you know you are going to go to the fair for sure before the fair starts. Buy tickets ahead of time. They are cheaper. \nIf you are going towards the end of fair, keep your eyes open for people selling their unused tickets for cheaper. \nIf you are going with a lot of people, like to try new things, or go multiple days, check out the fair bargain book they have for purchase. \nBe prepared to walk. It is a large fair! \nBring a water bottle. there are locations you can fill them up for water. \nLook for the MN fair souvenir cups, some stands around the fairgrounds use these and you can get discounts on refills. \nLots of shows going on at all times of day make sure to look at schedule to see what you might like to see. \nThere are some bus shuttles for free or small fee if you don't want to park in the parking at the fair. \nFireworks are at the fair every night. \n\nSo much fun!!",
  "If you do one thing in summer, make it the Minnesota State Fair! Yes, there are a ton of people, but that's just part of the experience! Go early to get fewer crowds. Do the park and ride at the U of M to avoid paying for parking, super convenient! \n\nGo hungry because there are endless options for food at the fair! You will be sure to find something you love!",
  "You can never see everything in one day.  I've tried and it's just not possible.  There will be huge crowds of people so if that isn't your thing then avoid the Minnesota State Fair.  But if you enjoy people watching, deliciously unique food, and great music then you don't want to miss this yearly event.",
  "My wife and I attend at least once every year.  It is a great way to see the unordinary, eat fried food on a stick, and my favorite, people watch (LOL).  If you don't like crowds, go early on a weekday.",
  "The Minnesota State Fair blooms into a small walking town during the week before Labor Day every year. Full of food items to be eaten, Grandstand hawkers and Agricultural displays.  Be sure to visit the horse competitions at the Coliseum, the Horticulture Building for the seed art, and the Fine Arts Building with a display of talented Minnesota artists. ",
  "We were very fortunate to be visiting Minneapolis whilst the Minnesota State Fair was on this summer. The grounds are located roughly midway between Minneapolis and St Paul and are pretty easy to reach by bus from either downtown area. The place is like a mini-city in itself, laid out across a large estate of semi permanent roads and buildings. As a Brit visiting his first State Fair, I wasn't quite sure what to expect and would perhaps compare it to an English County Show, but with much more food!! You definitely won't go hungry here, with every food you can think of available (most of it also available on a stick bizarrely - pizza on a stick anyone?). They also had water bottle refill points and lots of bars including one showcasing micro breweries from across the State. We watched loads of displays including a horse and wagon show, a skateboard and BMX display, a cool laser show and unexpectedly came across a live performance from Belinda Carlisle too! There's tonnes to do and see - a day here was nowhere near enough to take it all in - and we really enjoyed getting a feel for what Minnesota has to offer."
 ]
},{
 "name": "Science Museum of Minnesota",
 "address": "120 Kellogg Blvd W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/27/84/fc/what-will-you-discover.jpg",
 "tags": [
  "unique",
  "kids",
  "food",
  "kids",
  "free",
  "family",
  "kids",
  "approachable",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d134891-Reviews-Science_Museum_of_Minnesota-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were actually there to visit the Mississippi National Riverway - which is located inside the Museum foyer. The foyer had a few exhibits that you could do without purchasing tickets to the very extensive museum - we LOVED the musical stairs, seriously...so incredibly cool and unique. We were a little short on time, so we had no intention on entering the museum, except a lady with her child had won tickets from an auction and had 4 more than they could use and asked if we would enjoy them, we graciously agreed. Huge thanks to that sweet lady.\n\nThe museum is HUGE, we didn't get to do everything because again, it's huge! And the tickets included the IMAX film on Apollo 11 which was great! What we did get to do was very enjoyable, with several volunteer run stations where kids could make their own crafts or be part of an exhibit - very well done museum, enjoyable for kids and adults of ALL ages. If ever in the Twin Cities again, we will DEFINITELY return, to finish the rest of the museum!",
  "Our grandkids love to go to the Science Museum of Minnesota. There are many “hands on” opportunities that are entertaining and educational for a great range of ages and keep the kids entertained and they are learning while they are having fun! Our grandkids love the Omni theater movies and always enjoy the special events (Pixar was great) as well as repeating the tried and true displays at the museum. The food at the museum is moderately priced and is pretty darn good. We usually spend 3-4 hours here and of course a bit of time hanging out in the gift shop where they have a great array of gifts and treasures. The prices in the gift shop range from a few dollars to upwards to maybe a hundred for the fancier items. The quality of the offerings is quite good. The Science Museum staff who demonstrate and explain items in the various areas are professional and helpful. We also enjoy ourselves while the kids have fun! We think you will too.",
  "I've been to the SMM many times over the years, with family, as a chaperone for middle schoolers, as a chaperone for high school students, and by myself, and I have always found it worth the visit. A recent trip with my 3-year-old granddaughter and my elderly father-in-law made me look at this treasure anew. In addition to the traditional exhibits of many dinosaurs, Egyptian artifacts, and such things, there are so many amazing hands-on activities for experimentation by children of all ages. We were there for three hours and it wasn't nearly long enough. Depending on the number of people in your group, it might be more cost effective to purchase a family membership, even if you are only there for a day. The best part of that is, the membership can also be used at other museums around the country. A number of free omni movie passes are also included in membership purchases. The features are usually fast paced and are able to sustain the interest of a child as young as 3. The special exhibits are usually good; however, they do cost extra and often require advance reservations. \nWe had one member of our group who had mobility issues, and the SMM was easily able to accommodate him with elevator service and ample benches for resting. Aisles are plenty wide for wheelchairs or walkers. \nThere are two restaurants within the SMM with indoor seating, and plenty of tables to have a picnic lunch if you choose to take that route. \nMany local schools take advantage of the great educational programs that the SMM offers, so if you want a quieter time to visit, you might want to come around 1pm and stay until closing, since most student groups leave around 2pm. Parking beneath the museum is very convenient.",
  "This was a fun interactive place to visit.   Plenty to see and do.  We did an interactive thing called Infestation about natural selection - using clues we went thru the museum to help the scientists find their little fur balls/tribbles.   Good time!",
  "As someone who grew up in Duluth, Minnesota we always went to the Science Museum when we would make a trip to the twin cities.  As an adult I still appreciate all that it has to offer.  From great films to informative exhibits it's still a delight to check out.  It is more aimed towards kids, but my wife and I enjoy checking out the movies and new exhibits.",
  "A day or half day of fun awaits at the Minnesota Science Museum. There are great interactive exhibits for all ages, but the real fun is seeing a “live” dinosaur. The t-Rex youngster is approachable and fun for all ages. Showtimes vary, but it’s easy to find out the schedule on-line (smm.org) There’s a digital Omni theater as well. Don’t miss the view of the Mississippi River and the musical stairway. A great way to learn while having fun. Parking available.",
  "This edition of the Apollo 11 mission is a condensed version of the film that was in theaters about a year ago.  It offers highlights of the first moon landing, which is probably better for kids who may get bored with the longer version.  However, NASA nerds will probably miss the details.\nThe exhibit for the 50th anniversary of the Apollo 11 moon landing contains interesting artifacts and provides a clear timeline for the US vs. Soviet Union race to the moon.  There is a lunar rover you can sit in for a photo op, as well as multiple videos and various equipment and models.  Even after having visited the Kennedy Space Center less than a year ago, we still learned something new. Definitely worth a visit to the Science Museum while the exhibit is here.",
  "If you are looking for something fun to do in St. Paul I highly recommend you go to the Science Museum. They always have new things to see and interact with. Fun for all ages."
 ]
},{
 "name": "Cathedral of Saint Paul",
 "address": "239 Selby Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/9c/82/ee/view-of-the-cathedral.jpg",
 "tags": [
  "tour",
  "free",
  "art",
  "walking",
  "walk",
  "tour",
  "structure",
  "unique",
  "tour",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d144120-Reviews-Cathedral_of_Saint_Paul-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Obviously, this is a place of worship, and reverence should be observed.  That being said, the architecture is incredible, and the small chapels behind the main altar, dedicated to the cultures that founded St. Paul, are amazing.",
  "Beautiful Cathedral and wonderful  architecture. Spectacular stained glass throughout the cathedral and a very impressive replica of the Pieta by Michaelangelo as well as statues of Matthew, Mark, Luke and John and other saints. The Main Altar and Canopy resemble St Peter's in Rome. Highly recommend visiting this Cathedral.",
  "An amazing building of beautiful architecture, beautiful artifacts, the screens, etc., Which told the story of Christ through pictures for those who were unable to read, in past generations. Absolutely awe inspiration, although I am not of the Catholic faith, the beauty honors the same Jesus Christ and Heavenly Father that I serve. You know that you are stepping into a holy place.",
  "Breathtaking inside. Stain glass, statues, great architecture. Free to visit, but this building is in use all day, so respect others and be quiet. Tour guide tells us they practice on the pipeorgan in the afternoons.",
  "Date of visit:  Sat 3/31/12.  A walk through the Cathedral is a good pairing with a walk or drive down Summit Ave, since they are adjacent to each other.\n\nEven if you aren’t Catholic (which I’m not), you are likely to find visual appreciation for the architecture and art of this Cathedral.  If you’re into understanding the symbolism elements, be sure to check out the virtual tour section of their website - http://stpaulcathedraltour.com/.  Understanding what you're looking at will increase your appreciation of it.\n\nWear comfortable/quiet shoes and allow for roughly 30 minutes if you’re likely to be taking pictures.  Speaking of which… check the website for scheduled services so that you don’t go when you aren’t able to walk around.  No one will take kindly to a tourist walking around taking photos when they’re trying to worship.    \n\nLastly, make sure you go downstairs to see the LEGO Cathedral model and the museum (if it’s open).  Public bathrooms are also downstairs.",
  "This is an amazing structure inside and out.  It stands on a hill overlooking downtown St. Paul, the Mississippi River and the nearby State Capitol.  Very nice details on the exterior.  Don't miss the stained glass windows or the large statues of the four Evangelists on the interior.",
  "Stunning landmark that lifts the soul upward to heaven. Beautiful interior, soaring dome, and unique alter area. Lovely stained glass create a lovely worship space and secularly impressive building.",
  "Unbelievable architecture, I simply can’t believe this cathedral is in the USA! The sound inside is haunting. I loved it",
  "This was a beautiful cathedral to visit.   We did not take the tour however, we just walked the interior.   Beautiful stained glass and architecture.    Nice place to visit with the family.",
  "Just a beautiful building.  Elaborate ornate wood work.  Beautiful stain glass windows.  \n\nWorth the stop, all religions welcome.",
  "The St. Paul Cathedral is a must see.  You will better appreciate humanity upon visiting this site.  It’s a must see whether you are religious or a non-believer.  Believe me you will look in awe and it will open your mind to man’s existence on earth."
 ]
},{
 "name": "Minnesota History Center",
 "address": "345 Kellogg Blvd W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/44/28/b6/minnesota-history-center.jpg",
 "tags": [
  "kids",
  "learn",
  "history",
  "kids",
  "kids",
  "unique",
  "history",
  "kids",
  "walk",
  "history",
  "history",
  "library",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d103905-Reviews-Minnesota_History_Center-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great place to bring kids of all ages, and there are wonderful exhibits. My young kids love the playground in the winter, and love the tornado exhibit as well. Definitely a great place to visit over and over",
  "What an amazing way to spend the day - we got to see the Somali-Minnesotan, 1968, Weather Permitting, and Then & Now exhibits and learned so much about Minnesota and American history. Such a wonderful environment for people of all ages to come and learn interactively!",
  "Every exhibit, from the special exhibits on the local Somali community and the year 1968 to the regular exhibits on weather, Minnesota then and now, and Minnesota's greatest generation,were excellent.  Interesting videos, lots of stuff to engage kids -- this is a must-visit museum if you're in the Twin Cities area.",
  "This museum was awesome.   Exhibits included one about Prince, Minnesota’s greatest generation / WW II, and Then Now Wow.   Folks there were so helpful and informative about their exhibits.   A great place to visit with or without kids.  A hidden gem.   Admission was $12 and parking was $6.",
  "The Minnesota History Center is very well put together and gives a unique hands on interactive walk through time covering off different eras and important historical aspects of Minnesota. This is a must for kids and adults. ",
  "This is one of the best history museums for the money anywhere I have been.  Some permanent exhibits but lots of exhibits rotate so there is always something new and interesting.  Excellent cafe too.",
  "Great displays about many diverse aspects of Minnesota history.  I love that they include different time periods and a variety of cultural displays, some changing every few months.  The First Avenue and Native Peoples exhibits are well worth spending an afternoon.  Lots of videos and artifacts give insight into parts of Minnesota history that many of us are not familiar with.",
  "A beautiful collection, excellent and helpful genealogy library, fun twin gift shops.   The collection is fun and informative.   There is a  version of Lindberg’s Jennie hanging in one of the lobbies, and an antique windmill in another.   An excellent cafe, too.   The history center is easy to find, right on a hill between the Capitol building and the St Paul Cathedral.   Easy parking (tho a bit costly.). Very friendly helpful staff."
 ]
},{
 "name": "Summit Avenue",
 "address": "Summit Ave.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/f1/8e/df/summit-avenue.jpg",
 "tags": [
  "tour",
  "walking",
  "walk",
  "unique",
  "historic",
  "unique",
  "historic",
  "walk",
  "walk",
  "music",
  "history",
  "parks",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d142443-Reviews-Summit_Avenue-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you love/like seeing a historical area this is the area, plus the Governor's mansion is on Summit Avenue also...They have a walking tour of some of the greatest older homes in Minnesota and a story behind each of them, as everyone has a significant reason for being on Summit Avenue...so if you love to walk by these well maintained historical home, this is a must stop when you are visiting Minneapolis/St. Paul",
  "The FALL colors along Summit avenue are beautiful.  So many unique historic homes to see,  The governors mansion all the way down to the Cathedral in St Paul and going the other way all the way to the Mississippi river past the beautiful College of St Thomas. ",
  "Such a beautiful street with beautiful homes - one of my absolute favorites for my early morning walk/saunter. Each house is unique, and each spectacular.",
  "A short drive to view the mansions on your way through the city is a must in the spring when the flowers are blooming and the yards are preened ",
  "Summit Avenue is a pleasant avenue to walk in the spring, summer, and fall to see gorgeous historic homes.",
  "It's really a treat to drive or walk along Summit Avenue at any time, but especially when all of the gardens are in bloom or the holiday lights are up.  But do you ever wonder what some of the mansions look like inside?  I do.  And I have been privileged to be able to attend classes and events at the Germanic-American Institute at 300 Summit Avenue for over 3 years.  One of my friend's sisters was even married there many years ago!  \n\nGAI is a part of the Goethe Institute International, which promotes learning German culture and language.  And while I have chosen to become a member, classes and events, like wine tastings of German wine, are open to the General Public.  It is very much like the American-Swedish Institute in Minneapolis, which is listed on Tripadvisor.  Tripadvisor steadfastly refuses to list GAI.  Anyway, you can go to their website for upcoming events like wine tastings, the holiday open house, talks, etc.\n\nI thought the holiday decorations in particular were beautiful.  And the gardens during the Spring and Summer events are very, very pretty.",
  "Summit Avenue Is elegant, long,  and friendly.   The governors mansion of Mn is about in the middle, and one end of it sits at the parks along the Mississippi River and the eastern end passes the James J Hill house and St Paul Cathedral, then the beautiful Mn Historical Centre and slides into Downtown and another wonderful bend in the Mississippi.   Churches abound, but mostly gorgeous houses and gardens and the row houses where F Scott  Fitzgerald lived.   Probably you will want to find a book with details.   You can zip through in half an hour or walk along it all day.   A couple colleges are quite near.     St Clements Church, with its excellent good works and music is only a block off Summit at Milton.   There isnt as much commercial stuff, but shopping and eating is only a block away, or at the History Center and downtown.  ",
  "No trip to the Twin Cities is complete without a drive down Summit Avenue from Downtown St. Paul to the Mississippi river.  Summit Ave has some of the most exquisite homes in the metro area."
 ]
},{
 "name": "CHS Field",
 "address": "360 Broadway St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/cc/56/b3/chs-filed-home-of-the.jpg",
 "tags": [
  "unique",
  "unique",
  "free",
  "walking",
  "walk",
  "music",
  "history",
  "unique",
  "field",
  "affordable",
  "family",
  "food",
  "music",
  "family",
  "field",
  "food",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d8127720-Reviews-CHS_Field-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Always fun and unique baseball experience, fun for those that aren't fans too! Great craft beer area, plenty of parking, restaurant and bars in the neighborhood, easy to get to off the highways and the metro line. Great sightlines, intimate experience, games sell out all the time so get there a bit early",
  "Always fun and unique baseball experience, fun for those that aren't fans too! Great craft beer area, plenty of parking, restaurant and bars in the neighborhood, easy to get to off the highways and the metro line. Great sightlines, intimate experience, games sell out all the time so get there a bit early",
  "After years spent in Midway Stadium near the Minnesota State Fair grounds, the St. Paul Saints amateur baseball team has finally found their longterm home on the edge of downtown St. Paul! This is truly a remarkable ballpark, worthy of praise from both Major League Baseball and baseball lovers from across the country. Heck, even part-owner Bill Murray, who was on several of David Letterman's final TV episodes during spring 2015, spent the next days in St. Paul helping open this beautiful stadium for the opening series.  Now that is priorities! \n\nI prefer standing room only tickets at this ballpark, at least for the next few years, as I can't get enough of all the perspectives every area of this ballpark has to offer! From the grassy knoll in left field to the revolving boardwalk that allows fans to walk throughout the entire ballpark to seats behind home plate, this field is surely a thing of beauty. After attending a game in the newly renovated Hammond Stadium in Fort Myers, Florida (home of the Twins Spring Training), I am of the opinion that both these ballparks have struck gold in creating a boardwalk in the outfield areas to allow fans to sit or view the game from these viewpoints. Both Midway Stadium and the old Hammond Field lacked these features, but the mid-2010s have brought baseball enthusiasts a whole new experience! All sporting games are going to charge big prices for their concessions, but CHS field has many unique stands, and has a great beer garden in left field. The beauty of standing room only tickets is that by the 5th inning, as many fans inexplicably leave the stadium for home, you now have the opportunity to walk around the stadium, either to find a vacant seat or to stand behind a back row, and to view the game from different perspectives and to see how fielders, batters, and dugouts play the game. Amateur baseball teams, since their inception during the Great Depression, have done a great job in creating entertaining programs every half-inning, and this tradition has continued in CHS Field. A new tradition that I greatly enjoy is when a medic cart brings in the Saints relief pitcher. I also really enjoy going to Friday night home games, as a lengthy firework show accompanied by music plays following the game.\n\nJust as in Midway Stadium, my Dad plays 1-2 games in CHS Field every year as he is part of a local amateur over-30-year-old baseball team. It was a great joy to catch a game here last Fall, walking onto the field, playing catch with Dad, and watching the game for free from behind home plate and other parts of the stadium. This truly is one of the greatest sporting attractions in the history of the great state of Minnesota, and it's not even used for a professional team. Wowsers.",
  "they did a top notch job when they made this ballpark. it's affordable and family friendly. there is entertainment is available for casual basball fans.",
  "Great outdoor minor league baseball park.  Lots of food and beverage choices, including local breweries.  The price is right and lots of fun!",
  "Beautiful ergonomic contemporary vibe.  Baseball is only part of the entertainment; there is something happening before the game, between every half-inning, and after the game.  The announcers are hilarious.  \"(The opposing batter) has two strikes,.....(wait for it)...and NO BALLS!!\"  Great family fun.  We like it more than going to a Twins game.  Come early to hear live music outside the stadium.  Inside the stadium, there is a nice variety of foods and drinks--from basic hotdogs and budweiser to gourmet selections and craft beers--a few cuts above traditional ballpark fare.",
  "This was my first trip to CHS field to see the St Paul Saints play in their new park. We were given tickets by son friends to box seats (comfy!) although it almost doesn’t matter where your seats are in this stadium - all the seats provide a great view of the game. One of the wonderful highlights of the park (besides the idea of watching a game outside on a lovely Sunday afternoon) was the wide variety of excellent food and drinks and side things to do. And even though Alex and I were there really to watch the game, we enjoyed some of the fare in the late afternoon sun. It’s the great American game experience. Just perfect!",
  "From the pre-game festivities to the sight lines to the incredible staff to the incredible team on the field all the way to the tasty treats and the fun that can be had for all ages around the grounds....hands down the best ballpark in the U.S. and that is competing with Target Field and US Bank Stadium. Great part of town that needed a boost and it got it, with plenty of bars and restaurants to serve you, well worth a trip!"
 ]
},{
 "name": "Historic Fort Snelling",
 "address": "200 Tower Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/c4/09/b1/historic-fort-snelling.jpg",
 "tags": [
  "historic",
  "history",
  "active",
  "history",
  "history",
  "history",
  "historic",
  "history",
  "active",
  "historic",
  "history",
  "history",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d4567669-Reviews-Historic_Fort_Snelling-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "My teen daughter and I attended this living history fort and it was amazing! :)  We thought it would be an hour or so but we spent well over 2 hours listening and learning.  There was a blacksmith and the living quarters of Dred and Harriet Scott.  The staff were so very well informed of history and helped us to feel as if we were in the middle of this historic place.  There was a military type action where they fired the cannon and other active and fun learning for all ages.  A must see!",
  "I expected to find Minnesota and frontier military history at Fort Snelling, and I wasn't disappointed to see it in reenacted military drills and re-created barracks.  But's there so much more there, too.  You can see where Dred Scott and his wife lived for three years when his owner was the fort's surgeon in the 1840s.  You can also see demonstrations of 19th century cooking and blacksmithing, and you can also see a classroom for a World War II school for intense Japanese-language training.  The school's graduates, mostly Japanese-Americans, translated captured military documents and interrogated Japanese prisoners of war.  The information they learned helped win the Pacific war faster, saving countless lives in the bargain.  It's well worth it to go.",
  "I have been to many forts over the last 20+ years and Fort Snelling has always and continues to be the standard to compare the others by. The experience is very immmersive and interesting. Besides exhibits in the History Center, film and store area, the actual fort is very accuarate to history with lots of information and exhibits as well as infantry gun drills, cannon firing, etc. Fun for adults and children alike. I highly recommend.",
  "Great re-enactors, a fascinating and troubled history of white / native conflict, especially. Large grounds with interesting buildings.",
  "My teen daughter and I attended this living history fort and it was amazing! :)  We thought it would be an hour or so but we spent well over 2 hours listening and learning.  There was a blacksmith and the living quarters of Dred and Harriet Scott.  The staff were so very well informed of history and helped us to feel as if we were in the middle of this historic place.  There was a military type action where they fired the cannon and other active and fun learning for all ages.  A must see!",
  "Historic Fort Snelling Guides you through history.  The Fort played a big part in Native American history.  Slavery this far north existed here.  Two mighty rivers meet outside its walls.  It shows the life style of soldiers, and what their lives were like during that period.  It has buildings around it that graduate into the 20th century.  If you are a history buff, it is a must see in the Minneapolis St. Paul area.",
  "I love visiting places like Fort Snelling because I'm a bit of a history nerd, and I enjoyed coming here. Sometimes these places can be boring with not having too much or being too kid-friendly, but this was interesting. There were several exhibits to explore and there's cannon firing, which happens often enough you're bound to see it at least once while you're there. It reminds me a bit of Fort Mackinac (just minus the steepness) with how it functions, but it has plenty of its own uniqueness to stand out.",
  "I can't believe it too me so long to visit. Such an authentic experience. I had an out of town visitor, so we headed over, not knowing what to expect. The property is very large, with family friendly activities running all day long. (The cannon shooting was my favorite.) Local historians are on site to answer any questions and there were many displays to see. Plus, they were very open to including children in all their activities. I will add this to my short list of places to take visitors, but won't miss out on my own occasional visits."
 ]
},{
 "name": "Minnesota State Capitol",
 "address": "75 Rev Dr Martin Luther King Jr Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/f9/e3/8b/capitol-building.jpg",
 "tags": [
  "tour",
  "unique",
  "tour",
  "tour",
  "free",
  "walking",
  "knowledgeable",
  "food",
  "tour",
  "history",
  "tour",
  "learn",
  "free",
  "tour",
  "unique",
  "tour",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d134850-Reviews-Minnesota_State_Capitol-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Such a beautiful building, marble pillars and staircases, breathtaking dome, somber official chambers, rich colours, warm woodwork, gilded details.......all brought to life by the informative guides with their unique stories to share. The guide we had on our tour pointed out so many details that we would surely have missed if left to our own devices. As visitors from Scotland we felt very welcomed here. ",
  "One of only four marble domed buildings in the world (along with the capitol of Rhode Island in Providence, the US Capitol in Washngton, DC, and St Peter's Basilica in the Vatican) this Cass Gilbert project is a beautiful government monument.",
  "The state Capitol Building has been renovated in recent years at a cost of over $300million and it shows. It is SO impressive. We took thevery informative guided tour, which lasts an hour and takes you to the supreme court, the House of Representatives, the Governor's reception room and up onto the roof to see the golden horses so go on a nice day! Well worth a visit.",
  "I just love seeing how government works.  You can send little notes in for legislators while they are in session.  They may come out to talk to you between votes.  You can see paintings of the governors of yore--more interesting than you think.  Amazing quotations etched in stone.  The dome from inside, looking up.  There is a tunnel to the State Office Building and other buildings.  When you go there, you feel so very \"in\" and as if you are part of a secret world.  There is a cafeteria at the tunnel level with ok food---it is handy.  The MN Historical Society offers tours on a regular basis.  If you go, leave a note for your State Senator or State Representative about what your concerns and praises might be.  There is a legislative mail system so just ask where you can leave your note.  Or deliver it to the right office yourself.  Lists of legislators w/room numbers available at the Historical Society info desk and also at the State Office Building.  You can also stop by the Gov's office since it is also in the Capitol.   We Minnesotans collectively own the State Capitol, so we need to check ouy our real estate every now and then.  ps  toilets can be hard to find but there are plenty.  ",
  "Massive dome and beautiful spaces.  One of the largest and most beautiful state capitols.  Don't miss an opportunity to view the Quadriga, the gilded equestrian sculpture that can be seen above the main entrance to the Capitol.  The adjacent grounds are expansive and peaceful, with nice views of downtown St. Paul.",
  "Date of visit:  Sat 3/31/12\n\nTips:\n1. wear comfortable, quiet shoes\n2. arrive in time to use the bathroom BEFORE the tour starts (we lost a few people because they went downstairs and didn’t make it back up before we left the lobby)\n3. try to go on a day when it’s warm enough out for them to take you up to the roof terrace… excellent views from up there, but they won’t take you in the winter\n4. Free guided tours on the hour.  We had Roy, who was witty and very knowledgeable.\n5. Good photo op of the Cathedral from both the front steps and the roof terrace.\n6. If you’re interested, the painting of Jesse Ventura is downstairs, then to the left (all of the recent-era governors’ portraits are downstairs)\n7. Allow just over an hour… more if you don’t properly time your arrival to coincide with a tour.\n\nI did the Capitol, then walked down the street to both the Cathedral and part of Summit Avenue.  I later Google Map’ed it and found that I had walked approximately 3 miles round trip.  That’s not counting the walking I did AT each site, so if you’re ambitious, it CAN easily be done, but be prepared.  Bring water and some granola bars or something, because there are ZERO food options in the immediate area.",
  "We roamed the building while waiting for our tour to begin and were delighted by the information and stories told to us by the 2 docents in the House chamber.  Both were retired State troopers and they knew some pretty cool stuff!  Renovations on the Capitol were completed in 2017 and the building is in pristine condition. Our tour guide Kerry was hilarious and gave a fascinating talk.    If you like history and appreciate gorgeous architecture, you will love it! ",
  "After the huge remodel/rehab of a few years ago, this place looks fabulous!  So much to see and if the Legislature is not in session, there are many areas to look at and experience. Don't miss upstairs conference rooms, or the basement cafe",
  "I'd never been to a State Capitol building before and wasn't really sure what to expect - we'd heard that the Minnesota Capitol was quite modest compared to those in other states, but I was blown away by the scale and beauty of this place, which I would describe as anything but modest! It's an impressive spectacle on approach and even more so once inside, where you are free to explore the amazing rotunda with its beautiful dome and peek into a few of the surrounding chambers. I could've spent ages poking around in here and wish I'd had the opportunity to take a tour to learn more about the place.",
  "Such a beautiful building, marble pillars and staircases, breathtaking dome, somber official chambers, rich colours, warm woodwork, gilded details.......all brought to life by the informative guides with their unique stories to share. The guide we had on our tour pointed out so many details that we would surely have missed if left to our own devices. As visitors from Scotland we felt very welcomed here. ",
  "My husband and I have visited 11 state capitols to date (our bucket list goal is to visit all 50) and this may be my current favorite. They have recently refurbished the building back to it's full splendor and it's just stunning. You simply have to take the tour as it's incredibly interesting! They even pointed out a portion of the ceiling that was left the way it was prior to the refurbishing. It was crazy to see how the layers of paint and smoke from cigarettes built up over the years! So glad they were able to secure the funding to bring it back to it's original days! We were not fortunate enough to visit during the season where they let you walk out by the horse sculpture balcony, so maybe we will have to return someday in nicer warmer weather!"
 ]
},{
 "name": "James J. Hill House",
 "address": "240 Summit Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/2a/cf/8c/james-j-hill-mansion.jpg",
 "tags": [
  "tour",
  "family",
  "free",
  "tour",
  "library",
  "art",
  "music",
  "history",
  "tour",
  "family",
  "history",
  "kids",
  "tour",
  "family",
  "history",
  "tour",
  "walk",
  "tour",
  "history",
  "free",
  "tour",
  "family",
  "history",
  "tour",
  "history",
  "tour",
  "learn",
  "family",
  "history",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d134840-Reviews-James_J_Hill_House-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "On a frigid February in St. Paul I wanted an indoor activity and I stumbled on the JJ Hill House by chance.  I thought the 75 minute tour would be too long, but our tour guide was fantastic and the time went too fast.  The incredible details of this 33,000 sq foot house are in remarkably good shape and our guide had scores of fascinating stories about the house and the Hill family.  This is a top to bottom tour so you get to see how the family lived and entertained and also where the servants lived and worked.  It's like Downton Abbey on the Mississippi.  Well worth a visit!",
  "The James J. Hill house is a 36,000 sq ft mansion just a couple miles from downtown St. Paul. We took the standard 75 minute tour, which takes you into the music room, parlor, art gallery, Mr. and Mrs. Hill's and two of their sons' bedrooms, the school room/billiard room, the dining room, library, Mr. Hill's office, the kitchen, laundry room and boiler room. \n\nThe tour provides a glimpse into the America's gilded age, as well as a glimpse into the life of James Jerome Hill, the railroad tycoon responsible for building the Great Northern Railroad. \n\nThe tour costs $10 for adults, but is free for anyone with a membership to the MN Historical Society. You can get into a number of other historical sites in the Twin Cities and many in the state with the membership, so it's well worth the membership cost if you're a history buff who's spending a few days in the Cities or in Minnesota.",
  "Amazing home on an amazing street!  So worth the time to tour!  Great history of the Hill family plus quite a bit of St Paul and of course some railroad history thrown in for good measure.  Had toured about 11 years ago and I loved the updates and added rooms on my most recent tour.  Lots more involved now than it use to be.  On a hot summer day-bring a fan or water--it gets hot the higher up you go :)  Would love to go and do the nooks and crannies tour sometime or visit during the holidays to see if they deck the halls!   Kids again complained a bit, but once the tour was going, the older ones had questions and really enjoyed the rooms and displays!",
  "Great tour, amazing house. Do NOT take children under 10 years old as the tour is 60-90 minutes long and there are many delicate pieces that are not to be touched. Great views, great information on St. Paul's history and the Hill Family. ",
  "We visited the attraction on 3/2/13 during an early afternoon tour. \n\nThe Good: Tour was great- learned lots of local information, very detailed, fun tour guide- 24 years of experience there and was funny (not too serious like some tour guides can be). House was beautiful- the woodwork was amazing. Tour lasts about 75 minutes. All furnishings are original. \n\nThe Bad: Not something for children- there is no touching of anything as they are trying to preserve the original house. Parking is on the street only and there is no handicap. For the handicap entrance, you must push the button and wait for someone to let you in. We did not know this, so walked up to the doors (we do not push the button unless we have to in order to save electricity) and could not get the doors open. We walked back down the ramp, which is rather long, and pushed the button hoping that would open the door. Nothing happened so we walked towards the main entrance. Then someone came to the door to let us in. What would be really nice, especially for people like me who cannot walk far, would be if they put a sign next to the handicap button stating someone will open the door for you once you push the button. This would not damage the original building yet let those of us know what to expect who need this entrance. The only other thing we didn't care for was at the end of the tour they let you out through the back door, it would be nice if they would at least welcome you to come back in to look at the mansion for yourself. You are basically pushed out the door after the tour- keep in mind you can do a self-guided tour but you would miss a lot of information as there are no signs telling you about the rooms/people/history/etc. \n\nWould we go back? Yes, but on our own self-guided tour so we may take our time to see the rooms/details. (during the tours, you have to stay with your group and do not always have time to look at stuff in detail). Would recommend everyone try this tour at least once when visiting St. Paul. We also plan on going on the behind the scenes tour at some point, which sounds like it's more fun than the basic tour.",
  "My wife and I attended a tour of this house after a suggestion from a member of the historical society. You can attend a tour, make reservations for a minimal cost. Amazing to see how this historical home was built and all the features which were building into it. You can get up close and personal with your tour guide, visiting most of the house. Great views and the workmanship and history was very informative. Make it a joint trip to visit the house and the Cathedral, free parking there. Beautiful views of the city and river from this house.",
  "Great job by Sophie our host. She gave us a great tour of the location, told us about the history and the family. If you have some time it is worth the stop. The house was way ahead of its time for the era. James Hill was an interesting person who was very well off .",
  "This house was certainly built to impress, no money spared! Great location, prime site on its street with equally impressive neighbours. It would seem that James Hill didn’t actually spend much time in the house as he was a workaholic but his wife did, sharing her time between this house and their other properties. Comfortable spaces, lots of portraits and memorabilia etc. Our guide was great, very informative and able to answer all questions thrown at him. Well worth a visit.",
  "The home and the history is amazing. The tour guide was very good. But for a historical home I was very disappointed in the Christmas decorations up",
  "This place has been on my list for many years and I finally decided to make my way over to see it with a friend.  The kicker was the \"holiday decorations\" that they touted so I thought it would put me in the proper holiday spirit.\n\nThe building itself is impressive with lots of amazing wood carvings and features.  The superficial \"holiday tour\" was a bit underwhelming with tacky faux food and period flea market finds here and there to try and illustrate what a Christmas celebration in the 1900's would have been like for the illustrious family.  I think the tour suffers from the assumption that many of its participants have been to the house before so for me, it was a bit light on the history of the famous inhabitants.  I also expected something a bit more lavish in the way of holiday decorations.   There was some garland on the grand staircase and that was about it.\n\nI'd like to come back sometime for a more extensive tour to see more of the house and learn more about the Hill family.  The tidbits that were offered were actually quite fascinating.",
  "Had a fantastic visit to the Hill Mansion. Because it was a Saturday in Christmas it is self-paced rather than guided. I have done both and happy I did the guided visit firat as I could spend more time studying the rooms. Perfectly adorned for the Christmas Season and explianed well what we were looking at. Well worth the price of admission. A true Gem from the Rail Baron Days of the turn of the Century. A MUST SEE!!!"
 ]
},{
 "name": "Xcel Energy Center",
 "address": "199 Kellogg Blvd W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/90/05/a1/18.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d616448-Reviews-Xcel_Energy_Center-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great place to attend a concert. The space is huge and because the ice is below the temporary floor, the temp in the building is wonderful! The concessions are good and there's lots of parking in the area.",
  "I have seen all the hockey rinks in the country but the MN Wild - they were the last team.   3 hours before the game on 3/12 all games suspended.      Crap!    But security at the rink was kind enough to let me get pictures of the rink after I purchased my last puck at the store.   Folks here are very gracious and kind.   \n\nVery depressed and sad .....",
  "The arena was updated, clean and parking was close and easy to access. We sat in the club seats which provided in seat options which was nice but only saw the server 2 times during the game, so either wait a while to order or just go get it your self. ",
  "Friendly staff and across the street from the Hampton Inn hotel. It was a great venue. There are no bad seats!",
  "Annual Shark trip to a different arena. Very nice arena. Loads of restaurants nearby. Service inside was great. Friendly staff. Only drawback is the seats are one of the narrowest I’ve sat in compared to other arenas I’ve been to"
 ]
},{
 "name": "Grand Avenue",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/ab/cb/aa/photo4jpg.jpg",
 "tags": [
  "eat",
  "unique",
  "walk",
  "unique",
  "structure",
  "historic",
  "food",
  "family",
  "walking",
  "food",
  "walking",
  "food",
  "eat",
  "art",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d271846-Reviews-Grand_Avenue-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is without question my favorite place for shopping and eating. There is something for everyone (of all ages!) here! Coffee shops and cafes, specialty shops, such as the Golden Fig, clothing, such as Lululemon (my daughter’s fave!), pubs, Cooks of Crocus Hill, etc. This street is upscale, and at the same time casual. Punch Pizza, Cafe Latte, and Emmett’s Public House are 3 of our favorite places to eat. Lots to do here, so go check it out!!!\n",
  "So many fun and unique stores.  The RED BARN for children´s books, Pottery Barn, paper products, great Ice cream and good eating places.  Cafe Latte, Bread and Chocolate, The Creamery,  the Tavern on Grand for Minnesota Walleye.",
  "Grand Avenue is ever evolving, but retains the same charm. Since living in on the historic street, back in the 70's -- always return, just to take a walk through time. Even when a new structure emerges, effort is made to complement the neighborhood. \nDuring the holidays, the ghosts of Christmas past flit above the old street lamps. And the shops and restaurants are decorated to enhance the holiday glow. \nRecommend starting from Dale Street, and work your way west -- Tavern on Grand or La Cucaracha are worth an immediate stop to build up your strength...Or proceed another block where Dixie's and Saji-Ya anchor a big corner. All feature fine food and drinks, with warm, welcoming ambiances.\nIf you chose to keep hiking, Pier One, North Face, or a series of interesting shops might drawn one inside. But whoa, the Wild Onion beckons for a quaff and an appetizer. Yet the hearty might proceed a another block, where famous Billy's, Bon Fire Wood Cooking, Cafe Latte and Bread & Chocolate all greet the discerning palate at Victoria crossing.\nBut don't hesitate to continue your quest!\nGrand Avenue is like that, block after block -- whether a member of the J. Crew crowd or into the local and unique tastes of Bibelot, a visitor will always find something \"special\" along the Avenue!",
  "I like Grand Avenue.  It has nice little shops and interesting food choices. If you've never been, check out Grand Old Day, first Sunday in June.  Always PACKED but usually fun with live bands and a ton of attractions for entire family. Only down fall is parking.  Hard to park on the Avenue.  I suggest parking on Summit Avenue and walking over, be aware of no parking signs. Easy walking in nice weather. Don't park in off street parking unless you are going to that business or you'll get towed.  ",
  "No matter what your taste may be, Grand Avenue is the place to stroll along.  Great shopping and a variety of different types of restaurants.  Parking can be a premium on Grand Avenue so if you see a parking spot, grab it.  ",
  "I moved to the area last summer, and I have not regretted it one bit!   Grand Ave is always thriving and fun!   Great happy hours, shopping, and walking!   Hit Bonfire for $3 mimosas (almost all champagne) and Salut for happy hour (great food and service).   If you're into sushi, Saji Ya does an excellent job, and Tavern on Grand is just plain fun!   Grand 'ol Creamery.... I could go on and on.   Parking can be a challenge, but it's worth the effort.",
  "Grand Avenue is a treasure. There are not many urban places like Grand Avenue left with local businesses, shopping, and eats.",
  "I come here often and enjoy going to different areas of this miles long street regularly. There is so much to see, to eat, and to shop here. I highly recommend you check out what Grand Avenue has to offer!\n",
  "Grand Avenue is both fun and efficient.  Restaurants, hardware, a Penzy’s spice shop, groceries, papersource stationery store and classes, coffee shops and bakeries, gas stations, pizzerias and a gorgeous fabric shop, indian restaurant, ice cream and candy shops, colleges, toys.  Art supplies, breads, book shops, and the Red Balloon childrens books.   Cafe Latte delicious meals and Cooks wonderful classes, gifts, and cooking equipment.   And that is only the tip of thevideberg!   At the west end it runs almost to the Mississippi River, and at the other end it will take you nearly into downtown St Paul, and many other beautiful neighborhoods.    You can drive through and get ideas, or spend the entire day wandering along.   Even an Afgan restaurant (Kyber Pass),  a juice bar, and Pottery Barn. Banks.   Pharmacies.   It is great!   A national treasure!",
  "I stopped at a couple of businesses in the Grand and Victoria part of St. Paul.  In this area are Cafe Latte, Cooks of Crocus Hill, Billy's, etc.  There were a lot of people out and there was only parking available in the ramp near this intersection.\n\nFurther down the road toward Downtown are more restaurants like Dixie's, Tavern on Grand, Saji-Ya, and La Cucaracha.  All long-time restaurants and I've had good meals at all of them.\n\nThe other direction are restaurants like Grand Catch, the Lexington, Salut Bar Americain, and Everest on Grand.  I haven't been to the renovated Lexington or to Salut yet, but sometime I will have to stop!  \n\nIt is always lively in this part of St. Paul, even in the darkest part of winter.",
  "Grand Avenue has many of the Twin Cities best restaurants and bars.  The avenue stretches from Cathedral Hill almost to the Mississippi River to the west. The vast assortment of cuisines, shops and atmospheres on Grand Ave in St. Paul, MN draws in guests from near and far. Don't forget the Grand Old Days Parade in June. "
 ]
},{
 "name": "Minnesota Children's Museum",
 "address": "10 7th St W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/0a/73/92/exterior-of-minnesota.jpg",
 "tags": [
  "kids",
  "family",
  "food",
  "family",
  "kids",
  "kids",
  "free",
  "food",
  "family",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d134896-Reviews-Minnesota_Children_s_Museum-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum has a bevy of interactive experiences for children of all ages. What impressed me, was that my 16 month old granddaughter entered a room with all kinds of things to capture her attention...especially the water area where she could don a raincoat and play with a variety of water toys that spouted, squirted, drizzled, tipped, floated and mesmerized her. We went from trying to keep her entertained to being entertained. \nSubtly, there were museum staff stationed in various exhibits to gently guide your kids or help you do so. \n\nHighly involving and a beautiful experience to share with your loved ones.",
  "The recently renovated museum is amazing! So many great static and rotating exhibits that no two trips are ever the same. We love the water table in the Sprouts room, the car wash in the bottom floor, the mail room and Dinosaur Train exhibit upstairs, and of course The Scramble playground with climbing and slides for everyone. \n\nMy 1 and 3 year olds can both have a blast and be completely worn out at the end of each trip and we never get to every part of the museum in one day. \n\nWe highly recommend the annual membership as it pays for itself so quickly since all family members 1+ must pay to enter. ",
  "Children’s Museum in Saint Paul is without exception the best place to spend a few hours inside with the family.  I have grandchildren ranging from 1 - 13 and every single one of them enjoy visiting here.  The Scramble, Green Board and Lazer Maze entertain the older kids.  The very young ones have their very own gated area aptly named Sprouts.  This area has water tables, ramps and many little nooks and crannies to entertain the wee ones minds.  Do expect that even with the waterproof jackets available to use at the water tables your children will get wet. The car wash area in Forces at Play is a favorite for all, but here again a spare set of dry socks and possible pants might be needed.  Our World has a play kitchen, Post Office, hardware store with lots of switches and toggles.  Kids love this area.  The outdoor area is nice, but we have not found it as entertaining.  \nThere is a cafe onsite, but the food can be a bit pricey.  I have brought the kids there a few times and have had pleasant service and decent food.",
  "I went on my own tho with an eye to shopping for Childrens gifts and taking the neighbor kids next summer.   There are amazing displays and activities.  Plenty of interesting and experimental sorts of crafts and collections to suit all ages.   ",
  "This was our first visit to the museum and we had fun!  Three floors of experiences and several lounges to take breaks in.  Excellent adventure for children from toddlers to about nine or ten.  My grandson loved the water areas, they do provide rain gear, especially the car wash.  Various MN companies built experience areas.",
  "This is a wonderful Museum for young Children. The exhibits are both educational and fun. Couldn't get our grandchild to leave the water tables. So much activities you can spend most of the day!",
  "The Children's Museum used to be a family favorite for us. We used to have a membership and attend almost every month, but after they reconstructed, none of us ever want to come back.\n\nSince they remodeled, the museum is very loud, busy and cold. It lacks the nurturing, down-to-earth feel it once had. The cute little city that used to be there has been replaced by walls made out of blue cardboard. The area for small children has been switched out with a bare, dead room for decorating paper. The entrance is extremely busy, empty and both overstimulating and underwhelming. Children are screaming everyhwere and running around like it's a madhouse, which is something that didn't happen when the museum was calm and soft.\n\nThe museum used to be creatively supportive, nurturing free play and thinking outside the box. Now there's no room for creativity to happen. There are workers all over, oversupervising and interacting so much with the kids that it's hard to be in your own world. The rooms seem to only have one purpose, not giving much room to creatively play on your own.\n\nThe entrance is also confusing. It's hard to know where to go (hint: up the stairs on the left and through the door). They've added a place where you can buy food and gifts, too. It's extremely overpriced, unhealthy and dirty. We couldn't find a single clean table, which was frustrating considering there aren't many there and there are surely enough staff to keep them clean.\n\nIt feels like our childhoods are gone.",
  "We stopped by, late on a Friday night, so our child could visit a new place. The Science Museum was closed for cleaning, so we tried the Children's Museum. Since they were closing soon, the ticket counter gave us vouchers for another visit. Basically two visits for the price of one! Our child love the water tables, the ball and air compressor tubes, as well as the slides. We didn't get to see everything, but there are many activities for little ones to enjoy."
 ]
},{
 "name": "Fort Snelling State Park",
 "address": "101 Snelling Lake Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/9c/81/9c/visitor-center-with-film.jpg",
 "tags": [
  "hike",
  "history",
  "history",
  "parks",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d147155-Reviews-Fort_Snelling_State_Park-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We’ve been on some fabulous tours here.  Not all of history is pretty and Fort Snelling does a great job of showing it off realistically. Also, a beautiful place to hike around and explore. ",
  "I've lived in the metro area for 35 years and only recently discovered this gem of a state park in our midst this year. Great hiking trails, a trek to Fort Snelling, and an escape from the urban area are all things that make this trip worthwhile.",
  "They do a very good job of sharing the history of both the beginnings of the American fort along with the displacement of the Native tribes.  Excellent display and narrative regarding the Brief Dakota War that resulted in the most hangings in one place (Makato) in American History.  Guides dress in period costumes and give you a taste for life there in the 1820's and beyond.  Also good exhibit about Dred Scott and his wife's time there.",
  "My wife and I hiked the Pike Island loop in February. It was about 45 degrees and sunny so things were melting quite a bit. The loop is about 3.5 miles all together and it took us about two hours. It runs right along the Mississippi River so the view is very pretty. Since it’s Minnesota, it is very flat. We wished there was a bit more elevation change but we had fun anyway. We brought our dog who had an absolute blast. There’s so much more to explore at Fort Snelling State Park than just the Pike Island loop. We look forward to exploring more. We live in Minneapolis so it’s only about 20 minutes to the park. All other state parks are at least an hour away. We will be back! ",
  "Many people have no idea Fort Snelling State Park is there. It is under the Fort area at the bottom of the bluff along the river. It has wonderful hiking, and is an awesome place to go on a hot summer day.",
  "The visitor center at Fort Snelling is permanently closed. Visited this state park because of it’s history. Fort Snelling is strategically located because of which one gets good views of the surroundings. Was disappointed not to see good fall colors during the second weekend in October. ",
  "Fort was not open the visitor center permanently closed. Hiked down along the river path was nice some areas closed due to the unusually high water this year. Would go again for the hiking trail alone regardless of the Fort  and visitor Center being closed.",
  "We took our grandsons to Ft. Snelling for a Saturday outing. We had been there years ago and found the experience to be quiet positive. This visit seemed to lack energy and struggled to hold our attention, not to say anything about our grandsons. It seemed like those enacting the parts of the fort's residents were just going through the motions, though some were better than others. The highlight of the day for this old man was the interactive center and the WW II history. Maybe a different day would have been better, hope so..."
 ]
},{
 "name": "Union Depot",
 "address": "214 4th St E",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/06/0b/73/union-depot-north-plaza.jpg",
 "tags": [
  "historic",
  "unique",
  "food",
  "structure",
  "walking",
  "food",
  "family",
  "historic",
  "unique",
  "food",
  "structure",
  "hike",
  "walk",
  "free",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d6698306-Reviews-Union_Depot-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Many events here throughout the year. It’s a great space for craft fairs etc while taking in this historic building ",
  "Union Depot has a lovely European Christmas Market each December.  The Market is outside, but features heaters and fires to keep you warm.  The vendors are all independents with above-average craft offerings.  Food, in addition to both alcoholic and non-alcoholic beverages are available.  The Depot itself is also beautiful, and it’s accessible by light rail.  This is a great way to support local artisans and to find unique holiday gifts.",
  "There was a holiday festival going on next to the depot so we came down to check it out.  The depot itself is stunning with the high ceilings, and the beautifully refinished interior space.  It was jumping with activity the day we visited which made it more enjoyable and they had a Christmas tree up which everyone was taking pictures in front of.  Located in the downtown St Paul area, close to plenty of other activities.",
  "A wonderful example of classic space. The renovation has allowed for an atmosphere that elicits the era of the passenger railroad. The grounds are clean, and easy walking distance or connection to all modes of public ground transportation. I recommend going early in the morning or early evening. It is quieter, and gives an opportunity to appreciate depot structure and form.",
  "Weather by foot, bike, car , bus or train transportation is your choice. Once inside check out the beauty and pride that used to be put into the American transportation system back when trains were king. Do check out the menu at the Greek restaurant Christos; good food and fun happy hour. Close to Lower Town St. Paul so other entertainment and food options close by.",
  "This is a great visit for the family.  It is worth the architecture.  Wednesday nights is family game night. And every night, besides special events, there is a ping pong table - just bring your own paddles and balls.",
  "Many events here throughout the year. It’s a great space for craft fairs etc while taking in this historic building ",
  "Union Depot has a lovely European Christmas Market each December.  The Market is outside, but features heaters and fires to keep you warm.  The vendors are all independents with above-average craft offerings.  Food, in addition to both alcoholic and non-alcoholic beverages are available.  The Depot itself is also beautiful, and it’s accessible by light rail.  This is a great way to support local artisans and to find unique holiday gifts.",
  "This station is waaay better than the warehouse-like structure in the middle of nowhere they used to use for passenger rail. It's comparable to the Minneapolis depot they used before that. As with many American train stations, you have to walk about three miles in the freezing cold along a smelly, noisy track to get to the indoors. Once in, it's another long hike to the very large and beautiful and nearly empty waiting rooms. There did seem to be an eating place here and some vending machines but not a lot else. There doesn't seem to be a visible information desk or person either which should be added. The Depot's web site is also very vague and unhelpful. The space itself is grand. There was an Amtrak First Class Lounge along one side of a waiting room that was totally empty and locked. Contrast this with the bustling train stations in the UK and Europe (or even Chicago or DC) where there are plenty of shops, restaurants, and services, including, often, bike rentals and info/help employees, for the crowds who are able to use their rail system for everyday transportation. It's sad that we can't do that given the way mist of our country's passenger rail is currently operated.  The baggage claim is near the Kellogg Street exit which is very convenient for people picking up friends and next to a parking facility. The light rail also serves this station as do long distance, regional, local, and commuter bus lines. The gates are well marked and scrolling arrival screens constantly update. You arrive in the heart of downtown St. Paul. If the hours are right, you may be able to take the enclosed above-ground skyway to other downtown destinations, though it appears an important section of this system is closed evenings and weekends. There's a lot of beautiful space in the St. Paul Union Depot and it would be great if they could fill it with more amenities and life.",
  "It's free to walk in and enjoy the Union Depot in Lowertown Saint Paul and you should if you are in the area. Perhaps similar but not quite as grand as the landmark center, you get a flair for what it was like in the grand days of travel and crossing the country by train. the train still stops here, as do a few buses but the place is fairly quite these days. It would be great if they broadcast some noise of commotion of what it must have been like back int he a day. There is a coffee shop, restaurant/bar in here along with a bike shop and few other miscellaneous businesses, but they lack the people and crowds.",
  "Went to see the recently restored UP Big Boy. It had rolled in as a stop on its maiden voyage tour of the Midwest. Amazing. This beast has not seen fir since 1952, UP pulled it off a static display 5 years ago, spent millions of dollars and restored it for the 150th Anniversary of the Great Meet / Golden Spike at Promontory."
 ]
},{
 "name": "Twin City Model Railroad Museum",
 "address": "668 Transfer Rd Suite 8",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/8a/37/eb/main-building.jpg",
 "tags": [
  "kids",
  "knowledgeable",
  "history",
  "history",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d2446321-Reviews-Twin_City_Model_Railroad_Museum-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This was a great place to visit.  We highly recommend this place.  We tood our grandson who loved it.  But both my wife and I said we should go back ourselves.  It was fantastic.  The big train layout was from the old MIlwaukee Train Depot from decades ago.  There are numerous additions to see also, including a large train layout with a mountain and town made out of legos.  It is very easy to spend a couple hours enjoying the exhibits.  Again, we highly recommend this museum.",
  "The real genius here is two-fold: 1) operating layouts of all gauges - z, n, ho, s, o, and g. 2) it's extremely kid-friendly. Lots of buttons to press to make the trains go and accessories to operate. Most are kid level to see, too. Adults who had trains as kids will have great memory jogs of American Flyer, Marx, and Lionel products. The O scale representation of Minneapolis railroad activity is also impressive. If you are a Lionel afficianado, you will enjoy seeing the dream layout featured on the back of the 1957 catalog. If you are into research, they have an impressive collection of rr books and magazines, and a staff who love the hobby and are knowledgeable. While some may have wished for larger n and ho layouts, which are often on display at train shows, these smaller ones show how much fun can be had in smaller spaces found in most homes.",
  "This museum has a great collection of working model trains.  It is especially interesting to young children.  I highly recommend you going for a visit, I am sure you will be glad you did.",
  "This was a great place to visit.  We highly recommend this place.  We tood our grandson who loved it.  But both my wife and I said we should go back ourselves.  It was fantastic.  The big train layout was from the old MIlwaukee Train Depot from decades ago.  There are numerous additions to see also, including a large train layout with a mountain and town made out of legos.  It is very easy to spend a couple hours enjoying the exhibits.  Again, we highly recommend this museum.",
  "The staff does a great job of keeping all these trains running.  My 6 year old grandson especially liked the huge Lego train layout!",
  "Great locomotive and also good history of trains. The children had a lot of fun and there was a large crowd. The volunteer staff sere pleasant and patient answering many questions that we asked.",
  "The DW and I just love model railroad museums and this one is up there with best that we have seen.Especially because they have so many buttons to push. One layout was of a theme park and even had a working roller coaster with a loop.",
  "Great volunteer staff here and the model train layouts are very well done with  a lot of hands on things for adults and kids alike to get the trains rolling. Good historical exhibits on the evolution of model railroading and it's heyday after WWII until 1960 when the hobby was at its peak. Entry prices are low and lots to see here. History of the various companies that provide model trains and the different types of track gauges. All in all very well done."
 ]
},{
 "name": "The Palace Theater",
 "address": "17 7th Pl W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/8d/f0/da/upper-balcony.jpg",
 "tags": [
  "music",
  "history",
  "drink",
  "performance",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d12393998-Reviews-The_Palace_Theater-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This place is awesome.  It has seen better days and it shows its age but the venue is fantastic for a show. I saw Mandolin Orange and is was a great show. Sound system was good.  Clear. Could use better stage lighting ",
  "Attended a recent concert here. My first time at this theater. It was wonderful. Great vibe & can't wait to attend another concert there",
  "The Palace is my favorite music venue in the Twin Cities! There isn't a bad seat in the house. The sound throughout the venue is fantastic, even outside the seeing area at the upper bars!\n\nThe architectural appointments, or actually, the lack of appointments, shows the long history of this old vaudeville theater. The wind staircase from the first to the second floor harkens back to to a time when going out to the theater was a special occasion worthy of some pomp and circumstance.\n\nThroughout the venue there are many little bars tucked away and you're never far from a beer or drink and they lines are short.",
  "Great venue!  Acoustics awesome. Easy access. Definitely would attend events at this venue again. Floor rush seating was no problem! ",
  "The last time Snarky Puppy was in the Cities was in Sept 2017 and I was working a show out of town and had to miss it. Snarky Puppy *was* my favorite recording act and I really wanted to hear them live, since their records are mostly live performances and they sound amazing. I bought tickets for this performance in St Paul at Eclipse Records in January, so I had the pick of seats or floor space. My wife has knee problems, so I went for seats in the balcony. After experiencing the near-TSA security gauntlet and probing, we find there is no handicap access to the 1920's balcony but the 1920's staircase. A very accommodating manager gave us floor seats right behind the FOH console. \n\nThe old theater is partially refurbished, but still looks a lot like the interior was shredded and some curtains were hung on the wall to cover the destruction. I checked out the balcony seats and they are basic old-school theater seats on cliff-style risers; definitely not handicapped accessible. I didn't see anything that looked like real acoustic treatment and the acoustics were certainly overdriven by Snarky Puppy's totally deaf FOH tech. \n\nThe sound system and mix, belonging to the band, was along the sound quality lines of 1970's Iron Maiden or Deep Purple; loud and distorted. The venue should have been issuing hearing protection or should have been sued for the resulting client hearing damage. My phone's SPL meter app registered 126dBSPL C-weighted with peaks that overloaded the phone's mic (>130dBSPL). I did not expect that kind of punishment and abuse from Snarky Puppy and did not bring hearing protection; something I almost never do. The floor is concrete and the closer you get to the FOH stage system the more likely you are to experience permanent hearing damage. The empty theater acoustic tactic creates a very reverberant room that is not idea for loud music. It would have been find for SP if the band had hired a competent FOH tech. \n\nThere is a decent bar that does mixed drinks. The bathrooms are also not handicapped accessible and are in the basement. If you are into 1980's New York disco style music, that would have been the night for you."
 ]
},{
 "name": "Landmark Center",
 "address": "75 5th St W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/84/d1/ca/landmark-center.jpg",
 "tags": [
  "art",
  "history",
  "walk",
  "free",
  "historic",
  "free",
  "library",
  "history",
  "tour",
  "walking",
  "history",
  "free",
  "family",
  "food",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d285876-Reviews-Landmark_Center-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were out with a friend on Sunday; after brunch at the St. Paul Grill and a walk through the remodeled Rice Park, we wandered over to the Landmark Center.  Much to our surprise, we discovered it was open and went in.  \n\nAfter speaking to the person at the information desk, we proceeded to look around.  We were free to walk around the four floors and the downstairs.  Well, that was all we needed.\n\nI hadn’t been in the building for many years.  About 38-40 years ago I played a concert on the main floor with a youth symphony I was in so I was thrilled to look around.  The building was newly remodeled in 1978 and the concert I was in wasn’t much after this.  I was absolutely astonished at how well the building had been fixed up and how truly beautiful it was looking.\n\nWe found the history display on the main floor about the building serving as a Federal Courthouse, Federal Office Building (including housing an FBI Office), and a U.S. Post Office.  Our friend had worked for the telephone company when the building was being remodeled (1970s) and remembered the courtrooms on the fourth floor as having sheetrock on the walls covering everything.  He made sure we could go into the courtrooms and away we went.\n\nThe building is filled with beautiful old wood and rose-colored granite, with marble stairs and elaborate wrought iron railings.  Fortunately, there are also elevators as there are offices, The Schubert Club Museum, and the Gallery of Wood Art on upper floors.  The building was constructed from 1894 to 1901, and opened in 1902.  The main atrium has a glass roof which had been covered before the major remodel of 1978.  Light filtered in on the polished floor below.  Also uncovered was the glass ceiling in one of the courtrooms.  Gorgeous!  \n\nThe courtrooms have been beautifully restored.  The wood carving on the walls is amazing, and parts of walls and adornments are made of carved marble.  Original (electrical) lighting is being used throughout.\n\nWe will definitely return to read more of the history as there are plaques on the walls of the upper floors in addition to the main floor displays.  Really well-done!",
  "I am so grateful that the ladies of St. Paul saved this glorious building from the wrecking ball. It is such a good example of how a historic restoration project can be put to used in the modern world.  So many musical and other cultural events are staged here as well as housing the Ramsey County Historic Society and other offices.  Don't miss it.",
  "Throughout this 115 year old building's history, this has always been one of St. Paul's hidden jewels, a true landmark from the perspective of both its architectural exterior to the four interior floors that capture its long history. The main floor, which was used as a federal branch  location for the U.S. Post Office for much of its early history, is truly remarkable (with the fifth floor utilized as a roofed skylight), while it is currently often used for events like the monthly St. Paul Ballet show, performed on the 2nd Tuesday of every month, free of charge. Weddings are incredibly popular here, at least for reception purposes, on the first level, especially on the weekends. For history and culture seekers, I highly suggest to check out the text and video panels located on the basement and first floors, which nicely highlight the building's history and its transformation into an eternal city landmark. The third floor is notable for housing several court rooms, including the Minnesota federal court chambers, where several 1930s gangsters were tried. As a history major and architectural lover, I am simply astounded by this building every time I step foot in it or drive past it. Anita's Cafe is a great spot for lunch and is moderately priced - it is located at the Rice Park entrance. Many tenants call this building home, including the Schubert Club Museum and Ramsey County Historical Society (RCHS). Stop by the RCHS Research Center, located in the basement, for any of your research needs! A nice private exhibition of memorabilia related to the St. Paul Winter Carnival is featured on the first floor every January. School tours stop by year round, and with its great location next to Rice Park, Central Library, St. Paul Hotel, and the Ordway Center, the Landmark is a wonderful place to admire from either the inside or outside. We should all take great pride in this century old landmark!!!",
  "We were spending a morning exploring St Paul on foot when we came across this striking building and discovered that it was open to the public, allowing us to have a good snoop around. It's a beautiful place - a landmark in more than just name - which has been put to use in many different ways in the course of its lifetime, much of which is explained in detailed exhibits throughout the building. Perhaps most interestingly, this was the courthouse where John Dillinger's partner and associates were tried. We enjoyed exploring these exhibits and really needed more time to take everything in. Exiting the building out to neighbouring Landmark Plaza, you'll find several small statues of characters from Charles M Schulz's Peanuts comic strip - another of the Twin Cities' gifts to the world.",
  "I was visiting St Paul from the Boston area and decided to tour the Landmark Center because it was within walking distance of my hotel. They offer a guided tour on Thursdays, when I happened to be there. The tour guide was excellent, telling us all about the interesting history of this beautiful building. Unbeknownst to me, the Schubert Club sponsors a free concert on Thursdays in one of the old courtrooms. I nixed my plans to visit the Capitol building and stayed at the Landmark Center to hear the Delphia Cello Quartet play. Complete serendipity. It was an oasis of sound on a snowy day.",
  "Gorgeous venue for a wedding reception. Lots of things to look at if you don't know the people at your table! Interesting background on building downstairs on the way to the bathroom. Food was awful though according to the price paid by bride's family. Bland and not that good.",
  "It is a gorgeous must see building. It has quite the history. If only the walls could talk. It has a courtroom that John Dillinger and gang were prosecuted in. The Wood Turners Association has a museum with the most beautiful woodwork you have ever seen. You can get a history lesson, lunch and visit their gift shop for some really fun and different items to buy. Don't forget to go by the Old Post Office so you can get a bit of history just by pushing a button. Oh and you can get married there too.",
  "Landmark Center is in a great area of Saint Paul.  Across the street is a little \"park\" space.  The water fountains across the street are neat.  The Peanut character statues (by Charles Schultz) all around are cool.  You see Linus, Peppermint Patty, Schroeder and Lucy - all the favorites.  I think my wife even found Snoopy and Charlie Brown.\n\nThe Landmark Center Building is gorgeous.  At one time, it was a Federal Court House and Post Office Building.  The city considered tearing it down.  Fortunately, it was preserved.  It's now a venue for the arts.  \n\nWe didn't try it, but there's even a restaurant on the lower level of the Landmark Center.  \n\nThere is no charge for the Landmark Center.  \nParking is a little inconvenient.  The space we had allowed only 30 minutes max.  I had to run back and feed the machine once or twice.\n\nThe Landmark Center is a Must-See attraction in Saint Paul.  If you can, spend a little time on the nearby Mississippi River.  There's a nice park on the other side of the river"
 ]
},{
 "name": "Ordway Center for the Performing Arts",
 "address": "345 Washington St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/7f/3d/42/ordway-mn-opera-set-orchestra.jpg",
 "tags": [
  "performance",
  "music",
  "performance",
  "music"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d2556227-Reviews-Ordway_Center_for_the_Performing_Arts-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have only been here to hear the St Paul Chamber Orchestra and they have a great venue. Wonderful seats, great acoustics. Personally I think it is worth to pay a bit more to sit in orchestra.",
  "My wife and I attended a CMA Songwriters event recently.  It was my first visit to this beautiful theater.  The location is downtown St. Paul, easily accessible by car or mass transit (train/bus), and there are a number of parking garages nearby.  We had dinner at one of the many local great restaurants and then walked the short distance to the show.  The staff was excellent and made access very quick and easy.  There were many beverage stations, so wait time was short and you could bring your beverage into the theater, which some don't allow.  The event was wonderful and exit was easy as well.  I would certainly recommend the venue for any future events.",
  "We went today to the last matinee of Smokey Joe’s Cafe.  The performance was excellent.  It was made up of 9 primary cast members, each one very talented singers and dancers. We enjoyed it very much!!  The Music was excellent.  Well done!",
  "My wife and I have been to the Ordway many times. We always get season tickets for the Saint Paul Chamber Orchestra. We also sometimes attend shows in the main theater. \n\nThe main theater has big shows like operas and traveling broadway shows. It’s great for shows like Phantom or Les Miz.\n\nThe smaller, newer concert hall is where the SPCO performs. The intimacy and acoustics of the concert hall are really great for the SPCO. Much classical music was really written for smaller chamber orchestras rather than huge 20th and 21st century symphony orchestras. You really get a feel for what music like Mozart and Bach must have sounded like when performed in the original venues with the original instrumentation. \n\nThe lobby can get really crowded when both theaters are staging performances at the same time. \n\nOne of the nicest things the Ordway ever did was be very accommodating when my wife had a stroke and was confined to a wheelchair for a number of months. They even let us come into the building on a day that there was no performance so we could work out how best to navigate around in the wheelchair to areas like the restrooms, bars and our seats. That really helped my wife with the anxiety she was feeling before we attended our first performance with the wheelchair. ",
  "I have been to the Ordway a number of times.   It's s a wonderful venue to watch the opera and theater.  Most recently I was there to see Minnesota Opera's world premiere, \"The Fix.\"  It was great.  You can order your drinks ahead of time so they are ready for you at intermission without having to wait in line.  The staff at the Ordway are always friendly and helpful."
 ]
},{
 "name": "Rice Park",
 "address": "109 W 4th St, 5th St / Washington St / 4th St / Market St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/1c/6a/7b/rice-park.jpg",
 "tags": [
  "tour",
  "library",
  "walk",
  "history",
  "food",
  "library",
  "tour",
  "library",
  "walk",
  "history",
  "food",
  "library",
  "walk",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d561654-Reviews-Rice_Park-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you plan to tour the downtown area on foot, I suggest you start in this park. Located across from four St. Paul landmarks (Landmark Center, the Ordway, the St. Paul Hotel and the Central Library) and within blocks of so many other attractions this a great starting point to begin a walk.  Rice Park is a busy  center  of activity at weekday lunchtime, but also is often the sit e of weekend weddings and various civic events like concerts.  A fountain that  has a bit of history with it is in the park, along with a statute of F. Scott Fitzgerald.  Some characters from the cartoon strip Peanuts are also on a bench of their own on the far eastern side of Rice Park..\n\nSpeaking of characters, this park is the home to a collection of them - a colorful food vendor offers you hot dogs, you will see  brides/grooms  from weddings that are well attired, the ever present seedy looking panhandlers offers you an urban noir look,while  the sports fans on their way to the nearby hockey venue display their various  over-priced but stylish jerseys as they rush by you and the well dressed opera patron watches what they are stepping around as they travel though this  urban park. All off these types can be seen if you are at Rice Park at given times.  Joining the human traffic are pigeons and squirrels, eager to take any food you may have to offer them as they beg for tribute as you pass through their domain.\n\nFull of traffic noises and some homeless, this is not paradise but it is an interesting starting point to sample urban life in  today's St. Paul.",
  "If you are expecting swings, slides, and sand this is not going to be a park for you! Rice Park is a little gem in Downtown St. Paul where you can enjoy events like the Winter Carnival, or stroll through it at night and see the trees all lit up in their beauty. You may even catch a proposal or two! From one side of the park you get to the public library, another side is the Ordway, and then the Landmark Center, and finally the St. Paul Hotel. So while there may not be much to do all the time in the park, it is a nice stop on your way to wherever you are going nearby!",
  "If you plan to tour the downtown area on foot, I suggest you start in this park. Located across from four St. Paul landmarks (Landmark Center, the Ordway, the St. Paul Hotel and the Central Library) and within blocks of so many other attractions this a great starting point to begin a walk.  Rice Park is a busy  center  of activity at weekday lunchtime, but also is often the sit e of weekend weddings and various civic events like concerts.  A fountain that  has a bit of history with it is in the park, along with a statute of F. Scott Fitzgerald.  Some characters from the cartoon strip Peanuts are also on a bench of their own on the far eastern side of Rice Park..\n\nSpeaking of characters, this park is the home to a collection of them - a colorful food vendor offers you hot dogs, you will see  brides/grooms  from weddings that are well attired, the ever present seedy looking panhandlers offers you an urban noir look,while  the sports fans on their way to the nearby hockey venue display their various  over-priced but stylish jerseys as they rush by you and the well dressed opera patron watches what they are stepping around as they travel though this  urban park. All off these types can be seen if you are at Rice Park at given times.  Joining the human traffic are pigeons and squirrels, eager to take any food you may have to offer them as they beg for tribute as you pass through their domain.\n\nFull of traffic noises and some homeless, this is not paradise but it is an interesting starting point to sample urban life in  today's St. Paul.",
  "This fun event draws huge crowds. There are events centered around Rice Park in dt Saint Paul and spread out through the cities. The Fairgrounds have snow sculptures, Como Park has the Conservatory and outdoor snow events. There are Klondike Kate’s, Snow Royalty for all age groups, ice sculptures, ice skate rinks dt, food/libations, and many other cultural events.  There are two parades held. The torchlight and a Saturday parade. There are Vulcans fighting for winter. Very fun watching.  They have a dog and hootch bar plus the Cat Show of 200 breeds. It goes on for two weeks. ",
  "This park was probably my first city park downtown, visited often on bus trips to do research at the library and the James J Hill reference library.  Now it is a beloved green space, and a memorial to Charles Schultz as well, with Peanuts sculptures added over the past few years.   It is a lovely park, and a great starting spot for all the surrounding attractions!",
  "Nice place to walk and enjoy the fountain and sculptures of the whole Peanuts gang seated on benches around the park. ",
  "Rice Park has been redone and now is a beautiful park in the heart of downtown St Paul with a wonderful fountain, flowers and lots of seating. It is an oasis surrounded by the Saint Paul Hotel, Landmark Center, Ordway Theater, and the Downtown Central Library.",
  "This is a fun thing to do in the winter.  The location is great and they have skates to rent and a warming area.  to be able to skate here is so fun."
 ]
},{
 "name": "St. Paul Farmers Market",
 "address": "275 4th St E",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/54/00/ae/st-paul-farmers-market.jpg",
 "tags": [
  "free",
  "food",
  "walk",
  "eat",
  "food",
  "delicious",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d288196-Reviews-St_Paul_Farmers_Market-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great Farmer's market! The difference between this one and the Mpls Farmer's market is that all vendors here have to sell only locally grown produce. You won't see oranges or bananas sold here. There are a few vendors that sell organic produce.\n\nMeter parking is free on Sundays and if you come early enough, parking is no problem. Come later and you'll have to walk quite a bit but it's still worth it.\n\nYou'll find locally produced meats, eggs, cheese, honey and craft items like soaps and lotions. There are food vendors here as well if you get hungry/thirsty. Then of course depending on the season, you'll find a variety of vegetables and fruits.\n\nTip: Bring cash as 95% of the vendors take cash only. EBT is accepted as well. I would highly recommend going through each stall once to see what's available and prices and then go back to purchase.",
  "The St. Paul Farmer's Market is a great place to find all your produce needs and from a variety of vendors.  There are great bakeries and chocolatiers as well, so all your feasting needs can be met.....  It is well laid out and easy to navigate.  Parking can be an issue, especially at peak hours, but there are lots in the neighborhood.  Oh, yeah, and the flower bouquets are spectacular and reasonably priced.  We go back whenever we make it to St. Paul.  They also have a winter location nearby.",
  "We went to the market on Sunday morning.  We came home with beets, lettuce, corn on the cob, cantaloupe and kale. All delicious.  Also available are some selections of cooked food to eat there including spring rolls, corn on the cob, and bagel sandwiches.  Three sections of market to review. Shoppers and vendors all very friendly.  No dogs allowed, so leave Fido at home for this one.",
  "We came here on a September Saturday and wandered around for over an hour.  Lots of things to see, buy and taste.  Beautiful flowers and tasty veggies everywhere.  It's outdoors so weather is key but on a nice weekend (like we had) this is definitely worth some of your time.",
  "With the amount of great reviews I read about this farmer's market,  I was expecting great things. Numerous different types of vendors,  etc. Unfortunately I was disappointed. Three whole aisles were filled with the same produce over and over just different vendors. The rest were all crammed into one aisle. I was ran into, and had people step right in front of me as I was looking at a few stations,  and never once heard an excuse me or an Im sorry. Ive been to many farmers markets,  and yes this one is busy, but I have never encountered so many rude people. Unless you are going for a certain couple things,  I would avoid this farmers market. Not worth going out of your way to browse as it is mostly the same fresh produce over and over. The lettuce and tomatoes I purchased were great, however I will not be returning. ",
  "I love this vibrant farmers market in St. Paul. So many choices from veggies, berries, cheeses, meats, flwers and much more.",
  "Luckily my boyfriend lives right across the street from the market so going over in the mornings on the weekends is the best. We get all the spring fresh vegetables for our lunches/dinners, fresh flowers for the house, veggies and plants for my daughters garden. We go there for breakfast bagels and coffee, sit and people watch. All of the vendors are friendly and very informative about their products. It is smaller and much more intimate than the Minneapolis farmers market. A very large and cheap parking lot nearby. Come and visit.",
  "I love farmers markets and have visited enough of them to know that this is a good venue. I’d like to visit again when the place is humming with activity."
 ]
},{
 "name": "The Raptor Center",
 "address": "1920 Fitch Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/08/34/45/raptores.jpg",
 "tags": [
  "tour",
  "tour",
  "knowledgeable",
  "tour",
  "learn",
  "kids",
  "tour",
  "knowledgeable",
  "family",
  "walking",
  "learn"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d560531-Reviews-The_Raptor_Center-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Found this on Trip Advisor. Guided tour of the raptors. Explanation of the function of the center. Many different raptors in cages. Explanation of why the birds are there and what they are doing with them. Tour took about 45 minutes. Informative. Might be tough for small children. They don’t want noise and sudden movements.",
  "Wonderful experience and learning exposure. The educational birds are phenomenal and the care delivered to the injured and rehabbing raptors is world class. Great educational programs. On the St. Paul U of MN campus.",
  "The Raptor Center is a great place to see raptors up close. The tour lasts 30 minutes and you get to see the birds for the majority of that time. Tour guides are very friendly and knowledgeable, and tour groups tend to be small, so you receive personal attention. Most of the birds are outside, so dress accordingly. There is a parking ramp across the street from the raptor center.",
  "Found this on Trip Advisor. Guided tour of the raptors. Explanation of the function of the center. Many different raptors in cages. Explanation of why the birds are there and what they are doing with them. Tour took about 45 minutes. Informative. Might be tough for small children. They don’t want noise and sudden movements.",
  "Wonderful experience and learning exposure. The educational birds are phenomenal and the care delivered to the injured and rehabbing raptors is world class. Great educational programs. On the St. Paul U of MN campus.",
  "The Raptor Center is a great place for kids and adults. You can learn a lot about the rescue birds and see them very up close. The staff is helpful and can answer questions.",
  "The Raptor Center is a great place to see raptors up close. The tour lasts 30 minutes and you get to see the birds for the majority of that time. Tour guides are very friendly and knowledgeable, and tour groups tend to be small, so you receive personal attention. Most of the birds are outside, so dress accordingly. There is a parking ramp across the street from the raptor center.",
  "Our family went to the Raptor Center for an activity combined with the St. Paul Como Conservatory, and it made for a St. Paul destination activity that was interesting and included a little walking, and just the right amount of time.  The Raptor Center has parking meters out front, and discounts for University of Minnesota only students with proper ID, The admission fee is reasonable for all visitors.  The Raptor Center has many enthusiastic volunteers, and tours are often available for shorter or longer periods of time.  There's a variety of raptors in the Center and it is interesting to observe them and learn about the Raptors and the Center.  There is a small gift shop.  "
 ]
},{
 "name": "Bad Weather Brewing Company",
 "address": "414 7th St W",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/aa/71/ad/wall-art.jpg",
 "tags": [
  "brewery",
  "food",
  "brewery",
  "tasting",
  "delicious",
  "food",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d10065560-Reviews-Bad_Weather_Brewing_Company-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were in town and came across this brewery. Great Service with great selection of beers. Everyone was very nice, with a fun crowd.",
  "Went on a Thursday evening with a large group of folks. It’s a big space and we were able to make use of the large tables. It was very busy and buzzing with people but not crowded and uncomfortable. There’s a long list of brews and bar staff were helpful in giving a taste so I could select a beer I enjoyed. Having a food truck just outside was convenient and I’d definitely go back to this brewery. ",
  "It was very busy Friday evening when we stopped by for a tasting, but it only took a few minutes for someone to wait on us. We tried four of the refreshing summer beers, and all of them were very good.  We will return to try more varieties of the delicious brews when we have more time and when they aren't quite so busy.",
  "Stopped in after a long trip . Got a table and went to the bar to order a flight . Place was hopping . Food truck outside with delicious smelling bbq.  Enjoyed the flights and the atmosphere . Excellent beer and vibe . Don’t miss !!",
  "Very cool location. Beer was quit good and servers very fast and helpful. Prices are for selfservices a little too high."
 ]
},{
 "name": "Como Lakeside Pavilion",
 "address": "1360 Lexington Pkwy N",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/5e/f4/fa/como-park-pavilion-at.jpg",
 "tags": [
  "family",
  "walking",
  "food",
  "walk",
  "free",
  "music",
  "walking",
  "food",
  "free",
  "music",
  "free",
  "music",
  "walking",
  "walking",
  "walk",
  "food",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d561659-Reviews-Como_Lakeside_Pavilion-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Whether you're just taking a break from going to the Como Zoo and Conservatory or if the Pavillion is your destination, it is a lovely place for a walk or a photo.  There is a water feature with a walking patch and a lovely floral covered gate that is just begging to be in your family photos.  There is a small restaurant in the pavilion that has light food options and in the summer, you can rent a paddle boat to explore the lake.  There is a path all around the lake, and it is a lovely walk any season.",
  "There is a lot in the area, it doesn't cost anything usually to do that activities at the pavilion, love that its right on the lakeside. I enjoy walking around the lake while they have music playing. Sometimes there are weddings.  The golf course is across the street and the zoo in walking distance which is also free!",
  "When conditions are right in terms of the local weather, your mood and the crowd level - this is the perfect stop. Located in Como Park, it is as close to the lake as it can be without being a boat. The interior of the pavilion contains a comfortable  venue that offers a quality selection of food and beverages. Often the outdoor portion of the building is used for weddings or public events like concerts. \n\nOn weekdays in the summer this venue is crowded as people flow into it from Como Park. Weekdays and off-season the venue is quiet and relaxing.  The quality of the lake has its ups and downs - often the greenish slim on it is  so ugly you want to move on. When conditions are pleasant the local water fowl add to the  charming  scene when things are going well.",
  "On Monday nights during the summer there is free music in the pavilion. A fabulous swing band played the night we were there. You can also people watch, rent a kayak or stroll the area below the pavilion along the lake. Ice cream and other snacks are available.",
  "We ate a leisurely lunch here inside at the cafe. Prices were very reasonable.There is live music outside every night in the summer. It looks like there is a bar outside for in the evenings. You can rent paddle boats, canoes, kayaks behind the pavilion. The building inside is clean and rustic. It is similar to a park lodge. The restrooms were clean. Parking is free and convenient next to the building. We were there midweek and it was not super busy. I am not sure if there is adequate parking at night when the live music is going on, but during the day it was. The lake is very pretty. There is a walking path around the area. A waterfall across the street is visible through the large ornate windows. We will return.",
  "Friendly faces as you walk this manageable distance. Lots of wildlife which changes through out the year. Waiting and looking forward to what the pavilion will bring. Missing it this winter. Always nice to have a hot toddy after walking. ",
  "Wonderful place but the worst food I ever had. Good to have a walk around the lake is beautiful. Just go to walk and see the lake\n",
  "This is a real disappoint after Como Dockside. A real dumbing down of food and service. However it is convenient end of discussion."
 ]
},{
 "name": "Como Park Zoo & Conservatory",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/9b/07/0f/como-park-zoo-conservatory.jpg",
 "tags": [
  "free",
  "knowledgeable",
  "free",
  "knowledgeable",
  "free",
  "knowledgeable",
  "walking",
  "free",
  "walk",
  "free",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d12879653-Reviews-Como_Park_Zoo_Conservatory-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a wonderful free attraction for all ages.  The zoo is laid out in a circle so it's easy to see all the exhibits. Zoo talks are presented throughout the day; employees are very knowledgeable of the animals and talk at a level that children can understand.  There is also a conservatory that is worth visiting, especially on a cool winter day.  The flowers are beautiful and plants are healthy.  Employees are available to answer questions and point out some animals (sloths, birds, etc) that are on hand.  Although not open on the day I visited, there is a small amusement park and an enclosed carousel on the grounds.",
  "This is a wonderful free attraction for all ages.  The zoo is laid out in a circle so it's easy to see all the exhibits. Zoo talks are presented throughout the day; employees are very knowledgeable of the animals and talk at a level that children can understand.  There is also a conservatory that is worth visiting, especially on a cool winter day.  The flowers are beautiful and plants are healthy.  Employees are available to answer questions and point out some animals (sloths, birds, etc) that are on hand.  Although not open on the day I visited, there is a small amusement park and an enclosed carousel on the grounds.",
  "This is a wonderful free attraction for all ages.  The zoo is laid out in a circle so it's easy to see all the exhibits. Zoo talks are presented throughout the day; employees are very knowledgeable of the animals and talk at a level that children can understand.  There is also a conservatory that is worth visiting, especially on a cool winter day.  The flowers are beautiful and plants are healthy.  Employees are available to answer questions and point out some animals (sloths, birds, etc) that are on hand.  Although not open on the day I visited, there is a small amusement park and an enclosed carousel on the grounds.",
  "If you are looking for a great place to address spring fever, at least for awhile, then visit St. Paul's Marjorie McNeely's Como Conservatory. Spent over an hour just walking thru lush tropical gardens and the ever changing sunken garden. Wish we would've gone there earlier this winter. ",
  "The conservatory is a perfect escape from winter.  Especially this 2020 winter which is damp and grey.  The ferns and flowers are a perfect change of scene and smell! ",
  "On a cold rainy afternoon, in December, we decided to visit the Conservatory and a small part of the Zoo.  We had a wonderful walk through the beautiful Conservatory and then had a walk through the Primate Building (amazing gorillas) and the African Hoofed Stock Building. This is a wonderful place to visit and it is FREE!  Please remember to drop a donation at the entrance.",
  "Oh my goodness we loved it! Wanted something to do other than shop the mall of America for a day. The zoo was awesome, you could get close to the animals. Very friendly staff. We went in Oct so it wasn’t busy. The best part was FREE parking and donation for admission! The amusement park wasn’t opened but we were not interested in that part anyway. The conservatory was also very beautiful. I would definitely go again. There very few downsides to this trip! ",
  "We found ourselves enjoying our time at the Zoo and Conservatory.  We were mesmerized by the gorillas and was fun to see the newly born giraffe.  The zoo isn’t huge- so you don’t feed pressured to keep moving to see all the exhibits.  Same goes for the Conservatory- not too big that you actually feel free to sit on one of the benches and just soak in the tranquility.  The volunteer was great in chatting about the sloth- shared lots of info about it.  Will definitely come back when we are in the area again."
 ]
},{
 "name": "Mears Park",
 "address": "Sibley Street Between 5th and 6th Streets",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/78/8e/ba/jazz-fest.jpg",
 "tags": [
  "walk",
  "music",
  "walk",
  "walking",
  "parks",
  "walk",
  "music",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d561671-Reviews-Mears_Park-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Mears Park is never crowded, is usually just a walk through for most people, but it's such a great park. The winter lights are awesome. The water features are super fun for everyone in families in the summer.",
  "It is a wonderful place to  rest, chat, meander with the dog, read in the shade.   Walk  over to the farmers market  and load up on beautiful produce, coffee, hommus, crafts, and breads - then sit for ten minutes or two hours in the Park enjoying the shade and music piped lightly from the little stage.   It is lovely and truly captures the loveliness and friendliness of LowerTown, St Paul.   There is even a tiny stream, rocks, and  a little bridge.  A good place for all ages.   I could always find parking on Saturdays or you can park across Kellogg at the train station and walk over to the Park.   it is fun!",
  "Small park in downtown St. Paul, but very nice.  The wife works right next to it so I've found myself walking through it many times.  It's not going to blow you away, and there's bigger parks in the city, but its nice to walk through or sit and hang out.  I have seen a few homeless people hanging around if that worries you, but honestly they're harmless and nice.  Its also right next to several restaurants and eateries, so grabbing lunch/coffee and going outside to the park (as long as it isn't snowing!) can be fun",
  "Lovely, lovely park surrounded by tall buildings. This was music in the park (two different bands played) on a beautiful evening. It was well attended buy all age groups. Many families with babies in attendance. Their are food trucks available which I chose to use. I did see some families bringing a picnic type meal will them. You are allowed to bring food but not alcohol. Alcohol is available for purchase, I believe beer and wine. There are park benches but not for that many people. You would want to bring a lawn chair or blanket. I am not certain who has pulled this event together but I couldn't help but think how fortunate for everyone in the area and also someone is doing a great job. Just plain fun and relaxing!!",
  "Park was well setup for event. I have never been before and I look forward to returning during a normal day."
 ]
},{
 "name": "Keg and Case Market",
 "address": "928 W 7th St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/df/e8/ee/bird-s-eye-view-of-the.jpg",
 "tags": [
  "food",
  "food",
  "eat",
  "eat",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d15368096-Reviews-Keg_and_Case_Market-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This has something for everyone! From an upscale experience at In Bloom, to comfort food (delux grilled cheese or barbecue) spicy Jamaican food, to sating your sweet tooth together with shopping for mushrooms, honey and other local products this place has something for everyone. I’ll come back!",
  "Spent a couple hours on a Saturday afternoon eating jerk chicken, drinking Switchel, and nibbling on a fresh whipped cotton candy. What a fun atmosphere and so much more to see, we’ll all be back!",
  "Very cute market! Lots of good food options and eco friendly shops! \nWe tried Sweet Science and it was incredible! Got the ice cream flight because there were too many yummy flavors. Very nice and helpful staff as well!",
  "good place to go with friends to hang out and have a beer and something to eat. fun, renovated building. ",
  "Tried out Revival Smoked Meats - Smoked Whitefish (almost like a tuna salad mixture), Kalbi ribs, smoked brisket, smoked pork shoulder, BLT and the reuben sandwich (both sandwiches were big and okay - nothing special).  The whitefish was nothing special but the brisket was really good and the pork shoulder was good.  The Kalbi was kind of disappointing.  Note - VERY EXPENSIVE.\n\nOthers tried out Pimento Jamaican Kitchen.  The slow roasted jerk pork was really flavorful and tasty.  Pricing was on the higher end also.\n\nAlso tried out the Sweet Science ice cream.  This was pretty good.  I tried out the dark chocolate sorbet which was really good.  My b-i-l tried out the blackberry sorbet which he enjoyed.  My sisters shared one of the specials which they really enjoyed - don't recall which one it was but these are time limited ones for availability.\n\nNote - you need to pay for parking or park on the streets.  There is plenty of seating in the food court.  Most places you purchase the food then find food court seating.  Nice thing is everyone can sort pick what they want to eat."
 ]
},{
 "name": "Park Square Theatre",
 "address": "20 7th Pl W Historic Hamm Building",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/5a/e8/78/stage-set.jpg",
 "tags": [
  "theatre",
  "theatre",
  "drink",
  "food",
  "performance",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d183820-Reviews-Park_Square_Theatre-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "We went to see Baskerville - a Sherlock Holmes spoof comedy. There were 5 actors playing 30+ parts and they did a superb job. As Brits we were really impressed by the accents which were impeccable! The comedy was presented brilliantly with panache and perfect timing. A small theatre well worth a visit.",
  "Back when I was a senior in High School, our drama department took a trip to the Park Square Theatre to watch \"The Color Purple\" as well as attend an acting workshop. I couldn't have been more impressed with the instruction, location, or performances done. Everything was on-par for a great time.",
  "I went to see \"Calendar Girls\" on opening night and it was spectacular!  There was an opening ceremony to recognize all the hard work that Mary does as Education Director for Park Square plus directing plays. Afterwards there was a reception in the lobby which was well attended. The actors came out later to converse with audience members in attendance. Great Fun!\n",
  "Came here to see Triple Espresso...\nLove this show! Have seen it multiple times, in three different venues and it is great every time.\nIt's a rare type of comedy that's clean and appeals to all ages.\nHIGHLY RECOMMENDED",
  "We always enjoy Park Square.  The theater upstairs is nice; the one downstairs is much more intimate for smaller productions.  The shows are almost always high quality with good acting.  Good options nearby for dining.  Expensive drink prices in the lobby.",
  "I went with a group of girlfriends to a play in the basement theater. Very intimate theater so you do feel like you are part of the show. Our seats were very far off to the side, so we did miss a very tiny amount of the show when the actors were flush with the curtain, but most of the show was out in front so we could see. Ticket prices were quite reasonable as well. We ate at Afrodeli across from the theater beforehand. Great and inexpensive food with awesome staff. Highly recommend!",
  "I just saw this play with a friend and we laughed through the two hours! It closes in two weeks so you must call your friends to make plans for an evening of laughter. ",
  "I have attended productions at Park Square off and on over the years. Most have been quite good. The main stage is not too large; so it makes for a mostly intimate theater experience. (The black box stage downstairs is even more intimate.) Other local theater companies also use this as their performance venue. No real bad seats in the house, though center is still best.\n\nThe prices are a little expensive, but there are sometimes deals to be had.\n\nConcessions available before the performances and during intermission. There are also several restaurants within walking distance to visit before/after a performance.\n\nReservations recommended, though if you come before a show, there may be tickets. (But better to just call ahead or purchase online.)\n\nParking: Paid parking on the street or nearby ramp or nearby lots.\n\nAccessibility: Yes. Although it is in an older building, so its been retro-fitted to some degree, so it may not always be as convenient as with a more modern building.\n\nIf you are interesting in theater, definitely worth a trip if there is a show here that looks interesting."
 ]
},{
 "name": "Hidden Falls Regional Park",
 "address": "1313 Hidden Falls Dr.",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/e3/da/3c/hidden-falls.jpg",
 "tags": [
  "walking",
  "walk",
  "hike",
  "family",
  "parks",
  "walk",
  "hike",
  "walking",
  "walk",
  "walking",
  "nature",
  "hike",
  "walking",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d10686869-Reviews-Hidden_Falls_Regional_Park-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Found it no problem. Instead of parking in the north parking lot, Go to the next little parking area north of the north parking lot. Then head towards the north parking lot. After about 1 to 2 min walk you will see a little side trail.  It's a staircase path down to the falls. You can hear the falls from the main walking trail if you park in that little parking area.",
  "My family has been coming to this park for years to hike, ski and picnic. Most recently my wife and I had a day off and we went here to take a stroll along the Mississippi River. Due to its location this park is not as noisy as other urban parks so you can enjoy a quiet stroll, bike or even a picnic along the shore.\nThere or numerous picnic tables as well as a number of picnic shelters. The park has two different entrances with associated parking lots but you can easily walk from one area to the other.\nPlenty of space to spread out and not be on top of other guests.",
  "My husband and I walked from a parking lot along Mississippi River Boulevard down to the falls and picnic area. What a scenic park! The stone detail is beautiful on the way down to the falls. The other reviews I read made it seem like it was going to be hard to find the falls. That wasn't our experience at all. I've posted a picture of the sign showing that you're walking towards the falls from Mississippi River Boulevard. I will say - people are right that there's pretty much no signage in the park. We came to the park hoping to hike some of the 6.7 miles of trails that we had read about. I'm assuming some were underwater, but I'd never know what was a park trail and what was just a scenic sidewalk along grass and trees. Be dressed for uneven steps, unpaved paths, and potentially mud.",
  "Bring your lunch and enjoy this oasis in the middle of the city.   Well cared for trails and great tables and sitting spaces along the Mississippi River. ",
  "Park in the lot closest to the north entrance of the park. Walk north past the building with the rest rooms. You'll see a path. It's a short easy walk (few hundred yards) to the falls. The falls are NOT a part of the Mississippi River so don't look along the river bank. :)\nAnother entrance. Follow Mississippi River blvd farther north of the park entrances. There's a smal parking area just off of the blvd with a statue from Egypt. Park. Walk east, which would be Mississippi River Blvd before it turns south, there's a path with a waterfall sign on your right. Walk down the steps. You're there!",
  "Fun park right along the river. \nWalking trails lead you through the woods from the falls to the river. The area near the falls was landscaped beautifully generations ago and while not meticulously maintained, holds a natural charm. There's also boat access to the river from here. Some picnic facilities that could be a bit better maintained, but overall a way to get into nature right in the city.",
  "My husband and I walked from a parking lot along Mississippi River Boulevard down to the falls and picnic area. What a scenic park! The stone detail is beautiful on the way down to the falls. The other reviews I read made it seem like it was going to be hard to find the falls. That wasn't our experience at all. I've posted a picture of the sign showing that you're walking towards the falls from Mississippi River Boulevard. I will say - people are right that there's pretty much no signage in the park. We came to the park hoping to hike some of the 6.7 miles of trails that we had read about. I'm assuming some were underwater, but I'd never know what was a park trail and what was just a scenic sidewalk along grass and trees. Be dressed for uneven steps, unpaved paths, and potentially mud.",
  "Found it no problem. Instead of parking in the north parking lot, Go to the next little parking area north of the north parking lot. Then head towards the north parking lot. After about 1 to 2 min walk you will see a little side trail.  It's a staircase path down to the falls. You can hear the falls from the main walking trail if you park in that little parking area."
 ]
},{
 "name": "History Theater",
 "address": "30 10th St E",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/0e/cb/78/glensheen127-largejpg.jpg",
 "tags": [
  "theatre",
  "history",
  "history",
  "kids",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d3717782-Reviews-History_Theater-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "Here to see the Highwaymen. Make sure that you allow enough time to find parking. There is a light rail station right outside so that would be a good option.",
  "We had been looking forward to the play \"Sisters of Peace\" for quite some time and we were not disappointed my the play and the acting. The theater is reminiscent of the old Guthrie Theater and it's thrust stage. \nBut that's where the similarity ends. The row spacing is much to narrow making it uncomfortable for average height people. If you have a seat location in the middle of a row get there early because it's virtually impossible to get to those seats once the rest of the row is full. \nMy wife and I agreed that there were very interesting plays on the schedule but neither of us are willing to endure the discomfort again. \nThe was also the smell of a restroom within the theater when you first walked in.",
  "We have had season tickets to the History Theatre for many years. The season ticket process is very flexible. You don't have to reserve seats weeks ahead and if you skip one play, you can use that play's punch to take a friend to another play. The theatre is relatively small and we rarely have trouble getting a \"good\" seat. (Although occasionally the seat is one that needs to be replaced.) \nMany of the plays are new works, written for the History Theatre. Almost all of the plays have a Minnesota connection to the story. The most recent is \"God Girl\". The playwright (a woman) went to an Ivy League seminary in the mid-70's - a time when women were just beginning to go to seminary. She does an excellent job of recounting the discrimination that occurred for women seminary students. I thought the play was well written and the cast did an excellent job of portraying the characters. It was a thought provoking play!",
  "Every play or musical I have seen at the Minnesota History Theater has been great.  Several shows my teenage kids could have attended.  Glensheen and Superman becomes Lois Lane were terrific.  Small theater, every seat has a great view.  Great opportunities to enjoy for both hearing impaired and visually impaired.  They were willing to work with us to bring a large group with different needs.  So good!",
  "We hadn’t been to the History Theater in years, but thoroughly enjoyed our recent visit for the Glensheen musical.  Now we are determined to make plans to come back more frequently.",
  "Really enjoyed the Glensheen musical.  It was very well done and entertaining. The History Theater is a very nice facility.  We hadn’t been before but it was easy to find in downtown St. Paul and there was lots of ramp parking within less than a block.",
  "I went to see a play called Glensheen Murders the Musical and it was fantastic.  The theater was spectacular. Great seats and great sound. Please attend this theater when you can.  You’ll be glad you did",
  "We had been looking forward to the play \"Sisters of Peace\" for quite some time and we were not disappointed my the play and the acting. The theater is reminiscent of the old Guthrie Theater and it's thrust stage. \nBut that's where the similarity ends. The row spacing is much to narrow making it uncomfortable for average height people. If you have a seat location in the middle of a row get there early because it's virtually impossible to get to those seats once the rest of the row is full. \nMy wife and I agreed that there were very interesting plays on the schedule but neither of us are willing to endure the discomfort again. \nThe was also the smell of a restroom within the theater when you first walked in."
 ]
},{
 "name": "Bell Museum",
 "address": "2088 Larpenteur Ave W",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/b3/bd/10/the-experience-continues.jpg",
 "tags": [
  "art",
  "history",
  "free",
  "free",
  "food",
  "history",
  "kids",
  "history",
  "active",
  "cheap",
  "family",
  "history",
  "food",
  "active",
  "cheap",
  "family",
  "history",
  "food",
  "free",
  "active",
  "cheap",
  "family",
  "history",
  "food",
  "history",
  "kids",
  "art",
  "historic",
  "history",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g43501-d15009064-Reviews-Bell_Museum-Saint_Paul_Minnesota.html",
 "source": "TripAdvisor",
 "reviews": [
  "This new museum building has dazzling natural history displays and a state of the art planetarium. The dioramas are newly restored to reveal fascinating details. There are also free standing models which invite closer inspection. The young boys in our group were especially enchanted with the woolly mammoth and his Ice Age friends while the somewhat subtler displays captured the attention of the older girls. Is was a great way to spend the afternoon.",
  "This museum is a wonderful place to spend a few hours, or more if you want to dive into the interactive exhibits and the planetarium. I think they did a very good job making the story of the earth’s origins interesting and I thought the old dioramas have been wonderfully restored. The building and the natural light make this a beautiful space. I would like to go back in the summer when I can be on the outside deck.\nBe aware that this not the Como Zoo where you get in for free: they charge for the entrance, the planetarium and the parking. But, we thought the costs were comparable to museums we’ve toured around the world and we very much enjoyed the visit. Also, some of the exhibits on the earth’s origin will not interest very young children.",
  "The new Bell Natural History museum opened in mid July, 2018;  I visited in mid-\nAugust.  The building and surrounding landscaping is lovely and sits at the corner of Larpenteur and Cleveland ave's where a one room school house once stood.  This museum replaces a smaller one on the Minneapolis campus of the University of Minnesota: there the subdued lighting, quiet, and stunning dioramas of Minnesota wildlife offered a quiet respite from the busy atmosphere outside.  The new museum has preserved whose dioramas and placed each in a larger context of both visual and written information.  Some reviews have noted that there is \"too much\" text for kids to absorb, but I think that depends on how you approach a museum visit.  There is plenty to see and touch without doing much reading.  The museum also has special activities for kids.  \nTwo things that could be improved:  The planetarium show was disappointing, while the planetarium itself looks like a first rate facility.  The film at the beginning of the program was an interesting and visually well done geological history of Minnesota going as far back at the formation of the solar system.  The astronomy presentation that followed, however,  was rather mediocre compared to the Smithsonian or Hayden planetarium productions.  Food services are also lacking, with only a meager assortment available from a refrigerated cooler display and an assortment of packaged snacks.  The coffee was good and the second floor terrace a pleasant spot to enjoy it with a view over the lovely landscape.  Finally, the staff and volunteers were friendly and eager to provide needed information.  I have a feeling that this museum will age well and the two detractions of the planetarium and food services will improve.",
  "The natural history panoramas were interesting. The earth development timeline was unique-a superb presentation of a complex subject. It is not appropriate for small children but should be mandatory for young adults (and their parents!). ",
  "For many years thousands of items from Minnesota' natural history were housed in a rather dingy building on the University of Minnesota campus.  All that has changed with a beautiful new building just north of the UofM campus in St. Paul.  There are many \"hands on\", active learning exhibits.  The architecture is terrific. \n \nMy only concern is the cost. It is NOT cheap.  Youth (ages 3-21) are $9.00.  Adult admission is $12.  Senior admission (65+) is $10.  You can buy a family membership but that is not cheap.\n\nThe museum says it offers \"explore passes\" for \"qualifying guests\" and families.  Such families are described on the museum website as follows: \"enrolled in one or more of the following: TANF, MFIP, SNAP, General Assistance, Medical Assistance, MinnesotaCare, WIC, Supplemental Security Income, Social Security Disability Benefits, Food Stamps, Section 8, or Free/Reduced Price School Meals. Present any appropriate documents related to the above programs at the Lobby Desk.\"",
  "For many years thousands of items from Minnesota' natural history were housed in a rather dingy building on the University of Minnesota campus.  All that has changed with a beautiful new building just north of the UofM campus in St. Paul.  There are many \"hands on\", active learning exhibits.  The architecture is terrific. \n \nMy only concern is the cost. It is NOT cheap.  Youth (ages 3-21) are $9.00.  Adult admission is $12.  Senior admission (65+) is $10.  You can buy a family membership but that is not cheap.\n\nThe museum says it offers \"explore passes\" for \"qualifying guests\" and families.  Such families are described on the museum website as follows: \"enrolled in one or more of the following: TANF, MFIP, SNAP, General Assistance, Medical Assistance, MinnesotaCare, WIC, Supplemental Security Income, Social Security Disability Benefits, Food Stamps, Section 8, or Free/Reduced Price School Meals. Present any appropriate documents related to the above programs at the Lobby Desk.\"",
  "This museum was nice but we feel it was way overpriced ( $12 plus $5 parking).  We were disappointed the Omni was closed.   Upstairs dioramas were very nice.",
  "This was our second visit. In the past year they have changed over a lot of their exhibits, keeping things fresh and worth a revisit. Both times their special main exhibit has been very engaging and interesting. Maybe geared to the 10 and up crowd. There are exhibits for all ages though - some highlights are the hands-on area, dioramas, and the space section. There is also a planetarium if you have enough time to catch the show. \n\nThere is a small parking lot, that we have found typically overfilled and free parking across the street. It is a rather busy street but there is typically a shuttle bus to help herd little legs across. \n\nWe never made it to the old building but the new building is nice and modern with great sight lines, probably even better in the summer when you can enjoy the landscaping.",
  "For many years thousands of items from Minnesota' natural history were housed in a rather dingy building on the University of Minnesota campus.  All that has changed with a beautiful new building just north of the UofM campus in St. Paul.  There are many \"hands on\", active learning exhibits.  The architecture is terrific. \n \nMy only concern is the cost. It is NOT cheap.  Youth (ages 3-21) are $9.00.  Adult admission is $12.  Senior admission (65+) is $10.  You can buy a family membership but that is not cheap.\n\nThe museum says it offers \"explore passes\" for \"qualifying guests\" and families.  Such families are described on the museum website as follows: \"enrolled in one or more of the following: TANF, MFIP, SNAP, General Assistance, Medical Assistance, MinnesotaCare, WIC, Supplemental Security Income, Social Security Disability Benefits, Food Stamps, Section 8, or Free/Reduced Price School Meals. Present any appropriate documents related to the above programs at the Lobby Desk.\"",
  "The new museum is very nice but not a lot to do, especially if used to larger natural history museums.  We were there with our 12 and 18 yr old sons.  The planetarium show was the highlight.  The room where you can explore samples was also great (on the first floor through the kids play area).  It is probably a 1-2 hr visit without the planetarium.",
  "Decided to finally check this place out on a snowy afternoon.  Opened in July 2018, it features a state of the art planetarium as well as the more traditional natural history museum. Its a blend of space science and natural history. The building is beautiful and airy and everything you'd expect in a modern museum.  Its a great blend of the historic (1940's era dioramas brought to life in clever new ways) and modern (search for life in the solar system).  There are hand's on items to explore and a few cringe worthy critters in the Explore Lab like cockroaches, snakes and tarantulas.  We spent around 3 hours including attending a show.\n\nBut the centerpiece of the building - and literally in the center - is the planetarium with seating for maybe a hundred.  While we had no trouble buying tickets on site, we were visiting on a slow weekday.  There were several different \"shows\" throughout the day.  We went to the 1:30 show centered around space exploration in which the audience votes on where to explore (Mars vs Saturn) and how best to get there.  It's geared to inquisitive school groups and does a good job of illustrating some of the science behind these types of adventures.  IT lasted about an hour.\n\nWe also enjoyed the special \"wicked plants\" exhibit highlighting the toxic nature of ordinary plants-fascinating and creepy.\n\nI was really impressed with this museum and would definitely bring out of town guests of any age for a visit in the future."
 ]
}]
