[
 {
  "name": "Fenway Park",
  "address": "4 Yawkey Way",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/06/f7/4f/view-from-the-club.jpg",
  "tags": [
   "unique",
   "walk",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Fenway Park is one of the oldest baseball parks in the USA. The green monster was fantastic. Being there in person really make you appreciate the size and hright of the wall.",
   "Fenway Park is a great place to enjoy the tradition of baseball. It has an unique atmosphere and is rich of baseball memories. ",
   "I went for The Who concert. The view was great, the sound was fantastic!! Easy to get in and out of the traffic. Loved it. ",
   "I love the fact that Fenway is located in Downtown Boston - an easy walk from anywhere in the City. Fenway is more than a ballpark, it is a destination. With the opening of TimeOut in the neighborhood, you can now eat at a 5 Start restaurant before or after the game! ",
   "We had a great tour of Fenway Park with our tour guide, John. He had been to over 400 games there as a lifelong resident of nearby Newton. So, not only did we get to see all around the building, but we learned stuff about the players, the history of the site, the history of baseball and the history of the Red Sox. We got to see the club house, the press box, the general seats, as well as up on the Green Monster! The tour took about 1.5 hours and it was very impressive. While we have been there to games in the past, we hadn't taken the tour. It was well worth the price!  It was March and so much work was being done to get the place in shape for the season to begin.  There sure is a lot that goes into each and every game but if you're a history/baseball fan, you will love all the displays that really give a ton of information!"
  ]
 },
 {
  "name": "Freedom Trail",
  "address": "139 Tremont St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/e7/9a/ed/photo0jpg.jpg",
  "tags": [
   "history",
   "food",
   "walk",
   "history",
   "walk",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This trail has more than just history! It has the present, buildings and food! Do yourself a favor and make this trek! Totally worth it!",
   "WellWorth doing the trail \nWe actually walked  was interesting if finding the red brick trail as it was missing in places \nGreat history lots to see a long walk but plenty of eating places and bars on route \nWell worth doing",
   "Path of strong historical content with beautiful architecture full of relevant details!\n\nCaminho de forte conteudo historico com bela arquitetura cheio de detalhes relevantes !",
   "The Freedom Trail takes you to the historical parts of Boston and Charlestown,  It is a great walk and takes you to important places that played a significant role during the American Revolution like the site of the Boston Massacre, Old North Church and Bunker Hill.  You can easily make a day of it.  If you're in Boston just for the day, I recommend just doing that.",
   "We enjoyed walking the FT! It allows you to hear about the history while seeing the city. We veered off a few times but then got back on track! "
  ]
 },
 {
  "name": "Museum of Fine Arts",
  "address": "465 Huntington Ave Avenue of the Arts",
  "avg_visitor_review": "5.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/7d/01/6e/photo3jpg.jpg",
  "tags": [
   "family",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This beautiful art museum is an absolute must-see in Boston, with a breathtaking variety of wonderful exhibits.  There was also a temporary exhibit on mindfulness and one on how art withstands the tests of time, and the Bouchra Khalili exhibit especially was outstanding.  This museum also offers studio classes, as well as films, music, and performance art.  The staff are friendly and helpful, and the museum is well-organized so you can't get lost accidentally.  The building itself is a work of art.",
   "I had an appointment in the Morse Study room to see some works on paper. The staff was very accommodating! I love this museum. It's easy to navigate, the collection is outstanding, and the placards are informative. My one disappointment is the cafe - it's so high priced you can't afford to bring your family. ",
   "Rivals the Met in terms of its size and breadth of art history.  Lovely building and excited to see the renovations to the Asian wing when they're complete",
   "The MFA always has wonderful exhibits, community events, and of course stunning permanent exhibits as well. I became a member and go several times a year. Well worth it!",
   "Arrive right as the Museum opens and take in as much as you can before the crowds arrive. The collections are amazing and you could spend a day in each collection.  One of the best places to visit in Boston."
  ]
 },
 {
  "name": "Boston Tea Party Ships & Museum",
  "address": "306 Congress St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/9b/54/d7/sailing-ship-at-berth.jpg",
  "tags": [
   "experience",
   "interactive",
   "educational",
   "history",
   "experience",
   "kids",
   "experience",
   "history",
   "unique",
   "experience",
   "interactive",
   "energy"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Fun experience time went very quick interactive event \nEspecially as we where the only people from the uk\nGood to throw the tea over board and join in the fun\nHistorical and educational \nA must do when visiting boston",
   "I have read a lot about the significance of Boston tea party museum in history book / articles. To my surprise the museum does not offer too much detail on how the events of the tea party war really unturned. ",
   "Being brits we were drawn in by the mention of tea! ... this was a great fun experience and very suitable for kids, the staff/ performers were brilliant and knowledgeable, a very interesting experience and highly recommended ",
   "I went with someone who isn't interested in history, but we both loved the whole experience, from the staff in period costumes to the unique museum experience. It may seem expensive but I believe it was definitely worth the cost we payed. ",
   "This museum is an interactive experience where you are given a role as a son or daughter of liberty. The guides do a great job of staying in character and playing off the group’s energy. Overall a fun experience and nothing quite like chucking a box of “tea” into the harbor. The museum is a mix of movies and artifacts that are deftly woven into the act. Lastly, you can get yourself a cup of tea in the tea shop. "
  ]
 },
 {
  "name": "North End",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/1b/f6/ff/north-end.jpg",
  "tags": [
   "history",
   "unique",
   "food",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Boston is one of those cities that is easy to traverse; great for walkers with tons to see & do.  Just like many larger cities, it has various neighborhoods with unique characteristics (Little Italy, China Town, etc.).  Shops, cafes and restaurants everywhere.  Add the history aspect and you can't go wrong.   ",
   "Wandered through en route to North station. Lovely quirky area with loads of restaurants and coffee shops. Fantastic vibe.",
   "Had no idea when we booked our hotel that we'd be in the North End. What a treat!!  Awesome food!  Nice people!  Fun things to do!  Highly recommend the North End. ",
   "I'm very glad I walked almost every street!! The streets are charming, and there are so many surprises along the way. There is shopping, Italian restaurants everywhere, bakeries, etc etc etc.\nI was walking the streets when I happened upon a tour, and I realized that the Freedom Trail is marked and I started walking it... and the next day I started it again, and I finished where I had started.\nIf you're in Boston, it's worth the time to get lost here.",
   "This area looks almost European with narrow streets and alleyways.  It has charm and is filled with history, interesting shopping and wonderful places to eat."
  ]
 },
 {
  "name": "Boston Public Garden",
  "address": "4 Charles St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/d8/78/ad/publiczny-ogrod-w-bostonie.jpg",
  "tags": [
   "wander",
   "tranquil",
   "tranquil",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I often run/jog/walk here when I visit Boston... always clean.. often busy... well kept gardens. Love the ducks !!",
   "Beautiful park for walking, running and enjoying nature in downtown Boston !!\n\nBelo parque para camimhar, correr  e para curtir a natureza no centro de Boston!! ",
   "Great to have a wander round to get away from the bustle of the city. Lovely and tranquil atmosphere",
   "Lovely small tranquil park. It has picturesque lake/pond, famous statues (e.g. one of George Washington or Make Way for Ducklings) and many friendly squirrels. Awesome place to walk through or to spend some time.",
   "A lovely area for a stroll, even when we visited in winter it was stunning. Make sure you see the Make Way for Ducklings statues - they usually have hats or clothing to match the season or sporting calendar!"
  ]
 },
 {
  "name": "John F. Kennedy Presidential Museum & Library",
  "address": "Columbia Point",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/a1/1b/f6/photo0jpg.jpg",
  "tags": [
   "family",
   "experience",
   "history",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I liked this Museum and Library.  There is lots of information about Kennedy's presidency and the Cuban Missile Crisis.  His presidency was before my time, so I learned a lot about him and his family.  This is a great museum. \n There isn't a lot about his assassination here, but for that, you will want to visit the 6th Floor Museum in Dallas, Texas. ",
   "All the details on JFK’s presidency, life and times was awesome. There’s a piece of the Berlin Wall.  Artifacts related to WW2 service, clothing, and the glamor.  The first thing that struck me was the floor to ceiling wall of glass the great view of Boston harbor and cape cod bay.",
   "I had wanted to visit for a long time and I'm so glad I did.  The experience was very moving.  I felt like we were brought back in time and were able to share in some of the experiences of the amazing president.  This is a must see piece of American history.",
   "I saw this in 2004, but this museum still sticks with me even though that was sixteen years ago.  If you have never read my reviews, I am not a museum person.  Very few attract my attention.  This would be one of them.  John F. Kennedy, whether you like him or hate him, was a fascinating person in our country's history.  This museum has artifacts from his younger life to his presidency.  There was a video that you watched before you went in to the see the exhibit.  It is on the outskirts of the city, but worth it.  ",
   "I was one of only 2 people in the Museum after it opened. There was an excellent film about the president's life. The lobby of the theater section had memorabilia and stories of the president from youth to president. Other than that there was a beautiful view of Boston Harbor, a gift shop and nothing else. I thought the library was something you could see . "
  ]
 },
 {
  "name": "Samuel Adams Brewery",
  "address": "30 Germania St Jamaica Plain",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/68/c9/2b/photo0jpg.jpg",
  "tags": [
   "history",
   "free",
   "history",
   "free",
   "experience",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Family was visiting from out of town, and we were looking for something fun to do on a cold winter afternoon.  We decided to take the Classic Tour at Sam Adams Brewery.  There is no charge, (although a donation is suggested - all money goes to support community endeavors).  Since it was. Friday, there were tours scheduled every half-hour.  We didn't have to wait, and walked right in.  The tour guide was well-informed, and kept things moving, and humorous.  The tour consisted of a brief history of Sam Adams beer, how it was made, and the research and development that kept it changing.  It ended with a tasting of three different beers (you get to keep the tasting glasses.). It is located near the Stony Brook T stop on the Orange line.  There is a very small parking lot, or else street parking.  This was a great tour, and kept us out of the wind for 1 hour!",
   "Are you in or near Boston? Do you have an hour or so to spare? Do you like beer? If the answers to these questions are “yes” then you need to get over to the Samuel Adams Brewery tour. \n\nThe free tour, while not extensive (most production brewing is done at other sites) -is fun and informative. We have done a number of brewery tours before at both large and small breweries - this was the best one by far. \n\nOur knowledgeable guide explained Samuel Adams Brewery’s history, brew process, and even let us taste some of the brew ingredients. But the highlight was a stop in the tap room where we all tried several different beers and got a quick lesson in the finer points of beer tasting. \n\nOverall a good time! ",
   "Great tour here, looking at how the beer is made and what is included, which was very informative. The tour is free, which is surprising as these are normally paid for. You get to sample 3 types of beer after and are told about them. The gift shop offers a wide variety of beer to but which I have done for returning to England. After went to the Tap Room and I would highly recommend it for a fun afternoon trying various beers.",
   "Things have changed noticeably since my last visit but the new plan is good. First of all, the tour and tasting is still really fun and the charitable support from our donations is commendable. The easy ride from downtown on the Orange Line of the T gets you right to the brewery. The short wait for a tour is in an interesting area. The guides are fun and informative. The beer education is interesting and the tasting room is a highlight of the experience. I have never ended a tour without buying something in the gift shop so I guess no one else should either. The new tap room provided a great opportunity to sample beers beyond those offered on the tour. This is a fun part of visiting Boston and I will do it again the next time I come. ",
   "A dull day with some rain encouraged us to visit the 'famous' Samuel Adams Brewery which was worthwhile. The guide explained the complete process of beer production. Our small group of 6 finished off with a commemorative small glass and then sampled 3 or 4 styles of beers produced on site with personal reviews and opinions of the tastings.\n\nThere is a gift shop selling everything SAM ADAMS. \n\nThe Orange line from DOWNTOWN takes you to Stony Brook and from there a 5 minute walk to the Brewery."
  ]
 },
 {
  "name": "Boston Public Library",
  "address": "700 Boylston St At Copley Sq.",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/9e/97/87/the-very-quiet-reading.jpg",
  "tags": [
   "walk",
   "historic",
   "free",
   "history",
   "delicious",
   "historic"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Magnificent library with superb architecture. To see and why not take the time to read a book. Close late i love",
   "I was told the library in Copley Square was beautiful but I was so impressed. Could have spent the entire day there.",
   "This is not just a historic site, it's an actual library. I love libraries, so I enjoyed walking around and seeing the architecture, but it was a very quick walk.\nIf you're in the area, it's worth >30 minutes to browse the building. If you want to stay and read, even better ;).",
   "A great place to see and it is free. Lots of Art and history. Many use as a rest stop when touring the city.",
   "I love libraries , and this is a beauty. Also a delicious afternoon tea and a fashion show. Well set out to enjoy the historic setting, whilst staying a thriving, busy public library."
  ]
 },
 {
  "name": "Museum of Science",
  "address": "1 Science Park",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/bb/58/02/experience-the-sights.jpg",
  "tags": [
   "kids",
   "family",
   "kids",
   "run",
   "kids",
   "learn"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Electricity theatre show, huma anotomy exhibits and the space show in the planetorium are the top most exhibits for me. Boston Science museum offers many exhibits that fall into interests of kids, teens and even adults. I enjoyed the electricty show a lot - having read about the strength of electricty when i was a kid but never experienced anything practically. The exhibit is must go for every one. \n\nYou may want to skip the 4d theatre, its not worth it. I have been to better 4d theater in the past and did not find this super interesting. But if you never visited one, you will be amazed. Good luck. \n\nStay safe and healthy",
   "We visit this museum multiple times a year and have a family membership. We particularly like to see the rotating exhibits over the years. The museum is very child friendly and there are many hands on activities like you would find at a children's museum. There is also a separate area, The Discovery Center, that basically functions like a small children's museum for the younger visitors. It's a great place to visit for a couple of hours but you could easily spend a full day here and still miss things. Don't miss the electricity show, the hatching baby chicks in the hall of human life, and the awesome gift shop!",
   "You could spend all day here and not see everything it has to offer.  The kids love the hands on challenges they run.  We were there for the dog exhibit - a BIG hit.  The day started and ended wiht a single catch phrase from the kids \"wow, look it!\"",
   "Visiting and seeing big dinosaurs, animals and earth. Visiting the small and big exhibition is great!! This is a place to be visited!",
   "The museum is divided by wings that 3 levels a piece. There is so much to see you need the entire time it’s open if you only have 1 day. It’s like 30.00 for adults and 24.00 for kids. Make sure you get a bracelet and try all the different personal quizzes. We enjoyed the live animal shows. The lighting show was pretty cool as well. Something for everyone when it comes to science. The lockers were pricy: $8.00 for one big enough to hold your back packs and jackets. There is restaurant on site. There were so many different ways to learn and explore. It’s a great field trip for kids. "
  ]
 },
 {
  "name": "Isabella Stewart Gardner Museum",
  "address": "25 Evans Way",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/2a/b6/dc/photo1jpg.jpg",
  "tags": [
   "experience",
   "unique",
   "learn"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Excellent museum with a solid permanent collection, interesting special exhibits, and an amazing building with a most beautiful central courtyard garden.\n\nGreat place to spend a couple of hours and a rather nice small cafeteria to grab a bite as well.\n\nSpecial events as well; just check their calendar.\n\nDefinitely worth a trip. ",
   "What a find. Isabella had to have been a force to be reckoned with. The museum/home is filled with treasures that give insight into the love of the arts. Her personality shines through this marvelous experience.",
   "This unique museum in the heart of the Fenway area in Boston is a must see.  It is home of a famous art heist that was never solved.  The empty frames in the museum represent the art works that were stolen.  The art work, garden, and atrium are beautiful.  The building itself is a work of art.  There is a vaired and wonderful colletcion and the volunteers are very helpful and wonderful.",
   "The documentary, \"Stolen\" by Rebecca Dreyfus told the story of Isabella Stewart Gardner and how she collected this fabulous art, and then there was the robbery in March 18, 1990. Since it's coming up on the 30 year anniversary I decided to visit this museum. Spectacular! So beautiful I took all three tours. Like visiting someone's private collection. Because it is.",
   "After long looking forward to visiting this museum I finally went on a Sunday. I left 20 minutes later disgusted. \n\nFirst of all it’s very poorly lit and you can’t see most of the art. There’s also no markers indicating anything about each item. So you can’t see them or learn anything about them?\n\nBut the worst part was there a ridiculous code policy. As you were walking in nothing indicates that coat check is mandatory or that they have any kind of a code policy. I left mine on and climb three flights of stairs. I got warm at the top so took my coat off and folded it on my arm. I was very rudely told by a staff person that they don’t allow this and that I either have to wear it or tied around my waist. When I explained to him that I was too hot to wear it and that the arms are not long enough to tie around my waist, he made a rude comment about my weight.\n\nWhile I find the code policy in general to be ridiculous, they should at least have signage at the coat check about this being mandatory. and at the very least they should not hire people who are so rude to paying guests."
  ]
 },
 {
  "name": "Boston Common",
  "address": "139 Tremont St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/1c/8a/46/boston-common.jpg",
  "tags": [
   "walk",
   "walk",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Lovely small park to walk through or to spend some time in. Starting (or finishing) point of historical Boston Freedom Trial. There are many cute friendly squirrels in the park.",
   "Although we visited in winter, Boston Common is still a wonderful place to saunter through and watch all the dogs enjoying chasing the many squirrels! A lovely place to take in the atmosphere of Boston and enjoy some peace and quiet for a while.",
   "Okay, so I enjoyed my time walking through this area. I walked through the Gardens to get here, but I preferred this park more. There is so much to see, including people watching.\nThere are a lot of locals, and there was something happening in almost every corner of the park. It's a nice place to kill an hour, and to stretch your legs. I spent almost a week in Boston, so I had plenty of time to see it all. \nIf you have limited time, it's worth a quick walk through, but you don't need to see every inch of the park.",
   "This is a nice, relaxing park that provides a great reprieve from all the surrounding buildings. It also has some amazing history tied to it, which is great for history buffs such as myself. There's nothing in particular that stands out and it's certainly not a must-visit location, though it's a nice place to just sit and people watch. \n(5/2018)",
   "Nice park. Squirrels were huge. Walked by a political rally one day and a road race for rare disease another day. Awesome. The make way for ducklings was great! "
  ]
 },
 {
  "name": "USS Constitution",
  "address": "Bldg. 5, Charlestown Navy Yard",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/a1/96/53/photo3jpg.jpg",
  "tags": [
   "walk",
   "history",
   "experience",
   "active",
   "experience",
   "history",
   "history",
   "interactive"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "A very easy visit to a working US Navy ship.  Security clearance is required - must have photo ID.  Enjoyable guided tour on the ship and a wonderful museum with tons of information!",
   "This is a piece of Floating History, accessible by the Freedom Trail and a must see on a history walk around Boston.  Gives a tall guy a sense of appreciation upon coming back above deck and being able to stand up again",
   "What an excellent experience visiting the USS Constitution... blew me away... my brother was British Navy and he would have loved this....I went here in memory  him, but I loved every second of it.",
   "An experience not to be missed when in Boston.  The Warship referred to as 'Oid Ironsides' is a copper plated wooden hull frigate still 'in service''. The crew of guides are all current Naval personnel and the tour was very informative by our guide who gave the history of the commissioning of a Naval Warship and was the first Naval ship which created the U.S. Navy as known today. Launched in 1797 the guide informed visitors she is seaworthy and is launched approximately 5 times a year to sail around the Charles River - technically she could be called to active service but would be highly \nunlikely !!!\n\nThe tour is also a bonus as it is Free...",
   "We loved visiting this incredible piece of history.  There were currently enlisted marines on duty to answer questions and describe parts of the ship and its stories.  The visitor center and museum are also very much worth going to with interactive exhibits and rich information. And displays of reL artifacts and stories.  The view of the harbor is incredible, and if you go near the time of closing, stick around for 15 more minutes to hear and see the crew close the night with taps, taking down the flags, and various other things including firing a gun as the lights from the sun darken and the city lights start to brighten.  For both of these experiences I would allow at least two hours if not three.  "
  ]
 },
 {
  "name": "Beacon Hill",
  "address": "Between Beacon St and Cambridge St Beacon Hill",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/5b/bf/a1/beacon-hill.jpg",
  "tags": [
   "walk",
   "experience",
   "history",
   "history",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This is one of the wealthiest and nicest parts of Boston.  It has gas lit streets and brick sidewalks.  I personally enjoyed walking around and appreciating the architecture.  I recommend visiting this neighborhood for a nice walk.",
   "Magical area rich with history, Beacon hill is that I Dilick American landscape with beautiful architecture people oriented streets great shops right markets a wonderful alarm all American experience.",
   "Fantastic location and stepped in history I took the tour to see all the sights within including the scared cod!!!\nBrilliant tour fun friendly and helpful staff based right on Boston common so great central location \nIf get the chance go to acorn street nearby for a picturesque cobbled street",
   "Such a charming neighborhood with lovely Little boutiques and cafes nestled in charming old buildings lining the brick paved streets. The architecture is beautiful and the perfect place to see in the autumn and the holidays.",
   "Great walk through some of the old streets.  State House tour is free--great docent.  Enjoyed the shops on Charles Street."
  ]
 },
 {
  "name": "USS Constitution Museum",
  "address": "Bldg 22 Charlestown Navy Yard Charlestown",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/4f/42/4f/uss-constitution-museum.jpg",
  "tags": [
   "walk",
   "history",
   "free",
   "learn",
   "walk",
   "kids",
   "learn"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Joshua and Justin gave us an excellent tour of the USS Constitution.  A+ to them both. \n\nA beautifully preserved piece of American history displayed at the Charlestown Navy Yard.  It’s a quick walk from West End and if you’re walking along the Freedom Trail you’ll come across it. \n\nThe tour lasted 20 min and you are free to roam around the 3 decks. You’ll learn a bit is history and see the sleeping quarters and canons all while imagining a crew of 400+ on board.  Proudly displayed and beautifully preserved, it’s a must stop when in Boston. ",
   "This was a great part of our trip, my husband would definitely have stayed longer but we didn't have much time in Boston.",
   "While we were in the area (Freedom Trail), we decided to check out the museum. I'm glad we did. It was quick and fun. The boat isn't very big, but it was interesting to walk around the boat and go below deck.",
   "Stopped here along our freedom trail visit.  One of the only stops that doesnt require payment.  They ask for donations.   Great info.  Nicely kept.  I have boys 10 and 8 years that loved it. ",
   "It is a very instructive museum and kids as well as adults will learn something from the visit. The personnel and the volunteers are extremely friendly helpful. I liked the display."
  ]
 },
 {
  "name": "Quincy Market",
  "address": "4 S Market St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/74/1f/86/quincy-market.jpg",
  "tags": [
   "experience",
   "walk",
   "history",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I don't really spend my time shopping on vacation; I'm more of a browser... and this is a great place to walk around. The Market has a lot of other sites around it, so it's a nice place to start or finish. \nIf you want to try local treats, come hungry. If you want to buy souvenirs, you can find them here. It's a one-stop experience if you're short on time.",
   "Good trip to Quincy Market, good selection of eateries and local Boston delicacies. My sister had chowder here which was fantastic. Out of season when we went, but still enjoyable and good way to try different foods.",
   "We almost skipped this because a market is a market is a market - right? I am really glad we did not. First, it is full of beautiful architecture and history - the cobblestones, the vaulted ceiling, the spiral staircases - it was a treat for the eyes. But it was also a treat for the tummy - there are so many options, we could have eaten here every day for a week and not tasted it all. And it was equally fun watching the hustle and bustle. There were performers in the areas around the market - even on a cold, blustery day. It was definitely a good investment of our time in Boston. I enjoyed it so much that I would return here on future visits. Lots to see, taste, and take in....",
   "I had a few hours to kill whilst waiting to check in for a flight.\nWhat a fabulous place, so many different smells and tastes that just tantalise the taste buds. \nThere is an array of shops that will please many (I hate shopping) and whilst I was there, there was a guy singing his heart out and really good and a couple of acrobatic guys entertaining (and jumping over) the crowd.\nA great place to spend a few hours",
   "There is always a vibe and a festive atmosphere at Quincy Market. It is always a pleasure to walk around and live the trub Bostonian life."
  ]
 },
 {
  "name": "Faneuil Hall Marketplace",
  "address": "1 Faneuil Hall Sq Quincy Market",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/55/38/98/faneuil-hall-marketplace.jpg",
  "tags": [
   "food",
   "walk",
   "history",
   "historic",
   "food",
   "history",
   "historic"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Spent about and hour walking outside and inside. Quite a variety of shops and food choices. Well worth a visit.",
   "The market place is part of Boston's history. Amazingly beautiful to walk and visit during a nice day. Food stands are great. Taste of Boston and Massachusetts in general.  Nearby are other significant places to visit. Boston is a walking City. From the first City Hall to the historic burial place, churches and others.",
   "This place has a lot to offer. QUINCY market offers a huge number of fast food choices that includes almost all the cuisines in the world. But not too many vegetarian options though. During Christmas time they usually have huge Christmas tree, live music. I highly recommend every visiting Boston to go here and feel relaxed. ",
   "Come one come all! You'll be glad you experienced the history of the area. The story of Paul Revere and the American Revolution. This is a historic building that has been maintained and yet serves today's needs. It is filled with vendors and foods for every palate. A definite must see on your tour of the Freedom Trail.",
   "I would definitely recommend stopping by here! I’ve not seen a place like it and there is loads to see and choose from. "
  ]
 },
 {
  "name": "Newbury Street",
  "address": "Back Bay",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/37/22/1b/photo3jpg.jpg",
  "tags": [
   "walk",
   "walk",
   "walk",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Spending time on Newbury Street is a great way to spend time while in Boston.  Beautiful New England brick stores, charming streets  and some great shopping.   So many places to choose from for a quick lunch, coffee or a glass of wine.",
   "Lots of good people watching and plenty of high end stores to shop. Beautiful street to walk. Overall a fun afternoon in the city",
   "This is a must see!\nThis street has it all. There is shopping, restaurants, a lot of people... and brownstones.\nYou get the Boston feel, and all the old brownstones, without having to walk residential streets. Now, this street is busy! There are a lot of people walking around, and you move in kind of a herd at times. It's worth the visit. There is something for everyone, and so much nearby too.",
   "This and Boylston Streets form a wonderful walk to shop and browse for anything you are seeking from clothes to art to lunch, it is here.",
   "Newbury Street is filled with great shops, restaurants that span many different styles, vibes and price points.   Great to walk and explore.   Streets off Newbury of course just as fun.    Find a parking gargage off St.James for good pricing/value."
  ]
 },
 {
  "name": "Back Bay",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/77/70/fa/by-leatherndevil-available.jpg",
  "tags": [
   "walk",
   "history",
   "cheap"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "There are quite a few popular neighborhoods in Boston, so it's hard to decide where to stay...\nIf you stay in Back Bay, you can find almost everything you need in walking distance (if you're a walker). You can even walk to the North End, or a quick Uber ride can get you there quickly.\nThere is sooooo much to see in Back Bay, and you if you're in town for a short trip, you don't need a rental car.",
   "There is so much to see and do in Back Bay. Tons of restaurants and Bars. Boutique shops are plentiful as well as well known big name stores. Everything is walking distance. Staying in this area will have you in a central location. ",
   "What can you say about a visit to Boston's Back Bay?  It is a great place for locally owner guest houses, restaurants and bars.  You can spend many days just in the portion of Boston.  Visit the Boston public library is a must.",
   "I stayed almost a week in Back Bay. Learnt to like its historical sites, restaurants, stores, public transportation and good hotels. It has good vibrations all around.",
   "Spent a day in Boston Back Bay, it is so full of history and so much to do!\nIts hard to fit everything in a day n one night. Definitely need at least a full weekend! \nThere is so much History everywhere you go it's hard not to get caught up in all of it. \nThe dinning is so accommodating for everyone from picky eater to vegans to foodies. You can always find something to do wether its the aquarium or visiting Paul Reveres home to shopping. Its also nice that everything is easy to get to in walking distance or a cheap Uber. \n"
  ]
 },
 {
  "name": "New England Aquarium",
  "address": "1 Central Wharf",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/31/a2/05/tropical-fish.jpg",
  "tags": [],
  "source": "TripAdvisor",
  "reviews": [
   "So fun! Nice day to relax and explore! We were bummed there were no sharks though but we Def recommend going. It is in a great location too! ",
   "Very large and informative aquarium. There are many different species: penguins, octopus, seals, seahorses, stingrays, sharks, giant turtle and many many others. The creatures look well-treated. There are many friendly people from staff ready to answer your questions. The aquarium is well organized. It’s popular and thus a little crowded, but somehow it didn’t seem a great issue. There are many small areas to rest and observe the sealife.",
   "We have been to the aquarium a half a dozen times and always find interesting things to see there.  Next time we go, we will avoid February school vacation week though!",
   "The aquarium is a great place to visit really clean and the fish look well looked after.\nTry to get there early as it does get very busy",
   "Imax was superb and it was so huge!!!! I enjoyed my time visiting here :) \nWill get to visit again one day"
  ]
 },
 {
  "name": "The Mapparium",
  "address": "200 Massachusetts Ave The Mary Baker Eddy Library",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/cd/c1/15/the-mapparium.jpg",
  "tags": [
   "educational",
   "unique"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Amazing visit great aspect of the world as it was and who owned what\nVery educational well worth the entry fee \nGreat guide would do it again lots to see and hear ",
   "We took this quick tour of the Mapparium. If you have time to fit it in your schedule, I highly recommend. It doesn't take long and is $6 per person. Unfortunately you can't take photos inside. It's pretty cool though once inside. It's really just like standing inside the middle of a globe. Pretty cool!",
   "This is a small attraction in Boston that you can enjoy during 15 minutes, there are some nice curiosities created during their constrution as the acoustic sounds.\nYou must visit this place!!",
   "It’s really cool and worth stopping by, but you’re not allowed to take pictures inside which really bugged me ",
   "Very interesting perspective on the World. The word unique id very much overused but this does't give you a view of the Globe three stories high from an unique vantage point. \nAlso it captures the countries at a point in time - May 1935 - and so some countries have been renamed. Good geography lesson."
  ]
 },
 {
  "name": "Boston Children's Museum",
  "address": "308 Congress St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/a5/b8/c5/boston-children-s-museum.jpg",
  "tags": [
   "family",
   "experience",
   "run",
   "kids",
   "kids",
   "kids"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "My family and I loved it here definitely recommend this place if you have children it has heaps of fun this for them to do you can join in on the fun too",
   "Although pricey, the Museum is wonderful and so much fun! The only negative experience was the scam at Farnsworth Garage, which the museum provides parking validation for. The cost is supposed to be $25 but the garage charged us $38 and the attendant there claimed our validation was no good. The attendant offered no solution for us and was extremely rude. We quickly let the Museum know of this issue and they were very attentive about it. I advise avoiding this parking garage but if you must park here and run into an issue make sure to let the Museum know. Here is the number for the manager at the garage, Duvante: 857-237-8756",
   "Spent the day at the Boston Children’s museum. There is a lot of hands exhibits for kids to interact with.\nWe went on a Monday holiday and the place was packed. Next time I would not go on a holiday.\nThey have a nice gift shop, but felt like it was geared for younger children.\nMake sure to see if your library offers museum passes, it will save you some money.",
   "Our 3.5 yo son loved it. Suitable probably even more for slightly older children. Quite expensive though given it’s basically a giant indoor (albeit fun) playground for kids. ",
   "So much to do  all sorts of room s for make believe  \nClimbing —dancing —barber shop —car repair —school room  \na snake ——\nAnd there are people complaining there isn’t much to do—-\nThose are the people who will not like heaven !!!!!!\nLittle kids playing with water 💧 \nEtc \nlook at the website look what is available\nAnd pick a few to visit \nIt s great. It is not the Taj Mahal or an arcade it is for young children \nLol😂🤣😄😃😀"
  ]
 },
 {
  "name": "Old North Church & Historic Site",
  "address": "193 Salem St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/8c/6e/7c/this-spire-is-a-most.jpg",
  "tags": [
   "experience",
   "history",
   "historic",
   "unique"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This was really an amazing experience.  I am very into history, so I found seeing where the lanterns were placed to warn the riders to warn the militia the regulars, not the British, were coming by sea.  This eventually led to the fighting at Lexington and Concord.  Paul Revere contributed, but there were other riders who deserve credit.  The church was also very nice and was on the Freedom Trail.",
   "The staff was very informative- beautiful old church. Lots of stories surrounding the church of you take the time to listen to the staff. Glad we stopped!",
   "This is a small historic place to visit during your stay in Boston to know more about the story and smell their peacefulness.",
   "This church is stunning and so historical, just wandered about taking in its beauty. Definitely worth a visit",
   "We loved the Behind the Scenes tour. The church is very unique. The staff members were friendly and helpful. My 10 year old son thought it was cool to see the crypt, bell ringing chamber and colonial chocolate demonstration."
  ]
 },
 {
  "name": "HarborWalk",
  "address": "Harborwalk",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/33/11/66/photo9jpg.jpg",
  "tags": [
   "peaceful",
   "walk",
   "pets",
   "jog",
   "walk",
   "walk",
   "history",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Easy walk along the river that anyone can do. Area Residents jog or walk their pets. Very peaceful and away from the hustle and bustle.",
   "The HarborWalk is not at all obvious as a pedestrian attraction, but it does indeed provide some of the best views of Boston as it winds its way around. \n\nThe full walk as listed on their map is far larger than most people will be interested in walking, but the best part is the section that starts on the eastern edge of the North End, works its way around Boston Harbor past Quincy Market and the New England Aquarium, goes right through the tour boats and nice restaurants around Rowe's Wharf, and finally crosses the Fort Point channel over to the Federal Courthouse where you will get the most amazing views of Boston.\n\nThe HarborWalk isn't really anything more than a wide, paved pedestrian walkway that follows the edge of Boston Harbor.  It doesn't have any specific shops or restaurants and in some places you will be walking through mainly residential areas.\n\nThe entire pathway is paved and clear enough for a child to ride a bicycle along the path as well.",
   "Followed the Freedom trail here and got the opportunity to to see plenty of historical museums and areas.  The USS Constitution is berthed here and several areas managed by the National Park Service.  Take the time to visit here, you won't regret it!",
   "We took the opportunity to walk a fair section of the Harbour Walk whilst staying in Boston and felt it gave us a good impression of both old and new Boston as well as some of the history.",
   "Our tour guide told us about the walk, and at the time, we were stunned by how long it is. We decided to try and see how long we could walk it for, and found that a couple of hours was enough for us. The view is spectacular, it's a nice, relaxing walk, and it's definitely worth a shot."
  ]
 },
 {
  "name": "Castle Island",
  "address": "2010 William J Day Blvd end of Carson Beach, on Pleasure Bay",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/7d/79/df/fort-independence-castle.jpg",
  "tags": [
   "walk",
   "food",
   "walk",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Don't forget to sight see this area, it is truly a gem!  Don't forget to take a drive up to the L St. Tavern for a pint, the scene from Good Will Hunting movie!",
   "This was the first time I had ever been to the ocean and it was definitely the place to go.  Calm water, serene atmosphere, beautiful castle. The weather was a little cold though, but still incredible!!!!!",
   "I am a water baby and decided to go for the day.  Imagine my surprise when I see two juvenile eagles.  I waited long enough to see at least one parent.  I'll definitely be back.",
   "We enjoyed walking in the area and watching the boats. There is a small restaurant you can walk to but it is only outdoor seating. Good food and reasonable prices.",
   "Wonderful view of the many islands in Boston Harbor. Great place to watch planes land at Logan Airport. The fort dates back to the original fort (1634) know as “The Castle.” A lot of history attached to this site - of course, it IS Boston! Great walk around the fort itself. Lots of activities - a small beach, sailing, picnicking, playground. Can also grab something to eat st Sullivan’s. Long lines on Sunday afternoon when we were there. Great spot! Worth a visit. "
  ]
 },
 {
  "name": "Skywalk Observatory",
  "address": "800 Boylston Street Prudential Center",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/dc/0e/41/vue-du-50e-etage.jpg",
  "tags": [
   "experience",
   "history",
   "educational",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "As far as I know, this is the highest publicly-accessible observation deck in Boston. It provides great views of the city. The are a lot of informative materials. The staff is friendly. The deck isn’t crowded. Even though the deck’s lights are dimmed after sunset, it’s not easy to take photos due to reflections, but it’s an issue for most of the observation decks, not just this one. If you have troubles taking photos, just watch, enjoy and remember :)",
   "Great views 360 degrees around the whole tower, lots of educational displays and short movies about history of boston, etc. It’s all indoor, which makes it nice year-round, but for me to give the 5th star it would need the addition of an outdoor section (even if it was a small one) to get the full raw experience of being up that high and fully soaking in the city view. Good activity for an hour or two, worth it.",
   "Loved our visit here, definitely worth the entrance fee. The staff were very friendly and helpful and the audio device you carry around explains both the history and views as you look out over the city and surrounding areas. We had a beautiful sunny morning when we visited so could really see for miles. My daughter asked if she could use her UK student card for discount and this was easily accepted. Lots of information on how Boston was built with immigrants from all over the world, and continues this tradition now. Very poignant in today's climate.",
   "Sadly the skywalk will soon be closed but the views up top were amazing and we received top notch service form the staff!",
   "I don’t think this would have been on our radar if it hadn’t been for the CityPass. I went about an hour before sunset on a weekday and it was quite quiet and so we got some good views. Simple concept. The included audio guide is essential to get any real value out of the visit. However I would have liked some more skyline pictures or staff to point out things to help pick out key buildings to have made this a five star. "
  ]
 },
 {
  "name": "Bunker Hill Monument",
  "address": "Monument Square Charlestown",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/26/2d/97/bunker-hill-monument.jpg",
  "tags": [
   "walk",
   "history",
   "free",
   "kids"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "It was a steep climb up the stairs going up.  In the end, however, it was worth it to get a view of the surrounding.  I also think it is a great tribute to those who fought for our independence (even though that wasn't the goal in 1775).  It was a bloody affair that ended in the Americans losing.  Even though they were victorious, the British felt that they had lost because of the high casualties they suffered.  A great place overall.",
   "Great monument on the site of very important battle. There are awesome views from the top,  but be aware there isn’t any elevator - you should climb the stairs. Very friendly rangers downstairs are ready to provide any information.",
   "This is worth visiting, especially if you've committed to part of the Freedom Trail. I loved walking the neighborhoods and having a summit at the end of the journey. It felt like a great conclusion. \nI would recommend visiting this place, even without the trail. It only takes a short time to walk around the monument and visit the museum across the street. It puts history in perspective when you can see these places. Plus, it's very pretty.",
   "This is a very nice monument. You can climb to the top for free. It is 294 steps to the top but well worth the view! The stairs are spiraling against the outside wall of the inside and well lit. ",
   "Climb was a lot of fun.  Did it with kids 5-12. Rangers were very knowledgeable and friendly. Great views of city"
  ]
 },
 {
  "name": "New England Holocaust Memorial",
  "address": "Between Congress and Union Streets",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/8a/b9/fd/20150521-125015-largejpg.jpg",
  "tags": [
   "free",
   "historic",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I think I walked by this memorial at least 3 times before I realized it was a memorial. At first, I thought it was a cool exhibit built into a small park. It's very pretty, modern, and interesting.\nIt's actually profound. I'm glad I pulled up things to see in the area, and I realized what it represented. I recommend walking through it.",
   "This is a must visit memorial in Boston, it was carefully designed and you can feel the pain for all the people suffered during this historic age.\nShould visit as this is also free.",
   "This is a very thought provoking and powerful memorial. Take time to read the words of the survivors, as some are truly touching. There is no entry fee and it’s just off Quincy Market so not far to walk.",
   "This made me cry, but I think everyone should visit here and Ly respect to all those souls who were robbed. Bless them all... go ... read... respect",
   "Came upon this by accident.We read through the inscriptions and were very moved, then we saw all the numbers etched on each panel relating to every person, how very very sad, yet a wonderful tribute."
  ]
 },
 {
  "name": "Arnold Arboretum",
  "address": "125 Arborway Jamaica Plain",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/14/93/3c/arnold-arboretum.jpg",
  "tags": [
   "experience",
   "walk",
   "walk",
   "experience"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "It is a very beautiful park especially for foliage. While it is nearby downtown you still can got chance to find parking slot on weekend. I pretty enjoyed walking around there.",
   "I have visited Arnold Arboretum in every season and it is always such a wonderful experience! There are various sections within the park that showcase trees from around the world:  evergreen trees, swampy area with rushes, magnolias, lilac hill that always blooms around Mother's Day, trees from Asia and cork trees from Portugal, linden trees and climbers, hill with birches and bonsai collection, maples and oaks, beech trees - one can explore and always be surprised by something new! The park is a part of Emerald Necklace and is a continuation of green belt around Jamaica Pond and Muddy River. There are several entrances to the park with limited parking, in season there are several portable restrooms and water fountains throughout the park. Dogs are welcome. Hunnewell Building hosts Visitors Center with some education displays and staff to answer questions, share maps etc. This is a trip not to be missed when in Boston.",
   "An amazing place to visit- such a beautifully tended garden. You can spend all day walking the paths and seeing flora from around the world. It is ike a trip to different climates and continents. Beautiful place for a walk, an picnic, a nap, a dog walk.",
   "It's an easy walk from Forest Hills T stop to reach one of the side entrances to the arboretum. There are plenty of walk to take, make sure to head to the visitor center to grab a map and plan your walk. It's a great contrast to the buzz of the city - worth it for a quiet afternoon.",
   "Great place, great trees, and great fun. That about sums up my experience. I had a blast. Everyone should visit. "
  ]
 },
 {
  "name": "Charles River Esplanade",
  "address": "Storrow Drive",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/f4/09/83/photo3jpg.jpg",
  "tags": [
   "calm",
   "walk",
   "run",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "A little way off the hustle and bustle of the city, Charles River Esplanade flatters the senses of the visitors by its beauty of greens, the sparkle of the river surface, the sound of the birds as well as the smell of the wind. I think this is one of the best spots if you'd like a moment to relax during a tour in Boston.",
   "i saw the river while driving through the city...quite a calm place with birds flying around...people jogging and boats in the river",
   "We visited in winter and although cold it was beautiful. well worth visiting. Lots of photo opportunities",
   "I visit Boston frequently, and every time I am there I run and/or walk on the Esplanade. The river is beautiful, and the path is always full of people especially when the weather is nice. In the summer, there are always lots boats on the river and crew teams rowing. A must do when in Boston!",
   "do the whole Charles River Basin- walk the Esplanade and see the joggers, roller blades, performers, Pops, go across any one of the bridges to the Cambridge side and walk back on the Memorial Drive Side, part the Museum of Science (with a stop at Cheesecake Factory?)."
  ]
 }
]