[
{
 "name": "St. Marks National Wildlife Refuge",
 "address": "1255 Lighthouse Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/1c/64/82/st-marks-national-wildlife.jpg",
 "tags": [
  "nature",
  "nature",
  "walk",
  "history",
  "walking",
  "kids",
  "learn",
  "walk",
  "hike",
  "nature",
  "pets",
  "drink"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d147130-Reviews-St_Marks_National_Wildlife_Refuge-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "St Marks has a little something for everyone -- buildings and exhibits, nature trails, fishing spots, even a lighthouse.  Be sure to stop by the gift shop when you go!",
  "This is a great place to visit and bring out of town guest! St. Marks is right on the Gulf of Mexico. Enjoy the nature, bird watching, turtles and alligators, Monarch butterflies return, fishing and relaxing.",
  "I love going to St. Marks, whether to catch fish in one of the many ponds; bird watch especially if the eagles are around; show visitors the alligators; walk on the many trails, or delight in the Monarch butterflies each fall before they head south. There’s always something to see. But, stop at the visitor center first not only to see the displays they offer, but to also find out what the rangers have seen that day. I’ve been to the top of the Lighthouse when it’s open and loved it. I’ve gone as a single woman and with friends and wholeheartedly recommend this delightful refuge.",
  "Beautiful and pristine park with plenty of trails, canals, and boat ramps. Nice for a casual drive as well. Plenty of wildlife can be seen right from your car (But please keep to the side so that other drivers can pass if they need to). This park is located South of Tallahassee in St Marks, FL. \n\nThis refuge has some wonderful photo opportunities with plenty of birds, alligators, gorgeous sunsets, and of course the lighthouse.  There are public bathrooms, grills/picnic areas, and a very good welcome center. The beach area is bay water - not good for swimming/sunbathing, but if you have a boat you can easily reach breath-taking crystal clear water. Wonderful area for scalloping when they're in season. (Make sure you have the correct permit for your outdoor activities.)\n\nSome precautions: Some of the trails have sand spurs so mind any four-legged friends or anyone else who isn't wearing shoes! And do be mindful of the wildlife - alligators hang out near the banks and fingers. \nIn areas where the water is low, the muddy banks can be fun but they can also swallow you up to your thighs. Oyster shells also make this a hazard for dogs and otherwise improperly shoe'd park goers. The sand gnats and mosquitoes can be troublesome to put it lightly, so bring repellent. \n\nThere's a small fee to enter, but it's well worth it. This is a fantastic example of the wild beauty that Florida has hidden.",
  "I recommend that you begin your visit by stopping at the visitor center. It has a small museum and gift shop. Bring a camera and binoculars. It's true, you can't go into the lighthouse, but you learn about it's history in the visitor center. Go slow on the road to the lighthouse and keep your eyes open for wildlife. We even saw a baby alligator cross the road! We saw six gators, one turtle, and a large variety of birds. After walking around a bit, the kids wanted to find a beach to play on. We found a small patch of sand off of one of the trails on the gulf shore. The water was clear and warm. We also found a beautiful sand bar that extended about 100 ft. from another trail into the gulf. There was no sand, just lots of cool shells. The kids ran around, collected shells, played with hermit crabs, and waded in about thigh deep. They didn't want to leave! Not too much shade here, so bring hats and sunscreen. Overall,  a great experience.",
  "The wildlife refuge is in a beautiful, marshy part of FL.  There are multiplestopping places on our way to the lighthouse.  While the map offers guideposts for stopping, there isn't necessarily great parking in some of those areas.\n\nThere had been a burn of some point, I assume controlled but when I spoke with the ranger at the office, I didn't know enough to ask about it and when we left the park, her office was closed.\n\nCost was $5.  It's basically honor system.  You put the money in an envelope, pull off the tab and place that on your dash.  I had 4 $1 and a $10 so gave the $10.  No one's getting rich off this but bring exact change if you don't want to pay up.\n\nThis appears to be birding paradise.  We did not have binoculars or any kind of serious zoom lens so while we really enjoyed the landscape and waterfowl, there was a lot that I'm sure we missed.  \n\nWe didn't explore much as far as trails go.  We did walk some trails near the lighthouse.  There were some people crabbing and fishing and that was interesting but mostly just more marshland and of course the coast line.\n\nListening to the birds was really neat.  They were singing like crazy and didn't seem the slightest bit bothered by the little bit of foot and car traffic.  They made some very distinct sounds.\n\nOur weather was near perfect, low 80's with a very nice breeze.  I imagine there are days where you might get torn up by mosquitoes and I'm sure it gets pretty warm later in the summer.\n\nWe really enjoyed it and I'm glad we took the time.  My review is really just to grant a little more insight into what you are getting but it's still worth a trip.",
  "Although the park was officially closed you could still hike and vist the beach and lighthouse area.",
  "St Marks has a little something for everyone -- buildings and exhibits, nature trails, fishing spots, even a lighthouse.  Be sure to stop by the gift shop when you go!",
  "There are lots of places to park along the side of the road where trails go off in different directions.  When you first enter, there is a large visitor center that has interesting info about the park and the lighthouse. It's a good place to get a sense of the park before wandering off on a trail.  If you continue on the road, it leads to the lighthouse.  They were giving tours inside when we were there.  You can't climb it however, you can only view the bottom level.  We saw lots of alligators on the shores of the marshes.  When we walked a trail, there was a large alligator at the shore, which spooked me a little.  My husband loved it!!  I was constantly turning around to make sure the alligator wasn't behind me LOL.  It is a birder's paradise and that seemed to be what most visitors were into while we were there.",
  "good trails, pet friendly, just do not let pets go for a swim in the water inland !! They can swim seaside, but not drink the salt water !! Its a great site seeing pass time.",
  "Go! Go! Go!  Birds, turtles, butterflies...and much more! Bike the trail down for an especially great day!"
 ]
},{
 "name": "Tallahassee Antique Car Museum",
 "address": "6800 Mahan Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/0b/d2/e1/tallahassee-antique-car.jpg",
 "tags": [
  "tour",
  "kids",
  "family",
  "history",
  "walk",
  "unique"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d142714-Reviews-Tallahassee_Antique_Car_Museum-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Oh my goodness!!!  I was not expecting what this museum had to see!!!  This is not just a car museum with close to 200+ cars all of which are classic!!! No, this also houses the hearse that carried Abraham Lincoln after he was assassinated, elaborate pianos, signed guitars from famous singers, and more.  Also the museum included the following collection and more: calculators, cash registers, golf clubs, baseballs, other sports memorabilia, pocket knives, motorcycles, Batman (including three batmobiles), Native American, fans, radios, knickknacks, pedal pushers, teddy bears, motor boats (probably close to 200), and more and more and more!!!   There is no way that you can go only once and see everything!!!!!!",
  "A prior review, had negative comments about 2 things.  I have posted pictures of the exact complaints for others to make their own decision on the items. Had a great 2 hour tour.  We could have spent hours more there, but you can get very overwhelmed at all the \"things\".  There are collections of many kinds; sewing machines, motorcycles, knives, dolls, guns, baseball cards, boat motors, bat man cars, typewriters, fans.....the list still goes on and on.  Devoe Moore, the owner of the exhibit has many things he likes to collect.  The collection is VERY extensive.  I've never seen so many cars in the condition that these were in.  He bought a car from a Ford grandson, made for the grandson.  He has a 2005ish Ford Mustang with stickers in the window and plastic on the seats, never driven.  An amazing place that I will stop by again to take more in.",
  "hugh collections of the unusual, i.e.. outboard motors, pocket knives, old cars, peddle cars, cash registers,etc",
  "Lots to see and wide variety of interest covered. Take the family since there is everything from cars to pianos. The kids will love the three batmobiles. ",
  "Full of Antique cars, toys, weapons and other interesting exhibits. Pretty cool to see the evolution from carriage to our present automobiles. They also have the \"Batman mobiles\"! Just be vigilant with your young children, they tend to want to touch items that clearly have a \"Do not touch\" sign. Quick tip: If you go on the FL vac. auction website, you can get 4 passes at a great price!",
  "Like others have said, a little pricey but worth it.  As a matter of fact, I was ready to walk when the lady at the admission desk told us the cost of tickets but my husband insisted we stay because he was so looking forward to seeing this museum on our vacation.  The lady did say that there were so many exhibits of so many different things (like grand pianos, cash registers, guns, knives, and more) that we should find it well worth it and we did.\n\nMy favorite car was the 1999 Plymouth Prowler.............wow - would I like to have one in my garage.  But seriously, all kinds of antique cars were presented.  They were in mint condition -  Also later model cars that were considered \"special\" like a corvette that supposedly was worth $3 million dollars were showcased.  This museum is on two floors and we could have stayed four hours but left in two and a half because we were on a schedule.   There's not a whole lot to do in Tallahasse and this made it special.  Also, we did travel through a number of areas in this capitol city and it seems to be well cared for and a very pleasant city to visit.  I think you will really enjoy this museum if you are especially interested in automotive  history.",
  "The best museum I have been through for cars! I was amazed by the quality of the cars, outboard motors, and pedal cars. You have to see it! I've been twice, and I want to go again!",
  "Incredible experience! To know it’s is one man’s PERSONAL collection, is mind-blowing! We spent 3 or so hours in there. You could spend so much longer! I was happy to pay the $17.50 per person to enter, I hope this place stays open forever!   LOVED it, and wish everyone I know could see the everything Mr. Moore has collected!  So much more than just cars too!! ",
  "Only reason for the 4 stars is that the lady at the front counter/desk wasn't very pleasant. There is some amazing cars to see! I can't wait to come back and bring some friends!",
  "Interesting old cars even if you are not an old car buff. Other interesting collections as well including dolls, pocket knives, typewriters, FSU memorabilia.",
  "I have been to several automotive museums and this is one of the best! Well lit, clean and so many unique items. Cars, knives, models, dolls, pianos, boats and a huge collection of antique boat motors. There are motorcycles, antique cash registers, typewriters, golf clubs, baseball memorabilia, cameras, antique brass fans, phones and so much more! You could spend hours here and not see everything! "
 ]
},{
 "name": "Florida State University",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/39/78/a9/fsu.jpg",
 "tags": [
  "walking",
  "tour",
  "organized",
  "walking",
  "tour",
  "family",
  "history",
  "field",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d1229605-Reviews-Florida_State_University-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "We took my son to visit the campus so that he could make his final decision.  The campus is beautiful, well-maintained and every student we asked for directions was friendly, helpful and extremely courteous.  The tour made ME want to go back to college.  Our guide, Kelsey, hit it out of the park-hard to believe she is a freshman!  As many other reviewers have commented, the campus is large and it is a walking tour so wear something comfortable.  The guides do a great job of breaking things up, providing water and opportunities to stop and sit in the shade.  My only suggestions would be that the Fine Arts section not be presented as an afterthought and that the students touring represent the diversity of the university a little better.  Overall though, we walked away impressed at everything that FSU has to offer.  My son has accepted and will be a 'Nole this year!",
  "About 3 years ago I was reviewing colleges with my then 17 year old daughter. She wanted to go somewhere warm and so we headed south. It was frustrating for me when trying to narrow down quality universities in the south that there were barely any reviews of FSU. This college was founded by Francis Epps the grandson of USA founding father Thomas Jefferson. After seeing a few other southern colleges together, once we saw FSU we both knew this was it!  First, it's old and classic in style and architecture, gorgeous, huge trees dripping with Spanish Moss and buildings are close together as was typical back then. My daughter doesn't drive so this was important to us. We saw the model dorm room during orientation, which was cute but it didn't matter to us because my daughter suffers from Psoriasis and needs a tub to soak in sometimes to calm her skin. The FSU dorms that have the bathtubs in them are reserved for upper class-men. We found an awesome apartment off campus but so close she walks everywhere! As time has gone on she loves it even more and says they keep adding and building and as beautiful as it is it becomes even more beautiful. Lately though she has complained of the necessity of needing a car now. Often the campus buses are filled to capacity and can't/don't stop to pick up any more students. Important to know is that Tallahassee has weather/seasons. While not as severe as the Northeast; it gets cold and winter clothing is a necessity sometimes. Probably worst than a dry cold winter day is the fact that when it rains in Tallahassee it POURS! For hours and hours. When those times come during school hours my daughter admits not making it to class.  She's an excellent conscientious student so I have no worries there. I would give this college 5 stars but between the campus bus situation and some of the ridiculous Liberal courses that are mandatory (of course who would bother being targeted to be indoctrinated to such crap if not mandatory), I can't. Though a lot of colleges are worse. She has decided to go on and do her masters here too. Of course we were surprised to see/learn that FSU has a circus school- no kidding. And when my husband attended a football game last season he said it was \"The Best\" sporting event he had ever attended. Being my husband is a sports nut and has gone to many, many, many events- this speaks volumes.  This college has the feel of being in-between an urban and suburban college. Tallahassee is Florida's State capital and very close to this campus. The citified part is reflected in the close proximity of the campus halls and dorms and sadly the undesirable closeness of homeless people/hobos that the students are exposed to once outside the campus boundaries. TIP: If you're going to visit, wear comfortable shoes. And if you're visiting in the Spring/Summer bring a water bottle- it does get hot when the sun shines.  I hope this review helps someone. Thanks for reading.",
  "My daughter and I attended a campus visit with my friend and her daughter who was accepted to FSU for the Fall 2016 semester.  The tour was very organized, informative and led by two current students.  I am from PA and don't know much about southern universities.  I was very impressed with both the beauty of the campus and the programs offered at FSU.  My family currently lives in Georgia and my daughter has always wanted to go to UGA and my son to PSU.  After the tour, my daughter has decided that she has a serious interest in FSU.  The campus is very clean and well maintained.  We met lots of friendly people and felt welcome during out tour.  It is a large campus of approximately 1,400 acres, but everything is located in one area.  If you schedule a tour, make sure you wear comfortable walking shoes because you will be walking fast and a distance of about 2 miles.",
  "The history of FSU goes back to the 1800s, imagine the variety of architectural styles you can see!  A big campus with greens, lawns, massive oak trees with Spanish moss draping down, Camellias, Azaleas . . . it would be a treat to go to school here!",
  "What a beautiful campus, filled with safety poles and great ambassadors to guide the experience. Lots of tips, and it’s in pristine condition! Truly a lovely day.",
  "Most beautiful campus! \nIf ever on campus in the fall Mon-Fri 4-6\nDon’t miss the Marching Chiefs practice on their own field. Goosebump time!",
  "Excellent university reputation for academics. Parking is an issue. Give yourself 1 extra hour to park and walk to your event. Narrow roads.",
  "My wife, a UConn grad, has adopted FSU as her favorite campus.  I'm a long ago grad and our son is a 2019 grad now working in Tallahassee.  Go see a play or a basketball game or visit  College Town south of campus."
 ]
},{
 "name": "Tallahassee Museum",
 "address": "3945 Museum Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/4a/7b/53/down-by-the-bear-exhibit.jpg",
 "tags": [
  "art",
  "kids",
  "nature",
  "daring",
  "history",
  "historic",
  "eat",
  "kids",
  "food",
  "nature",
  "historic",
  "family",
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d291201-Reviews-Tallahassee_Museum-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "There’s so much to see here: historical buildings and displays, art, animals-both wild and domesticated, and flora and fauna of north Florida. We spent a long morning exploring the grounds and seeing all the animals. We enjoyed meeting the owl and the farm animals and taking walks on the nature trails to see foxes, wolves and otters as well as some beautiful big cats. It was a great experience. It was just my husband and me on the trip but I could see my older children enjoying it as well and it would’ve been a wonderful adventure for younger kids and families. ",
  "Unpretentious looking place, but lots of things to see there.  Best to go on a fine day because it's mostly outdoors.  Some of the best are some dinosaur (and plesiosaur and Dimetrodon) models made from used car parts, and different mammals and birds in enclosures. You can see bald eagles, black bears, panthers (aka cougars, mountain lions, pumas), vultures, There was even a snake house (behind glass, because some were venomous). \n\nAs well as animals, you can see how people lived in the 19th century in the resin industry (which damaged the long-leaf pine population), as well as an old caboose, school house, church, blacksmith shop with a professional blacksmith demonstrating, and old houses.\n\nThe more daring visitors can try the tree-to-tree zipline, for a more birds'-eye view.",
  "There truly is something for everyone at Tallahassee Museum - history buffs, nature/animal lovers, thrill seekers and little people. The word \"museum\" is misleading, as this attraction is mostly outdoors and includes habitats of native wildlife (EX: Florida panther, bears, otters, eagles, etc.), an 1880's pioneer farmhouse, Bellevue Mansion and other historic structures, an in-air obstacle course + zip line and my personal favorite - Jim Gary's 20th Century dinosaurs (made of reclaimed auto parts) spread throughout the 52-acre property. On-site restaurant, playground and gift shop + events throughout the year. Tallahassee Museum is certainly worth visiting!",
  "My wife and I decided to take a mini vacation to Tallahassee during March...before the hot/rainy season began for the summer.  The Florida Museum was our favorite part of the trip.  It is a very popular place and there were plenty of people the day we were there.  The good news is it is an outside museum that has plenty of room to accommodate lots of folks.  Get there early on weekends to make sure you can find parking close to the entrance.  The museum is located just off of Capital Circle which loops around the city.\nThe museum is divided into two main areas.  My wife loves the old \"cracker\" village which includes a number of north Florida farm building dating to the late 1800s/early 1900s.  Different types of crops and animals typical of these early farms are seen throughout this area.  My favorite area of the museum includes a raised boardwalk that meanders through large areas of swamp/forest.  A variety of Florida wildlife can be seen here - black bears, deer, bobcat, wolf, fox, otter and the Florida Panther to name a few.\nNew to the park since my last visit is a series of zip lines that run all through the park property.  It seems to bring in a lot of folks and helps to keep the museum afloat financially.  Even though I didn't take part, it was still interesting to watch the folks zipping around the park overhead.\nExpect to take at least a few hours to leisurely stroll through this park and take in all the sites.  There is a gift shop, a place to get something to eat and clean bathrooms located near the entrance.  The entry fee helps keep this museum open and is well worth it.  In my opinion, a must see while in Tallahassee.",
  "My children have enjoyed several visits to this attraction.  I highly recommend it to younger children as an educational and fun activity.  It gets hot in the summer, so go early in the day.",
  "While my Don't Miss is the nature trail with native wildlife, the museum also has farm and plantation areas with historic buildings that offer the feeling of 19th century rural southern living. Kids love visiting the caboose, too! There's also a large playground with adjacent seating for a break or some lunch. You may bring your own food, or purchase from the on-site cafe. There are many special events throughout the year, so check the calendar before you visit--it might be the Swamp Stomp or Jazz & Blues Festival! We live in Tallahassee and visit three or four times a year, always discovering something new. Fun with kids, for a peaceful day alone, or with friends. Enjoy!",
  "My family and two-year old grandson have visited this place twice. Both times, we had a good experience.",
  "Most of the boardwalk had been repaired from Hurricane Michael; so we were able to photograph a number of the animals and birds that are there.  The plantation house was somewhat of a surprise--it was rather plain and we learned that was typical for many of them.  The other outbuildings--the church, the farm, along with its outbuildings--were a reminder of another era.",
  "It was 55 degrees and drizzling.  When we went in the lady suggested we hurry to see the wildlife before the rain. We ate at the cafe which was ok, not great. My disappointment was that when we went to visit the wild animals several of the exhibits were closed for repair and maintenance.  I wish the lady had told us. We still saw several animals and that was great. Next time I'll ask if all exhibits are open",
  "A good place to spend a couple of hours. The nature view is very nice from the boarwalk. Cultural information is very well too.\nI would not call this a museum but rather a zoo.",
  "Great local culture and ecology experience. Well worth the annual membership for locals. Also ropes course and Zipline is fun."
 ]
},{
 "name": "Alfred B. Maclay Gardens State Park",
 "address": "3540 Thomasville Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/5a/38/4b/alfred-b-maclay-gardens.jpg",
 "tags": [
  "walk",
  "walk",
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d257090-Reviews-Alfred_B_Maclay_Gardens_State_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "The gardens at Maclay State Park are top notch.  It's so peaceful to walk through and look at all the flowers, butterflies, and birds.  The gardens are only blooming for a few months, so make sure to double check before you visit.\n\nThere is no fee to visit the gardens, but you pay a fee to enter with your vehicle.",
  "Such a beautiful place to explore. I've been twice now in late winter/early spring and the flowers have been beautifully in bloom. Don't be afraid to walk off the paths, you can walk all over the grass and explore!",
  "Really enjoyed walking around the gardens and touring the house.  Everything is in bloom now, and it was all beautiful.  Every person that was working there, from the front gate on, was awesome!  We totally enjoyed spending the afternoon there.  Just a tip, there aren't a lot of benches, so take a blanket to sit on when you want to stop and enjoy the atmosphere.",
  "Maclay Gardens is a hot bed of native flowers and a prime location for small outdoor weddings, reunions, parties, receptions, or even a private phot session by your photographer. The grounds are beautiful year round. There is also a nice picnic and swimming areas for families.",
  "Beautiful camellias and majestic oaks abound in this old, established park!  A lovely brick path meanders next to a stunning lake and leads to the old homestead that is open January till April.  The reflecting pond is beautiful and is surrounded by grand, enormous camellia bushes.  The gated garden with the fountain  and sculptures is very picturesque reminiscent of a European garden.  In addition, there are many hiking trails in the park.  Very peaceful escape from hustle and bustle.",
  "A beautiful place for a wedding. Near the pond. Our event was three years ago but it would not let me put in the correct date. Employees were friendly. ",
  "Magnificent magnolia and oak trees. Super well-kept. Wished the home was open (but was glad that the bathroom was!). It was wonderful to walk around by ourselves in perfect weather. Will have to re-read Gloria Jahod's \"The Other Florida\" comments on this gem of a park. ",
  "We enjoyed a visit to the gardens even though not many blooms this time of the year. The weather was cool and clear. Crew teams practicing on the lake were a special treat. We hope to return in the spring."
 ]
},{
 "name": "Mission San Luis de Apalachee",
 "address": "2100 W Tennessee St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/32/e0/b2/grosser-versammlungsraum.jpg",
 "tags": [
  "history",
  "historic",
  "tour",
  "history",
  "learn",
  "free",
  "walk",
  "history",
  "learn",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d126922-Reviews-Mission_San_Luis_de_Apalachee-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Mission San Luis de Apalachee was a Spanish Franciscan mission built in 1633.  There is a nice air conditioned museum that is handicap accessible.  Outdoors, you will find historic buildings with docents in period dress who are happy to share the history of the time period with you. While dogs are welcome on the property, it might be hard for someone to get around in a wheelchair. Florida can be quite hot, so I would strongly suggest going on a cooler day.  As we were leaving, the staff was setting up chairs for an outdoor wedding on a patio.  What a lovely backdrop the trees will make.",
  "Mission San Luis was a vibrant community of Spanish and native Americans who lived in the Tallahassee area prior to the invasion of the English and their Creek allies in 1704.  They successfully destroyed the mission system throughout Florida.  The local Indians here fled towards Mobile and finally settled in Louisiana. A recreated village was constructed on this site  that shows the interaction between the Spanish  and local Apalachee Indians.  You will be able to visit the Council House, the governor's house, the fort, blacksmith shop, the church, etc.  On some days the blacksmith will give demonstrations; cooks will share their culinary skills; \"soldiers\" at the fort will be re-enactors; a \"priest\" will give a tour of the rectory or church.  Volunteers don period costumes.  Don't forget to visit the gift shop and the Museum.",
  "I had driven past the gates to this site untold times visiting my children over the past 8 years at FSU.  Finally, on a day with a few free hours we drove up to see what it was all about.  What we discovered was awesomeness.\n\nThe museum is a living history monument to an incredibly interesting period of American History, where the Apalachee and Spanish lived together in the early 1700's.  There are numerous recreated period buildings and the intricate details are impressive.\n\nThere are also actors roaming the property and working/living on the grounds, and they all had great information to share.  We loved our time with the blacksmith and found his work to be quite interesting.  He was creating nails, just as they did in the 1700's.  (And the nails are used on the property).  We met soldiers in the fort and young ladies sewing in one of the homes.  Quite cool.\n\nIf you like history, you will love this site and learn a lot.  Even if you are not a history buff, the walk around the spacious grounds is quite nice, and a great escape from the hustle and bustle of Tallahassee.  \n\nI would suggest skipping the intro film in the theater.  Nothing there that you won't see elsewhere...\n\nMy only regret is that we waited so long for our first visit, but we will be back!",
  "Great place to learn and understand Apalachee Native American history.  The archaeology is well conceived and presented to lay people as well as more deeply available to trained or avid students of archaeology.  The living history events are especially interesting.  Place for everyone.",
  "The location of the mission restoration and the museum are both beautiful.  The \"in costume\" guides were very well informed.  Nice stop.\n\nAlso, the mission is pet friendly.  We didn't know this so we left the dogs in the car.",
  "The docents were good in presenting what life may have been like back in the 1600s.  The artifacts helped to have a better understanding of how two different worlds lived side by side.",
  "We're members and visit the mission regularly. Special events are lots of fun. Fascinating story of blending Spanish and native Apalachee culture and living together. Great reconstruction of key buildings and living history reinactors add depth and accessibility to the storytelling. Great outting for a half day ",
  "Very interesting place to visit. Specially for visitors driving through Tallahassee and decide to stop on beautiful Sunday morning and relax learning a part of history of our country. It appears well run place. This weekend was Native American Festival on property what make our visit more enjoyable. Also, we learned today that Apalachee are not recognized by Federal Government what made us sad."
 ]
},{
 "name": "Museum of Florida History",
 "address": "500 S Bronough St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/2a/e2/06/beautiful-place.jpg",
 "tags": [
  "history",
  "kids",
  "knowledgeable",
  "tour",
  "walking",
  "free",
  "history",
  "history",
  "free",
  "history",
  "history",
  "free",
  "art",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d126925-Reviews-Museum_of_Florida_History-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "This museum combines the history of Florida from prehistoric times to the present. It draws you in with realistic dioramas, pictures, and interactive displays.  Some of the displays are permanent (though they are updated regularly) while others change to accentuate new findings or current issues. Because they can draw on an extensive photo archive, you will find something new every time you visit.  Kids really like the museum since they can dress up and play in some of the exhibits. If you are not a kid on the outside, you'll still find pieces to peak your curiosity and interest. The museum squeezes a lot of Florida history in a small floor plan and is well worth a visit.",
  "Free parking (there are signs posted claiming parking is $5 but parking is free) \n\nFree admission ($5 donation requested at the end of the museum tour)\n\nFriendly, welcoming, professional, knowledgeable volunteers \n\nGift shop \n\nElevators for anyone with disabilities \n\nMild walking \n\nRestrooms available \n\nWater fountain available \n\nQuite atmosphere \n\nExpect to spend 20 minutes to and hour at this museum \n\nBeautiful, well kept displays ",
  "Having major with a Political Science degree with a History minor, I recommend the Museum of Florida History, to ALL Southern folks and alike, it gives you a different and refreshing history of Florida. The State of \nFlorida, is not only Fun in the Sun but it had, has and will have major roles in shaping the political future of the Southern US, and the world.  ",
  "I love museums, and have traveled to many states and Europe to visit them. Overall, I would compare the Florida museum as their equal, and it's free.\n The quality of the dioramas was exceptional, with vivid colors, extremely life-like figures, and inventive staging. The range of artifacts throughout the building was astounding\n The pre-history and history of Florida is fascinating, and it was well represented here. A bonus was an exhibition of Florida landscapes with a good selection of works by the Florida Highwaymen.",
  "I took my 11-yr old grandson on a teacher planning day. Although I've been to the museum several times after visits to the professionals upstairs, taking a bright and inquisitive child was fun. I was glad to see him actively inquisitive about the exhibits on Florida's history, and the contributions of African Americans both as slaves and as freedmen. The steamboat climb through was fun for me too. We took pics of him in the modern florida exbibit with his head in the jaws of the alligator.",
  "Perhaps one of the best state museums I have ever been to and it is FREE!  The displays and dioramas were first rate.  A child interested in history will really enjoy the many buttons to push and hear recorded historical info (instead of having to read everything!).  The temporary display was a variety of Florida landscape paintings and that was outstanding!",
  "I drove 3 hours just to see this place.... and it was better than I had expected!.   As an example, most places add a small display about the pre-European inhabitants ... this museum had several ROOMS, with great detail about life and culture.   I learned a lot here -- did not know that Florida belonged to the French for a while.... Great museum.",
  "I would have to rank the Museum of Florida History in the upper tier of state museums.  It has a great timeline and with a great mix of detailed stories and artifacts.  One thing that set the museum apart was an excellent exhibit of Florida Landscape Painters - a true regional art form.  We spent the better part of an afternoon."
 ]
},{
 "name": "Cascades Park",
 "address": "1001 S Gadsden St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/ff/dd/09/cascades-park.jpg",
 "tags": [
  "kids",
  "family",
  "music",
  "historic",
  "history",
  "walking",
  "theatre",
  "walking",
  "kids",
  "walk",
  "walking",
  "kids",
  "walking",
  "family",
  "kids",
  "free",
  "walk",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d6664567-Reviews-Cascades_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Cascades Park is a great place for family events. Grampa and Gramma took our grandsons to see the movie \"Finding Dory.\" There were lots of kids there and and lots of ways for kids to use up some of their energy before sitting for the movie. We brought our own popcorn and snacks and everyone had a good time. Attending a special event like \"Finding Dory\" is a worthwhile and inexpensive way to spend time with family. Get to special events early because parking close to the outdoor theater could be a problem.",
  "I love this park and enjoy it at least 2 to 3 times a week, fitness walking. The open plan of the park, the ample parking and the wide walkways make it perfect for walking, running and dog walking just about any time of the day or night.  The park is very well lighted so I always feel safe there even early in the morning or after dark in the evening.  There is good handicapped parking and a person in a wheelchair can go all around the park easily.  There are some steps but there are alternate ramps as well.\n\nThere is also a very well done Korean War Veterans memorial and lots of markers explaining the history of the park and of Tallahassee.  In the center of the park is the prime meridian for land surveys in the entire state of Tallahassee.  Historic and fun, now that's a park!\n\nGreat place for families with super playground areas, water attractions that children love and a good sized theatre area for shows and music.  A local restaurant and a great coffee shop round out the equation along with clean and safe public bathrooms.  This park is a gem!",
  "Cascade Park is a great place to walk or walk the dog. Early mornings are lovely especially when the waterfowl are in the lakes and streams. The paths wind around so you can do the full park or just a portion. In addition to the walking paths there's lots of benches and a playground for the kids. Weekends and evenings you can enjoy the light show and outdoor concerts.",
  "A beautiful, passive park for walking, jogging, or just hanging out. Small playground and water fountains for the kids to play in. Shows at the amphitheater are great, and The Edison offers a nice restaurant, bar, and coffee shop option on site. Looking forward to the adjacent hotel construction getting wrapped up soon.",
  "This park combined history--Smokey Hollow--gardens, Vietnam Memorial, children's playground, outdoor auditorium, and a retention pond with a fountain and did it well.",
  "Great place for family adventures. Big lawn to lay on and look at the fountain and a fun place to go walking. We ate brunch at the Edison and walked afterward. Highly recommend!",
  "Cascades Park is in downtown Tallahassee and is a wonderful space to take a walk at lunch or any other time. There is a waterfall and water features with fountains where the kids can play. There is also an amphitheater where concerts are held on a regular basis, The Edison restaurant and the Power Plant, a snack/sandwich shop with ice cream. This is an urban park where people of all backgrounds can be seen enjoying the outdoor space. It's just fun! Free parking is available.",
  "Great place to walk and/or ride a scooter day or night.  It was quite safe and quiet and enjoyed all the different amenities that it did have in its surroundings. For a peaceful, relaxing walk, this is the place to be in Tallahassee!"
 ]
},{
 "name": "St. Marks Lighthouse",
 "address": "1255 Lighthouse Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/5b/57/33/st-marks-lighthouse.jpg",
 "tags": [
  "history",
  "history",
  "learn",
  "historic",
  "parks",
  "nature",
  "historic",
  "family",
  "walking",
  "parks",
  "family",
  "nature",
  "history",
  "walking",
  "free",
  "family",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d143782-Reviews-St_Marks_Lighthouse-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "A great bit of history in a scenic location.   Great for photography..! There is a lot of history to see in this area, take your time to explore it all.",
  "My wife and I stopped here this April.  This is a very interesting attraction as well as Historic.  The lighthouse is a wonderful addition to the National Wildlife Refuge.  You can learn about maritime history and get to see the great multitudes of wildlife that inhabit the coast.  We thoroughly enjoyed our walks on some of the many trails near the sea as we took in some salt air.  The lighthouse was under renovation during our visit but we still had a great visit.  This is a nice place to enjoy the view and get some exercise.",
  "I have often visited the St Marks Refuge historic lighthouse at sunrise and sunset finding it the perfect place to gaze at the beauty of morning and evening while reflecting on a variety of subjects.  Mainly just the beauty of nature.  I have visited many states and national parks with yes many being more majestic than our little lighthouse.  But for a local treasure and simplicity it is prefect.  Go and discover for yourself.",
  "Well preserved lighthouse.  Open to the public from time to time, check the local paper.  Lived in by a well known keeper family with eight children up until the 1950's.  Surrounded by National Refuge.  Good wildlife watching and native plants.  Boat ramp and salt water fishing.",
  "I have visited this lighthouse three times now. I love the view of the bay and the fact that they have an observation deck overlooking the bay, refuge and lighthouse. The only thing to keep in mind is if you try to take photos of the lighthouse from the refuge path that there are alligators and other creepy-crawlies in the area. You can easily get wrapped up in taking photos of the tower and not watching where you are walking. Fortunately there is a nice observation deck overlooking the bay, refuge and lighthouse. Parking is limited at the lighthouse, so if you have a RV or larger vehicle, you may not be able to park during peak times.",
  "If you like nature, wildlife and/or lighthouses then this is for you! Rain or shine this is  a fun excursion. Military-don’t forget your yearly free pass for national parks. If you don’t have one yet see the ladies at the welcome center, show your ID and they will assist you in getting one. They even give you your $5 back if you paid the entrance fee. We gave it back since all donations go directly back into the refuge. The ranger and volunteers at the center are loaded a wealth  of knowledge regarding history of the reserve and lighthouse. If the Ranger is there ask her about the battle of Natural Bridge. Get a map of the area. Ask the ladies to mark the eagles nest. It’s a sight! There are tons of walking paths, picnic areas along with a few boat  launches. Beware of the gators and wildlife! The St. Marks Lighthouse was under renovation so we were not able to go in and with the rain we only got limited photos of it. A highlight for us was actually seeing several gators, the eagle nest and fledgling! An unexpected surprise given the rain. We will be returning when we come back on vacation again. The St. Marks Light is also on display in the welcome center. Given it’s history the condition of the lens is amazing and a sight to see. Enjoy, spend time with the family, disconnect for a little bit and enjoy the history and nature of a longtime landmark. ",
  "The lighthouse is a great stop, but the drive and the surrounding natural beauty is worth just as much. It is unspoiled Florida at its best. And if you haven't already, read the book Annihilation before you go. Knowing that the lighthouse and surrounding scenery was the basis for the story will give your visit an entirely different feel!",
  "We were fortunate to have the grandson of the last lighthouse keeper as our guide.  Once he realized that we enjoyed listening to actual accounts, he told us some wonderful stories about the family.",
  "I was very excited when we looked at photos pf this place, unfortunately it was nothing like that when we arrived. So be prepared to take binoculars and a long long lens otherwise there is nothing to see.",
  "Enjoyed both the visitor center, and the actual lighthouse. Very scenic location ( 7+ miles ) beyond the Visitors Center, which is abut 3 miles off of US-98.",
  "Worth the drive from Tallahassee. Paths to hike, a lighthouse to see. The drive down is beautiful. Wildlife if you are lucky as well."
 ]
},{
 "name": "Florida Historic Capitol Museum",
 "address": "400 S Monroe St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/e5/8e/33/florida-historic-capitol.jpg",
 "tags": [
  "history",
  "history",
  "walking",
  "history",
  "learn",
  "economical",
  "free",
  "history",
  "walking",
  "kids",
  "eat",
  "history",
  "free",
  "history",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d2312332-Reviews-Florida_Historic_Capitol_Museum-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "At the information desk the docent will give you an excellent overview of the creation of the original capitol building, it’s replacement and restoration. \n\nNext you should see the video that traces the socio-cultural history of Florida. \n\nThere are two floors to explore where the Supreme court originally was, the Governor’s office with original furniture, and upstairs where the Senate and House met. Lots of well described exhibits, a beautiful staircase and a magnificent recreation of the dome’s stained glass window. (Be sure the docent tells you the saga of how the panel was able to be tesytored!)",
  "Restored to its 1902 grandeur with stained glass dome and candy-striped awnings, the \"Old Capital\", houses exhibits  Florida’s political history.The former House and Senate Chambers, Supreme Court and Governor’s suite were all well preserved to reflect the era of Florida's early history.\nI most enjoyed walking from room to room learning about the Seminole War to Post Civil War Life & politics up to the infamous \"hanging chad\" incident of 2000 Presidential election.",
  "This is a must do if you are a Florida resident and will love it even if you are from another state. The restoration is beautiful and the building is very kid friendly. They even have a treasure hunt for the children to complete while touring the building. In the Supreme Court room there is a judicial robe and gavel for children to put on and ‘pretend’ to be a judge! The Senate chamber and House of Representatives chambers are open and fun. \n\nThis building is on the same courtyard with the current 22 story capital building so a visit there is also a must! The 22nd floor is all glass and is for visitors viewing. Then go down and view the Senate and House of Representatives chambers and see the legislature in action. You are bound to have fun in these two buildings!!",
  "Road Trip!  The old Florida State Capitol building has been restored and is now a museum of Florida history. Take the time to visit each room to learn about Florida history over many years. The original and restored furniture is beautiful. Don’t forget to look up to see the fantastic stained glass dome. Free admission and metered street parking make this an economical outing.  The docents are very nice and full of additional knowledge about the building and Florida history.",
  "Head for the visitor center  at the Old Capitol Building and meet the docents who will send your child on a hunt around the museum for various displays within the  exhibits. The kids won't know it but along the way they will absorb a little history. You will see the original Florida Senate and House of Representatives and after the kids finish their trek and turn in their worksheet they will receive stickers for their efforts. Next you can head to the new Capitol building, walking distance away.  Don't forget to visit the top floor of the high rise Capitol for a panoramic view of the City and FSU campus. If you're hungry  grab a bite to eat at the Capitol Cafeteria.",
  "Had some time to kill and stopped by the capitol.  The museum is free and is self guided.  There are rooms dedicated to aspects of Florida's political history, and you can see the old Senate and Delegate chambers.  I would suggest taking 1 hour to do it justice.",
  "Three floors of history about Florida, its legislature and laws, and the state house will satisfy any history buff. The students loved the scavenger hunt also.",
  "The building has the old legislative and supreme court chambers, along with many rooms with historical display, and a video. \nThe building was restored to the way it looked in the early 1900s.\nThe staff were very friendly and helpful.",
  "We only had 45 minutes to see everything so some of the exhibits were shortchanged.  It was set up to give a good grounding of the founding of the state of Florida and Tallahassee. ",
  "At the information desk the docent will give you an excellent overview of the creation of the original capitol building, it’s replacement and restoration. \n\nNext you should see the video that traces the socio-cultural history of Florida. \n\nThere are two floors to explore where the Supreme court originally was, the Governor’s office with original furniture, and upstairs where the Senate and House met. Lots of well described exhibits, a beautiful staircase and a magnificent recreation of the dome’s stained glass window. (Be sure the docent tells you the saga of how the panel was able to be tesytored!)"
 ]
},{
 "name": "Goodwood Museum and Gardens",
 "address": "1600 Miccosukee Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/ee/0b/7d/goodwood-museum-front.jpg",
 "tags": [
  "tour",
  "historic",
  "history",
  "tour",
  "family",
  "tour",
  "history",
  "tour",
  "tour",
  "tour",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d291203-Reviews-Goodwood_Museum_and_Gardens-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "I fell in love with this beautiful historic southern home.  With all of the amazing artifacts, the place came alive.  The tour guide was amazing.  This place is a true treasure.  Only regret was that I couldn’t move in and call it home.  💕",
  "So much of what you hope to share with family and friends about your home town and the people who first settled and lived here is included in the guided tour of the Goodwood Home and Museum.  Our tour guide was well informed, warm and wonderful.  Her special forte was her personal love of the home, furnishings and people who lived here, and her interesting \"tidbits of information\" --points of interest that actually transported her audience into the lives of the people who lived the history of this area's grand surviver of years gone by. A +",
  "Sue, the tour guide, was very engaging—she made the tour of the main house interesting and enjoyable. The grounds are beautiful and peaceful. Highly recommend.",
  "Goodwood's beautiful setting is worth a visit but don't miss the house tour.   Exceptional house is a time capsule rich with contents from past owners and lovingly preserved and interpreted.  Best guides I've ever encountered make the history come to life  with personal insights and creativity.   \n\nWe came back with friends for dinner at the Rev Cafe in one of the buildings on the Goodwood property.  Excellent menu with great seafood and southern fare, friendly staff and good atmosphere.  They're also open for lunch.  Check schedule for days and times.",
  "Our guides were Sue and Kerry and they did a remarkable job.... They showed a true love and admiration of the property. The house was magnificent and the grounds and outhouses are in a constant state of upgrading.  The grounds are all as  if they were  in the 1920's and are not manicured. The main house is maintained as it was in the 1920's also, as a result of a request from the owner that set the property up in a trust and that was her wish.... ",
  "The guide gave an excellent presentation as we went from one room to another.  It was easy to visualize how the families lived.  The dinner parties must have been grand!",
  "The tour was incredible taking you back in time. Amazing artifacts and home.  Best travel value ever. Staff and attraction well worth your time.",
  "I fell in love with this beautiful historic southern home.  With all of the amazing artifacts, the place came alive.  The tour guide was amazing.  This place is a true treasure.  Only regret was that I couldn’t move in and call it home.  💕"
 ]
},{
 "name": "Railroad Square Art District",
 "address": "618 McDonnell Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/46/01/aa/flippin-great-pinball.jpg",
 "tags": [
  "art",
  "art",
  "brewery",
  "free",
  "walk",
  "brewery",
  "unique",
  "music",
  "affordable",
  "art",
  "theatre",
  "brewery",
  "music",
  "creative",
  "food",
  "art",
  "art",
  "music",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d8871420-Reviews-Railroad_Square_Art_District-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "I love the shops and the murals here. This is a cultural center, for sure. This is the kind of place you could spend a whole afternoon at, admiring the art and browsing the local shops. Inside the large barn-like building there are some little shops where you can support local artisans and I really love having that kind of opportunity. I would highly recommend stopping by if you're visiting the city.",
  "This location is great for all ages. There is usually something happening here with it's local talents and diverse venues.",
  "Amazing.  That's what I have to say about this place.  There are shops, breweries, eclectic places to buy cool stuff, coffee shops, everything you could imagine.  Even if you don't want to buy something, it's a fun place to walk around and look at art.\n\nFirst, start out at Black Dog on the Square for a cup of coffee, muffin, or a pop.  It's super-friendly and adorable inside and wonderful to sit there and sip whatever you order (the outdoor seating is wonderful!).  Then, walk around to all the shops.  A lot of the shops weren't open because we were there on a weekday, but there was enough open to enjoy the stroll around the art park.  We ended up at Proof Brewery to relax after a busy day of looking at fun stuff.  (Review of Black Dog & Proof to follow.)\n\nIt was a beautiful day and this was a wonderful free thing to do.  We really enjoyed it.  I am posting a lot of photos so you can see all the shops and different places to see.\n\nAll around this area are bikes that you get an app for and can ride around.  The art park is very near the Cascades pathway, so that's another fun thing to do..",
  "Great way to get a taste for the local vibe and support small business owners. Near two college campuses, so it can be busy with students at times (there has been a popular local brewery there that just relocated, so that may not be the case as much anymore).",
  "IF you love cute artsy neighborhoods with used clothes, odd art, funky theatre, cold beer, and eclectic music... then you will LOVE everything about Railroad Square.  It is so unique, so fun, and so affordable !  Don't miss Railroad Square when you need something to see and browse through in Tallahassee.",
  "The best time to visit Railroad Square is the first Friday of every month when the galleries and shops are open late.\nYou can find some neat things.\nGo to Proof Brewery on the complex after shopping (before they move locations). Great beer & bands with an outdoor patio.",
  "... is definitely not the time to go. Most of the shops were closed, but the few that were open were enjoyable. If you like \"vintage\" shops, you'd have a heyday at a couple of the stores. \nI would definitely try to go for their monthly First Friday event when they have live music and all of the shops are open. ",
  "Great food.  Fresh ingredients.  Creative.  Wine base cocktails, and craft beers.  Service was good.  Lots of space indoor, and outdoor.  Fun place.",
  "One block in the middle of Tallahassee designated at the official art district of Tallahassee. Check out cool stores like Cosmic Cat Comics and pick up lunch at the Crum Box in the old caboose.",
  "First Fridays can't be beat - live music, people watching, art, thrift shopping, pinball - but don't underestimate a quiet morning when you have Black Dog all to yourself!  I really hope RRSq can endure the changes around it.",
  "I and two of my teenage daughters visited the first Friday event at Railroad Square. Many local artists and their wares were showcased there. Items in the various shops are reasonably priced and the free entertainment, plenty. Each shop had its own, special event. We had a great time. We will go back."
 ]
},{
 "name": "Dorothy B Oven Park",
 "address": "3205 Thomasville Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/8c/97/01/img-20171218-194131025.jpg",
 "tags": [
  "music",
  "nature",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d13195387-Reviews-Dorothy_B_Oven_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "A small and lovely park that use to be a camellia nursery.  Loads of blooming trees in the late Fall and winter.  Restrooms and nice waling areas.  Good parking.  A 2 person swing for relaxation. No entrance fees.  ",
  "I'm so glad my daughter had taken me here a couple times.  The gardens are so lovely and it is a lovely place to walk around and enjoy nature and all the lovely gardens and flowers.  They have so many flowers blooming so it is even very fragrant.  We had a extra special time when we went there at night also to enjoy their lovely Christmas light dispay and enjoyed all the lights , decorations and music.  If you are in this area, you should go here at the holiday times to see their lovely displays.  It is even FREE",
  "We visited this park recently for a Sunday afternoon stroll. We have driven by so many times and didn’t know this gem was hiding behind the trees. There are beautiful trails and gardens with boardwalks and bridge. There are old structures and fountains hidden throughout including an old water tower. They have Christmas lights and displays up as well. I highly recommend visiting Oven Park!",
  "Great venue for weddings, meetings or recitals. Fun Christmas place with lights galore. Beautiful trail that starts at the lower parking lot.",
  "Beautiful grounds for strolling around on beautiful day. Thousands of camillias. Go when they are blooming for a truly magnificant experience. The Christmas light display also worthy!"
 ]
},{
 "name": "Saint Marks Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/b3/25/f7/saint-marks-trail.jpg",
 "tags": [
  "family",
  "free",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d146247-Reviews-Saint_Marks_Trail-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Wide, beautiful, shady trail, with occasional benches to rest, and even handy bathrooms!  Very nice! Level, so easy for anyone.",
  "We love taking our bikes for a long ride on the trail.  It's mostly shaded, even on the sunny hot days of summer.  So nice not to have to deal with traffic and the restrooms are a definite plus on long ride of 18 miles.",
  "Excellent and safe area for a long casual bike ride.  Nice areas along the way, views and a park.  All paved and well maintained.  Riding from South of Tally all the way to the Gulf Coast.  Once there, find your way to the St. Mark Lighthouse Park.",
  "This trail is paved which made a more enjoyable ride for me.  Most bike riders were courteous.  There was an outhouse available of which I was glad for that.",
  "Wide, beautiful, shady trail, with occasional benches to rest, and even handy bathrooms!  Very nice! Level, so easy for anyone.",
  "If you find the right starting place (we didn't and rode for an hour before we found it) you'll find a wide paved shaded place to ride as long as you'd like. It's a great safe place to take the family for a ride. We happened upon a riding group that was just starting and joined them. ",
  "This is the best biking/walking trail in the area! It's paved and it's great for all experience/fitness levels. The path is well maintained and free of litter and there are several rest areas with restrooms, water fountains and benches/tables. There are a few entrances to the trail with parking lots and everyone on the trail is pretty friendly. ",
  "I like to cycle the St Marks trail and adjacent Munson and Twilight mountain bike trails.  I have hiked the mountain bike trails and have had a great time doing so.  This is a very accessible and well used trail system.  If you like to run, cycle, or hike, this is the place to come!"
 ]
},{
 "name": "Lake Ella & Fred Drake Park",
 "address": "N. Monroe and S. Lake Ella Dr.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/54/1d/b0/lake-ella-fred-drake.jpg",
 "tags": [
  "walking",
  "walk",
  "food",
  "nature",
  "walk",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d4282322-Reviews-Lake_Ella_Fred_Drake_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "We had some time to kill and went here for a picnic. Many people were walking the path that circles the lake. Our granddaughter really enjoyed climbing the huge oak tree near the parking lot. There were many geese wanting a handout that we found entertaining. It was a great time and I recommend this place for a picnic or walk.",
  "Ahhhhhhhhh!  My teenage son and I picked up fast food lunch from Sonic and headed to a park bench at Lake Ella to enjoy the view. What a wonderful experience. We sat in the shade and watched the fountain. Quite a few ducks came to see what we were up to... asking if we had anything to share. Turtles basked on a log in the sun and bobbed their heads in and out of the water. It was a perfect day. What was intended to be a quick lunch turned into about an hour of enjoying nature. I can’t wait to go back. It was like therapy!",
  "Lake Ella and Fred Drake Park provide such a peacefull, idyllic setting for a dog or human walk and a picnic.  There are ducks everywhere, little shops nearby and a fountain in the middle of the lake.  Picnic tables, benches and a gazebo are nice additions, as well.  Plenty of shade.",
  "Wonderful place for walking, running and exercising outdoors, you can relax with the view of ducks of various species, see turtles in combination with the vegetation of the Lake",
  "This is a fave Midtown spot of many.  I enjoy visiting here, and regret I don't get here enough.   SUper spot in the center of town."
 ]
},{
 "name": "Doak Campbell Stadium",
 "address": "403 Stadium Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/41/96/71/doak-s-campbell-stadium.jpg",
 "tags": [
  "food",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d5974965-Reviews-Doak_Campbell_Stadium-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "The outside facade is misleading.  The stadium is old and has cracks and is bult as an erector set.  Needed to tear it down when they built the admin building around it.",
  "The most resounding takeaway is big. It’s a yuge stadium with a lotta bricks... the biggest building on the FSU campus. I would love to say terrible things, but truth is, it’s an impressive stadium, and all the Noles I encountered were friendly and helpful. Of course, they are still recovering from a season ending crushing defeat to the Gators, so that may have made a difference as far as civilizing them. At any rate, it’s worth a look. ",
  "Bad parking, bad food selections (fats and carbs), overpriced everything. If you want to watch FSU play football- catch an away game.",
  "As an FSU alum, it was quite interesting to see how the stadium has grown up over the years! Our event was at the University Club, and we had a chance while waiting for event to start to see the stadium. Impressive! Quite different from when I was in school there! The event at the Club was quite good. Excellent quality. If you want to host an FSU-related event, consider this place!",
  "Although my team didn’t win, the experience was phenomenal. I was fortunate enough to get a full tour of the stadium since I worked with my college football team. The stadium itself isn’t as large as some of the other major programs, and unfortunately due to the poor start to this season the crowd wasn’t at full capacity - but I’m sure this place is rocking during some of the high-profile games. Definitely worth going to if you’re a college football fan. Hope that one day I can revisit.\nAnd I met local legend Red Lighting!"
 ]
},{
 "name": "New Capitol Building",
 "address": "400 S Monroe St Apalachee Pkwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/c4/d3/aa/new-capitol-building.jpg",
 "tags": [
  "walk",
  "history",
  "historic",
  "free",
  "art",
  "tour",
  "art",
  "tour",
  "walk",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d531881-Reviews-New_Capitol_Building-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you live in Florida or visit Tallahassee you must go to the new Capitol building. Walk through the rotunda at the entrance, and make your way passed the Governors office and Chief Financial Officers offices as well as the Secretary of Agriculture on the first floor. The walls are covered with the exceptional  women of Florida stories and their pictures, and there is a gift shop with amazing and beautiful gifts...and that’s just part of the first floor. Rest a while at Sharkeys Grille and enjoy a daily special, or just wait for the Governor to stroll by. Dont miss this, and enjoy Florida’s Capitol.",
  "During a legislative advocacy session I got a chance to visit the Old and New Capital building. The old building was an EZ place to enter and to obtain great historic information from the information desk. Simple and ez Florida History to view and it was free.",
  "We circled the Capitol complex 3 times trying to find the Visitor Center. I finally called them and they guided me in. We did get the oportunity to compare the old and new state capitols (several times!) The staff did a great job helping us develop a plan for experiencing as much of the state as possible with our limited time. I wish they had told us about the observation deck in the new building. We were right there and missed it.  ",
  "The new capitol sits right behind the old capitol.\nThere is a nice panoramic viewing area on the top floor, that has some art displays.\nYou can take a s.elf-guided tour, and see the legislative chambers. They are modern and attractive.\nThe first floor has some nice displays, a gift shop and the information desk.",
  "The view from above is fantastic. Hopefully an employee or volunteer will be up there to point out interesting sites.  The rest of the capitol is self guided and there are lots of security guards.  The gift shop employee was funny but not helpful in getting around.  ",
  "On our car trips in the US we seek our state capitols to visit. So far we’ve been to 24. The inly thing I got out the visit was a stamp in my Capitol Collection book showing that I had been there.\n\nIt’s a self guided tour of 3 floors there are 22). The top floor has vistas over Tallahassee and displays of local art.\n\nThe fifth floor has the house and senate chambers which you can barely see because of small windows and an overhang above the windows inside the chamber. There are a few displays in hallways and adjacent rooms that are really boring and politically correct.\n\nThe entry area has security guards and the great seal of Florida, at floor level. The rotunda above has a list of Florida’s state flora, fauna and pie: Key lime).  Also in the entry area are the halls of fame for women, police officers, firefighters and etc.\n\nDo yourself a favor, walk in,, get your stamp and leave. Go across the plaza to the beautiful, restored original capitol building.",
  "The new Florida State Capitol is modern, and I can't say it's really exciting to see architecturally.  My Mom and I went on a self guided tour, and there was a brochure available to help us.   Both the Senate and House were locked, so we couldn't get in, but were able to see the rooms through the windows.  The one nice thing the building does have is an enclosed observation deck on the 23rd floor, where you can get a nice view of the city.  All the employees we encountered were very nice.  \nParking is available a couple of blocks away near the intersection of South Bronough Street & St. Augustine Street.  The handicap entrance to the building is on the north side of the complex near the intersection of East Jefferson Street and South Adams Street.\nThere is a little gift shop on the first floor of the building.",
  "Perhaps because this was the last capitol of our November trip, it didn't really spark much excitement. Of course, there is a small dome but more like a small house and then the dome. It came at the end of seeing a few other capital buildings and it was the last one before heading back to Orlando to leave on a flight home. I guess it was more of a check off of the 50 capitols. Sorry Florida....no great excitement."
 ]
},{
 "name": "JR Alford Greenway",
 "address": "2500 Pedrick Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/85/b8/ec/jr-alford-greenway.jpg",
 "tags": [
  "eat",
  "walk",
  "field",
  "hike",
  "walk",
  "nature",
  "walk",
  "hike"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d10210395-Reviews-JR_Alford_Greenway-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Alford Greenway is 700+ acres.  A lot of land.  Open land, forest trails and forested areas you can tramp around in.  Keep your dogs on leashes, there are bobcats and coyotes  in the back half of the park.  Lots of deer if you get out right after daybreak. There are bicyclists  and runners. Watch out for fast moving bicyclists and vice versa.  And slow hikers, day hikers.  No camping is allowed.  Summer time after 11:00 a.m.  is a poor time to go out in the back parts of the park because of bugs, yellow flies, horse flies etc.  Trust me, they will eat you alive.  Winter, Spring and Fall however are excellent times to visit Alford Greenway.   If you walk right down the middle to the back of the park and back to the front, that is about a 2 hour walk depending on how fast you walk.  There are gorgeous old oaks in various places, especially the part of the trail along Alford Arm water body.  Suggest you carry a bottle of water with you  if you plan to go to the back part of the park.  There aren't many places to sit on a bench in the park.  Last I looked, there were 3 benches, so not much.  But its' not hard to find a patch of grass to lay down on and look at the clouds.  You can visit this park a  half dozen times and never have to walk the same set of trails.  Its' extensive.  Please remember to pick up your trash and someone else's if you can.",
  "My wife and I did a Saturday hike at Alford Greenway Park. There is access to Lafayette Heritage Trail. That is the direction most people went. We decided to hike east across the open field. The trail winds through open fields and forests. At one point it goes by a lake. The condition of the trails was good. There are so many trails to create any length of loop that is desired. This may not be the best park during a summer afternoon. Otherwise it is a great place for a hike.",
  "There are several trails you can take from here but our favorite heads towards the lakes and the covered bridge.  Breathtaking views, water birds and fairly level, shady walk.",
  "You will find beautiful pathways, canopy trails, bikes, horse, people (children esp), and dog friendly thru the greenway, and, a covered bridgway with a shaded boardwalk under the oaks, while you await a train to come by and toot a wave to you!  From the greenway there connects to Piney Z playground and restrooms, for the longer walks or friendly fishing on the lake fingers or pier.  It has it all  for a nature adventure walk.",
  "This greenway encompasses so much land. (117 acres I believe). \nThere are several different area tracts to see. Open meadow, trees, and lakes. You can ride bikes, hike, ride horses. Parking at the Pedrick parking and heading right can take you over to Piney Z. There are even a few areas with higher elevation that can give you a “rich” riding bikes   Cadillac Trail?  \nThis is a wonderful place to bird watch as well. \nENJOY!  "
 ]
},{
 "name": "Tom Brown Park",
 "address": "501 Easterwood Drive",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/56/99/6a/20180826-191352-largejpg.jpg",
 "tags": [
  "parks",
  "nature",
  "walking",
  "walking",
  "family",
  "walking",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d12533229-Reviews-Tom_Brown_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "We brought our fishing gear and some comfy seating and enjoyed a couple of afternoons trying to catch something although the most enjoyment was being in the middle of the beautiful peace and quiet. It's a very well-kept park, and a wonderful place to relax when there are no park events. During holidays this quiet place goes into exciting transformations. All in all, a pleasure to visit any day, any time!",
  "The course is laid out over a wide area. You plat thru a lot of trees and some wide open areas. It is great for beginners as well as intermediate and advanced players.This is a great course to play. You will enjoy the entire course and the elevated hole at the end of the course.",
  "This is a huge park, with great nature and paved trails that are frequented by hikers, runners, and cyclists, as well as some ponds. There are also two playgrounds, numerous ball fields and courts, dog parks, a BMX area, and a popular Frisbee golf course. Great for everyone. We visit frequently.",
  "This is our regular for hiking but there are many other activities as well, particularly biking trails.  Amid a dense forest, you feel as if you are out in the country when actually you are less than a mile from the hustle and bustle.  Some trails are for beginners and casual hikers and some are a little more strenuous.  Fresh air abounds!",
  "Tom Brown Park is a great park, full of activities for any age: softball, soccer, tennis, baseball, disc golf, a wonderful playground, trails and a dog park, among other activities. The playground is terrific and most of the equipment is covered to keep it from being so hot. The dog park is also very nice, with separate areas for large and smaller dogs. Walking trails can be found that wrap around the scenic lake and there are restrooms available. I frequently go to the park during my lunch hour to take advantage of the peace and quiet near the lake, and I highly recommend it for anyone who enjoys the outdoors.",
  "This is a great park to get lost in. I always take my dog to play with the other dogs. Sometimes there are pools there for the dogs to cool down in. ",
  "If your family likes to do lots of different activities outdoors then this is a nice park for you.   It is a huge park and has playgrounds, great walking and biking trails, Frisbee golf, places to picnic.......After the first visit here I see why my daughter and granddaughter enjoy this place so much",
  "This park is a real gem. Pretty much everything, sand volleyball, remote control race car track, kids BMX racetrack, frisbee golf, clay court tennis, nice basketball courts (hidden), dog park, fabulous children's playground, walking trails, lots of baseball/softball/soccer fields, and more......"
 ]
},{
 "name": "Miccosukee Canopy Road Greenway",
 "address": "5600 Miccosukee Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/15/bb/0b/approaching-interstate.jpg",
 "tags": [
  "hike",
  "walk",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d10312979-Reviews-Miccosukee_Canopy_Road_Greenway-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I went hiking and running on the Miccosukee Greenway. We started at the Fleischmann Road Trailhead and hiked out and back 3 miles. The trail is surprisingly hilly and beautifully wooded. Many birds were flying around and baby birds could be heard in the nearby nests. The trail itself is a well-maintained limerock trail which hard-packed but much easier to run on than concrete and asphalt. We love this trail and will be back frequently! ",
  "Yes, the drive is beautiful, but you are missing the best part. Park at one of the 3 parking areas along the way and walk and hike!  Restrooms and water fountains are on the trail. Parts of the trail are open and have oyster shell trail footing. Some parts are shaded and very woody. Some parts have wooden bridges to walk over. You can choose how far you want to walk, or bike. The walking/biking /running trail is awesome!",
  " I’ve bicycled the length of the trail about a half dozen times, mostly on a mountain bike and lately on a gravel bike. The terrain is only moderately challenging and most bikes would be okay. It can be a fast trail.\n Have the trail to yourself on weekdays. Weekends, the southern half of the trail seems to see more foot traffic. A mix of people who will give you room, and clueless dopes who block the trail. I counted several horses.Slow way down for any traffic in either direction.",
  "Make time for this occasion - drive down this road (not at night) and see this beautiful natural area. It's not inly Miccosukee that is a canopy road, there are others, and they take you back into beautfiful areas with old historic churches and other locations",
  "Nice scenic drive.   Very narrow road so not safe to walk or bike.  However at the actual park itself there looks to some areas that might be safer.  Side note the bathrooms were very clean. "
 ]
},{
 "name": "Grove Museum",
 "address": "902 N Monroe St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/dc/68/a9/img-20180504-130151817.jpg",
 "tags": [
  "tour",
  "tour",
  "free",
  "learn",
  "tour",
  "family",
  "nature",
  "history",
  "knowledgeable",
  "free",
  "history",
  "learn",
  "historic",
  "free",
  "tour",
  "free",
  "learn",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d12350496-Reviews-Grove_Museum-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "This house is gorgeous. Amazing wood work. Staff has done authentic remodeling. It just opened so still finding its \"legs\". Tours offered, Or not.\nRide The Trolley for an extra \"oomph\". The Grove right on Trolley line and go to lunch also. Right now tour hours and days are limited so call first.",
  "Beautifully restored mansion, but mostly empty, except for photos, maps and exhibits.  \n\nExcellent basement presentation about 1950s Governor LeRoy Collins, and his contributions to the Civil Rights movement.  \n\nGood spot for those seeking an interesting, educational, slow, quiet and free experience.  \n\nNot a good fit for travelers with toddlers or most children under 12.  Doable, but instead try the Tallahassee Museum if you have children .\n\nGoodwood, also built circa 1840,  near downtown, is much more \"Wow\". Its an American treasure and a visit you'll always remember. \n\n Goodwood is a mansion full of priceless, original, antiques, paintings, furnishing, ephemera  and memorabilia.  A house tour for seniors is 10$ and very well worth it. \n\nAnd its free to tour Goodwood's  vast gardens and grounds",
  "I visited for The Grove Museum for the first time today, and it was amazing! The staff are knowledgeable, welcoming, and kind. It was fascinating to learn so much about history and to feel it firsthand, including the stories of the family who lived in the house...dominated by strong women as well as one of the most prominent governors who played a major role in civil rights, LeRoy Collins. The grounds are spectacular, and I love how they are working to make improvements with native plant species. It's very close to downtown in an urban environment, but it feels like you are in the country...the next door neighbor is the Governor's mansion! You could spend several hours at The Grove Museum and still have more to learn. The place is fully accessible to wheelchairs and has excellent facilities. Admission is free, though they welcome donations. If you want a group tour for 10 people or more, you can make a reservation for $1 per person. The Grove Museum is great for all ages, and if you love nature, history, architecture, or fascinating stories, I highly recommend visiting this Tallahassee treasure!",
  "Learn about the first governor and his great-great grandaughter's husband (the 33rd governor). The house has lots of history from territory to the present, from slave owner to civil rights governor. \nIt's a respite from the city with lots of gardens and trees. And an opportunity to see an historic house as museum. (Free parking also.)",
  "A great place to stretch your legs while traveling (if you have a hour to kill) lovely grounds and a beautiful home. Only a few of the rooms are furnished but you still can appreciate the grandeur of the building. I personally found the tour a little on the boring side. Overall not bad for free. ",
  "The guide's presentation was quite good.  If walls could talk...from 1835 to 1960s...we could imagine what life was like.  It was very interesting to learn how the first owner had slaves and the last owner was quite vocal regarding civil rights.   ",
  " Excelent tour with a lot of Civil Rights information. The last resident was the govenor of Florida and a decendent of the orifinal owner.",
  "The history of the mansion is expansive but they choose to focus on slavery topics instead of topics concerning the formation of Florida as a state and the contributions of the governors and first ladies."
 ]
},{
 "name": "Lake Jackson Mounds Archaeological State Park",
 "address": "3600 Indian Mound Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/f1/68/b1/photo0jpg.jpg",
 "tags": [
  "walk",
  "nature",
  "walk",
  "walk",
  "learn",
  "history",
  "nature",
  "nature",
  "historic",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d126924-Reviews-Lake_Jackson_Mounds_Archaeological_State_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Today we hiked the entire Lake Jackson Mounds Archaeological State Park with around 3.5 miles of trails. Informative displays and several picnic tables are offered including bathrooms. Photographed is the tallest mound which stands 36 feet high with a base that measures 278 feet by 312 feet. It was built by Native Americans belonging to the Fort Walton Culture. ",
  "We joined the local bird club for a Saturday walk around the park and then checked out the archaeological mounds and a very nice trail that took us to a former mill site dating back to the 1800's when the property had been a plantation.\n\nThe park is a little tricky to find but it's well worth the effort.  There is no entrance fee and there are bathrooms and picnic facilities.  Google maps will get you there.\n\nThe park was once home to thousands of Native Americans around 1000 AD who traded as far away as Central America and the Midwest.  They had a very prosperous farming community in an area that provided them with fresh water and plentiful game.  And to pay homage to their gods, they constructed giant mounds where they conducted ceremonies. \n\nThere are trails and steps that lead you to the top of the mounds where you can appreciate just how much work it took to build what would have been the highest points in the region.  Think the pyramids, only with dirt.\n\nThere are a series of old plantation roads that wind through the forest and swamps, eventually ending at the river where you will find a large assortment of shore & wading birds.\n\nThe trails to the mounds leave directly from the parking area.\n\nAnd there are numerous interpretive signs that help explain what life was like before the white man.  Other than the bugs, it must have been pretty darn sweet.\n\nFor other travel tips, please check out my popular travel blog.",
  "Lake Jackson Mounds preserves several beautifully preserved \"Fort Walton\" or Mississippian-era mounds and has a beautiful nature trail that winds through the remains of a 19th century plantation farming operation. The largest of the mounds is absolutely magnificent in size!",
  "We joined the local bird club for a Saturday walk around the park and then checked out the archaeological mounds and a very nice trail that took us to a former mill site dating back to the 1800's when the property had been a plantation.\n\nThe park is a little tricky to find but it's well worth the effort.  There is no entrance fee and there are bathrooms and picnic facilities.  Google maps will get you there.\n\nThe park was once home to thousands of Native Americans around 1000 AD who traded as far away as Central America and the Midwest.  They had a very prosperous farming community in an area that provided them with fresh water and plentiful game.  And to pay homage to their gods, they constructed giant mounds where they conducted ceremonies. \n\nThere are trails and steps that lead you to the top of the mounds where you can appreciate just how much work it took to build what would have been the highest points in the region.  Think the pyramids, only with dirt.\n\nThere are a series of old plantation roads that wind through the forest and swamps, eventually ending at the river where you will find a large assortment of shore & wading birds.\n\nThe trails to the mounds leave directly from the parking area.\n\nAnd there are numerous interpretive signs that help explain what life was like before the white man.  Other than the bugs, it must have been pretty darn sweet.\n\nFor other travel tips, please check out my popular travel blog.",
  "It's a nice place to visit if you want to get out for a short walk.  It would also be a great place to take your dog for a walk or to visit with small children.",
  "This place is so amazing and peaceful. Find a boat launch and you will be good ! So many birds and wildlife attractions you will be amazed. ",
  "A very quiet place to learn a bit about the people who built the mounds.  There are good maintained trails as well.  Besides the archaeological aspect, the trails offer a sense of solitude.  Do not forget to loook down as there are plenty of small flowers, fungi and a couple of early blooming trilliums to see.",
  "A little out of the way park that has a great history. I love the nature trail there. It is peaceful and always kept up. To think of the Native Americans right here in my home town. ",
  "Today we hiked the entire Lake Jackson Mounds Archaeological State Park with around 3.5 miles of trails. Informative displays and several picnic tables are offered including bathrooms. Photographed is the tallest mound which stands 36 feet high with a base that measures 278 feet by 312 feet. It was built by Native Americans belonging to the Fort Walton Culture. ",
  "We just decided to go by a grocery store at the end of the road to go down to the site and get some lunch and have a make shift picnic. Peaceful and quiet.  No one was there other than an ambulance that was taking a break.  Enjoyed our lunch under the covered shelter at a picnic table looking at the mounds and nature.  Had some information at the shelter that gave some light on what was there 1100 AD.",
  "I visited Lake Jackson Mounds for a short walk. Park staff were present and gave me a detailed overview of the park. There are two mounds near the parking area with stairways leading to platforms on top. Interpretive exhibits are informative and scattered about. Some are illegible due to poor condition. The park could use some restoration as a bridge was out on one trail and the platforms are heavily weathered. I sat for a while on top of the large mound and enjoyed the shade and tranquility. I could hear crickets and birds all around. The echo of woodpeckers was also audible. Purple flowers were blooming all over the mounds. It is a beautiful historic place to visit, and I highly recommend it!"
 ]
},{
 "name": "Proof Brewing Company",
 "address": "1320 S Monroe St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/d2/c4/18/expansive-tasting-room.jpg",
 "tags": [
  "food",
  "brewery",
  "tour",
  "food",
  "pets",
  "food",
  "art",
  "kids",
  "brewery",
  "kids",
  "pets",
  "food",
  "art",
  "kids",
  "brewery",
  "drink",
  "food",
  "food",
  "brewery",
  "food",
  "brewery",
  "tour",
  "music",
  "brewery"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d7644910-Reviews-Proof_Brewing_Company-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "We held my milestone birthday party in the private room at Proof and had an awesome time.  Beautiful private room with its own bar, along with outside area.  The cool November weather was great and allowed us to utilize both the outside and inside areas comfortably for our 40+ guests.  Beautifully decorated and complete with tables and chairs, along with outside furniture, heaters and cornhole games, the private room space is great for any event.  And they offer a private tour of the brewery for your guests.  You can select up to 8 beers, along with white and red sangria to have on tap.  Proof can also set up a full bar if you want that for your party.    Proof partners with Proper to offer catering for your event.  Proper has lots of food options to choose from including appetizers and full meals.  But best of all is the wonderful craft beers!",
  "We returned to Tally this weekend with our Nole grads to spend time at Proof!  We enjoyed great beer as always and chilled in the back patio.  What an awesome place to hang out and reminisce.  Can't recommend Proof enough!",
  "Enjoyed a few colds ones while visiting FSU with my son.  Great selection of beers and food truck had some solid options.  Great patio seating along with friendly staff!  Worth checking out!",
  "This is Proof's production brewery location inside the Railroad Art Park.  Inside they have a bar area with about 20+ taps serving their beers and guest brews.  You can see the brewery floor through the windows in the bar. The highlight of this location is the outdoor space with tables, benches, awnings and games like cornhole. I think their pub over on Tennessee street can sometimes be an overdose on \"hip\" so this location is a nice. laid-back change of pace. You can buy growlers and also Crowlers (the new aluminum can growlers) to go. Kids and pets are welcome depending on the crowd level and events planned. They don't have food but they do have food trucks that show up. Closed Mo-Tu, We-Fr: 4pm-midnight, Sa: 3pm- midnight, Su: noon-6pm.",
  "We found proof by Google search and figured we would give it a try.  Cool place where the bartenders know their beer and are friendly and helpful. They have an area to enjoy your beer inside or outside. It was very cool out so they had heaters on the patio.  There is a large backyard area where people can play some games. ( way too cold for us!). The ambiance at this place is perfect.  Great for college kids or parents to hang out and enjoy a few beers. ",
  "This is Proof's production brewery location inside the Railroad Art Park.  Inside they have a bar area with about 20+ taps serving their beers and guest brews.  You can see the brewery floor through the windows in the bar. The highlight of this location is the outdoor space with tables, benches, awnings and games like cornhole. I think their pub over on Tennessee street can sometimes be an overdose on \"hip\" so this location is a nice. laid-back change of pace. You can buy growlers and also Crowlers (the new aluminum can growlers) to go. Kids and pets are welcome depending on the crowd level and events planned. They don't have food but they do have food trucks that show up. Closed Mo-Tu, We-Fr: 4pm-midnight, Sa: 3pm- midnight, Su: noon-6pm.",
  "A group of us arrived at Proof and one of our party asked if they had any non-alcoholic beer.  The server said “we wouldn’t do that to beer!” The server meant to be funny but it was not.  Anyone who chooses not to drink alcohol should be treated with respect, hospitality, and kindness.  Definitely not cool.  We won’t be back. ",
  "This is a large establishment with spacious accommodations for several diverse groups at the same time. There were 4 different groups when ours was celebrating. There was no confusion and each had its own separate area to congregate \nWe were in a private venue with our own Kareoke setup, private catering and bar. The staff was professional, friendly and efficient. The food was GREAT. It included a variety of wings, chips, sliders, chicken and more tasty bites.",
  "Very nice and lively brewery.  Outstanding selection...try the nitro mango!  Friendly and attentive staff...fun place for a Friday night.  The food selections outstanding looked popular.  Very clean restrooms as well",
  "We held my milestone birthday party in the private room at Proof and had an awesome time.  Beautiful private room with its own bar, along with outside area.  The cool November weather was great and allowed us to utilize both the outside and inside areas comfortably for our 40+ guests.  Beautifully decorated and complete with tables and chairs, along with outside furniture, heaters and cornhole games, the private room space is great for any event.  And they offer a private tour of the brewery for your guests.  You can select up to 8 beers, along with white and red sangria to have on tap.  Proof can also set up a full bar if you want that for your party.    Proof partners with Proper to offer catering for your event.  Proper has lots of food options to choose from including appetizers and full meals.  But best of all is the wonderful craft beers!",
  "This brewery is a bit off the beaten path, but they have fantastic beer that can be found at any bar in town. They are also working on going nation wide and it would not surprise me at all if they are one of the most well known craft beer suppliers in the southeast in the next few years. There beer is really good. They have fantastic live music too. They had a bluegrass band last time I was there that I absolutely loved. If you go to Tallahassee, then you have to go to proof!"
 ]
},{
 "name": "Apalachicola National Forest",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/7a/6d/64/trilhas.jpg",
 "tags": [
  "food",
  "eat",
  "active",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d147133-Reviews-Apalachicola_National_Forest-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our drive through this national forest was wonderful.  Such tall trees was still vibrant green in late November.",
  "Very nice setting in a long leaf pine and palmetto forest with other trees mixed in as well.  The campground is not very big (about 11 or so sites and only 4 or 5 have electricity and water) and the sites are relatively private.  Some sites have a view of the lake.   Bathrooms have showers, but the water is pretty hot and the showers need better placement of the hooks to avoid getting everything wet.  No shelves to place your clothes etc.  Toilet (one only) and shower (one only) are separate.   There is a set of shower/toilet for men and a separate one for women.\nVery quiet and many birds singing early in the morning.   There is a gate that is locked at 8 pm but if you are camping you get a code to come in after hours.   Half price if you have a National park senior pass (you can get a senior pass for life for $10 when you turn 62 if you are a US citizen).   No cell phone or internet access in the campground.  Internet access was possible for me just outside the park.   The water is good (no strong flavors).  No restaurants or stores nearby so it is best to bring your food or eat before you get here.\n\nNice trail around the lake, great for an early morning or late afternoon walk. \nI camped for 3 nights here and enjoyed it in spite of the tiny no-see-ums (sandflies) that are active and sunrise and sunset.  For people with allergies the bites can be long lasting and very itchy (best to use insect repellent). \n\nI would return to this campground in the beautiful Apalachicola National Forest. \n\nNote:  The campground is supposed to be open year round if they have a campground host, other wise it is only open for day use.  It is $3 per person for day use.  There is a small fenced in beach and picnic areas, which can be popular with locals.  Reservations for camping can be made online.",
  "Disclaimer: Much of this forest is true wilderness. Cell phones typically do not work, roads can be hard to follow, are not always well marked and can go from wide and firm to narrow and muddy without notice. You will not have access to any drinking water or bathrooms. Taking a wrong turn can take you 30 miles away from anything without a good chance to turn around. Even if you do get to a paved highway, you still may not be close to civilization. I always fill up on gas, bring food and water and have a map. I also only go with 4 wheel drive. This disclaimer is for the interior of the forrrest, there are trails acessible from the highways(Mainly Highways 98, 319, 65, 267 and 329) that do not require 4 wheel drive. Now thats out of the way.\n\nThis place is awesome, you can pick it up practically in town and follow it all the way to the coast. Countless lakes and streams. Some of the lakes are clear with sand bottoms and great for swimming, but watch for gators. There are unnamed creeks to fish and paddle, although many of the creeks can only be paddle a mile or 2. The creeks off the southern section of highway 65 offer some extensive paddling options but can be tricky so bring a map and watch tides. The Florida trail runs through it and there are several other singletrack hiking trails. Be careful during deer, hog and turkey season as hunting is huge here. You could spend 10 years exploring this place. Be careful, and enjoy",
  "Our drive through this national forest was wonderful.  Such tall trees was still vibrant green in late November.",
  "I just love driving around and seeing the natural beauty of the park and forest areas. Great for a Sunday afternoon drive.",
  "After reading reviews and planning a driving trip through the national forest we were disappointed with our trip. We found no direction signs. There were no forest maps and few road signs to show what features were where. \nWe traveled over 100 miles and saw no lakes, no wildlife, no campsites, no picnic areas, no parking pull off spots and nothing to entice us to ever return!\nWe lover our trip along the gulf coast into Apalachicola city but this was a sad disappointment.",
  "I liked the fact that I saw wildlife. I saw a big beautiful Deer. Several Turtles,a flying squirrel. Several Turkey vultures. Just Beautiful no matter which way you looked. This the only national forest located in the Florida Panhandle. Its large with  632,890 acres. Camping is offered but Hotels are also available in nearby towns.",
  "This forest butts up against the SW side of the City of Tallahassee. The area is well managed and that includes a very capable Prescribed Fire Program.  The forest is composted of flat woods, wetlands, pocosin, and a network of roads to help you get around.  Hunting is allowed on this forest with the proper permits.  There are many activities offered by the USFS as well as both other public and private groups."
 ]
},{
 "name": "Challenger Learning Center of Tallahassee",
 "address": "200 S Duval St Kleman Plaza",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/16/95/ab/94/challenger-learning-center.jpg",
 "tags": [
  "nature",
  "kids",
  "food",
  "theatre",
  "kids",
  "music",
  "learn",
  "kids",
  "family",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d2331081-Reviews-Challenger_Learning_Center_of_Tallahassee-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Always has fantastic nature films but also a great place to see the latest blockbuster.  Great sound and a beautiful screen.  Aqua-man was epic!",
  "The 3D or non 3D movie experience is awesome! Great location downtown with restaurants across from the center and FSU nearby. Kids will love the interactive experience and astronaut food for purchase. It's a cool place for sure.  ",
  "We spent some solid time here learning about the planets in the Center's Surround-Sound theatre.  Truly Amazing.  The guides in the Center taught us so much about NASA and the planets.  Things we didn't know--and the theater is really spectacular.",
  "I want to visit here again. The Challenger Learning Center is not just for kids. I-Max theater is fantatic. See some of your favorite music movies there. Great sound and visual experience.",
  "I think most of the good reviews here are for the IMAX, which I'm sure is a lovely experience, but the science side of things is lacking here. We have 3 small children and I expected this to be a kind of \"exploreum\" place. There are a couple of space suits in the lobby as well as some tinker toys and a giant Operation game (with broken buzzer) and beyond that- nada. I just wish we would have known exactly what it was (wasn't) before we came.\n0 stars for hands-on science learning\n3 stars for the fun planetarium show :)",
  "Have been to 2 movies recently at imax at Challenger Learning Center. Lots of fun at a good price. They show 3D movies with surround sound. Movies for all ages. Discounts for children, students and seniors.",
  "I like visiting here - great for kids to learn, and a good family outing place.   Enjoyable.  Parking under Klemann Plaza and walk!  Elevators there if you need.",
  "Went on a Sunday night. Five of us there.  Show enjoyable but not spectacular.  Sound ok but not fantastic.  Didn’t really take in what else is there aside from a few displays. "
 ]
},{
 "name": "Redemptive Love Farm",
 "address": "13800 Moccasin Gap Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/dc/e2/45/baby-cows.jpg",
 "tags": [
  "learn",
  "tour",
  "family",
  "kids",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d10446660-Reviews-Redemptive_Love_Farm-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our kindergarten class visited the farm today.  It was really nice and peaceful.  We especially enjoyed the hands on experience.  We were really impressed with the young people who were most courteous.\nThank you!",
  "Took my granddaughters here because they were offering a Unicorn photoshoot. This place is awesome and inspiring. It is run by a family. One of their children gave us a tour and introduced us to all of the animals. They are an animal rescue. Check out their website to learn more about what they do. We loved it and can't wait to go back. ",
  "we've been to this farm many times and always look forward to it! pony rides, an interactive petting zoo and animal feed for $1 (bring cash).  arrive early for best parking and to beat the summer heat.  the owners are wonderfully kind and genuine 👌🏼",
  "I always look forward to activities that involve animals and the Redemptive Love Farm did not disappoint. There were many species of farm animals that were available to pet and/or hold. The baby piglets were my favorite as they would just sleep in your arms all day if you let them. The kids who live at the farm are the sweetest and are always willing to help you or teach you about the animals. I will definitely keep this hidden gem in my pocket and show it off to my visiting friends and family in the future."
 ]
},{
 "name": "Natural Bridge Battlefield Historic State Park",
 "address": "7502 Natural Bridge Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/b3/58/07/photo5jpg.jpg",
 "tags": [
  "history",
  "unique",
  "nature",
  "history",
  "learn",
  "nature",
  "history",
  "kids",
  "history",
  "walk",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d3381808-Reviews-Natural_Bridge_Battlefield_Historic_State_Park-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "This state park is small and off the beaten path, but the local historical society and Civil War re-enactors contribute a LOT to keep this place up to high standards. Don't miss the battle re-enactment and living history events in Feb of each year. Nature lovers will appreciate the unique geological features found in the park and nearby. ",
  "This is the State Park that honors the Battle that kept Tallahassee (State Capitol of Florida) from being captured during the War Between the States (Civil War).  3 years ago the State added a large land purchase to it.  It's a beautiful site, Large UDC Monument and not much else, but important to take the little ones to and have their picture taken sitting on the Monument.  I have friends, brother & sister who have a photo of themselves sitting on it, almost 60 years ago, when it was new!  Incredible.",
  "Learn more about the history of Florida and learn the story of Natural Bridge.  History buffs will like this site.  School age children studying Florida's history will also enjoy the nature trails and the hikes and the experience of learning something more about Florida.",
  "A small park but worth the trip to see the monument. Combine it with a trip to st marks wildlife refuge and lighthouse. ",
  "Don't see going here for fun with the kids. But if history is important to you, then this place is special to see.",
  "History buffs nice bit of American history, very small park w restrooms, short walk to river w whirlpool disappearing into a underground stream. Much of property was recently acquired. Nice memorial w great facts. $3 self pay fee",
  "Historic marker and info about the Battle.  Would recommend visiting the St. Mark's National Wildlife Refuge first and foremost.  You can stop here on the way down or back from Tallahassee.  Probably don't want to make it your main focus.",
  "This is a special park for so many locals and visitors, it's small, very peaceful and well kept by staff. "
 ]
},{
 "name": "Tallahassee-St. Marks Historic Railroad State Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/12/52/1a/tallahassee-st-marks.jpg",
 "tags": [
  "history",
  "history",
  "affordable",
  "parks"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d147128-Reviews-Tallahassee_St_Marks_Historic_Railroad_State_Trail-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Having traveled hundreds, maybe thousands of miles, on Rails to Trails bike paths around the US, we have to say this is one of, if not THE, Best bike trail we have experienced. The scenery is spectacular, with magnificent live oak trees shading the trail and small farms along the way. The condition of the trail is excellent, straight, very well maintained, no debris, no bumps from tree roots. There is the added bonus of several concrete building rest rooms with benches. AND...get this...at each street crossing in which we encountered a vehicle, every single driver (total of 10) stopped to allow us to pass, waving us on. We have never encountered so many polite vehicle drivers while cycling. At the end of the trail there is a scenic park with picnic tables along the banks of the Wakulla River. There are informational signs along the way to tell you about the history of the trail and area. What a fantastic experience. We are already planning a return trip.",
  "We visited this paved, well maintained bike trail early in the day.  Bicyclists, walkers, runners and skaters coexist easily on this trail.  Shaded, with plenty of restrooms along the way.  Follows an abandoned railroad track, so it is very flat.  We will definitely visit again.  ",
  "What a great trail for biking. It's a very flat and wide paved trail. What was going to be a short ride turned into a 20 mile ride. Lots of stops along the way with benches water fountains and restrooms. Look forward to returning ",
  "Having traveled hundreds, maybe thousands of miles, on Rails to Trails bike paths around the US, we have to say this is one of, if not THE, Best bike trail we have experienced. The scenery is spectacular, with magnificent live oak trees shading the trail and small farms along the way. The condition of the trail is excellent, straight, very well maintained, no debris, no bumps from tree roots. There is the added bonus of several concrete building rest rooms with benches. AND...get this...at each street crossing in which we encountered a vehicle, every single driver (total of 10) stopped to allow us to pass, waving us on. We have never encountered so many polite vehicle drivers while cycling. At the end of the trail there is a scenic park with picnic tables along the banks of the Wakulla River. There are informational signs along the way to tell you about the history of the trail and area. What a fantastic experience. We are already planning a return trip.",
  "If you are visiting the area, this is a cool stop by if you are visiting the area. Good eats nearby, motels could be more affordable. ",
  "We ride on every vacation. We read about this trail and decide to visit Tallahassee to ride this trail. The start point has a public bathroom with water. The trail is paved and smooth. There are few hills and curves. It is mostly covered with shade which worked out well because it was very hot. We rode out and back. If you are looking for a shady quiet place where people from all over ride with their families, this is a great spot to go.\nPlease let me know if you have questions and/or found this review helpful. Thanks.\n*Additionally, check out my reviews on the Bradfordville Blues Club, Tallahassee Museum, and Tallahassee Antique Car Museum.",
  "Nice flat trail, well maintained, mostly shaded, clean Porta potties along the trail, safe, \nWe like to ride down and have lunch and then ride back",
  "We use this trail on weekends, state parks have taken an old railroad right of way and made it into a hiking/biking trail.  Would highly recommend this to riding on the streets of tallahassee if you are an avid bike rider -- it is a LOT safer"
 ]
},{
 "name": "Governor's Square mall",
 "address": "1500 Apalachee Pkwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/e4/04/55/view-from-escalator.jpg",
 "tags": [
  "eat",
  "food",
  "family",
  "food",
  "cheap",
  "food",
  "walk",
  "food",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d8516374-Reviews-Governor_s_Square_mall-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "Its an ok mall. Address is kind of confusing because you can not see it from a short distance (down the hill) and there are a plenty of other stores around the area. Not your typical Floridian mall...",
  "As long time Tallahassee residents we have enjoyed this mall and watched it grow since it opened decades ago. We've been in larger malls but none as well maintained at the Governors Square. \n\nWe look forward each Christmas to their holiday decorations and Santa's visit. It's a very family friendly place with a extensive food court, a fantastic sit down Italian restaurant and a wildly popular national brand coffee shop.\n\nRecent updates to the mall's interior has made it very modern and appealing. Many property's around the country have been plagued by crime and some actually closed due to a lack of customers; not the Governors Square Mall. You feel very safe on this property.  The parking lots are well lit and promote openness of natural surveillance and the entire property is routinely patrolled by highly visible private security. \n\nMany brand name stores have been here for years and appear to prosper. Rarely have I seen a vacant store front and if there is one, it's not vacant for long. \n\nWith on-line shopping's rising popularity, we sincerely hope the Governors Square mall continues to thrive. Because it's much more than a shopping center. It's a social community gathering place that also happens to have places to shop and grab a bite to eat. \n\n",
  "Even when Governor's Square Mall is not as big as many other Malls, you can find all kind of stores and the plus is that everything is in a reasonable price. Tallahassee is a city where most of students are, so, there why is cheap. \nThey have a good food court... from salads to hamburguesa and pastries. ",
  "Its an ok mall. Address is kind of confusing because you can not see it from a short distance (down the hill) and there are a plenty of other stores around the area. Not your typical Floridian mall...",
  "There are a lot of stores and a food court also. The people are very nice and will help you anytime. You can find just about anything you like too. My daughter loves to walk around in the mall and look at everything and so do I. It's beautiful place.",
  "The anchor stores are ok. Dillard’s is the best of one. Macy’s is tired and old. The other 2 are Sears and Penny’s. That being said, it is just like the thousands of aging malls found around the nation. Nothing special, not great or terrible. We rarely spend more than 2 hours  there. Malls are for the young. Being in our 50s, we go for a purpose not to browse and hangout. ",
  "Wasin town for the weekend. Shopped at the mall on Saturday. Great selection of stores. Was limited in buying due to travel but did some damage. lol  ",
  "Had a great time shopping and the food court had delicious dishes. Spend nearly everyday at the mall. Took my daughter to Tallahassee for school after Hurricane Irma. Now Governor's Square mall is my daughter favorite place to shop."
 ]
},{
 "name": "Lichgate on High Road",
 "address": "1401 High Rd",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/f3/bd/e4/lichgate-oak-tree.jpg",
 "tags": [
  "nature"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g34675-d9871648-Reviews-Lichgate_on_High_Road-Tallahassee_Florida.html",
 "source": "TripAdvisor",
 "reviews": [
  "The old oak tree was really something to see.  The walkways, the gardens, the Tudor house, along with the outdoor classroom are in need of help.  ",
  "Almost like an outdoor chapel in the middle of college apartments.\nThank Goodness it has been saved!",
  "Beautiful old oak tree in a park like setting.Lovely place too goo meditate and just enjoy the nature trail and the cottage",
  "I forget how I first heard about this mighty oak, but when visiting Tallahassee in April 2019 my husband and I made it a point to visit this tree....so glad we did. It took a little detective work and some GPS to find it exactly, small parking area and as you make your way to the oak tree in its clearing you can really feel the presence of this majestic oak. I pray that it will withstand any storms or hurricanes in its future as it has held tight over so many years. We live in Salem County NJ and just this summer our might Salem Oak 600 years old toppled down on a sunny June afternoon.....so visit this tree while you can. Namaste",
  "This is such a lovely little haven. The great tree is just amazing. You can really feel the age of this little town here."
 ]
}]
