[
{
 "name": "Sunshine Skyway Bridge",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/02/15/a3/wunderschone-brucke.jpg",
 "tags": [
  "run",
  "experience"
 ],
 "website": "http://skywaypiers.com",
 "source": "TripAdvisor",
 "reviews": [
  "This bridge is a thing of beauty. We've gone over this bridge many times traveling from Tampa to Sarasota and have enjoyed the amazing views each and every time. This week, my husband and I spent an afternoon and early evening fishing from the south fishing pier. Cost was $4 for our car plus $4 for each of us...total of $12. No fishing license required. Restrooms available. Bait shop sells live and frozen bait as well as ice and some tackle. No shade on bridge so dress appropriately to avoid major sunburn and bring sunscreen. We eventually gave up fishing in early evening (fish weren't biting that day) so we ended up sitting in our chairs watching the beautiful sunset. We'll definitely do this again!",
  "As you are on the Interstate-75 freeway in the Tampa area you may run across this wonder magic in the sky.   It gets very high, so do not look down if you do not like heights.",
  "Even if you don't want to go to the other side just drive over and back for the view alone.  If you time it right (usually about 6:00 p.m. on Thursday or Sunday, you'll see a cruise ship pass under.",
  "If you love heights, gorgeous views, and large bodies of water, this bridge is for you! After years of seeing it in pictures, it was thrilling to finally have the opportunity to drive across the Sunshine Skyway Bridge. Unfortunately, this bridge is not walkable, but the drive is lovely. ",
  "This was spectacular.  It was like an amusement park ride.  I was driving it is was difficult to keep my eyes on the road and to be honest, a wee bit nauseating.  Definitely a must see.",
  "If you’re afraid of heights, take an alternate route. 400 ft above Tampa Bay at the apex.  Just stay in your lane. ",
  "This bridge was a welcome difference for the commonly bridges we are use to seeing. It’s certainly an example of great engineering.",
  "We traveled under the bridge when on a cruise ship and wow was it an amazing experience. We saw it on way back when it was all lite up so pretty"
 ]
},{
 "name": "Big Cat Rescue",
 "address": "12802 Easy St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/9d/08/71/filename-big-cat-pic.jpg",
 "tags": [
  "free",
  "learn",
  "history",
  "walk",
  "experience",
  "kids",
  "knowledgeable",
  "experience"
 ],
 "website": "http://www.bigcatrescue.org/",
 "source": "TripAdvisor",
 "reviews": [
  "We took a Day Tour (1.5 hours) and it was super informative and just a pleasure to look at all the majestic cats and to learn that they are doing well after all the suffering they had in their lives. Don't expect to see all of them, the duration of the tour is just not long enough. We would like to do the more longer Keeper Tour next time. Btw, as we learned from the sanctuary's magazine, if you make a donation you can get free Day tour passes, discount cards for their giftshop and other perks (depending on the amount of the donation - but it's quite a deal). So check the BCR website. And: from now on, when I shop on Amazon, I use Smile Amazon instead of the regular one, this way I can make a smallish donation to the Big Cat Rescue... or any other charity of my choice. Cool.",
  "I would definitely recommend Big Cat Rescue for a visit.  To notch rescue with genuine concern for the cats they care for.  I took the Keeper tour, which was given by a seasoned volunteer who is dedicated to the amazing tigers, lions, bobcats, jaguars, bengals... etc, and can tell you each of their history whether from circuses, roadside zoos, owner relinquishments or other problematic situations.  Well worth your time and amazing to see the animals up close and enjoying their life at Big Cat Rescue!",
  "Was fortunate enough to visit today & visit all the beautiful cats during the keepers visit! \nM.C. & Desmond were fantastic, and thanks to Honey for helping me with reservation rescheduling \nThanks to all the staff at BCR for all they do for these animals to make their lives happy ones ❤️👍🏻😎",
  "As others have already said, this is not a zoo where you just show up, pay, and walk around. Check ahead of time for scheduled guided tours - this is the only way to see the animals. A very knowldgeable guide escorts a group no larger than 20 people thru the facility, and you are given the chance up close to see some of the most beautiful and exoctic cats in the world during the approximate 90 minute tour. It is all on flat terrain, we were given a quick story on how each animal arrived here, and overall it was really a great experience.",
  "Tours by reservation so make sure to go online ahead of time. We have been visiting BCR for the past 8 years and get a thrill everytime.  The cats are so beautiful and well cared for but the education opportunity is still priceless.   With all the stories and tales of each cat, you know that they are loved.  Bring your older kids (there is an age limit for different tours so make sure to check their site beforehand.) The tour is 1.5 hours and the gift shop is very tasteful.",
  "We took a \"private tour\" for our anniversary and were not disappointed.  Our tour guide, John was very knowledgeable, patient, and pleasant.  The cats were mostly out and some were quite talkative!  Beautiful place and beautiful animals!!!  Highly recommend going.  Wear comfortable shoes, paths no paved and uneven, but noting good sneakers can't handle!",
  "Never seen animals in such poor condition. All the cats looked as if they were starved and beaten. They all cried for help as I wandered that haunting place. I’ll never forget the dried blood on the tigers necks and the cub I saw that was all tattered and obviously beaten. I watched an employee pick up a cub by the neck in anger and scream at it. Overall would never suggest this place to anyone.",
  "I cannot recommend this place to anybody. The whole place smells terrible, there's long grass growing where there shouldn't be, the cats don't seem as happy as they should be, the cages are too small.. not a nice place. If I could rate lower than 1 star I would.",
  "Absolutely horrible experience. Staff were unprofessional, the animals looked more abused than ever, and the pricing is ridiculous.",
  "Before the Quarentine, I went to big cat rescue because some of my friends recommended it to me, turns out when I tried to ask questions I got shot down IMMEDIATELY. I left that place with a sour taste in my mouth. Carol Baskin has a poor attitude towards her customers and I wouldn't doubt it if she killed her rich husband.",
  "Very poor conditions for these animals, absolutely appalling.  Obviously the people working there have no clue what they’re doing."
 ]
},{
 "name": "Tampa Riverwalk",
 "address": "Ashley Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/5e/d9/84/tampa-riverwalk.jpg",
 "tags": [
  "walk",
  "learn",
  "walk",
  "family",
  "walk",
  "walk",
  "walk"
 ],
 "website": "http://www.thetampariverwalk.com/",
 "source": "TripAdvisor",
 "reviews": [
  "It's a great place to take a nice stroll. The river walk can get very busy, so try to visit early.  Tampa River Walk is worth the visit.",
  "This was a good find but we didn't know about the parking garage until after we were walking along the Riverwalk. DO NOT park in any 717Parking Lots as they are not helpful if you have a problem with paying at their lot kiosk. Our ticket did not print and we lost $10 - the phone number on the sign is a non- working number???!! When I finally heard from them, they refused to refund our money. That's not how you treat visitors to your city!",
  "Riverwalk is a great way to see Tampa from a beautiful angle.  There are lots of great parks and spots to grab a drink/bite to eat... you'll even learn some interesting facts about the city along the way.  It's best to visit when the weather is cool, as there aren't many shady spots and the Florida sun can be brutal most of the year.",
  "Great views of the river. You can people watch and look at the big buildings, you can sit in a bench under some of the shade areas. There are few widely spaced restaurants, not any real shopping area unless you walk in a couple blocks downtown and even there you won’t find much. It’s mostly just to walk or bike or scooter and admire the view. ",
  "The tampa riverwalk is very nice. The boardwalk is good and its a nice place for people to spend time with family and just have a nice relaxing afternoon or evening.\nViews of the river are ok, the walk is good exercise.",
  "This has got to be one of the most beautiful River Walks in the country!  I just love the walk and the view of downtown Tampa.",
  "Like to walk around there at night and see the lights of the city. Good eating places in the area. Nice Adirondack chair to relax in!",
  "We loved walking the Riverwalk after our meal in Tampa, the views were awesome, the vendors were awesome and the setting was perfect!!!  I f I lived or worked in Tampa, I would be a regular there!!!"
 ]
},{
 "name": "ZooTampa at Lowry Park",
 "address": "1101 W Sligh Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/8d/f0/aa/zootampa-at-lowry-park.jpg",
 "tags": [
  "family",
  "kids",
  "unique",
  "experience",
  "family",
  "kids",
  "free",
  "family",
  "cheap",
  "free",
  "kids",
  "food",
  "free",
  "kids",
  "food",
  "kids",
  "interactive",
  "knowledgeable"
 ],
 "website": "http://www.zootampa.org",
 "source": "TripAdvisor",
 "reviews": [
  "Nestled in the lush vegetation of Lowry Park in Tampa, FL is a most wonderful zoo experience for the family. The Tampa Zoo is a world class facility filled with engaging and unique exhibits of animals from around the world. The park is clean, well maintained and staffed by some of the most friendly and well trained people you will encounter anywhere. The African Exhibit tram in particular is well worth the ride. Our tour guide Betsy provided an entertaining and fact-filled narrative while we enjoyed an up-close encounter with rhinos, giraffes, antelopes, elephants and monkeys.\n\nThe zoo provides many opportunities for special animal encounters and hosts a variety of programs for children including zoo camps, sleepovers, zoo school and arts & crafts. The zoo's kids zone is well designed with kid-friendly exhibits and play areas to keep the little ones entertained. And the zoo's on-site animal hospital keeps the residents healthy while working to promote the zoo's breeding programs and sustainability initiatives. \n\nAn all around great day with the family at a first-class attraction. Enjoy.",
  "Very nice Zoo with lots of play areas for kids (some wet, so bring a bathing suit for them), petting zoo, places to eat, gift shop and, of course, a great variety of animals. Nice day for a family outing.",
  "If you're looking for something fun and easy with the whole family this is the place to go!  Spend a leisurely afternoon walking around meeting all the animals, feeding the giraffes and going on a cool safari ride.  There's nothing fancy about this zoo, but they've been around forever and they know what they are doing.  Plus you get to enjoy a few free rides perfect for the little ones and on a hot summer day you can bring the kid's swimsuit and have them play in the splash pad for hours, while you enjoy a giant ice cream cone!  Everything is good, fun, easy and cheap here!  Enjoy!",
  "I've been to the Lowry Park many times over the years.  This place is great for seeing animals in as natural of a habitat as possible.  The Manatee exhibit is really special.  The layout is nice and it's great visit during the weekday.  Weekends can be crowded, so go early is you can.  Parking is free.   Hot days, make sure your kids wear their swimsuits, the fountains beyond the entrance are great for cooling-off.  \nMy favorites are - Tigers, Otters, Orangutans, Gibbons, Lemurs (feeding time is great), Chimpanzees, Tapirs, Florida Panther and of course the Manatees.  If you are lucky to be there for Alligator feeding time, it great, otherwise pretty boring bunch.",
  "I went with a friend and her daughter during my spring break and all the animals were out! We had a great afternoon in the Africa and Asia sections. We rode on the little tram in the back and saw the baby rhino playing in the mud. March is a great month to go because it's not too hot so the animals are playful. Be careful to check spring break schedules so it's not too busy. Check out the pygmy hippo napping under the water.",
  "Moved to the Tampa area in September 2017 and finally visited the zoo with my grandkids in March 2019. Plan for a full day of things to see and do. \n\nAlthough it doesn't apply to Veterans (which I personally feel it should), if you are Active Duty, Reservist or Guard your admission is free with proper ID. \n\nThe price to get into the park depends on whether you do a package or not but single ticket pricing at the gate is around $37 per person. This is what they are calling the 'Pay for a Day' ticket where you buy your ticket and then you can revisit anytime for the remainder of the year (at least for 2019) as long as you have your original entry ticket. \n\nWe started our day in the 'Asia' area where we visited the Clouded Leopard, Tapir, Gharial Crocodile, Sloth Bear, Malayan Tiger, Komodo Dragon, and Lorikeet displays.\nNext we headed to the 'Primates' area where we visited the Chimpanzee, Orangutan Siamang, Colobus, Guenon, and Mandrill displays. The Orangutan display was drawing a crowd because there were several babies that were out enjoying the day.\nNext we headed to the 'Africa' area where we visited the African Penguin, Nyala, Giant Tortoise, Zebra, Giraffe, Elephant, Rhino, Painted Dog, Pygmy Hippo, Meerkat, and Okapi displays. This is also the area where you can take part in 'Expedition Africa' which is a 30 min guided tour where you ride around in oversized multi-seat golf cart. \nNext we headed to the 'Florida' area where we visited the Key Deer, Black Bear, Flamingo, Panther, Alligator, River Otter, Various Snakes, Bald Eagle, Red Wolf, Stingray, and Manatee displays. They reopened the newly renovated Manatee Center the day that we visited so we were able to see them from the underwater viewing windows. This allows you to have an up close view of these gentle giants for sure. The Bald Eagle display was impressive for sure. The Eagles were in an open display and pretty much down at ground level. So you could really enjoy their beauty. The Stingray display was entertaining for both young and old. They have time during the day where you are allowed to feed them if you purchase the food ($5) from the gift shop. The day that we visited, there was a young Stingray that was about 10-12 inches in size that was going to be sent to another zoo soon.\nOnce we visited all of the displays, we then let the grandkids enjoy the additional free amenities that the zoo had to offer. They have Roaring Springs in the 'Florida' area. For the older timers like me, this is an updated version of the old Log Flume ride where you end up getting soaked. From there we headed to the 'Wallaroo' area where they have a Petting Zoo, Bats, Emu, a Mini Coaster, a Train ride, and several other rides that are all free to enjoy. They also have a Water Play area that is basically a splash pad area so bring dry clothes for your kids to change into if you wait until the end to let them get wet.",
  "This place will leave you completely stunned if you are a nature lover and this place is definitely very popular among the locals",
  "My wife and I enjoy visiting Zoos so we were looking forward to visiting ZooTampa while vacationing in the area. There was a nice selection of animals but the layout was a little confusing but we managed.There was a small playground and some rides for kids but most of them were closed for repairs. I'm sure a lot of kids would be disappointed. We did not feel the food selection was very good either. On a positive note, the zoo was clean and the animals appeared to be well cared for. It must be a lot of work caring for animals and maintaining a zoo so supporting them is a must and maybe we visited at the wrong time.",
  "The line was long to get in but we had a good time.  Decent burgers too.  The interactive dinosaur attraction was fun.  I thought there was a good variety of animals and the zoo was quite clean.  Seemed that there were alot of benches to sit on as well.",
  "Such a great facility, happy animals and staff. I went here as a child and it’s even better now than I had remembered",
  "Fabulous!!!! Everything was amazing!  It was very reasonably priced and there was something for every age.  It was very clean and the staff was amazing.  They were very friendly to the visitors and were highly knowledgeable about the animals and loved to interact with the visitors as much as they did the animals.  Would highly recommend going.  I haven't been to a place that I loved as much as this in a very long time."
 ]
},{
 "name": "The Florida Aquarium",
 "address": "701 Channelside Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/72/c3/9d/the-florida-aquarium.jpg",
 "tags": [
  "family",
  "family",
  "walk",
  "food",
  "experience"
 ],
 "website": "http://www.flaquarium.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Florida Aquarium in Tampa is a world class facility and is a fun, relaxing day for the entire family.  This attraction can be a day in itself or you can visit other near by museums and fun spots.  It's also great for anyone who loves both fresh water and salt water marine life or outdoor enthusiasts.  I've been many times and the atmosphere is spacious, interesting and unhurried.  There are plenty of kid friendly exhibits, such as sting ray petting, star fish hands on, and best of all a large splash pad overlooking the Port of Tampa.  Other exhibits include Florida wetlands with alligators,ducks, otters and turtles, Florida coral reefs, Marine tank with sharks and a manatee area.  Actually, there are too many awesome exhibits to list, but one of my favorites is the fascinating leafy and weedy sea horses.  There is a cafe on site, or Mexican, seafood, steak and ice cream next door at a shopping and dining venue catering to tourists.  Next to the Aquarium is a Navy battle ship museum.  A boat cruise and dolphin excursion can also be booked at the aquarium.  This venue basically shares space with the cruise ship port, and the big boats are just feet away.  You could easily move on to the the area beaches, shopping malls or the dining and shopping in nearby Ybor City - an old Cuban area famous for its culture, restaurants and cigars.  The aquaruim admission is fairly inexpensive at about $22, however, consider an annual pass with many benefits. If you plan ahead you may be able to take advantage of a sleep over or diving with the sharks.  I truly love this place and visit several times a year. It seems to be a well kept secret.  The Aquarium is on the East side of Tampa, about a one hour drive from Orlando on I-4. Enjoy!",
  "...We enjoyed the Aquarium very much they have a wonderful array of sea life and many species of of fish,underwater plant life...It was a great family day,and was a very economically priced day..We would recommend this for any family outing,or class trip.",
  "My husband & I really enjoyed our day visiting Tampa Aquarium. We've been to lots of Aquariums around the world & we consider this one of the best. There was a lot to see and the exhibits were well planned and the layout was good. We also loved the \nDolphin Cruise which took us out into the Bay and the narrator was great and we did see dolphins which was fantastic.",
  "We had to walk around this place a few times to try to get our $$ worth.  The seahorses were neat.  Food was slightly below average.  I thought it was a bit too pricey for what we got.",
  "It is a very nice aquarium, but have seen better in Atlanta, New Orleans, Monterey, CA and Chicago. It's very kid friendly and has a neat outdoor water playground.  \nNice cafe with good food and decent prices.\nThe parking lot was already full, so we had to park in a garage 3 blocks away......and this was on a weekday in early March.",
  "Was a great way to spend an afternoon.  There was lots to see and experience.  We especially liked how upclose and personal that you could get with all of the creatures, especially in the area where the birds are flying and the turtles are right in front of you.  They even had a somewhat of an adult area where you could sit outside and enjoy a nice cool beverage with great seating.",
  "The overall aquarium was great - but as far as a very nice place for handicap access is not great.  I wasn't able to access a certain area that was a view of the aquarium looking down.  So as long as you are able to climb up the steps you can get a 100% of all views.  But since I wasn't I couldn't see what I was missing. ",
  "Enjoyed our time at the aquarium. Takes about 45 min to go through if you don't do any extras. It's a small place. Pretty expensive for what they offer. Just hoping it goes more towards the upkeep and feeding of the animals. \nNice to get out of the heat and enjoy the air conditioning. The port of tampa is right next door too. \nThey have a gift shop. Decent prices there.\nElevators to get to the second floor if you need to use them. Tons of handicap parking if you need it."
 ]
},{
 "name": "Busch Gardens",
 "address": "10165 N McKinley Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/4e/2d/12/rollercoaster.jpg",
 "tags": [
  "experience",
  "food",
  "family",
  "walk",
  "experience",
  "free",
  "kids",
  "experience",
  "food",
  "family",
  "drink",
  "run",
  "educational",
  "kids",
  "run",
  "food",
  "family",
  "experience",
  "food",
  "food",
  "kids",
  "walk",
  "active"
 ],
 "website": "http://buschgardens.com/tampa",
 "source": "TripAdvisor",
 "reviews": [
  "There really is something for everyone here. Roller Coasters, Water rides, Sky ride, Children's rides, Train Ride, Animal Show, Skating show, Animal exhibits, Cheetah Run experience plus a chance to feed birds and kangaroos. Educational as well as being fun and never a dull moment to be sure.",
  "We visited Busch Gardens on our recent holiday to Orlando, we made the trip down in 2015 and it was well worth the hour drive down to Tampa. The theme park offers excellent rides for all ages and some outstanding roller coasters with the likes of Sheikra, Montu, Cheetah Hunt, Kumba & Falcons Fury leading the way as well as the new option Cobra's Curse which is a Family coaster which offers something a little different. \n\nThe big rides are great for thrill seekers and offer some of the best rides in Florida all in one park. The site is a good size but a great experience from arrival with parking and transfer to the entrance to all rides, food and amenities. The other rides which are suitable for the whole family are also very good and give a variety of different experiences. \n\nLoved Sheikra, Cheetah Hunt and Falcons Fury again and pleasantly surprised by the new Cobra's curse, though it was going to me more tame than it was but it was a great coaster. \n\nThe time of year we went to the park mid Feb, was before the school holidays in England and as such queuing was great, most rides were around 10-15 mins max, some slightly longer but that is to be expected in all theme parks. Later in the day you can walk on to rides of your choice as the park gets quieter.\n\nOne issue we did have was finding the park and then getting back to I4 afterwards to head back to Orlando, not sure whet here sign posting could be a bit better for tourists. However we eventually found our required destinations and didn't waste too much time driving about.\n\nOur little boy lost his glasses while we were in the park, which we were gutted about as they were his constant use ones. We reported to a friendly officer in the 'lost & found' section of the park, but resigned ourselves to the fact that we wouldn't see them again, entirely our fault. HOWEVER just after arrival back at home a parcel arrived posted at cost to Busch Gardens with our sons glasses within! Outstanding customer service and something for which we are extremely grateful. Although we did have a spare set with us on the holiday we were going to have to purchase another pair until we received these. Thank you Busch Gardens!\n\nIn summary a great day out but watch out for the river Rapids, you will more than likely get very wet! Probably best to pack a second set of clothes! Or you can just dry in the Florida heat like we did.",
  "Something for everyone at BG!  The park is small enough to be manageable in a day trip but packed with so much that you will keep coming back to experience it all.  From amazing heart stopping vertical drop thrill rides (Sheikra, Falcon's Fury) to awesome roller coasters (Montu is my favorite) and the necessary water rides to cool off, and a great kids ride area, there really is something for everyone.\n\nOne of my favorite things to do at BG is the Serengeti Railway which is a cool old steam train that circles the park and goes through the Serengeti range where lots of African animals roam free.  Not to miss is the extra cost Serengeti Safari where you ride in an open air truck and meet giraffes up close and personal!   There are plenty of animal viewing opportunities though out the park, so just stroll around Myombi Gorilla reserve, or the Edge of Africa.\n\nThere are plenty of great shows as well as concerts, special events - Howl-O-Scream is amazing!   Check their website for the upcoming concerts and New Years Even and Christmas Town is so much fun (wish my kids were still little).\n\nMy kids and I have been coming here for many years and we are annual pass holders so you can just come for the shows, or come to see the animals. Now that my kids are grown, they have their own passes and we try to meet there for special events to see what's new and tell stories of all our fun times.  Our most recent was Saturday Oct 29 at Howl-O-Scream, where we had lots of screams and smiles. \n\nBG is one of the most wonderful parks you can go to - and still reasonably priced - And you get the buy a day, play all year option, so if you live close, you can enjoy BG all year long!!\n\nI love it.  My kids love it.  You'll love it.",
  "Upgrade to the speed pass or whatever it is called because it is so worth it!!!! We had a blast!!! Wear comfortable shoes and take extra clothes or wear appropriate water gear if you plan on getting on the rapid water ride thing.  The quality of the rollercoaster pictures were a bit disappointing, especially when technology is so advanced now.  We still purchased them because they were toooo funny to pass on.  The all day dining plan isnt bad either... we snacked most of the day. ",
  "Visited Busch Gardens late March our first attempt was scuppered half way there due to a storm and lightining so we turned around as a local in the rest stop advised us they closed all the rides in rain and lightning storms. We purchased the 3 for two Busch Gardens, Seaworld and Aquatica tickets online giving you ( 14 day or length of stay) access to the 3 parks. Although they search you on entry for food ect, saw the locals going back to their cars for a picnic. Food and drink can be expensive with a family, a coke is over double the price to outside, a hot dog $8 , where you can get 2 hotdogs and a drink for $5 at Mac Donalds.  We bought the all you can eat tickets which were good value for a full day at $32, the steakhouse was the best restaurant we used, and unlimited drinks although the queues for food and drink can be quite long.   I found  the train was not running till 2016 while they add a new attraction. So been disabled  did not do as much as I could have as getting around the park took much longer and the sky ride queue was quite long at times also.  I did not go on many rides but my wife and son did all but one  ride ( Falcons Fury) and  really enjoyed them, we went straight to the back of the park and worked our way back to the entrance, we found this better as the queues were smaller due to people comming in the gate and starting on the rides immediately through the gate, by the time we got to the cheetah run the queues had gone down to 5 min from an hour.  There are many animals to see rhino, kangaroo, lions, crocodiles, elephants, tigers, hippos, ect. This was in our opinion the best park out of the three we visited and worth the drive. Although you have to pay for parking $17 per day they will let you park in the disabled bays with a UK Blue badge, just ask for disabled on entry and they place a disabled ticket on your screen. Take a waterproof of some kind as you will get wet on three of the water rides. Lockers are available near most rides at a cost of 50 cents which you place in locker, compared to Aquatica which are $7 a day with a refundable deposit of $10 for a small locker. Have been to better cheaper parks elsewhere and you pay for the Disney Brand.",
  "Ok, you can go to a roller coaster park, i.e. six flags, cedar point but this comes with  more of a carnival atmosphere which is sometimes not condusive to a family atmosphere. We were at Busch Gardens over spring break on a Thursday. We stayed at the Holiday Inn Express a couple of blocks away. We had bought tickets ahead of time along with the unlimited fast pass, plus the Serengati tour ride. We had to cram all of this into one day mom, dad and two almost teenagers. We chose to eat on the run due to this. Our lunch consisted of ice cream bars, pretzels and popcorn. We did buy 2 fill up your drinks at any time unlimited cups for 11 each. I would recommend this last part as the hot day melted the ice and the kids were thirsty, a great value. Who cares about eating healthy we are on vacation and we did not want to have a sit down as this wasted precious time, let alone all decent food lines were jammed. The place was not terribly busy considering it was spring break. The shuttle dropped us off at 9 15 directly in front of the joint. We preceeded to the ticket counter, they helped us within ten minutes, got our passes etc. We then went to the ticket taker place. They opened this area up at 9 45. Then we waited in the market place til ten when they opened that up. The crowd made a mad dash to the cheetah Hunt coaster. This was no problem for us as we had the fast pass unlimited. I would definetly recommend starting in back and working forward as the front did fill up faster in the morning.  We bypassed everybody and were two couples deep before getting on the coaster. So don't be fooled on the fast pass, you did get to cut in front of everybody just not directly in the front of the line. Other people had fast passes as well and you had to line up within the entry bars just before entering on the coaters. By noon this was money well spent as the rest of the day was hot and a minimum of 45 minute wait going thru the mouse maze. Our wait at most was 10 minutes, so it was way more than worth it. If you love coasters I would buy the unlimited if not then don't, but be prepared to wait. The fast pass does not work on the Sky Ride, that was a 30-45 minute wait. The atmosphere is great for family as the keepers explain everything very educational vs. the carnival atmosphere. There is a kid area( less than ten years old) that will keep them occupied as well. The coasters are unlike anything that you have been on, it was a thrill , my kids will never forget it. But also the little things such as feeding the giraffes and the kangaroos, they loved this more than the coasters. You will get wet on the River Rapids and Tidal Wave. We wore our swim suits all day knowing this ahead of time. We road these in the afternoon when it was really hot and dried off quickly. They had dryers that you stand in for $5, no thank you. You will need lockers if you carry stuff, camera, phones, money, CCards etc. These are 50 cents a pop, they don't allow bags on any coasters. We were able to see the whole park, but another day would have been great. I should have bought the \"buy one day, the second day another 20 bucks\" in order not to be rushed, keep that in mind. When the dust settled with all the ticket purchases, food, carnival games we were out 900 for 9 hours. 100 dollars an hour.  The kids do want to come back, so there you go.",
  "A friend and I visited here just before the coronavirus caused things to shut down.  I have always enjoyed this park.  It was very clean, and the employees were very friendly.  The rides were in excellent condition.  This is a must do attraction when visiting in Florida.",
  "If you enjoy roller coasters, simulators, nature and beautiful landscapes, you should definitely visit Orlando. \n It's full of amusement parks but my favourite is \"Busch Gardens Tampa Bay\" there you have a lot of things to do. \nIn my opinion, Tickets are too expensive and you spend a lot of time doing queue but it worth it. It would definitely be the best park in Florida if they had a fast pass.\nThere are rollercoasters like \"Sheikra\", where you can watch the park suspended in the air or you can take a tour of the rivers of huge jungle. Finally, At night there's a fireworks show. It has a diversity of activities for all people.\nI recommend visiting in summer and\nIf you want to visit more parks, go to Disney’s Animal Kingdom, Epcot, Universal, and Magic Kingdom.\nI went with my friends and it was the best experience of my life.",
  "First time visiting this park was shortly after relocating to Florida. Since I've visited  both locations Williamsburg, and now Tampa. Williamsburg will \"always\" be my favorite especially during Halloween. The set up was pretty nice, but during that time its Florida so it was humid. They had 5 houses, which had various themes and of course the actors that try to scare you but can't touch you. The overall question would I attend again, no. They get a B+. ",
  "We have annual passes for Busch Gardens and Seaworld.  Busch Gardens has a great train ride around the park and good eats. If you spend all day you can either bring a back pack full of snacks or the food pass is worth it. No crazy lines and an animal lovers heaven.",
  "You have to drive through what looks like an industrial area to get to the park.  There are two parking areas - one that is close to the entrance (for extra $$) and a further one which requires a long walk or a tram ride.  The park is divided into themed areas (you'll see the Egyptian-themed area from the entrance).  There is a ton of things to see and do here, we actually didn't get to everything.  During our visit in November, they had Holiday decor throughout the park and lots of photo-ops.  The refillable mug is a good option but the process is a little inefficient - you have to have the worker scan your mug before you can use the soda machine (so they can ensure it's active I guess).  The zoo portions are well landscaped and natural looking.  At the time of our visit, they had a baby orangutan on view.  The indoor food court was so crowded and had limited seating options (mostly communal tables) but they did have a nice musical show to entertain us during our meal.  There are rides for all different ages.  The Tiger Viewing area was fun (your head pops up inside the Tiger's exhibit and we were lucky the Tiger was laying on top of it).  Young kids will really enjoy the playground area (the nearby restrooms were clean) and the Sesame Street areas.  If you come during the holiday, they offer food/drink tastings ($$) and lots of photo props.\n14 year old - Enjoyed the rides\n10 year old - Enjoyed the rides and zoo animals\n5 year old - Enjoyed the zoo animals and playground"
 ]
},{
 "name": "Lettuce Lake Regional Park",
 "address": "6920 E Fletcher Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/76/8d/0a/lettuce-lake-park.jpg",
 "tags": [
  "walk",
  "family",
  "walk",
  "energy",
  "run",
  "hike"
 ],
 "website": "http://hillsboroughcounty.org/Facilities/Facility/Details/7937",
 "source": "TripAdvisor",
 "reviews": [
  "Tranquil park with good nature views, photo-ops. Boardwalk provides easy walking/viewing and observation tower offers a good climb rewarded with long-distance views. ",
  "Loved the board walk and opportunity to see nature up close. Gators, birds, tree rats and lots of other fun things to see. So amazing.",
  "Nice trails, can ride bikes, picnic here and just enjoy nature.  Have climbup areas, view the water, from up high.",
  "Beautiful walk on wonderful boardwalk on a sunny day.  We saw a lot of wildlife, much more than on a cloudy day as I was told by someone that lives in Tampa.  Great place to spend a day with family.",
  "Lettuce Lake Regional Park is a great way to immerse yourself in nature without leaving the city.  The boardwalk winds through the wetlands with views of the lake.  A great variety of birds.  The observation tower gave us beautiful views of the lake.  We saw alligators swimming and heard owls talking to one another.  The playground is a perfect place to let the littles run off some energy.   The nature center has an informative displays and clean restrooms.   Pack a lunch and spend the day!!!  Kayaks and canoes are available to rent but did I mention the alligators??",
  "this is a very beautiful park, nature center has a lot of info. we enjoyed the boardwalk, and saw a lot of wildlife.a place not to miss.",
  "We spent the entire day here. We enjoyed the massive boardwalk which traverses marshlands and areas adjacent to ponds. We spotted numerous birds and spotted a few varieties of fish and other aquatic lifeforms. The boardwalk and park in general are very well maintained. We took a short hike on the trails which go through wooded areas as well as wet lands.  We had a very nice day here.",
  "See what old Florida was like from the comfort of a boardwalk. Nice park on a cool day but would not recommend in the Summer heat."
 ]
},{
 "name": "Ybor City",
 "address": "Northeast of the Downtown Tampa on I-4 at Exit 1",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6a/ca/6e/ybor-city.jpg",
 "tags": [
  "food",
  "family",
  "historic",
  "walk",
  "historic",
  "active",
  "delicious",
  "free",
  "walk"
 ],
 "website": "http://ybor.org",
 "source": "TripAdvisor",
 "reviews": [
  "Went to Ybor with friends after Gasparilla.  Fun experience...did some bar hopping, ate at one of the restaurants, walked the streets with the pirate crowd!  Good time!",
  "It may seem like I left the country, but nope- this is Florida. Founded in 1905, the original family owned Columbia Restaurant, located in the historic Ybor City neighborhood in Tampa, Florida, is the oldest and one of the biggest Spanish/Cuban restaurants in the country with 1,700 seats in 15 dining rooms. It actually takes up an entire city block and it’s rather impressive to walk by. better yet, get in there and try the food- like the El Combo de Cuba.",
  "There are some really good places on the main street. Wine bar, cigar shop, night clubs, restaurants. ",
  "Ybor City is one of the oldest parts of Tampa.  It had several resurgencies over the decades and changed theme's many times. Currently its a good place to visit during the day and see all the different shoppes and restaurants. It does have the usual restaurant/entertainment \"Mall\" down there. At night it's very party and cocktails. Parking is okay, not much security in the outlying parking lots which are dimly lit, so always go with a group. They're trying to lure the Tampa Bay Rays baseball team to build there, we'll see!",
  "We have gone to Ybor during the day time.  There are lots of shops and restaurants within the historic district, a good place to go if you want to try some Cuban coffee or pressed Cuban sandwich. Parking can get congested (more in evening)-- bring quarters for the meters.  ",
  "Ybor City was very quite when we arrived around 3 p.m. on a Tuesday. We strolled the streets, shops, and restaurants. The Cuban coffee at one of the Cuban Cigar stores(Tabanero) was delicious. We were able to watch the employees roll the cigars with a blend of tobacco leaves. It is clearly an evening town when the restaurants and night clubs become more active. Also, avoid Mondays and Tuesdays as a lot of shops are closed.",
  "we visited ybor city on Saturday in the morning and for some time in the evening too.\nFriendly place with small restaurants. Streetcar to the city from downtown is free.\n\nYbor city is a nice area to go for a walk or stroll. Reminder of olden style town streets.\nThey have a saturday morning market which is a good place to find nice gifts/souvenirs and spend a relaxed afternoon",
  "We spent a Saturday morning browsing the market.  A nice variety of vendors.  We loved seeing the chickens wondering around.  Every downtown should adopt some!  Walked one of the main streets and stopped for lunch at Stone Soup.  It was amazing!!  Ybor is already on my list to visit again on my next trip to Tampa!",
  "Ybor City is a very friendly place with many stores, restaurants and bars. Many Cuban type restaurants. Plenty of parking areas for you along with public transportation.",
  "This place is like a bit of Cuba and New Orleans. I heard it was a bit rough before but we went in the late afternoon and everything was fine.  Great places to get some fresh rolled cigars.",
  "A little disappointed that it is basically bars and restaurants—with an emphasis on bars. But lunch at the Columbia is not to be missed!"
 ]
},{
 "name": "Bayshore Boulevard",
 "address": "312 Bayshore Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/3b/74/17/photo1jpg.jpg",
 "tags": [
  "walk",
  "run",
  "walk",
  "jog",
  "run",
  "walk",
  "peaceful",
  "run",
  "walk",
  "walk",
  "run",
  "low",
  "walk",
  "run"
 ],
 "website": "http://www.tampagov.net/parks-and-recreation/programs/parks-and-facilities/greenways-and-trails/trail-maps/bayshore-trail",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to walk run or bike right along the water, some really interesting homes with lots of character along the ride. Also may high rises as well. ",
  "Access by driving and viewing is much safer and easier than trying to park and to visit. Don't park on the drive itself, but use the side streets that dead end into it. Best panoramic view is from Ballast Point Park beyond the south end of the drive (go south of Gandy Blvd.), and from there you can see the entire Bayshore Blvd and downtown skyline of Tampa.",
  "Bike, run, jog, or take a leisurely walk along Bayshore Boulevard and Tampa's Linear Park.  Exercise stations are dotted along the way.  Sit along the shore and watch sailboats racing off Davis Island, dolphins, rays, and the occasional manatee.  Where Bayshore Boulevard is four lanes and divided by Tampa's Linear Park, it is well lit.  But that doesn't stop you from looking skyward.  Some nights you can see the International Space Station flying silently horizon to horizon.  Bayshore Boulevard is host to charity walks,  runs, and the famous Gasparilla Parade.  There's always something happening on Bayshore Boulevard.        ",
  "Its four miles of sidewalk to job, walk or bike.  Great scenery. Beautiful sunshine.  Skip it if its raining or just wait 20 minutes and the sun will come out again.",
  "Now too crowded most times to enjoy.  Go early morning weekdays if you want to enjoy it, you may hear and see dolphins feeding here. -- Crossing Bayshore blvd. can be treacherous be careful...",
  "Bayshore Blvd is the perfect place to take a good run, or a leisurely ride on your bike. It is very peaceful along the bay and there are usually great people watching. During peak times watch out for serious runners and bikers as they can sometimes crowd the sidewalk. ",
  "Great walk to see the views of the waterfront of Tampa.\nIt is similar to waterfront views of other cities. If your already in the area, it is worth spending some time to just enjoy the fresh air and water views.\n\nThe area was busy and everyone was having a nice stroll out. Nice place to spend some time, to enjoy the sunny weather and just have a relaxed afternoon.",
  "Bayshore Boulevard is a very nice street to see Tampa Bay. The speed limit is 35 so keep your speed down as the Tampa Police patrol this area. You can walk, roller blade, run or bike along this roadway.",
  "A beautiful promenade that allows you to make walks on foot, by bicycle or on skates. It is located a short distance from downtown and allows you to spend a few hours of relaxation. The only problem is the continuous passage of the machines in the parallel road which creates a lot of noise. I am a travel agent with a group for a tour.",
  "I've read somewhere this is the longest seaside boulevard in the world. Didn't really measure it, but it was a long, very long drive passing by beautiful homes and gardens on one side and Tampa Bay on the other.\nThere's a walking, jogging and cycling path just by the shore, but I didn't see many using it, probably because it was almost noon on Florida sun.\nIt was great cruising the blvd at low speed with AC on and great music admiring the surroundings.",
  "Take a walk, allegedly on the longest sidewalk in the world (who is going to challenge that?)..... 10 feet wide and 4.5 MILES LONG. Benches, scenic views, photo opportunities and water. Take a run. Bring a towel and get some sun. Breathe the air. Say hello to someone you don't know. That someone might be the person you'll spend the rest of your life with. \n\nTampa... you've created a beautiful thing....\n\nBy the way, the Bayshore Boulevard and long sidewalk is not the Tampa Riverwalk... which is a horse of a different color, a separate and distinct entity."
 ]
},{
 "name": "Amalie Arena",
 "address": "401 Channelside Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/73/43/69/st-pete-times-forum-i.jpg",
 "tags": [
  "drink",
  "walk",
  "food",
  "drink",
  "experience",
  "food",
  "walk",
  "low",
  "food",
  "experience"
 ],
 "website": "http://www.tampabaytimesforum.com/",
 "source": "TripAdvisor",
 "reviews": [
  "We traveled to Tampa in January to see the Pittsburgh Penguins vs. the Tampa Bay Lightning. It was our first trip to the area, and we were excited to visit a warm-weather team. \n\nThe atmosphere and area around the arena was lovely. Places to eat and drink, the Riverwalk, and Channelside are all right there.  If you go to a game, stay at the Tampa Marriott Waterside (right next to the arena) or the Westin Harbor Island (a short walk). Get to the game early so you can enjoy all of the festivities outside the arena.  \n\nWe parked in the lot right across from the Florida Aquarium.  It was a 2 block walk to the game, and we had no problems getting out after the game.\n\nOur seats were in the nosebleed section (319, row S - the VERY TOP) but the view was great.  Honestly, with the size of that jumbotron, there is not a bad seat in the arena.  We liked our section because we could see the organ, but we weren't too close.  \n\nMy only complaint about the arena is the Tampa Bay fans don't seem to know hockey etiquette.  They get up and down while the puck is in play!!  We were screaming constantly for people to sit down, but they don't seem to know this rule in Florida (and the ushers didn't seem to care).  We had a similar problem in Sunrise, when we went to see the Florida Panthers a few years back.  \n\nOverall, a great time.  Hockey fans - this venue is not to be missed. Lots to do nearby.",
  "I went to the Amalie Arena for a Lightning hockey game.  It was an awesome experience, if you haven't been to one go.  The arena is beautiful really clean corridors and bathrooms. The smell of food from the concessions stands flows. The home teams fans exploding in euphoria when they score.  Its a sensory overload but in a pleasant one. The arena is used for concerts and other events so always keep that in mind. Also check the Lightning schedule for home games. The front entrance area has an amazing lightning bolt landmark. There is plenty of parking nearby as well as the Channel Side so you can with friends and get a drink or eat before the game, the concessions make good food but pricy. Overall it's a great hockey arena fun for families and fans, so check the schedule get your tix and root for the bolts.",
  "We go there to see Tampa Lighting play and then we have arena football team that play's there. We have gone to some concerts there also. We have always enjoyed this place and how big it is. Parking can sometimes be a problem because it cost so much to park down town at this place.",
  "My wife and I are Andre Rieu fans and have seen his show a few times at other venues.  We purchased parking at the Arena in advance via Park Whiz for $16.14, which turned out to be a good choice as we were able to park adjacent to the Arena and walk right into the venue without crossing streets or going a long distance.  (Be sure to have your proof of purchase handy as you are asked to show it prior to entering the parking structure.)  Getting into the Arena parking was a nightmare due to heavy construction taking place all around that part of town and due to various police and other personnel that had lanes blocked without signage and which were giving rather confusing and conflicting directions.  Give yourself plenty of time to drive to the venue as the traffic in the Tampa area was very heavy on the way to and all around the Arena.  If you need to eat prior to your event, there is the Firestick Grill inside the Arena that you must pay for and reserve in advance.  However, at $60 a head for a fine dining buffet, I recommend dining elsewhere unless you want to splurge for a special event.  (The food and service were excellent.  There is also a Cigar City Brewing restaurant adjacent to the Arena on the west side that may be a better option but I recommend reservations if possible as they get packed.)  The Arena is a nice venue however, you may or may not be happy with your seating if you are attending a concert.  For our concert, we were seated on the main floor and it was difficult to see the people on the stage at times due to others seated directly in front of us on the same level flooring (and of course with their damn cell phones rudely raised above their heads taking video so no one behind them could see.)  So, if you are attending a concert, you may want to explore getting a seat near the front but off to the upper right or left side of the stage so you are seated above the floor and the seating is inclined so your view is not obstructed as much.  They have large screens so you can see some of what is taking place on stage close up and the sound system was very good with no feedback or problems noticed.  I would recommend this venue for a concert however, I highly recommend you do your research in advance so you have the least amount of issues possible getting into and out of the area.",
  "This is an awesome place for concert venue. The place was packed but did not feel crowded. The staff was amazing!!",
  "Easy in and Easy out this Arena has all the amenities and plenty to keep you entertained close by!\nWe have always had a great time when ever we have attended an event.",
  "While security is always important the arena MUST do better with their screening. Only about 10,000 were at this event, doors opened early, (someone made a good call), yet the show was delayed with hundreds waiting outside to be screened. Our scanner was set so low, the person manning it called a supervisor because EVERYONE was setting it off. I had only a dress belt with small buckle and my wife only undergarments and we both set it off. It was so ridiculous the security person with the wand told us to go ahead without further checking. At our doors, one of many entry points 90 minutes after opening hundreds were still in line at our door alone. The arena needs to get way better at making the event secure in a much more efficient manner. You pay a lot and deserve to see the full show and not be so inconvenienced. This wasn’t the first time the arena was doing this and to be so poor at doing it was inexcusable. Be the first in line or take your chances.",
  "First time at the arena and had a very good experience.  Sound system was terrific, seating was great (we had floor seats), and enjoyed a snack and drinks before show at the various stands.  The cuban sandwich was terrific.  Prices for drinks and food were super expensive.  "
 ]
},{
 "name": "TECO Line Streetcar System",
 "address": "1201 E 7th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/07/a6/03/teco-line-streetcar-system.jpg",
 "tags": [
  "free",
  "walk",
  "free",
  "family",
  "free",
  "free"
 ],
 "website": "http://www.tecolinestreetcar.org",
 "source": "TripAdvisor",
 "reviews": [
  "Currently free-- very easy to use. Only wish is that it extended up Franklin Street to the Armature Works. ",
  "This old fashion trolley was a delight to ride in Takes you from Whiting Ave to Ybor City going past stops to the Riverwalk, Amelia Arena, Port Authority to Ybor Great way to see a bit of the downtown area and wish we had this to get to our hockey arena We were there on the infamous day when all of Tampa port was closed so it was packed However people were very friendly and provided a great way to spend some hours By the way it is now FREE to ride on and you can't beat that It is a definite must do especially if you are going to Ybor City",
  "I got to channelside a lot to walk and event there I park in Ybor City and take the trolle parking in Ybor is a lot less then channelside and is a great ride ",
  "Excellent transportation to connect visitors between Ybor city and Downtown Tampa. It does go through the central points in between to have people see different areas and get to enjoy Tampa without having to drive.\n\nThe streetcar is free and is a great way to spend a day between ybor city, downtown tampa, go along tampa riverwalk and overall spend a relaxed day in Tampa.",
  "The TECO Line Streetcar System is a great way to explore all the attractions in and around the city of Tampa. It is great way to move the family around town.",
  "Plenty of stops in downtown and Ybor City. The streetcars are currently free and require no ticket - just hop and off. They have a lot of character and are easy to navigate.",
  "Thanks Jay! We appreciate you taking us two stops so we could say \"we rode the trolley\", an not letting us go all the way to YBOR.  :) ",
  "It was quite thrilling riding a streetcar.  When I was a kid, I could still see the rails that the car rode on.  It is a pleasant trip to ride and look out the window...for free I might add!  Nice touch TECO.  Thanks for the ride!"
 ]
},{
 "name": "Glazer Children's Museum",
 "address": "110 W Gasparilla Plz",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/57/41/82/glazer-children-s-museum.jpg",
 "tags": [
  "kids",
  "learn",
  "free",
  "kids",
  "educational",
  "experience",
  "kids",
  "kids"
 ],
 "website": "http://www.glazermuseum.org",
 "source": "TripAdvisor",
 "reviews": [
  "Great place for kids to explore, create, and learn.  It fits kids under 12 years and have designated toddler zones so babies and small children can explore without big kids in the way.   Lots of fun!",
  "Our Grand Children LOVE the Glazer Children's Museum.\nLots of fun activities for all ages and fun for parents and grandparents too!  I HIGHLY Recommend!",
  "This place is so awesome! Something for all ages of children. My son is almost 5 just for relevance and really enjoyed this place. We learned about this museum from a Blippi video on youtube and it is just as exciting as it was watching it on blippi. We will definitely come back. We were able to get in free using our home science center membership through thr astc passport program but it would have been worth paying admission for. Plenty of clean restrooms and nursing areas as well as several 3 and under spots near exhibits for older kids if you have more than one kid and they are different ages. Truly a magical place, wish we had something like this in nashville.",
  "The museum is small, but has many interesting and high quality educational exhibits.  Unfortunately, many of them were not working properly during our visit.  It was quite crowded the day we were there (Saturday) and my son was not able to experience several exhibits because some of the other visitors were not not giving others a turn.  I would recommend visiting during the week to avoid the crowd if possible.  We saw everything in the museum in 1.5 hours.  Not sure this one is worth the cost of admission, but my son did enjoy himself for the short amount of time that we were there.",
  "No reciprocity with the Tampa History Museum. Grandson liked it. Should have known we were going to have to pay through the nose since the glazers name was on it. We're still paying them for the stadium.",
  "If you like quiet this isn't the place for you as noise carries terribly.. Reasonably priced and loads of activities. Our granddaughters especially loved the Publix play store,  the EMT play area and the firehouse.  They like the Japanese area and played at tea party tables. I think their favorite based on time spent intently engaged was the water feature complete w rainstorms and the beach area.  They have a Subway on premises which was handy. Our 8 year old granddaughter is terrified of heights which kept her from several activities but there were still many she enjoyed. ",
  "Visiting Tampa for the weekend i really wanted to bring my kids here. There are several things for the kids to participate in like grocery shopping, a small ball pit area for younger children, firehouse area. My kids were a bit disappointed the water area with the small boats wasnt working but they got over it quickly. I will say they seem to have gotten bored after an hr but with the price i needed them to stay longer. They seem to enjoy outside the museum and the park just as much.. overall it was a great visit and we would visit again.. of course with anything downtown parking was hectic but thats no fault to the museum.",
  "Fun for kids of all ages! Best for ages 3-8 but things for all ages, they have activities, and a dozen or more different play areas from climbing to a huge water area, kitchen, music area and more. We spent about 2hrs but I think for older kids, it could be even longer (we have a 20 month old). "
 ]
},{
 "name": "Henry B. Plant Museum",
 "address": "401 W Kennedy Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/b6/70/3c/the-plant-museum.jpg",
 "tags": [
  "free",
  "historic",
  "walk",
  "history",
  "history",
  "free",
  "history",
  "history",
  "free",
  "historic",
  "learn",
  "history"
 ],
 "website": "http://www.plantmuseum.com",
 "source": "TripAdvisor",
 "reviews": [
  "It’s interesting to see what people do with more money than they know what to do with. Henry B. Plant built this oddly out of place hotel and filled it with eclectic furniture and decorations from around the world. The cost was about $2,500,000 to build and $500,000 to furnish. The building is now a national historic landmark and well worth the visit. \n\nThere is a 10-minute film that explains Henry B. Plant’s life and what was going on in that time period that helps explain what you will see in the museum. Guests are given handheld gadgets for a self-guided audio tour for you to hear more or less about the items at your own pace.\n\nDespite the large building being a quarter of a mile long, the museum is in a tiny space. Nonetheless, this museum has an impressive amount of antiquities on display. We spent more than an hour wandering through the rooms. Items on display are bunched up in a room easy to be seen but overwhelming with the volume of items in each room. The audio tells you anything you would need to know about the items; no reading is necessary. I’ve seen enough vintage furniture in my life, I was excited to see other interesting things in the museum like old books, Colonel Theodore Roosevelt room, a binder full of handwritten letters home from a soldier, train tickets, the writing room, the first elevator ever installed in Florida, etc. The architecture is also truly magnificent. You really get a sense of life in that day. \n\nThere are only a handful of free parallel parking spaces in front of the museum otherwise Thomas Parking Garage is a free parking garage 5-minute walk away. The building is shared with the Tampa University so it's a little confusing to find the museum part. \n\nThe museum is closed on Monday’s.\n\nIf taking pictures of the building outside, try taking a panoramic photo on your cell, it turns out really neat. \n\nWe really enjoyed this museum and will be back during December for the annual Victorian Christmas Stroll in which they play music, decorate the museum with trees, lights, antique toys, and fancy ornaments for a look at Christmas past.",
  "Built after the Civil War and before the turn of the century the Tampa Hotel was a winter retreat for wealthy Northerners who traveled by train to Florida on rails built by Henry Flagler and Henry Plant.\n\nToday the hotel is an icon in Tampa and houses the administrative offices of the University of Tampa along with the museum.  The audio tour gives one the history of Tampa, the hotel and it's service through the years to include a marshaling area to support troops deploying the the Spanish American War.\n\nThe hotel has been well maintained and well worth time time to visit.",
  "Get lost in history while listening to the audio tour of this amazing museum (audio tours are also in Spanish) and the staff provided a wheelchair for our senior mom. We traveled through time visiting the 18 different rooms made available with loads of memoribilia to wow over.  Definitely worth visit.",
  "Took a trip to the Henry B. Plant Museum which is located on the University of Tampa college campus.  There is free parking directly out front of the museum and if all of those spaces are filled, there is a parking structure a few blocks away available.  The museum was $10 for an adult with discounted rates for seniors and students.  The admission price included an audio tour which I found was informative.  \n\nThere are numerous items displayed that used to be in the hotel which are ornate and well preserved.  The items were presented in an easy to understand fashion and the museum has a well rounded display about Henry Plant, the hotel and the history of the area.\n\nBackpacks and large bags are not allowed as the artifacts are out in the open and there is not really room for mobility scooters or wheelchairs.",
  "This a great piece of Tampa history. Go on Sundays and you will get a reenactment of the past from the local theater group. Also make sure you go down the halls and look at the concert rooms and find the spiral stairs to the upper levels you will not be disappointed if history is you game.",
  "With the aid of an audio recorder and reading the written summaries within each room, you will be well informed on how Henry P. Plant influenced the development of this city. It is a self guided tour which can be done within an hour depending on the pace you set yourself. Since its founding in 1933 it certainly has seem its fair share of people touring this museum. For example, one room is set aside on how this once expensive for upper society hotel was used for the Spanish-American war in Cuba at the end of the 1800's. Parking can be limited because this museum is on university property but an attendant on duty will get you on street parking across the street for free. Has different admission prices and gift shop.",
  "A snapshot of an age gone by. Lots of historic furnishings and a self guided audio tour. Much of the building is given over to the administration of the University of Tampa. The museum itself is a portion of a hallway on the main floor of the former hotel. \n\nI did learn more about Henry Plant and a few things about privilege during the era that the hotel that this was. For some reason, I was mostly blasé about this museum. I see that many others are more enthusiastic about this attraction, I found my expectations varied from what I experienced.",
  "This is a small museum in a former hotel, very grand in its day, that is now part of the University of Tampa.  The collection is along a hallway on the first floor.  It is not professionally curated, so don't have expetations that this is a \"Smithsonian level\" exhibit.  Rather, it is a collection decorative arts and memorabilia from when the hotel was a showplace for the rich, during the Guilded Age.  \n\nAdmission to the museum provides a audio tour which was quite helpful and interesting.   \n\nIf you have an hour, this is well worth a visit.",
  "Was an amazing building and hard to believe was built all those years ago. It’s great that some of the interior has been retained in its original form. \nThe audio tour guide supplied gave so much information. Was money well spent and very reasonable price too. \nA must see place if you’re in the area. ",
  "This museum brings the life of Henry B Plant to people that want to know more about the early history of Tampa Bay. Very well done.",
  "When visiting the area we made it a point to see the Plant Museum and were glad we did.  Wonderful architecture and great period details and all annotated with wonderful stories.  So glad this building has a modern use so that some of it can be preserved as a museum.."
 ]
},{
 "name": "Yuengling Brewery",
 "address": "11111 N 30th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/33/e0/94/entryway-with-tour-times.jpg",
 "tags": [
  "free",
  "free",
  "drink",
  "knowledgeable",
  "walk",
  "food",
  "family",
  "learn",
  "free",
  "walk",
  "experience",
  "history"
 ],
 "website": "http://www.yuengling.com/breweries/tampa",
 "source": "TripAdvisor",
 "reviews": [
  "Free parking, free tour and free samples if you are into how beer is made.  Take the early tour at 10am so you can plan other things after.  This was my first tour being a beer drinker I thought sure why not. lol The video was a little boring. Seeing the bottles in the plant moving around, getting a taste and seeing the smile on my boyfriend's face was the best part.",
  "Enjoyable and informative.  Maureen was our guide and was clearly a people person, welcomed questions of all kinds, good sense of humour.  Took approximately 1.25 hours.  Free beer tastings at the end.  Make sure you wear closed toe shoes or you'll look dorky wearing socks with your sandals.  There were quite a few stairs so if you have trouble with that be prepared.  There is no rushing you through the tour so you can take your time on the stairs if you need to.  Gift shop has a decent assortment of t-shirts, prices not bad.",
  "Yuengling\nMy hubby and I were both free and decided to go to the Yuengling brewery.  This is something we have been planning on doing for some time. We did the 1 pm tour; there were about 20 people on tour with us. It was interesting, informative and free. The tour took us up and downs stairs around and through the brewery.  The tour guide was knowledgeable; told us about the beer making process; she was funny and was open to answering questions.  It was a detailed tour; we learned a lot of things about the beer, the company, and the Yuengling family.  The brewery was in full production. We were not allowed into the production area; however, we were able to view through big pane windows.  We did get to go into the lab and learn about the ingredients and walk through the older part of the brewery that's no longer in use. \nThe tour lasted about 45 minutes. At the end, we were guided to the tasting room that looked like a bar to sample the beer.  We offered two samples each. There were about four beers on tap that was locally brewed then a couple of beers in the can and bottle that were brew in their other plant in Pottsville.  It was pretty good sample size drink. After drinking the beer, I needed food to soak it up.  There is a small gift shop next to the tasting room, selling shirts and beer glasses but no food.  This location only allows beer tasting if you take the tour. No tour no taste.\nThe Yuengling Company is stated to be the oldest beer brewery in America's started in the late 1800's by a German immigrant. It is located on a 53-acre site, so there is plenty of parking. Taking this tour is an exceptional way to spend an hour or two.  The brewery has tours during the week and the weekend.  I recommend this tour, but be sure to wear close up shoes it is mandatory.",
  "Looking for something to do in Tampa which is complimentary and offers tasting samples? Yuengling Brewery offers free tours of their Brew Factory many times a day so, the Kid and I were in!\nYuengling IS the oldest Brewery in the US! It originally began in Pottsville, Pa in 1829, that's 191 years old.\nYEP! It beats out it's Budweiser, the competition by several years. BW was \"born\" in 1852. The Eagle is original to Yuengling and when BW decided to sue Yuengling for the Eagle copyright, BW lost. \nBack to the tour. The tour is very casual but, organized. Meet in the Guest Center, sign in the guest book, grab a wristband and then wait for the tour to begin. While waiting, one can browse the Gift Shop, walk the grounds or enjoy a beer before the Tour.\nA short oral presentation along with a short film is given at the beginning of the tour. You will be split into smaller groups (no more than 20 people) so, you can hear the Guide's complete description as you move from building to building. HEADS UP: NO photos are allowed in the interior except for the Guest Center. Yuengling is very sensitive to their formula and processing. It's ok, cause you can still take some great exterior photos.\nThe tour last for about 90 minutes. There are stairs and it's all walking so, wear comfy shoes. Parking is also FREE. Q & A's are encouraged!\nAfter the tour, you can enjoy popcorn and 2 complimentary samples back at the Guest Center.\nGreat 1st date!",
  "The rums were great even the coconut one which I definitely was ready to not like being I don't usually like coconut but the coconut flavor wasn't over bearing.  I liked their rums so much I ended up buying 6 bottles when I only planned on buying 1 but it was too hard for me to choose only 1",
  "Interesting tour and then the sampling room. Try different Yuengling brews, but do it quickly. You get about 10 minutes before they close uo for the next tour group!",
  "Our birthday visit was nothing short of amazing. The tour alone was astounding but our tour guide put the whole experience on another level! Vickie lord is a bright light of amazing facts and corky jokes , nothing short of a perfect time, thank you yuengling, you all really made our friends birthday 15/10",
  "Reserve your tour in advance to guarantee your time.  If not, you'll sit in the Tasting Room, waiting for the next available tour.  Not a bad strategy because you can sample the fine beer selection fresh from the tap (or bottle). We've visited on Fridays when brewing activities are slow (not much production going on), but then you get to spend more time in the Tasting Room. All tour guides are very nice, efficiency minded, and very well informed about Yuengling history and products.  This brewery is better than any micro-brewery or craft brewery in Tampa."
 ]
},{
 "name": "Tampa Bay History Center",
 "address": "801 Old Water St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/04/6e/68/the-tampa-bay-history.jpg",
 "tags": [
  "history",
  "history",
  "learn",
  "history",
  "history",
  "interactive",
  "history",
  "family",
  "history",
  "interactive",
  "family",
  "experience",
  "interactive",
  "history"
 ],
 "website": "http://www.tampabayhistorycenter.org",
 "source": "TripAdvisor",
 "reviews": [
  "Two films (15-minutes each); exhibits covering history of the Seminole and arrival of the Spanish; model cigar store and exhibit on cigar factories; exhibit on culture of area (eg, sports, housing, markets); pirate exhibit; craft brewery exhibit through Labor Day; contemporary building overlooking waterfront. Cafe Colombia located adjacent/inside museum.",
  "Really enjoyed our visit here to learn about the native Americans who lived here and endured the onslaught of  all the explorers who showed up and drove them away...there is also much history of the settling of Tampa and the changes over the years.",
  "I went on a perfect day to spend in a museum, because it was a windy, cool day with rain in the morning.  \n\nThis was an excellent museum, and I am glad I had all day to explore it thoroughly and watch the various films and multi-media presentations.\n\nI learned history about the following:  interactions and clashes between Seminole Indians and Spanish explorers, history of Latin immigrants in Ybor city, Seminole and Miccosukee Indians in Florida, European exploration in Florida, the port of Tampa, Teddy Roosevelt’s Rough Riders, pirates and privateers and conquistadors, shipwrecks.\n\nFilms and multimedia:  I saw a film about Spanish conquistadors and Florida’s Indians, a multi-media presentation about Coacoochee (a young Seminole chief who lead his people into battle against the US Army in the 1830s)a film about the Port of Tampa, and a film about a current-day Florida cattle drive.\n\nI enjoyed looking at a recreation of a pioneer cabin.  The two special exhibits were interesting.  One contained a private collection of American flags, from very early US history to today.  The other contained maps, charts, and other documents dating from early European exploration more than 500 years ago through the early 1900s.\n\nI highly recommend this museum if any of these topics interest you.",
  "We booked a cruise with one of the travel agents using your Tripadvisor and got a great price.  We drove to the Tampa, FL pier to tour the area and catch a cruise and parked at a Premier Venture Parking location on Brush street. Do not park at any of the Premier Parking Venture locations. An employee ran over our luggage in another car and destroyed the contents inside and they refused to pay for the damaged items. We contacted the Corporate office and they ignored our calls and cheated us out of the payment for the items they damaged. All the items inside were destroyed and they would ignore our phone calls and not pay for any of the damaged items. These people are dishonest and will not pay for items they destroy. Stay away from all Premier Parking Venture Locations in Tampa, FL, they are dishonest people. Contact me with a message if you want more information.",
  "The museum is downtown, so recommend you either take public transportation or buy a parking pass. We parked in a lot nearby and limited our stay to 2 hours so we didn't have to pay $3 for 30 minutes. The museum was good, well interpreted, but only 2 floors were open not the 3 in the brochure.",
  "We found the modern displays in this small museum to be very well done.  Keep in mind that it focuses on the history of the Tampa Bay area.  Exhibits feature the local Native Americans, cigar industry, agriculture and cattle ranching.  When we went, there was also a special exhibit on the Civil War.  The movie was quite good and combined video with animatronics which made it more powerful (and more interesting to the teens).  They have an area that looks like it is used for activities for younger children, so you may want to check their schedule if you have little ones.  Probably not worth a special trip from out of town, but an interesting couple hours if you happen to be in the area (can easily combine it with Channelside and/or the Aquarium).",
  "Our visit to the Tampa Bay History Museum improved our knowledge of the history of Florida and of Tampa Bay. The quality of the exhibits was excellent and many were interactive and suitable for younger museum goers. \n\nWe chose to to visit the museum on a day between spring training baseball games and were not disappointed. The museum itself begins on the 2nd floor of the dedicated building in which it's housed. The first exhibit encountered is for Florida's first peoples and also addresses 'interactions' with Spanish Conquistadors, the short film is worth viewing. Also from this floor, we enjoyed learning more about the Cigar industry in Tampa and what we took away dove tailed nicely with some of what we learned at the Plant museum earlier.\n\nWe found the next floor a little less compelling although it does fill in more contemporary aspects of Tampa history. More fun was the floor above this as it concerns privateers and pirates. I got to see if I could remember how to tie some sailing knots and the theater presentation was entertaining even if it's obviously aimed at a younger crowd. BTW, I finally figured out the difference between an Astrolabe and a Sextant.\n\nThe museum was well worth the couple of hours we invested. We rounded out our trip by enjoying a stroll along the Tampa Riverwalk that begins just outside the building.",
  "This history center can be enjoyed by the whole family. It is very well presented and is very factural. I highly recommend this attraction.",
  "This is a really interesting and sophisticated experience for all the family: as well as being factual, it's truly interactive - and fun, too! You can read, watch video, shoot cannonball at enemy pirate ships, go shopping for cigars, see how people lived and worked in Ybor City and much more!",
  "Immaculate presentation of the area’s history. Wonderfully preserved and presented artefacts. Entertaining, interactive displays.  Loved it.",
  "We spent an enjoyable two hours here learning quite a bit about the early years, especially the first Western contact, which was all pretty new to us. (It didn’t go well for either the Spanish or the native peoples, in case you’re wondering!)  The video presentations are well done. However the written labels are small to read comfortably.  Don’t miss the outdoor viewing platform on the top floor.  On a Wednesday afternoon we had the whole place almost all to ourselves. "
 ]
},{
 "name": "Raymond James Stadium",
 "address": "4201 N Dale Mabry Hwy",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/08/28/dd/raymond-james-stadium.jpg",
 "tags": [
  "food",
  "walk",
  "family",
  "kids"
 ],
 "website": "http://RaymondJamesStadium.com",
 "source": "TripAdvisor",
 "reviews": [
  "Decided the night before to get tickets for the season opener vs SF\n\nGreat place to see a game\nGreat crowds\n\nIt was a HOT day (heat index 105)\n so we hungout by the tiki huts that are setup in the end zone areas\nThey should think about setting up misters in these areas to help COOL down fans on HOT days\n\nOverall a GREAT day\n",
  "Saw a great Outback bowl game! Enjoyed the teams playing and comeback win! The pirate ship attraction was cool. Weather wasn't the best of days, but overall a good day.",
  "The home of the Buccaneers. It has a really cool pirate ship at one end of the stadium. It's also home to the Outback Bowl each year as well as hosting USF games. you can also occasionally catch a soccer game there. ",
  "This is one of the best NFL stadiums. Along with football, professional and college, it is a great place to see a music concert.",
  "We were here for the home opener of the XFL Tampa Bay Vipers season. Very nice stadium, easy access, easy parking, quick entry and exit. The club seating was very comfortable, the concession area was also very comfortable. Top quality football stadium.",
  "I'm a Bucs season tix holder, and this is a nice stadium not just a football game but for any event.",
  "We were not there for a football game but the stadium was very full. Parking was simple in the lot we chose. Pirate ship in the end zone is a cool feature. The mast somewhat blocks the screen depending on your seats. Restrooms were stocked and clean. Easy to navigate. Plenty of food choices. Vendors walk the stands so you don't miss much. Tailgating was the way to go because food and drinks inside are pricey. That's probably same at any stadium. On the way out the traffic is all going in the same direction, so that makes it simple to leave. Didn't take as long as I thought it would. We enjoy events and games there.",
  "Took my family to Monster jam Feb 1  what a bust it was like a bunch of school kids put this on.\nAll the car crushing, Atv racing,  motor cycle stunts are gone.\nwaited longer for them to set up on a oval track then they did race been going to monster jam for over 10 years boy has it changed for the worst no wonder why stadium was halve empty\nKinda mad about all the fees you have to pay just to buy tickets good old ticket master\ni think that monster jam should promote themselves and put more money back into entertainment instead. i seen better monster trucks at local mud holes than this\nfirst 5 trucks broke down in the first 30 second of start up no even jumping this was a complete joke and a big let down"
 ]
},{
 "name": "George M. Steinbrenner Field",
 "address": "1 Steinbrenner Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/71/03/88/steinbrenner-field.jpg",
 "tags": [
  "free",
  "drink",
  "experience",
  "kids",
  "history",
  "food",
  "food",
  "free",
  "food",
  "family",
  "walk",
  "experience"
 ],
 "website": "http://www.gmsfield.com",
 "source": "TripAdvisor",
 "reviews": [
  "Steinbrenner Field is a beautiful state-of-the-art facility which doubles as a spring training ballpark (the largest in Florida) for the New York Yankees as well as the home field for the Tampa Yankees, who play in the Class A Advanced Florida State League. The stadium appears brand new, as it just underwent a $40 million renovation -- more than it cost to build 20 years ago. It's in a very convenient location, just a few miles north of I-275. I attended a game between the Tampa Yankees and Dunedin Blue Jays on a hot day -- temperature on the field was over 100 degrees -- but had a very memorable experience.\n \nA few things that make a visit here special:\n1) When you yell, the players can actually hear you. In fact, they might hear you in your normal speaking voice.\n2) There's a very good chance you'll go home with a baseball. Alternatively, you can make a little kid very happy by handing it over to him.\n3) You can actually buy a jumbo hot dog, large fries, and a large drink for about the cost of one hot dog at the \"other\" Yankee Stadium.\n4) Parking is free. And your spot might only be about 50 feet from the gate. And it might take you about 10 seconds to get out of the parking lot at the end.\n5) The seat I had wouldn't even be available to anyone buying tickets for the major league Yankees -- the first few rows behind the dugout aren't even for sale at Yankee Stadium to the public -- but the closest seat equivalent would cost over $200. My seat cost $8. \n\nBut, most of all, these are players who truly love to play the game. And you just might see them playing for the New York Yankees one day.",
  "Our son, a HUGE Yankee fan, had a work conference in Tampa and bought tickets for us all to go to a game. He has regularly attended Yankee games in NY, and was eager to check out the Steinbrenner stadium. We were very impressed! The stadium is clean and all the seats offer good views of the field. The traditions of the Bronx are followed, with the usual songs and even the grounds crew's YMCA dance. The atmosphere is much more intimate than the larger venues, and players often tossed baseballs to kids who had their gloves extended. There was lots of action, and the Yanks notched a win. \nFood was kind of expensive ($45 for 3 hot dogs, two beers and a bottle of water!) but the hot dogs were tasty and the beer was cold. It was pretty hot in the sun, so the best seats might be those under the cover of the second level instead of those closest to the field. Definitely bring lots of sunscreen, and plan on spending some bucks. You will have a great time!\n\n",
  "If you are a baseball fan, this  is a must.Formally Legends Field, this is the winter home and spring training Headquarters of the NY Yankees. They also host the minor league teams.This place also pays homage to their history and the players through the years.",
  "I've been to NYC many, many times but have yet to make it out to the Bronx. Catching a game between the Yankees and my home town Blue Jays at Steinbrenner Field seemed the next best thing and, it was.\n\nIt was a beautiful, sunny, hot day in early March and we had decent seats and were joined in the park by many Jays fans. This was our first baseball game since October and we thoroughly enjoyed the game. As well the facilities seem first class and the sight lines were excellent. I personally enjoyed seeing a live game played on a field that has the same dimensions as Yankee Stadium in NYC. \n\nSo, what's not to like? Well, we're not in New York and it's spring training. The outcome of the game doesn't mean a thing and the normal starters are in for 1/2 the game at most. So $45/ticket is more that 4X the price of a ticket to see the Blue Jays play on their home diamond in nearby Dunedin. Also, the day we were there, the direct access from the parking not too far away at to which we were directed by Waze was intentionally closed. There were many, many available spaces but the road signage was directing everyone to paid parking. We walked.\n\nIf I'm at a real MLB game I would expect big league prices for food. This isn't NYC, the field is home to the Tampa Tarpons for the regular season. I would have loved to have had a Hot Dog and a Beer but declined to partake due to the prices. \n\nI'm glad we caught a game at Steinbrenner but I suspect it will be a one time thing.",
  "Great venue for a game!!! Not a bad seat in sight, plenty of concessions and lots of room!!!  the food and the shop were better than expected!!!  a truly world class organization!!!",
  "As a life long Yankee fan we always try to catch them when they are in the state of FL. We ended up getting these tickets free when we did the Sprint to Spring 5k. It was Gerrit Cole’s debut. We had a good time and the concession pricing really wasn’t that bad. The park is beautiful. ",
  "Great time at Steinbrenner stadium!  The facility is great for both families with young children and adults just out to enjoy some good baseball.  We were lucky we got there before they shutdown Spring training for this year.  We loved all of the bars and food choices.   We will definitely go back next time we’re in the Tampa area!",
  "I will start with the good:\n\n1.  The stadium provides an intimate baseball experience.  Kids can see the players up close and there isn’t a bad seat in the house.\n\n2.  Pearling prices are reasonable and only a short distance from the stadium.\n\nThat’s about it.\n\nWhich brings us to the bad:\n\n1.  Ticket prices are astronomical to watch Major Leaguers play a short period of time.\n\n2.  After the first few days of spring training the practice schedule is not published and there is not a good way to determine when you can take the family to watch the game.\n\n3.  Kids cannot walk up to the wall in the lower levels during BP prior to the game.  My children were very disappointed they could not get close to the players.  It is also disappointing for the price of the ticket.\n\n4.  Food is pricey.  Major league prices for minor league ball.\n\n5.  Security staff is rude and dismissive when asked mundane questions about how spring training works.\n\nOverall, this was a bust for my family and I recommend you think hard before dumping a lot of money into this trip.  If you want to pay NYC prices, make the trip to the Stadium."
 ]
},{
 "name": "Seminole Hard Rock Casino Tampa",
 "address": "5223 Orient Rd",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/94/d5/ed/seminole-hard-rock-casino.jpg",
 "tags": [
  "free",
  "food",
  "affordable",
  "experience",
  "delicious",
  "food",
  "drink",
  "walk",
  "walk",
  "free"
 ],
 "website": "http://www.seminolehardrocktampa.com/gaming",
 "source": "TripAdvisor",
 "reviews": [
  "We have a wonderful experience everytime we go to Seminole Hard Rock Casino Tampa! \n* The parking is easy to navigate and clearly marked. We opt for the free self-parking.\n* The casino is well-maintained and clean.\n* Any type of fun gambling, that appeals to you, is at your disposal. \n* A relatively new feature is the Non-smoking section in the Slots portion.\n* Whether you grab a quick bite in the food court, or hop upstairs to the Fresh Harvest Buffet, you'll enjoy high quality delicious food at affordable prices.",
  "Great food, especially Chinese, (get the roast Pork) great Poker room, very nice hotel rooms and pool, good action, great people watching and excellent bar options.  ",
  "They got a really nice casino, great restaurants, drinks, fun and the hotel! What else could you be looking for? For those who are crazy for Poker they a separate and special area just for the game. Lots of slot machines to have fun or go serious. To drink - whatever you may like and I had one of the best noodles of all in one of the restaurants inside the Casino.",
  "There were 4 of us in the group, and not one person won. I like penny slots, and they were few and far between. I played Tinatic, fun , but no good play offs. Do not go on the weekend, there is no parking. People just drive around and around looking for places. We joined the players club , and got 5.00 off the buffet. The Buffett for lunch was regular price 20,00. So with our 5.00 off, we payed 15,00, the Buffett was big, but we didn't lthink it was that great. We have had better for less ,only. The desert bar was great.😉 it was bery smokey, and we did not find the staff very frienfdly. If you do the dinner buffet it is 40.00. We ask what was different on the evening buffet, but the waitress really could not tell us .Moneof us would go back. To the casino or the restuarant.",
  "This casino is one of few in Florida, and the payouts are not very good. The casino industry is limited in this state, so I'm assuming that is the reason. It is fun to come here and play slots, but it would be better if the payouts were a little better. The poker room is large and fairly nice. Drinks are outrageous and they don't comp for the typical player. You must invest some mega playing time or mula if you expect some good comps. \n\nIt's pretty smokey in this casino so you may need to take fresh-air breaks. This casino will have to do for the area that it is in. I would definitely prefer to make it a long weekend and visit Biloxi, if possible. But this is okay for what we've got.",
  "A few years ago I wrote a review of this property.   One thing I was critical of was the smoke - well, let me tell you, it certainly hasn't improved, maybe even worsened with all the cigars and downright stinky cigarettes.   You walk right into a wall of smoke, and you smell like a chimney when you leave - you can't wait to ditch your clothes and wash the smell right out of your hair.   Jeez!   Surely they can make a non-smoking area - and judging by the people I saw with portable oxygen tanks, something definitely needs to be done.  Isn't that dangerous BTW - having oxygen tanks around all those smokers?   Maybe they equate \"freezing air\" with \"fresh air\" - the casino is very cold, so make sure you dress in layers (all the more to chuck in the washer when you get home).  That being said, I found that  the limits on some of the tables had been lowered, and we were able to play Let It Ride at $10 a pop, which is much more reasonable and I for one certainly appreciated being able to play for longer (and it must be good for the casino as the house odds on LIR are very much to their benefit).   One dealer told me that they actually had a $5  LIR table, but at neither of my two visits in January did I see any evidence of that.    Most dealers were friendly but the house rules with regards to LIR vary from casino to casino - i.e. at some you are allowed  to use two hands to pick up your cards - so they need to be tolerant to people who do not know the local rules.   Food Court is okay - it's a Food Court, people !  The washrooms are kept quite clean and considering the traffic, the ladies do an excellent job on that.   ATMs could be better identified.",
  "I've been to many casinos in my years.  But, this was the first place I felt like I wasn't old enough to be there. I know Florida attracts a ton of seniors but it was the majority in the casino.  The air filtration could not circumvent the amount of cigar, cigarette, & vape smoke.  The crazy part were the ones with oxygen on and still there.  Slots were okay until one machine just froze for over 20 minutes and trying to get help was ridiculous.  You couldn't walk away because the built up credits were still on the machine so you couldn't cash out.   The tables stayed packed so never really an opportunity to sit and play, I won't be back that's for sure.",
  "The Seminole Hard Rock Casino in Tampa Florida is the best casino I have ever been to. Plenty of surface and ramp parking. Lots of slots and table games to try your luck on. If you are hungry, there are many restaurants to select from including the Hard Rock Cafe.",
  "As casinos go this is as nice as any I've been to before.  Staff is friendly and helpful.  Plenty of slots and tables and not too busy. Well marked signs assist you in finding different areas within the casino. Valet parking is expensive but if you have someone handicapped worth the expense.  There is a fairly large non-smokiing area but I found the ventilation was good in the regular areas.",
  "Visit was later on a Friday night. 4 40 something adults. Casino Was nothing different than any other casino.  \nI ordered a pineapple vodka and 7up $13 6oz.",
  "This is my 4th visit this year, have yet to go home with any money or find it a fun place to gamble. This will probably be my last visit.   Food is good, not excellent, a burger will cost you $16, for a $10 burger at most other places.   Most sandwiches above $13 and under $10 at other places, oriental chicken salad $19,   10 oz steak $33 alcart, add $5 plus for salad etc.   My visits have been about an hour because the slots don't play.  Played put a hunderd in a $5 a spin slot, never paid out more than $10 and my $100 was gone in less than 30 minutes.   Not fun when they don't let you sit a play, they just take for the most part. Tried several more machines bet was always $1 or much higher because when you play .50 you get.05 or .25 or mayber 110 returned.  Not often do you even get our play back.  Either I play the worst machine in the place or wrong timing,  Started on a  Pot that closes after someone just left and pot was full.   I put $200  plus to get that pot to close, never got free games or bonus, but the pot did close and paid me $28.00. moved on again.    Very tight slots in my opinion, but you luck may be better."
 ]
},{
 "name": "International Plaza and Bay Street",
 "address": "2223 N West Shore Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/26/da/d2/international-plaza-and.jpg",
 "tags": [
  "food",
  "food",
  "food",
  "walk",
  "food",
  "food",
  "food"
 ],
 "website": "http://www.shopinternationalplaza.com/",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great mall that is anchored by Dillards, Nieman Marcus, and Nordstroms with lots of wonderful mid to high end shops throughout it.  The Dillards is the best of its kind in the region, and the Nordstroms is a standard one with lots of great accessories and shoes.  The mall has a wind range of shops to include Janie and Jack, William Sonoma, and Talbots.  It has a large indoor childrens playground near the Disney store on the first level.  There is a traditional food court, and there are many restaurants in the Bay Street area adjoining the mall to include The Capital Grille and Cheesecake Factory.  Valet parking is available and easy to use.",
  "Pleasantly surprised to see many high end stores such as Tiffany's, Tory Burch, Spanx, Apple, Aveda, BCBG, Burberry, Coach, David Yurman, Invicta Watch, Fablethics, Johnny Was, Kate Spade, Lilly Pulitizer, and many more. Customer service in Tiffanys and Invicta was top notch.",
  "Well, I start at Nordstroms so the ladies can look at shoes, then Louis Vuitton, Pandora, Tesla, Food Court, etc.\n\nFun just to watch people.\n\nGreat place to shop, especially if you are near the airport.",
  "International Plaza Mall is great! It's absolutely beautiful, clean, not terribly crowded, has a wide variety of stores ranging from Burberry to Forever 21, as well as a state of the art food court including chains such as Chipotle, Earl of Sandwich, Chick-fil-a, etc. It is also within walking distance from many hotels, such as the Westshore Hilton, where I stayed during my last visit to Tampa. Truly a great mall, highly recommend to anyone staying nearby.",
  "This is a very large two story mall with high end stores throughout. Lots of good restaurants and a large food court area. It also has numerous outdoor restaurants with seating galore. You can make some miles here if you want to walk all areas of the mall. Was not that busy when we were here. Nice location close to the airport.",
  "This is a great mall that is anchored by Dillards, Nieman Marcus, and Nordstroms with lots of wonderful mid to high end shops throughout it.  The Dillards is the best of its kind in the region, and the Nordstroms is a standard one with lots of great accessories and shoes.  The mall has a wind range of shops to include Janie and Jack, William Sonoma, and Talbots.  It has a large indoor childrens playground near the Disney store on the first level.  There is a traditional food court, and there are many restaurants in the Bay Street area adjoining the mall to include The Capital Grille and Cheesecake Factory.  Valet parking is available and easy to use.",
  "This is a huge mall with a lot of high end stores.  They have some really nice outdoor/indoor restaurants to dine in. Plenty of food choices and it's nice to see you can eat inside or outside.  The mall offers many choices of stores, high end stores that are not in the west shore mall and this mall is just about a mile away on the same road. You should visit both.",
  "The Bay Street is fun and happening place to hang out!  We ate at Rocco;s Tacos, and the food was good.  It is a bit loud, so if you want quiet, don't go here."
 ]
},{
 "name": "Adventure Island",
 "address": "10001 McKinley Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/14/5b/80/big-splash-tube.jpg",
 "tags": [
  "low",
  "family",
  "kids",
  "family",
  "food",
  "family"
 ],
 "website": "https://www.adventureisland.com",
 "source": "TripAdvisor",
 "reviews": [
  "We had a great day at Adventure Island.  Very low numbers meant no significant waiting for any attractions.  There were a couple of slides closed however none of the top end slides.  Colossal Curl and Vanish Point were great and we really enjoyed the lazy river.  We rented a cabana which gave a nice quiet shaded area to hang out in between rides however there was plenty of seating available throughout the park.  Our BBQ lunch at Mango Joe's was pretty good and was included with the cost of our cabana.  We were in the Riverside Cabanas which seemed to be the best overall cabanas.",
  "If your anywhere near florida you have to check this place out. So much to do and lots to eat I highly recommend the funnel cake with ice cream on top. So many awesome slides and a giant lazy river and wave pool, perfect place for friends couples family or even just by yourself",
  "Good value for money ,have 3 kids age 13 10 and 8 able to go on all rides with very little queuing arrived at 10 left at 4 kids occupied all day kids loved the cliff jumping myself lazy river something for all ages ",
  "Adventure Island in Tampa Florida is a fantastic place to take the whole family. Plenty of parking. The staff is very helpful and friendly.",
  "The Adventure Island Water Park in Tampa Florida is a great compliment to Busch Gardens Tampa. After a great day at Busch Gardens, try your water skills at the water park.",
  "The walkways were filthy, steps to slides were old, very slippery with scum and mold, water did not have that \"clean\" feeling.  It felt like you were coated with scum when you got out.  Staff was unhelpful, disinterested, sloppy and very few around to assist for bathroom locations.  When bathrooms were located they were filthy.  Contacted customer service regarding misbilling to my credit card, I purchased a year end pass and they billed for annual pass.  Fraudulent business practice.  We purchased the Fun pas in June for 4 months, knowing the park would be closed October to March.  I was billed for an annual pass.  Ridiculous, whey would I purchaase a pass for a park that I know is closed for 5 months.  Spoke to customer service, she could not even find my recurring charges.  Spoke to a supervisor, Micki, unhelpful, avoided answering questions, refused to refund, kept telling me \"this is a contract\".  Very rude.  I explained I purchased a Fun pass not an annual pass, their records show different she said over and over again \"this is a contract\" as if I was stupid and did not get it the first time.  Completely unprofessional,  I asked for the billing department and was told there was none.  Absurd.  It was obvious the supervisor Micki lacked training, courtesy, customer service skill and absolutely no dispute reconciliation training or skills.  Very dissatisfied with the park and the customer service.",
  "My son and I love Adventure Island and he always asks when it will reopen. The park itself has been improving and love everything about it.",
  "So recently I visited adventure island and oh ! I had so much fun. It’s a great place to spend some memorable time with your friends and family. It’s worth spending money. You can have unlimited rides and dance. There are some good places to have food. A must visit"
 ]
},{
 "name": "Courtney Campbell Trail",
 "address": "",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/bf/b9/33/lots-of-trees.jpg",
 "tags": [
  "kids",
  "walk",
  "unique",
  "free",
  "walk"
 ],
 "website": "http://www.tbrpc.org/scenic/cctrail.shtml",
 "source": "TripAdvisor",
 "reviews": [
  "Staying at a hotel across the bay, we decided to take the shuttle to Ben T Davis Beach. The view on the causeway is gorgeous, but the traffic is horrific. The beach was smaller, yet fun. The kids could go way out as it is very shallow. The waves were coming in on the day we went so the kids were having a lot of fun while the parents were getting pelted with sand. You do have to pay for parking, not sure how much since we took the shuttle. The sand has lots of broken shells in it, making it difficult to walk without shoes. But the grounds seemed clean. And right next door is Whiskey Joes. They too have a beach on the other side of the restaurant. Seemed a bit rowdy at times, but could be fun for older kids, teens and up. ",
  "We came upon info about this pedestrian/bike trail while researching places to get some walking in. It is quite unique in that it is dedicated to non-vehicle traffic and it goes over the bay!  We started at Ben T Davis beach where there were restrooms and parking and we walked about 2 miles out and two miles back. We could have kept going for hours but the hot mid-day sun and our 60 year old joints wouldn’t allow it. Some shade along the way would have been appreciated but my sun visor helped a lot. I recommend wearing lots of sunscreen and clothing to cover your neck and shoulders to avoid sunburn.  ",
  "A cool ride across the Tampa Bay along the Courtney Campbell Causeway. Though the route itself is a busy trek, it is seemingly quiet when on the waters edge. At many points along the bridge you can drive off the route and onto a one way road that runs along the water's edge on both sides of the causeway. The narrow road has plenty of non designated parking available. On the west side (heading towards Clearwater) it is more quiet, with fewer people. With just a narrow line of greenery separating the road from the water you're sure to find a spot to stop and access the water. We watched fisherman gather various fish from beneath rocks and found it very interesting. If you continue down through to the bridge you will find line and net fishing in action. As you make the turn to head back on the east side you will find designated parking spaces, a paved boardwalk alive with bikers, roller bladers, and more. The water is shallow along both sides of the causeway, but the swimming seemed most popular on the east side, with more eye view of the water without obstruction of greenery as on the other side. The water was that beautiful turquoise when we were there in March. The water was not too rough and would make for easy kayaking. There is also a formal boat ramp to launch power cruisers. We have seen this type of free, public, water access in many bridge/causeway locations along the west coast and down through the Keys. If I lived in the area I can see us accessing this location often. It's easy and beautiful. It is certainly a great alternative to the chaos of Clearwater beach.",
  "The Courtney Campbell Trail offers a fantastic walk and bridge trail for bikes, roller bladers, runners and walkers. ",
  "This trail is perfect for morning walks!!!  The views are great, the traffic is not overwhelming, and we saw all kinds of birds, a few lizards and a dolphin!!!",
  "A very pleasant and scenic drive over this well paved local roadway joining Tampa and Clearwater, Florida. ",
  "nice scenic ride-watch out at intersections but otherwise pretty safe and well paved. also quick ride to safety harbor on the west side.",
  "Great Causway to ride on to and from Clearwater and Clearwater Beach, Florida. The trail off to the sides good for fishing "
 ]
},{
 "name": "Cigar City Brewing",
 "address": "3924 W Spruce St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/d5/f7/c3/the-tasting-room-really.jpg",
 "tags": [
  "food",
  "food",
  "kids",
  "food",
  "knowledgeable",
  "walk",
  "food",
  "kids",
  "food",
  "food"
 ],
 "website": "http://www.cigarcitybrewing.com",
 "source": "TripAdvisor",
 "reviews": [
  "Given the explosion in the craft beer industry, there may be better breweries in Tampa.  However, Cigar City is the tried and true standard in Tampa.  With a wide range of excellent beer and something new on tap at the back bar along with a friendly staff, Cigar City is a must for craft beer lovers in Tampa.",
  "The brewery tour at 11am was terrific because it was informative about brewing beer and about Cigar City Brewery. Everyone seemed to enjoy the tour and the tastings. Hunahpu was available for purchase and consumption in the taproom, which was a highlight. We ordered subs that were delivered to us at the taproom since food is not available for purchase at the brewery. ",
  "Close to the airport, lots of excellent cigar city brews on tap or to go as well (growlers, bomber bottles, cans).  Tried some excellent beers only available here.  My wife loved the Peach IPA on Nitro!   Check the food truck schedule, we had some awesome wood fired pizzas for everyone so the kids were happy hanging out for awhile with us!  ",
  "stopped here for the brewery tour which we found very enlightening. drank a few different beers in the tasting room and during the tour plus you get a taste of fresh beer before carbonization...if you are a craft beer enthusiast like me this is a good place to visit. only drawback is no food than from a food truck if it is there...so don't go on an empty stomach",
  "When my relatives suggested this tour, I was kind of \"Meh\" about it.   Been there, done that.   But this microbrewery not only makes excellent beer, it offers a better than average tour as well.  Personable, knowledgeable tour guide.  It's a tiny place so you walk about 50 feet altogether.  It does cost $5 and change but you get a pint of beer of your choice and keep the glass.  Afterwards, there's a nice bar area where you can buy some more to sample - the four beer flights are popular and an excellent way to try some more exotic and unusual brews.  We also split an enormous Cuban sandwich to absorb some of the brew.  We went on a weekday and it was busy enough - on weekends the place is reportedly packed.   You can make reservations on-line for the tour, and there appears to be plenty of parking unless there is a special event going on, like a limited release.  ",
  "Nice selection of good craft beer. Parking could be a problem and the place is crowded. The beer and atmosphere is worth the trouble of fighting the crowds. Just minutes from the airport and a good place to take the edge of off your flight.",
  "At the Tampa International Airport, Cigar City Brewing has a restaurant where I passed some time waiting for my plane, which was 2 hours late.  I ordered a Cuban sandwich and a pale ale.  Both were tasty and worth the price.  However, I had lost my cell phone in the terminal!  I didn;t realize that at the time, but when I did the staff at the restaurant was totally helpful in trying to find the phone, calling the number, making suggestions, etc.  In the end I found the phone near the gate that I had visited to check on the plane's departure.  The staff made the visit pretty good, and I have to thank them, knowing that if any other traveller gets into the same situation they will do their best to help.",
  "We visited Tampa on a whim and stopped by Cigar City Brewing with our small kids. The staff is friendly, beers are great. The tours were cancelled indefinitely, so we'd like to try it next visit. I heard it's $8 per adult which was a good deal seeing how you get samples. The food looked good, decently priced. A nice place to visit and it's dog friendly too.",
  "Was here several years ago and was surprised how much the place has expanded - both the taproom and the choice of beers. I had a Cafe Americano (double stout with chocolate and vanilla) - excellent. Friendly bartenders ",
  "We where staying in downtown Tampa for a night, visited the  Y'Bor area  during the early afternoon which was ok but had a lot of  inebriated folks around so decided to go back to our hotel and get an Uber to the CCB\nSo pleased we did, based in  a warehouse the place basic but well organised, found our selves a table and asked the waitress  to explain the beer selection\nThis she did with enthusiasm and I ordered a tray of three taster glasses, they went down well so ordered another three and some food.\nServer (sorry I did not get her name) was very chatty and informed me that the manager had bought the last three samples for me as we where on my 60th birthday  road trip, such a nice and unexpected gesture\nThe Uber was around 7 dollars from The Marriott Downtown so all round a great trip",
  "This place was totally revamped since my last visit.   It is much more roomy and now offers food.  I ordered a sandwich and it was pretty good (burger).  Staff was very friendly "
 ]
},{
 "name": "Tampa Bay Downs",
 "address": "11225 Race Track Rd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/6b/86/e6/tampa-bay-downs.jpg",
 "tags": [
  "free",
  "walk",
  "free",
  "drink",
  "low",
  "family"
 ],
 "website": "http://www.tampabaydowns.com",
 "source": "TripAdvisor",
 "reviews": [
  "We try to go to this track once a year. Its the closest track to us, although not the most glamourous. We always enjoy the day, win or loose. Nice to sit in the (hard) seats & enjoy the filtered sun & watch the ponies do their thing. The club houses/poker rooms have a/c & closed circuit TV's. We did not go to the main clubhouse this time, but have eaten & sat there several times on other occasions. There is a dress code, so be sure to check those if it is of interest. General admission is $3 on weekends & if you choose to sit & eat in the Skye Terrace, reservations are essential on weekends. We went on a Wednesday & entrance was free to the grandstands & clubhouse. This is true for all Thursdays too. We enjoyed a couple of Nathan's hot dogs for lunch. \nWe went to this track on Kentucky Derby Day several years ago. Although this is not Churchill Downs, people dressed up, especially the ladies & wore their best hats",
  "An upgraded racing program without any competition nearby has helped the Silks survive in the competitive Florida gambling market.The facility also has a poker room and simulcast betting.  Check before you plan to go: the racing season is relatively short.  The biggest downside to this facility is the horrific lack of parking.  Either plan to arrive REALLY early or get your walking shoes ready.  The Silks ownership really needs to do something to upgrade the parking situation.  If you like horse races, the Silks is worth the trip.  Don't expect the same quality as some of the South Florida tracks, but as \"the only game in town\" it provides good value for the money and, of course, the bonus of exercise as you walk to and from your parking space.",
  "A track is a track. Very pretty weather for a day at the track. Go early to get a parking space, if not, you will be walking, really get your exercise. ",
  "Tampa Bay Downs is open everybody is social distanceing. Its a small track has all the facilities. The staff is great. The race I enjoyed, Remembering Baseball wins the madien. The weather is wonderful.",
  "It was such a fun time here.  The horses were so beautiful and it was a gorgeous day to be outside.  We used Groupon which offered valet parking, special seating and a free drink!",
  "Tampa Bay Downs have live racing Wednesday Friday Saturday and Sunday. The restaurant on site is very good place to eat.",
  "If you want something different to do and don't want crowds and being enclosed at Hard Rock Casino, Tampa Bay Downs is really fun. You can bet as low as a $1 bet and watching the horses and how majestic they are, is really neat. Food is pretty good. Shade available but seats in full sun too. You can stand right up against fence to see horses whiz by. Can be in and out in a couple of hours.",
  "This is such a fun day to take your friends and family who visit. You don't need to go the the beach EVERYDAY!!!\n\nBuy a Groupon which includes valet parking, admission with stadium seating,  a program, one $2 bet and a $5 voucher for lunch.   Open Wednsday, Friday, Saturday and Sunday...so plan accordingly.  \n\nGood luck!"
 ]
},{
 "name": "Tampa Theatre",
 "address": "711 N Franklin St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/6f/9b/d2/under-the-night-sky-in.jpg",
 "tags": [
  "unique",
  "history",
  "experience",
  "educational",
  "historic",
  "history",
  "unique"
 ],
 "website": "http://tampatheatre.ticketforce.com/",
 "source": "TripAdvisor",
 "reviews": [
  "This is absolutely a gem. A marvelous old movie palace complete with organ that use to accompany silent films. The architecture is unique and gargoyles are plenty. This theater has so many different offerings from old movies to the latest films, live performances, stand up and concerts included. They even have an Oscar night where you can dress in costume or your finest. I took the tour it was wonderful. You can book before you go on their website. Go and enjoy.",
  "Atmospheric theaters were created in the 1920s before the \"talkies\" took over Hollywood's output.  In the South in particular, they also had another amazing invention that offered a reprieve from the swelter of summer, air conditioning!  This theater has EVERYTHING in spades!  Ambiance, history, great films and class to spare.  Even the restrooms have received national acclaim.  This theater is THE preeminent atmospheric IN THE NATION.  And I don't come by that opinion lightly as my hometown, a scant thirty five miles away has another one of these gems but it pales in comparison to the Tampa Theater.  If you want a TRUE movie going experience, the Tampa Theater will not disappoint.  Take the backstage tour and get a glimpse of the glory that was old Hollywood and the extravagant venues that made that city and industry what it is today.",
  "Built in 1926 it is among America’s most elaborate movie palaces.  The Tampa Theatre today is a protected community landmark. The Theatre is managed by the not-for-profit Tampa Theatre Foundation and hosts more than 600 events each year, including first-run and classic films, concerts, special events, corporate events, tours and educational programs. You will find this a great example of a lost era of design and elegance.",
  "This historic theatre opened in 1926 and was designed as a movie theatre by John Eberson. It was an opulent movie theater and, by the end of the 1920's, more then 90 million Americans were going to the movies every week.  But, by the 1960's and 1970's, going to the movies was no longer the great American past time and the theatre was in poor repair.  Many of the theatres of the time were demolished.  In 1978 the theatre had been restored by the city of Tampa and reopened with films, concerts and special events. The foyer is spectacular and showcases the 2004 renovation that took place.  The ceiling in the foyer is a blue night sky with \"stars\" and the restored woodwork is gorgeous.  There are tours only on weekends and you most likely will need advance reservations, available on their website.  At the end of the very excellent tour we had an explanation of the Mighty Wurlitzer Organ and a short concert.  It was spectacular!!  I would recommend this tour to anyone who likes and appreciates historic buildings!",
  "We came here on Saturday night to enjoy a musical concert/performance by Post Modern Jukebox (PMJ). We were seated in the 4th row from the stage . The view and location was awesome!\n\nThe theatre itself is worth a visit.",
  "A 1926 Movie Theater meticulously restored to its glory days of the silent film.  Take the 2 + hour guided tour of this beautiful theater will acquaint you to the films of the past present and future.  Watching and seeing an organist make the original Wurlitzer pipe organ come to life is worth the nominal tour fee - what a sound!  The CEO of the non-profit historical theater is your guide, and knows all the history and more that willing to share it.  If you miss the tour, buy a ticket to see an old silent film with live organ accompaniment.  Certainly not like like watching a silent on TV.  Thoroughly enjoyable.",
  "This is absolutely a gem. A marvelous old movie palace complete with organ that use to accompany silent films. The architecture is unique and gargoyles are plenty. This theater has so many different offerings from old movies to the latest films, live performances, stand up and concerts included. They even have an Oscar night where you can dress in costume or your finest. I took the tour it was wonderful. You can book before you go on their website. Go and enjoy.",
  "I used to come here as a kid in the '50's on Saturday morning. Cartoons followed by western triple features. You could get in with an RC bottle cap. Now, as an adult, it still looks great but smaller somehow and westerns are no longer shown. Now, it's more artsy films. Still a great old theatre."
 ]
},{
 "name": "Curtis Hixon Waterfront Park",
 "address": "600 N Ashley Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/37/ed/86/mayor-s-river-o-green.jpg",
 "tags": [
  "cheap",
  "kids",
  "walk"
 ],
 "website": "http://www.tampagov.net/parks-and-recreation",
 "source": "TripAdvisor",
 "reviews": [
  "This is a wonderful river front  venue.  If it is sunny a hat and sun screen are necessary as there is NO protection from the sun.  ",
  "Located just off I-275 in downtown Tampa, the park is easily accessible with plenty of cheap parking nearby. Located on the Hillsborough River and across from the landmark University of Tampa, the Park hosts many events throughout the year.  A lack of shade is problematic in the summer heat, but there is usually a breeze.  ",
  "City park design at its best.  Just the view of the Tampa skyline makes it worthwhile.  The giant steps down to the river work well, and the side terraces are inviting.",
  "The waterfront park was a nice stop along the riverwalk. \nGreat place where events are held. Decently busy, nice place to sit down and relax and just enjoy the waterfront views or take part in whatever event is going on.",
  "When walking the Tampa Riverwalk after some time you'll reach this very central park. Hillsborough river is on one side, while on the other you can admire Tampa downtown high rises.\nOn a sunny Jan day the park was full of people having picnic with kids playing around - a really nice spot in downtown to spend some time out.",
  "Nice place to take a stroll around the holidays , they hold a lot of events at this park , they have really cleaned the area up , beautiful scenery .",
  "Nice events, pretty area by the river,  good place to spend some time in Tampa.  Good place to relax and get some fresh air for a while.",
  "After leaving the Straz Theater, I went on a walk to Curtis Hixon Waterfront Park. I must confess it was to view my birthday gift: a commemorative brick right in the park. Nice views of the River, a jungle gyms for the kids,a dog park and plenty of benches made for a lovely afternoon."
 ]
},{
 "name": "Museum of Science and Industry",
 "address": "4801 E Fowler Ave",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/ba/4b/f0/mosi-s-five-story-imax.jpg",
 "tags": [
  "family",
  "kids",
  "active",
  "knowledgeable",
  "kids",
  "experience",
  "low",
  "kids",
  "kids",
  "run",
  "walk",
  "experience",
  "kids",
  "educational",
  "kids",
  "interactive",
  "kids"
 ],
 "website": "http://www.mosi.org/",
 "source": "TripAdvisor",
 "reviews": [
  "We're a family of 4, 2 adults and 2 kids (ages 13 and 10). We all had a blast, there's something for everyone. There are lots of hands-on exhibits. We loved the IMAX dome, which is included with admission. Would definitely recommend a visit to MOSI if you're in the area.",
  "MOSI's campus includes numerous exhibits and activities that appeal to a wide range of ages and interests. There are several traditional exhibits (earthquake area, 3d Printing, human development, etc) and several hands-on areas. Throughout the day there are engaging demonstrations where visitors interact with scientists. We saw a demonstration of a fabricated cadaver and a demonstration of a flight simulator.  MOSI's ropes course and zip line was a tremendous value - for $12 we played for over an hour on the ropes course and our kids had their first \"big\" zip line experience in a safe environment with staff who were knowledgeable and sensitive to children.   We loved the temporary Olympic-themed area that gave kids a place to try out crossbows, sprinting with real timers, soccer, gymnastics and more; all within a huge air-conditioned hall - a true miracle for Florida kids who have to battle the heat to be active.   The museum is clean and well staffed - volunteers and employees were kind, helpful and knowledgeable.    We filled our four-hour visit with the ropes course, a cadaver demo, lots of time in the area where kids test-drive robots, and ended up in the hands-on area where kids made a Pokemon craft and saw 3D printing demonstrated.   Couldn't have been a better day.",
  "Went there with a couple of tweener kids.  Spent about 4 hours total and really had a great time.  The exhibits were very good and interesting with lots of hands-on activities to demonstrate the science.  Went using the Tamp City Pass, which was a great deal since it also included Busch Gardens.  At this museum, it included the IMAX show, which was really very good (we did the mission to Mars one).  We also splurged for the aerial park and zip line.  This isn't very big, but the cost is low so it was worth it for a first try.  ",
  "The \"domed\" IMAX theatre at MOSI is wonderful, even if it does give one a tad of a neckache.  Small price to pay for a great flick like James Cameron's \"Aliens of the Deep\" or \"Hurricane on the Bayou.\"\n\nOutside the IMAX, the museum needs an overhaul.  Badly.  It's old and not very clean and there were no special exhibitions of note.   Seems like the place a local school district would run to entertain kids on field trips.   \n\nI understand from friends in Tampa that MOSI sometimes has great special exhibitions and  these are worth the admission, so check ahead!\n",
  "We experienced a MOSI special event: SKYWATCH an outdoor telescope experience.  This is an interesting and fun thing to do.  Around 7PM you park at MOSI and walk over to the West parking lot where staff have telescopes set up and trained on various celestial bodies.  They explain what you are viewing and the window of time to see that planet, star or constellation.  After everyone has had a chance to view they move to another focus and let everyone take a look.  This was a super interesting and fun event, but the incredibly helpful and knowledgable staff really made the experience great!  \n\nCheck out the Museum of Science and Industry for upcoming events!",
  "Best for class trips, heavy on nature even though nature is not in its name, butterflies to mother nature (hurricane simulation) and so much more. It's easy to g==become tired in here, so plan ahead and plan out 3 hours, before you know it, 6 hours will pass. Eat before you go, the concession stands are maybe slightly better than carnival foods. - or bring packaged foods. I gave it the 'very good' rating because it's clean, easy to find and move about inside and the hurricane exhibit is a kids favorite.",
  "This is a little smaller than I expected but then again, I'm used to the Ontario Science Centre in Toronto which is huge.  This place is great for kids, lot of educational things that are also fun.",
  "Took a four year old grandson and had a great time. As many good interactive science experiences as I have ever seen at a children's museum. Younger children would appreciate it more than the older field trip middle school students we encountered. Children get to not only touch but in some cases smell exhibits with a nice job done on space exploration. The museum is only a small part of the overall complex so I am not sure what is in the other buildings. Nice planetarium show.",
  "Our 8 and 10 yr old boys have been happy to return multiple times.  It’s relatively small, but offers a variety of hands-on activities.  If they get tired of the exhibits, there’s a great (additional fee) ropes course.  More of a mature children’s museum than adult destination, but parents can enjoy with their kids.",
  "I thought MOSI was more for middle aged children than adults. Almost every display is hands-on. There were a few exhibits that I found interesting, particularly the optical illusions. Worth a visit, but I won't go back for a few years. The omni theater hasn't been showing films for about 2 years.",
  "My boyfriend and I went for a day date.    We were both excited to visit planetarium and were both disappointed.    The speaker at the beginning was hard to understand and voice was very irritating.    Several people got up and left.   We could have watched something more entertaining and modern on the discovery channel.    Activities were outdated, some I remember doing as a child 40 years ago.    There is sooo much more they could do here."
 ]
},{
 "name": "SS American Victory Mariners' Memorial and Museum Ship",
 "address": "705 Channelside Dr",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/47/d0/8c/outside-of-ship.jpg",
 "tags": [
  "knowledgeable",
  "history",
  "history",
  "history",
  "walk"
 ],
 "website": "http://www.americanvictory.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Let's face it logistics isn't a topic that most people consider when thinking about military history, but it plays a crucial role in every conflict. Take for example its tremendous importance in World War II, a global struggle that the Allies won in part due to the massive production of tanks, aircraft, and other military equipment in the United States. To get all of this hardware (not to mention millions of American soldiers, sailors, and airmen) to the far flung battlefields around the war, a massive fleet of transport ships was needed. Of course, the Germans and Japanese tried to stop this seemingly endless stream of men and materials by sinking as many of these transports as they could - one of the great miracles of the war effort was America's mobilization of industry idled by the great depression to produce transport ships faster than the Axis powers could sink them.\n\nThe key to producing enough transport ships was the focus on mass production of a few standard types. The most famous of these was the Liberty Ship, based on an outdated British design from the early 20th century - not the most efficient or capacious vessels, but easy to build. Indeed the United States built almost 3,000 of them during war. Less well known, but just as important was the follow-on Victory Ships - a more advanced design that could carry more cargo per load and do so 50% faster, not only getting vital military supplies to the front more quickly but also making the Victory ships harder targets to catch by German or Japanese submarines. By war's end, a little more than 500 Victory ships had been produced. However today, only four remain, three as museum ships in the United States and one a half sunken hulk in Panama.\n\nSS American Victory is one of these three preserved examples and the only one on the East Coast (the others are in California). We visited her on a Sunday afternoon at her mooring behind the Florida Aquarium near the Tampa Cruise Ship Terminal. Upon parking dockside and walking up the boarding ramp, vistors pay admission ($10 for adults) and begin their self-guided tour of the ship and various exhibits relating to the war and Merchant Marine's role (docent guided tours can be pre-arranged by appointment if desired). The tour takes guest from the ship's holds up to the bridge with stops along the way to look in on crew quarters, mess decks, the captain's cabin, deck guns, etc. Along the way are displays on the Merchant Marine, including individual veteran's stories, pictures, etc. \n\nThe ship is not in the cleanest of conditions and somewhat darkly lit (Lane Victory in the LA area is in much nicer condition in part, no doubt, because it is regularly used as a filming location for movies and TV shows), and at least during our visit, there weren't a lot of docents around (we only saw one on the fantail, but he was knowledgeable and friendly). However, it is still definitely worth a stop for an hour or so.",
  "If you have any interest in WWII or naval history, don't miss this ship.  Docents are around who can answer questions.  Some description on exhibits.  A tour would be ideal if they had one",
  "Interesting visit.  This would be best received by history buffs or retired naval personnel.  The volunteers there are informative and very involved in their role.  Walking around the ship makes you truly appreciate the men that manned it.",
  "If you enjoy US History, you have got to go see and step aboard this ship. It is docked in Tampa behind the Aquarium and next to the cruise ship dock. It is well worth the price and visit as you can walk through the entire ship on your own or have a guided tour. Remember, this is a cargo ship but one that saw service in World War II, Korea and Vietnam.",
  "Ship is interesting and there were people that would answer questions and tell stories about the ship.  Ship is near the aquarium and cruise ship dock so there is a lot going on in area."
 ]
},{
 "name": "Croc Encounters",
 "address": "8703 Bowles Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/5b/71/a6/croc-encounters.jpg",
 "tags": [
  "educational",
  "family",
  "knowledgeable",
  "experience",
  "pets"
 ],
 "website": "http://www.crocencounters.com",
 "source": "TripAdvisor",
 "reviews": [
  "We were in the area, and always like to see and support wildlife rescues.  This was the first of its kind that we've seen.  It's quite small, but still worth seeing.  Entry was $10/person.  We spent an hour here.  Our favorite part was feeding the tortoises - so much fun!  There are alligators galore, as well as some other interesting reptiles.  You can feed the water turtles as well, but we got there late in the day, so even the fish were full.  So we fed the tortoises some more! (It's about $.75/leaf)  There's also an extremely friendly parrot to talk to, conveniently located next to their sand box playground.  You can get your picture taken with a baby alligator, although we did not partake.  This is not an all-day activity spot, so there isn't a snack bar.  Bring your own water and be prepared to use the  port-a-potties.",
  "Be aware that you should call ahead to reserve your place in a tour.  Mom,dad, and 3 8-10 yr olds had a great time.  Fun and educational",
  "We really enjoyed the family tour! We were able to handle snakes, alligators, & lizards. Our tour guide Clay was very knowledgeable & personable. We were able to feed tourtoises, turtles & alligators.",
  "Tyler did a great job of not only sharing his vast knowledge of the reptiles, but the experience also allows for some great human-reptile interaction.  We especially enjoyed our time with the tortoises as we helped them all enjoy a kale snack.\n\nThis place shows off these reptiles for all of the right reasons and in all of the right ways.",
  "A good portion of the reason we decided to come to Tampa is because of the good things we heard about croc encounters, and we were not disappointed. Alligators and crocodiles are my favorite animals and my husband had been researching for a place we could take a tour of rescued alligators. The tour was very informative and our guide did a great job of answering our four year old’s silly questions and outbursts. All the gators and crocs were nuisance alligators that would otherwise have been sold for their meat or hide, or were former pets. It’s so nice to visit a place that promotes education of the animals while also acknowledging how dangerous they can be. At the beginning of the tour we got to hold a baby alligator, and during the tour we were able to feed tortoises, hold snakes and different types of lizards. The price was well worth it and I recommended it for anyone who is a fan of reptiles."
 ]
},{
 "name": "Sacred Heart Catholic Church",
 "address": "509 N Florida Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/57/ba/4b/beautiful-stained-glass.jpg",
 "tags": [
  "peaceful",
  "walk",
  "active"
 ],
 "website": "http://sacredheartfla.org/",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful Ash Wednesday service today...beautiful and peaceful day! The singing with the local students was incredible and made me happy! It's about 15 minute walk from Orange Street. ",
  "We felt very welcome on our visit to this lovely church. Based on what we saw, I would judge that this is a lively, active community of worshippers.",
  "The Sacred Heart is a beautiful Neo Gothic style church built in the very center, in the business district but close to the Riverwalk.\nThe Church is built of stone blocks and the interior is great as well, with nice altar, stained glass and rose window.",
  "This is one of the oldest churches in Florida and I always love visiting it. They do a great job decorating the church for the  Christmas  season. ",
  "It’s a head turning cathedral in Tampa. I highly recommend going to this place to admire the architecture "
 ]
},{
 "name": "Wat Mongkolrata Temple",
 "address": "5306 Palm River Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/f8/7b/1b/perspectiva.jpg",
 "tags": [
  "food",
  "food",
  "food",
  "peaceful",
  "family",
  "food"
 ],
 "website": "http://wattampainenglish.com/",
 "source": "TripAdvisor",
 "reviews": [
  "Really enjoyed this place. Long lines, but the food was quite good. Nice setting, fun to feed the fish and shop for Asian plants and herbs.",
  "Great Sunday outing! All types of Thai food at reasonable prices - two can eat well for less than $20. Great picnic area to eat and view the neighboring river. Plan to arrive early (before 9:00 am) in order to find a parking spot and before the food runs out.  The line ups for food can be long, so a good strategy for couples is to split up and stand in separate lines. Highly recommended,  we'll be back for sure.",
  "Thailand is one of my favorite countries to visit and fortunately Tampa has a Thai Temple that equals any in Thailand.  Best to go on Sunday early (before 10am) as they set up a food court, garden shop and herb garden to purchase items.  Authentic, inexpensive and thoroughly enjoyable.",
  "What an incredible find in Tampa.  A beautiful temple on a peaceful manicured grounds with and diverse market of delish ethnic Thai foods and flowers......This was the place to be on a Sunday....100s of people came from all over the area to sample foods, sit by the water and eat with family and friends...\n\nI highly recommend you stop by",
  "My daughter and I wanted to take my mom to the Temple, my mom really enjoyed herself, giving gifts to the Monks was what she wanted, my mom is 73 years old and we wanted to do everything she wanted. The food was really good and authentic, my mom didn't complain, she misses her homeland. We will be back there when it's cooler, there were a lot of people there also mostly for the Thai food, They also had assortment of fruit and vegetable plants to buy majority of the proceeds go to the Temple to help the Monks with bills (I.E. electric, maintenance on Temple, water, etc, etc, etc.). The place alone is beautiful a must see if you can't make it to Thailand."
 ]
}]
