[
 {
  "name": "Sunshine Skyway Bridge",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/02/15/a3/wunderschone-brucke.jpg",
  "tags": [
   "experience"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "If you love heights, gorgeous views, and large bodies of water, this bridge is for you! After years of seeing it in pictures, it was thrilling to finally have the opportunity to drive across the Sunshine Skyway Bridge. Unfortunately, this bridge is not walkable, but the drive is lovely. ",
   "This was spectacular.  It was like an amusement park ride.  I was driving it is was difficult to keep my eyes on the road and to be honest, a wee bit nauseating.  Definitely a must see.",
   "If you’re afraid of heights, take an alternate route. 400 ft above Tampa Bay at the apex.  Just stay in your lane. ",
   "This bridge was a welcome difference for the commonly bridges we are use to seeing. It’s certainly an example of great engineering.",
   "We traveled under the bridge when on a cruise ship and wow was it an amazing experience. We saw it on way back when it was all lite up so pretty"
  ]
 },
 {
  "name": "Big Cat Rescue",
  "address": "12802 Easy St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/9d/08/71/filename-big-cat-pic.jpg",
  "tags": [
   "family"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Very poor conditions for these animals, absolutely appalling.  Obviously the people working there have no clue what they’re doing.",
   "Apparently they don’t do these tours anymore, but of course they don’t advertise or inform people of that. I went incredibly out of my way and had to pay $200 instead of $50. Not a big variety of big cats and disappointing they had 0 Florida Black Panthers, a native animal to the area... This appears to be all about Netflix ratings and money, not worth it!!!",
   "They dont do these tours anymore, I went all the way there and had to pay over $200 instead of $50. Went ahead and paid $200 and there were not many cats at all. It's all a money grab. Do not recommend.",
   "If you want an accurate take on the place, look at the reviews posted prior to the Netflix hit piece.  Did those visitors report abuse?  No.  Tiny cages?  No.  Roadside zoo comparisons?  No.  We've been to this place many times, as well as well-regarded national zoos for comparison.  We never saw cats confined to small cages or undersize pens. Seemed first-rate to us, and their focus was always on eliminating big cat trade, breeding, abuse, etc.  Regarding the show's Jerry Springer meets swamp people melodrama, I neither know nor care, but if it's as inaccurate as their description of the refuge, I'd guess that's mostly fiction, too.  We're in a very sad world when people swallow such \"reality\" shows as gospel, yet think the New York Times is fake news.",
   "This was the first time my family had visited a rescue location like this.  We enjoyed seeing the animals and hearing their stories.  It seems like they are doing good work so I would recommend going there if you have an interest."
  ]
 },
 {
  "name": "Tampa Riverwalk",
  "address": "Ashley Street",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/5e/d9/84/tampa-riverwalk.jpg",
  "tags": [
   "walk",
   "walk",
   "family",
   "walk",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Great views of the river. You can people watch and look at the big buildings, you can sit in a bench under some of the shade areas. There are few widely spaced restaurants, not any real shopping area unless you walk in a couple blocks downtown and even there you won’t find much. It’s mostly just to walk or bike or scooter and admire the view. ",
   "The tampa riverwalk is very nice. The boardwalk is good and its a nice place for people to spend time with family and just have a nice relaxing afternoon or evening.\nViews of the river are ok, the walk is good exercise.",
   "This has got to be one of the most beautiful River Walks in the country!  I just love the walk and the view of downtown Tampa.",
   "Like to walk around there at night and see the lights of the city. Good eating places in the area. Nice Adirondack chair to relax in!",
   "We loved walking the Riverwalk after our meal in Tampa, the views were awesome, the vendors were awesome and the setting was perfect!!!  I f I lived or worked in Tampa, I would be a regular there!!!"
  ]
 },
 {
  "name": "ZooTampa at Lowry Park",
  "address": "1101 W Sligh Ave",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/19/8d/f0/aa/zootampa-at-lowry-park.jpg",
  "tags": [
   "kids",
   "food",
   "interactive"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This place will leave you completely stunned if you are a nature lover and this place is definitely very popular among the locals",
   "My wife and I enjoy visiting Zoos so we were looking forward to visiting ZooTampa while vacationing in the area. There was a nice selection of animals but the layout was a little confusing but we managed.There was a small playground and some rides for kids but most of them were closed for repairs. I'm sure a lot of kids would be disappointed. We did not feel the food selection was very good either. On a positive note, the zoo was clean and the animals appeared to be well cared for. It must be a lot of work caring for animals and maintaining a zoo so supporting them is a must and maybe we visited at the wrong time.",
   "The line was long to get in but we had a good time.  Decent burgers too.  The interactive dinosaur attraction was fun.  I thought there was a good variety of animals and the zoo was quite clean.  Seemed that there were alot of benches to sit on as well.",
   "Such a great facility, happy animals and staff. I went here as a child and it’s even better now than I had remembered",
   "Fabulous!!!! Everything was amazing!  It was very reasonably priced and there was something for every age.  It was very clean and the staff was amazing.  They were very friendly to the visitors and were highly knowledgeable about the animals and loved to interact with the visitors as much as they did the animals.  Would highly recommend going.  I haven't been to a place that I loved as much as this in a very long time."
  ]
 },
 {
  "name": "The Florida Aquarium",
  "address": "701 Channelside Dr",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/72/c3/9d/the-florida-aquarium.jpg",
  "tags": [
   "walk",
   "food",
   "experience"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We had to walk around this place a few times to try to get our $$ worth.  The seahorses were neat.  Food was slightly below average.  I thought it was a bit too pricey for what we got.",
   "It is a very nice aquarium, but have seen better in Atlanta, New Orleans, Monterey, CA and Chicago. It's very kid friendly and has a neat outdoor water playground.  \nNice cafe with good food and decent prices.\nThe parking lot was already full, so we had to park in a garage 3 blocks away......and this was on a weekday in early March.",
   "Was a great way to spend an afternoon.  There was lots to see and experience.  We especially liked how upclose and personal that you could get with all of the creatures, especially in the area where the birds are flying and the turtles are right in front of you.  They even had a somewhat of an adult area where you could sit outside and enjoy a nice cool beverage with great seating.",
   "The overall aquarium was great - but as far as a very nice place for handicap access is not great.  I wasn't able to access a certain area that was a view of the aquarium looking down.  So as long as you are able to climb up the steps you can get a 100% of all views.  But since I wasn't I couldn't see what I was missing. ",
   "Enjoyed our time at the aquarium. Takes about 45 min to go through if you don't do any extras. It's a small place. Pretty expensive for what they offer. Just hoping it goes more towards the upkeep and feeding of the animals. \nNice to get out of the heat and enjoy the air conditioning. The port of tampa is right next door too. \nThey have a gift shop. Decent prices there.\nElevators to get to the second floor if you need to use them. Tons of handicap parking if you need it."
  ]
 },
 {
  "name": "Busch Gardens",
  "address": "10165 N McKinley Dr",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/4e/2d/12/rollercoaster.jpg",
  "tags": [
   "food",
   "active",
   "walk",
   "kids",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We have annual passes for Busch Gardens and Seaworld.  Busch Gardens has a great train ride around the park and good eats. If you spend all day you can either bring a back pack full of snacks or the food pass is worth it. No crazy lines and an animal lovers heaven.",
   "You have to drive through what looks like an industrial area to get to the park.  There are two parking areas - one that is close to the entrance (for extra $$) and a further one which requires a long walk or a tram ride.  The park is divided into themed areas (you'll see the Egyptian-themed area from the entrance).  There is a ton of things to see and do here, we actually didn't get to everything.  During our visit in November, they had Holiday decor throughout the park and lots of photo-ops.  The refillable mug is a good option but the process is a little inefficient - you have to have the worker scan your mug before you can use the soda machine (so they can ensure it's active I guess).  The zoo portions are well landscaped and natural looking.  At the time of our visit, they had a baby orangutan on view.  The indoor food court was so crowded and had limited seating options (mostly communal tables) but they did have a nice musical show to entertain us during our meal.  There are rides for all different ages.  The Tiger Viewing area was fun (your head pops up inside the Tiger's exhibit and we were lucky the Tiger was laying on top of it).  Young kids will really enjoy the playground area (the nearby restrooms were clean) and the Sesame Street areas.  If you come during the holiday, they offer food/drink tastings ($$) and lots of photo props.\n14 year old - Enjoyed the rides\n10 year old - Enjoyed the rides and zoo animals\n5 year old - Enjoyed the zoo animals and playground",
   "We went in March2020 just before the world has gone to pot. \nWe booked online to feed the Giraffes and honestly it was amazing for what you pay it’s an amazing price ! You drive around the ground, see all the animals then onto feeding.There wasn’t a lot of people on our tour we went on the first one in the morning best time. \nI think we paid 35GBP it was 45 in the park so pay beforehand. Have Fun",
   "We spent the entire day here.  I have NEVER seen a zoo (ish) kind-of place combined with an amusement park.  If you plan to visit Busch Garden - I highly recommend getting the meal deal for the day.  WELL WORTH IT!",
   "I will start with saying that I am HUGE Universal and Disney person, so have very high expectations for theme parks. I wasn't sure what to expect from Busch Gardens during my first visit. I was pleasantly surprised!  I would say it is a combo of a top notch zoo and Six Flags. Lots of great roller coaster options, unfortunately many were closed the day we went, so can't comment on how good they are. What my husband and enjoyed the most was seeing all the wildlife and being able to have a beer on the one restaurant patio overlooking the sarfari and watching the giraffes. Super fun and relaxing. We also were fortunate to be able to see the Concert Series in which 'Queen' was performing, and man that was fun! I really like that Busch Gardens adds in these types of performances."
  ]
 },
 {
  "name": "Lettuce Lake Regional Park",
  "address": "6920 E Fletcher Ave",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/76/8d/0a/lettuce-lake-park.jpg",
  "tags": [
   "walk",
   "family",
   "energy",
   "run",
   "hike"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Beautiful walk on wonderful boardwalk on a sunny day.  We saw a lot of wildlife, much more than on a cloudy day as I was told by someone that lives in Tampa.  Great place to spend a day with family.",
   "Lettuce Lake Regional Park is a great way to immerse yourself in nature without leaving the city.  The boardwalk winds through the wetlands with views of the lake.  A great variety of birds.  The observation tower gave us beautiful views of the lake.  We saw alligators swimming and heard owls talking to one another.  The playground is a perfect place to let the littles run off some energy.   The nature center has an informative displays and clean restrooms.   Pack a lunch and spend the day!!!  Kayaks and canoes are available to rent but did I mention the alligators??",
   "this is a very beautiful park, nature center has a lot of info. we enjoyed the boardwalk, and saw a lot of wildlife.a place not to miss.",
   "We spent the entire day here. We enjoyed the massive boardwalk which traverses marshlands and areas adjacent to ponds. We spotted numerous birds and spotted a few varieties of fish and other aquatic lifeforms. The boardwalk and park in general are very well maintained. We took a short hike on the trails which go through wooded areas as well as wet lands.  We had a very nice day here.",
   "See what old Florida was like from the comfort of a boardwalk. Nice park on a cool day but would not recommend in the Summer heat."
  ]
 },
 {
  "name": "Ybor City",
  "address": "Northeast of the Downtown Tampa on I-4 at Exit 1",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/6a/ca/6e/ybor-city.jpg",
  "tags": [
   "walk",
   "free"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "we visited ybor city on Saturday in the morning and for some time in the evening too.\nFriendly place with small restaurants. Streetcar to the city from downtown is free.\n\nYbor city is a nice area to go for a walk or stroll. Reminder of olden style town streets.\nThey have a saturday morning market which is a good place to find nice gifts/souvenirs and spend a relaxed afternoon",
   "We spent a Saturday morning browsing the market.  A nice variety of vendors.  We loved seeing the chickens wondering around.  Every downtown should adopt some!  Walked one of the main streets and stopped for lunch at Stone Soup.  It was amazing!!  Ybor is already on my list to visit again on my next trip to Tampa!",
   "Ybor City is a very friendly place with many stores, restaurants and bars. Many Cuban type restaurants. Plenty of parking areas for you along with public transportation.",
   "This place is like a bit of Cuba and New Orleans. I heard it was a bit rough before but we went in the late afternoon and everything was fine.  Great places to get some fresh rolled cigars.",
   "A little disappointed that it is basically bars and restaurants—with an emphasis on bars. But lunch at the Columbia is not to be missed!"
  ]
 },
 {
  "name": "Bayshore Boulevard",
  "address": "312 Bayshore Blvd",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/3b/74/17/photo1jpg.jpg",
  "tags": [
   "walk",
   "walk",
   "run",
   "low",
   "walk",
   "run"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Great walk to see the views of the waterfront of Tampa.\nIt is similar to waterfront views of other cities. If your already in the area, it is worth spending some time to just enjoy the fresh air and water views.\n\nThe area was busy and everyone was having a nice stroll out. Nice place to spend some time, to enjoy the sunny weather and just have a relaxed afternoon.",
   "Bayshore Boulevard is a very nice street to see Tampa Bay. The speed limit is 35 so keep your speed down as the Tampa Police patrol this area. You can walk, roller blade, run or bike along this roadway.",
   "A beautiful promenade that allows you to make walks on foot, by bicycle or on skates. It is located a short distance from downtown and allows you to spend a few hours of relaxation. The only problem is the continuous passage of the machines in the parallel road which creates a lot of noise. I am a travel agent with a group for a tour.",
   "I've read somewhere this is the longest seaside boulevard in the world. Didn't really measure it, but it was a long, very long drive passing by beautiful homes and gardens on one side and Tampa Bay on the other.\nThere's a walking, jogging and cycling path just by the shore, but I didn't see many using it, probably because it was almost noon on Florida sun.\nIt was great cruising the blvd at low speed with AC on and great music admiring the surroundings.",
   "Take a walk, allegedly on the longest sidewalk in the world (who is going to challenge that?)..... 10 feet wide and 4.5 MILES LONG. Benches, scenic views, photo opportunities and water. Take a run. Bring a towel and get some sun. Breathe the air. Say hello to someone you don't know. That someone might be the person you'll spend the rest of your life with. \n\nTampa... you've created a beautiful thing....\n\nBy the way, the Bayshore Boulevard and long sidewalk is not the Tampa Riverwalk... which is a horse of a different color, a separate and distinct entity."
  ]
 },
 {
  "name": "Amalie Arena",
  "address": "401 Channelside Dr",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/73/43/69/st-pete-times-forum-i.jpg",
  "tags": [
   "walk",
   "food",
   "low",
   "experience",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "My wife and I are Andre Rieu fans and have seen his show a few times at other venues.  We purchased parking at the Arena in advance via Park Whiz for $16.14, which turned out to be a good choice as we were able to park adjacent to the Arena and walk right into the venue without crossing streets or going a long distance.  (Be sure to have your proof of purchase handy as you are asked to show it prior to entering the parking structure.)  Getting into the Arena parking was a nightmare due to heavy construction taking place all around that part of town and due to various police and other personnel that had lanes blocked without signage and which were giving rather confusing and conflicting directions.  Give yourself plenty of time to drive to the venue as the traffic in the Tampa area was very heavy on the way to and all around the Arena.  If you need to eat prior to your event, there is the Firestick Grill inside the Arena that you must pay for and reserve in advance.  However, at $60 a head for a fine dining buffet, I recommend dining elsewhere unless you want to splurge for a special event.  (The food and service were excellent.  There is also a Cigar City Brewing restaurant adjacent to the Arena on the west side that may be a better option but I recommend reservations if possible as they get packed.)  The Arena is a nice venue however, you may or may not be happy with your seating if you are attending a concert.  For our concert, we were seated on the main floor and it was difficult to see the people on the stage at times due to others seated directly in front of us on the same level flooring (and of course with their damn cell phones rudely raised above their heads taking video so no one behind them could see.)  So, if you are attending a concert, you may want to explore getting a seat near the front but off to the upper right or left side of the stage so you are seated above the floor and the seating is inclined so your view is not obstructed as much.  They have large screens so you can see some of what is taking place on stage close up and the sound system was very good with no feedback or problems noticed.  I would recommend this venue for a concert however, I highly recommend you do your research in advance so you have the least amount of issues possible getting into and out of the area.",
   "This is an awesome place for concert venue. The place was packed but did not feel crowded. The staff was amazing!!",
   "Easy in and Easy out this Arena has all the amenities and plenty to keep you entertained close by!\nWe have always had a great time when ever we have attended an event.",
   "While security is always important the arena MUST do better with their screening. Only about 10,000 were at this event, doors opened early, (someone made a good call), yet the show was delayed with hundreds waiting outside to be screened. Our scanner was set so low, the person manning it called a supervisor because EVERYONE was setting it off. I had only a dress belt with small buckle and my wife only undergarments and we both set it off. It was so ridiculous the security person with the wand told us to go ahead without further checking. At our doors, one of many entry points 90 minutes after opening hundreds were still in line at our door alone. The arena needs to get way better at making the event secure in a much more efficient manner. You pay a lot and deserve to see the full show and not be so inconvenienced. This wasn’t the first time the arena was doing this and to be so poor at doing it was inexcusable. Be the first in line or take your chances.",
   "First time at the arena and had a very good experience.  Sound system was terrific, seating was great (we had floor seats), and enjoyed a snack and drinks before show at the various stands.  The cuban sandwich was terrific.  Prices for drinks and food were super expensive.  "
  ]
 },
 {
  "name": "TECO Line Streetcar System",
  "address": "1201 E 7th Ave",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/07/a6/03/teco-line-streetcar-system.jpg",
  "tags": [
   "free",
   "family",
   "free",
   "free"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Excellent transportation to connect visitors between Ybor city and Downtown Tampa. It does go through the central points in between to have people see different areas and get to enjoy Tampa without having to drive.\n\nThe streetcar is free and is a great way to spend a day between ybor city, downtown tampa, go along tampa riverwalk and overall spend a relaxed day in Tampa.",
   "The TECO Line Streetcar System is a great way to explore all the attractions in and around the city of Tampa. It is great way to move the family around town.",
   "Plenty of stops in downtown and Ybor City. The streetcars are currently free and require no ticket - just hop and off. They have a lot of character and are easy to navigate.",
   "Thanks Jay! We appreciate you taking us two stops so we could say \"we rode the trolley\", an not letting us go all the way to YBOR.  :) ",
   "It was quite thrilling riding a streetcar.  When I was a kid, I could still see the rails that the car rode on.  It is a pleasant trip to ride and look out the window...for free I might add!  Nice touch TECO.  Thanks for the ride!"
  ]
 },
 {
  "name": "Glazer Children's Museum",
  "address": "110 W Gasparilla Plz",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/57/41/82/glazer-children-s-museum.jpg",
  "tags": [
   "experience",
   "educational",
   "kids",
   "kids"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "The museum is small, but has many interesting and high quality educational exhibits.  Unfortunately, many of them were not working properly during our visit.  It was quite crowded the day we were there (Saturday) and my son was not able to experience several exhibits because some of the other visitors were not not giving others a turn.  I would recommend visiting during the week to avoid the crowd if possible.  We saw everything in the museum in 1.5 hours.  Not sure this one is worth the cost of admission, but my son did enjoy himself for the short amount of time that we were there.",
   "No reciprocity with the Tampa History Museum. Grandson liked it. Should have known we were going to have to pay through the nose since the glazers name was on it. We're still paying them for the stadium.",
   "If you like quiet this isn't the place for you as noise carries terribly.. Reasonably priced and loads of activities. Our granddaughters especially loved the Publix play store,  the EMT play area and the firehouse.  They like the Japanese area and played at tea party tables. I think their favorite based on time spent intently engaged was the water feature complete w rainstorms and the beach area.  They have a Subway on premises which was handy. Our 8 year old granddaughter is terrified of heights which kept her from several activities but there were still many she enjoyed. ",
   "Visiting Tampa for the weekend i really wanted to bring my kids here. There are several things for the kids to participate in like grocery shopping, a small ball pit area for younger children, firehouse area. My kids were a bit disappointed the water area with the small boats wasnt working but they got over it quickly. I will say they seem to have gotten bored after an hr but with the price i needed them to stay longer. They seem to enjoy outside the museum and the park just as much.. overall it was a great visit and we would visit again.. of course with anything downtown parking was hectic but thats no fault to the museum.",
   "Fun for kids of all ages! Best for ages 3-8 but things for all ages, they have activities, and a dozen or more different play areas from climbing to a huge water area, kitchen, music area and more. We spent about 2hrs but I think for older kids, it could be even longer (we have a 20 month old). "
  ]
 },
 {
  "name": "Henry B. Plant Museum",
  "address": "401 W Kennedy Blvd",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/b6/70/3c/the-plant-museum.jpg",
  "tags": [
   "learn",
   "historic",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "A snapshot of an age gone by. Lots of historic furnishings and a self guided audio tour. Much of the building is given over to the administration of the University of Tampa. The museum itself is a portion of a hallway on the main floor of the former hotel. \n\nI did learn more about Henry Plant and a few things about privilege during the era that the hotel that this was. For some reason, I was mostly blasé about this museum. I see that many others are more enthusiastic about this attraction, I found my expectations varied from what I experienced.",
   "This is a small museum in a former hotel, very grand in its day, that is now part of the University of Tampa.  The collection is along a hallway on the first floor.  It is not professionally curated, so don't have expetations that this is a \"Smithsonian level\" exhibit.  Rather, it is a collection decorative arts and memorabilia from when the hotel was a showplace for the rich, during the Guilded Age.  \n\nAdmission to the museum provides a audio tour which was quite helpful and interesting.   \n\nIf you have an hour, this is well worth a visit.",
   "Was an amazing building and hard to believe was built all those years ago. It’s great that some of the interior has been retained in its original form. \nThe audio tour guide supplied gave so much information. Was money well spent and very reasonable price too. \nA must see place if you’re in the area. ",
   "This museum brings the life of Henry B Plant to people that want to know more about the early history of Tampa Bay. Very well done.",
   "When visiting the area we made it a point to see the Plant Museum and were glad we did.  Wonderful architecture and great period details and all annotated with wonderful stories.  So glad this building has a modern use so that some of it can be preserved as a museum.."
  ]
 },
 {
  "name": "Yuengling Brewery",
  "address": "11111 N 30th St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/33/e0/94/entryway-with-tour-times.jpg",
  "tags": [
   "walk",
   "free",
   "experience",
   "history"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Looking for something to do in Tampa which is complimentary and offers tasting samples? Yuengling Brewery offers free tours of their Brew Factory many times a day so, the Kid and I were in!\nYuengling IS the oldest Brewery in the US! It originally began in Pottsville, Pa in 1829, that's 191 years old.\nYEP! It beats out it's Budweiser, the competition by several years. BW was \"born\" in 1852. The Eagle is original to Yuengling and when BW decided to sue Yuengling for the Eagle copyright, BW lost. \nBack to the tour. The tour is very casual but, organized. Meet in the Guest Center, sign in the guest book, grab a wristband and then wait for the tour to begin. While waiting, one can browse the Gift Shop, walk the grounds or enjoy a beer before the Tour.\nA short oral presentation along with a short film is given at the beginning of the tour. You will be split into smaller groups (no more than 20 people) so, you can hear the Guide's complete description as you move from building to building. HEADS UP: NO photos are allowed in the interior except for the Guest Center. Yuengling is very sensitive to their formula and processing. It's ok, cause you can still take some great exterior photos.\nThe tour last for about 90 minutes. There are stairs and it's all walking so, wear comfy shoes. Parking is also FREE. Q & A's are encouraged!\nAfter the tour, you can enjoy popcorn and 2 complimentary samples back at the Guest Center.\nGreat 1st date!",
   "The rums were great even the coconut one which I definitely was ready to not like being I don't usually like coconut but the coconut flavor wasn't over bearing.  I liked their rums so much I ended up buying 6 bottles when I only planned on buying 1 but it was too hard for me to choose only 1",
   "Interesting tour and then the sampling room. Try different Yuengling brews, but do it quickly. You get about 10 minutes before they close uo for the next tour group!",
   "Our birthday visit was nothing short of amazing. The tour alone was astounding but our tour guide put the whole experience on another level! Vickie lord is a bright light of amazing facts and corky jokes , nothing short of a perfect time, thank you yuengling, you all really made our friends birthday 15/10",
   "Reserve your tour in advance to guarantee your time.  If not, you'll sit in the Tasting Room, waiting for the next available tour.  Not a bad strategy because you can sample the fine beer selection fresh from the tap (or bottle). We've visited on Fridays when brewing activities are slow (not much production going on), but then you get to spend more time in the Tasting Room. All tour guides are very nice, efficiency minded, and very well informed about Yuengling history and products.  This brewery is better than any micro-brewery or craft brewery in Tampa."
  ]
 },
 {
  "name": "Tampa Bay History Center",
  "address": "801 Old Water St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/1a/04/6e/68/the-tampa-bay-history.jpg",
  "tags": [
   "history",
   "interactive",
   "family",
   "history",
   "experience",
   "family",
   "interactive",
   "history",
   "interactive"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Our visit to the Tampa Bay History Museum improved our knowledge of the history of Florida and of Tampa Bay. The quality of the exhibits was excellent and many were interactive and suitable for younger museum goers. \n\nWe chose to to visit the museum on a day between spring training baseball games and were not disappointed. The museum itself begins on the 2nd floor of the dedicated building in which it's housed. The first exhibit encountered is for Florida's first peoples and also addresses 'interactions' with Spanish Conquistadors, the short film is worth viewing. Also from this floor, we enjoyed learning more about the Cigar industry in Tampa and what we took away dove tailed nicely with some of what we learned at the Plant museum earlier.\n\nWe found the next floor a little less compelling although it does fill in more contemporary aspects of Tampa history. More fun was the floor above this as it concerns privateers and pirates. I got to see if I could remember how to tie some sailing knots and the theater presentation was entertaining even if it's obviously aimed at a younger crowd. BTW, I finally figured out the difference between an Astrolabe and a Sextant.\n\nThe museum was well worth the couple of hours we invested. We rounded out our trip by enjoying a stroll along the Tampa Riverwalk that begins just outside the building.",
   "This history center can be enjoyed by the whole family. It is very well presented and is very factural. I highly recommend this attraction.",
   "This is a really interesting and sophisticated experience for all the family: as well as being factual, it's truly interactive - and fun, too! You can read, watch video, shoot cannonball at enemy pirate ships, go shopping for cigars, see how people lived and worked in Ybor City and much more!",
   "Immaculate presentation of the area’s history. Wonderfully preserved and presented artefacts. Entertaining, interactive displays.  Loved it.",
   "We spent an enjoyable two hours here learning quite a bit about the early years, especially the first Western contact, which was all pretty new to us. (It didn’t go well for either the Spanish or the native peoples, in case you’re wondering!)  The video presentations are well done. However the written labels are small to read comfortably.  Don’t miss the outdoor viewing platform on the top floor.  On a Wednesday afternoon we had the whole place almost all to ourselves. "
  ]
 },
 {
  "name": "Raymond James Stadium",
  "address": "4201 N Dale Mabry Hwy",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/08/28/dd/raymond-james-stadium.jpg",
  "tags": [
   "walk",
   "food",
   "family",
   "kids"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This is one of the best NFL stadiums. Along with football, professional and college, it is a great place to see a music concert.",
   "We were here for the home opener of the XFL Tampa Bay Vipers season. Very nice stadium, easy access, easy parking, quick entry and exit. The club seating was very comfortable, the concession area was also very comfortable. Top quality football stadium.",
   "I'm a Bucs season tix holder, and this is a nice stadium not just a football game but for any event.",
   "We were not there for a football game but the stadium was very full. Parking was simple in the lot we chose. Pirate ship in the end zone is a cool feature. The mast somewhat blocks the screen depending on your seats. Restrooms were stocked and clean. Easy to navigate. Plenty of food choices. Vendors walk the stands so you don't miss much. Tailgating was the way to go because food and drinks inside are pricey. That's probably same at any stadium. On the way out the traffic is all going in the same direction, so that makes it simple to leave. Didn't take as long as I thought it would. We enjoy events and games there.",
   "Took my family to Monster jam Feb 1  what a bust it was like a bunch of school kids put this on.\nAll the car crushing, Atv racing,  motor cycle stunts are gone.\nwaited longer for them to set up on a oval track then they did race been going to monster jam for over 10 years boy has it changed for the worst no wonder why stadium was halve empty\nKinda mad about all the fees you have to pay just to buy tickets good old ticket master\ni think that monster jam should promote themselves and put more money back into entertainment instead. i seen better monster trucks at local mud holes than this\nfirst 5 trucks broke down in the first 30 second of start up no even jumping this was a complete joke and a big let down"
  ]
 },
 {
  "name": "George M. Steinbrenner Field",
  "address": "1 Steinbrenner Dr",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/71/03/88/steinbrenner-field.jpg",
  "tags": [
   "food",
   "food",
   "free",
   "food",
   "walk",
   "experience",
   "family"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I've been to NYC many, many times but have yet to make it out to the Bronx. Catching a game between the Yankees and my home town Blue Jays at Steinbrenner Field seemed the next best thing and, it was.\n\nIt was a beautiful, sunny, hot day in early March and we had decent seats and were joined in the park by many Jays fans. This was our first baseball game since October and we thoroughly enjoyed the game. As well the facilities seem first class and the sight lines were excellent. I personally enjoyed seeing a live game played on a field that has the same dimensions as Yankee Stadium in NYC. \n\nSo, what's not to like? Well, we're not in New York and it's spring training. The outcome of the game doesn't mean a thing and the normal starters are in for 1/2 the game at most. So $45/ticket is more that 4X the price of a ticket to see the Blue Jays play on their home diamond in nearby Dunedin. Also, the day we were there, the direct access from the parking not too far away at to which we were directed by Waze was intentionally closed. There were many, many available spaces but the road signage was directing everyone to paid parking. We walked.\n\nIf I'm at a real MLB game I would expect big league prices for food. This isn't NYC, the field is home to the Tampa Tarpons for the regular season. I would have loved to have had a Hot Dog and a Beer but declined to partake due to the prices. \n\nI'm glad we caught a game at Steinbrenner but I suspect it will be a one time thing.",
   "Great venue for a game!!! Not a bad seat in sight, plenty of concessions and lots of room!!!  the food and the shop were better than expected!!!  a truly world class organization!!!",
   "As a life long Yankee fan we always try to catch them when they are in the state of FL. We ended up getting these tickets free when we did the Sprint to Spring 5k. It was Gerrit Cole’s debut. We had a good time and the concession pricing really wasn’t that bad. The park is beautiful. ",
   "Great time at Steinbrenner stadium!  The facility is great for both families with young children and adults just out to enjoy some good baseball.  We were lucky we got there before they shutdown Spring training for this year.  We loved all of the bars and food choices.   We will definitely go back next time we’re in the Tampa area!",
   "I will start with the good:\n\n1.  The stadium provides an intimate baseball experience.  Kids can see the players up close and there isn’t a bad seat in the house.\n\n2.  Pearling prices are reasonable and only a short distance from the stadium.\n\nThat’s about it.\n\nWhich brings us to the bad:\n\n1.  Ticket prices are astronomical to watch Major Leaguers play a short period of time.\n\n2.  After the first few days of spring training the practice schedule is not published and there is not a good way to determine when you can take the family to watch the game.\n\n3.  Kids cannot walk up to the wall in the lower levels during BP prior to the game.  My children were very disappointed they could not get close to the players.  It is also disappointing for the price of the ticket.\n\n4.  Food is pricey.  Major league prices for minor league ball.\n\n5.  Security staff is rude and dismissive when asked mundane questions about how spring training works.\n\nOverall, this was a bust for my family and I recommend you think hard before dumping a lot of money into this trip.  If you want to pay NYC prices, make the trip to the Stadium."
  ]
 },
 {
  "name": "Seminole Hard Rock Casino Tampa",
  "address": "5223 Orient Rd",
  "avg_visitor_review": "3.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/94/d5/ed/seminole-hard-rock-casino.jpg",
  "tags": [
   "walk",
   "free"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "I've been to many casinos in my years.  But, this was the first place I felt like I wasn't old enough to be there. I know Florida attracts a ton of seniors but it was the majority in the casino.  The air filtration could not circumvent the amount of cigar, cigarette, & vape smoke.  The crazy part were the ones with oxygen on and still there.  Slots were okay until one machine just froze for over 20 minutes and trying to get help was ridiculous.  You couldn't walk away because the built up credits were still on the machine so you couldn't cash out.   The tables stayed packed so never really an opportunity to sit and play, I won't be back that's for sure.",
   "The Seminole Hard Rock Casino in Tampa Florida is the best casino I have ever been to. Plenty of surface and ramp parking. Lots of slots and table games to try your luck on. If you are hungry, there are many restaurants to select from including the Hard Rock Cafe.",
   "As casinos go this is as nice as any I've been to before.  Staff is friendly and helpful.  Plenty of slots and tables and not too busy. Well marked signs assist you in finding different areas within the casino. Valet parking is expensive but if you have someone handicapped worth the expense.  There is a fairly large non-smokiing area but I found the ventilation was good in the regular areas.",
   "Visit was later on a Friday night. 4 40 something adults. Casino Was nothing different than any other casino.  \nI ordered a pineapple vodka and 7up $13 6oz.",
   "This is my 4th visit this year, have yet to go home with any money or find it a fun place to gamble. This will probably be my last visit.   Food is good, not excellent, a burger will cost you $16, for a $10 burger at most other places.   Most sandwiches above $13 and under $10 at other places, oriental chicken salad $19,   10 oz steak $33 alcart, add $5 plus for salad etc.   My visits have been about an hour because the slots don't play.  Played put a hunderd in a $5 a spin slot, never paid out more than $10 and my $100 was gone in less than 30 minutes.   Not fun when they don't let you sit a play, they just take for the most part. Tried several more machines bet was always $1 or much higher because when you play .50 you get.05 or .25 or mayber 110 returned.  Not often do you even get our play back.  Either I play the worst machine in the place or wrong timing,  Started on a  Pot that closes after someone just left and pot was full.   I put $200  plus to get that pot to close, never got free games or bonus, but the pot did close and paid me $28.00. moved on again.    Very tight slots in my opinion, but you luck may be better."
  ]
 },
 {
  "name": "International Plaza and Bay Street",
  "address": "2223 N West Shore Blvd",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/26/da/d2/international-plaza-and.jpg",
  "tags": [
   "food",
   "walk",
   "food",
   "food",
   "food",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "International Plaza Mall is great! It's absolutely beautiful, clean, not terribly crowded, has a wide variety of stores ranging from Burberry to Forever 21, as well as a state of the art food court including chains such as Chipotle, Earl of Sandwich, Chick-fil-a, etc. It is also within walking distance from many hotels, such as the Westshore Hilton, where I stayed during my last visit to Tampa. Truly a great mall, highly recommend to anyone staying nearby.",
   "This is a very large two story mall with high end stores throughout. Lots of good restaurants and a large food court area. It also has numerous outdoor restaurants with seating galore. You can make some miles here if you want to walk all areas of the mall. Was not that busy when we were here. Nice location close to the airport.",
   "This is a great mall that is anchored by Dillards, Nieman Marcus, and Nordstroms with lots of wonderful mid to high end shops throughout it.  The Dillards is the best of its kind in the region, and the Nordstroms is a standard one with lots of great accessories and shoes.  The mall has a wind range of shops to include Janie and Jack, William Sonoma, and Talbots.  It has a large indoor childrens playground near the Disney store on the first level.  There is a traditional food court, and there are many restaurants in the Bay Street area adjoining the mall to include The Capital Grille and Cheesecake Factory.  Valet parking is available and easy to use.",
   "This is a huge mall with a lot of high end stores.  They have some really nice outdoor/indoor restaurants to dine in. Plenty of food choices and it's nice to see you can eat inside or outside.  The mall offers many choices of stores, high end stores that are not in the west shore mall and this mall is just about a mile away on the same road. You should visit both.",
   "The Bay Street is fun and happening place to hang out!  We ate at Rocco;s Tacos, and the food was good.  It is a bit loud, so if you want quiet, don't go here."
  ]
 },
 {
  "name": "Adventure Island",
  "address": "10001 McKinley Dr",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/14/5b/80/big-splash-tube.jpg",
  "tags": [
   "family",
   "family",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Adventure Island in Tampa Florida is a fantastic place to take the whole family. Plenty of parking. The staff is very helpful and friendly.",
   "The Adventure Island Water Park in Tampa Florida is a great compliment to Busch Gardens Tampa. After a great day at Busch Gardens, try your water skills at the water park.",
   "The walkways were filthy, steps to slides were old, very slippery with scum and mold, water did not have that \"clean\" feeling.  It felt like you were coated with scum when you got out.  Staff was unhelpful, disinterested, sloppy and very few around to assist for bathroom locations.  When bathrooms were located they were filthy.  Contacted customer service regarding misbilling to my credit card, I purchased a year end pass and they billed for annual pass.  Fraudulent business practice.  We purchased the Fun pas in June for 4 months, knowing the park would be closed October to March.  I was billed for an annual pass.  Ridiculous, whey would I purchaase a pass for a park that I know is closed for 5 months.  Spoke to customer service, she could not even find my recurring charges.  Spoke to a supervisor, Micki, unhelpful, avoided answering questions, refused to refund, kept telling me \"this is a contract\".  Very rude.  I explained I purchased a Fun pass not an annual pass, their records show different she said over and over again \"this is a contract\" as if I was stupid and did not get it the first time.  Completely unprofessional,  I asked for the billing department and was told there was none.  Absurd.  It was obvious the supervisor Micki lacked training, courtesy, customer service skill and absolutely no dispute reconciliation training or skills.  Very dissatisfied with the park and the customer service.",
   "My son and I love Adventure Island and he always asks when it will reopen. The park itself has been improving and love everything about it.",
   "So recently I visited adventure island and oh ! I had so much fun. It’s a great place to spend some memorable time with your friends and family. It’s worth spending money. You can have unlimited rides and dance. There are some good places to have food. A must visit"
  ]
 },
 {
  "name": "Courtney Campbell Trail",
  "address": "",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/bf/b9/33/lots-of-trees.jpg",
  "tags": [
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "The Courtney Campbell Trail offers a fantastic walk and bridge trail for bikes, roller bladers, runners and walkers. ",
   "This trail is perfect for morning walks!!!  The views are great, the traffic is not overwhelming, and we saw all kinds of birds, a few lizards and a dolphin!!!",
   "A very pleasant and scenic drive over this well paved local roadway joining Tampa and Clearwater, Florida. ",
   "nice scenic ride-watch out at intersections but otherwise pretty safe and well paved. also quick ride to safety harbor on the west side.",
   "Great Causway to ride on to and from Clearwater and Clearwater Beach, Florida. The trail off to the sides good for fishing "
  ]
 },
 {
  "name": "Cigar City Brewing",
  "address": "3924 W Spruce St",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/d5/f7/c3/the-tasting-room-really.jpg",
  "tags": [
   "kids",
   "food",
   "food",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "At the Tampa International Airport, Cigar City Brewing has a restaurant where I passed some time waiting for my plane, which was 2 hours late.  I ordered a Cuban sandwich and a pale ale.  Both were tasty and worth the price.  However, I had lost my cell phone in the terminal!  I didn;t realize that at the time, but when I did the staff at the restaurant was totally helpful in trying to find the phone, calling the number, making suggestions, etc.  In the end I found the phone near the gate that I had visited to check on the plane's departure.  The staff made the visit pretty good, and I have to thank them, knowing that if any other traveller gets into the same situation they will do their best to help.",
   "We visited Tampa on a whim and stopped by Cigar City Brewing with our small kids. The staff is friendly, beers are great. The tours were cancelled indefinitely, so we'd like to try it next visit. I heard it's $8 per adult which was a good deal seeing how you get samples. The food looked good, decently priced. A nice place to visit and it's dog friendly too.",
   "Was here several years ago and was surprised how much the place has expanded - both the taproom and the choice of beers. I had a Cafe Americano (double stout with chocolate and vanilla) - excellent. Friendly bartenders ",
   "We where staying in downtown Tampa for a night, visited the  Y'Bor area  during the early afternoon which was ok but had a lot of  inebriated folks around so decided to go back to our hotel and get an Uber to the CCB\nSo pleased we did, based in  a warehouse the place basic but well organised, found our selves a table and asked the waitress  to explain the beer selection\nThis she did with enthusiasm and I ordered a tray of three taster glasses, they went down well so ordered another three and some food.\nServer (sorry I did not get her name) was very chatty and informed me that the manager had bought the last three samples for me as we where on my 60th birthday  road trip, such a nice and unexpected gesture\nThe Uber was around 7 dollars from The Marriott Downtown so all round a great trip",
   "This place was totally revamped since my last visit.   It is much more roomy and now offers food.  I ordered a sandwich and it was pretty good (burger).  Staff was very friendly "
  ]
 },
 {
  "name": "Tampa Bay Downs",
  "address": "11225 Race Track Rd",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/6b/86/e6/tampa-bay-downs.jpg",
  "tags": [
   "drink",
   "free",
   "low",
   "family"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Tampa Bay Downs is open everybody is social distanceing. Its a small track has all the facilities. The staff is great. The race I enjoyed, Remembering Baseball wins the madien. The weather is wonderful.",
   "It was such a fun time here.  The horses were so beautiful and it was a gorgeous day to be outside.  We used Groupon which offered valet parking, special seating and a free drink!",
   "Tampa Bay Downs have live racing Wednesday Friday Saturday and Sunday. The restaurant on site is very good place to eat.",
   "If you want something different to do and don't want crowds and being enclosed at Hard Rock Casino, Tampa Bay Downs is really fun. You can bet as low as a $1 bet and watching the horses and how majestic they are, is really neat. Food is pretty good. Shade available but seats in full sun too. You can stand right up against fence to see horses whiz by. Can be in and out in a couple of hours.",
   "This is such a fun day to take your friends and family who visit. You don't need to go the the beach EVERYDAY!!!\n\nBuy a Groupon which includes valet parking, admission with stadium seating,  a program, one $2 bet and a $5 voucher for lunch.   Open Wednsday, Friday, Saturday and Sunday...so plan accordingly.  \n\nGood luck!"
  ]
 },
 {
  "name": "Tampa Theatre",
  "address": "711 N Franklin St",
  "avg_visitor_review": "5.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/6f/9b/d2/under-the-night-sky-in.jpg",
  "tags": [
   "historic",
   "history",
   "unique"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This historic theatre opened in 1926 and was designed as a movie theatre by John Eberson. It was an opulent movie theater and, by the end of the 1920's, more then 90 million Americans were going to the movies every week.  But, by the 1960's and 1970's, going to the movies was no longer the great American past time and the theatre was in poor repair.  Many of the theatres of the time were demolished.  In 1978 the theatre had been restored by the city of Tampa and reopened with films, concerts and special events. The foyer is spectacular and showcases the 2004 renovation that took place.  The ceiling in the foyer is a blue night sky with \"stars\" and the restored woodwork is gorgeous.  There are tours only on weekends and you most likely will need advance reservations, available on their website.  At the end of the very excellent tour we had an explanation of the Mighty Wurlitzer Organ and a short concert.  It was spectacular!!  I would recommend this tour to anyone who likes and appreciates historic buildings!",
   "We came here on Saturday night to enjoy a musical concert/performance by Post Modern Jukebox (PMJ). We were seated in the 4th row from the stage . The view and location was awesome!\n\nThe theatre itself is worth a visit.",
   "A 1926 Movie Theater meticulously restored to its glory days of the silent film.  Take the 2 + hour guided tour of this beautiful theater will acquaint you to the films of the past present and future.  Watching and seeing an organist make the original Wurlitzer pipe organ come to life is worth the nominal tour fee - what a sound!  The CEO of the non-profit historical theater is your guide, and knows all the history and more that willing to share it.  If you miss the tour, buy a ticket to see an old silent film with live organ accompaniment.  Certainly not like like watching a silent on TV.  Thoroughly enjoyable.",
   "This is absolutely a gem. A marvelous old movie palace complete with organ that use to accompany silent films. The architecture is unique and gargoyles are plenty. This theater has so many different offerings from old movies to the latest films, live performances, stand up and concerts included. They even have an Oscar night where you can dress in costume or your finest. I took the tour it was wonderful. You can book before you go on their website. Go and enjoy.",
   "I used to come here as a kid in the '50's on Saturday morning. Cartoons followed by western triple features. You could get in with an RC bottle cap. Now, as an adult, it still looks great but smaller somehow and westerns are no longer shown. Now, it's more artsy films. Still a great old theatre."
  ]
 },
 {
  "name": "Curtis Hixon Waterfront Park",
  "address": "600 N Ashley Dr",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/37/ed/86/mayor-s-river-o-green.jpg",
  "tags": [
   "kids",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "The waterfront park was a nice stop along the riverwalk. \nGreat place where events are held. Decently busy, nice place to sit down and relax and just enjoy the waterfront views or take part in whatever event is going on.",
   "When walking the Tampa Riverwalk after some time you'll reach this very central park. Hillsborough river is on one side, while on the other you can admire Tampa downtown high rises.\nOn a sunny Jan day the park was full of people having picnic with kids playing around - a really nice spot in downtown to spend some time out.",
   "Nice place to take a stroll around the holidays , they hold a lot of events at this park , they have really cleaned the area up , beautiful scenery .",
   "Nice events, pretty area by the river,  good place to spend some time in Tampa.  Good place to relax and get some fresh air for a while.",
   "After leaving the Straz Theater, I went on a walk to Curtis Hixon Waterfront Park. I must confess it was to view my birthday gift: a commemorative brick right in the park. Nice views of the River, a jungle gyms for the kids,a dog park and plenty of benches made for a lovely afternoon."
  ]
 },
 {
  "name": "Museum of Science and Industry",
  "address": "4801 E Fowler Ave",
  "avg_visitor_review": "3.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/ba/4b/f0/mosi-s-five-story-imax.jpg",
  "tags": [
   "kids",
   "educational",
   "interactive",
   "handson",
   "kids",
   "handson"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "This is a little smaller than I expected but then again, I'm used to the Ontario Science Centre in Toronto which is huge.  This place is great for kids, lot of educational things that are also fun.",
   "Took a four year old grandson and had a great time. As many good interactive science experiences as I have ever seen at a children's museum. Younger children would appreciate it more than the older field trip middle school students we encountered. Children get to not only touch but in some cases smell exhibits with a nice job done on space exploration. The museum is only a small part of the overall complex so I am not sure what is in the other buildings. Nice planetarium show.",
   "Our 8 and 10 yr old boys have been happy to return multiple times.  It’s relatively small, but offers a variety of hands-on activities.  If they get tired of the exhibits, there’s a great (additional fee) ropes course.  More of a mature children’s museum than adult destination, but parents can enjoy with their kids.",
   "I thought MOSI was more for middle aged children than adults. Almost every display is hands-on. There were a few exhibits that I found interesting, particularly the optical illusions. Worth a visit, but I won't go back for a few years. The omni theater hasn't been showing films for about 2 years.",
   "My boyfriend and I went for a day date.    We were both excited to visit planetarium and were both disappointed.    The speaker at the beginning was hard to understand and voice was very irritating.    Several people got up and left.   We could have watched something more entertaining and modern on the discovery channel.    Activities were outdated, some I remember doing as a child 40 years ago.    There is sooo much more they could do here."
  ]
 },
 {
  "name": "SS American Victory Mariners' Memorial and Museum Ship",
  "address": "705 Channelside Dr",
  "avg_visitor_review": "4.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/47/d0/8c/outside-of-ship.jpg",
  "tags": [
   "history",
   "history",
   "history",
   "walk"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Let's face it logistics isn't a topic that most people consider when thinking about military history, but it plays a crucial role in every conflict. Take for example its tremendous importance in World War II, a global struggle that the Allies won in part due to the massive production of tanks, aircraft, and other military equipment in the United States. To get all of this hardware (not to mention millions of American soldiers, sailors, and airmen) to the far flung battlefields around the war, a massive fleet of transport ships was needed. Of course, the Germans and Japanese tried to stop this seemingly endless stream of men and materials by sinking as many of these transports as they could - one of the great miracles of the war effort was America's mobilization of industry idled by the great depression to produce transport ships faster than the Axis powers could sink them.\n\nThe key to producing enough transport ships was the focus on mass production of a few standard types. The most famous of these was the Liberty Ship, based on an outdated British design from the early 20th century - not the most efficient or capacious vessels, but easy to build. Indeed the United States built almost 3,000 of them during war. Less well known, but just as important was the follow-on Victory Ships - a more advanced design that could carry more cargo per load and do so 50% faster, not only getting vital military supplies to the front more quickly but also making the Victory ships harder targets to catch by German or Japanese submarines. By war's end, a little more than 500 Victory ships had been produced. However today, only four remain, three as museum ships in the United States and one a half sunken hulk in Panama.\n\nSS American Victory is one of these three preserved examples and the only one on the East Coast (the others are in California). We visited her on a Sunday afternoon at her mooring behind the Florida Aquarium near the Tampa Cruise Ship Terminal. Upon parking dockside and walking up the boarding ramp, vistors pay admission ($10 for adults) and begin their self-guided tour of the ship and various exhibits relating to the war and Merchant Marine's role (docent guided tours can be pre-arranged by appointment if desired). The tour takes guest from the ship's holds up to the bridge with stops along the way to look in on crew quarters, mess decks, the captain's cabin, deck guns, etc. Along the way are displays on the Merchant Marine, including individual veteran's stories, pictures, etc. \n\nThe ship is not in the cleanest of conditions and somewhat darkly lit (Lane Victory in the LA area is in much nicer condition in part, no doubt, because it is regularly used as a filming location for movies and TV shows), and at least during our visit, there weren't a lot of docents around (we only saw one on the fantail, but he was knowledgeable and friendly). However, it is still definitely worth a stop for an hour or so.",
   "If you have any interest in WWII or naval history, don't miss this ship.  Docents are around who can answer questions.  Some description on exhibits.  A tour would be ideal if they had one",
   "Interesting visit.  This would be best received by history buffs or retired naval personnel.  The volunteers there are informative and very involved in their role.  Walking around the ship makes you truly appreciate the men that manned it.",
   "If you enjoy US History, you have got to go see and step aboard this ship. It is docked in Tampa behind the Aquarium and next to the cruise ship dock. It is well worth the price and visit as you can walk through the entire ship on your own or have a guided tour. Remember, this is a cargo ship but one that saw service in World War II, Korea and Vietnam.",
   "Ship is interesting and there were people that would answer questions and tell stories about the ship.  Ship is near the aquarium and cruise ship dock so there is a lot going on in area."
  ]
 },
 {
  "name": "Croc Encounters",
  "address": "8703 Bowles Rd",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/5b/71/a6/croc-encounters.jpg",
  "tags": [
   "educational",
   "family",
   "experience",
   "pets"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "We were in the area, and always like to see and support wildlife rescues.  This was the first of its kind that we've seen.  It's quite small, but still worth seeing.  Entry was $10/person.  We spent an hour here.  Our favorite part was feeding the tortoises - so much fun!  There are alligators galore, as well as some other interesting reptiles.  You can feed the water turtles as well, but we got there late in the day, so even the fish were full.  So we fed the tortoises some more! (It's about $.75/leaf)  There's also an extremely friendly parrot to talk to, conveniently located next to their sand box playground.  You can get your picture taken with a baby alligator, although we did not partake.  This is not an all-day activity spot, so there isn't a snack bar.  Bring your own water and be prepared to use the  port-a-potties.",
   "Be aware that you should call ahead to reserve your place in a tour.  Mom,dad, and 3 8-10 yr olds had a great time.  Fun and educational",
   "We really enjoyed the family tour! We were able to handle snakes, alligators, & lizards. Our tour guide Clay was very knowledgeable & personable. We were able to feed tourtoises, turtles & alligators.",
   "Tyler did a great job of not only sharing his vast knowledge of the reptiles, but the experience also allows for some great human-reptile interaction.  We especially enjoyed our time with the tortoises as we helped them all enjoy a kale snack.\n\nThis place shows off these reptiles for all of the right reasons and in all of the right ways.",
   "A good portion of the reason we decided to come to Tampa is because of the good things we heard about croc encounters, and we were not disappointed. Alligators and crocodiles are my favorite animals and my husband had been researching for a place we could take a tour of rescued alligators. The tour was very informative and our guide did a great job of answering our four year old’s silly questions and outbursts. All the gators and crocs were nuisance alligators that would otherwise have been sold for their meat or hide, or were former pets. It’s so nice to visit a place that promotes education of the animals while also acknowledging how dangerous they can be. At the beginning of the tour we got to hold a baby alligator, and during the tour we were able to feed tortoises, hold snakes and different types of lizards. The price was well worth it and I recommended it for anyone who is a fan of reptiles."
  ]
 },
 {
  "name": "Sacred Heart Catholic Church",
  "address": "509 N Florida Ave",
  "avg_visitor_review": "5.0",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/57/ba/4b/beautiful-stained-glass.jpg",
  "tags": [
   "peaceful",
   "walk",
   "active"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Beautiful Ash Wednesday service today...beautiful and peaceful day! The singing with the local students was incredible and made me happy! It's about 15 minute walk from Orange Street. ",
   "We felt very welcome on our visit to this lovely church. Based on what we saw, I would judge that this is a lively, active community of worshippers.",
   "The Sacred Heart is a beautiful Neo Gothic style church built in the very center, in the business district but close to the Riverwalk.\nThe Church is built of stone blocks and the interior is great as well, with nice altar, stained glass and rose window.",
   "This is one of the oldest churches in Florida and I always love visiting it. They do a great job decorating the church for the  Christmas  season. ",
   "It’s a head turning cathedral in Tampa. I highly recommend going to this place to admire the architecture "
  ]
 },
 {
  "name": "Wat Mongkolrata Temple",
  "address": "5306 Palm River Rd",
  "avg_visitor_review": "4.5",
  "avg_time_spent": null,
  "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/f8/7b/1b/perspectiva.jpg",
  "tags": [
   "food",
   "food",
   "food",
   "peaceful",
   "family",
   "food"
  ],
  "source": "TripAdvisor",
  "reviews": [
   "Really enjoyed this place. Long lines, but the food was quite good. Nice setting, fun to feed the fish and shop for Asian plants and herbs.",
   "Great Sunday outing! All types of Thai food at reasonable prices - two can eat well for less than $20. Great picnic area to eat and view the neighboring river. Plan to arrive early (before 9:00 am) in order to find a parking spot and before the food runs out.  The line ups for food can be long, so a good strategy for couples is to split up and stand in separate lines. Highly recommended,  we'll be back for sure.",
   "Thailand is one of my favorite countries to visit and fortunately Tampa has a Thai Temple that equals any in Thailand.  Best to go on Sunday early (before 10am) as they set up a food court, garden shop and herb garden to purchase items.  Authentic, inexpensive and thoroughly enjoyable.",
   "What an incredible find in Tampa.  A beautiful temple on a peaceful manicured grounds with and diverse market of delish ethnic Thai foods and flowers......This was the place to be on a Sunday....100s of people came from all over the area to sample foods, sit by the water and eat with family and friends...\n\nI highly recommend you stop by",
   "My daughter and I wanted to take my mom to the Temple, my mom really enjoyed herself, giving gifts to the Monks was what she wanted, my mom is 73 years old and we wanted to do everything she wanted. The food was really good and authentic, my mom didn't complain, she misses her homeland. We will be back there when it's cooler, there were a lot of people there also mostly for the Thai food, They also had assortment of fruit and vegetable plants to buy majority of the proceeds go to the Temple to help the Monks with bills (I.E. electric, maintenance on Temple, water, etc, etc, etc.). The place alone is beautiful a must see if you can't make it to Thailand."
  ]
 }
]