[
{
 "name": "Evel Knievel Museum",
 "address": "2047 SW Topeka Blvd At Historic Harley-Davidson",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/66/54/9e/yes-a-theatre-kick-back.jpg",
 "tags": [
  "family",
  "organized",
  "knowledgeable",
  "learn",
  "art",
  "kids",
  "family",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d12361584-Reviews-Evel_Knievel_Museum-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Growing up, I was a big fan of Evel Knievel. Couldn't wait to see his next jump on ABC's Wide World of Sports on Saturday afternoons. My Dad took my brother and I to see Evel Knievel at the old Kansas City International Raceway when we we're 8 & 5 or so.  \n\nThis museum dedicated to his honor is truly a first class showcase of everything Evel Knievel. The entire staff here are fun, enthusiastically knowledgeable and proud of what the do for a living. \n\nWe spent nearly 3 hours taking it all in. The museum is spotlessly clean, well lit and well organized. Packed with artifacts, pictures. motorcycles, a couple cars, \"Big Red\" the custom built motor-home and transporter. There are several video monitors on the walls playing clips from jumps to interviews to documentaries. Several letters from fans of all ages, companies with endorsement deals, one from the U.S. Department of the Interior denial of a permit request to jump the Grand Canyon.\n\nOn the second floor of the museum there is a movie theater running short clips of the Evel Knievel movie starring George Hamilton as Evel. Along with a clip from Viva Evel Knievel starring the man himself, as himself. Down the way from the theater sits a fun 4D virtual reality experience that is fantastic and well worth the additional $5.00 to sit on one of the HD XR-750 motorcycles and preform a jump of your own. Well, sort of anyway. Just past this exhibit is on the the test X2 Sky cycle rocket that was used in preperation for the Snake River Canyon jump.  Also on the second floor are some interactive video jumps you can challenge your friends and family. Examples EK toys and products. A really cool touch screen exhibit where you point to Evel's arm or leg and a screen pops open and shows X-Rays of the highlighted area on the touch screen. \n\nThis was a truly wonderful afternoon spent with my family reliving fond childhood memories and reminiscing.   \n\nThis museum is located in Topeka, KS and is easily accessible from I-70. Approximately an hour West of Kansas City.  \n\nOne last note I might mention, is this is a two story museum. Obviously there is a staircase. There is also an elevator for patrons whom may have crash landed one too many times along the way. \n\n Enjoy!",
  "It was fun to start at the dealership, both to look at their current selection of new bikes, and to see their collection of restored bikes dating back to the 1920s.  Then, you go to the museum itself to see a well thought-out museum dedicated to the life and exploits of Evel Knievel.  His childhood, development into a daredevil, all his jumps, and his personal issues are displayed along with numerous artifacts of his life as a daredevil.  Videos galore, and analysis of all his injuries.  Well worth a visit!",
  "If you’re an Evel Knievel fan - which I have been since 1972 - this is a no-brainer. Collected together in one place you have Evel’s motorcycles, helmets, leathers, vehicles, sky cycle and the centerpiece - Evel’s magnificent and lovingly restored Mack truck “Big Red”. Video clips of all of his greatest jumps (and crashes), movie theater, tons of memorabilia, interactive “broken bones” display and don’t miss out on The Jump - your chance to experience in virtual reality (and complete safety) how it feels to jump one of Evel’s bikes over 14 police cars. \nIf you’ve only heard of Evel Knievel - or never heard of him - here’s your chance to learn everything you could ever wish to know about a legend, an American folk-hero, the “godfather of extreme sports” and the man who inspired an entire generation. \nWe spent a whole day here and had a blast!",
  "I am an Evel Knievel fan. When asked what brought me to Topeka I answered “the Evel Knievel Museum, why is there anything else here?”\nFor someone who has studied Evel Knievel for the last 40 plus years, this museum is awesome. For the hardcore fan there is imagery, video and background that even I was unaware of. The displays are well done, great to see in person Evel’s money makers (motorcycles), leathers and helmets which he used through his career. I went with someone who had no idea about Evel nor had seen any of his exploits on TV growing up. She was impressed and came away with a huge appreciation of Evel, his fame and life. We both really enjoyed the 4D jump experience and overall were impressed with the informative and friendly staff. When back in Kansas City people were impressed I had travelled to Topeka for the Museum. As none of them had heard of the EK Museum nor realized it was in Topeka. If you are within an hour drive of Topeka or even further it is most definitely worth the drive. There is something for everyone here from the art of Evel to the risk, to the hardship and to the time (the 70s), it’s amazing. ",
  "No other Evel Knievel experience in the world unless you were at one of his shows in the past. Virtual reality jump over a series of semi trucks. If you grew up in the 60’s through 80’s and enjoyed his previous exploits then this is a must stop for you. USA Today rated this stop in the top 10. I believe it was number 3.",
  "Was a bit shocked at admission price $15/adult and $7/kid 8-16yr (7 and under free). However, the museum did entertain my five kids (ages 5-14) who had no idea of Evel beforehand. Each jump has video footage which captivated my four boys plus the discussion of all bones broken in each crash. My typical teenage daughter found his story interesting. The movie showings were a hit as well as the interactive bones broken screen with X-rays. The highlight was the Jump Planner...the boys and their sister chose different jumps and speeds and would have stayed there all afternoon testing it all out.  It is a little hidden gem--just prepare for the admission for your family. Give yourself time to do the museum--Plan to spend two hours. ",
  "Loved it! Lots of funny and interesting facts. He was a very multilayered man and daredevil. Loved the videos, the memorabilia, and all the different interactive experiences. Also, check out the vintage Harley repair shop downstairs! Very cool. ",
  "Great History. My wife and I remember the ol days and this was a  great american hero. It is a good museum.",
  "As a kid who grew up in the seventies idolizing the man, it was awesome when they opened the museum just a couple of hours from home.  They had great displays with motorcycles, leathers and toys.  I'll go back because I'm sure missed too many things the first time through.",
  "We were totally impressed and amazed at this place.  Also the staff was awesome. This trip was soley to see the Museum and will worth the days drive up there and back.  I normally get a pin or patch for my motorcycle riding buddies but this time i did not.  I told them this place is so amazing that they will just have to ride up and get their own pin.  This is a must see if you are anywhere near it.  And the VR was GREAT!",
  "Evel Knievel was my boyhood idol, so this place has special meaning to me. I’ve visited 3 times and I have even donated some photos the 3rd time  from when Evel and I met in 2005. The staff is very helpful, and while I have never went through the museum with a guide, I have witnessed a group go through and the guides are top notch. \nThe museum is laid out chronological from the beginning to end of his life. \nThe 20 minute video on how his rig was restored and to be able to see it up close, well that is worth the price of admission alone. \nEvery time I go to see the museum, it takes me 3 hours between touring and the gift shop which has plenty to choose from. \nI recommend this to bikers and non-bikers. This is the man who is The Godfather of extreme sports.\nP.S., there is plenty of Evel’s motorcycles and lots of old footage."
 ]
},{
 "name": "Brown v. Board of Education National Historic Site",
 "address": "1515 SE Monroe St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/17/bf/f5/ab/photo0jpg.jpg",
 "tags": [
  "history",
  "historic",
  "tour",
  "history",
  "historic",
  "history",
  "history",
  "free",
  "history",
  "history",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d106182-Reviews-Brown_v_Board_of_Education_National_Historic_Site-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "The National Park Service outdid itself again with a well executed interactive site with an engaging introductory film highlighting the history of segregation.  The kindergarten room was open and showcased early childhood education.  Two other rooms highlighted several decades showing the persistence and dedication of civil rights activists.  Had I explored this park even 5 years ago, I would have thought “thank God we have evolved beyond this” but now know we have still so far to go.",
  "Everyone should go here! I learned so much about what went into this historically significant court ruling and was very moved by all of the multi-media presentations in use. It is an old \"colored\" school made into a museum to assist in recalling this historic supreme court decision!  Some of the best 2 hours spent touring a place in my life!  And the rangers were very helpful!",
  "I was glad we had the time to tour this historic site. The film in the auditorium sets the tone for your tour and also gives an excellent summary of the history of segregation and of civil rights in general. The old school site gives you insight into what went on there and also compares to any school us baby boomers went to in our early years.",
  "Go find something else to do. This is not worth the time at all. You would get much more history stopping a random bum and asking about his story.",
  "Don't even waste your time. Its a building, sitting there. that's it. I don't care how hard up you are, you won't find a thrill here. ",
  "Passing through on a four state trip.\n\nThis museum is a history lesson broken up into two sections of the old school building.  One half is the history of Brown vs. Board and the other half is about civil rights.\n\nLots of displays and exhibits to tell the story of both.  Admission was free and plenty of free parking.  Nice that it was open on a Sunday because many things are closed in Topeka.\n\nWe spent an hour and probably could have stayed longer.",
  "We would like to go, but it's difficult to determine when it is open.  We have tried to go when they say they are open, only to find it locked up tight. Don't trust what you see on the internet.I think it is set up to accommodate tours for school children. We'll keep trying because it is prominent part of the city's history.",
  "Take a few moments to explore a piece of Topeka history that had far reaching results. A very informative stop for the whole family."
 ]
},{
 "name": "Lake Shawnee",
 "address": "3137 SE 29th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/09/78/22/a7/lake-shawnee.jpg",
 "tags": [
  "walking",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d6223172-Reviews-Lake_Shawnee-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Nice paved walking path all the way around the lake aprox 6.8 miles. I use it when getting ready for long hiking trips to get in shape. Nice views of the lake. West side of lake get a little sketchy when the weather is nice due to the some of the near area residents. You'll experience loud bass, pit bulls off leashes, groups of derelicts blocking the path, dog feces and all the other joys associated with certain segments of our society. It's a shame because the west side has the nice gardens and more infrastructure. Over all I like visiting but am aware of what to expect at times.",
  "Ride, walk,sit, talk, fish, paint, photography and sometimes eagle watch. It's all here. Boating, sailing, boarding, paddle boats all here. ",
  "Lake Shawnee is well maintained and gorgeous.  Great place for families. A must visit during summer !",
  "Shawnee Lake is pretty nice. I love the Paddle Boats and the views. But the swimming area sucks. They have this tiny area roped off and there is a lifeguard  about every 6 feet which is ridiculous. Nothing like advertising \"We don't want to get sued!\" Good Lord!. No one needs 3 life guards on top of them. I was a lifeguard and i wasn't paranoid . People need to back off. If you want to smell the lifeguard's breath, gp swimming at Shawnee! ",
  "We spent an April weekend in Topeka and stayed within walking distance of Lake Shawnee. Lake Shawnee was an awesome place to hang out . . . lots to do and see. We were especially glad to be at Lake Shawnee while the tulips were in bloom. There were numerous different tulip gardens, and each was outstanding. We spent a couple of hours on a windy day walking the gardens, among dozens of others. It was a great day. I would return for the tulips in bloom again in a heartbeat! "
 ]
},{
 "name": "Kansas State Capitol Building",
 "address": "10th and Jackson",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/54/a2/81/kansas-state-capitol.jpg",
 "tags": [
  "tour",
  "free",
  "tour",
  "history",
  "free",
  "walk",
  "kids",
  "walking",
  "tour",
  "free",
  "wander",
  "tour",
  "free",
  "walk",
  "structure",
  "walking",
  "history",
  "knowledgeable",
  "free",
  "tour",
  "structure",
  "tour",
  "tour",
  "history",
  "tour",
  "library"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286463-Reviews-Kansas_State_Capitol_Building-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "  Had a wonderful time visiting the Kansas State Capitol. All of the staff and volunteers were kind and helpful. We were on a tour with school children and while it altered the depth of our tour, we learned interesting information that you would not know without the tour. One of our group members walked to the top of the dome and thoroughly enjoyed it. I’m too afraid of heights to have done it myself. \n  One aspect of visiting here is parking. It can be difficult to find parking at state Capitol buildings but Kansas provides free parking under their building. Worth your time to visit. Be sure to include a visit to the gift shop while you are there. I loved the jewelry made from their former copper dome. ",
  "A beautiful use of the classical architectural vocabulary from the great era of state capitols emulating the national capitol, this fine building has a recently added visitor center that utilizes the massive foundations and basement level to tell the story of the state from the arrival of eastern settlers and their engagement with native peoples until the current era of agricultural production.  Historical documents and photographs are used to tell the story in a way that is easily understood.\nOn the main floor the brilliant murals of John Steuart Curry dramatize the terrible rage of John Brown and life in the early years of the territory and state.  Other murals amplify the historical narrative.\nNo other capitol that I've visited has this combination of elements.",
  "Completely worthy the trip. The building is beautiful and the free tour was filled with great history and information. You must walk up to the dome. It is a flight of stairs with almost 300 steps but completely worthy. Beautiful view, wonderful experience. We even had the opportunity to participate of a press conference by the Governor Laura Kelly and meet former Governor John Carli.",
  "We spent all day at the Capitol since my kids were pages for our State Representative (which I highly recommend for any kid in any state!).  The last time we visited absolutely everything was being renovated, but this time the renovations are done and it is breathtaking. We all had mixed feelings about the once-green dome's now shiny copper state, but we all agreed that the restored murals and decor are fantastic. You absolutely MUST make the trip to the top of the dome, but only if you're not chicken. It's not for the faint of heart!  \n\nOne thing I didn't like is that the building is perfectly symmetrical, so I kept getting lost all day long!  I relied very heavily on room numbers and the compass on the rotunda floor.  Symmetrical floor plan + bad sense of direction + bad memory = one confused individual.  \n\nThe only other item of note is the fact that visitors may only enter at the north entrance of the building, so I found myself wasting time walking outside around the entire capitol in heels in cold weather and wind to get to and from my car, to lunch, etc.  Comfy shoes recommended (can't go to the top of the dome in heels anyway), hold on to that map (and maybe a compass), and for pete's sake, bring your camera!!!!",
  "They offer free dome tours on the quarter hour and they're definitely worth it. You start out on the 5th floor and go up some staircases on the edges of the dome. You start out being able to look into the rotunda and then you're above the inner dome. The last 1/3 of the stair climb is the scariest---you're going up a staircase that goes out into the middle of the dome and then spirals up to a cupola that leads outside. Every other dome we've been in had the staircase just continue to go around the edge of the dome, so this was a bit freaky. It is very windy out on the viewing deck, so be prepared.\n\nAfter the tour, wander the other 5 floors of the capitol to see some great paintings.",
  "It is 296 steps to the top of the Dome and it is well worth the effort. Not only is it fascinating to see the interior structure, the view from the top (one can walk outside around the top of the Dome) is exhilarating. Our tour was hosted by an informative guide and it was free! Check for times at the Visitor's Center and then meet on the 5th Floor.",
  "The State Capitol Building was fully renovated and it's a great and beautiful place to visit.  One tour is a walking tour of the building. The guide was knowledgeable about the building's history. It was an informative and enjoyable tour.\n\nThe second tour was a bit more adventuresome and fewer people took it. It included climbing stair to reach higher into the building and to see more of its structure. Then, we reached a point where some people decided not to go further. We climbed steel stairs that rose high above the interior dome (see photo). If you fear heights, the second portion of this tour is definitely not for you. Next, we reached the top of the building and had an opportunity to go outside (it's safe) and see a high, panoramic view. It was spectacular and worth the climb.\n\nBoth tours are free. There is also a nice little store.",
  "If you want to prepare for a nap, take a tour. If they have tours. I'm sorry but Topeka is boring. The streets are tore up with potholes and cracks; boarded up abandoned buildings, not enough swimming pools or attractions. And everything costs big $$$. ",
  "There is a tour to climb the tower, and the guide will introduce you with history. The view of Topeka from the top of the tower is also amazing. To go up the tower, the bottom is fully visible and your feet are shrunk. It's difficult for people with fear of heights. I am surprised that the graffiti from 90 years ago remains on the pillar.\n塔の先端へのツアーがあり、ガイドさんが色々と紹介してくれます。塔を登って行くには下が丸見えで足がすくみます。高所恐怖症の人には難しいですね。",
  "Traveling with my sister and a friend. This is one of the best capitol buildings in the United States. We did not take the guided tour. The building is beautiful. The restoration was very well done. It is easy to navigate this capitol. I liked the old elevator. The library is a plus. ",
  "Hard to describe the beauty of this Capitol; after seeing almost 40 of them, this is without my top pick, a must see place in Topeka."
 ]
},{
 "name": "Gage Park",
 "address": "635 SW Gage Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/3c/ed/af/gage-park.jpg",
 "tags": [
  "learn",
  "walk",
  "kids",
  "walking"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286467-Reviews-Gage_Park-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Love this park. It is well maintained and all of the dog owners i have met there were very responsible, picking up poop and policing the area very well. There was no trash or garbage laying about and frisky dogs were reeled in by their owners quickly. As for my previous comment, I feel that if you are a citizen of this country you owe it to the US to learn the language. To me its disrespectful to post a review in a foreign language in the middle of the United States. Thank you",
  "Taking a early spring walk then Gage Park is the place to go. Interesting to see how much of the vegetation is starting to blossom.",
  "Gage Park is good for walking, small time fishing, the train ride (don't forget to scream loud when it goes through the tunnel); there's a dog park and the drinking fountains never work. So if you bring your kids or grand kids, bring water. ",
  "A large park which is very well maintained. There is an old carousel there which can be ridden and dates back a few years. There is also a train which you can ride on around a mile in total as well as a zoo and rose garden with some lovely varieties of specimens.",
  "During our recent mom/daughter visit in Chicago, we tried out a few new eating spots. What a sweet discovery we made at The Gage on Michigan Ave. It’s right across from Millennium Park in the heart of true Chicago. Since we were visiting during a warm weekend we chose to sit outside in their patio seating enjoying the city sights while we ate. We each ordered the moule frites on the appetizer menu. It was more than enough for a filling entre (don’t tell them!  We don’t want them to change that!!) the sauce was incredible and they were topped with some amazing peppers and other surprises. The service was delightful and prompt. Making our dining experience even more perfect. Our only regret was that we decided to not go there again the next night!  We will be BACK!!"
 ]
},{
 "name": "Kansas Museum of History",
 "address": "6425 SW 6th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/01/56/72/21/enter-here-all-ye.jpg",
 "tags": [
  "kids",
  "history",
  "walking",
  "walking",
  "walk",
  "kids",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286464-Reviews-Kansas_Museum_of_History-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Very interesting for all ages! My nieces loved the train and they would get super excited about other things on display. There's also a play area for Kids. My Mom and I really enjoyed it. You could spend a big part of your day here.",
  "This museum was a great look at the surrounding area through time.  Great displays of famous influential people over the years and progress of civilization; Indians, cowboys, immigrants, buffalo, horses, cattle, trains and covered wagons, etc. Well worth a trip!",
  "As I was at the Kansas History Museum for a conference I decided to check out the Museum before leaving.  Good idea!\n\nThe Museum highlights Kansas from pre-historic times through the Indian civilizations, the explorers, settlers, the Civil War, the coming of the railroads, the depression, all the way to “our history”.  Kansans’ contributions to the Spanish American War, World War I and World War II are given attention.\n\nThe exhibits consist of picture, and Indian sod house, a tipi, a settler’s log house, a train with a steam engine, a windmill, an airplane and a diner, among others.\n\nI learned things about Kansas and the wider world during my visit.  I strongly recommend it for anyone visiting the Topeka area.",
  "Its okay if you're bored. I mean you can really only visit it once. After you go, that's it. Its better than the Zoos. ",
  "I took my grandkids ages 10, 5, and 3 and they had a good time. They enjoyed the children's section and walking through the train in one of the museum rooms. It had just the right amount of displays to make it fun and quick. ",
  "This is a decent museum. If you go there then do not forget to take a walk on the walking trials behind the museum.",
  "Very interesting for all ages! My nieces loved the train and they would get super excited about other things on display. There's also a play area for Kids. My Mom and I really enjoyed it. You could spend a big part of your day here.",
  "We had a tour guide which took us through and filled in a lot of the background on the exhibits.  His knowledge about the train which is a real ATSF locomotive with coal car and a drover car and an administrative car, plus office and dining car.  The history of Kansas is shown from Indians to Mc Donalds, with a wagon and a replication of a 1950\"s diner."
 ]
},{
 "name": "Kansas Children's Discovery Center",
 "address": "4400 SW 10th Ave inside Gage Park",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/04/97/7c/67/kansas-children-s-discovery.jpg",
 "tags": [
  "kids",
  "kids",
  "learn",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d2209676-Reviews-Kansas_Children_s_Discovery_Center-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you have kids 3-11 this is a great place . They have fun on a series of interactive \nplay. spots. Working on a play car, putting objects into an air duct. Playing outside in a\nsmall wilderness and then on bikes",
  "The Kansas Childrens Discovery Center isn’t very large, but it’s filled with fun and entertainment for kiddos. We spent 3+ hours there with a 3 year old and 7 year old and both were disappointed when closing time arrived. \n\nIt was cold and wet so we only spent a little time outdoors. Indoors the Mo Willems exhibit, grain silo, car repair and air tube stations were the biggest hits. \n\nDefinitely worth visiting if you have young kids and are local or just passing through. ",
  "I went twice this year, with two different grandchildren and they both loved it and look forward to going back. Each has similar places in their own cities but enjoyed this one as much or more.",
  "Took my 7 year old granddaughter. She loved the variety of experiences.  The slime making session was her favorite. There was a large variety of activities for ages toddler to 12 yr olds.",
  "This is an outstanding, and I really want to underscore this, truly outstanding source of learning and play for young children.  I was happy to see some new exhibits during today's visit to include a bank, a grocery store, and a special exhibit to learn about Kenya.  The painting on glass is always a treat, and the exploration children have through this center is just amazing.  It is indeed a Topeka treasure!",
  "Every year we take our 3 young grandkids on a “birthday adventure” and this year one of our stops was the Discovery Center.  We spent several hours there and look forward to going back.\n",
  "We took our grandsons to see the activities at the center. They enjoyed being able to touch and experience the various action centers. Good for younger children",
  "We have twice been to the Children’s Museum in Tucson, AZ & this one beats it hands down! There is so much for a child (we have a 3 year old) to do both indoors & outdoors.  So much of the center is staffed by very understanding & patient workers who will assist you or engage your child. We were able to participate in an outdoor rocket demonstration. Definitely a WOW factor.  Kids can actually “do” things (paint, make a wood project & etc) & not just play. We will come here again."
 ]
},{
 "name": "Combat Air Museum",
 "address": "7016 SE Forbes Ave Forbes Field",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/ac/ef/46/filename-2012-06-15-09.jpg",
 "tags": [
  "tour",
  "kids",
  "history",
  "wander",
  "knowledgeable",
  "kids",
  "tour",
  "walking",
  "walk",
  "history",
  "knowledgeable",
  "educate",
  "historic",
  "history",
  "family",
  "kids",
  "tour",
  "tour"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286470-Reviews-Combat_Air_Museum-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "So our adopted daughter came back briefly between her first Naval stint in Okinawa and her new posting in San Diego. It was a great trip. The airplanes on display are fascinating, from several eras, and the WWII bomber outdoors was a good tour. Plus the gift shop isn't overpriced as many are, and so it was good to send her off to her next station with a memento that didn't break the bank. It's an inexpensive way to spend several interesting hours.",
  "This was worth the admission!  The variety of airplane's and artifacts was wonderful.  This group takes great pride in their exhibits.  The volunteers were fantastic!!  Our 8 year old loved the flight simulator and being able to go into a few of the aircrafts! ",
  "In a couple of non-descript hangars on the south side of the airport sits this really cool collection of all sorts of US military aircraft and paraphernalia.  The kids jaws dropped when we opened the door and here were all these aircraft they'd only seen in movies.\n\nThe collection spans from WW1 up until recently retired aircraft like the F-14.  You get to go right up to all of the aircraft and you get to go inside several of them.  If you're into history, machines, or anything airplanes you could easily spend hours here.\n\nThe museum is run by all volunteers who are really friendly and helpful.  They also have a brilliant flight simulator that is sometimes open that the kids got an amazing intro to flight in.",
  "First off, the museum is supported by private contributions so some of the displays may seem a little dated and the hangers are a little dark but if you love aircraft the displays are varied and interesting. We've visited twice and each time a guide was available to accompany us through the first hanger. I prefer to wander on my own, but my son loved talking aircraft with the very knowledgeable staffer. The outdoor Connie needs a lot of TLC and its a little sad to see her sitting out in the elements, but again this museum is run by private funds. The second hanger is almost overflowing and some of the items seem to make an odd collection but again there's a wonderful variety to look through. Take some batteries if you want to take pictures because you'll need to use a flash. Well worth the $6. The gift shop was like all gift shops at museums - a little over priced, but everyone was friendly and we'll definitely drop in again.",
  "My brother begged me to go to this with him (he loves planes, me not to much). I agreed and we spent several hours looking around.  A tour guide asked us if we would like a tour but my brother knew enough about planes and we explored on our own and he was guide. The area is two large hangers with an upper loft in one, and a big plane out back.\n\nIt was a actually a lot of fun seeing all the plane up close and some we even got to go in. I was expecting a lot of ropes to keep people away from the planes, but that’s not the case. The planes are packed in as many as they can fit (and it’s a lot) and you can walk right up to them and get some great photos.\n\nThe large plane out back (I don’t remember what it was) was really cool to enter and see all the controls. I can see someone who’s 6ft+ whacking their heads on some of the plane wings while walking around if not careful. If you have kids you’ll have to watch them because there is lots of tempting places to climb on planes.\n\nIt’s a great place to visit, if you love planes you’ll go nuts, if you don’t like planes you’ll still leave impressed. Defiantly worth a visit. Also the hanger’s don’t have much in the way of Heating or A/C so its best to visit on a day that is decent outside.",
  "This museum is amazing for anyone who loves aviation and/or military history. The staff are very knowledgeable and they have every aircraft you could imagine to view. I love WWII history and they have one of the planes Easy Company jumped out of on D-Day on display. Soooo cool! I suggest going when it's not to hot or cold since they don't have air or heat.",
  "This museum fills 2 large hangers.  Aircraft are accessible and identified to help educate those not ranked with the various eras of aircraft.  Do not get in  hurry exhibits are detailed with historic information.",
  "We stopped in for a visit on a cold day.  The collection of planes is amazing!  Seeing the planes up close and personal was a treat.  The staff was friendly and knowledgable. We loved seeing the planes, collections of model planes, uniforms and other items on display.   We could easily spend several hours in there.",
  "We stopped at the National Guard museum first then found this one.  It has marvelous planes on display.  We were introduced to a former flight engineer and chinook mechanic - she is seeking funds to restore one of her chinooks - she said the volunteers and staff are like a family that really cares about preserving history.  The stories of the volunteers are just as interesting as seeing the planes.",
  "While this wasn’t exactly my cup of tea, my husband wanted to see it.  As I expected, there were lots and lots of planes.  What I didn’t expect, was that a couple of aircraft were available to tour.  I think one of them was a transporter (sorry, I am quite ignorant of aircraft), the other one was outside the first hangar and had a lot of radar equipment on it.  Little kids will enjoy seeing Snoopy on his flying doghouse going after the Red Baron (I know I did!).  There was aircraft there from WWI to the present day.  If you are a fan of military aircraft, this is the place for you.",
  "So our adopted daughter came back briefly between her first Naval stint in Okinawa and her new posting in San Diego. It was a great trip. The airplanes on display are fascinating, from several eras, and the WWII bomber outdoors was a good tour. Plus the gift shop isn't overpriced as many are, and so it was good to send her off to her next station with a memento that didn't break the bank. It's an inexpensive way to spend several interesting hours."
 ]
},{
 "name": "Ward Meade Park",
 "address": "124 NW Fillmore St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/cf/b9/47/japanese-gardens.jpg",
 "tags": [
  "kids",
  "history",
  "learn",
  "history",
  "food",
  "tour",
  "walk",
  "free",
  "kids",
  "delicious"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286466-Reviews-Ward_Meade_Park-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We stop over here during the apple festival , they always have a great selection of venders , and it’s a cool place to visit and stop off at the ol drug store and the general store has some neat souvenirs also !!",
  "Enjoyed seeing the different buildings, including a mansion, old soda fountain, dental office, grocery store, telephone office, train depot, etc.  Interesting for kids that love history and adults.",
  "Walk the grounds of Old Prairie Town on your own or go with a guide and see inside all the buildings, learn the history, and tour the Ward Meade home.  Shop in the General Store and visit the Drug Store for refreshments. You will be amazed at the flower and water gardens as you leisurely stroll the winding paths of Old Prairie Town. Come for Tulip Time in March-April each year to see thousands of tulips in bloom and come again the first Sunday in October for the Apple Festival. You will enjoy all the food, entertainment, apple cider, and shopping at the many vendor booths, but don't leave without having a slice of apple pie!",
  "This is a great place to spend a couple of hours. It has a relaxing garden area with benches and a pond.  The garden is fairly large for a private one, with different areas to explore. It has an old-time store complete with a soda counter.  Worthy of your time.",
  "We were lucky enough to be visiting during the 40th Annual Apple Festival.  All the buildings were open and most had volunteers either giving talks about the building they were in or giving a demonstration such as the blacksmith.  The botanical gardens were beautiful, especially the Japanese garden.  A very lovely place to visit.",
  "We visited this park twice while in town.  It is free to visit and you can enjoy on one side an immense garden filled with flowering foliage and replete with a variety of butterflies and bees.  Just beautiful.  The asian garden here rivals any other we have seen.  and on the other side of the park is a small town setting put together with buildings brought together from different areas of Kansas.  from the train station to a church, several shops and houses and even general store as well as a pharmacy/soda fountain where you can enjoy something cool and refreshing.  we loved this place",
  "The gardens are breathe taking and kids love to explore! We had so much fun taking pictures and then we went into the old pharmacy where they have a soda fountain and it was delicious.",
  "We stop over here during the apple festival , they always have a great selection of venders , and it’s a cool place to visit and stop off at the ol drug store and the general store has some neat souvenirs also !!"
 ]
},{
 "name": "Ted Ensley Gardens",
 "address": "SE 37th St. & West Edge Road",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/01/06/35/20160424-121937-largejpg.jpg",
 "tags": [
  "walking",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d6962146-Reviews-Ted_Ensley_Gardens-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "My foster mom is 98 and still loves what this garden offers.  A dandelion has always been an unwelcome sight in her hard and garden.  With all the beauty of this garden, if she sees a dandelion I hear about it!",
  "This was a great find!  We drove a little over an hour to visit this Garden and it was well worth it!  ",
  "Wonderful flowers around a nice concrete walking trail.The trail wraps around lake. What a nice walk.",
  "We visited near the end of tulip time, and the gardens did not disappoint!! Amazing! The colors were vibrant and the gardens were well-maintained.\n\nAs visitors to Topeka, we don't have a point of reference for the Gardens outside tulip season (April 4-22). But the trails, bridges, falls, and landscaping are all well done. And the beautiful lake is never far away.\n\nOne downside -- not an indictment of the Gardens -- was the number of people climbing into the beds of tulips for photos, or sending their children into the flowers for photos. Unbelievable! Anything for a selfie, I guess.\n\nDefinitely worth a visit. Take a camera!",
  "Enjoyed seeing the tulips in bloom. It is a very pretty park and worth the time on a nice spring day"
 ]
},{
 "name": "Topeka Zoological Park",
 "address": "635 SW Gage Blvd",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/27/78/bb/topeka-zoological-park.jpg",
 "tags": [
  "kids",
  "kids",
  "walk",
  "walking",
  "history",
  "kids",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286465-Reviews-Topeka_Zoological_Park-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We loved the zoo & saw everything in 2hrs. The kids weren't exhausted & complaining. Very nice enclosures! Just the right amount of animals to see. I especially liked the staff at each exhibit who provided education & answered questions!",
  "We are KC Zoo members and this was a perfect smaller zoo with younger kids. We could easily walk around and see all the animals up close and most had nice enclosures. It was pretty shaded with nice landscaping and play areas for the kids. The surrounding park is great too! Kids all gave it 5 stars!",
  "This is a very nice zoo in Topeka Kansas.  It has orangutans, giraffes, gorillas, lions, tigers, mountain lions, black bears, hippo, African and Asian elephants, petting zoo, rain forest, small lake and pond and various  other animals and birds\n\nIt has quite a history among zoos with several firsts\n\nEasy walking, no hills\n\nLocated in  Gage Park which has,  in separate  areas, an antique carousel, miniature rail road ride and swimming  pool",
  "Was a little cold but we went.  It is small.  A few of the animals were not out, but we walked around again and they were out.  Animals look well cared for.  Have been to better zoo's.  So I just give it an ok.",
  "We took our 3 young grandkids there this morning and were so disappointed.  Most of the exhibits were empty or maybe had 1 animal in it.  The temperature was great so that had nothing to do with it.  The kids would have enjoyed the free park much more.  Save your money!",
  "Great place to come for a day with the animals.  Lions, tigers , and bears.......and much more.  Well laid out with exhibits fairly close together.  May not be as elaborate and/or large like other zoos, but the Topeka Zoo is well worth the visit.",
  "Decided to go to the zoo today. Turned out to be s nice day to go. Very disappointed that virtually none of the animals could be seen. Lots of overgrown pens. Personally I was disappointed ",
  "We took s walk through the zoo and saw all kinds of animals!  Elephants, hippos, tigers, lions, wild dogs, giraffes, birds, bears and more. Great for couples, families and friends!  Take the time to enjoy a walk on the wild side! "
 ]
},{
 "name": "Heartland Park Topeka",
 "address": "7530 SW Topeka Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/af/33/2c/view-from-on-top-of-the.jpg",
 "tags": [
  "drink",
  "food",
  "field",
  "food",
  "drink",
  "food",
  "field"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286462-Reviews-Heartland_Park_Topeka-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I drive about 4 and a half hours to go to the National drags every year!  Very reasonable gate admissions, general admin. seating very good, full pit access at no extra charge.  Good food and drink vendors.  Wouldn't miss it!",
  "This is a top class facility. Unfortunately the events don't get much notice from the local media. There is a 2.5 mile road race course, a 1/4 mile drag strip, a motocross trace, solo pad, drifting pad, dirt oval and off road motorcycle area.",
  "Great race track for National Drag Races. They have other events here also.  Located in Forbes Field, south of Topeka.",
  "Races where great love being able to go in pits and talk with the drivers .everything is laid out nice plenty of seating even in general admission only complaint I would have is in general admission the concession stand was not good. 1pm out of everything bit brats ,workers were saying they where told not to cook any more food! a 1pm? come on guys plus they where very under staffed took 45 min or longer in a line maybe 20 people deep .that said it was the only complaint we had .will go again next year but will upgrade seats to racers side way more stuff to do and see.",
  "I drive about 4 and a half hours to go to the National drags every year!  Very reasonable gate admissions, general admin. seating very good, full pit access at no extra charge.  Good food and drink vendors.  Wouldn't miss it!",
  "This is a top class facility. Unfortunately the events don't get much notice from the local media. There is a 2.5 mile road race course, a 1/4 mile drag strip, a motocross trace, solo pad, drifting pad, dirt oval and off road motorcycle area.",
  "Great race track for National Drag Races. They have other events here also.  Located in Forbes Field, south of Topeka.",
  "We thoroughly enjoy making the trip to Heartland Park Topeka! Every year we drive from Iowa for the bracket finals and every year is better than the last. The grounds are clean and the recent black topping made the trip to the lanes smooth. The facilities are always clean and welcoming. The shower are is very nice although the water was freezing, it was welcoming on this very hot weekend!  Thanks for making our experience so great! See you next year!!"
 ]
},{
 "name": "Museum of the Kansas National Guard",
 "address": "125 SE Airport Dr",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/69/c4/4d/great-story-behind-this.jpg",
 "tags": [
  "kids",
  "history",
  "field",
  "family",
  "tour",
  "wander"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d3962405-Reviews-Museum_of_the_Kansas_National_Guard-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a great donation museum with tons of military history. We loved the tanks outside of the museum. They have an American half track from WW2 and some Russian tanks captured in Desert Storm! Inside the museum has lots of military artifacts from the National Guard including a flame thrower, anti tank gun, rocket launchers, and way too much to list. There was some military gear for the kids to dress up in, which was awesome.",
  "Quality exhibits. Good representation of the work Kansas army and air National Guard. Worth a visit! ",
  "Stop here when visiting Forbes Field. A now-closed Air Force Base, south of Topeka. Small but impressive.",
  "Being a Military Veteran I always like checking out Museums for any branch of Military.  This was not a let down.  It was so cool to see all the things this Museum had to offer.  Definitely a fun thing do with any size family.",
  "This is a wonderful military museum.  It is huge.  You can wander through it for hours (and we did) and not see everything.  It has exhibits and artifacts from every conflict Kansas troops have participated in from the Civil War to modern day.  They have Saddam Hussein's uniform, a replica of the MASH set, guns, uniforms and a large collection of vehicles and aircraft outside.  Col. Pascua gave us a tour.  He was as fascinating as the museum.  He is a retired USAF flight surgeon/paratrooper from the Philippines.  He told stories about growing up in the Philippines during Japanese occupation, Desert Storm and Kosovo."
 ]
},{
 "name": "Happy Basset Brewing Company",
 "address": "6044 SW 29th St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/16/3c/fd/seating-layout.jpg",
 "tags": [
  "food",
  "free",
  "brewery",
  "food",
  "free",
  "knowledgeable",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d12059013-Reviews-Happy_Basset_Brewing_Company-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Love the shirts, bought one for our Son. Got a blonde and an ipa and both were good. Lots of people there and seemed like a good crowd. Had a food truck out front. Service was fine. Glad we went. ",
  "We stopped in on a Sunday afternoon when this place was very busy and nearly everybody was playing bingo. We were fortunate to grab the last available table. Unfortunately, the bar had only a waitress and a bartender so we had to wait in a long line at the bar. They offer a beer on special each month for a discounted price. In September, it was a brown ale for $4 called Belly Rub Brown Ale. It was a catchy name, but didn’t taste that great. The rest of their beers all had dog-related names. You can order small sampler size glasses for $2 or $2.50 each for 4 samples. The brewery is located in a strip center right next to a pet store and had a food truck (vegetarian/ vegan) parked out front the day we were there. We saw a sign that Glory Days will deliver pizza to the brewery for free which we thought we be a good idea if we are ever back in this area.",
  "They always have a great selection of beer , and seasonal types also . My wife likes the strawberry wheat and I really like the mango beer !!!",
  "Easily my favorite craft beer in town. All of the workers there are knowledgeable, friendly and super fun to talk to. There are games to play and many TV's to watch. While they don't offer food, they do partner with a few local eateries who will deliver there for FREE! If you're not wanting a whole meal, they do offer a few snacks for purchase.",
  "Quick and friendly service. Tried a few samples and went with a Pale Ale and a Gatsby IPA. Both were excellent. "
 ]
},{
 "name": "Truckhenge",
 "address": "4124 NE Brier Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/11/91/f1/06/ron-s-artwork.jpg",
 "tags": [
  "kids",
  "art",
  "unique",
  "history",
  "walk",
  "free",
  "art",
  "history",
  "tour",
  "walk",
  "art",
  "creative"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d13307043-Reviews-Truckhenge-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We just drove through but this place was very interesting. I would describe it as creepy cool. It's the type of place that you see new things every time you go through.",
  "What a fun and quirky stop! When we first drove up it looked closed but there was a second entrance a little further down the road. The gentleman whose private property it was was super friendly and talks faster than an auctioneer! Look for the peacocks in the trees as you pass his house. My kids got to spray paint the bus and boats which was very fun for them! We chose to drive through and get out to take pictures and enjoy the art. Thanks for sharing your story sir. ",
  "Wasn’t sure what we would find after reading about Truckhenge however, felt the trip was well worth the drive. We weren’t sure what to do once we arrived (it’s private property) however, Mrs. Lessman greeted us from her front door and happily invited us in. We signed the guestbook while she explained the history behind the truckhenge farm. We walked the property (you can also drive through) and was amazed and in awe over the various projects including bottle walls, saw chain wooden sculptures, the infamous row of trucks arranged in a way to signify his protest against the establishment. Buses, boats and cars are included along with a railroad car that was used to transport horses plus plenty more interesting creations. Ron Lessman uses large canvases to paint in his own unique style. Photography is highly encouraged. There is no fee however, donations are accepted. A really interesting and fun walk through. ",
  "The man who lives on this property is quite the character.  Very friendly and he has his own ideas of \"art\".  From trees made with bottles, to wood carvings, to trucks set up like Stonehenge and boats sticking out of the ground.  He had beautiful peacocks on the property.  8 in total.  This was just a fun time and it's free!\n",
  "Interesting folk art created by a quirky artist! His work acutely reflects his creative and abstract personality. His wife was warm and welcoming and gave us the great history of the art park/concert venue. \nChickens, peacocks and dogs throughout the park. Rock/grass path through the Truckhenge and boathenge art park. Took about 30-45 minutes for a brief history and walk through tour. "
 ]
},{
 "name": "Topeka & Shawnee County Public Library",
 "address": "1515 SW 10th Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/ae/9d/8e/tscpl-entry.jpg",
 "tags": [
  "kids",
  "family",
  "library",
  "learn",
  "music",
  "library",
  "art",
  "food",
  "free",
  "library",
  "affordable",
  "library",
  "kids",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d8649368-Reviews-Topeka_Shawnee_County_Public_Library-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Our family loves to go to this library! It has something for everyone to enjoy! The cafe is wonderful! They have a great section for kids to read, learn and play as well as computers for the older kids to enjoy and so much more. The staff is very helpful and kind. I could go on and on. Definitely check it out!",
  "The library is remodeling the building. Best feature is the Learning Center - a large classroom with moveable tables and chairs. It is great for art and music activities. I always love the library cafe. Great food and reasonable prices. Be sure to stop at the book store. Many new features coming for the library!",
  "So, I'm trying not to be too superlative in my reviews, but the TSCPL deserves every superlative I have. I've been a private tutor in addition to my day job, in several different cities over the years. The TSCPL built \"team rooms\" that you can reserve for up to 3 hours a day for free, with white boards and computers, and it's a joy to work with that. They've also got a very friendly staff...I should point out that I'm personal friends with a few of them, but I see that as a good thing. In each case the friendship developed because of the excellence of the library. \n\nThey have a huge area just for teens, with board games, video games, and even a 3D printer. They purposely lay out other space for educational purposes, and they also have larger meeting rooms upstairs that I've reserved before...again, for no cost because in those cases I was acting for a non-profit. \n\nOverall, though, it's the people...every single one of them I've met is just really darn caring and nice. I've had to borrow pens from the front desk, with absolutely no problems. I've had a charge I disagreed with, and it was a joy working through that with the agent. ",
  "Many things to do and see at this library. Staff is helpful, as an out of towner I was still able to get a guest pass and use the public computers. Gift shop was fun and affordable.",
  "We stopped in just to use the bathrooms on our way through town, and were delighted to find (in addition to clean bathrooms) an art exhibit for kids, cafe, book/gift shop, and some beautiful stained glass and antique furniture."
 ]
},{
 "name": "Topeka Civic Theatre & Academy",
 "address": "3028 SW 8th Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/ac/fd/ec/inside-the-theatre.jpg",
 "tags": [
  "theatre",
  "performance",
  "food",
  "drink",
  "food",
  "theatre",
  "performance",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d1774781-Reviews-Topeka_Civic_Theatre_Academy-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Check out TCT. You get a great meal and a great entertainment event. This season, we saw Elf, In The Heights and Singing In the Rain. We have also enjoyed Radio Players and Laugh Lines. Check their website for options.",
  "Without knowing anything about the Topeka Civic Theatre, we decided to take a chance and purchase tickets. I will describe the theatre as cabaret style. That is, attendees did not sit in rows of chairs, but at tables with chairs surrounding it. \n\nWe knew that the performance of the \"Explorer's Club\" would be at a community theatre-level and not broadway, but the performers did a great job. There were many talented people on stage who performed convincingly. The sets, lighting, and sound were also well-handled.\n\nA limited menu of food is served before the start of the play and during intermission. They seemed to handle some orders quickly and others slowly. The food was acceptable and it was convenient to have it served.\n\nThere was plenty of parking available when we arrived.\n\nIt was a highly positive and fun experience and I recommend it.",
  "A great place for laughing. Improv group with all ages. Some skits funnier than others. You can order drinks, pizza, popcorn, and desserts. Tickets are $12.75 each. We get tickets for every show. TCT also does great plays and musicals. We saw Elf in December.",
  "We saw We Will Rock You. At best it was mediocre. It’s hard to imagine that there isn’t more talent available in the area. Even the main characters couldn’t carry a tune. They were off key and unimpressive ! The dinner is a joke ! The selection was extremely limited and does not include drink or dessert. \nThe band however, was excellent !!!\nOverall I would say it was not a good value and I wouldn’t recommend it. ",
  "The food was great and the play was great! I loved the humor.  Would have preferred a table for two; however, the other people we sat with her a good match with our personalities",
  "Check out TCT. You get a great meal and a great entertainment event. This season, we saw Elf, In The Heights and Singing In the Rain. We have also enjoyed Radio Players and Laugh Lines. Check their website for options.",
  "Without knowing anything about the Topeka Civic Theatre, we decided to take a chance and purchase tickets. I will describe the theatre as cabaret style. That is, attendees did not sit in rows of chairs, but at tables with chairs surrounding it. \n\nWe knew that the performance of the \"Explorer's Club\" would be at a community theatre-level and not broadway, but the performers did a great job. There were many talented people on stage who performed convincingly. The sets, lighting, and sound were also well-handled.\n\nA limited menu of food is served before the start of the play and during intermission. They seemed to handle some orders quickly and others slowly. The food was acceptable and it was convenient to have it served.\n\nThere was plenty of parking available when we arrived.\n\nIt was a highly positive and fun experience and I recommend it.",
  "A great place for laughing. Improv group with all ages. Some skits funnier than others. You can order drinks, pizza, popcorn, and desserts. Tickets are $12.75 each. We get tickets for every show. TCT also does great plays and musicals. We saw Elf in December."
 ]
},{
 "name": "Norsemen Brewing Company",
 "address": "830 N Kansas Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/08/f1/d2/halls-of-valhalla-event.jpg",
 "tags": [
  "history",
  "brewery",
  "food",
  "history",
  "brewery",
  "food",
  "history",
  "brewery",
  "brewery",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d11871707-Reviews-Norsemen_Brewing_Company-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I really enjoy Norse Mythology, Viking History, and of course Beer! While spending a day in Topeka, I could not pass up Norsemen Brewing Company! I wish this place was closer,  because I absolutely enjoyed my time here. The brewery was laid back as was the service. The decorations were amazing, I felt as if I was dining in the Great Hall. I ordered a flight and thought the shields were fantastic, favorite so far! Their beer selection was pretty standard, IPA, lager, blonde, etc.. I really liked the Nobles Only Red and Odin's One EyePA. I hope to come back here to sample more beer and enjoy the atmosphere. Odin would recommend coming here!",
  "Fun, relaxing place in NOTO (North Topeka) to go and have a locally brewed beer or cider.  There is signage explaining that you need to go to the bar to order your beverage of choice and enjoy.  I don't like the taste of beer like my friends but I love the cider - so we are all happy.  They have popcorn available.  There is a BBQ food truck that I think is there all the time for very good food choices.  The roll up garage doors at the front make the place open and friendly.  ",
  "On most days, KB’s BBQ truck is available (Tuesday - Saturday). Unfortunately, we visited on a Sunday when no food is served, but we found out that you are allowed to bring your own food. There were two groups already there that had brought in pizza and sandwiches. We decided to sit at the bar and chat with the two bartenders about the history of the brewery. They helped us choose which beer to try from the chalkboard posted behind the bar, but we just thought the beers were just OK.",
  "I liked the beer flights. We could try five for $11. I liked the raspberry and my husband liked one called Adopted Brother Brett, I think. It was nice to sit inside but have an open air seating to enjoy the 70 degree weather. Our friends enjoyed it also",
  "I really enjoy Norse Mythology, Viking History, and of course Beer! While spending a day in Topeka, I could not pass up Norsemen Brewing Company! I wish this place was closer,  because I absolutely enjoyed my time here. The brewery was laid back as was the service. The decorations were amazing, I felt as if I was dining in the Great Hall. I ordered a flight and thought the shields were fantastic, favorite so far! Their beer selection was pretty standard, IPA, lager, blonde, etc.. I really liked the Nobles Only Red and Odin's One EyePA. I hope to come back here to sample more beer and enjoy the atmosphere. Odin would recommend coming here!",
  "Fun place for taking out of town clients or just a friend night. I'm form Topeka so didn't have to travel to get there.",
  "This was an amazing brewery on our trip. Had 10 or 11 brews to sample. Very cool interior and excellent staff. When we visited, they had a food truck that paired well with what they offered. Would highly recommend"
 ]
},{
 "name": "The Great Overland Station",
 "address": "701 N Kansas Ave",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/14/84/63/with-flag-display.jpg",
 "tags": [
  "historic",
  "learn",
  "tour",
  "tour",
  "historic",
  "tour",
  "knowledgeable",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d1550486-Reviews-The_Great_Overland_Station-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful restored building however there's not much to look at as far as old pictures and such. There are very few displays. My little nieces really enjoyed it though because they have a lot of kid stuff.",
  "The former station was getting rundown, when a local effort lead to a complete restoration. The end result is beautiful and well worth a visit. The current museum lacks focus and is strangely displayed. They have various exhibits all around from kid's stuff to old photos. Some are well displayed and some not. They are scattered around with large open spaces. They rent space to groups. They built a large mezzanine over the ticket booths that is not original. The volunteer guides were OK, only somewhat knowledgable. If you love trains, you will find this place interesting. If you are not a railfan, it might be worth skipping.",
  "This well preserved historic rail station is a great place to tour to learn about the early railroad days.",
  "Historic railroad station, spend about an hour-well worth it-take the guided tour (included with admission). Interesting section on Fred Harvey and the Harvey Houses. Oh, a train every few minutes going by. ",
  "Fun and fascinating.  We went to the Luncheon, the food was great, the program which was a combination of information about Fred Harvey and his girls and the train station with different display we were able to see on the tour.  Tour guide was very informative and knowledgeable and made it very interesting.   I would recommend the tour of the train station and if there is another Harvey House luncheon I think most people would really enjoy it."
 ]
},{
 "name": "First Presbyterian Church Topeka",
 "address": "817 SW Harrison St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0e/35/6c/73/chapel-main-church-attached.jpg",
 "tags": [
  "historic",
  "family",
  "historic",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d3507652-Reviews-First_Presbyterian_Church_Topeka-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a historic church over 130 years old. Original Tiffany windows and a church family that welcomes all God’s children. Traditional services Sunday 8:30 & 10:30am. ",
  "How many places can you go to seen 100 year old elaborate stained glass windows.  They are very impressive and the staff was nice and accommodating.   You can touch and take various pictures.  Take 20 minutes out and see this wonder.",
  "A beautiful, historic local church near downtown Topeka area.  Great architecture and history to be seen. ",
  "Very beautiful church in Topeka. Spent Sunday morning here on my way through town. Mass was very nice.",
  "Well, it looks like a great idea but when we got here you can't get inside the doors it's a Sunday and the website is down so double check before you come"
 ]
},{
 "name": "Going Bonkers",
 "address": "5515 SW 21st St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/03/a6/59/fd/playground.jpg",
 "tags": [
  "kids",
  "family",
  "kids",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d2415062-Reviews-Going_Bonkers-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Bonkers has renovated since our last visit, and it was a much more pleasureable experience this time.  Watching the kids in the two story climbing play space was fun and there was booth seating for family to sit nearby and watch while enjoying something from the snack bar.  There are also plenty of games for the kids which give tickets redeemable for prizes.  This is a low cost fun activity for kids, especially when the weather is right for being indoors.",
  "This place has had a facelift since we last came! The gym area looked much cleaner, and there were a ton of new games. Only drawback was that it was a tad expensive. ",
  "We take our grandchildren here quite often, when we are in town!  It’s a fun place to hang out and play with your children.   Many parents just let their kids run, which is ok because it’s a safe environment, but we get in there and play with them!!  \nCould use some cleaning.. \nsnack bar is a little pricy our the cost of admission is fabulous... grandparents get in free!! \nIf you can keep your kids away from the games it’s a fun, reasonably priced afternoon!!",
  "If you have children, take them here.  Everything to climb on, climb through, play on.  Video games, snack bar. ",
  "We can take our 7 year old grandson to Going Bonkers every time he visits us from KC. He makes friends around his age real easily and can play at Bonkers for 2 - 3 hours without getting bored or tired."
 ]
},{
 "name": "Kansas Expo Centre",
 "address": "1 Expocentre Dr",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/56/fc/b8/20160216-125429-largejpg.jpg",
 "tags": [
  "free",
  "cheap"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d8770308-Reviews-Kansas_Expo_Centre-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have been attending events at The Kansas Expo Centre in Topeka for years.  It is now undergoing total renovation with exciting events scheduled for the future!",
  "I know it's been a hard winter, but my sense is that the potholes in the parking lot didn't appear in the last few months.  They are big, deep and almost impossible to avoid at times.  The lot also really needs to be re-striped.  People parked a bit willy-nilly because you couldn't tell where you were supposed to park.  I hope I don't have to go back there for a convention again ",
  "We came to Topeka to attend a show at the Expo Centre recently and were disappointed in the quality of the venue. First, while other reviews mention free parking, we had to pay to park in the lot which is pocked with crumbling asphalt. Second, the staff we approached for help finding our section acted as if they wanted to be somewhere else. And most importantly for us, the seats, while providing an unobstructed view, were incredibly tight. I am 6'1\" and don't have particularly long legs, but there was not enough leg room in the standard seating to keep my knees out of the back of the person in the seat in front of me. This is no exaggeration . . . I have more legroom on most airplanes than in that seat at Expo Centre. \n\nBad on me . . . but I expected more of the Expo Centre. A disappointing venue.",
  "My wife and I saw a Topeka pilots hockey game here last week. The tickets were cheap and the refreshments weren’t too expensive.  The place seemed old and a bit dirty, lots of redneck types in attendance too. Not sure if we’ll be back or not.",
  "Kansas Expo Centre holds most major productions and events that are held in the Topeka area.  Huge facility."
 ]
},{
 "name": "Shawnee North Family Aquatic Center",
 "address": "NE 43rd St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "kids",
  "kids",
  "kids",
  "kids",
  "kids",
  "eat"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d4473957-Reviews-Shawnee_North_Family_Aquatic_Center-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Hands down favorite part is the little kid area. It's nice to have the height restriction so that my kids can enjoy the pool without being run over by all the wild kids that are unattended during the summer time. The lazy river and slides are a huge bonus as well. Wish the price wasn't as high for locals. It would be nice if they discounted for living in the Seaman district or did a Summer pass instead of the punch cards because it doesn't really save a whole lot!",
  "My kids love this pool.  There are different areas to visit and a slide suitable for littles.  Clean and nice staff.",
  "Hands down favorite part is the little kid area. It's nice to have the height restriction so that my kids can enjoy the pool without being run over by all the wild kids that are unattended during the summer time. The lazy river and slides are a huge bonus as well. Wish the price wasn't as high for locals. It would be nice if they discounted for living in the Seaman district or did a Summer pass instead of the punch cards because it doesn't really save a whole lot!",
  "Great place to swim.  Kid friendly, giant areas. Located north of Topeka. Picnic areas and community center also.",
  "My kids love this pool.  There are different areas to visit and a slide suitable for littles.  Clean and nice staff.",
  "Great facility. Broken into three areas, one for smaller kids, one for older guests (with deeper water and slides, etc) and the lazy river area. Landscaping around the lazy river is amazing and the whole park setting is very pretty. Concession stand with very reasonable prices and shaded seating area to eat. Lifeguard staffing seemed more than other places I've been which is a plus. Would highly recommend.",
  "Took the grandkids.  One is a bundle of movement and energy. The other one has the energy level of a rock.  Both of them had a good time here.  Mr. Energy rushed from floating river to slides to pool again and again.  Miss Rock floated and floated.  The place was clean.  The life guards attentive.  It was easy to find shade in which to read.  We will return.",
  "The worst thing I could say is that the sidewalks are hot, but what would you expect in July. Two middle-aged men were apparently allowed to guard their inner-tubes by the table where they were snacking while others were waiting for inner tubes to float on the lazy river. THAT was not right (or very grown-up of them.)"
 ]
},{
 "name": "Owls Nest Topeka Antique Mall and Flea Market",
 "address": "3411 SW Topeka Blvd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/9b/06/c4/front-door-of-the-owl.jpg",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d12050840-Reviews-Owls_Nest_Topeka_Antique_Mall_and_Flea_Market-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "My wife and I have gone to both Owls Nest locations.We Love all the booths,and evidently we Love spending money.We have visited a total of three times.1 time to the one on Topeka Blvd. and had to make 2 separate trips to the one on 29th. The prices are reasonable so we got a lot of stuff for our money,it also gave us some Christmas Gifts. And this Saturday they are having their parking lot sale... More Christmas Gifts????",
  "I saw this on Trip Advisor.  It was just up the road from our motel and decided to give it a peek.  It's a large antique mall with booths from many vendors.  We had an enjoyable time browsing through it.  Things seemed to be reasonably priced.  We bought a few items.",
  "This Antique store has something for everyone.  Has several rooms with lots of vendors to display their items.  I saw old records to new,   houseware items, toys, crafts and old clocks.  Lots of other items, to many to list.  Their prices are very reasonable.  The staff is very friendly and helpful.",
  "We visited the Owl's Nest on a Wednesday morning, so it was not crowded.  They have a huge variety of items!  The staff was very friendly.  We enjoyed browsing through all of the merchandise.",
  "Cool place to shop for vintage items , they just opened another store at 29 th and Adams . Usually we always find and buy something when we’re here !"
 ]
},{
 "name": "Mulvane Art Museum",
 "address": "Washburn University 17th and Jewell",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/02/26/fa/a7/mulvane-art-museum.jpg",
 "tags": [
  "free",
  "art",
  "knowledgeable",
  "family",
  "art",
  "kids",
  "learn",
  "art",
  "creative",
  "walk",
  "kids",
  "family",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286471-Reviews-Mulvane_Art_Museum-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located on the Washburn University campus, this museum makes for a nice stop to spend your afternoon.",
  "If you're expecting the Art Institute in Chicago, you'll be disappointed. But if you're expecting what most folks expect from Kansas you will be thrilled. Washburn has a good base collection and knowledgeable staff. The city of Topeka has a relatively big art community so we see some nice local exhibits from time to time as well as traveling exhibits. And nothing beats the art lab downstairs; my niece loves it. Oh, did I mention free to the public and free parking? Just be sure to check the hours on the website before you go. ",
  "Located on the Washburn University campus, this museum makes for a nice stop to spend your afternoon.",
  "We come to Topeka about every six weeks to see our granddaughter and always try to have some kind of activity planned.\nThis time we went to the Mulvane Art Museum. We loved the ArtLab! It has a variety of activities for the whole family, we ranged in age from 6 to 72, and all found things to interest us.\nThe only thing we had problems with is the lay out of the museum, we came specifically for the art lab, but a map of the museum would have been great as we were unclear exactly where all the exhibits were and there were no directions. What we did see of the art was interesting and next time we come we will ask for a map or something.\nI do want to encourage everyone, when you see a sale of school supplies. Please bring crayons, glue sticks, paint brushes, paints etc to Mulvane for the use of the families , also any old magazines , or art books. They are doing a marvelous thing here so donations of cash or supplies are welcome.",
  "We went for a butterfly event and loved it...downstairs! They had wonderful areas for the children to explore, create, and learn. We loved it. On the main floor we enjoyed the different art and simple machines to create the creative art pieces. However, the top floor was more than a disappointment! There was a poster of a naked Playboy layout. It had NOTHING to do with the exhibit. It wasn’t artistic in the least. It was so out of place that it was laughable. \n\nIf you have young kids, apparently you have to explore beforehand to make sure they didn’t include PLAYBOY! Ridiculous.  ",
  "They always have something new and exciting.  I enjoy going every few months to see what's happening.  The Washburn campus is also pleasant to visit for a walk.",
  "We have been multiple times & love to take our family. The kids can play with a variety of art mediums...and the adults can too! Beautiful gallery upstairs & lots of fun downstairs. A gem in Topeka for sure!"
 ]
},{
 "name": "Blaisdell Family Aquatic Center",
 "address": "SW Westlake Ct.",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/18/95/97/90/20190730-131114-largejpg.jpg",
 "tags": [
  "family",
  "organized",
  "kids"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d8412874-Reviews-Blaisdell_Family_Aquatic_Center-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Blaisdell Family Aquatic Center is nestled in lovely Gage Park. It is family fun for all ages. There are distinct areas for differing swimming abilities. Tiny swimmers have a cute area for water fun, that is separated from the larger pool area. An obstacle course and two waterslides are in a very large intermediate area, which is separated from the deep end of the pool by a blue, floating divider. The deep end is equipped with a low dive, high dive, a platform dive, a rock wall and two water slides. Though the pool was very crowded on the day of our visit, everyone was having a great time. The lifeguard staff rotations were organized and the pool was well covered. Blaisdell Family Aquatic Center is great for lots of summer family fun!",
  "Loved the aquatic park, the slides were GREAT!!\nLoved spending the day there!!\n(Downside NO snacks can be brought in)",
  "Located in Gage Park, near the Topeka Zoo and park areas.  A great place to frequent in the summer months.",
  "This place has a good variety with slides even the little can use.  Wave pool is fun and everything is clean.",
  "Kids had a super time. Some water slides. All sizes of diving boards. Great kids area for a pool. We had an enjoyable day."
 ]
},{
 "name": "Topeka Performing Arts Center",
 "address": "214 SE 8th Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/56/f1/e6/20160216-123107-largejpg.jpg",
 "tags": [
  "theatre",
  "affordable",
  "performance"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d286461-Reviews-Topeka_Performing_Arts_Center-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "We were pleasantly surprised at the Topeka Performing Arts Center.  We went for the Beach Boys concert and had chosen balcony seats since we weren't familiar with the venue.  I'm short, so often floor seats are frustrating to me.  The theatre floor seats were on a slanted rise and afforded everyone in them a nice view of the stage.  If we had known, we would have gotten floor seats.  Very nice facility.  Seats were comfortable.  Our view in Balcony B of the background screen and  old movies shown by the band were obstructed by a speaker unfortunately which was a bummer.  All in all a great concert thought!",
  "Great time at the Center seeing Tim Allen. We purchased \"obstructed\" view seats, but really, the were some of the best in the house. Comfortable. Beverages there were affordable and facilities were very nice. I would go again.",
  "We took our young daughter to see the performance and were very pleased with the venue. Clean and easy to navigate. ",
  "Noel the musical was performed to perfection at the Topeka Performing Arts Center. The cast was engaging & the sound was fantastic. Todd Berkich was Nick (St. Nick) Tess Jonas played “Duchess” so very good!  The voices were amazing. What a fun night.",
  "Went to see Styx here and the Venue was fabulous... seating was perfect, acoustics were great, beautiful place!!!! Even bathrooms were very adequate!!! Just disappointed that it was not sold out... my cousin said it never does, that Topeka is not a huge concert place... they should market their shows better... I drove in all the way from Springfield!!!"
 ]
},{
 "name": "Cedar Crest",
 "address": "1 SW Cedar Crest Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/e8/a4/7c/cedar-crest.jpg",
 "tags": [
  "walking",
  "walk",
  "walking",
  "walking",
  "hike",
  "tour",
  "family",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d279103-Reviews-Cedar_Crest-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Cedar Crest is the Kansas Governor residence. Beautiful grounds, park. Walking trails are open to the public.",
  "Never in a million years would I expect to be able to roam the grounds of a Governor's residence! Cedar Crest is the residence of the Governor of Kansas and the beautiful park like grounds are open to the public. The trails aren't well marked and there are enough options to become a bit \"lost\". I am from Arizona so I especially enjoyed the opportunity to walk my dog through the greenery. We were there during a weekday and only saw a few other people. What a wonderful assets to this nice Midwest city.",
  "Cedar Crest is the Kansas Governor residence. Beautiful grounds, park. Walking trails are open to the public.",
  "There are several walking trails through the woods and also down to the fishing ponds.  My wife and I really enjoy the wooded walks as there are plenty of birds and critters to see.\n",
  "I LOOOOVE this place! The trails are natural and the woods are beautiful! I live in Kansas City but made it out 2 weekends in a row, once with my boyfriend, the other with my son, and we went to hike this trail! My son is more of a hiker than my boyfriend is, so we made it through an entire trail and a partial of another. It was great!! We will definitely be back! :)",
  "This is the governor's mansion for the state of Kansas.  It's only open on Monday afternoons from 1 p.m. till 3:30 p.m.  They have volunteer docents to take you on a tour of the first floor of the home.  You can't go upstairs (family living quarters) or the basement (security detail).  You can walk around the actual home itself and there is a huge acreage where you can walk the trails (suggest you wait for nice weather).  It's well maintained as you would expect from a public building.  There is an organization that collects donations to help maintain the furnishings and add needed details like gates, etc.  The docents are very nice and can answer nearly every question you may have about the home.  It's an actual home that the family lives in and feels as such.  The main floor is where most of the actual entertaining occurs, hence the area where you can tour.  The previous owners were of Scottish descent and there are roses and thistles all over the furnishings.  There is a hidden safe in the previous owner's home office near the fireplace and it's covered by a wooden panel.  On the main living room fireplace there are matching acorn shaped boxes that used to hole knives and actual look more like funeral urns.  These are very rare pieces and not many exist today.  The previous owner also left a huge collection of out of print books and they are in built in bookcases throughout the home.  It's free to visit and while in the home you must stay with the docent or security detail provided.",
  "Great system of public mountain bike trails.  Well marked and multiple trails for different ability levels"
 ]
},{
 "name": "Holley Museum of Military History",
 "address": "420 SE 6th Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/9b/69/1e/the-sign-by-the-door.jpg",
 "tags": [
  "tour",
  "history",
  "free",
  "knowledgeable",
  "historic",
  "free",
  "walk"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d7238288-Reviews-Holley_Museum_of_Military_History-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "Located inside downtown Ramada Inn.  A nice display of military memorabilia, spearheaded by a local gentleman.",
  "The Holley Museum of Military History is a neat little museum in the Ramada Inn.  It's free.  It is a museum of history, not historical artifacts.  There is a continuous audio tour playing on the sound system that leads you through the five rooms.  Most of the exhibits are models, diaramas, photographs and newspaper clippings.  There are very few artifacts here.  But it is all very interesting.There is a little on the Civil War, some on WWI, a lot on WWII and quite a bit on later events.",
  "We went just to go since it was located in the hotel we were staying in, it was actually very interesting and the staff member was very knowledgeable about the models. This museum featured dioramas of various military battles and also featured various artifacts.",
  "This museum is easy to miss, being located inside the Ramada hotel, but seek this place out! It’s quite small, but full of so much fascinating and good stuff, it took us about an hour and a half to go through all four rooms. The collection is kept by volunteers who are also veterans, and if you are lucky, you’ll get the man we met on our subsequent visit and he told us some amazing stories about Mr. Holley, as he had personally known him. This location is definitely a must-see!",
  "While some will view this small museum as a collection of models it is much more than that. The several rooms are filled with historic artifacts, most with a Topeka or Kansas connection.  Of special interest to me was the original equipment/invention of a system used to extend the time blood could be stored under war zone conditions.  It was designed by a Topeka doctor. I can't help but wonder how many lives that system saved.  Another item I like was a large bronze plaque presented to Topeka Attorney Harry W. Colmery who is recognized as the author of the original GI Bill of Rights.  Imagine how many lives Colmery and other American Legion leaders effected for the good.  The new homes that were built, the number of veterans in every walk of life who graduated from college or a trade school, or started a small businesses!  The original . \\\nGI Bill is one of the very few government programs that has ever paid for itself because the growth it spurred created more tax income.\n\nTheir are several more artifacts on display and the audio system and volunteer guides all add to the interesting and educational experience this small local attraction offers. \n\nThis facility relies on free will donations and contributions are greatly appreciated."
 ]
},{
 "name": "Prairie Glass Studio",
 "address": "110 SE 8th Street",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "unique",
  "kids",
  "unique",
  "creative",
  "art",
  "creative",
  "art",
  "creative"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g60747-d13225196-Reviews-Prairie_Glass_Studio-Topeka_Kansas.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are looking for a gift that has the sunflower design this is the place!  So many different color choices and designs!  Loved the ornaments too.  Fun place!",
  "Locally owned.  Cute shop.  They offer classes.  Unique and beautiful glass items offered for sale here.",
  "Kymm & the staff at PGS are fantastic to work with and make the experience fun & creative. No particular skill level is needed to make your very own piece. Reasonably priced, fairly quick, & so unique. Great gifts are available in the studio, as are gift certificates. Fun day with friends, kids included. Bring snacks/beverages & make it a party. They fill up, so recommend calling ahead. And, just so you know, it's about 14 days for pick up...which is a fast turn around on the firing process. So much fun. I can't get enough!!",
  "This is a lovely shop with beautiful, creative and well-priced works of art, many of which are perfect for business gifts.  I love the creativity and \"eye\" of the owner and those working with her.  Although I haven't had a chance to take a class there yet, I intend o based on so many of my friends' positive reviews of the classes.",
  "Have been in a few times during First Friday Art Walks.  Everyone is always friendly, the store is well decorated, and well-lit. They seem to have a lot of creative things, including classes that you can take.  Definitely worth a look at if you have a few minutes to spare downtown.  You could pick up a cup of coffee at Juli's next door.    "
 ]
}]
