[
{
 "name": "Old Barracks Museum",
 "address": "101 Barrack St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/13/5d/d6/62/officers-quarters.jpg",
 "tags": [
  "field",
  "history",
  "knowledgeable",
  "tour",
  "history",
  "tour",
  "free",
  "walking",
  "learn",
  "historic",
  "kids",
  "tour",
  "free",
  "tour",
  "history",
  "kids",
  "history",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d103622-Reviews-Old_Barracks_Museum-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "I have taken multiple field trips all over the northeast and the Old Barracks Museum is by far one of my favorite field trips.  It's like going back in time and you experience history in a way that makes it feel real and not something out of a text book.  It's living history that you can experience.  The staff is very knowledgeable and make it a fun time for students or families.",
  "Great historical museum. Besides a tour of the barracks, there are three rooms about the history of the barracks and the French and Indian War. There’s also a video of battles of Trenton and Princeton. The tour was very informative and the tour guide added a little humor while talking about the barracks, events leading up to the Revolutionary War and New Jersey’s role in the Revolutionary War. The room about the French and Indian War alone is worth the visit. Would definitely consider returning for another visit.",
  "It's a restored Seven Years War (French and Indian Wars 1758) and Revolutionary War Barracks with rooms reflecting the 1700's with outstanding level of detail throughout. Guides dressed in period attire enlist troops (tour ticket holders) into George Washington's army. The tour cost $8 for adults, $6 seniors and is 45 minutes long and starts at the top of the hour Monday-Sat 10-5pm. Saturday features free parking right behind the Old Barracks. I parked on the street meter parking at 25 cents for 15 minutes. You are free to roam around after the tour. The tour starts with a video of Washington's 1776 crossing of the Delaware called \"20 Crucial Days\", and the battles at Trenton and Princeton. Tour ticket holders learn what it was like to be a soldier in the Continental Army. How they slept, ate, spent leisure time and were generally cared for and treated are revealed in an interactive format which kids appreciate. Copies of pamphlets, articles of clothing, muskets, swords and furniture can be seen. There is a hospital  with instruments of the day displayed and a real time inoculation for small pox. Officer's rooms as well as rank and file soldiers accommodations are shown. There were 20 rooms with 12 soldier's per room. The second floor has a museum with small exhibit halls but no photos are allowed. It's been a National Historic Landmark since 1972 and is a Blue Star Museum. The State Capital and the NJ State Museum are right around the corner within easy walking distance. The Trenton Visitor's Center is right across the street.",
  "This is an interesting museum in which one can feel the dignity and solemn quite of a past war where soldiers sacrifced for what they believed was right for the families, country and the world.",
  "Excellent 23-minute video followed by guided tour of the barracks.  John, our guide, was dressed in period costume.  He provided a detailed and lively narrative regarding the historical significance of the Old Barracks.  Free parking on premises made this a great Saturday afternoon stop!",
  "Did a history lesson this past week and visited the location with friends while visiting the area. Our friends from the area said they have not been since they were kids and enjoyed it as much as I did (coming from DC).\n\nJohn was an excellent tour guide, very informative and captured the history keeping the attention from kids through adults.\n\nShowing us a small room that housed 18 soldiers (3 per bed), to the Officers quarters and their pack-able beds, to the Hospital treating Small Pox and how George Washington's crossing the Delaware 9-miles north on a cold snowy Christmas Day played on through Trenton.\n\nHe was able to keep everyone's attention for the entire length of the tour\n\nThank you John for the History lesson (again).",
  "I went here just to check it out. Very interesting place, Lots of history and folks in period costumes.\nPlan to send at least an hour there and see the demonstrations.",
  "My son and I visited on a wintry day and were entirely pleased that we did! The young guide was friendly and extremely knowledgeable and patient with all of our comments and questions. He is a reenactor and I was as interested in his clothing as anything else! I didn't realize that the Barracks' original use was during the French and Indian War. The exhibits told the stories of what it was like to be a soldier or officer, and in the apothecary's room, our guide gave a fascinating presentation about the different strain of smallpox and how innoculation of the Continental Army occurred at the site. The receptionist is the gift shop was also helpful and informed! I'll take my grandkids!"
 ]
},{
 "name": "Arm & Hammer Park",
 "address": "1 Thunder Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/10/28/de/54/veiw-of-the-field-from.jpg",
 "tags": [
  "cheap",
  "food",
  "delicious",
  "eat",
  "kids",
  "food",
  "cheap",
  "kids",
  "affordable",
  "food",
  "cheap",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d103625-Reviews-Arm_Hammer_Park-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Great place to watch a minor league ball game. Fan & Kid friendly\nBaeball food and beverage at a good price Parking is cheap",
  "On a beautiful Sunday, September 3rd the Trenton Thunder AA affiliate of the New York Yankees hosted the Reading Fightin Phils AA affilate of the Philadelphia Phillies for a doubleheader. My beloved Phils won both games, and while there I enjoyed the Swine Sandwich from the Case’s Pork Roll station. The sandwich was of course Case’s pork roll topped with pulled pork, bacon, and American cheese on a Kaiser roll. It was delicious and the stadium is a great place to watch baseball. Highly recommend a visit and this sandwich. Congrats to the Trenton Thunder on an amazing season",
  "We go to Trenton Thunder games several times a year.  There are no bad seats, so everybody can see everything and there are lots of opportunities to catch foul balls or extras thrown to kids by players.  There is a play area for little kids, and there is a pitching speed game that is fun.  Mascots are always around for autographs and pictures, and Boomer's mom makes an appearance on Mother's Day.  Parking is plentiful, but sometimes leaving the lot can be slow.  There are lots of distractions between innings.  Eat the Chickie & Pete's Crab Fries to complete the experience.  Great for baseball fans and families!",
  "clean stadium, pleasant staff, great service, awesome team!!! love coming here with my kids who don't need to be at a major league game. here the tickets are cheappp and u get front row seats! because of the cheap price it is more kid friendly so theres not too much drinking etc going on. the food and drinks, beer are also very cheap! love it here been here quite a few times and my kids cant wait for the season to start so we can go back already!!!",
  "It is really fun and lots of baseball just don't spend much on the tickets because they let you sit wherever you want",
  "thunder baseball is the best sport entertainment from April-September in mercer county New Jersey. i attended at least one game a week all 26th season. my sister have enjoyed many great times in arm and hammer park. i have met many wonderful people in the park. the thunder staff are top shelf, they all treat their guest special. my sister really really love our bobble head collection from the thunder. thank you trenton thunder. looking forward to 2020 season. it is a awesome place for the children.",
  "I was in the area with my wife who was on business.  we decided to take in a game in the evening.  Tickets were affordable, the staff was very helpful and the food was very good. Traffic coming in to the stadium was heavy since it was around 5:30 pm, but it only delayed getting there by a few minutes.  I'm looking forward to taking in a few games next season.",
  "Great place to watch a minor league ball game. Fan & Kid friendly\nBaeball food and beverage at a good price Parking is cheap"
 ]
},{
 "name": "Trenton Farmers Market",
 "address": "Spruce Street",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/08/13/da/a3/trenton-farmers-market.jpg",
 "tags": [
  "food",
  "learn",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d5567825-Reviews-Trenton_Farmers_Market-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Spent a wonderful few hours speaking with the vendors and perusing their wares. My first encounter was with Jenn Wagner of Amaryllis Craftworks.  I purchased two of her lovely scented-candles:  Moonlake Musk and Sea Salt & Orchid.  Then, I browse through tons of used books, all in excellent condition and many hardcovered.  I purchased 8 wonderful cookbooks, 4 of which are Williams Sonoma and have awesome graphics.  Next, I chatted with Paul Kraska about his antiques and collectibles.  I purchased two small owls, one ceramic and one bronze.  Finally, I stopped by Danny's booth to admire the lovely purses and totes.  Apparently, his daughter is the designer behind Violet Ray NY.  I purchased two handbags.  Turns out Danny is a fellow Brooklynite!  Even stopped in Halo Farm to purchase some items before heading out.  Trenton Farmers Market is a fun way to spend a few hours!",
  "I have been shopping at the Trenton Farmers Market for over 30 years and I have just recently gone through some dramatic health changes that have improved my health and well-being and they are all due to shopping at the market. All my meats are purchased at Cartalidges, local farm raised meats and poultry that are well worth the extra $ over grocery store specials, Seafood from Carl’s is wild caught fresh whatever is available that week, he buys and sells what he gets each week, vegetables of course throughout the season are available in plenty through several markets, my favorites are Pineland farms and Russo’s. Buy local and fresh and bring your health back to where it was meant to be. Your body knows how to process real food as it comes from the ground!",
  "This a fantastic opportunity to buy locally grown and produced Jersey fresh!!! Veggies, deli, Polish and fantastic Amish meat. Weekend is time for a few to sell their wares, beautiful handcrafted jewlry and Terhunes orchard. The three stars is only because the bathroom is in a separate building and you have to ask for a key like you’re in kindergarten.",
  "Local food, fresh food, you can’t find at the big box stores on Route1.  Meet the farmer and learn what’s in season.  Weekly visits are worth the trip.  Vegetables, fruits, baked goods and butcher under one roof.  Parking easy.",
  "Spring flowers, herbs, Jersey tomatoes, corn, eggplant, peppers, peaches, squash, potatoes, apples and pumpkins. Everything in season and fresh."
 ]
},{
 "name": "New Jersey State Museum",
 "address": "205 W State St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/05/ba/55/24/new-jersey-state-museum.jpg",
 "tags": [
  "kids",
  "free",
  "kids",
  "art",
  "history",
  "kids",
  "kids",
  "kids",
  "art",
  "history",
  "free",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d103621-Reviews-New_Jersey_State_Museum-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "We really enjoyed or visit here!  I especially loved the WWI poster exhibit!  There were actually!my a few interactive parts to some tof the exhibits, but they were geared more toward kids (didn't stop me lol!).  We saw the Dark Universe show at the planetarium which was very cool, but we missed out on looking at the displays in the planetarium (our timing was bad).  I'd say we got there around 11:30 am & left right as they were closing (exhibits close at 4:45pm), this included the 30 minute planetarium show.  The gift shop had a lot of cool stuff, including local artisan items.  It was very fun & we're glad we went!  We'd come back too!",
  "This review was written by a six-year-old boy whose name is Mark.  \"If you see Trenton museum, go to it!  It is filled with fun facts and dioramas of prehistoric dinosaurs and animals.  There was a paleontologist who showed me a megalodon tooth and showed me a huge crocodile-like jaw!  It was totally awesome.  It was the best museum I have ever seen.  We saw flags from the Civil War.  I made a flower (a poppy) that was made out of red tissue paper and a pipe cleaner (to remember soldiers from WWI).  The museum was free.  The paleontologist even showed me a new genus or type of turtle fossil that was in the time of dinosaurs. Everybody was very friendly.  The shop had terrific things for kids.  I got a dinosaur activity book.\n\n((Parking was free in the state house parking garage next to the museum.))",
  "This museum has a terrific natural history exhibit, a very strong collection of fine art and a terrific planetarium.  Kids will love it and so will their parents.",
  "Me and my 10 year old had a fun afternoon in the museum we watched the Apollo Story on the full dome. It was fascinating, the first part, the host introduced the night sky star show and talked about constellations in the night sky it was absolutely beautiful something they do on patriot week. Do visit this place if u have young kids. Also, the dinosaur fossil collection is a must visit for Dino enthusiasts.",
  "The planetarium had great shows. The museum itself has a small kids' corner, while my 4-year-old wasn't interested in the rest of the museum. Easy parking during week, at underground carpark, and easy to get to from Route 29.",
  "Looked worn and un kept. Not many people around that showed any interest. Planetarium was very lacking at best. ",
  "Adjacent to the New Jersey State House, visits will find the NJ state Museum and Planetarium. The museum offers four floors of art and artifacts that tell the history and natural history of the Garden State. Admission is free but there is a small charge for the planetarium shows. Free parking is available win the underground garage below the building. While you are in the area, be sure to visit the State House next door where you can see the the state legislature galleries the governor's office. The museum boasts a number of interesting exhibits and visits can even see  searchers working on recently found artifacts. On the day of our visit, the museum was practically empty. It needs more publicity. During the school year, there are often student groups learning about the state's heritage.",
  "I've been on multiple visits. The artifacts and regional history is a must if you live in the area. The 9-11 WTC exhibit is especially interesting."
 ]
},{
 "name": "New Jersey State House",
 "address": "145 W State St State House Annex",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0c/17/5c/ad/photo0jpg.jpg",
 "tags": [
  "tour",
  "learn",
  "history",
  "free",
  "tour",
  "free",
  "free",
  "tour",
  "learn",
  "history",
  "free",
  "tour",
  "free",
  "tour",
  "history",
  "tour",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d103624-Reviews-New_Jersey_State_House-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Take the free tour and learn a lot about this state's capital (the building itself is different than the US Capitol!) Lotsa history here, and for Capital Collectors, the stamp is at the tour lectern. Recommended.",
  "Our very informative guide, the head of Office of Legislative Services, Penny Gardner, took us on a free, hour-long tour of the State House Annex. She discussed the artwork that has been added over the years. I highly recommend this tour.",
  "A definitely highlight of my visit to Trenton.  Visiting State Capitols is one of the most under-rated activities I can think of; tours are free, well-presented and the buildings tend to be gorgeous showcases.  The NJ State House was no exception in this regard; the dark red rotunda was especially beautiful with handsome portraits of the former governors; the General Assembly and Senate were also exceptional with gold-leaf mouldings and an Edison-made chandelier in the former and handsome paintings in archways in the latter.  ",
  "Take the free tour and learn a lot about this state's capital (the building itself is different than the US Capitol!) Lotsa history here, and for Capital Collectors, the stamp is at the tour lectern. Recommended.",
  "Our very informative guide, the head of Office of Legislative Services, Penny Gardner, took us on a free, hour-long tour of the State House Annex. She discussed the artwork that has been added over the years. I highly recommend this tour.",
  "We make a habit of visiting state capitals while on vacation and stopped in Trenton while heading up the Hudson River.\n\nUnfortunately the building is under (a long) renovation, so the rotunda and executive branch areas are closed, but we still got to see the Senate and General Assembly.\n\nDave did a great job with our tour, which included the fourth grade from the Fair Lawn Elementary in Bergen County.  He made the tour interesting to both students and adults.  The students were a very nice group, well behaved and involved,and we enjoyed touring with them, their parents, and teacher. \n\nParking was easier than I thought it would be.  Follow directions from the website, and watch for signs directing you to the visitor parking area in the garage.",
  "It’s hard to believe that I have never visited the State House! We had a really good time. We started off at the old barracks where costumed characters talked to us about the revolutionary war. There were soldiers who gave a musket demonstration, and a Doctor who cared for soldiers explaining that they would intentionally expose the soldiers to virus to make them immune.  We then headed to the State House and saw the 2 chambers. It we really beautiful inside and you could feel the history. NJ statehouse is the 2nd oldest in the country! There is also a Museum with a lot of different exhibits. If you like history you will love visiting. ",
  "Average rating because so much of the State House is currently off limits due to renovation. You must take the free, one-hour guided tour to access to the Senate and House chambers, but you won't see much else. "
 ]
},{
 "name": "William Trent House Museum",
 "address": "15 Market St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/b8/fc/1b/front-view.jpg",
 "tags": [
  "tour",
  "family",
  "history",
  "tour",
  "history",
  "tour",
  "history",
  "kids",
  "free",
  "tour",
  "free",
  "learn",
  "history",
  "historic",
  "tour",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d4399298-Reviews-William_Trent_House_Museum-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you are interested in the War for Independence, this is place that should be on your itinerary. Start at Bowman's Tower in Washington Crossing, PA where the troops kept watch on the goings on of the British and take in the nearby Thompson-Neeley farm where the officers were quartered.  Travel down river to Washington Crossing Park for more history (or make sure you're there at Christmas for the crossing-the-Delaware re-enactment).  Then cross the river on the very old, very narrow iron bridge to New Jersey and take River Road into Trenton to the Trent House (1719) in the middle of the Capitol Complex.  It has been restored and the tour guides provide fascinating insight about the house, grounds, family, business and workers.  Some of the grounds have also been restored and there are new plantings of apple trees on part of the land that had been a vast orchard. ",
  "This is out of the way behind the Supreme Court. at the Hughes Justice Complex.  It is well worth the 90 minute tour. It is an amazingly old place over 300 years and most of it is in the original condition.  I love history and this place is a true gem of Trenton along with the old Barracks. ",
  "While some people disparage Trenton...there are many great things to do and see in this city.  The Trent House is really an overlooked piece of American History.  This 300 year old house is splendid, yet \"plain\".  While William Trent owned whole or in part 40 ships and 800 acres (which he incorporated into \"Trenton\"), he lived fairly simply.  The tour guide was well informed and very interesting to listen to.  The house (using Trent's will) is being decorated with authentic and replica furniture, but don't expect Rockefeller decorations...he was a very simple man.  The hour long tour in the A/C house costing only $5 is well worth it.  Plenty of free parking.  Perfect for lovers of history, not really designed for kids unless they have an appreciation for history.",
  "This 300 year old house is a best kept secret and it shouldn’t be.  William Trent and his son played very important roles in our colonial history.  Take a tour of the house and see many original pieces.  Visit the historic kitchen garden and apple orchard.  See the 250 year old vest that his son wore in England.  Great stop for anyone wanting to learn more about our past.  Step back in time - Don’t miss this site . Free parking. Air conditioned buildings. Visit their website for hours.",
  "My nephew came to see me and needed to visit a bunch of historical places for a summer project. I took him here because my dad had loved the idea that this historical house was right in the middle of Trenton! \n\nI had issues finding it only because I did not believe the GPS. The tour guides were amazing and filled with tons of information. There wasn't a lot of furniture but they said that was normal back then because they moved the furniture based on the sun's position.\n\nReally fun and uncrowded place to take any history buff!"
 ]
},{
 "name": "Rockville Climbing Center",
 "address": "200 Whitehead Rd",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/12/ed/f0/e3/rockville-climbing-center.jpg",
 "tags": [
  "family",
  "knowledgeable"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d3781164-Reviews-Rockville_Climbing_Center-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "More animal holds, please! =D\n\nWe visited this climbing centre recently and were amazed at how easy it was to start climbing.\n\nMany of the routes had auto-belay systems which beginners or solo climbers can rock up (excuse the pun), clip on by yourself and just start climbing without having to book in advance. \n\nThere were also routes for manual belay and bouldering, but we as beginners just stuck with the auto system routes, these ones had various levels of difficulty - so the only difference is that you don't need to know how to tie knots or have someone else belaying for you. Although there is the initial drop of half a foot to get used to before the mechanism catches you, once you're used to the feeling then feels secure.\n\nThere was this parent and child who played a game where they used the animal holds as markers, and they'd pretend to be rescuing them on the way up. We had never seen this feature before and it definitely provided great entertainment and encouragement to the top. So my suggestion would be to have more walls with these, please! =D\n\nWe had a great time, 10/10 will go again. ",
  "Super friendly staff, great facility and fun/challenging walls to work on. The auto-belay option was perfect for our first visit to the climbing center. We did go during Xmas break on a rainy day and got a full house by 2pm but everyone worked together to get time climbing. Looking forward to checking it out again on my next visit to the area.",
  "My bf and I really like that this place have auto belays. So people don't have to rely on others to belay them. This place has a pretty good amount of walls for all types of climbers. We visited the gym today (Saturday) and there was a decent size crowd. But we didn't feel like it was packed where we had to wait around for a wall. We spoke to about 5 different staffs and they were all very friendly and helpful. After we signed the electronic waiver, we each got shoes and a harness. A staff member showed us how to put on the harness and how to use the belay system. In less than 5 minutes, we were already climbing on our own. The part of the wall with rocks with no color tapes is the easiest to climb. The round disc at the top with the number is the auto belay system. Once you get to the top, you can tap the disc to indicate you got to the top. Inside the climbing area, there are open shelves on the seating area to place your belongings. And there are two vending machines, one for drinks (water/soda) and another for snacks. Another plus to this place is that you can climb for the entire day. We entered the place once they opened and left around noon to grab lunch. After lunch, we went back to climb some more. Not a lot of places (in general) allow for people to leave and return without paying for second admission. Wear a pair of old socks or dark socks cause the rental shoes will stain your socks blue. Can't wait to return!",
  "There are lots of walls of all different skill levels. They also have auto-bellay systems which were a great help. All the people were very friendly and helpful",
  "Rockville climbing center is a nice change from my regular workouts. I have been here several times  under different circumstances and it is always a great time! I have been her as a couple, with friends and even alone. The automatic belay systems they have installed are wonderful for those who don't have a climbing partner or come alone. The staff is very friendly and knowledgeable. They are around to help and assist if needed.  If you are looking for a fun date night or family outing, Rockville is a great place to visit!"
 ]
},{
 "name": "Trenton Thunder",
 "address": "1 Thunder Rd Arm and Hammer Park",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/14/c5/f7/14/good-view-seats-almost.jpg",
 "tags": [
  "drink",
  "affordable",
  "kids",
  "food",
  "kids",
  "food",
  "affordable",
  "family",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d15028408-Reviews-Trenton_Thunder-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "I buy the a six game plan. You get great seats, s hot dog , drink with it.\nBest of all you get to see young player trying to make it to the \"Big Sow\".\nA few time a year you may get to MLB players doing re-hab there.\nAlso in September they have a pork roll eating contest.",
  "had an amazing experience every time i bring my kids here. there are real players who many times end up on the major league teams that season or the next! my kids think they are at a yankees game when we are here :) clean park, pleasant staff and service, AFFORDABLE",
  "Come every year always a nice time. Other reviews say it all: all good seats, reasonable good food. When they have fireworks the kids love it.",
  "Thunder Park is a beautiful facility. Every seat provides a great view, always fun activities going on between innings and lots of good food for all tastes.",
  "this is an amazing venue. and affordable for a family. i kjhnow that a pro game is exciting, but this a great night out. food and beverage 1/2 the price of a pro game. they have so many things for children during the game and some nights there are giveaways and promotions. they have games for children during the game. just a fun, reasonable night."
 ]
},{
 "name": "Cure Insurance Arena",
 "address": "81 Hamilton Ave",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/fa/75/ae/photo0jpg.jpg",
 "tags": [
  "food",
  "walk",
  "food",
  "food",
  "walk",
  "food",
  "food",
  "walk",
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d14180960-Reviews-Cure_Insurance_Arena-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "The Cure arena is a great venue for entertainment in the Trenton area. Unfortunately, many of the events are geared toward chidren.\nSeats are comfortable, arena is clean, food is always available, and paid parking is a short walk.\n",
  "We went to a Monster Jam show at the CURE Insurance Arena. I think I went to an international volleyball event about a decade ago when it was called Sovereign Bank Arena. Both of the events were sized right for CIA. Every seat has good views of the playing area. There are 'luxury boxes' and enough food options to satisfy multiple tastes. There are Philly favorites like Wawa and Chickie's & Pete's. \n\nI don't know if it's because of the event, but it was very cold inside. Lastly, while it's easy to get in and out, it's not in the nicest area.",
  "The Cure arena is a great venue for entertainment in the Trenton area. Unfortunately, many of the events are geared toward chidren.\nSeats are comfortable, arena is clean, food is always available, and paid parking is a short walk.\n",
  "First visit to the Cure. No complaints. Everything was overshadowed by a sensational entertaining show from the King n Country. Their stage production was amazing and the energy from the group was fantastic. The staff was extremely friendly. Parking was a breeze. Excellent time.",
  "Nice place to see an event. Not a bad seat in the place.  Easy in and out parking. Nice concession stands, but food overpriced for this type of venue. ",
  "The Cure arena is a great venue for entertainment in the Trenton area. Unfortunately, many of the events are geared toward chidren.\nSeats are comfortable, arena is clean, food is always available, and paid parking is a short walk.\n",
  "Went to Cure Ins. Arena in Trenton NJ to see Jeff Dunham. Show was geat and arena was great. Staff friendly and helpful.\nShow lasted 2:20 hrs, new material and some of the classics. Parking easy but $15.",
  "Long time since I was here, not Cure then. Lots of traffic and full parking lots. All seats are good! sound was good. Seats are ok for stadium. Lots of food vendors no long lines. Use metal detector security, but not bothersome."
 ]
},{
 "name": "The Trenton City Museum at Ellarslie",
 "address": "Ellarslie Mansion in Cadwalader Park Entrance is on Parkside Avenue, follow signs",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/5a/da/49/the-trenton-city-museum.jpg",
 "tags": [
  "art",
  "historic",
  "historic"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d7701010-Reviews-The_Trenton_City_Museum_at_Ellarslie-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Former city zoo transformed into a beautiful museum featuring periodic exhibits as well as an extensive Trenton pottery collection on view.  Always amazes me",
  "This is a real hidden gem, with a collection of pottery made in Trenton by famous  historic potteries, such as Boehm. They also have changing exhibits of contemporary art. The hours are limited, so check their website before you go. The museum building is a beautiful Italianate mansion, another great reason to visit.",
  "This place is a definite treasure. Totally worth the visit, no matter when you go. Always something different. It's absolutely beautiful, and we especially love all of the Trenton memorabilia.",
  "This small gem is located in a former villa built in 1848. It is located in the center of Cadwalader Park, the largest park in Trenton and one designed by Frederick Law Olmstead (who also designed Central Park in NYC). The museum has an excellent collection of ceramics created by Trenton's noted pottery industry, as well as artwork from the region's most accomplished artists. The museum also has a wonderful store.",
  "This is an amazing small museum in the capitol city of New Jersey, seated on beautiful Cadwalader Park (designed by Frederick Olmstead.  Yes, same designer of Central Park).  Nice collection of paintings and frequent exhibits of known regional artists.  Nice collection of paintings by local artist Tom Malloy, better known for his water paintings of Trenton's historic sites. Great collection of pottery from local artists and manufacturers.  A good place to visit."
 ]
},{
 "name": "World War II Memorial",
 "address": "125 W State St",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0a/5d/fc/7a/view-from-the-top-of.jpg",
 "tags": [
  "walk",
  "walk",
  "structure",
  "walking",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d9859014-Reviews-World_War_II_Memorial-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Probably the best attraction in DC. You cannot afford to miss seeing it. Can easily spend an hour or two. Must visit spot.",
  "Directly accross the street from the New Jersey State House,  the memorial is beautiful, informative and respectful to those who served our nation in WWII.",
  "Memorial has a nice historical timeline display and in need of some repairs. Located across from the State Building. Walk around at your own pace and plenty of seating to rest.",
  "This war memorial is simply well done. Quite lovely.  Lady victory at the center of the domed archway is glorious and the soldier with the other state of rifle and helmet is really glorious.  If in doubt he area, take 15 minutes to walk around and read some scripture.  High praise.",
  "This Memorial was built in 2008, and is located at the Veteran’s Park -- right across from the Trenton State Capitol Building. Many rallies are held here. \n\nIt is a nicely done Memorial. Since everybody knows somebody who is a Veteran of this War, it evokes a lot of feelings and emotions while standing there admiring everything all around, and reading all the plaques, letters, tributes and its history on the massive curved walls on two sides. Right in the center is a 6-pillared domed structure with a 12-foot bronze Statue of Lady Victory standing on a circular cement pedestal. She is holding a sword in one hand and a Wreath of Peace in the other hand.\n\nBehind Lady Victory, there is an open space where there is a large and prominent helmeted statue of the “Lone Soldier” who is completely dressed, prepared and ready for battle, with a huge rifle in his hand. Further back, a few steps away, there is that famous symbol of the “Fallen Soldier” – a helmet balancing on an upright rifle.\n\nThis is a truly beautiful Memorial. A lot of thought has obviously been put in creating it, and we are so glad we stumbled upon it as we were walking back to our car after visiting the State Capital. Absolutely worth a visit. Keep at least 45 minutes if you want to read everything that is displayed there."
 ]
},{
 "name": "Cadwalader Park",
 "address": "",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0b/c6/3a/0d/cadwalader-park.jpg",
 "tags": [
  "free",
  "walking",
  "history",
  "walk",
  "walking",
  "parks",
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d126671-Reviews-Cadwalader_Park-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "This park is within walking distance of my house and it makes me and my dog happy. The only thing I wish they would do is open up the tennis courts so the public could play on them. \nEasy walking paths and occasionally there is free yoga in the park!",
  "Decided to check out this park that apparently has a great deal of history in it.  Took a walk on a chilly day and was so sad to see the run down condition of the park.  We won't we going back soon.  Just a shame to see history falling apart.",
  "Caldwater park trenton nj is still a Very Beautiful and peaceful  park. No I would not go walking in that park or any other at night . It does not need to be so called reclaimed, it already is claimed.",
  "Great place. As too the person that said not save a t night needs to know with the exception of museum events the park closes at dusk like most parks are. I walk my dog there most days. There is also outside yoga fee to all once a month.",
  "As a life long resident, it pains me to go to Cadwalader park! \nThe new playground is the one and only reason I visit but as stated; I'm waiting for the other shoe to drop. \nMy future visits will include bringing a large trash bag to pick up trash. I can't understand how adults don't have the good sense pick up after themselves. What kind of example is that for our children.  \nThe signage explaining the history of the area is being destroyed.\nBroken picnic tables lay on the ground, small dead trees and fallen limbs are piled up waiting to be picked: just poor conditions overall.\nThis may be the only year we visit as our seven year old daughter is getting older and we hope we can find other things for her to do for fun!\nSad that the captial still misses the mark on something as simple as park manintance.\n"
 ]
},{
 "name": "Artworks Trenton",
 "address": "19 Everett Aly",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/06/0a/de/a8/getlstd-property-photo.jpg",
 "tags": [
  "art",
  "art",
  "music",
  "food",
  "art",
  "art"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d6776454-Reviews-Artworks_Trenton-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "art works trenton is my favorite place to view great art pieces. u never know what u will see. it is super cool relaxing place. the staff is friendly and helpful. thank u art works staff. sue ",
  "Although the Art fest. seem to been packed with over a thousands of people ,it was ok for a few hours . Beautiful art gallery to see , live music to hear and good food to taste. I wound recommend to see this during the day .",
  "Everyone should should plan a visit to see this awesome collection of art. I was only disappointed in myself for not having more than two hours to spend here. There is so much to see! The next time I’m in Trenton, I’ll come back for an encore!",
  "Artworks has a large convenient parking lot. There is a ramp for easy access. The gallery area is well lit. There are many rooms for additional artwork to be displayed ,as well as ,studio space and classes.",
  "We visited here after touring the state Capitol. Interesting art in a converted warehouse/factory. They seem to be at the leading edge of a potential revival of Trenton.  People were very friendly. Looking forward to their Art all Day and Art all Night shows. Website doesn't seem to indicate upcoming events too well. "
 ]
},{
 "name": "Pennsylvania Bridge",
 "address": "",
 "avg_visitor_review": "4.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/15/57/b0/30/as-seen-from-rte-29.jpg",
 "tags": [
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d126670-Reviews-Pennsylvania_Bridge-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "This is a very historical bridge. I just saw it a couple of days ago when I went to Trenton, NJ.\nI went to Arm & Hammer Park to pick up my tickets for the Trenton Thunder.",
  "As told in song and story, the \"Trenton Makes- The World Takes\" illuminated letters recall the areas strong manufacturing history. Although many are gone, great stuff still comes out of Trenton! Pork Roll, for one!",
  "On every Amtrak or Septa Regional ride back north I try to sit on the left side of the train so I can see the iconic sign all lit up at night.  Doesn't describe Trenton anymore?  Maybe not, but it once did, and that is good enough.  And the bridge itself - which Wikipedia calls the Lower Trenton Bridge - is attractive in its own way as well.",
  "Even if you don't cross the river on it, it's especially beautiful illuminated. The Amtrak bridge in close proximity is also an older gem.",
  "Traveling in the Trenton NJ area or to it, this bridge offers quick on and off exits to Morrisville, Langhorne, and adjoining Pa towns as well as going into Trenton by car. Lawrenceville, Ewing, Hamilton areas. Also part of the e-z pass system .  Good view of the Delaware River and the  Trenton Makes World Takes Bridge"
 ]
},{
 "name": "Trenton Battle Monument",
 "address": "",
 "avg_visitor_review": "3.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0f/15/5b/68/general-view.jpg",
 "tags": [
  "walk",
  "history"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d123113-Reviews-Trenton_Battle_Monument-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Park and take a short walk to this impressive monument.  Don't miss the Trenton Barracks and William Trent house not far away.",
  "It's one of few monuments which can be found in Trenton downtown .. It adds character to the city, especially from a historical point of view.",
  "Just GPS it, and you are there - not hard to find. You can actually park very close to it, get out of the car and take your picture. Use discretion, it is a bit sketchy, but all you really need is to be there for a few seconds, you don't linger.",
  "For such an important event, there's little in New Jersey that honors the battle.  The barracks are your best site to visit.  This Battle Monument is useful in that it will show you where the battle happened.  All that is here is the column you see in the photo.  Im glad I came, but my expectations were properly calibrated.\n\nFor a much better honoring of the famous battle, head across the river to Pennsylvania's Washington's Crossing Park.",
  "Extremely difficult to find. We had two different reference points that did not do it - I finally found it several blocks away by sight. Even though it is on the site of where Washington's artillery sat, it is in a dingy neighborhood and visually has no connection to the Delaware River or the barracks that are downtown. That said, I was still happy that we found it. It is a physical reminder of a great event in American history."
 ]
},{
 "name": "Trenton Free Public Library",
 "address": "120 Academy St",
 "avg_visitor_review": "4.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/ca/1c/cb/from-1903.jpg",
 "tags": [
  "free",
  "library",
  "family",
  "history",
  "structure",
  "unique",
  "library",
  "free"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d8009398-Reviews-Trenton_Free_Public_Library-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Beautiful facility, however rude and ignorant staff. Two ladies on two separate occasions, were rude and disrespectful to their customers. I watched one lady ignorantly refuse a young boy internet access 25 minutes before closing time. I also watched another staff who was giving computer assistance, rudely speak to a young female. The young lady offered assistance as she knew how to fix the issue, the front desk woman replied with “ya well that’s not how you do it. I can do it myself” ... if staff were more pleasant and welcoming then maybe people would enjoy going there.",
  "The Trenton Free Public Library was built in 1902, but its roots go back to books the citizens of Trenton asked Benjamin Franklin to buy for their community library.\n\nIt's a friendly public place, with a willingness to service anyone who enters. My own destination is the local history collection, the Trentoniana Room, the repository of all sorts of treasures. Wondering what your grandparents' Trenton home looked like? There's a complete set of 1930 curbside Tax Office pictures of every structure. Want to understand where family members lived years ago? You can consult the collection of City Directories, beginning with the first,  1854. When you realize your immigrant ancestors moved a lot, you can read in a local history scrapbook about April 1st having been the year-end date for every rental and lease in town. Check out the 1905 Atlas to understand how your neighborhood grew. \n\n",
  "This is a unique spot in downtown Trenton. As the website will tell you, it is the second oldest free library in the US, after Ben Franklin's in Philadelphia. It is a gracious old building, well-maintained, with a very peaceful vibe. It appears to be a tremendous resource for the community.",
  "This is an old building with interesting architecture.  It is a nice quiet place to spend a few hours learning.  Lunch on the steps is neat too.",
  "I happened to attend a meeting that was held here in early July. I fell in love with the facility and the people who work there and the patrons! I have been back to volunteer to read for their summer program or help in anyway I can. "
 ]
},{
 "name": "Patriots Theater at the War Memorial",
 "address": "1 Memorial Drive",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d13447129-Reviews-Patriots_Theater_at_the_War_Memorial-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Have been here a few times for different events. Tall marble hallways, gorgeous hall with seats that look like they are 100 years old.\nA step back in time.",
  "Huge, marble place.  Seating from orchestra pit to balconies.  All sound good.  The Trenton orchestra, in several variations has played here for ages.  A great place for the occasional opera, too.  Even the restrooms are old style, brass and marble.  A wonderful place."
 ]
},{
 "name": "Mill Hill Playhouse",
 "address": "209 Parkway Ave",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/0d/c3/fd/3b/mill-hill-playhouse-205.jpg",
 "tags": [
  "theatre",
  "theatre",
  "walk",
  "unique",
  "independent"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d123114-Reviews-Mill_Hill_Playhouse-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "Passage Theatre Company produces shows that are socially relevant and artistically terrific. This is a very small theater (seats 105 people) which provides an engaging experience. The shows are all thought provoking, and take on topics that you won't find elsewhere. (Racism; growing old; autistic children) But they are also entertaining and very creatively done. It is theater that you will enjoy when you're there; but also enjoy discussing when you leave. You can find the current schedule for what is playing by looking up the Passage Theatre.",
  "The Mill Hill Playhouse is owned by the City of Trenton, but Passage Theatre Company, a professional, equity theater in Trenton since 1985, effectively manages and books the space.  If one of Passage's productions is on, run don't walk to the box office.  It's really one the best small theaters in the state, and the quality of productions is extremely high.  DanceSpora is the resident dance company that partners with Passage, and their productions are also fabulous.  The Trenton Film Society also uses the space to screen movies.",
  "what a beautiful area, the playhouse is very cute and comfy. it was clean and I am glad that they help the ARC of Trenton, NJ to  put on shows yearly.",
  "Unique space tucked into a little corner of Trenton.  Wonderfully diverse performances not available anywhere else.  Great value...membership is a must.  Parking is complicated but worth the complication.  I love the Oscar nominated documentary shorts and the original plays.   Check it out!",
  "Went there twice once 3 months ago for a dance recital very good nice Sunday afternoon girls were very good. Also went 3 weeks ago for Trenton film festival saw a nice independent film from India.Nice small but nice old church."
 ]
},{
 "name": "Sun National Bank Center",
 "address": "81 Hamilton Ave",
 "avg_visitor_review": "3.5",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [
  "music",
  "family"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d12311612-Reviews-Sun_National_Bank_Center-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "This arena has a lot of potential, but it usually sits empty. The events they do get there aren’t worth the visit. On a very rare occasion they do land a quality event, but most of the time the arena, now called Cure Insurance Arena, sits empty. ",
  "The name of this 10,000-seat arena is now the \"CURE Insurance Arena\". This facility hosts many different kinds of shows, including music performances (such as Justin Moore), Disney on Ice types of shows and a new arena football team (Jersey Flight). We've also been there for college and high school graduation ceremonies, which are handled very professionally.",
  "The center is nice, but the acoustics very lousy, I like the family shows, but the concerts could be better, no big variety this year for me to go back.",
  "Sun Bank Center might be the largest locale in this part of Jersey to be able to attract name acts.  We recently saw a name act that saved us a trip to Atlantic City and about twice the ticket price.  The down sides of this convenience, though, were a distinct, unpleasant smell inside from the concessions, outside-performance areas that appeared somewhat shabby, and difficulty getting out the parking areas when the show was over.  (We'll take the RiverLine next time.  The stop for the RiverLine is across the street from the SunBank Center.)"
 ]
},{
 "name": "Trinity Episcopal Church",
 "address": "810 W State St",
 "avg_visitor_review": "5.0",
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d10835390-Reviews-Trinity_Episcopal_Church-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "If you have an opportunity to visit Trinity Cathedral, take it. You will not believe this was built in the mid 1930s. the Cathedral’s design resembles something from the mid 1800s. The layout is very Europium. The design of stain glass windows also match an older time."
 ]
},{
 "name": "Trenton Visitors Center",
 "address": "Barracks and Lafayette Streets",
 "avg_visitor_review": "2.5",
 "avg_time_spent": null,
 "photo_location": "https://media-cdn.tripadvisor.com/media/photo-s/07/b6/f9/19/trenton-visitors-center.jpg",
 "tags": [
  "food"
 ],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d123117-Reviews-Trenton_Visitors_Center-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": [
  "We having been visiting historical sites in NJ and had a day to spend in Trenton. On Monday morning we arrived at 10:30am at the visitors center, scheduled to open at 10AM. It was closed. After visiting the Barracks across the street (excellent!) for about 1-1/2 hours, we noticed that the visitors center had opened but we were no longer interested. This is a government-run operation to promote tourism and the can't even get to work in the morning.",
  "I traveled to Trenton, New Jersey once with my aunt, her husband and daughter and a cousin and another cousin. I was expecting my second child and it was a hot summer and boy was i pigged out. Well, we stopped at almost every eatery in the city limits once we arrived. But, of course, my aunt suffered from diabeties and we lost her going on four years or more since then. I still remember all the food people brought in, it was a relative of her husbands and the funeral and wake was interesting. We sat up kind of late, except for me, because baby and me needed sleep and I end up going next door to rest, but everyone and everything was cool. I enjoyed the sites and the city lights and noises of the city, seeing since I am from Atlanta, Ga and raised there for fifteen and a half years. I will always remember such good fun had with my aunt Corrine Saddler."
 ]
},{
 "name": "Brinson Memorial Church",
 "address": "200-204 Brinson Memorial Drive",
 "avg_visitor_review": null,
 "avg_time_spent": null,
 "photo_location": "https://static.tacdn.com/img2/brand_refresh/application_icons/post-image-550x370.png",
 "tags": [],
 "link": "https://www.tripadvisor.com/Attraction_Review-g46874-d19657027-Reviews-Brinson_Memorial_Church-Trenton_New_Jersey.html",
 "source": "TripAdvisor",
 "reviews": []
}]
