[
{
 "name": "Belleview Park",
 "address": "5001 S Inca Dr",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/rPfrF8YG6WmLwIm07XzzVg/o.jpg",
 "tags": [
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Another favorite park! Tennis courts... Basketball courts... Lots of grassy areas/trees. Big Plus are the Playgrounds! If you have kiddos that are climbers,...",
  "There should be more reviews for this park. All 5s. The only drawbacks are that it shares parking with the water park next door, and it's on Belleview - a...",
  "This review is short and sweet! What more can you say about a park then...relaxing and fun! Mom and Dad relaxing while the kids play in the..."
 ]
},{
 "name": "Punch Bowl Social Stapleton",
 "address": "3120 N Uinta St",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/WIi4REyRJ9YtShb4WlSsSQ/o.jpg",
 "tags": [
  "delicious",
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I feel lame leaving a 5 star review for a 3-1/2 star place. I need to be bolder and stop liking everything. \n\nI actually don't see why the hate. Like what...",
  "Been back only a few times since my initial (5 star) review. The food is delicious, but the only thing  that might kill this place is the service. \n\n1) The...",
  "This is the second time this same server has been rude and disrespectful to me during my time here. I Received the worst/rudest service I have ever..."
 ]
},{
 "name": "Bad Axe Throwing",
 "address": "7338 Washington St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/wTc6yCxhrHpms3lJsdoJwg/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Went to Bad Axe last night for the first time and it was awesome. There were seven of us for a guys night out and Jason took great care of us from start to...",
  "So, unfortunately, Bad Axe has left a bad taste in my mouth, and to be honest, I've never thrown axes there.  Why review a place in which you've never...",
  "Just had a company chtistmas party here and was looking forward to it, but was really let down. The building was a little small for the amount of people..."
 ]
},{
 "name": "Banjo Billy's Bus Tours",
 "address": "14TH And California St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/hqfuOT6KAyHwfOGMbzjpZQ/o.jpg",
 "tags": [
  "history",
  "tour",
  "tour",
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I've done two banjo billy bus tours - the ghost tour and the Denver history tour. Both were an absolute blast and so well done. The guide we had yesterday...",
  "I loved this tour, would have given 5 stars if the bus had real windows that could be lowered for picture taking. \nThe guide was entertaining and made...",
  "I had a lot of reservations before getting on the bus. Was it going to be long enough? Would it be too short? Was the tour guide going to be annoying? \n\nBut..."
 ]
},{
 "name": "Historic Downtown Golden",
 "address": "Washington Ave & 12th St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/L3kxHS_hv5b_4r7YNVA2WQ/o.jpg",
 "tags": [
  "historic"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This town is quite cute. Unfortunately, it was raining when we visited so we couldn't fully experience the place. From what we saw it was awesome with many...",
  "No trip to Colorado is complete without visiting Golden.  The historic downtown area has a wide variety of shops, restaurants and places to enjoy a cold...",
  "An awesome little downtown for an afternoon stroll with all the obligatory tourist shops; candy stores, tee-shirt shops, restaurants, bars.... Something for..."
 ]
},{
 "name": "Great Divide Brewing Company",
 "address": "2201 Arapahoe St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/KAccMuhlXGS1PqkdUNpGJA/o.jpg",
 "tags": [
  "brewery",
  "sampling"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Great downtown brewery. Stopped in for a couple drinks while i was down in Denver for a conference. If you are an IPA drinker, I highly recommend their...",
  "Came here after the baseball game and the only downside was that they closed at 10 pm, which didn't give us a lot of time to really take our time sampling...",
  "Been to Great Divide a few times and have never really tried anything since they didn't tend to have sours. It was my lucky day because they had 2 to choose..."
 ]
},{
 "name": "Four Mile Historic Park",
 "address": "715 S Forest St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/LoibhwtfYNlOoBJf-QwZVw/o.jpg",
 "tags": [
  "food",
  "free",
  "historic"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This review was for their pumpkin festival.  Free admission but have to pay for food, rides and activities.  We parked for free at a parking garage down the...",
  "We went on a weekday in late August. Literally everything was closed, and there were signs everywhere not to touch ANYTHING. Why not just close? It's pretty...",
  "Summer Concerts at Four Mile Historic Park are marvelous. I saw \"Take Down the Door\", an Irish group and had a wonderful time: outdoor picnic dinner, grassy..."
 ]
},{
 "name": "The DIA Giant Blue Bronco",
 "address": "8500 Pena Blvd",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/lAqlEzTBryfyNKuv6-t3ug/o.jpg",
 "tags": [
  "art",
  "art"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I love the fact that Blucifer greets all you new arrivals to Denver with a scowl and laser eyes. You have to love a work of art that killed its creator.",
  "This statue is a really cool sight while driving to/from the airport! Especially when it is lit up at night. \n\nOur Uber driver told us the \"legend\" of the...",
  "Denver is a very artist friendly city. No matter what part of the city you are in there will likely be some form of art. Be it a painting, a mural, a..."
 ]
},{
 "name": "Fiske Planetarium",
 "address": "2414 Regent Dr",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/pCO7N18v-5pnO7CVMqK1Nw/o.jpg",
 "tags": [
  "cheap"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This place is really awesome. I went to see the android jones exhibit here and it was so cool!\n\nI would come Back and recommend this place to a friend :)",
  "Soooo cool! The EDM events are awesome. I wish they were just a little earlier but a good event for cheap and something different. Definitely check it out...",
  "Came here for a David Bowie Light show on a Friday night. I read reviews about how it looks like a 90s screensaver, and yes sometimes it really did remind..."
 ]
},{
 "name": "Mt. Sanitas Trail",
 "address": "4TH St And Mapleton Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/cVoo72zOYObIk0pykoyYdg/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Have hiked this a few times.  It's a nice amount of exercise.  Took me about an hour to get from the bottom of the trail at about 5500 feet of elevation to...",
  "This is one of my fav hikes with my GSP, and I was surprised to see some people complaining about off leash dogs.  Boulder has online maps showing where...",
  "The climb up the trail is beautiful right now!  Everything is green and the wildflowers are blooming.  It took about an hour to the top with a\nfew photo..."
 ]
},{
 "name": "The Clue Room",
 "address": "7286 S Yosemite St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/NuXWCQvaLngI3bCGzee7pA/o.jpg",
 "tags": [
  "family"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "My family and I had a blast here! We had researched several options in the area and this was by far the best price and best experience! We called ahead of...",
  "I had a blast! I had never tried a clue or escape room, but it's all about keeping an open and curious mind and encouraging your team. \n\nThe event took an...",
  "Decided to come here when looking for an activity to do together as a group on a gloomy day. We were able to book in advance a few hours before our time..."
 ]
},{
 "name": "Puzzah!",
 "address": "1440 Blake St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/Z1uNPcOpa1QlYdT2-nfwfw/o.jpg",
 "tags": [
  "unique"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Very unique escape room!   We have played hundreds and have never played any like THE MASK.  I would recommend it for players who want to try all...",
  "I went to this escape room based on the good reviews online; however, I was wildly unimpressed. My boyfriend and I did the M.A.S.K. room - based on both...",
  "Puzzah is a Bonafide room escape in downtown Denver! This is a review for Kazam!\n\nThe location is easy to find and has a large waiting lobby. We had to..."
 ]
},{
 "name": "Bookbar",
 "address": "4280 Tennyson St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/ryTsYNUU8NaHViXSd3h8zQ/o.jpg",
 "tags": [
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Superb bookstore that serves food and beverages. There are times book clubs meet and the seating areas are reserved. We went midday on a Sunday and were...",
  "I was sold from the table of contents alone. Is it a book store? Is it a bar? The little gem off Tennyson somehow finds a melancholy balance of both,...",
  "Anytime I hear books and coffee I'm automatically in. My daughter and I got a chance to finally check this place out and we loved it! She loved the variety..."
 ]
},{
 "name": "16th Street Mall",
 "address": "1515 Arapahoe St",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/RZbZpK_RyzeoTcSuA6voNg/o.jpg",
 "tags": [
  "art",
  "walk",
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This is a great strip of museums, art work, shops and restaurants. Buses navigate up and down the strip, so that if you do not want to walk, you can catch...",
  "Liked this area of Denver, happened to be staying here for a couple of days. Pedestrian friendly and lots of restaurant choices. Parking appears to be a...",
  "Fun restaurants, museums, cafes, coffee shops, and more.  Worth the walk down the mile and so many options for how you want to spend your time in Denver!  I..."
 ]
},{
 "name": "The Infinite Monkey Theorem",
 "address": "3200 Larimer St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/k79Vw2I80_t4hBy_xBhDlQ/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I think I like this place. Super cute wine bar with not many choices but definitely a good selection of wines. \nIf you're a beer aficionados they have a...",
  "Writing this from the great quarantine of 2020, so this time it was just a pick up to-go order, but that doesn't change the fact that TIMT has a good...",
  "the wine is amazing, not a lot of options but thats because everything they serve is made there!\n\nthe vibe is amazing. we went during winter and the inside..."
 ]
},{
 "name": "Film on the Rocks",
 "address": "18300 W Alameda Pkwy",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/ot07ezqpuSxWsxxCKbKU8w/o.jpg",
 "tags": [
  "nature",
  "music"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Film on the Rocks is def one of my FAVORITE summer happenings! A local band (sometimes even a comedy act) and a movie in the best outdoor venue for a mere...",
  "Of course growing up in the 80's and 90's - we had to go see Heathers! Film On The Rocks! Always a gamble with Mother Nature, and last this movie was no...",
  "Doors open at 630pm with music bands staring at 7pm but the movie don't start till around 9pm. Awesome event but prepare to sit on rock hard surface with no..."
 ]
},{
 "name": "Peter Pan Park",
 "address": "4800 W 92nd Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/I8zt7vhjyaWQFqFXWgcbKw/o.jpg",
 "tags": [
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This park was built in 2010 as \"Westminster Center Park\" and nicknamed \"Peter Pan Park\" by locals. The play area surprises with a London theme, complete...",
  "Great park! Clean, lots of benches and different play structures, will definitely be back!",
  "Cool park! The official name is Westminster Center Park. I love that there are no rocks, sand, wood chips, etc. for kids to toss around and mess the place..."
 ]
},{
 "name": "Nightly Spirits",
 "address": "1400 Market St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/JZGUL0_zryzSp0M0KnThuA/o.jpg",
 "tags": [
  "history",
  "tour",
  "knowledgeable"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I had the most fun and interesting experience on my first haunted pub crawl tour! Our tour guide Joaquin was incredibly knowledgeable of the history of...",
  "My wife and I enjoy traveling and participating in Ghost Tours when available. Our host was very passionate and you can tell that he absolutely loved the...",
  "I was searching for things to do while we were on our beerymoon in Denver and lo and behold, I stumbled across this gem!\n\nWe knew we were in for a treat..."
 ]
},{
 "name": "88 Drive In Theatre",
 "address": "8780 Rosemary St",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/fxF-AujsjfA8AtR-d1T1Ig/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "What a gem!! We had a great experience here. We showed up roughly 30 minutes before the first showing on a weeknight and we got a great spot and never had a...",
  "This is one of the last drive-ins in the country and I think we should totally keep it - however, there are definitely areas of improvement. \n\nPRICE\n+ It's...",
  "For the price, you really can't complain too much about this place. I've never been to a drive  and this was quite he adventure.  This reminded me of a..."
 ]
},{
 "name": "United States Mint",
 "address": "320 W Colfax Ave",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/FEDA_PAiA1ymI2uutoAeAg/o.jpg",
 "tags": [
  "learn",
  "history",
  "tour",
  "tour",
  "free"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I'm a history dork so this place was up my alley. Great to learn about America's currency, past and present. \n\nThey have weird hours and tour times....",
  "Since it was free, I can't really complain.  \n\nWe showed up at 11:15 to get tickets for the 3:30 tour, which was no problem.  It was a cloudy Tuesday in...",
  "So I read all the reviews and arrived at 6:30am. I was completely alone! So I think the lines are an issue in the summer. On 12/10 with 40 degree temps,..."
 ]
},{
 "name": "Water World",
 "address": "8801 N Pecos St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/G5NwwXgimTm0N8s4L2mj_w/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I came to Colorado for a wedding but I always make sure to make some time for a waterpark or theme park. I decided on this place because I heard so many...",
  "Your typical Water World experience happens here. Lots of rides and slides to choose from and most are worth the wait. However, take note that most lines...",
  "I took my children to Water World on September 2. \nWhile swimming in the wave pool my son and I were pulled out to far. The lifeguards  were not watching..."
 ]
},{
 "name": "Sloan's Lake Park",
 "address": "Sheridan Blvd & W 17th Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/vhp4jcZVVFTUJLSjThfABA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I agree with some of the others...do NOT, I repeat, do NOT use the restrooms.  I have never seen a women's restroom so disgusting.  No TP was the least of...",
  "Really good to walk/run around or bike or skate... whatever your mode of transportation may be at the time, yes the park is great for this reason! \n\nThe...",
  "I love Sloan's Lake Park. It's a beautiful oasis in the middle of Denver. Despite being born and raised in such a landlocked state (I didn't know what a..."
 ]
},{
 "name": "Royal Arch",
 "address": "Royal Arch Trl",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/jtKXSBce7z43CeANd-Txlw/o.jpg",
 "tags": [
  "hike",
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "what a gorgeous hike!! we truly enjoyed the view. it was a Wonderful trail! Steep and a little icy. Plenty of parking for a Saturday afternoon.  We go there...",
  "Such beautiful views and myriad paths to take! Paths are well tended and decently signed. Lots of folks out from families with kids to serious hikers....",
  "Visiting from WI, this trail was my first introduction to mountain hiking.  I googled \"best beginner hikes near Denver\" and this trail was referenced on..."
 ]
},{
 "name": "Unser Karting & Events",
 "address": "7300 Broadway",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/hdD6ick4bXc9QRRGSCPSXg/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Unser is a fun place! If you've never been, go! You need a valid driver's license and required to watch a safety video beforehand. My hubby and I went for...",
  "Been wanting to do this for the longest time! The experience was AWESOME the karts are so fast and everyone is very friendly. \n\nBasically just a heads up we...",
  "This place is very cool. I'd never been indoor racing before but I gotta say I definitely had fun. Once things go back to normal I look forward to kicking..."
 ]
},{
 "name": "Monster Mini Golf",
 "address": "8227 S Holly St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/t0ezN5PIRr9NfSUdIle9qg/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I bought a groupon to check this place out and stopped in with my 9 yr old on Sunday afternoon. The staff was super friendly. We got right in started our...",
  "It was a lot of fun for something different! We were from out of town looking for something relaxing to do",
  "We had fun at Monster Mini Golf. Speaking for a five year old, swinging a golf club and counting didn't matter. Putting the ball in the hole was a point! I..."
 ]
},{
 "name": "Puzzle Effect - Denver",
 "address": "11674 Huron St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/U9KQCU0NULhrVfcCdkHNbA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "WOW! Puzzle Effect (Formerly Denver Escape Room) is a WONDERFUL place to do escape rooms. I am a veteran. After the first time, I was hooked and couldn't...",
  "I have come back twice and have done Curse of the Emerald Seas with 4 adults and Grim Stacks with 2 adults. One GREAT thing about Puzzle Effect is that you...",
  "Came for the painting, stayed for the escape room! We came to this place because artist Kelsey Montague did a mural of a boom box here. So glad we came!..."
 ]
},{
 "name": "Cherry Creek Arts Festival",
 "address": "2 Steele St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/Se0dDhZ-LTDGfMDgS2FrjQ/o.jpg",
 "tags": [
  "art",
  "art",
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Dealing with difficulty things in life can take over in ones spiritual mind. That's why the art festival in Cherry Creek shopping center can certainly...",
  "The Cheery Creek Arts Festival is the premiere arts festival in Denver.  It takes place in early July and includes blocks and blocks of artists from...",
  "A little warm today but still a great time. Awesome art, food vendors and restaurants (slinging terrific food and beverages) and the the crowd couldn't be..."
 ]
},{
 "name": "Mile High Adventure Rentals",
 "address": "1044 S Grapevine Rd",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/B1j8J6NcuyLQjMnFCBKtxA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Absolutely loved today! We rented snowmobiles. Rented for a half day and boy was it cold! Come prepared! It was 4*. (We rode up close to steamboat springs)...",
  "These guys where awesome!! I rented a atv for our weekend trip. All their equipment was newer and you can tell they take the time to keep their ATVs safe....",
  "We had the most awesome day riding moto in the mountains thanks to these guys.  They went above and beyond to make sure we had everything we needed.  Their..."
 ]
},{
 "name": "Dangerous Theatre",
 "address": "2620 W 2nd Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/1014Hgt56m5nrp7bGLX7Fw/o.jpg",
 "tags": [
  "delicious"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This is a hidden gem! What a great venue for a small intimate crowd and such a welcoming host. She invited us in cheerfully and made a delicious breakfast....",
  "Last night we went to see \"Adulting Sucks\". I didn't really know what to expect but definitely thought it would be funny. It was not really \"funny\" though...",
  "We were welcomed and offered snacks and pot( oh you said pop) There was a good variety of choices both of cold or hot drinks and chips, crackers or cookies..."
 ]
},{
 "name": "Museum of Contemporary Art Denver",
 "address": "1485 Delgany St",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/XAsTBSMM1IU7k19k6vDI1w/o.jpg",
 "tags": [
  "unique",
  "family",
  "art"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Three floors of gallery space in a unique floor plan that allows room for wall space, open areas and interesting vistas - interior and gazing out into...",
  "I'd give this a 2.5. While there is so much potential for this museum, it was a disappointment to my family. The space is either nearly empty or far too...",
  "I'm particular about my art museums, my taste trends more contemporary but I really love sculpture. While there is little to no sculpture at the current..."
 ]
},{
 "name": "EscapeWorks Denver",
 "address": "1529 Champa St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/t3svSWFl8bzIIufTN1N3xA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Had a great time and Savannah was a great game master! Would recommend again. \n\nI am continuing to write this review because Yelp won't let me leave a short...",
  "The Outbreak and Casino Heist rooms were solid and solvable, but the staff did not monitor their games the way game masters at every other escape room we've...",
  "What a terrific time at EscapeWorks. Emilia, Taylor and the rest of the team set up a great Christmas Story Escape Room with a lot of fun puzzles to solve...."
 ]
},{
 "name": "Clear Creek Whitewater Park",
 "address": "1201 10th St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/ZHECi6-T7mycSXMi-BUIyw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I found this place my first trip to Denver. It is only a few minutes from downtown Denver and even less from west side suburbs. I can not add much to what...",
  "A beautiful section of Clear Creek runs right thru downtown Golden and is a great place for whitewater (very tame rapids) rafting or just floating on a...",
  "We went tubing in late June of 2019. Water levels and snow fall in Colorado are at a 20 year high, so we were cautious. Make sure you check the flow rates..."
 ]
},{
 "name": "Centennial Center Park",
 "address": "13050 E Peakview Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/URldB0yOClLRphF5FIz-HA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Centennial did a great job with this park. There's plenty of space here with a giant playground and even a splash pad going in the summer. My favorite part...",
  "This is the flagship playground for the South metro area and boasts the largest sprayground in town, a huge climbing net, a stage for events, and a young...",
  "This place probably has the best splash area around. Gets busy quickly. The playground is enormous. Great place for parties. They have events here all..."
 ]
},{
 "name": "Canvas and Cocktails",
 "address": "6862 S University Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/y0YBDscXrbuNCgQ9X2RkIA/o.jpg",
 "tags": [
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "SO. MUCH. FUN! \n\nI came here because of mine asked me to join her and her mom. I'm so thankful I did! I loved the entire atmosphere, and vibes of this...",
  "A great time was had by all. No alcohol needed but it doesn't hurt either.\n\nYou can paint whatever you like. Of course, there's the guided tour of the...",
  "Had a fantastic time on 1st date here. I had no idea what to expect. \n\nI think this is a good date idea. Great area for dinner, shopping, and painting; all..."
 ]
},{
 "name": "Boulder Farmers' Market",
 "address": "1900 13th St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/SXLjZlTHuZpYkh4SAI9z2w/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I love the farmer's market! I often don't go as much as I would like to, but I never regret it when I do. They have an amazing selection of organic and non...",
  "SO GLAD WE WERE ABLE TO STOP BY. We decided to visit on our way up to longmont and im so glad we did! Although we got there a little later (~6:30pm), there...",
  "Full of organic produce and small batch hand crafted sauces, moles oils.  I've been to farmers markets all over the country and this one has the most..."
 ]
},{
 "name": "Class Axe Throwing",
 "address": "3400 E 52nd Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/8oh30goqn8qHr88M40PMIg/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We went here for a team-building activity on a Tuesday afternoon. For the first 2 hours, we had the whole place to ourself which was awesome. I could see...",
  "Updating my review because the morning after I visited, my coach trash-talked me on social media. Completely unprofessional and uncool. I traded my...",
  "Came here from a groupon (as of posting right now they still have it on groupons website so make sure to scoop it up!) and we didn't know what we were..."
 ]
},{
 "name": "The Colorado Sightseer",
 "address": "600 South Holly St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/JUH4Bj1H_D7EhCB0IOAbIw/o.jpg",
 "tags": [
  "tour",
  "tour",
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "My husband and I just got back from the incredible mountain tour with Will. He was so funny and personable! This was an amazing experience and one that I...",
  "My boyfriend and I decided to go on the Red Rocks, Evergreen, and Echo Lake Tour, and we had an amazing experience. Although this was not our first choice...",
  "We had a great time with our tour guide, Scott, during our tour. He was very informative throughout the entire ride and was a great host, offering water and..."
 ]
},{
 "name": "Urban Air Adventure Park - Littleton",
 "address": "8196 Bowles Ave",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/DS8sNBU-h0vr0rLZaWpcfw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "So my friend and I both came here to check it out after we had finished up with our errands and it was overall a decent place. We are both adults and it...",
  "So it's new and relatively clean. Rainy day so I brought my younger one after work. It's nice to see the old Walmart grocery being used so there's that. And...",
  "USAA got my money back and they have blocked Urban Air from charging my account. Urban Air has made 4 attempts to charge my card again. They can keep trying..."
 ]
},{
 "name": "Mile High Flea Market",
 "address": "7007 E 88th Ave",
 "avg_visitor_review": 2.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/ffyvaAFpW_QvuDMSjiL5pw/o.jpg",
 "tags": [
  "drink",
  "kids",
  "eat"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Great place to bring the kids. Sit inside the Chicken coop, eat chicken wings and drink beer while your kids ride rides, shop, and buy fresh farm produce...",
  "Came to the flea market to check it out. It's a fun experience to come with friends and enjoy eats (buttered/Mexican corn, turkey leg, funnel cake, and the...",
  "Trash trash don't come here don't waste your time, gas and money the worst \"flea market\" I've ever been. \n\nEste lugar es simplemente basura, no gastes tu..."
 ]
},{
 "name": "Uncorked Kitchen & Wine Bar",
 "address": "8171 S Chester St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/FNkK5SN79SO76ERP-4MCzQ/o.jpg",
 "tags": [
  "knowledgeable"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I've been to two classes now - knife skills with Chef Logan and vegetarian winter classics with Chef Ian. Both classes were wonderful. The knife skills...",
  "Beyond 10 stars for this shockingly amazing first find thanks to our realtor. Great wine and knowledgeable non-pretensions servers. Beautiful upscale...",
  "This has been on my list to take a cooking class (which I love to do), but just never got there.  However, for my birthday my hubby treated me to a wine..."
 ]
},{
 "name": "Lower Maxwell Falls Trail Head",
 "address": "S Brook Forest Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/DtXdHHW9HTlnw3LDvA_rlQ/o.jpg",
 "tags": [
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I'm going to let you in\nIn on a little secret\nGo further\nTo the upper lot\nA little hard to find\nSearch the web for it\nSmall parking lot\nBut the walk to th3...",
  "Come early to beat the foot traffic! We came here on Mother's Day, arrived around 9.30am and got a parking spot in the little overflow parking just up from...",
  "Don't follow the address that's attached to this it will led you to a residential are. Look up on google \"Lower Maxwell Falls Trail\" or \"Upper Maxwell Falls..."
 ]
},{
 "name": "Adventure Golf and Raceway",
 "address": "9650 Sheridan Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/qr2XGKJh4-K-W1HqPn8lhQ/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We came here on a whim ... we passed this place once and were in the mood to go mini golf so decided to give this place a go.\n\nThis place has a really cool...",
  "Me, my girlfriend and another couple had an awesome time here for a date! We ended up getting the unlimited band which gave us full access to everything in...",
  "We went on opening weekend March 7-8, 2020 and the place was terrible. Nothing was set-up or ready to go. Out of the three admission windows available only..."
 ]
},{
 "name": "Cherry Creek Trail",
 "address": "2200 15th St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/J22OdciS-Vj1RH9WK93ydg/o.jpg",
 "tags": [
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Terrific trail in the heart of downtown Denver. The trail is clean and safe, with separate sides for bikes & runners vs pedestrians only. There are lots of...",
  "Fun trail to walk around, I love taking the doggos here. They always have a blast with other dogs and the water. I wish denver would send some police to get...",
  "This bike trail was so busy and full of homeless like others have wrote about . . It's a flat trail that you can go for a long time but it's dangerous with..."
 ]
},{
 "name": "Bear Mountain Stables",
 "address": "11778 Wonder Dr",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/3Etkjvui4EGok6WRzV9dtw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We did a 1h ride with our 9yo daughter. This was an awesome stable and experience. They made sure we got a quick orientation and safety overview which I...",
  "Awesome stable and ride. Marie and Uta were caring, responsive and patient. The beautiful horses were gentle and well cared for.  The trail was more...",
  "I treated myself for a horseback ride for my birthday in May and had such a fantastic time. The owner was extremely kind and made me feel extremely..."
 ]
},{
 "name": "Cheesman Park",
 "address": "Franklin St & 8th St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/9h9x40ac_evk1fv-BzbOHQ/o.jpg",
 "tags": [
  "walking"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Look no further for an urban park in Denver. Surrounds with trees, buildings, downtown and mountain views. The park is centrally located is the...",
  "Cheesman is my favorite Denver park. I'm prejudiced--if I go down the staircase behind my townhouse and open the gate, I'm standing in the park and just...",
  "Cheesman Park is so convenient to where I like to stay when I am visiting Denver. The park has lots of energy with people walking, twirling fire batons,..."
 ]
},{
 "name": "Delicious Denver Food Tours",
 "address": "2129 Larimer St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/v6jk_Dyf1B4KKq0WSXThGw/o.jpg",
 "tags": [
  "tour",
  "food",
  "food",
  "foodie",
  "tour",
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We did the Food Tour with Jill this past weekend and had some great food!  Jill was super friendly, threw in interesting facts about the city, and showed us...",
  "We opted for Cocktails & Tastes expecting great drinks with a few nibbles on the side. Surprise! The food turned out to be as outstanding as the...",
  "Great afternoon on a Denver Food Tour with our guide, Bonnie!  We enjoyed 6 foodie locations in the LoDo area of downtown Denver and this proved to be a fun..."
 ]
},{
 "name": "Maize in the City",
 "address": "10451 McKay Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/pEedXEGMVTDAMYgtgYVrmg/o.jpg",
 "tags": [
  "free",
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This is a really great event - First of all, you can come check it out for free.  By free, I mean that you can get in to check everything out at no cost....",
  "Great for little kids and wide selection of pumpkins.  Several bounce houses and a fun play area.",
  "We didn't actually try the maize here. I know! But we had a great time. All of the employees were friendly, and this is a good choice for families with..."
 ]
},{
 "name": "SeaQuest Littleton",
 "address": "8501 W Bowles Ave",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/E7Ifp8w6XI9LlkZThGlfkQ/o.jpg",
 "tags": [
  "kids",
  "free"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Wow! This place is surprisingly awesome!!!\n\nIt looks like a small, fun, quirky kids' aquarium. It's so much more! We got free admission with the GetOut pass...",
  "This was fabulous, we 5 all enjoyed seeing the sting ray best and getting to touch them. I suggest one enter on the right where it is Not dark and gradually...",
  "In a mall, miles from our house. This place was so fun and I had a blast!  \n\nI got to go with a girlfriend and her two little ones, it was very clean and..."
 ]
},{
 "name": "Family Shooting Center at Cherry Creek State Park",
 "address": "4201 S Parker Rd",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/vgtWLtTNPObc7KtlSibXgA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Honestly, I've been to a pretty wide variety of public shooting ranges before and they've been anywhere from well run and safe to downright scary. This one...",
  "They do not provide a good training environment. You are unable to stand and shoot a rifle or shoot from the prone position.  They get upset you \"fire too...",
  "I absolutely love this shooting center for multiple reasons. 1. If you are a novice they will take the time to teach you correct posture- grip-aim-load &..."
 ]
},{
 "name": "Golden Puzzle Room",
 "address": "860 Tabor St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/EGH4dw2KNXHBlVpWePcczA/o.jpg",
 "tags": [
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "The husband and I went on our own to try out the Zephyr. This is my 5th escape room experience and ranked among one of my favorites. \n\nPros: This is one of...",
  "My son requested a puzzle room birthday party for his 9th b-day and we held it at Golden Puzzle Room in Lakewood.  It was a great experience and the...",
  "A great experience! We were in town from Salt Lake and needed something to do in our down time. Myself and 4 kids (43, 12, 12, 12, 15) booked online and..."
 ]
}]
