[
{
 "name": "The Children's Museum of Houston",
 "address": "1500 Binz St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/N0hE5dCuOMvsWhRMeU6pvQ/o.jpg",
 "tags": [
  "kids"
 ],
 "source": "Yelp",
 "reviews": [
  "My kids love, love, love it here!  There are so many different areas for them to discover.. it's bigger than you think!  I love that there are areas for all...",
  "My favorite place to take my son! We will be Children's Museum regulars for years to come. The upstairs is for toddlers and infants. They have a section for...",
  "I CAN'T WAIT TO GO BACK!\n\nThis museum is absolutely wonderful. I brought my 1 year old twins here and they had a blast! They enjoyed ever single thing this..."
 ]
},{
 "name": "Sam Houston Boat Tour",
 "address": "7300 Clinton Dr",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/gPh9BRMIibx3P4UkUILMpw/o.jpg",
 "tags": [
  "free",
  "history"
 ],
 "source": "Yelp",
 "reviews": [
  "Came to Austin to visit our daughter and son-in-law and decided that Houston was going to be the place to visit on this trip.  Saw they had the free boat...",
  "The ship channel boat tour is a must see for those who appreciate the history of the city of Houston and relative importance of the ship channel. \nThe tour...",
  "I would like to kinda quote Rachael ,\" i didn't know there were docks\" in Houston. \nIt was a pleasant surprise when a friends suggested we go for a boat..."
 ]
},{
 "name": "Axelrad",
 "address": "1517 Alabama St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/H8otupB1JhXKypZPAiOT1g/o.jpg",
 "tags": [
  "food"
 ],
 "source": "Yelp",
 "reviews": [
  "Pros: wonderful atmosphere, full bar, plenty of space to sit, board games, food trucks, good music, good vibes. Absolutely loved this stop!!!! \n\nCons: Small...",
  "Such a fun place to come to! Probably one of the top 3 places in Houston for day drinking. Also have a lot of activities at night. Love the concept of...",
  "Alcohol and hammocks? Yes, please! \n\nWanna bring your dog? Go ahead! \n\nI love this place! \n\nWent to Axelrad last night and even though it was like 50..."
 ]
},{
 "name": "The Orange Show",
 "address": "2401 Munger St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/z8-M2aaQaCqhQx_p3FFFPQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Hands down the best thing in Houston. It is an absolute must see. I AM NOT JOKING AND I AM YELLING! \nSeriously. Go here and be glad that a retired postal...",
  "The Orange Show was created by Jeff McKissack, a US Postman who decided to create this attraction, based on his favorite fruit (the orange). Mr. McKissack...",
  "When I lived in Houston, I tried several times to tour the Orange Show, and it never quite worked out! (I was definitely frustrated more than once by it not..."
 ]
},{
 "name": "Texas Air Adventures",
 "address": "",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/3zFXjHUorn_XNfLuu_GiaA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Well, what can I say. I am a lucky, LUCKY woman! My fiance James surprised me this spring with one of the best birthday gift anyone could ever ask for - a..."
 ]
},{
 "name": "Terry Hershey Park",
 "address": "15200 Memorial Dr",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/zatl8ZuDiRM9GIZlTGV74w/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Never had been here before, we were just passing through Houston and decided to pull over once we saw how pretty and big it was. \nVery well maintained with...",
  "What a beautiful park! Great fro biking or jogging!",
  "What's not to like. It's perfect for running, walking, biking, and families. I like and prefer cemented paths which you'll find here.\n\nIt's clean. Very..."
 ]
},{
 "name": "Botanica Ey Templo Ele Hijo De Chango",
 "address": "219 Holtman St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Highly talented curandero (medicine man) and like most who claim to be the best of the best, Señor Roberto does NOT do it for the money or to scam people...."
 ]
},{
 "name": "The Music Box Theater",
 "address": "2623 Colquitt",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/aUpa8GjPZRxCWP1zecU7oQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Tonight's Show was \"Broadway At The Box 2020\".  ANother hit show as always.  Tonight, Cay was not there (she used the excuse that she was going to her...",
  "Overall I had a good time. I attending on the opening for the Broadway series. We sat near the stage and it was pretty good. The artist did a great job with...",
  "The Music Box Theater is one of the best things going on in Houston.  I moved to Houston a year ago and have not missed any of the shows they put on.  They..."
 ]
},{
 "name": "The Boardwalk",
 "address": "9945 Barker Cypress Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/4ulYXC1tJR0TWp2n7G6DCQ/o.jpg",
 "tags": [
  "family",
  "kids",
  "run",
  "drink"
 ],
 "source": "Yelp",
 "reviews": [
  "The Boardwalk is very nice. You can sit and watch the water and sometimes boats passing by. It has several restaurants that over look the water as well. The...",
  "Fantastic place for the family!!! Love the open area for the kids to run and play!! Dozens of place to eat or drink! By far the best place in the area to...",
  "The Boardwalk is a beautiful place on the lake. It would seem like the perfect place to enjoy a cup of coffee and read or just park and relax. The only..."
 ]
},{
 "name": "Bayou Bend Collection and Gardens",
 "address": "1 Westcott St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/G0DSeEp2e3agZbDUMwu5Nw/o.jpg",
 "tags": [
  "walk",
  "free"
 ],
 "source": "Yelp",
 "reviews": [
  "Beautiful hidden spot and the grounds are kept exceptionally clean. However my only\nIssue is while we were taking a picture of the bridge, not on the bridge...",
  "Exploring Houston and my friend found this place. We decided to check it out. Wanted to do a little walking/hiking. There's not a lot to walk here but the...",
  "What an incredible generous place to offer the August Afternoon Craft & Educational {free} event!!! Highly recommend parents and adults to take advantage of..."
 ]
},{
 "name": "The Escape Game Houston",
 "address": "794 Sorella Ct",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/E-iFsYWoO4kJDYBGPNt6oA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I've done ~10 escape rooms in the last few years and this place is certainly towards the top of the list considering the quality of the room builds and the...",
  "This place is hands down the best escape room I have been too and I have been to a lot of different locations in Texas. First off it is very organized and...",
  "My first time doing escape room and man was it fun. I had no idea it was gonna be this exciting and intriguing to do, we had Paul help do the introduction..."
 ]
},{
 "name": "Social Beer Garden HTX",
 "address": "3101 San Jacinto St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/FsQUGBh8XN5XAM3ELs9vNg/o.jpg",
 "tags": [
  "adventurous",
  "food"
 ],
 "source": "Yelp",
 "reviews": [
  "Enough space for dogs to roam and mingle, everyone was having a great time. The selection of beer is astonishing, try new things here and be adventurous!",
  "This place is an awesome place to hang out with friends. They have darts, pool, ping pong, connect four, and hammocks. If you get hungry they have food...",
  "My husband and I love trying new breweries and beer gardens throughout the city.  It's always fun to try new brews that we haven't seen before and explore..."
 ]
},{
 "name": "Downtown Houston",
 "address": "",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/uP0YZ3VHxOz03UHhk_ymbg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Currently underwater, and what nobody wants you to know is that they just flooded a bunch of actual residential areas in order to save downtown from what...",
  "Pros:\n- Plenty of places to eat at\n- Free events to attend \n- Festivals happening throughout the year\n- Picture worthy places all around\n- Stellar night...",
  "First impression when I came here. Wow the building are so big and wow even the signs are huge. And wow why am I so small.  Yes that's what ran through my..."
 ]
},{
 "name": "The Secret Group",
 "address": "2101 Polk St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/iEfSnzHGPQpnfjnRt1q1cQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I. Had. A. Great. Time! \n\nWe went to the comedy show first called \"too soon\" and the comedians joked about current events, politics and pop culture. It was...",
  "Put aside a lot of the negative reviews you've seen about this place, I've been going there for years and the only time I've had a bad time is when I...",
  "Last time I was at The Secret Group I had a BLAST! It was 90's night and the music was off the chain...the DJ actually played my request! I will definitely..."
 ]
},{
 "name": "McGovern Centennial Gardens",
 "address": "1700 Hermann Dr",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/tiToMINtgdWt6I8xEpDxOA/o.jpg",
 "tags": [
  "walk",
  "peaceful"
 ],
 "source": "Yelp",
 "reviews": [
  "I often visited a Japanese garden in  Hermann Park.Regarding McGovern Gardens, I was not interested in it. I just wanted to check bluebonnets flowers in...",
  "Gorgeous day to walk across the street for a top view! It's a nice green walk ... photography permitted. \n\nBeautiful, peaceful.... what else can you expect...",
  "Be a tourist in your own town , bring out of town guest for a cute photo-op , or have a wedding !\n\nBeautifully manicured lawn, wide variety of flowers,..."
 ]
},{
 "name": "Pirates Bay Water Park",
 "address": "5300 E Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/mDUrK75_Z407-XrGrOyw_Q/o.jpg",
 "tags": [
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "My family and I visited Pirates Bay Water Park for the first time last night for the Special Pirate Celebration event. Firstly, any business that supports...",
  "This was a spur of the moment trip to a water park close by to us from our residence. It was a fun location with quite a bit of things to do for a decent...",
  "Very disappointed we traveled 2 hrs just to find out they are closed during the week. when I called and looked on the website says it's open. First time..."
 ]
},{
 "name": "Houston Panic Room",
 "address": "1718 N Fry Rd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/y1R2FDj4uzSV0JEhXAKdyA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "This location was the first time I've ever tried an escape room and it did not disappoint! I've come back 3 times since. The level of difficulty (8/10) is...",
  "Came here with a group of friends for my husband's birthday. We did the zombie apocalypse room. It was definitely challenging. Thanks for the game master...",
  "Sorry Gabi, took me awhile to get to this one but you deserve the review. So some context to who Gabi is, she is the superstar host which made our..."
 ]
},{
 "name": "Battlefield Houston",
 "address": "11755 W Little York Rd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/cPOYJ3P-1mIzT2AFoTQcGw/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Organized a event for my VPs Sales team. Wanted something competitive but different than the same places people go.  I have never done laser tag so I did...",
  "This is my first time doing laser tag and I am in love.\n\nTips for all:\n\n1. do not be late for the training! If your appointment is at 7:30p, you need to...",
  "We had a birthday party here. All the girls loved it. It was busy on Saturday afternoon, but that added to the Battlefield fun. They play different games..."
 ]
},{
 "name": "Top Gun",
 "address": "5901 Beverly Hill",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/63nOFVNGdRVPJWcA_zodQg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Tonight's beginners class was great with Troy H.\nThank you again for being so patient, kind and helpful. \nThe class was great. I have been around fire arms...",
  "Gotta say top gun is one of the better indoor ranges I've had the pleasure of honing my targeting skills. They offer a great meeting area up front for...",
  "Excellent indoor range in the Houston area. They offer great instructional courses for everyone and offer a large selection of rentals. The space includes..."
 ]
},{
 "name": "Avant Garden BAR",
 "address": "411 Westheimer Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/aYEHHqT6DGIuo3PGczJewg/o.jpg",
 "tags": [
  "historic"
 ],
 "source": "Yelp",
 "reviews": [
  "I love coming here on any night of the week. All the bartenders are amazing, especially Kent. This place just has the most chill vibe. You can find all...",
  "Local collective of artists, musicians, poets, writers, dancers. \nBeautiful location in a historic home from 1890\nRustic garden, and stage. Stone fountain...",
  "I really enjoyed the atmosphere, very laid back and relaxing. Love all the plants. The staff were all so nice."
 ]
},{
 "name": "National Museum of Funeral History",
 "address": "415 Barren Springs Dr",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/p6ul6vmyfYS2Iyu1J3MMgw/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "The National Museum of Funeral History has America's largest collection of historical funeral service items that includes coffins, funeral buggies, funeral...",
  "Interesting but some displays like the very large one on the pope and celebrity deaths seemed like a stretch and just something to fill the space of this...",
  "Very nicely done with plenty of displays and informative signs.  It is well worth a visit (located off I45 near IAH Bush Airport)."
 ]
},{
 "name": "Urban Air Adventure Park - Pearland",
 "address": "3207 S Sam Houston E",
 "avg_visitor_review": 2.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/XIRA8q9cO7UzB1_1UigqCA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "We celebrated our son's B-Day here. He and his friends were so happy and playing all the time. We booked for two hours and had a person help us with the...",
  "I will never, ever come back here again. If only my brother had yelped this place and read the reviews before we brought my nephews and their friends...ugh....",
  "Decided to try this location off the beltway and Scott St during the week (less crowded) with my nephew which is 4 yrs old. Impressed by the customer..."
 ]
},{
 "name": "Truck Yard - Houston",
 "address": "2118 Lamar St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/LnuZb96ixrgqCTyoomgOjg/o.jpg",
 "tags": [
  "drink"
 ],
 "source": "Yelp",
 "reviews": [
  "Good fun bar with heaps to look at. \nGreat vibes. Awesome music. Dog friendly!\nWould give 6 stars if I could!",
  "Truck Yard is a fun spot to sit outside and drink with friends! A handful of tables are made out of old truck beds, which is cool. It's located in a...",
  "just so you know: tickets to ride the Ferris wheel must be purchased at any bar but they're $10 and it comes with a raspberry long Island iced tea, which..."
 ]
},{
 "name": "Atv 4x4 Adventure Rentals",
 "address": "11065 Aldine Westfield Rd",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/YEFDOHQyL9-KPoAT2amSKg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Rented 2 ATVs this weekend. Great units. Well taken care of. Clean and ran great. Easy pick up and return. I rented a trailer as well. Thanks for a great..."
 ]
},{
 "name": "East End Park",
 "address": "Kingwood Dr E",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/4x9OocRPzVofflDBSioKXQ/o.jpg",
 "tags": [
  "walk"
 ],
 "source": "Yelp",
 "reviews": [
  "This park is very hidden and we ended up getting lost one day and found it.  Decided to take a walk and ended up spending 2 hours walking through this...",
  "Great park in the livable forest, you can access via the green belt. \n\nAny vehicle without a \"K\" sticker will be towed. No ifs, no buts about it. \n\nPlease...",
  "YOU MUST HAVE A \"K\" STICKER TO COME HERE, otherwise you will be towed. This is for Kingwood residents only. That being said this is such a beautiful park...."
 ]
},{
 "name": "Houston Axe Throwing",
 "address": "6734 Larkwood Dr",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/DN926NXRcLaOmETX6DsS_Q/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Daniel was really excited for our group visit.  I had far more fun axe throwing than I ever thought I would.  Alcohol prices are reasonable but I wish it...",
  "So this wasn't my first choice when I Google searched Axe Throwing as it was not closest to my home, but luckily the other place did not have a convenient...",
  "First time doing this yesterday and I absolutely LOVED it!\n\nGot here a little late cause of traffic and realized they really so start by the reservation..."
 ]
},{
 "name": "Contemporary Arts Museum Houston",
 "address": "5216 Montrose Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/Rr0qO2bfrvlM0WmlSoSkRw/o.jpg",
 "tags": [
  "free",
  "unique",
  "free"
 ],
 "source": "Yelp",
 "reviews": [
  "This is a must see if you are visiting Houston or live in Houston. Currently the installation on the bottom floor is pretty cool. Won't spoil it for you but...",
  "It's free and it's something to do when you're in the Museum District.  The artwork varies from odd to unique to 'WTF is this'.  Plus there's a gift shop on...",
  "The space is really tiny and the exhibits didn't overwhelm.  But, In spite of this, it's worth a visit...any hey, it's free!"
 ]
},{
 "name": "Escape Zone Houston",
 "address": "6400 Southwest Fwy",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/WFptUPdnw1x3Buv_bHbwZA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "This is super fun activity. They have four different rooms and i did the Dali art adventure with my 70 year old mom, sister, and 9 year old niece. We had an...",
  "Pass on this Yelpers! Don't pre pay!\n\nWarning... This may be funny to some and irritating to others. My co workers and I decided on a whim to go to this...",
  "We did the Crazy artist escape room. The idea was really cool and interesting but was poorly executed. It was also falsely advertised the pictures on their..."
 ]
},{
 "name": "Crazy Cat Escape Room",
 "address": "3231 Houston Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/GCCEnXxvhJlX_stfa-FNzg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "This place was very fun. I love that they give you clues. This is the first  escape room I actually solved with plenty of time to spare. No it was not easy...",
  "Moral of the story is we didn't Escape! If you are looking for bonding time, if you want to work on your communication and cognitive skills.  This is a...",
  "We brought our 10 year old son here for his first escape room as their easy level allows 10+ children. He's been wanting to do this for a couple years now..."
 ]
},{
 "name": "Studio Movie Grill",
 "address": "822 Town & Country Blvd",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/J6d1C0Wg8YgA50YRvU5ADA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I quite enjoy SMG! They set themselves apart from every other movie theater. The recliner chairs are really comfortable and I love that you have space to...",
  "I've only been SMG on Tuesday's for their $5 special. It's been a while since I've been to the theater but I usually alternate between here and Cinemark...",
  "Seats nice and that's about it. \n\nBathrooms DISGUSTING and lacking TP and working paper towel dispensers. When manager was requested, there was no sense of..."
 ]
},{
 "name": "Haute Wheels Food Truck Festival",
 "address": "5601 W Loop S Fwy",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/8hB6UzfdiSU8iPAoaXblaQ/o.jpg",
 "tags": [
  "food"
 ],
 "source": "Yelp",
 "reviews": [
  "Food trucks festival? Hellz yeah. My hubby; however, wasn't down with paying the $16 (plus processing!) per person to get in. Thank you to Farrah, our...",
  "Thank you for my tickets my dear CM Farrah!!!\n\nThis was my first time at this festival and so many great food trucks were there it was a little pricey if I...",
  "I came in 2016 on a very windy day and was able to sample a few of the trucks.  At the gate, they give you 5 tickets, which are good for drinks.  Also, some..."
 ]
},{
 "name": "Flip N' Fun Center",
 "address": "5379 W Richey Rd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/jwHU3NtlaVwSGdJ2-Dwp6g/o.jpg",
 "tags": [
  "walk"
 ],
 "source": "Yelp",
 "reviews": [
  "My twins had their birthday party here and everything went great. When we went to book we were taken on a tour of the place and explained our options...",
  "Fun place! We experienced the following:\n\nCleanliness all around\n\nBumper cars - small but fun\n\nNinja court - monkey bars and area where you walk through...",
  "This place is pretty awesome. Better than I thought it was gonna be when I drove by. My son had a blast. We will definitely be back"
 ]
},{
 "name": "Holocaust Museum Houston",
 "address": "5401 Caroline St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/wIlRl1LuB2AMR-udbluMxA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I may be slightly biased as I am a narrator in one of the exhibits, but the museum has never left me dry eyed. \n\nI've gone at least five times bringing...",
  "This was a great museum with some information things. They are just reopening so it was a little upsetting because a lot of things are not complete yet but...",
  "Truly beautiful, haunting museum. This museum has tributes to all survivors of the Holocaust and specifically features stories of Houston survivors which is..."
 ]
},{
 "name": "Houston Terror Dome Haunted House",
 "address": "16030 East Fwy",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/5s_zh2i8q8RkwB1aGMB2-Q/o.jpg",
 "tags": [
  "interactive"
 ],
 "source": "Yelp",
 "reviews": [
  "I've been going to Haunted houses for 30+ years.   This was by far the best one.   The actors were very engaging and interactive both inside and out.  Loved...",
  "They opened at 7pm but were not ready to begin letting people in so a guy ( maybe the owner) gave us tickets to the zombie brain toss game. I figured a...",
  "WORST HAUNTED HOUSE EXPERIENCE EVER!!!\nI went to this haunted house on opening night with my boyfriend due to the good ratings online. We purchased our..."
 ]
},{
 "name": "Cullen Sculpture Garden",
 "address": "Montrose Blvd At Bissonnet St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/aTlgs6cS8f4R5WZ0Z08FCg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "No trip to the museum district is complete without a stroll through the Cullen sculpture garden. When I was an art student in high school, we would come...",
  "What I like about the Cullen Sculpture Garden is the large collection of seemingly asymmetrical artists/sculptors'. \n\nWork from poets, architects and...",
  "A small sculpture space but yet good to visit while in in the area."
 ]
},{
 "name": "ExitusVR",
 "address": "5629 Southwest Fwy",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/tqacXcgGoQJAJFl2dTVv0g/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "When we first got to this place we were a little surprised, it is a lot smaller that pictured.\nThis place is awesome we did two escape rooms in one day...",
  "Ms. Dora is an excellent guide. I love how she was very helpful and informative with our game. We tried escaping the prison game and it was super fun! I...",
  "Had a great time. The Horror Game was super fun but I will worn you, it can cause motion sickness. I got sick instantly while others in my group got sick at..."
 ]
},{
 "name": "Smash Therapy",
 "address": "17425 Stuebner Airline Rd",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/dCj7rp_MlDrXKSYuCMCsfw/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "I attended a team building event for work at Smash Therapy and it was amazing! An hour was more than enough time. We were able to break bottles, furniture,...",
  "An amazing experience! Jennifer was there to meet us and had the room set up and ready to go. The Bluetooth speaker made it easy to play our own playlist....",
  "Came here with my OEF/OIF Vet group and had a very stress relieving time.  This is place is awesome and will be back to break more shit."
 ]
},{
 "name": "Pedal Party",
 "address": "2000 Edwards St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/UE1k50DmlGZ0_HZHZHwrRg/o.jpg",
 "tags": [
  "run",
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "Pedal Party is a ton of fun and well run business. Stephanie was our driver and from our initial conversation two days out I knew we were in good hands. We...",
  "I had the opportunity to try the Pedal Party over the weekend with some family and friends. We had an absolute blast. I would say that 90% of making this an...",
  "Had an absolutely wonderful time on Pedal Party!  We did the Midtown route and, I have to say, the group we were with had a great time.  Our host was great...."
 ]
},{
 "name": "Puppies For Breakfast",
 "address": "302 Milam St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/U8k6NFuCG4aC0sQm7P47ww/o.jpg",
 "tags": [
  "family",
  "kids"
 ],
 "source": "Yelp",
 "reviews": [
  "Went to this event in 2019 with my pup and had a great time meeting other pups, people, and dog vendors! Highly recommend checking it out!",
  "I love going to this event it's family oriented. Hector is a great host, love the idea that it helps dogs in need. My kids love helping out every year.",
  "So much fun!! Blue got his tail painted blue!! Great vendors, and lots of water fountains for our dog! #htx"
 ]
},{
 "name": "Ratchet Hatchet Houston",
 "address": "524 Waugh Dr",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/ANiU3Pdtv9H6P9SBO_qBdg/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "I celebrated my birthday at The Ratchet Hatchet this year with a group of 20 people and everyone had a blast. It's located on the 2nd floor and is...",
  "Had a great time here. At first when I read the sessions were 90 minutes I  was thinking who would do that for an entire 90 minutes but it goes by super...",
  "This was a frustratingly fun experience for me.\n\nFrustrating because trying to throw that hatchet and getting it to stick on the target was a lot more..."
 ]
},{
 "name": "T&T Fish and Reef",
 "address": "9470 Hwy 6 S",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/abLJ8_m7KbSwuEKPfhXoOg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I wish I could give them more than 5 stars. I found this store mostly by accident and I NEVER want to buy from a big chain store ever again! Prices are...",
  "T&T is truly the best place to purchase fish around. When they receive their fish, they quarantine them and treat them before selling them to the buyer....",
  "Charged us 20 bucks for a dragon stone that was less than a pound. Just thought \"Wow, I guess it's just one of those expensive rocks\" Went to Fishland a few..."
 ]
},{
 "name": "Burke Baker Planetarium",
 "address": "1 Hermann Circle Dr",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/kX4DrHeqqYkZCaP-jyIc6w/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "This will forever be a special place to me. We went to see Passport to the Universe, narrated by Tom Hanks. It was beautiful and humbling. At the end, the...",
  "Buying tickets, access and parking were easy. Once we got inside the Planetarium it was about 90 degrees in the room and just got more hot as the show went...",
  "Well when we went to the museum we went to the Planetarium first and saw three movies in a row. They were all fantastic, all world-class, and our little..."
 ]
},{
 "name": "Texas Axe Throwing",
 "address": "23300 North Fwy",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/gQT6rsoCjkc_eE8nXPFsIg/o.jpg",
 "tags": [
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "We came here for the first time ever and it was 110% the right decision. Our axe master was Spencer and the man is a really showman. I highly recommend you...",
  "So much fun! The staff is amazing. We've had both Christian and Codyx and they were great! Will continue to go back.",
  "I've been to throw axes twice and both experiences were fantastic. I checked it out with my family and we had a blast. Our axe master was both informational..."
 ]
},{
 "name": "JINYA Ramen Bar",
 "address": "3201 Louisiana St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/E8HeS5NhHLzioGYC-7i1kQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Jinya Buns omg my taste buds exploded! I'm officially addicted to them. We ordered take out from here and it was not bad. I got crispy chicken which was Eh....",
  "I always love coming to JINYA, it has a great atmosphere, great ramen, perfect vegan options and most authentic taste. \nBoth pictures are vegan foods. The...",
  "Ordered from jinya last night and was pretty disappointed with the quality. I got the spicy chicken ramen and added corn with bok choy. My boyfriend ordered..."
 ]
},{
 "name": "Mad Hatter Tea Party Sculpture-Evelyn's Park",
 "address": "4400 Bellaire Blvd",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/664TTuVkp88l8nXUP_aawQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Ever wish you could join Alice and the Mad Hatter for a spot of tea? At Evelyn Park, located in the southeast corner of the park that is close to the...",
  "So my Sunday ended by going to this park called Evelyn's Park. I was told about the Alice in Wonderland sculptures they have. To my surprise they were what...",
  "Stoped by in the rain and heavy mist if anything made Alice better. Will get back soon on a sunny afternoon."
 ]
},{
 "name": "Escape Again Rooms",
 "address": "3564 Highway 6",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/zMobzAF-LC1HUOgv0YTkNQ/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "Our group had a great experience! It was the perfect mix of challenging and fun. Can't wait to go back to try another room.",
  "SO. MUCH. FUN!!!\nWent here with my husband, daughter, her boyfriend, and her best friend. Three of us were first-time players.  We booked the room as...",
  "Came here with my daughter. It was just us two in the room and we had a good time trying to unlock everything. We were given an hour to solve the room and..."
 ]
},{
 "name": "Texas Rock Gym",
 "address": "1526 Campbell Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/NYWKRCOK6wFmR2qJQrWzDQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Even during an outbreak, these people are doing their best to provide great customer service. I had a class scheduled and paid for and was worried about...",
  "Let's get climbing... The Texas Rock Gym is Rockin... Literally!!!  \n\nThis is the second time I attended this Gym.  Each time you attend, you get a quick...",
  "I hate the fact that I had nails on when I went back to this place. To all of my ladies out there who have long nails I would recommend to be careful and..."
 ]
},{
 "name": "Potters' Place",
 "address": "741 Dulles Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/tkYSahe0DdLgWWmBRXjTGg/o.jpg",
 "tags": [
  "family",
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "I love this place. I've been going here for over two years now. I have always loved pottery, and decided to try making   my own instead of buying someone...",
  "My family did a private party for 7 people here in December.  I really enjoyed the class!  Most of us were first-timers.  The instructor got a station set...",
  "What a great place! While my family was in town for the holidays, I scheduled a \"one time wheel\" group class for us. Jessica was so helpful when any of us..."
 ]
},{
 "name": "Urban Air Adventure Park - Houston",
 "address": "20502 Hempstead Rd",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/yxhClS-FklnrPbf1Wr-iZA/o.jpg",
 "tags": [
  "kids",
  "kids"
 ],
 "source": "Yelp",
 "reviews": [
  "Great location for a birthday! The manager and staff were very accommodating and the kids ended up having a lot of fun. Host for the party was also great!",
  "I went to this place with my grand daughter  at first there wasn't much guide or directions as to what you need aside from the girls behind the counter that...",
  "I come here often because the kids love it and it's close to home. \n\nHalf the time I come here the concession stand isn't open at all and the other half the..."
 ]
},{
 "name": "Citycentre",
 "address": "800 Town and Country Blvd",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/rcw9m7ID-9QkhJ1N6Ulbmg/o.jpg",
 "tags": [
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "One of our favorite places to go.  It's upscale and pleasant.  They have fun family events as well.  It's just a nice day out but be prepared you will have...",
  "fuuuuuuuuuuuuuuuccccccckkkkkkk the parking structure here. it's been awhile since I've been inside the parking but when the holy fuck did they start...",
  "I have been going to Citycentre since it opened and it has evolved over time into a very popular outdoor mall. There are lots of great restaurants and shops..."
 ]
}]
