[
{
 "name": "Arcadia Earth",
 "address": "718 Broadway",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/1GifGCHAz2ny88gP0HeQOA/o.jpg",
 "tags": [
  "unique"
 ],
 "source": "Yelp",
 "reviews": [
  "This place is definitely amazing. Definitely informative and beautiful. I love the message that this exhibit was trying to relay. We need to do something to...",
  "Arcadia earth is a unique environmentally friendly museum. The message was clear and the different rooms showcased that message. I liked all the plastic...",
  "This exhibition has various rooms that are interpretations of the natural environments of the earth and the impact of humans upon those environments. The..."
 ]
},{
 "name": "Fat Cat Music",
 "address": "75 Christopher St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/UUvXLKxNgJMAqMTBYz1W_w/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Like this place !\nThey have live music everyday , they have ping pong tables, pool tables, board games..\nNo wonder they always have long line every weekend!",
  "WTF HAPPENED TO YOU, FAT CAT?!\n\nI used to come here years ago when I was in college and hadn't been there for a while and I was shocked to see what a dump...",
  "If a friend comes to town and want a different place to go to I always take them to Fat Cat at least just to feel the ambiance. A small door that leads to a..."
 ]
},{
 "name": "Times Square",
 "address": "1 Times Sq",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/vPojez-jU7GbbFTUoNBu1Q/o.jpg",
 "tags": [
  "walk"
 ],
 "source": "Yelp",
 "reviews": [
  "One of the many beacons of New York City; Times Square!\n\nI walked over to Times Square from Penn Station which was about a 20 minute walk. Along the walk,...",
  "An exciting place and a must for any tourist wanting to see what the fuss of NYC is all about. There are a TON of people just standing and looking up at the...",
  "My third visit to nyc\nLove it every day \nAll the billboards ppl\nStores and guys whit castumes to take a licture whit them dont forget tip them\nSome stores..."
 ]
},{
 "name": "Enigma Escape Games",
 "address": "134-26 Northern Blvd",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/ltMgblpRWSmO-h-QoMNChA/o.jpg",
 "tags": [
  "creative"
 ],
 "source": "Yelp",
 "reviews": [
  "This place was really hard to find. But, be ready to have some fun! The mechanics was well designed and some of them was really cool and creative. Recommend...",
  "ESCAPETHEROOMers visited Enigma Escape Games back in March 2019.  The area is surrounded by restaurants, Karaoke bars, shopping, etc.  They currently have 4...",
  "What an awesome escape room right in Flushing. My friends and I have been wanting to do an escape room for some time and when we found out there was one..."
 ]
},{
 "name": "National September 11 Memorial Museum",
 "address": "180 Greenwich St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/yoe6Wha7gQlTBNIeFO0UhQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I will be completely honest, I don't tend to be much of a museum person. However, this was well off the best museums I've ever been to. There's so much to...",
  "We love you NYC and our summer trip would not be the same had we not made a stop here. It was just packed from morning to night with things to do but I had...",
  "Not sure what to say other than that the museum is extremely well done and does a great job of memorializing the somber facts of what happened that day...."
 ]
},{
 "name": "Gulliver's Gate",
 "address": "216 W 44th St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/AiPp4hgbvzvYJWVHRYW4mA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "If you like architecture, and things on a mini scale, then this is definitely a place to check out while roaming New York. You'll need to reserve a couple...",
  "Who says you can't see the world in less than a day...or even 2 hours? \nWell you can at Gulliver's Gate miniature world! Great to see all the details they...",
  "I went here with my dad today.  It was pretty neat to see it all. Having built models myself, my hats off to the various teams who built the modules.  Even..."
 ]
},{
 "name": "Prospect Park",
 "address": "95 Prospect Park W",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/C89YnkBA6a5zVyl8QaKI1g/o.jpg",
 "tags": [
  "kids",
  "run"
 ],
 "source": "Yelp",
 "reviews": [
  "This is one of the biggest parks in the borough of Brooklyn. There the Flatbush Avenue- prospect park  side ( Prospect park Zoo, across the street from...",
  "Since almost all public places are closed these days to prevent the spread of corona virus and just sitting at home doing nothing is unbearable, I went for...",
  "How can you not love this park? \n\nIt's huge with plenty of space for the pups and kids to run around. \n\nIn certain areas, it can be quite hilly, but this..."
 ]
},{
 "name": "Pro Line Archery Lanes",
 "address": "95-11 101st Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/NhbDBMteaz0jr77Q0WzDQA/o.jpg",
 "tags": [
  "cheap"
 ],
 "source": "Yelp",
 "reviews": [
  "We have been to a few archery ranges in Queens, but this range is by far, the best one! We will only be coming to Proline. My husband was bow shopping and...",
  "Archery is a nice change of activities for the neighborhood. A few years ago I came here with a friend and coming back to show another friend it was just as...",
  "I found out about this place not so long  ago and I have been living in the neighborhood for the past 6\n5 years. I absolutely  loved it. It is really cheap..."
 ]
},{
 "name": "The Daily Show",
 "address": "733 11th Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/mcqNi3-g950LsmPGcXYeGw/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "I've always wanted to checkout this show as part of my NYC bucketlist and finally had the chance! Friend snagged some guaranteed tickets (make it through...",
  "SO. MUCH. FUN.\n\nI won two VIP tickets through a holiday party raffle at work, so if you also have a VIP ticket and are wondering what it includes, this is...",
  "5 Star New Yorker experience for locals and out of towners alike!\n\nI had nothing but a positive experience here at the Daily Show.\n\nI was here the 1st week..."
 ]
},{
 "name": "Topgolf",
 "address": "1013 US Route 1",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/fR7QKR7BxkHwmLAqTA47qA/o.jpg",
 "tags": [
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "Nice place. Food was good. I tried the sunrise burger.. bacon and over easy egg. Burger was med well as asked for. And with good flavor. Definitely would...",
  "So I've only been here once and I wasn't sure what to expect.  We pre-reserved our bay for the $50 fee, and to be honest, I think it is a little ridiculous...",
  "My family tried to book an family gathering at the Topgolf Edison a month prior but we ran into many issues with their sales team. \n1. They decided to put..."
 ]
},{
 "name": "Bohemian Hall & Beer Garden",
 "address": "2919 24th Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/U1SIPt9Ofcb-Sj00QyuUFQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Fun place! I came here on a Sunday night and there were a lot of people of all ages. A live band was playing which was amazing. Everyone looked drunk and...",
  "The pierogis were deep fried which is mad nasty.\nMe and bots were mega fuckin high and the place was understaffed and couldn't deal with our ravenous...",
  "This review is tough to write due to this place becoming trendy with non Czechs and Slovaks. I have been coming here since I was a baby. My dad is Czech so..."
 ]
},{
 "name": "Challenge Escape Rooms",
 "address": "40-18 Bell Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/8bCN-CR_ZTmmb1uydNNpsA/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "This was the second challenge room I ever experienced. I entered with two friends and another group of four amazing humans! It was helpful to have many...",
  "My friends and I attempted the Wild West Saloon room. It was definitely one of the more difficult escape rooms I have tried. I felt that some of the...",
  "I just left the carnevil escape room in Patchogue.  I had a terrible experience. The room was horrific.  I called before to ask if it was hard and they said..."
 ]
},{
 "name": "Fairytale Island",
 "address": "7110 3rd Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/Gm4BKyjfwLVB8eAUx-BJpQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Fairytale Island consistently gets a 5-star rating and it's well deserved. I booked a private birthday party for my 4-year old and Cathy the owner made sure...",
  "Just had my daughters birthday party here. What a wonderful place and most amazing management. They make it so easy for the client and really go out of...",
  "Birthday parties here are awesome\n\nJust be careful with the trampoline. That can be dangerous. \n\nLove that they check your forehead before entering, in case..."
 ]
},{
 "name": "Laser Bounce",
 "address": "80-28 Cooper Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/znf9MhQiT7ABbAaveo1BPg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Went to an 8 year gold's birthday party and I had a blast.\nThe prices for the games are reasonable.\nThe chicken tenders are good. The buffalo wings were too...",
  "It's Midwinter Recess, school is out, and as expected there was a crowd at the entrance eager to pay and play. Hubby and I looked at each other and...",
  "Who says arcades are dead? We stopped in here to kill time and let me say that this place was amazing! The prices for the games are very reasonable and all..."
 ]
},{
 "name": "Central Park Zoo",
 "address": "64TH St And Fifth Ave",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/vw15_dJS9kr5et8XSus-qQ/o.jpg",
 "tags": [
  "walk",
  "family",
  "free"
 ],
 "source": "Yelp",
 "reviews": [
  "The Central Park Zoo is very cute and you'll have a good time, but you need to know upfront it's very small. Adults can cover it in an hour; if you have...",
  "Pleasantly surprised to find a zoo in Central\nPark during our family trip.  We were staying close by in UES and it was a short walk over.  Got to see the...",
  "Me: [knowing that Central Park is free] Is the Central Park Zoo free?\nCompanion: HAHAHAHAHAHAHAHAHAHA!\nGeneral admission is currently $13.95 for adults,..."
 ]
},{
 "name": "Nitehawk Cinema",
 "address": "136 Metropolitan Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/ue85E6iae-a7o3IbE11alQ/o.jpg",
 "tags": [
  "food",
  "creative",
  "food"
 ],
 "source": "Yelp",
 "reviews": [
  "Love coming here. They usually screen all the movies you might want to see. \nThe service is great. \nMake sure to try the cocktail specials they have for the...",
  "Came here for the first time tonight and loved it. The theaters are small and intimate, and the food and drinks were amazing. The staff was very discreet...",
  "Nitehawk is one of my favorite movie theaters. They get so creative with the intros to each movie, the special movie nights they host, and the food menu is..."
 ]
},{
 "name": "Dinosaur Bar-B-Que",
 "address": "700 W 125th St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/w4NDBIZY_0l4YSptnFFNKg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "They are open, Gyna! \n\nFood: 4\nPortion to $: 3\nQuality: 4\n\nAnd it's the only real BBQ I can get delivered. -5 star. \n\nYes, it's expensive and you don't have...",
  "I have been waiting to try this place for 40 days. As a Catholic, I gave up meat completely for Lent and wanted to reward myself with a great restaurant and...",
  "Harlem Dinosaur Bar-B-Que operating on a limited menu during the pandemic and we went in Sunday, May 3rd late afternoon. We ordered our cocktail + meal..."
 ]
},{
 "name": "Russian Baths on Neck Road",
 "address": "1200 Gravesend Neck Rd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/_0dCxHIKNMcmmjlOLSWk2A/o.jpg",
 "tags": [
  "food",
  "food"
 ],
 "source": "Yelp",
 "reviews": [
  "Love this place!\nYou pay 50$ and stay as much as you like. The saunas are great! Russian style(very hot) and some easier ones(like steaming sauna). The food...",
  "The place is very dirty, the staff there is VERY, VERY rude, they will treat you with their attitude like they are doing their favor. The level of customer...",
  "This place truly has the best Russian food in Brooklyn. I can't say enough about the feeling to which this place makes you return constantly. Warm ambience..."
 ]
},{
 "name": "Gotham Archery",
 "address": "480 Baltic St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/qd8p-2qTXe6M2uOr8HDLaQ/o.jpg",
 "tags": [
  "knowledgeable",
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "The staff showing the class the ropes were enthusiastic, knowledgeable and hands on with each of us over the course of the instruction.  I started off...",
  "My company had an event here and the staff was entertaining, accommodating, and well trained. The space is huge and comfortable for events. They worked with...",
  "Amazing event with family! The instructors (Brendan, Corey...sorry if misspelled?) are awesome! They made it so much fun. They\nDid not make anyone feel..."
 ]
},{
 "name": "Museum of Illusions",
 "address": "77 Eighth Ave",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/4R0mDTiXgw29Rc9yG55uuA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I had SO MUCH FUN here! We stopped in for an impromptu visit Wednesday afternoon, there wasn't a line, we paid our $20 and entered the exhibit. It's much...",
  "Wackkkkkkkk don't waste your time. There's a line to get in because it's tiny af inside ... when getting inside more lines, some of the art didn't make...",
  "The museum was very small, there was a long line and not a lot of activities. *outside of the building looks very big but inside it is very small* there was..."
 ]
},{
 "name": "Museum Hack",
 "address": "",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/Hn4bnCDIVvTcMuYgqmgqUQ/o.jpg",
 "tags": [
  "knowledgeable",
  "knowledgeable",
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "Lia. She's hilarious, knowledgeable, a human fun-making machine, an art/history buff, a fountain of obscure factoids, a fierce feminist, PLUS she has...",
  "It was great fun running around The Met, learning about the Bad Ass Women who can be found throughout the museum. Elizabeth was a fun, knowledgeable and...",
  "Absolutely the best experience we've had! Wonderful tour and tour guides. Elizabeth & Scott had my husband and I beyond interested and I learned so many..."
 ]
},{
 "name": "Jump into the Light",
 "address": "180 Orchard St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/LDPhQwRJ3bHuWixwJpnTwA/o.jpg",
 "tags": [
  "experience",
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "Worth the money for a fun experience! $40 gets you an entire day, but you might want to reserve the upstairs area if you actually want to spend more than a...",
  "This is a fun place to spend a few hours! My brother and I came here on a Saturday afternoon and it wasn't too crowded. We purchased the all-day tickets...",
  "Great place, perfect to go with small groups. Good customer service, I'm not tech savvy, received feedback through the whole gaming experience and game..."
 ]
},{
 "name": "Creative Little Garden",
 "address": "530 E 6th St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/X1NWjwfNgJJADwQ50ozZ3g/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Wonderful little garden off 6th St. in East Village. \n\nWalking past, my aunt and I noticed the lush bushes, flowers and small benches of this garden nestled...",
  "I wish I had one of these little gardens nearby right now because today has been one big bucket of stress. But if you *do* live (or travel) near Creative...",
  "I passed by this place on my way to a subway​ station. Are you kidding me? When I was a kid growing up in Brooklyn in the 60's we called places like..."
 ]
},{
 "name": "Tarot NYC",
 "address": "",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/mFDWUcfFxmTi8mlPYPo7WQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "First off, I'll start by saying that I can see why this woman has hundreds of exceptional reviews and that I'll end up repeating what many others have said....",
  "I had my very first reading with Veronica last week, She is the real deal!  \nSuper spot on, doesn't sugar coat.  I absolutely loved and enjoyed my session...",
  "I am ashamed that it has taken me this long to write a review... swore I did, but I apparently did not. Sorry Veronica!!\n\nIf I could give Veronica 10000..."
 ]
},{
 "name": "Strawberry Fields",
 "address": "Central Park W And 72nd St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/TZ0_BLd_H-zQNnnIdmWgvA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "This is always an inspirational place within Central Park on the west side. There are always flowers l, some music and a crowd when you visit. \n\nTake your...",
  "This is the location of the famous tribute to John Lennon. You can find it by the entrance on 72nd street and Avenue of the Americas. \n\nThe memorial is...",
  "I don't have an appreciation of the Beatles, so this was just a check-box (more for for my wife). \n\nThere is a mosaic in the middle of the path in a corner..."
 ]
},{
 "name": "Snug Harbor Cultural Center & Botanical Garden",
 "address": "1000 Richmond Ter",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/aJE4uylBGfkHy81ADMWWnw/o.jpg",
 "tags": [
  "family",
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "This review is for the NYC Winter Lantern Festival at Snig Harbor cultural center.  The festival runs from November 20th 2019 to January 12th 2020.  It is...",
  "I took the family to the Winter Lantern Festival. It is promoted very well but executed poorly. The light display is wonderful. But that's it. First the...",
  "Came here for the Chinese Lantern Festival on NYE and it was such a fun experience! There's lots to see and there are shows and performances too. \n\nFor..."
 ]
},{
 "name": "Kings County Distillery",
 "address": "299 Sands St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/oiORuHnfrccgwBx7ydwAfA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I was slightly confused when I arrived to pick up my order, as the areas by the gatehouse are a part of the Wegman's parking lot.  But once I figured it out...",
  "Coffee AND Whisk(e)y?!?! Sign me up!\n\nWe went here after a friend's glowing review and recommendation. I'm a big whiskey fan and King's County did not...",
  "Some of my all-time favorite bourbon and one of my favorite spaces in Brooklyn. It's definitely worth getting flights when you go there so you can try a..."
 ]
},{
 "name": "Rockefeller Center",
 "address": "45 Rockefeller Plz",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/Ni0QU2U7iNjHyvr9GY9ceQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Rockefeller Center is a super awesome place to visit! I didn't realize how big it is, but it actually consists of 19 buildings that cover 22 acres (yes, I...",
  "Ny ny\nMust visit this place \nThe stores the  center and more we get this 3 day get away in February \nAnd enjoy nyc \nThe ice skate ring was here",
  "This is the Rockefeller Center building, NBC-4  News headquarters is based in the building. it Holds the Annual Christmas Tree Lighting. There The Fao..."
 ]
},{
 "name": "Classic Harbor Line",
 "address": "62 Chelsea Piers",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/H1BwlWWLr33RYmd0CuuTxQ/o.jpg",
 "tags": [
  "experience",
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "I have lived in NYC for 3 years...and this has become my favorite activity.  I take all of my guests on these Cruises.  Fabulous.  Best value for the dollar...",
  "This was a great experience. If anything the cruise went by too quickly. The band was fun, beer and snacks available to buy, and great picture opportunities...",
  "I just came back from a nice trip to New York and one of the highlights was definitely the Morimoto Sake and Sushi Sunset Sail experience. Tickets can be..."
 ]
},{
 "name": "The Funplex",
 "address": "182 State Rt 10",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/HFrRrnuvP2IobGNaz0powA/o.jpg",
 "tags": [
  "food"
 ],
 "source": "Yelp",
 "reviews": [
  "If you come early you will be fine.  As the day goes in the crazier and dirtier it gets.  Come early and the go karts, laser tag and rides are empty.   We...",
  "This place was awesome!\n\nIt was my nieces sixth birthday-- my aunt told me we were coming here to bowl. I didn't have the time t look on Yelp, prior to our...",
  "Definitely entertaining - they had a work deal for 3 activities, food, and a separate room for $35, which was great - the laser tag, go-karts and bowling..."
 ]
},{
 "name": "DreamCatcher",
 "address": "5105 8th Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/hJjR-cX8aMWsewhDiSGH2Q/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I thought it was a joke at first because theres never any arcades around the neighborhood. The hidden little gem is so adorable! It's kind of a tiny place...",
  "I sought this place out as a tourist and i loved it. I spent $30 and won 3 pokemon plushies- cheaper than Nintendo World for pretty solid quality! Most...",
  "This place is an utter JOKE.  If I didn't know any better, this place looks like a total front.  I had really hoped that we would've been able to play and..."
 ]
},{
 "name": "Haunted Manhattan",
 "address": "1357 Broadway",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/Q3WrMXvDJLrp5t46RH03nQ/o.jpg",
 "tags": [
  "history",
  "kids",
  "walk"
 ],
 "source": "Yelp",
 "reviews": [
  "Amazing amazing amazing, as a new yorker we tend to sometimes forget and neglect the history and beauty of our beloved city. Booking a walking tour was a...",
  "Went on a tour today, The Five Points Tour, with Wilhelmina (sp?) and she was great! My kids loved it and on top of being entertained by the stories, we saw...",
  "We enjoyed the tour very much, our tour guide Frankie is a true entertainer and a historian, it was a pleasure to walk around downtown and learning about..."
 ]
},{
 "name": "Queens County Farm Museum",
 "address": "73-50 Little Neck Pkwy",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/lX4RxUmLUGG9sP3stfBeEA/o.jpg",
 "tags": [
  "family",
  "kids",
  "free"
 ],
 "source": "Yelp",
 "reviews": [
  "Brought my family here to pick some pumpkins but ended up spending the whole day enjoying the petting area, the hayride, and everything in between! \nThis...",
  "I never knew this was so close to my house. I was happy there was a parking lot with lots of space. This is differently a place for kids and adults. \n\nThere...",
  "This is a cute little farm in the middle of Queens.  I love that it is easy to get to and free to visit. The Q46 conveniently stops right near the entrance...."
 ]
},{
 "name": "The City Reliquary",
 "address": "370 Metropolitan Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/tpdkx4ADQzXG3D_Fby7IOQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "When you consider how the City Reliquary had its start in the founder Dave Herman's nearby Williamsburg apartment as a window display of found artifacts...",
  "OK, I admit it. I don't get the appeal of this tribute to the Hoarders TV series. Oh wait, this isn't a museum about compulsive hoarding disorder? For the...",
  "I'm gonna try to be as fair as possible\n\nThis place has a LOT of stimulation- it's a cozy little shop that you can probably complete the tour in 20-30..."
 ]
},{
 "name": "The New York Aquarium",
 "address": "602 Surf Ave & W 8th St",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/z31R-9He76tRYqEeFMMIXQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Let's just say it's too small.\n\nIf you've been to the Boston Aquarium this place is 1/4 of its size maybe even smaller. They had some places closed off for...",
  "Sorry to say the Aquarium is the weak link in the WCS . To sum it up, too expensive for such a small collection. Yes it does a great job of exhibiting the...",
  "Haven't been to the aquarium since the renovations and decided to try it out. \n\nOh boy what a waste of time. We were in and out within 30 minutes, with a..."
 ]
},{
 "name": "Mission Escape Games",
 "address": "265 W37th St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/KoZAE-gps8RO_yLgHdqUGA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I have played three episodes with Mission Escapes and decided it was finally time to review.  My work group has a tradition of doing an escape room whenever...",
  "This escape room was great!! I always did escape rooms  around this area and decided to try this one for my bday weekend with fam. Our gamemaster raymi was...",
  "Game: End of Days (A) [20% Escape Rate]\n9pm on a Saturday\n$30 (not added tax as of Feb 2020 when bought online)\nGame Master: Raymi \nHost: Hector\nTime..."
 ]
},{
 "name": "Sea The City Jet Ski",
 "address": "Liberty Landing Marina",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/wawCKbceIznxxD8ppnVkMA/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "Came here in summer 2017 and it was aweeesome!!! Came here with the sweetest guy I met in New York which was great too :)))\n\nCost was pretty high, over $100...",
  "Review From A First Timer:\n\nThis was so much fun! If you are going with someone be sure to pay extra to drive your own jet ski. The couples that were riding...",
  "A lot of fun and a great experience for a special occasion! Watch out for the ferries!\n\nI didn't have any personal watercraft (aka \"jet ski\" experience) but..."
 ]
},{
 "name": "Summer Streets",
 "address": "Park Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/nXEeNuoST72p61YgNt_hOw/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "I don't know how I literally just discovered Summer Streets despite living in the area for a few years now. For the first few Saturdays in August, NYC will...",
  "One of the main streets of Manhattan in New York and the widest street with width of 141 foot. Park Avenue runs along East Manhattan from Union Square...",
  "If I had it my way Manhattan wouldn't have cars and very few trucks. Leave the supplies at the border. In the mean time I enjoy Saturdays in the month of..."
 ]
},{
 "name": "Gun For Hire",
 "address": "1267 McBride Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/QUrWPXHpf5-Lh9U88Ffg8g/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "6 stars? An A+? I don't know what accolades you can give to a place that deserves more than 5 stars. \n\nFirst, if this is your first time here, the process...",
  "We found a Groupon online and decided to stop in on a Sunday afternoon. Upon entering, expect to fill out a few forms and general administrative...",
  "Can I give this place 6 stars? This review is for our semi-private session with Tom Giordano.\n\nThere's 4 of us (2 friends have never tried shooting before)...."
 ]
},{
 "name": "Xcelerated Adventures",
 "address": "",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/A4h6aFQqssqLGRwHQjUI1w/o.jpg",
 "tags": [
  "hike",
  "knowledgeable",
  "hike"
 ],
 "source": "Yelp",
 "reviews": [
  "I went on a hike with Xcelerated. Chase our tour guide drove us from Manhattan to Sams Point in upstate New York. He took us through the lake, the...",
  "Highly recommend Xcelerated Adventures, Chase was our guide on this hike.  He was very knowledgeable of the trails, helpful to us as well as anyone around...",
  "I highly recommend this business if you are looking for a great hiking day trip. I went to Breakneck and it was a blast. Loved seeing the awesome scenery..."
 ]
},{
 "name": "Gate1",
 "address": "7200 4th Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/tvoqj3GYW9DFHHWHwQFQYA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Here, here- now here this: if 5 stars=default-I'll only recognize and settle for a 10 stars description of this tour to Morocco-land of my forefathers and...",
  "Avoid Gate1 Turkish Treasures tour unless you like days of interminable bus rides with 40 people in a bus, eating many lunches at highway rest stops and...",
  "Used gate 1 for China , very disappointed! Once the money was paid , couldn't get hold of the lady that booked me. Found out other travelers using travel..."
 ]
},{
 "name": "Flushing Meadows-Corona Park",
 "address": "11101 Corona Ave",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/hoAiN9v6iCjS3m7WNof8EQ/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Writing a review for the cherry blossoms here! I visited a month ago (pre quarantine time) and the flowers were blooming nicely! The area I went to had...",
  "Flushing Meadows Corona Park is astonishingly beautiful with cherry blossom recently in mid-March. \n\nThere are a couple of landmarks which were built during...",
  "AN ABSOLUTELY MUST DO! 5 STARS!!! ONE OF THE COOLEST PARKS YOU WILL EVER GO TO! THE ADMISSION HERE IS FREE & FREE PARKING TOO! FREE PARKING IN NEW YORK YUP..."
 ]
},{
 "name": "Brooklyn Heights Promenade",
 "address": "Columbia Heights",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/JIStSx572oPkc75syAJkdw/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "We found ourselves here totally by accident and I am SO glad we did!\n\nThe view was absolutely stellar and I loved seeing a more quaint part of the Brooklyn...",
  "Over looking the Brooklyn waterfront and facing unobstructed views of the manhattan skyline. This was the go to spot until Brooklyn bridge park opened up...",
  "I do love walking by this area in Brooklyn with its beautiful cozy shops, coffee shops, brownstones, playgrounds. It is so delightful to poke around and..."
 ]
},{
 "name": "Watson Adventures Scavenger Hunts",
 "address": "330 W 38th St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/USClEKe7igbPX_wSMS182A/o.jpg",
 "tags": [
  "run"
 ],
 "source": "Yelp",
 "reviews": [
  "We had a blast! Secrets of Wall Street was a great hunt, very different from any that we have done before. Challenging, informative, and fun. We loved the...",
  "I run a leadership conference each year and this year we decided to start with Watson's Trivia Slam.  It was a HUGE hit - our staff loved it and I've had...",
  "This was a great team building exercise with a new group of interns/apprentices. I had a great time, as did my colleagues. Bobby is the best coach i ever..."
 ]
},{
 "name": "Syndicated Bar Theater Kitchen",
 "address": "40 Bogart St",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/OgidL4OFlysf2yuTtrh0CA/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Omg what can I say this place is awesome! It's a great place to meet up have cocktails, eat and catch movie. The drinks are awesome and the atmosphere is in...",
  "Lol...this was my 3rd time coming here. First time was just for drinks, and we fell in love! Great deals, cool vibes, etc. the second time we came to see...",
  "The \"Hot Mess\" fried chicken sandwich y'all...is the stuff that dreams are made of. When you come, please order that and you will definitely be back. Also,..."
 ]
},{
 "name": "Jersey City Archery",
 "address": "7 Sherman Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/AQenZLNL3DhD7lQ_aTXr6Q/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "Had an amazing time trying Archery for the first time. Very challenging but fun activity to try. We signed up for the Archery 101 class as it was our first...",
  "This place is convenient primarily for the location. This place is also good for learning without using a sight. We normally go to an archery spot in the...",
  "Such a fun place to go to with friends! This was my first time trying archery and we had a blast! There was only one person assisting everyone and checking..."
 ]
},{
 "name": "Clue Chase",
 "address": "1114 6th Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/nMMz-4lT9u0qKU71Xb3mMw/o.jpg",
 "tags": [
  "experience"
 ],
 "source": "Yelp",
 "reviews": [
  "Hmmm...did not expect this much fun on level -1 of the WR Grace building.  This was my first escape room experience and it set the bar high for future...",
  "I have now done two of the rooms at Clue Chase--Alien Encounter and The Lost Spy--and I have to say that both were really well done. The rooms themselves...",
  "Clue Chase was amazing! I'd never done an escape room before, but from the moment we walked in we were impressed by these guys. The framing device is fun..."
 ]
},{
 "name": "Astoria Park",
 "address": "",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/OHhvX_-MUlZyX-TXEz2Rgg/o.jpg",
 "tags": [],
 "source": "Yelp",
 "reviews": [
  "What an awesome park! I haven't been here in years but spontaneously came by yesterday with a friend. We were meeting some pals who live in Astoria for...",
  "Welcome to my hometown of Astoria, NY. Situated in NYC's borough of Queens and just across the East River from Midtown Manhattan, Astoria was named after...",
  "The Astoria Park is pretty popular around here and I found that it is so for a reason. It's a great place for walking around, cycling, or even swimming for..."
 ]
},{
 "name": "Amazing Escape Room Staten Island NY",
 "address": "585 N Gannon Ave",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/OBJeJ4NjRzqPUP6Ul0YvGQ/o.jpg",
 "tags": [
  "experience",
  "family"
 ],
 "source": "Yelp",
 "reviews": [
  "Best escape room I've ever been to! Corinne is super helpful and makes sure that you get the full escape room experience. I can here with a group of eleven...",
  "Had an amazing time with friends and family. Our host was Ian and he was great and very patient with us. This is my second time coming here and I definetly...",
  "I had such an amazing time at the AMAZING escape room. Taylor was such a great help. Unfortunately, we lost cause of my boyfriend."
 ]
},{
 "name": "The Conservatory Garden",
 "address": "E 105th St And 5th Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/U4WrjFkt0abjcpQgd0MSIA/o.jpg",
 "tags": [
  "kids"
 ],
 "source": "Yelp",
 "reviews": [
  "The Conservatory Garden is accessed through the Vanderbilt Gate on Fifth Avenue south of 105th Street. It is the only formal garden in Central Park. This is...",
  "What would we do without escaping to central park. Pups running, kids playing. It's our go-to weekend location. Time to smell the flowers.",
  "Within New York City with all it's skyscrapers and the hustle and bustle you will find Central Park.  There are tons of things to do and see in Central Park..."
 ]
}]
