[
 {
  "name": "The Daily Show",
  "address": "733 11th Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_yCVhweMsjGyNGWUxTUVhIw.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "I've always wanted to checkout this show as part of my NYC bucketlist and finally had the chance! Friend snagged some guaranteed tickets (make it through...",
   "SO. MUCH. FUN.\n\nI won two VIP tickets through a holiday party raffle at work, so if you also have a VIP ticket and are wondering what it includes, this is...",
   "5 Star New Yorker experience for locals and out of towners alike!\n\nI had nothing but a positive experience here at the Daily Show.\n\nI was here the 1st week..."
  ]
 },
 {
  "name": "Bohemian Hall & Beer Garden",
  "address": "2919 24th Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_cuVyM_ZxtREqpO1SXgZmRA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Fun place! I came here on a Sunday night and there were a lot of people of all ages. A live band was playing which was amazing. Everyone looked drunk and...",
   "The pierogis were deep fried which is mad nasty.\nMe and bots were mega fuckin high and the place was understaffed and couldn't deal with our ravenous...",
   "This review is tough to write due to this place becoming trendy with non Czechs and Slovaks. I have been coming here since I was a baby. My dad is Czech so..."
  ]
 },
 {
  "name": "New York Transit Museum",
  "address": "Boerum Pl Schermerhorn St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_c8TfKT7NdTuwcBZatXHmzg.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Every New Yorker should come here at least once; you will leave with a new found appreciation and wonderment of the development of our every day...",
   "I can't believe I neglected to review my experience at the New York Transit Museum! My husband and I were there in fall of 2018 so it's been a while but I...",
   "Anyone interested in the subway system has to visit this exhibit. It has a lot of information. New York's subway is documented in this museum. Check out the..."
  ]
 },
 {
  "name": "Liberty Science Center",
  "address": "222 Jersey City Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_r5X4-movdt5wbvbF-Jz7-w.jpg",
  "tags": [
   "family",
   "kids",
   "kids",
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "I was here years ago with the younger kids in the family. This visit refreshed my memory that this is a great place to bring the kids. There are plenty of...",
   "Here is my thought on this...it's an overpriced McDonald's play place for kids...\n\nThe angry bird section is just similar to their other sections but it...",
   "What a joy to bring my kids to a place I spent my childhood in! I grew up visiting the Liberty Science Center. This place is great for all ages. What I love..."
  ]
 },
 {
  "name": "Governors Island National Monument",
  "address": "10 S St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_NU0PxRWTYoLKZRTy9JT_jg.jpg",
  "tags": [
   "free"
  ],
  "source": "Yelp",
  "reviews": [
   "Governor's Island doesn't get enough attention. It kind of gets forgotten. Just because there's so many other things in New York. Come here to have a bit...",
   "Still five stars for Governors Island. They just keep getting better each year. The have some really fun activites (some free, some with price), its always...",
   "Governors Island is a 172-acre island in the heart of New York Harbor. Yards away from lower Manhattan and Brooklyn, it's easily accessible by ferry and..."
  ]
 },
 {
  "name": "Madame Tussauds New York",
  "address": "234 W 42nd St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_pqxra7dYB3d_iZBPm1MWgg.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "I had never been to any of the locations prior to going here and it was one of the best experience I have had being in between so many celebrities \nFrom...",
   "Make sure to get a Groupon or discount coupon for up to $7 off from the normal price of about $30, when you visit this awesome wax museum. \n\nThis is very...",
   "I am glad I purchased a Groupon and received 2 for 1 admission or else I would have probably asked for a refund. It look longer to redeem our tickets and..."
  ]
 },
 {
  "name": "Beat The Bomb",
  "address": "247 Water St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_qOsRHWy2MPuyKhcDwaHBZA.jpg",
  "tags": [
   "interactive"
  ],
  "source": "Yelp",
  "reviews": [
   "Staff is very friendly and welcoming. We had a great time and all had positive things to say. Each room has its own interactive game type element, which...",
   "Had so much fun with our friends here! I've seen so many advertisements about Beat the Bomb and decided it would be an awesome date night/hang out with my...",
   "Pretty cool paint ball gun and laser Tag,event in the Fort Greene - Downtown Brooklyn area .I had a blast with me and some high school freinds . I'll..."
  ]
 },
 {
  "name": "The New York Aquarium",
  "address": "602 Surf Ave & W 8th St",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_9GQ4DvRS2p5GQzWQl-5iQA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Let's just say it's too small.\n\nIf you've been to the Boston Aquarium this place is 1/4 of its size maybe even smaller. They had some places closed off for...",
   "Sorry to say the Aquarium is the weak link in the WCS . To sum it up, too expensive for such a small collection. Yes it does a great job of exhibiting the...",
   "Haven't been to the aquarium since the renovations and decided to try it out. \n\nOh boy what a waste of time. We were in and out within 30 minutes, with a..."
  ]
 },
 {
  "name": "Rockefeller Center",
  "address": "45 Rockefeller Plz",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_ZKDByTPdHjlZg0k5_ct4xA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Rockefeller Center is a super awesome place to visit! I didn't realize how big it is, but it actually consists of 19 buildings that cover 22 acres (yes, I...",
   "Ny ny\nMust visit this place \nThe stores the  center and more we get this 3 day get away in February \nAnd enjoy nyc \nThe ice skate ring was here",
   "This is the Rockefeller Center building, NBC-4  News headquarters is based in the building. it Holds the Annual Christmas Tree Lighting. There The Fao..."
  ]
 },
 {
  "name": "Levi’s Store American Dream",
  "address": "1 American Dream Way",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Wehhb-LLvnJUXxUkXXDyPg.jpg",
  "tags": [
   "kids",
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "DreamWorks waterpark was so much fun . Very similar to kalihari and camelback aquatopia but only 15 minutes to NYC and the wave pool is massive!  \n\nMy...",
   "I went there 2 weeks ago in mid of Feb, amusement park, skiing, skating opened. Water part was told to open first week of March.\namusement park is for kids,...",
   "American Dream was a overall good experience for my little ones, there's plenty of rides for them to get on and plenty of the Nickelodeon characters were..."
  ]
 },
 {
  "name": "Shipwrecked",
  "address": "621 Court St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_3--OzlBz9Frh8J0NTlsslQ.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "TIP: Check-in for 10% off! I forgot, but you can do it! (: \n\nIf you are looking for date ideas to spice up the regular food and movie dates, this is a...",
   "As an avid golf fan and a long-time player, I was definitely impressed with the convenience, design, and entertainment value of Shipwrecked. It is located...",
   "What a fun place! I didn't know this existed until I was invited by my SO. Its located in red Hook by Ikea and it's a bit out of the way from the train..."
  ]
 },
 {
  "name": "Dinosaur Bar-B-Que",
  "address": "700 W 125th St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_XzUW9MvEGOFs9_aNj11j2Q.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "They are open, Gyna! \n\nFood: 4\nPortion to $: 3\nQuality: 4\n\nAnd it's the only real BBQ I can get delivered. -5 star. \n\nYes, it's expensive and you don't have...",
   "I have been waiting to try this place for 40 days. As a Catholic, I gave up meat completely for Lent and wanted to reward myself with a great restaurant and...",
   "Delicious food, excellent service. They have always been nothing but fantastic and the take out is just as good as dine in. The Mr. Crisp chicken sandwich..."
  ]
 },
 {
  "name": "Astoria Park",
  "address": "",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_0FX_Xm8cV3ePXd_IQ_qJXA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "What an awesome park! I haven't been here in years but spontaneously came by yesterday with a friend. We were meeting some pals who live in Astoria for...",
   "Welcome to my hometown of Astoria, NY. Situated in NYC's borough of Queens and just across the East River from Midtown Manhattan, Astoria was named after...",
   "The Astoria Park is pretty popular around here and I found that it is so for a reason. It's a great place for walking around, cycling, or even swimming for..."
  ]
 },
 {
  "name": "Kings County Distillery",
  "address": "299 Sands St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_J3ZLnLE-DZzrJu2ryEmrEw.jpg",
  "tags": [
   "history",
   "learn"
  ],
  "source": "Yelp",
  "reviews": [
   "Coffee AND Whisk(e)y?!?! Sign me up!\n\nWe went here after a friend's glowing review and recommendation. I'm a big whiskey fan and King's County did not...",
   "Some of my all-time favorite bourbon and one of my favorite spaces in Brooklyn. It's definitely worth getting flights when you go there so you can try a...",
   "I highly recommend the tour just bc it's more meaningful if you learn the history of the distillery. \nI'm not a whisky drinker but I appreciate the tasting..."
  ]
 },
 {
  "name": "Belvedere Castle",
  "address": "79th St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_WQKtbFOycJRVp719wBAN8Q.jpg",
  "tags": [
   "wander"
  ],
  "source": "Yelp",
  "reviews": [
   "New York Yankee great Derek Jeter has his own $15 million dollar castle north of New York City.  Now you, just like a kid again, can wander around your very...",
   "We stopped by here while touring Central Park and were blown away with beautiful views and a really cool castle. The castle has staff running it to ensure...",
   "A great \"castle\" viewing platform overlooking turtle pond and the great lawn at Central Park. Nice smooth path and a few easy flights of stairs to get to..."
  ]
 },
 {
  "name": "Flushing Meadows-Corona Park",
  "address": "11101 Corona Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_wJo9_YU4YX6o8thh_WLHmQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Writing a review for the cherry blossoms here! I visited a month ago (pre quarantine time) and the flowers were blooming nicely! The area I went to had...",
   "Flushing Meadows Corona Park is astonishingly beautiful with cherry blossom recently in mid-March. \n\nThere are a couple of landmarks which were built during...",
   "AN ABSOLUTELY MUST DO! 5 STARS!!! ONE OF THE COOLEST PARKS YOU WILL EVER GO TO! THE ADMISSION HERE IS FREE & FREE PARKING TOO! FREE PARKING IN NEW YORK YUP..."
  ]
 },
 {
  "name": "Classic Harbor Line",
  "address": "62 Chelsea Piers",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_jA5dLV24FRLPHYOdSpBs5w.jpg",
  "tags": [
   "experience",
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "I have lived in NYC for 3 years...and this has become my favorite activity.  I take all of my guests on these Cruises.  Fabulous.  Best value for the dollar...",
   "This was a great experience. If anything the cruise went by too quickly. The band was fun, beer and snacks available to buy, and great picture opportunities...",
   "I just came back from a nice trip to New York and one of the highlights was definitely the Morimoto Sake and Sushi Sunset Sail experience. Tickets can be..."
  ]
 },
 {
  "name": "Jump into the Light",
  "address": "180 Orchard St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_mvLf9pVnjW4rB5X2vh19EA.jpg",
  "tags": [
   "experience",
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Worth the money for a fun experience! $40 gets you an entire day, but you might want to reserve the upstairs area if you actually want to spend more than a...",
   "This is a fun place to spend a few hours! My brother and I came here on a Saturday afternoon and it wasn't too crowded. We purchased the all-day tickets...",
   "Great place, perfect to go with small groups. Good customer service, I'm not tech savvy, received feedback through the whole gaming experience and game..."
  ]
 },
 {
  "name": "Topgolf",
  "address": "1013 US Rte 1",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_dZ--Dvl0U0RYklR8b-W38Q.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Nice place. Food was good. I tried the sunrise burger.. bacon and over easy egg. Burger was med well as asked for. And with good flavor. Definitely would...",
   "So I've only been here once and I wasn't sure what to expect.  We pre-reserved our bay for the $50 fee, and to be honest, I think it is a little ridiculous...",
   "My family tried to book an family gathering at the Topgolf Edison a month prior but we ran into many issues with their sales team. \n1. They decided to put..."
  ]
 },
 {
  "name": "Hayden Planetarium",
  "address": "200 Central Park West",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_R00XZV3t6tv8W5skBmNUGQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "My boyfriend and I went to the planetarium for a quick visit during a trip to NY. It was our first time going and as huge Neil deGrasse Tyson fans (and...",
   "I've been to the Hayden Planetarium about three times over the past two years and as result have seen the \"Dark Universe\" film 2x and the soon to open...",
   "I'm really out of step with the consensus of my fellow Yelpers with regards to the Hayden Planetarium. In going, I was so sure I would love this place but..."
  ]
 },
 {
  "name": "Rooftop Reds",
  "address": "299 Sands St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_BKDIt5ExiVkCQjhKNRb75g.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "FREE DELIVERY!! Order your wine and don't leave home!!\n\nThe views from Rooftop Reds is beautiful, I was only there for a yelp event but it was such a cool...",
   "First heard of Brooklyn Navy Yard today due to some of the amazing work from companies helping out manufacturing medical equipment going viral. Started...",
   "It's so unusual to find a spacious rooftop bar in NYC. We were here on a Saturday around 4pm on the only day of the year the Navy Yard is open to the..."
  ]
 },
 {
  "name": "National Geographic Encounter",
  "address": "226 W 44th St",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Bqdtjr5W13Hz4OKnCGNFMw.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "My wife and I arrived here on-time, but they started us forty-five minutes late. In line, they disregard whether or not you signed up to enter at a specific...",
   "Had a few hours to kill so walked NYC time square and found  this. Something I have not done :) \n\nWe had a by one get one offer -- so got in for about $22 a...",
   "First the interesting- the exhibition is very techy- animation, 3D glasses, and props to make you feel like you are underwater. \n\nThis is not an aquarium,..."
  ]
 },
 {
  "name": "Yankee Stadium",
  "address": "1 E 161st St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_uH56KMuTI_2SBYZ7Wa_hqw.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "We took a road trip to New York City Labour Day long weekend 2018 from Toronto, Ontario. One of the items on the itinerary was to catch a baseball game at...",
   "This is a must visit for baseball fans. Unfortunately, I never visited the original park on my last stop in NYC. There are plenty of seating options. If you...",
   "The interior is bland the food is ok it's the Yankees nothing enjoyable to see but those damn pinstripes not winning any playoff games"
  ]
 },
 {
  "name": "Zombie Hut",
  "address": "273 Smith St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_rRPuX18uiYLEUGdJ9xQBEQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Strangely wasn't crowded that one Friday we went, but I still admire the ambiance and decor of this place! It is definitely spooky, ominous (haha) and I...",
   "Zombie hut. You kill me. In a good, rather great way. If you're in for a reliable dive bar, a quiet back yard, games at the bar, sweet cocktail kinda place...",
   "Stop #2 along the Smith street bar hopping tour. This place has all the things you need in a year round bar - indoor, inbetween, and outdoor seating. \n\nThe..."
  ]
 },
 {
  "name": "Rosé Mansion",
  "address": "111 W 32nd St",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_pImF6sJJtAttgQ6mw2a5PQ.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "An absolutely amazing experience. This place is magical. It would be amazing to see something like this back here in Baltimore. This was the highlight of...",
   "If you're ready for hot girl summer, go.  If you're ready for a new Insta-Twit photo-op, go.  If you're ready to be hoarded into a single NYC warehouse...",
   "Came here this past weekend with my frans and had a great time! \n\nSo first things first, don't come here expecting wine education with your tastings...."
  ]
 },
 {
  "name": "Angel's Share",
  "address": "8 Stuyvesant St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_ZD22cMZvSmfNsXS9vKizGA.jpg",
  "tags": [
   "drink"
  ],
  "source": "Yelp",
  "reviews": [
   "Hands down one of the best bars in Manhattan! \nGreat ambiance, amazing bartenders, speakeasy style with quirky drink options. I most recently ordered the...",
   "This used to be my favorite cocktail bar in the world, and I've been here many times.  Don't get me wrong, the cocktails are fantastic, but the lack of...",
   "One of the best cocktail bars in Manhattan, without a doubt. \n\nLocation: a little hard to find, just go upstairs to the Japanese restaurant, when you turn..."
  ]
 },
 {
  "name": "Mission Escape Games",
  "address": "265 W37th St",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_33sV1AC_s-h0ckLvyO34Hw.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I have played three episodes with Mission Escapes and decided it was finally time to review.  My work group has a tradition of doing an escape room whenever...",
   "This escape room was great!! I always did escape rooms  around this area and decided to try this one for my bday weekend with fam. Our gamemaster raymi was...",
   "Game: End of Days (A) [20% Escape Rate]\n9pm on a Saturday\n$30 (not added tax as of Feb 2020 when bought online)\nGame Master: Raymi \nHost: Hector\nTime..."
  ]
 },
 {
  "name": "Sleep No More",
  "address": "530 W 27th St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_0xyJkg_fveS0JdP68TH2qQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "It is hard to review a show without giving too much away.  \n\nImagine a bedtime story, but not the one that will put you to sleep.  On the contrary, this...",
   "Overall the best part of Sleep No More is that you get to escape the current time period and transport back into a time where everything was more...",
   "Sunday was my second time attending Sleep No More and it didn't disappoint! Brought my boyfriend (his first time) and he loved it. \n\nIf you're considering..."
  ]
 },
 {
  "name": "Ellis Island Immigration Museum",
  "address": "Ellis Island",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_QERbo2vqq4T9GyIFtb2Ccg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I've been to Ellis Island Immigration Museum before and did not do the audio tour. This time, I am so GLAD I went again and did an audio tour. In the...",
   "Just heard that Trump suspended all immigration into the country for 60 days due to the coronavirus pandemic.  Farm workers and health workers exempt.  This...",
   "I wish I had planned more time to spend here. We took the 1:30pm, 90 minute hard hat tour of the old hospital. When the tour was finished we only had enough..."
  ]
 },
 {
  "name": "Frying Pan",
  "address": "207 12th Avenue",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_bEloKDe-QVkwakAwmFKbbA.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Go here and get the perfect Instagram photo. The view during happy hour is amazing. The food is good and the staff is helpful and friendly. \n\nIt's far but...",
   "We stumbled across this restaurant after walking the high line.  We were hungry and wasn't planning on dining in Manhattan because it can be pricey however...",
   "An afternoon at the Frying Pan is a good time guaranteed! Came here with a big group on a sunny Saturday afternoon. The views of the river alone make this..."
  ]
 },
 {
  "name": "Intrepid Sea Air & Space Museum",
  "address": "W 46th St And 12th Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_XJYyDr_2cPl-SGhSANHH7A.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Love the Intrepid! I got my ticket on Groupon and saved $9. I was able to see the space shuttle, Intrepid and the inside of a sub.\n\nI came here on a weekend...",
   "I have been wanting to visit the Intrepid for so long and finally had the time to stop by. I would recommend getting her at least two hours to to and a half...",
   "This is an overdue review as we went this past Veterans Day. We had a great visit.   We took our toddler daughter and her BFF.  It was great that they were..."
  ]
 },
 {
  "name": "Pro Line Archery Lanes",
  "address": "95-11 101st Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_gcQQfhzZh3-pudpgB3jaoQ.jpg",
  "tags": [
   "cheap"
  ],
  "source": "Yelp",
  "reviews": [
   "We have been to a few archery ranges in Queens, but this range is by far, the best one! We will only be coming to Proline. My husband was bow shopping and...",
   "I found out about this place not so long  ago and I have been living in the neighborhood for the past 6\n5 years. I absolutely  loved it. It is really cheap...",
   "Archery is a nice change of activities for the neighborhood. A few years ago I came here with a friend and coming back to show another friend it was just as..."
  ]
 },
 {
  "name": "Tarot NYC",
  "address": "",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_QSBc3aYcYubsW6ySmcA-nA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "First off, I'll start by saying that I can see why this woman has hundreds of exceptional reviews and that I'll end up repeating what many others have said....",
   "My Dear friends online, My name is amanda bella And i live in USA, ohio, I have to give this miraculous testimony, which is so unbelievable until now. I had...",
   "I am ashamed that it has taken me this long to write a review... swore I did, but I apparently did not. Sorry Veronica!!\n\nIf I could give Veronica 10000..."
  ]
 },
 {
  "name": "KGB Espionage Museum",
  "address": "245 W 14th St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_2edh-uEnrXPoPc9Xeerp4Q.jpg",
  "tags": [
   "history",
   "learn"
  ],
  "source": "Yelp",
  "reviews": [
   "We came here for a special tour where our tour guide walked us through the history and gave us an up close look at the pieces in the museum. Everything in...",
   "I really think anyone would find this place interesting with all the different items they have on display. There is so much to see and learn about. The tour...",
   "Okay, so this qualifies as one of those quirky, off-the-radar things to do in NYC and totally worth the admission.  Especially if you have ever liked a..."
  ]
 },
 {
  "name": "Gotham Archery",
  "address": "480 Baltic St",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_vE6abbpbdA5cO2gaIFKMVA.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "The staff showing the class the ropes were enthusiastic, knowledgeable and hands on with each of us over the course of the instruction.  I started off...",
   "My company had an event here and the staff was entertaining, accommodating, and well trained. The space is huge and comfortable for events. They worked with...",
   "Amazing event with family! The instructors (Brendan, Corey...sorry if misspelled?) are awesome! They made it so much fun. They\nDid not make anyone feel..."
  ]
 },
 {
  "name": "Challenge Escape Rooms",
  "address": "40-18 Bell Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_YHEqU1uyuMoJxsuW4m1P-w.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "This was the second challenge room I ever experienced. I entered with two friends and another group of four amazing humans! It was helpful to have many...",
   "I just left the carnevil escape room in Patchogue.  I had a terrible experience. The room was horrific.  I called before to ask if it was hard and they said...",
   "My friends and I attempted the Wild West Saloon room. It was definitely one of the more difficult escape rooms I have tried. I felt that some of the..."
  ]
 },
 {
  "name": "The City Reliquary",
  "address": "370 Metropolitan Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_9xLCXXkNUshGeABtSu2PPg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I love this spot.. I always stop by when I go to Pates et Traditions., I always find something I didn't see even in the permanent collection.. I bring...",
   "OK, I admit it. I don't get the appeal of this tribute to the Hoarders TV series. Oh wait, this isn't a museum about compulsive hoarding disorder? For the...",
   "I'm gonna try to be as fair as possible\n\nThis place has a LOT of stimulation- it's a cozy little shop that you can probably complete the tour in 20-30..."
  ]
 },
 {
  "name": "BATSU! New York City",
  "address": "67 First Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_zR7x95hfSLXCkpK9KC__6w.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This was the highlight of my girls' weekend trip in New York! We purchased VIP tickets which meant whenever our sake glasses were empty, the Sake Ninja...",
   "We've somehow come to associate bizarre costumes, over the top antics, and cartoonish sound effects with Japanese culture and media. Game shows all around...",
   "Ugh. I came here for a friends birthday last year and hated every minute of it. I won't go into too much detail (not because I'm afraid I'll ruin it [they..."
  ]
 },
 {
  "name": "Brooklyn Escape Room",
  "address": "594 Pacific St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_I3hV_CvcnRtmOe2dUC1RbA.jpg",
  "tags": [
   "low"
  ],
  "source": "Yelp",
  "reviews": [
   "ESCAPETHEROOMers visited Brooklyn Escape Room in August. It has a prime location right outside of the Barclays Center. You can easily get there by using any...",
   "My friend and I came here and did the Haunted room with just the two of us. We had a great time even though we didn't escape!\n\nPositive: We were definitely...",
   "It was five of us...a bit tipsy but coherent enough to know that something wasn't kosher about the clues  \nWe looked up, down, high and low for one..."
  ]
 },
 {
  "name": "Citi Field",
  "address": "123-01 Roosevelt Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_spQMbvAokpUrgrDCSfYSgw.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "As one of the greatest sports venues in all of NYC and home of the Mets, one doesn't have love baseball to admire Citi Field. I miss Shea for nostalgic...",
   "I'm a Yankee fan, but come on, is there anyone who actually hates CitiField?\n\nThe cool thing about CitiField is the promenade. \n\nIf you dislike the product...",
   "I go to Citi Field about 5 times per year. As a Yankees fan I have to admit that Citi Field is the better baseball stadium. The open air feel and ability to..."
  ]
 },
 {
  "name": "Ripley's Believe It or Not! Time Square",
  "address": "234 W 42nd St",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_QrFslJ21V5msantuVrqeeQ.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Being a local, I love finding things to entertain us impatient New Yorkers.  This was actually a really fun and interesting place. I got a fantastic deal on...",
   "We were meeting some family in town and we arrived a bit early. After hanging around Times Square a bit, my wife got the idea that we should check out...",
   "One of the worst I have dealing with representative Andrew at this place we bought tickets online when we came here we were told our tickets won't be..."
  ]
 },
 {
  "name": "The Wrecking Club",
  "address": "458 9th Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_jlvZ5Kg0XqEg_DsamP1Vuw.jpg",
  "tags": [
   "free"
  ],
  "source": "Yelp",
  "reviews": [
   "We came for a team offsite so it was free. \n\nI absolutely loved the idea of breaking things to release that stress. We bought an extra printer that was...",
   "Used a pulsd coupon for 30 mins \"rampage\" and for once, those 30 mins felt like a super long time under the circumstances we were in. But before I talked...",
   "So this bar is unfortunately stuck in the tourist hellhole of western midtown, but I will say that this bar has potential for the novelty of being able to..."
  ]
 },
 {
  "name": "The Funplex",
  "address": "182 State Rt 10",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_vgtgz0PasvOQyST_-aucmw.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "If you come early you will be fine.  As the day goes in the crazier and dirtier it gets.  Come early and the go karts, laser tag and rides are empty.   We...",
   "This place was awesome!\n\nIt was my nieces sixth birthday-- my aunt told me we were coming here to bowl. I didn't have the time t look on Yelp, prior to our...",
   "Definitely entertaining - they had a work deal for 3 activities, food, and a separate room for $35, which was great - the laser tag, go-karts and bowling..."
  ]
 },
 {
  "name": "Russian Baths on Neck Road",
  "address": "1200 Gravesend Neck Rd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_moK8qANVn1gQcF-fnPRnWg.jpg",
  "tags": [
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Love this place!\nYou pay 50$ and stay as much as you like. The saunas are great! Russian style(very hot) and some easier ones(like steaming sauna). The food...",
   "The place is very dirty, the staff there is VERY, VERY rude, they will treat you with their attitude like they are doing their favor. The level of customer...",
   "This place truly has the best Russian food in Brooklyn. I can't say enough about the feeling to which this place makes you return constantly. Warm ambience..."
  ]
 },
 {
  "name": "Bushwick Collective",
  "address": "Troutman St At Saint Nicholas Ave",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_xoiOXTbqQqrveY8DTIpZDw.jpg",
  "tags": [
   "free"
  ],
  "source": "Yelp",
  "reviews": [
   "The Bushwick Collective is an outdoor street art gallery that spans several blocks down Troutman St, St Nicholas Ave, and the surrounding area. It's...",
   "I feel like I need to know more. Before I get in to the particulars of the pieces (which are awesome), the current... acceptance (not the right word) of...",
   "Did I mention New York never gets old? \nI can never get bored, so much to see and eat! \n\nSo if you're into the arts, here is a free exhibit. The Bushwick..."
  ]
 },
 {
  "name": "UCB Theatre",
  "address": "555 W 42nd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_QpySngaKWPya8R9C6FXcZA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "As a business traveler I needed to blow off steam and you guys blew, thank you. Step was cool. No pressure, even when they were presented with I'm too drunk...",
   "I heard amazing things about UCB Theatre and it started out well. I was quite impressed and entertained for the first 10 minutes. But then it got slapstick...",
   "This was everything I hoped it would be. We came for GOAT on Saturday night. The setup was pretty simple improv. The cast interacted with the audience..."
  ]
 },
 {
  "name": "VR World NYC",
  "address": "8 E 34th St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_FzRdBo4TBtMxLkPEqe1P4A.jpg",
  "tags": [
   "experience",
   "unique",
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "This place is a fun and unique experience in NYC.  Went here on a date and had a great time (yep, the way to one's heart is to kick their butt in a VR...",
   "We came here on a Sunday afternoon and was pleasantly surprised that it was not crowded at all inside. We decided to get the all-day pass so that we'd have...",
   "I wasn't ever a fan of VR Gaming until I came here. It's a fun experience if you've got a great deal of patience, eye-sight and enthusiasm for technology...."
  ]
 },
 {
  "name": "Clue Chase",
  "address": "1114 6th Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_LY1qp-8p2APhcjmDdE6Fwg.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Hmmm...did not expect this much fun on level -1 of the WR Grace building.  This was my first escape room experience and it set the bar high for future...",
   "I have now done two of the rooms at Clue Chase--Alien Encounter and The Lost Spy--and I have to say that both were really well done. The rooms themselves...",
   "Clue Chase was amazing! I'd never done an escape room before, but from the moment we walked in we were impressed by these guys. The framing device is fun..."
  ]
 },
 {
  "name": "MoMA PS1",
  "address": "22-25 Jackson Ave",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_AhvNYQJ27A2w7jnhQxbj0w.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "MoMA PS1 might not get all the accolades or the buzz that many other art institutions in NYC, but it is one of the most iconic places in Queens. It is...",
   "Great ambience and building in LIC. I was pretty surprised at the size of the museum building as I thought it would be small but it was 3 story building...",
   "The MOMA in Manhattan has been closed, so Idecided to visit this MOMA instead. \n- Not very crowded when I went on a Saturday midday\n- I was expecting a..."
  ]
 },
 {
  "name": "Painting Lounge",
  "address": "309 Roebling St",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_oQsNq2f9RrTcPgEzQ97lwA.jpg",
  "tags": [
   "experience",
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "I really enjoyed my experience at Painting Lounge in Williamsburg! The studio is very spacious, which makes it perfect for large groups. We lucked out the...",
   "Beautiful Brooklyn space, the large room in the back looks great for a celebratory group class. Our teacher was fun and encouraging. I always look forward...",
   "Such an amazing experience! Came here to celebrate my birthday and had a blast! \n\nChris, our instructor, was so patient. His step by step directions helped..."
  ]
 }
]