[
 {
  "name": "PK's PlayZone & Grille",
  "address": "10019 W Hillsborough Ave",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_WG-uWu0xnqfYQbYe64n-Cw.jpg",
  "tags": [
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "We love this place. There is so much to do and the prices aren't bad. They have laser tag, bowling, a ninja course, rock wall, sky trail, mini golf, arcade...",
   "First tim here for a birthday party and there is somEthing for all ages. I'm not too suRe on the cost. There is zip lining, rock climbing, bowling, obstacle...",
   "Fun place to go for kids and adults alike. They have laser tag, ropes course, rock wall, ninja course, candle pin bowling, plenty of games with tickets and..."
  ]
 },
 {
  "name": "Bayshore Linear Park Trail",
  "address": "312 Bayshore Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_ALI7emV1MbnjytCsNzEqqQ.jpg",
  "tags": [
   "run",
   "walk",
   "peaceful"
  ],
  "source": "Yelp",
  "reviews": [
   "Since the Duke of the Bayshore Linear Park Trail recommended I take a run here while visiting Tampa, I couldn't say no.     This trail is beautiful and flat...",
   "I love bayshore! The walk down bayshore is just perfection. Florida is extremely hot so on days we can actually take advantage of good weather, being...",
   "A great spot to take a peaceful stroll. It's relatively quiet (except for the cars of course), well kept, very clean, and feels very safe - even when..."
  ]
 },
 {
  "name": "Topgolf",
  "address": "10690 Palm River Rd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_HuawlT4tXzCXL8ftyvCZ0Q.jpg",
  "tags": [
   "experience",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "An unexpectedly great time. Having been to one other Top Golf in Atlanta, this was a great experience. The staff was attentive and friendly. And some of the...",
   "This place really has the best food and I'm still pleasantly shocked. The food is seriously good, with playful recipes. I am heartbroken that they don't...",
   "So much fun! I was in Tampa for a long weekend, we don't have any Topgolfs where I live so I was excited to try it out. \nThe set up its really cool, kind of..."
  ]
 },
 {
  "name": "Pier 60 Sugar Sand Festival",
  "address": "7 Causeway Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Pauipn8WPhEh-b2ahWw2ig.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Sugar Sand is a fun festival and a great opportunity to spend time on beautiful Clearwater Beach. This year's theme is \"Journey around the World\" and the...",
   "It's really nice to see this display at sunset, so you see the sculptures in the daylight and see the magnificent Florida sunset too, but then come back and...",
   "This was my second year going. Definitely planning to continue to come each year. I enjoy that there is new sculptures each year. I like that they allow you..."
  ]
 },
 {
  "name": "Tampa Bay History Center",
  "address": "801 Water St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_bWgi0dQSRbTa44YZS6YtyA.jpg",
  "tags": [
   "family",
   "history"
  ],
  "source": "Yelp",
  "reviews": [
   "Tampa Bay History Center makes for a great family outing. We stopped in for the Brick History event and opted to become members for the added benefits...",
   "A very cool museum!! Multiple levels with so much to see and do.  Definitely need multiple visits.  \n\nWe were here for the lego exhibit and it did not...",
   "I was quite impressed by this beautiful museum right on the Riverwalk. There is so much interesting information here regarding the history of the Seminole..."
  ]
 },
 {
  "name": "Tampa Bay Grand Prix",
  "address": "3404 Cragmont Dr",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_stOjzKYiIjZHEtceePX46A.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Really fun you can ride Go-Karts and it's totally fun I would be suprised if any puts a 1star",
   "Well, listen y'all, it's hot as hell so I commend these employees working the tracks. Friday was lady's nights for $10 races and no membership fee. We let...",
   "I've never had a more miserable experience. After being told a 50 minute wait, we approached the desk. Turns out we would have to wait an additional 45-70..."
  ]
 },
 {
  "name": "On Swann",
  "address": "1501 W Swann Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_hExi86DTBlmIhB2FLvqrHg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "It's quietly classy and effortlessly chic, but not one bit stuffy. This pretty restaurant in Tampa's Hyde Park area is an absolute gem. The menu is...",
   "What a charming restaurant in the Hyde Park neighborhood! My friend and I were exploring the area and decided to come to On Swann for dinner. While the...",
   "This restaurant had been on my list for quite some time. Finally after about 2 years we were able to make it here. Definitely glad we did.. what attracted..."
  ]
 },
 {
  "name": "Sunsets at Pier 60",
  "address": "10 Pier 60 Dr",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_7YWMzI0VM_MyVGmktJcveg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "amazing view of the sunset....lovely.. and Superb view of the long super white sand beach..\n\nIf you want to see the most amazing sunset, ( Clearwater is...",
   "I figured I should do an update of my two star review of this event (see below) as there have been some changes:\n\nOn my recent visits to the Pier during the...",
   "Family friendly place to be! Festivals and activities for all ages. Fishing rod rental and bait available for those who want to try out the Gulf waters...."
  ]
 },
 {
  "name": "Sarasota Jungle Gardens",
  "address": "3701 Bay Shore Rd",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_7MxEct6LGIp-ivOGTBpVOQ.jpg",
  "tags": [
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "Cute place to spend an afternoon.  We were able to catch the bird show at the front of the park which was cute and the kids were enthralled with what...",
   "Anyone who knows me knows I am a flamingo freak.  I just love them - my favorite color!\n\nThis place has all kinds of animals, even reptiles (not my...",
   "Had a great time visiting with a friend for a few hours. Gorgeous birds\nFriendly staff\nTidy gardens and greenery\nWent specifically to feed the flamingos and..."
  ]
 },
 {
  "name": "Tampa Museum of Art",
  "address": "120 W Gasparilla Plz",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_uoBmv4LIzOk6C-40MUVMuw.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "A really nice museum, that's not the biggest, but very classy with large open spaces.  We were there for their 100 year exhibit and it was filled with many...",
   "The museum needs to step up its game. There are is not enough art or exhibits to justify the cost of admission. It takes at most 2 hours to go through the...",
   "This is a pretty small museum, or rather they have a small collection even though the building looks pretty big from the outside. It was kind of one of the..."
  ]
 },
 {
  "name": "Cooper's Hawk Winery & Restaurants - Tampa",
  "address": "4110 W Boy Scout Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_uYMVRPYEqpmVXWN2xOs5KQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This is my first time visiting Cooper's Hawk. My friend invited me because she is a member of their wine club. We were able to participate in a wine sample....",
   "Valentine's Day Lunch at Cooper's Hawk Winery  = Major Disappointment!\n\nWith restaurants being crowded and noisy at night on Valentine's Day, my husband and...",
   "Came for lunch one day and then dinner another time.  i have to say when i came for lunch it was busy and i sat at the bar solo.  The Bartender was a nice..."
  ]
 },
 {
  "name": "Julian B. Lane Riverfront Park",
  "address": "1001 N Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_tA4igim9d4BTb_i0dD5QfQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Why 5 stars? Because what else could you want in a park?\n\n   ---   ---   ---\n\nAs the parent's of a one-year old, we're constantly on the hunt for places to...",
   "This is park wonderful.  Normally, I like to go walking here but it's good for a little festival.  Today, it's a nice day for The Flavor of West Tampa with...",
   "Very open space with amazing views of downtown Tampa.  Located near the armature works/tampa prep area.  The park itself is new and very clean.  Well padded..."
  ]
 },
 {
  "name": "Cheese Please",
  "address": "3225 S MacDill Ave",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_MnjCw3oaM0Hq39bjONDU0Q.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This place sets the standard for all wine and cheese places!! The owner is extremely friendly, and informative when it comes to which cheeses to order. I've...",
   "I visited Cheese Please with a group of 5 for a Friday evening tasting.  The tasting was Spain vs. Italy.  \n\nCheese Please has a small bar that you can...",
   "Cheese, meats and wine! What more could you ask for? We ponied up to the bar at Cheese Please on a rainy Friday night. This place is so cute!! You can pick..."
  ]
 },
 {
  "name": "Green Lemon",
  "address": "915 S Howard Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_H26zRyQkXXYzUZUOtppFcA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "What a party! Me and my Tampa friends were def the \"parents\" in this Saturday night escapade, and a great time had by all.\n\nThe host, Tyler (broken arm) was...",
   "Why 4 stars? Because it was about time I visited one of the motherships.\n\n   ---   ---   ---\n\nI'm a huge fan of Ciccio's fast casual spots like Fresh...",
   "Chips/Salsa: Typically, I don't care for chips/salsa; I will usually only eat it because I'm hungry & it's around & I have no discipline. The seasoning they..."
  ]
 },
 {
  "name": "Empower Adventures Tampa Bay",
  "address": "423 Lafayette Blvd",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_0XazM8VIswiJZ4-96raOjQ.jpg",
  "tags": [
   "energy"
  ],
  "source": "Yelp",
  "reviews": [
   "Awesome time here! Great customer service and energy. Had some scheduling issues and they were easily able to accommodate. On the day of th event, we had...",
   "Adele and Matthew are the best guides ever! They're super enthusiastic and like to crack jokes with us. They were very encouraging and patient with some of...",
   "Lots and lots of fun,laughs and thrills. There are 5 zip lines. They get longer and faster as you move through the park. . There is a mini obstacle course..."
  ]
 },
 {
  "name": "Coppertail Brewing Co",
  "address": "2601 E 2nd Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_9KiDjwHiQbHBV6iSTvIz7Q.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Not gonna lie, I will be devastated when I have to move away from Coppertail. Not only is the location itself awesome but the local beer sales are less...",
   "Coppertail is probably one of my all time favorite breweries.\n\nFantastic beer selection ranging from IPA's to sours and ciders to stouts. Delicious food...",
   "Coppertail is one of my favorite breweries in the Bay Area. Their crafts are amongst the best that Tampa/STP has to offer. The only minor downside is that..."
  ]
 },
 {
  "name": "eBOATS Tampa",
  "address": "333 S  Franklin St",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_XPXyQZUlSeyP7U9x6EzXZw.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "A group of us from church spent a day fabulous afternoon on the water with eBOATS. This was on my to do list for sure. The Riverwalk area in Tampa is...",
   "Great activity on the bay for families looking for something to do for fun. Reserving a boat is a great idea for families that give you an option of driving...",
   "KC was great! The boat ride was so relaxing and the view was perfect! Love the idea of being able to bring on food and drinks. Very safe ...Had my little..."
  ]
 },
 {
  "name": "Flatwoods Park",
  "address": "42540 Bruce B Downs Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_jDgm0ntUSNj3meVCy1d6Ew.jpg",
  "tags": [
   "walk",
   "run"
  ],
  "source": "Yelp",
  "reviews": [
   "I freakin love this loop!\n\nFor a place to run, walk, bike, rollerblade and explore, this place is the best around.\n\nAccessible from 2 exits off I75, this 8...",
   "As someone who had not been able to ride a bicycle since age 13 due to an undiagnosed disability, the seven miles of park (which includes paved trails) in...",
   "Great paved biking trails. Convenient locations on Bruce B Downs and Morris Bridge Roads. Plenty of parking. $2 fee is a bargain. Rest rooms, maps, water..."
  ]
 },
 {
  "name": "Edison: Food+Drink Lab",
  "address": "912 W Kennedy Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_wIz_tZ88bj4W3VlrJTiiqQ.jpg",
  "tags": [
   "food",
   "food",
   "delicious"
  ],
  "source": "Yelp",
  "reviews": [
   "CHEF PIEROLA is the bomb!!! I've been once and the food is amazing. We had the BISCUIT + FOIE GRAS with black garlic biscuit, soooo good! \nI would have...",
   "I'd been meaning to try this restaurant and I'm a little disappointed. The photos of the food looked great. The taste wasn't there though. For transparency...",
   "Last Sunday my bf and I had dinner at the bar and everything was incredible. We ordered a couple of cocktails which was super delicious and creative. We had..."
  ]
 },
 {
  "name": "Horse Power for Kids",
  "address": "8005 Race Track Rd S",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_fWsqniY9yRYEn9QlwUi2bA.jpg",
  "tags": [
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "I loved this place it is a little gem I highly recommend taking the membership if you have small kids they will really enjoy this little farm. The petting...",
   "I don't think that they should have certain wild animals if they do not have appropriately sized enclosures.  The Wolf dogs, as well as many other animals...",
   "Nice place off the beaten path. They have more animals than I thought. My daughter rode a pony, held a guinea pig and saw animals that she never thought..."
  ]
 },
 {
  "name": "Fun Lan Drive In Theatre",
  "address": "2302 E Hillsborough Ave",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_UzPyocL2CE7cUQCXRjbb-Q.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Very cool and retro in a 'Twilight Zone' kinda way. -- Growing up in the 60's and 70's drive in movies were a norm where I came from. -- (I still remember...",
   "This place was good to see since this movie theater concept is dying out. You only get a few choices as far as movies go but the movies are only $7 bucks so...",
   "I have been to this drive in more times than I can count, due to it's convenience. You are able to bring your own food with no additional fees, and I can..."
  ]
 },
 {
  "name": "Lowry Parcade & Tavern",
  "address": "1213 W Waters Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_4MY3w1Spq0LFxLKmIkGRWg.jpg",
  "tags": [
   "drink"
  ],
  "source": "Yelp",
  "reviews": [
   "I was searching online for something fun for my teen son and I to do together, when I stumbled upon Lowry Parcade. My son is also Autistic with fairly...",
   "This is my kind of hangout.  Laid back, a really good cider on tap, friendly people, and tons of video and pinball games to play.\n\nIt's so fun to be able to...",
   "We wanted to go somewhere to drink and play games. Well this was by far the best arcade bar in the area for as drink selection and old school games. The..."
  ]
 },
 {
  "name": "Murder House",
  "address": "1400 N Channelside Dr",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_sH7cZAjbzvrpiTudvwluHg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This is a good local place for a great cause, it's at the old Cuban club in Ybor city. Admission here is about $10, proceeds benefit Big Cat Rescue in...",
   "To end my Halloween night in 2016, my sister & I stopped in here to end the frightful evening. I didn't know what to expect from this haunt since there was...",
   "Was a waste of money even though it was to benefit a charity. It looked like the Dollar Store & Party City donated all their spooky decorations. Inside the..."
  ]
 },
 {
  "name": "Gigglewaters",
  "address": "737 Main St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_htJyj7N2_QqVUAvXCK9aXA.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Hubby and I took our son out for lunch on Wednesday for his 29th birthday.\nOur server was pretty awesome she was on top of her game!\nThe ambience was really...",
   "This place has amazing food and great drinks! \nI'm giving it 4 stars instead of 5 stars because the placement of the bathroom was three feet away from our...",
   "We came to Gigglewaters for a Christmas Eve visit with some old friends. Our friends were staying in Clearwater Beach, and we were in Tampa, so we were..."
  ]
 },
 {
  "name": "Altitude Trampoline Park",
  "address": "4340 West Hillsborough Ave",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_e1L8B0LggAay_zp_s73sXA.jpg",
  "tags": [
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "So I've been taking my kids here for a couple of years now. We used to go to a trampoline park closer to my home but this one was built and it became the...",
   "We celebrated my son's 8th Birthday Party. \nEverything was good, our hostess were amazing! We will be visiting again. Giving the park a 4 because Bathrooms...",
   "My daughter LOVES to come here and we've been countless times!  It's clean!!  The cleanliness of the place is actually very impressive since there's numbers..."
  ]
 },
 {
  "name": "Bay Area Renaissance Festival",
  "address": "11315 N 46th St",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_7xLfsijRbCKcgj7zFaaEsA.jpg",
  "tags": [
   "delicious",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "We go here every year when the Ren fest comes to town. We absolutely love it!  Great food, delicious food, beer, cider and the best people\nWatching!  Fun...",
   "The Ren Fest is something I look forward to every year, however today I was disgusted with what I saw on a stage near the Highland Games area. A whole crowd...",
   "The Tampa Bay Area Renaissance Festival is open Saturdays and Sundays from February 16th through March 31st every year from  10:00am - 6:00pm. The festival..."
  ]
 },
 {
  "name": "Captain Memo's Pirate Cruise",
  "address": "25 Causeway Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_3WKZeairiRsT7cMwn_1m4A.jpg",
  "tags": [
   "experience",
   "kids",
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "This was great experience especially with a kiddo. The staff were great pirates and so attentive with the kids on board and had a lot of activities! We saw...",
   "The pirates tried to get us to participate in the shop and we had blast!!  The staff were wonderful and entertained the kids. Water guns and face paintings...",
   "We had a blast on Captain Memo's cruise! At first I was a little leary of going because the price was a little high but I am so happy we did go. The crew..."
  ]
 },
 {
  "name": "Florida Orange Groves Winery",
  "address": "1500 Pasadena Ave S",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_yLO54UaaFeX4xn51Dfdh6Q.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "I have had Florida Orange Groves Winery bookmarked for the longest time. I was saving it for a fabulous girls' weekend...and then all weekends got...",
   "Fantastic winery! Not only do I love their wines, but they have great customer service.  I ordered some bottles for my over-worked sister since her birthday...",
   "Not the best wine or tour guides. Interesting variety but overall not the best experience"
  ]
 },
 {
  "name": "The C House",
  "address": "6005 N Florida Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_5JiFbBsbUdb-caBZWRyMSw.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "The C House.  Where all menu items begin with a \"C\".  Inventive I must add.  Wonder where the concept came from? \n\nThe atmosphere is two different worlds....",
   "Love the atmosphere, love the cheese and charcuterie board, underwhelmed with my salad.\n\nThat's where that last star went, I wasn't a huge fan of my main...",
   "Came here for brunch with a group of 6. We had a reservation. We were sat outside. Inside was not even offered to us due to a baby shower being held inside...."
  ]
 },
 {
  "name": "EG Simmons Park",
  "address": "2401 19th Ave NW",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_So_GzPoVBLo5GvRPJ8_ong.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "While living in Ruskin, I visited this park often. At times I went privately, with friends & community events. I never camped there, but I have sure enjoyed...",
   "This is a nice park that offers RV sites, picnic tables, a boat ramp that leads into Tampa Bay, a sandy beach, swim areas, and private areas. They also hold...",
   "I make it work...the sunsets here are beautiful. And there are some really cool spots including a lifeguard shed, chair, and really pretty tree. Downsides..."
  ]
 },
 {
  "name": "Odyssey Cruises",
  "address": "776 Dodecanese Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_DIq0PN_L67ccOLiirWz8Uw.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "This was awesome! $18.99/person and we did a two hour excursion. We saw a few dolphins and they stuck around for awhile! Then we went to an island and got...",
   "Two hour sunset cruise from Tarpon Springs in  front of Hellas Restaurant.  Beer,, margaritas, water, rum runners were for sale on the boat. There was a...",
   "Great experience. Fun and knowledgeable captains. Great shelling on the island and we were lucky enough to see dolphins too! It does get windy on the boat..."
  ]
 },
 {
  "name": "Villagio Cinemas",
  "address": "11778 N Dale Mabry Hwy",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_WQ832PDnsDshhbQFm83ISg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I absolutely love this place for movies!! I've been coming here for 2 years now and might I say this place is phenomenal. They have good ticket deals on...",
   "I love the vibe and ambiance of this cinema! The staff was amazing, good drinks and you can't go wrong with a nice quality film. My only complaint was the...",
   "The service was not good , the theater carpet was dinging and stinky, the floor were sticking. the beers were warm!"
  ]
 },
 {
  "name": "Capt Jared",
  "address": "",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Aau1q3xEeXzMbeoMGd_WvA.jpg",
  "tags": [
   "experience",
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Jared is the kind of dude you want to take you fishing. He's a great fisherman and keeps you on the fish all day. I will be back soon to test his fly...",
   "Great experience with this man! First time fishing in the area, he brought water, bait, coached our group of 4 on best-practices for the area.  Thank you",
   "If you want a top notch fishing experience, this is the guy that you need to go with.  Captain Jared is a local born and raised and knows the area like the..."
  ]
 },
 {
  "name": "Social House",
  "address": "6310 N Florida Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_LtX0VinSVVba0dUAKg2dhw.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "This was our first time coming here and we will definitely back. We came for lunch on a week day and there was no problem getting in. Service was great and...",
   "I debate between a 3 and a 4 but will go to the higher end because for another \"trendy\" \"hipster\" spot in Seminole Heights, the prices were reasonable and...",
   "I like it, but I don't love it. The happy hour prices are good, but the food is just okay. I've had the rice and beans bowl with grilled grouper, tacos, and..."
  ]
 },
 {
  "name": "Amalie Arena",
  "address": "401 Channelside Dr",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_NiXwGOozHmBbCN3-GpsYFg.jpg",
  "tags": [
   "experience",
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "I had a great time at Amalie Arena. Hubby and I flew out to Florida for the Vegas Golden Knights vs. Tampa Bay Lightning hockey game, and our experience as...",
   "What mixed experiences we've had here. \n\nFirst, we must warn you to never, EVER prepurchase \"reserved parking\" for the garage of this arena. We were last...",
   "We have not been here since we had kids. I am guessing at least 10 years. \n\nWe came to see the Cirque Musica Holiday Wishes Show. It was a so nice to see..."
  ]
 },
 {
  "name": "Tampa Bay Grand Prix",
  "address": "12350 Automobile Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Tq5Ri8FbpdoBdgM5ju1IvA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This is NOT a go kart track where you will be able to bump into others or drive crazy. Safety is strictly enforced. They stop you if you don't follow rules....",
   "We had a blast last weekend! We went pretty late but they squeezed us in and quickly went over the rules so we could do 2 laps. I haven't been go karting in...",
   "Ok a big thanks to Tampa Bay Grand Prix.  I got to go to my first official \"adult birthday party\".  One of my friends organized the party package for a..."
  ]
 },
 {
  "name": "George Steinbrenner Field",
  "address": "1 Steinbrenner Dr",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_nl60kTdUtKs8L_DfnD4i7A.jpg",
  "tags": [
   "energy",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Hey it's Yankees. How much better can it be? Same high energy vibe as the Bronx on smaller scale - immaculate grounds. The best of the spring training...",
   "It's been a while...\n\nMaybe 20 years, when this ballpark was called Legends Field back in the day. Major renovations have been completed in the last few...",
   "This is like a mini Yankee Stadium. It might be the best spring-training park I've seen. It is reminiscent of Yankee Stadium. The food choices are good. Not..."
  ]
 },
 {
  "name": "Besito Mexican Restaurant",
  "address": "205 Westshore Plz",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_KP5OncF2jhT7_J1phHPPww.jpg",
  "tags": [
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "I don't know what was better, the atmosphere, the food, or the service. We had the most amazing guacamole prepared by Andy. He was so attentive and made our...",
   "Besito, besito - you've got tasty food. I really like coming here!\n\nI know - it's not the cheapest; you can opt for Happy Hour (Mon.- Fri. 4pm - 6:30pm) or...",
   "We were in town for a wedding and were looking for a place to take a reservation for 13 people within an hour on a Friday night, and Besito did not..."
  ]
 },
 {
  "name": "Boca - Tampa",
  "address": "901 W Platt St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_MI7cUsPiQGYQRuQmn3MbtA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I really enjoy coming to this farm 2 table restaurant when I'm in downtown Tampa. I've only done brunch so I can only speak for that. Will have to try their...",
   "I haven't been here in years but came in Sunday night for dinner and was thrilled to hear they still had their fried green tomatoes! \n\nWe both got the...",
   "I really can't help but love this place... I've never had anything bad and the service is always good too. If I'm not eating inside the restaurant, I'm..."
  ]
 },
 {
  "name": "The Tropics Boat Tours",
  "address": "25 Causeway Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_ok17sZWhUiH6e48Wv1bk7g.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Our family had so much fun on this tour. The folks answering phones during the day as we planned our trip were amazing. The DJ/bartender was really fun and...",
   "Great staff! Made us feel welcome and get our drinking on while on the boat. The lady who checked us in was so nice and outgoing, she was asking what...",
   "This was so fun!!! The prices are great, the crew was fantastic, they were so fun and outgoing and made sure you could spot out the dolphins. There's also..."
  ]
 },
 {
  "name": "The Shops at Wiregrass",
  "address": "28211 Paseo Dr",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_CGijrmxQjVj1sLJfTFtm4Q.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "What a wonderful four door mall. They have so many events, I love it. It's a beautiful venue to spend time. And I'm so excited for all the new additions and...",
   "Nice outside mall. There is ample parking, a decent array of restaurants, a good selection of shops and services, businesses that give up their lease don't...",
   "Muzak forced upon my ears so i can't hear the fountains and at most 5 food choices. I don't say restaurants because the best deal here is Pretzel Twist...."
  ]
 },
 {
  "name": "The Bricks",
  "address": "1327 E 7th Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_dIpTuL2T1L98GQGU17IeSw.jpg",
  "tags": [
   "drink",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Adorable atmosphere. Very quirky. There's art from local artists all over the walls. Delicious food and drink. Great events. Highly recommend. Would...",
   "I tried the tacos (veg & chicken) and the chicken were the worst chicken tacos I've had in a WHILE. The chicken had a fishy taste to them, that made them...",
   "I love the Bricks. I can't believe I haven't reviewed it before. This has been a go-to bar/restaurant for me for the last 8 years. Birthdays, New Year's..."
  ]
 },
 {
  "name": "Vertical Ventures",
  "address": "116 18th St S",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_6FnExlrZpopo3PiVmZl8dg.jpg",
  "tags": [
   "learn",
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Up up! \nVertical Venues hooks you up with all the gear to safely climb. \nA fear of falling? That will be conquered here as you learn how to let go (and let...",
   "There is plenty of parking around the area of this gym, parking was not a issue at all for us. \n\nAs we came in we saw that the place is pretty nice and...",
   "When here last time night with the family, I have a 5 + 7 year old, and we had a BLAST!\nZarin, gave us our tour and we set to climbing. Such a fun activity..."
  ]
 },
 {
  "name": "Circles Waterfront at Lands End Marina",
  "address": "1212 Apollo Beach Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Dzm1y59cLFt8OjTsZRUC6w.jpg",
  "tags": [
   "food",
   "experience",
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Such a beautiful place to visit for a meal! We stopped by for lunch on a warm, sunny day and were able to sit at a table outside. The view of the harbor was...",
   "The food was good. But it was not worth how much you paid. Although we love the atmosphere, it just seems out of place for Apollo beach. It's fancy. We did...",
   "I have been here a couple times and every time has been an excellent experience. I was here just this past Sunday with my family to celebrate my mothers..."
  ]
 },
 {
  "name": "Cracker Country",
  "address": "4800 Hwy 301 N",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_yayRBmUIVukcuAduT_7aWA.jpg",
  "tags": [
   "historic",
   "learn"
  ],
  "source": "Yelp",
  "reviews": [
   "Cracker Country is my favorite part of the Florida State Fair. It's more like visiting a historic area, such as Colonial Williamsburg, where characters in...",
   "Great school field trip\nGreat way to spend an afternoon in an outdoor museum dedicated to Florida heritage and beginnings. Learn how to crack a whip, make...",
   "If you've never heard of Cracker Country, then you've never been to the annual Florida State Fair in Tampa. At Cracker Country, you will see and learn about..."
  ]
 },
 {
  "name": "Parkesdale Farm Market",
  "address": "3702 W Baker St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_PEYgtOhGVoBoWwTJJg4M7A.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This place is nice, but it was a bit too busy for me. There was a line all the way to the road.  You can find jams of every flavor there, and salad...",
   "I've passed the sign for Parkesdale Farm Market on I-4 at least several hundred times and never stopped.  This road side market is AMAZING, especially...",
   "We made a pit stop at Parkesdale on our way through Plant City and I'm so glad we did! Hadn't been there in years , and it was just as good as I..."
  ]
 },
 {
  "name": "Philippe Park",
  "address": "2525 Philippe Pkwy",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_6byjkJsPtms6I0h5tkxQ5A.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I visited here because an orginazation I belong to was having a get together. It was a bright, but chilly autumn afternoon, and the park was full of people....",
   "Being born and raised in Tampa, this has been one of my favorite parks.  The only negative is there is no turn lane at the entrance when turning left, which...",
   "I can't believe this park exists - it's like I'm in a fairy tale! It is beyond gorgeous with Spanish moss hanging from Live Oak trees and consistent breeze..."
  ]
 },
 {
  "name": "Mixon Fruit Farms",
  "address": "2525 27th St E",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_O5-sBpAzUdQq7B6iB3ckgQ.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Damon was so knowledgeable and informative about the animals and also so patient with the children's questions. The staff inside Mixons was super kind and...",
   "Bottom Line: Visit Tuesday through Saturday for the best experience.  \n\nI am fascinated by agriculture so I was very excited to visit Mixon Fruit Farms.  I...",
   "I like to visit here when I'm vacationing on Longboat Key. It's been a few years since I have been here and it was sad to see the orange groves across the..."
  ]
 },
 {
  "name": "Ruskin Family Drive-In Theater",
  "address": "5011 US Hwy 41 N",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_b_WMjlfeTkDSNAmo_kMJ2w.jpg",
  "tags": [
   "experience",
   "family",
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "We never go anywhere else. Best place for great family movie experience! Friendly. SUPER CLEAN! Comfy. Different than your average movie theater. Family...",
   "I love love love  coming to this Drive-In movie theater.  I've been coming for years and I hope to see it here for many more years.  I know it's tough to...",
   "My favorite place to see movies. This place is family owned and such a staple in the Ruskin area. I've been going here for over fifteen years and I can't..."
  ]
 },
 {
  "name": "Mermaid Tavern",
  "address": "6719 N Nebraska Ave",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_pNN5ggRc5KUBsnIzDdf_2A.jpg",
  "tags": [
   "food",
   "walk",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Right next door to 7venth Sun Brewery, the Mermaid Tavern is a fun hangout to go with friends when you want food and some good craft beer from both local...",
   "I love this place.  From the minute you walk in, you're glad you did.  It's very tiny, cozy, and intimate making it perfect for a few glasses of wine(thanks...",
   "Great spot in the formerly sketchy Seminole heights. Great food, interesting drinks. Ask for Thick Eyes the Half Naked Bartender (the naughtier half of..."
  ]
 }
]