[
 {
  "name": "The Secret Group",
  "address": "2101 Polk St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_tC69BDwoVtDExfae0lDWPA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I. Had. A. Great. Time! \n\nWe went to the comedy show first called \"too soon\" and the comedians joked about current events, politics and pop culture. It was...",
   "Put aside a lot of the negative reviews you've seen about this place, I've been going there for years and the only time I've had a bad time is when I...",
   "Last time I was at The Secret Group I had a BLAST! It was 90's night and the music was off the chain...the DJ actually played my request! I will definitely..."
  ]
 },
 {
  "name": "Burke Baker Planetarium",
  "address": "1 Hermann Circle Dr",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_5HhV4XikbXenOK-JxGi76g.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This will forever be a special place to me. We went to see Passport to the Universe, narrated by Tom Hanks. It was beautiful and humbling. At the end, the...",
   "Buying tickets, access and parking were easy. Once we got inside the Planetarium it was about 90 degrees in the room and just got more hot as the show went...",
   "Well when we went to the museum we went to the Planetarium first and saw three movies in a row. They were all fantastic, all world-class, and our little..."
  ]
 },
 {
  "name": "Neil's Bahr",
  "address": "2006 Walker St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Fag3AVNiGi0jkXZ728OKXQ.jpg",
  "tags": [
   "unique",
   "cheap"
  ],
  "source": "Yelp",
  "reviews": [
   "LOVE this bar. It quickly became my go to spot for adult beverages. Great atmosphere with an awesome staff.",
   "We wanted to try this bar and it's pretty unique. I love the comic books, arcade games, and decor of this place. It makes me feel like I'm going back in...",
   "Place kicks ass really good music a lot of punk rock pretty awesome cheap beer great comic book selection you can bring your own games or just play what..."
  ]
 },
 {
  "name": "benjy's",
  "address": "2424 Dunstan Rd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_YDD0n84xkd_nHmkmPorG5Q.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This is a review specifically on Benjy's brunch, which is great! I came here and tried the japanese pancake, the bahn mi benedict, and the dessert French...",
   "Lovely brunch place in Rice Village! This restaurant is tastefully decorated with vibrant colors, allowing the interior to glow with hues of forest green,...",
   "My friend and I went here during happy hour and it was definitely worth it! They have discounted appetizers and drinks!! The ambience is also one of my..."
  ]
 },
 {
  "name": "Urban Air Adventure Park - Houston",
  "address": "20502 Hempstead Rd",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_RVMiB7J595daOBluQvHb6A.jpg",
  "tags": [
   "kids",
   "kids"
  ],
  "source": "Yelp",
  "reviews": [
   "Great location for a birthday! The manager and staff were very accommodating and the kids ended up having a lot of fun. Host for the party was also great!",
   "I went to this place with my grand daughter  at first there wasn't much guide or directions as to what you need aside from the girls behind the counter that...",
   "I come here often because the kids love it and it's close to home. \n\nHalf the time I come here the concession stand isn't open at all and the other half the..."
  ]
 },
 {
  "name": "Go-Kart Raceway",
  "address": "2800 W Mount Houston Rd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_iUgjjnGvyW4TUaWLE7uwmQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "So my son wanted to come here for his birthday and I wanted to check it out for the longest time glad I did wasn't very busy so much to do he really wanted...",
   "Love this place!  Had a great time in their new Laser Tag Town!  Great concept and tons of great hiding places!  Had ages 8 to 62 in our group and they ALL...",
   "Went there today  for the first time... it was Great. Staff was very Helpful. Good prices as well"
  ]
 },
 {
  "name": "Steak 48",
  "address": "4444 Westheimer Rd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_iGMTbYr2FTFHc6vEIn51_Q.jpg",
  "tags": [
   "experience",
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "It was an incredible experience! We came with a party of 3 people for a business dinner and I was blown my mind. Everything from service to food was...",
   "I made reservations for my fiancé's birthday at Steak 48, this place was amazing, and we will be returning when in town.\nUpon being seated my fiancé was...",
   "The food was simply amazing! I enjoyed my pan stauéed chicken with the alaskan king crab and rock shrimp Mac&Cheese and cream spinach. By far one if the..."
  ]
 },
 {
  "name": "Sam Houston Boat Tour",
  "address": "7300 Clinton Dr",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_zM7IbgpCnyJnfxFn8msZxw.jpg",
  "tags": [
   "family",
   "history"
  ],
  "source": "Yelp",
  "reviews": [
   "Nice boat tour, great staff!! It's something to do as a family or if you're just visiting Houston TX. Educational & fun , best part is FREE no excuses. Book...",
   "The ship channel boat tour is a must see for those who appreciate the history of the city of Houston and relative importance of the ship channel. \nThe tour...",
   "I would like to kinda quote Rachael ,\" i didn't know there were docks\" in Houston. \nIt was a pleasant surprise when a friends suggested we go for a boat..."
  ]
 },
 {
  "name": "Empire Cafe",
  "address": "1732 Westheimer Rd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_f6QcrfaDUvKwcl1A5igkFg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "We chose the Empire Cafe this past Saturday night to celebrate #YelpsBigNightIn during the stay-at-home regulations amongst the  COVID-19 outbreak. We...",
   "My husband and I came here for brunch earlier. It was a line out of the door but it move fast. You order with the cashier first and then you find a seat. It...",
   "Setting: 11 am on a Saturday, party of 2, outdoor seating \n\nVibe: the spot for Saturday morning brunch apparently, it was super busy but still had plenty of..."
  ]
 },
 {
  "name": "Contemporary Arts Museum Houston",
  "address": "5216 Montrose Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_kaJbKJmdVYuzYyZeWr3YtA.jpg",
  "tags": [
   "free",
   "unique",
   "free"
  ],
  "source": "Yelp",
  "reviews": [
   "This is a must see if you are visiting Houston or live in Houston. Currently the installation on the bottom floor is pretty cool. Won't spoil it for you but...",
   "It's free and it's something to do when you're in the Museum District.  The artwork varies from odd to unique to 'WTF is this'.  Plus there's a gift shop on...",
   "The space is really tiny and the exhibits didn't overwhelm.  But, In spite of this, it's worth a visit...any hey, it's free!"
  ]
 },
 {
  "name": "Moon Tower Inn",
  "address": "3004 Canal St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_WaeYGFs9XVZfX7gXY8e2cQ.jpg",
  "tags": [
   "drink",
   "free"
  ],
  "source": "Yelp",
  "reviews": [
   "After a long afternoon bike ride around Houston, Moon Tower is a perfect stop. I have tried their burgers Chong and the Harvey with Beef (off their...",
   "My friend and I ate here last night. The deal was buy any drink and get a burger BOGO free. $12 for 2 burgers and a drink? We were sold.\n\nThere was a pretty...",
   "We really, really like the laid back vibe at Moon Tower Inn, and we like it even more now that they've opened their brand new covered outdoor space. They..."
  ]
 },
 {
  "name": "SPJST Lodge 88",
  "address": "1435 Beall St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_ASYvbqBYThkvRVWyJyE8Cg.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "This place is spectacular....review all about the Thursday Bingo Night.\n\nEver wanted to play bingo with 700 of your closest friends with booze. Come here....",
   "I have had this spot bookmarked forever, but have never gone here until one of our friends suggested that we come here for Bingo in the Heights. Let me just...",
   "1. They stated food isnt served passed 8pm when the event starts at 7pm... yet on the website it says 8:30pm\n2. Each Bingo card is different. The last in..."
  ]
 },
 {
  "name": "Improv Comedy Club",
  "address": "7620 Katy Fwy",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_n8lyDj3ubY8eDkNziRuZzA.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Who doesn't love to laugh!?  Starting the new year off right with comedy & laughter is the way to go!  Damon Wayans was performing last night.  The great...",
   "Wow - Their standards for food have fallen big time!  The drinks are spot on, with great taste and not just alcohol.  We tried 4 different items, and only...",
   "This is on venue NOT comedian. Russell Peters killed it and did amazing I'd give him a 200/5 stars. The venue wasn't bad in ease of ticket and going in so..."
  ]
 },
 {
  "name": "Memorial City",
  "address": "303 Memorial City",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_AjmQosAgNLFZ5g89dbORkg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "In addition to shopping there's plenty of other options to do here including cinemark, dining, children's play area (both indoor and outdoor), ice rink,...",
   "I love being able to get in and out of a mall in a flash. Coming here on my days off during the week is a breeze. It may not be as big as Galleria but they...",
   "2.5 stars for me.  \nI happened to be in the Memorial area of Houston unexpectedly by a surprise appt and stopped at Target for cough drops.  Next thing I..."
  ]
 },
 {
  "name": "The Music Box Theater",
  "address": "2623 Colquitt",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_QOqgQcDHGCPImgoaM74JYQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Tonight's Show was \"Broadway At The Box 2020\".  ANother hit show as always.  Tonight, Cay was not there (she used the excuse that she was going to her...",
   "Overall I had a good time. I attending on the opening for the Broadway series. We sat near the stage and it was pretty good. The artist did a great job with...",
   "The Music Box Theater is one of the best things going on in Houston.  I moved to Houston a year ago and have not missed any of the shows they put on.  They..."
  ]
 },
 {
  "name": "King's Bierhaus",
  "address": "2044 E Tc Jester Blvd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_AxaZgdc9Kmk9HAkPeq432g.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Phenomenal Bierhaus that will make your friends and family happy. They have great German selections but also plenty on the menu that will please even the...",
   "My hubby and I came here for dinner. What an awesome spot. The outdoor patio is so cool with a big pond running through the middle. \n\nAll the beers are...",
   "Wanted to like this place, but sadly it's not so good. It's really busy so you'd think this is a great place but I and the two other people I was with..."
  ]
 },
 {
  "name": "Cypress Trails Equestrian Center",
  "address": "21415 Cypresswood Dr",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_z7m_hMB4oX3EHSE4u0b4iQ.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "This place was truly amazing from the people to the horses and trail! Thank you all for making my marriage proposal go great! Jude made us feel like family...",
   "I've come here a handful of times with my toddler to do pony rides. She LOVES it.. the staff is so friendly and knowledgeable. I love that I can just lead...",
   "Everything is perfect! I got fire point and he is good boy~  All horse looks healthy and happy- ()"
  ]
 },
 {
  "name": "Studio Movie Grill",
  "address": "822 Town & Country Blvd",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_TALGISRAa9AjYybhbL4ZpQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I quite enjoy SMG! They set themselves apart from every other movie theater. The recliner chairs are really comfortable and I love that you have space to...",
   "I've only been SMG on Tuesday's for their $5 special. It's been a while since I've been to the theater but I usually alternate between here and Cinemark...",
   "Seats nice and that's about it. \n\nBathrooms DISGUSTING and lacking TP and working paper towel dispensers. When manager was requested, there was no sense of..."
  ]
 },
 {
  "name": "The Game Preserve NASA",
  "address": "20810 Gulf Fwy",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_BC7xTDxZU8pf433g2uUOqA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Wow. So disappointed. \nLet's start with the pros: very cool interior, great customer service, BYOB. Need I say more? Normally no. Usually this warrants 3+...",
   "A bunch of buddies, my wife, and their wives made plans to head out here. Well worth it. A really good time. Unlimited play for $15 a piece. I called before...",
   "Okay, who says you can't go back in time?\n\nThose who belong to Generation X and anyone who claims to be an '80s or even a '90s kid will have the time of..."
  ]
 },
 {
  "name": "Bayou Wildlife Zoo",
  "address": "5050 FM 517",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_BDyeEp6Rj5kzvg11ImxqlQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "We were trying to find something new and fun to do and we stumbled across this place. I was hesitant at first because it was during the wk of spring break...",
   "Oh my goodness. How have I never heard of this place in the past two years? My boyfriend happened to stumble upon this last time with his brother was...",
   "Cash only! It's a small like little hole in the wall place with very funny, helpful and knowledgeable personnel. We did a safari which brings you around the..."
  ]
 },
 {
  "name": "The Orange Show",
  "address": "2401 Munger St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image__-5bk1nwiGDeMtHT4_KNmg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Hands down the best thing in Houston. It is an absolute must see. I AM NOT JOKING AND I AM YELLING! \nSeriously. Go here and be glad that a retired postal...",
   "The Orange Show was created by Jeff McKissack, a US Postman who decided to create this attraction, based on his favorite fruit (the orange). Mr. McKissack...",
   "When I lived in Houston, I tried several times to tour the Orange Show, and it never quite worked out! (I was definitely frustrated more than once by it not..."
  ]
 },
 {
  "name": "Siphon Coffee",
  "address": "701 W Alabama St",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_PkYWIgjL7gheWbKYWRc3sA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Still haven't figured out the timing of this place. I've been twice. The first time I scored a parking space right across from the door. The second time I...",
   "Got a small green tea. 4 dollars and change?  Wtf \nI like supporting small local businesses but when the staff is rude and the prices are this high.  I will...",
   "I've still been comIng here for years now and it hasn't let me down. Solid breakfast menu that they serve all day. My favorites are the quiches and..."
  ]
 },
 {
  "name": "Pedal Party",
  "address": "2000 Edwards St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_mpGfzkB9o82px3qLnTPOMA.jpg",
  "tags": [
   "run",
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "Pedal Party is a ton of fun and well run business. Stephanie was our driver and from our initial conversation two days out I knew we were in good hands. We...",
   "I had the opportunity to try the Pedal Party over the weekend with some family and friends. We had an absolute blast. I would say that 90% of making this an...",
   "Had an absolutely wonderful time on Pedal Party!  We did the Midtown route and, I have to say, the group we were with had a great time.  Our host was great...."
  ]
 },
 {
  "name": "Houston Panic Room",
  "address": "1718 N Fry Rd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_hXaWBoZ3hrFRCy3ssIInPA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "This location was the first time I've ever tried an escape room and it did not disappoint! I've come back 3 times since. The level of difficulty (8/10) is...",
   "Came here with a group of friends for my husband's birthday. We did the zombie apocalypse room. It was definitely challenging. Thanks for the game master...",
   "Man...I have never been so intellectually challenged. My heart was racing and my legs were shaking.  Definitely will come back again! I would like to do the..."
  ]
 },
 {
  "name": "Washington Gym",
  "address": "1925 Washington Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_G27T0OvfmY-f9MppWOmcwg.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Prior to joining Washington gym, I worked out with friends at a 24 hr fitness. My gym attendance was very intermittent and I didn't appreciate the benefits...",
   "For the last several years I've been very inconsistent about working out. Always struggled to find the motivation to go longer than a few days. In October...",
   "Nothing compares to Washington Gym! The trainers, workouts and cleanliness can't compare to the other gyms in Houston. The price may seem a little steep at..."
  ]
 },
 {
  "name": "AMC Houston 8",
  "address": "510 Texas St.",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_wSyuTHlZAEZ5c5AkfRhbnA.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "We went on a Tuesday evening, and it was a bit of a ghost town, which we actually like! But it was eerily confusing when we entered to find the ticket...",
   "Thought I'd try out this theater since it was the closest AMC to me.. I was so disappointed.\n\nTo be honest, wasn't expecting much. A movie theater downtown?...",
   "The food and theater are great. However, the cleanliness of the bathrooms need to be looked at. \nThe bathroom was horrible in both the men's and women's..."
  ]
 },
 {
  "name": "Lupe Tortilla",
  "address": "2414 Southwest Fwy",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_VaYF-zv1-jN2j3PW7RNLXg.jpg",
  "tags": [
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "It's so yummy\nI really liked their food \nEspecially their Mexican Food.\nIt is some of the Best Mexican Food I've had in along time.",
   "Best beef fajitas in town.... if you come here please don't leave without trying the beef fajitas and the flour tortillas. \n\nFor their house margaritas I...",
   "I used to absolutely love this place however I can't lie .. I was let down a bit on my last visit last year. \n\nMy food was pretty bland and I had the..."
  ]
 },
 {
  "name": "Levy Park",
  "address": "3801 Eastside St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_3FUSbgrdpoMv5nVz5nz1uA.jpg",
  "tags": [
   "walk"
  ],
  "source": "Yelp",
  "reviews": [
   "We love Levy Park!  We've got twin 3 year olds & there is so much for them to do here.  There is an activity area with a large Connect 4, & an arts cart,...",
   "Levy park is a cool place in uptown. \nThe park is set between a bunch of high rises and is a breath of fresh air for those wanting to get out and walk.\n\nThe...",
   "The recently finished Levy Park is beautifully Instagrammable. The many different textures and colors make framing your photo easy and post-worthy. There's..."
  ]
 },
 {
  "name": "Waugh Drive Bat Colony",
  "address": "401 S Heights Blvd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_nfHcOCTeHjFrMJX9vu374w.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "One of Houston's local treasures, the Waugh bridge bat colony is a must visit for locals and tourists alike.  \nHere you can view one of the largest...",
   "If you're ever in Houston definitely stop by Buffalo Bayou Park and check out the Bat Colony! Thousands emerge from under the bridge every day at dusk....",
   "If you're visiting Houston this is definitely worth checking out. Super cool. Be there and sitting by at least 730-745 (during summer) to witness the bats..."
  ]
 },
 {
  "name": "Segway Tours of Houston",
  "address": "501 Texas Ave",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image__tgQ82QtZIxLaNpY06O72g.jpg",
  "tags": [
   "history"
  ],
  "source": "Yelp",
  "reviews": [
   "Amazing and wonderful tour from Bradley!  Great for teenagers and good history lesson of Houston. We will return!  Thanks for a super fun day!",
   "We toured with Matthew today on a Bayou tour that took in a little of downtown Houston.  We really liked Matthew and the tour was very well done!  The only...",
   "ANAZING, Let me just start off by saying how nice and well informed Sophie was. She was our tour guide and at first I thought it was going to be just a..."
  ]
 },
 {
  "name": "McGovern Centennial Gardens",
  "address": "1700 Hermann Dr",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_H1pkqARYwIgKIQUFBzY7uA.jpg",
  "tags": [
   "peaceful",
   "walk"
  ],
  "source": "Yelp",
  "reviews": [
   "I often visited a Japanese garden in  Hermann Park.Regarding McGovern Gardens, I was not interested in it. I just wanted to check bluebonnets flowers in...",
   "Gorgeous day to walk across the street for a top view! It's a nice green walk ... photography permitted. \n\nBeautiful, peaceful.... what else can you expect...",
   "Be a tourist in your own town , bring out of town guest for a cute photo-op , or have a wedding !\n\nBeautifully manicured lawn, wide variety of flowers,..."
  ]
 },
 {
  "name": "Space Montrose",
  "address": "1706 Westheimer Rd",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_WPwmY_QAAcQ4gGEYug91JA.jpg",
  "tags": [
   "unique"
  ],
  "source": "Yelp",
  "reviews": [
   "This place is so cute! Absolutely one of my favorite places to find gifts and Texas items. The store staff is helpful without being pushy and they...",
   "Extremely cute store that sells unique items made by local artists! My favorites were the prints which were reasonably priced, especially for the large...",
   "This shop is  more than you could imagine. The art jewelry and goods are delightful and well made. Come and look! I found some amazing things that I needed..."
  ]
 },
 {
  "name": "Lei Low",
  "address": "6412 N Main St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_d01FMooZ-9Yq0GQaOhTNHw.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Believe the hype. This place is a tiki bar in almost every sense of the word from the nondescript exterior, interior decorations, and serious drinks they...",
   "Want Tiki?\n\nWell, you don't have to go the islands to enjoy.  Nestled in a small strip center (blink and you'll miss it,) you will find Lei Low.  The name...",
   "Missing the islands? This is a hole in the wall place in a little strip next to a convenience store and smoke\nShop. The only thing on the exterior that will..."
  ]
 },
 {
  "name": "Cipher Escape Rooms",
  "address": "1735 Westheimer Rd",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Ve-kZjn7O_ZItmo_G-3ROA.jpg",
  "tags": [
   "family"
  ],
  "source": "Yelp",
  "reviews": [
   "This game was crazy challenging but nonetheless a ton of fun! Its an amazing way to bond with your family, friends or team as well as a great way to meet...",
   "Cipher is the first escape room I've done in Houston since I'm just visiting, so I can't speak on the quality compared to others in Houston. I've done other...",
   "Well put together challenge of an escape room! At hello the crew was very informative from parking to explaining the rules! My friends and I picked the..."
  ]
 },
 {
  "name": "Putt Putt Fun House",
  "address": "806 E Nasa Pkwy",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_RAZuqlRHDzPFhIDSAOlpog.jpg",
  "tags": [
   "kids",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "They have officially closed. This place was pretty outdated. I felt like I was in an 80s time warp. But prices were reasonable, and we always had a good...",
   "Super cute little place to spend some downtime. They have a little bit of everything to have you feeling like a kid again. For the amount of kids running...",
   "Kids had a great time and games and packages are reasonable.they have games also for little toddlers.you can get drinks,beverages,and food."
  ]
 },
 {
  "name": "Houston Livestock Show and Rodeo",
  "address": "3 Nrg Park",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_K602p8poXFWH5KzgcnXDiQ.jpg",
  "tags": [
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "The Rodeo is one of my favorite times of the year in Houston!  There's so much to do/eat, like the carnival games/rides, the hundreds of food stalls, the...",
   "I've gotten to attend the Houston Livestock Show and Rodeo for the past 2 years. This year marks year 3. I recently got to enjoy the cook-off and got to eat...",
   "The greatest bbq cookoff in the world, the food never disappoints and attending each year not only makes me proud to be a Houstonian but you appreciate all..."
  ]
 },
 {
  "name": "Indika",
  "address": "516 Westheimer Rd",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_6HIxvOGnLy7n84c3CxhjnQ.jpg",
  "tags": [
   "experience",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "I finally had the chance to stop by at Indika and it was an amazing experience. Our server Jason was very attentive and made sure our food and drinks were...",
   "Ok, so Indika didn't live up to the hype or the word of mouth from others. I stopped by for the lunch buffet on a Friday afternoon - 12:39 PM CST to be...",
   "Before eating here I was super confused about the new ownership and menu. I'm here to clear it all up.\n\nLocation: location is the same, nothing has really..."
  ]
 },
 {
  "name": "Taste Bar + Kitchen",
  "address": "3015 Bagby St",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_pugnsu0EBbpRmQxGTYmYtw.jpg",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Y'all! This place is a MUST when in Houston. We arrived on a Friday night (pre Covid19 lockdown) and it was amazing. Not only was the food delicious, and...",
   "So my friend told me this is a place I must go to while in town.... I had a 2 day trip and went both days bc omg the food was sooo good. I had a fruity...",
   "Omg!!!!! The lamb chops were amazing!!! And our service was amazing as well. The drinks I wasn't impressed with but the food and our server made up for..."
  ]
 },
 {
  "name": "Zoo Lights",
  "address": "6200 Hermann Park Dr",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_WzdlQWraEFUYHROBvbaWng.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "There were two \"Firsts\" when it came to our most recent visit to Houston Zoo Lights.  The first \"First\" is that I've never visited the Houston Zoo at night...",
   "While visiting Houston this past December, my husband and I thought it would be nice to check out Zoo Lights. So we came on a Thursday, a little before 7:30...",
   "The parking situation is a total nightmare!  We heard from friends the offsite parking and shuttle is pretty dismal as well.  We ended up ditching the lines..."
  ]
 },
 {
  "name": "Houston Dynamo",
  "address": "1001 Avenida De Las Americas",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_O_2xZIBegTYqMJt9eGR51Q.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "Bargain prices to see the best women soccer athlete in the world. Our Houston Dash have 3 US Women's National Team players and frequently hosts the likes of...",
   "I hate to do this, but after seven seasons as a Season Ticket Holder for the Dynamo, ans three for the Dash, it's painfully obvious that neither of these...",
   "These games are always a blast! Tickets are usually inexpensive. If you come here be prepared to be loud and have fun, guaranteed. Just be cautious if your..."
  ]
 },
 {
  "name": "The Original Greek Festival",
  "address": "3511 Yoakum Blvd",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_yyshJ8s9UnFJ47sDRVo22A.jpg",
  "tags": [
   "free",
   "food",
   "food",
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "I went on a Friday during their free entry hours (11 am to 4 pm). I loved the food which seemed like it was homemade and I think prices were reasonable...",
   "Oppaaaa! Yes I know.. original. \n\nA few words of realness.. parking sucked and everything is overpriced. Lines made you cranky and the food was the absolute...",
   "OPA!! I had an amazing time here. We came here on a Thursday so it wasn't too crowded. We were lucky to get parking really close to the entrance. For food,..."
  ]
 },
 {
  "name": "Free Press Summerfest",
  "address": "1100 Allen Pkwy",
  "avg_visitor_review": 4.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_rxWmEBkjvnSeNeeZnNGqPw.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Great music festival here in Houston, and if you're a diehard music fan of certain types of music and large crowds, then this is definitely your scene.  For...",
   "I've been to FPSF twice in my 3 years in Houston, and I've loved my experience both times. Yes, the weather is hot and humid, but it's all part of the music...",
   "Guys. I finally figured out how to do a music festival if you're over the sweaty mass thing, and just want to sit and listen to nice music. Because I'm no..."
  ]
 },
 {
  "name": "Tantrums",
  "address": "1730 Elmview Dr",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_Xx_aCAGCOU45nXkPOEEOow.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Great experience took my husband for our anniversary. We had a blast shawn was a great host and made us feel very welcomed. Great stress reliever Abe so...",
   "Amazing!! Hard 10 minutes!! Best date night ever! Husband went crazy! Wish we could buy the video!!! It's a wonderful change up of date night and super cool...",
   "Great place that is incognito! But the staff was super friendly! But please be warned that you should wear super thick shoes and clothes! As glass and..."
  ]
 },
 {
  "name": "City of Houston",
  "address": "",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_QW2PBryFdu1eTDHXBkODVQ.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "4th largest city in US.  Is Houston worth it?  Worth spending your time and dime?\n\nWhen I planned our trip to NOLA last summer, Houston was not in the...",
   "I love living in Houston and furthermore love living downtown.  However, despite the great restaurants and culture, the vulgarity, aggressiveness,...",
   "Man I love my new city! I've lived all over, and have found things to like everywhere I go, but this time I hope we stay in one place for a while. \n\nHouston..."
  ]
 },
 {
  "name": "Escape Again Rooms",
  "address": "3564 Highway 6",
  "avg_visitor_review": 5.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_0j7cksH1yWoEng7BfSO80g.jpg",
  "tags": [
   "experience"
  ],
  "source": "Yelp",
  "reviews": [
   "Our group had a great experience! It was the perfect mix of challenging and fun. Can't wait to go back to try another room.",
   "SO. MUCH. FUN!!!\nWent here with my husband, daughter, her boyfriend, and her best friend. Three of us were first-time players.  We booked the room as...",
   "Came here with my daughter. It was just us two in the room and we had a good time trying to unlock everything. We were given an hour to solve the room and..."
  ]
 },
 {
  "name": "El Big Bad",
  "address": "419 Travis St",
  "avg_visitor_review": 3.0,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_zA6Q9MVc2Tk4HTrurx2avQ.jpg",
  "tags": [
   "food"
  ],
  "source": "Yelp",
  "reviews": [
   "Great drinks, amazing staff and a great outdoor area to sit and relax with a cocktail. Can't wait to check out again after these coronavirus shenanigans",
   "Very friendly and very flavorful food \nThe chicken was well cooked \nFun place in downtown Houston!",
   "This was pretty disappointing and is now off my list. Worst thing is the horrible sewage smell that lingers on the first level and is overwhelming on the..."
  ]
 },
 {
  "name": "Boheme",
  "address": "307 Fairview St",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_-N992WGD-KSZ-6XMnMIhnw.jpg",
  "tags": [
   "food",
   "low"
  ],
  "source": "Yelp",
  "reviews": [
   "This bar was a lot larger than I expected upon arrival. There are two bars, one inside and one out back. The menu had a bunch of food items and a decent...",
   "Me and some friends stopped here before a Texans playoff game on a Sunday afternoon. Upon first glance the place is very trendy and has a lot of character....",
   "I've been to this place a few times. It's a very nice, low key place to go for happy hour, or even a casual date night or dinner. It's also good for..."
  ]
 },
 {
  "name": "Yard House - Takeout & Delivery Available",
  "address": "800 Sorella Ct",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_ZmY31p5jQRpkq_xOJU39nA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "I finally was able to make it to your house after hearing much about their happy hour prices late night. They have a special starting at 9:30 PM for all...",
   "I come here pretty often since they have amazing vegetarian options. This time though, I wanted to talk about the time I visited for my Birthday dinner. \n\nI...",
   "Post Valentines day date I decided to take date here.\n\nWe were seated immediately and greeted upon entrance\n\nHayley sat us down and served us\n\nShe was very..."
  ]
 },
 {
  "name": "MAX's Wine Dive",
  "address": "4720 Washington Ave",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_iWbVwTLPE50Jc421QCJyaA.jpg",
  "tags": [],
  "source": "Yelp",
  "reviews": [
   "The best place to get spicy fried chicken that I've had in Houston. Everyone who works here is really friendly and helpful when giving suggestions when...",
   "Where do I begin...\nWe made a reservation for 10 people for 11am (opening time) several days in advance. When we called before we arrived, the Chef answered...",
   "Not too bad.  I think I like the Max's in Midtown a tiny bit better.   Food was good. Service was okay.  \n\nIt was not a very busy night due to the weather..."
  ]
 },
 {
  "name": "Wooster's Garden",
  "address": "3315 Milam St",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/Photographs/yelp_image_MAl_Nu9m0myF2PQ_NUsDUQ.jpg",
  "tags": [
   "drink",
   "delicious"
  ],
  "source": "Yelp",
  "reviews": [
   "Pros: we absolutely loved this spot, we stayed for two drinks because they were so yummy (we were bar hopping), my husband fell in love with the silver...",
   "Must go for happy hour!\n\nI've loved every drink I have tried here. Definitely my go-to place after a hard day's work. The bartenders always amaze me in how...",
   "Craft cocktails are so delicious! Midtown Houston is lucky to have such a great bar. \n\nStaff is ON POINT! \nHappy Hour GO TO!"
  ]
 }
]