[
{
 "name": "Grand Prix Tampa",
 "address": "14320 N Nebraska Ave",
 "avg_visitor_review": 2.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/99e3hULLzS3eLYnLypvCeQ/o.jpg",
 "tags": [
  "cheap",
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Five stars for the mini golf!!! \nA nice honestly cheap  date - $14 for one round of mini golf for two. This place definitely is like an older  style course...",
  "So the boys are getting to the end of summer and need something to do because it's been raining so often. My teenage son and several of his friends go over...",
  "A north Tampa fixture for kids and kids at heart.\n\nWhile I dont go here frequently, this is one of a few places you can go to kill some time without..."
 ]
},{
 "name": "Caladesi Island State Park",
 "address": "1 Causeway Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/jYIQh2phrzKEc45lktbRGg/o.jpg",
 "tags": [
  "hike"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Only accessible by boat, this island is the closest experience I have had to a Caribbean island. Situated on outside of the town of Dunedin on the Gulf of...",
  "This is such a perfect place to hike, head for the beach or just climb aboard a kayak and paddle board and cruise around the placid waterfront.\n\nNot only is...",
  "Do you want to escape the everyday stress? Hop the ferry over to Caladesi Island State Park! One of the keys off the gulf cost- Caladesi has beautiful..."
 ]
},{
 "name": "eBOATS Tampa",
 "address": "333 S  Franklin St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/-CNzc9fhbaspkpSBtORkzA/o.jpg",
 "tags": [
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "A group of us from church spent a day fabulous afternoon on the water with eBOATS. This was on my to do list for sure. The Riverwalk area in Tampa is...",
  "Great activity on the bay for families looking for something to do for fun. Reserving a boat is a great idea for families that give you an option of driving...",
  "KC was great! The boat ride was so relaxing and the view was perfect! Love the idea of being able to bring on food and drinks. Very safe ...Had my little..."
 ]
},{
 "name": "Tampa Bay Grand Prix",
 "address": "3404 Cragmont Dr",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/ces-koIDF0yW-JmVgcxCgQ/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Really fun you can ride Go-Karts and it's totally fun I would be suprised if any puts a 1star",
  "Well, listen y'all, it's hot as hell so I commend these employees working the tracks. Friday was lady's nights for $10 races and no membership fee. We let...",
  "I've never had a more miserable experience. After being told a 50 minute wait, we approached the desk. Turns out we would have to wait an additional 45-70..."
 ]
},{
 "name": "Flatwoods Park",
 "address": "42540 Bruce B Downs Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/Y3yCLsNuw_IutDFz8vjd_Q/o.jpg",
 "tags": [
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I freakin love this loop!\n\nFor a place to run, walk, bike, rollerblade and explore, this place is the best around.\n\nAccessible from 2 exits off I75, this 8...",
  "As someone who had not been able to ride a bicycle since age 13 due to an undiagnosed disability, the seven miles of park (which includes paved trails) in...",
  "Great paved biking trails. Convenient locations on Bruce B Downs and Morris Bridge Roads. Plenty of parking. $2 fee is a bargain. Rest rooms, maps, water..."
 ]
},{
 "name": "A Boat Day",
 "address": "",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/1x_fNKPevtNdL1xQWRxo0Q/o.jpg",
 "tags": [
  "family"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This past Thanksgiving we booked the Funship, a two story pontoon boat with a water slide for our extended family to enjoy Florida. Captain Randy...",
  "Captain Randy is great!  I'm very picky when it comes to boat charters and he was very friendly and educated.\nBelieve me you want to go with someone who...",
  "Captain Randy made our trip! We had such an amazing day on the ocean with him. He took us around to see the dolphins and manatees. We even saw a sea turtle...."
 ]
},{
 "name": "Gigglewaters",
 "address": "737 Main St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/4xtxZtqjdvxXSqv7DFIBJA/o.jpg",
 "tags": [
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This review is for Gigglewaters current offerings of curbside ordering. \n\nFirst up are the Sweet and Salty Popcorn - savory goodness of lightly caramel...",
  "This place has amazing food and great drinks! \nI'm giving it 4 stars instead of 5 stars because the placement of the bathroom was three feet away from our...",
  "Hubby and I took our son out for lunch on Wednesday for his 29th birthday.\nOur server was pretty awesome she was on top of her game!\nThe ambience was really..."
 ]
},{
 "name": "Raider Axe Lodge",
 "address": "5018 N Coolidge Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/FML28BkEOS-3GsYRiRYSzw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Raider Axe Lodge is nestled in between some warehouses and set up nicely. Perfect for events and my wife and I decided to set up her company Christmas party...",
  "I came here at the end of an event and man is it a great stress reliever. All my frustrations from the week were released when I threw my first axe. It...",
  "We had so much fun axe throwing. I was sceptical about this but we all had a blast! Frederick the owner does a great job. He was patient in teaching us..."
 ]
},{
 "name": "Weedon Island Preserve",
 "address": "1800 Weedon Dr NE",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/X_EP7OK-iKqc8kgpXrEnHg/o.jpg",
 "tags": [
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This was a really cool spot. If you like kayaking and paddle boarding, there are water trails for you. If you love hiking they have bridges everywhere.   We...",
  "I lived in St. Pete a long ago. I lived here for about 10 years. I never visited, nor heard of, Weedon Island.\n\nI would not have discovered it, if I had not...",
  "Was not expecting this place to be as beautiful as it was! The trails are clean and easy to walk! We accidentally brought our dog here when there was a sign..."
 ]
},{
 "name": "Odyssey Cruises",
 "address": "776 Dodecanese Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/2JxHL6GOcFTDdRnEResDQw/o.jpg",
 "tags": [
  "knowledgeable"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This was awesome! $18.99/person and we did a two hour excursion. We saw a few dolphins and they stuck around for awhile! Then we went to an island and got...",
  "Two hour sunset cruise from Tarpon Springs in  front of Hellas Restaurant.  Beer,, margaritas, water, rum runners were for sale on the boat. There was a...",
  "Great experience. Fun and knowledgeable captains. Great shelling on the island and we were lucky enough to see dolphins too! It does get windy on the boat..."
 ]
},{
 "name": "PedalPub St Petersburg",
 "address": "1975 3rd Ave S",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/Uilk7n9kKsiYKkv6Jb8FyQ/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "HIGHLY recommend!\n\nWe came down for a bachelorette weekend, and wanted to do a trolley pub as an activity. We are so glad that we did. The 2 hours truly...",
  "I had the best time! I was invited to a birthday party for a dear friend and she chose to celebrate with PedalPub! The day we were to go, the rain was...",
  "I celebrated my birthday by renting out a bike with my friends... best decision I've ever made! This experience was so much fun and I will recommend this to..."
 ]
},{
 "name": "Cheese Please",
 "address": "3225 S MacDill Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/ivtkSP99mpZ4ULhAJ9vu1w/o.jpg",
 "tags": [
  "tasting"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This place sets the standard for all wine and cheese places!! The owner is extremely friendly, and informative when it comes to which cheeses to order. I've...",
  "I visited Cheese Please with a group of 5 for a Friday evening tasting.  The tasting was Spain vs. Italy.  \n\nCheese Please has a small bar that you can...",
  "Cheese, meats and wine! What more could you ask for? We ponied up to the bar at Cheese Please on a rainy Friday night. This place is so cute!! You can pick..."
 ]
},{
 "name": "The Airosphere",
 "address": "622 Ware Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/Tgw--xDxelJmeOo9HVe_Gg/o.jpg",
 "tags": [
  "kids",
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Place was pretty darn cool! When here for my little nephews birthday party and enjoyed it. Not a lot of seating for parents not wanting to jump around, but...",
  "Super smaller than what I expected. Nonetheless a good time for kids on a rainy day. Super clean facility. I've been to a million inflatable gyms and...",
  "Such a fun place for kids of all ages! It's hard finding a spot for all of your kids to enjoy so I was happy my kids aging 2-10 all had a blast! The staff..."
 ]
},{
 "name": "Clearwater Marine Aquarium",
 "address": "249 Windward Passage",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/7ewnSpJ0wlhXlWzMGdRzGw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I love this Aquarium! I like that this Aquarium is set up to rehabilitate animals and make sure they are helping the wildlife in the area. \n\nI really...",
  "If you love marine life you'll love this aquarium. This nonprofit organization has fully embraced its role as education, entertainment and rescue facility...",
  "Holy moLy what a f--king disaster. If you can comfortably accommodate people then why not close until  or roper rEnovatiOns can be made. THis place is an..."
 ]
},{
 "name": "Bury the Hatchet",
 "address": "939 Oakfield Dr",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/CSSUiwOfzrKI_QeWjYPb2w/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Our niece was visiting and when we drove by she asked to go in and check it out. We left excited to come back at night and we ended up having such a fun...",
  "We had the greatest time here. The place was very impressive. It's very clean, big and spacious. David was our axe master and he showed us the ropes, walked...",
  "We had such an amazing time! I was actually pretty nervous to be throwing an axe, mainly because of it bouncing back at me. Well, after I threw and it stuck..."
 ]
},{
 "name": "Vertical Ventures",
 "address": "5402 Pioneer Park Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/5A3xFoJN3W1y5kX496Iwdw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Had a real fun time today at VV -Tampa. This was the first time my brother and I tried indoor rock climbing and their Intro to Belay class made everything...",
  "My friends invited me here one evening and I was pretty nervous. In addition to having no skill climbing or bouldering, I'm a little larger and have extreme...",
  "This gym is the bomb!   The bouldering area is huge with many options from level 1-10.  Several top roping courses and auto-belays to choose from and a..."
 ]
},{
 "name": "Cracker Country",
 "address": "4800 Hwy 301 N",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/YXL6w2a5klB_1Sox-6FpyA/o.jpg",
 "tags": [
  "historic",
  "learn",
  "field",
  "learn"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Cracker Country is my favorite part of the Florida State Fair. It's more like visiting a historic area, such as Colonial Williamsburg, where characters in...",
  "Great school field trip\nGreat way to spend an afternoon in an outdoor museum dedicated to Florida heritage and beginnings. Learn how to crack a whip, make...",
  "If you've never heard of Cracker Country, then you've never been to the annual Florida State Fair in Tampa. At Cracker Country, you will see and learn about..."
 ]
},{
 "name": "Henry B. Plant Museum",
 "address": "401 W Kennedy Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/ylqLsip7Ae5hAz5IaLFB7Q/o.jpg",
 "tags": [
  "free",
  "art",
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "For a few years, I been going to the Victorian Christmas Stroll at the museum because I usually get a FREE ticket. \n\nSome people do not know this but the...",
  "I'm trying to make good use of the membership that I got from the Tampa Art Museum. It allows you to get into many of the museums and sites around the Tampa...",
  "2/22/20 This is an absolute gem in the middle of Tampa!! It is part of the University of Tampa campus. The tour is of a  small wing of what was known as the..."
 ]
},{
 "name": "Improv Comedy Club",
 "address": "1600 E 8th Ave",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/5NzRJmhaQRLrICPJr2otKQ/o.jpg",
 "tags": [
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This was first time for my husband I visiting comedy club. We watched Mark Viera. Never heard of him except a small preview on YouTube before we bought...",
  "I would give the club, talent, service and seating arrangement 5 stars and the food 0. \n\nI recently tried the dip trio and became violently ill afterward. I...",
  "We come here regularly to see popular comedians we like. There are pros and cons to this place but compared to other improves I have been this isn't too..."
 ]
},{
 "name": "Tampa Bay Grand Prix",
 "address": "12350 Automobile Blvd",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/lQJdoUDLuk1lZ6NAlK_oNg/o.jpg",
 "tags": [
  "organized"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This is NOT a go kart track where you will be able to bump into others or drive crazy. Safety is strictly enforced. They stop you if you don't follow rules....",
  "We had a blast last weekend! We went pretty late but they squeezed us in and quickly went over the rules so we could do 2 laps. I haven't been go karting in...",
  "Ok a big thanks to Tampa Bay Grand Prix.  I got to go to my first official \"adult birthday party\".  One of my friends organized the party package for a..."
 ]
},{
 "name": "Tampa Museum of Art",
 "address": "120 W Gasparilla Plz",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/iiHDa0W7Kxy3GByX-OMSiA/o.jpg",
 "tags": [
  "art"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "A really nice museum, that's not the biggest, but very classy with large open spaces.  We were there for their 100 year exhibit and it was filled with many...",
  "The museum needs to step up its game. There are is not enough art or exhibits to justify the cost of admission. It takes at most 2 hours to go through the...",
  "This is a pretty small museum, or rather they have a small collection even though the building looks pretty big from the outside. It was kind of one of the..."
 ]
},{
 "name": "Brew Tours By Thirsty Pelican",
 "address": "7701 Blind Pass Rd",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/FPnUHMj5Vx3uEQy-VQlh1g/o.jpg",
 "tags": [
  "tour",
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We had an awesome tour, guided by owner Maris, in a Mercedes Benz Stinger...first class all the way. They pick you up and drop you off, no having to drive!...",
  "This was an amazing experience. They picked us up and drove us to all the breweries. We visited three breweries and it was such a great time. Our tour...",
  "What a fun, fun evening! As an avid craft beer drinker, a friend and I got on one of the first Thirsty tours ever. We were picked up from our hotel on Gulf..."
 ]
},{
 "name": "Capt Jared",
 "address": "",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/no68paLU9iuyfZ0o93lC2g/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Jared is the kind of dude you want to take you fishing. He's a great fisherman and keeps you on the fish all day. I will be back soon to test his fly...",
  "Great experience with this man! First time fishing in the area, he brought water, bait, coached our group of 4 on best-practices for the area.  Thank you",
  "If you want a top notch fishing experience, this is the guy that you need to go with.  Captain Jared is a local born and raised and knows the area like the..."
 ]
},{
 "name": "Ruskin Family Drive-In Theater",
 "address": "5011 US Hwy 41 N",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/HC_fwsemN0L8U_0KgdLYZA/o.jpg",
 "tags": [
  "family",
  "family"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We never go anywhere else. Best place for great family movie experience! Friendly. SUPER CLEAN! Comfy. Different than your average movie theater. Family...",
  "I love love love  coming to this Drive-In movie theater.  I've been coming for years and I hope to see it here for many more years.  I know it's tough to...",
  "My favorite place to see movies. This place is family owned and such a staple in the Ruskin area. I've been going here for over fifteen years and I can't..."
 ]
},{
 "name": "Tampa Bay Sup Stand Up Paddleboarding & Kayaking",
 "address": "110 Veterans Memorial Ln",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/ZTC-gMN76S8uhIzGvehbsA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Perfect day with a few hours to kill so I dropped by on a whim to get  out on the water. Hunter had me on my way quickly with fun, friendly, and...",
  "We took SUP lessons at the Safety Harbor location.  Great teacher, equipment and location.  It was very easy to get started up and our instructor was more...",
  "So this is not a well known tourist attraction..it should be.. cuz itd a really fun thing to do all year long..come check it out whrn you want to do..."
 ]
},{
 "name": "Florida Orange Groves Winery",
 "address": "1500 Pasadena Ave S",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/dshWRET9Kq7Eh5V_dOSmkg/o.jpg",
 "tags": [
  "winery",
  "winery",
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I have had Florida Orange Groves Winery bookmarked for the longest time. I was saving it for a fabulous girls' weekend...and then all weekends got...",
  "Fantastic winery! Not only do I love their wines, but they have great customer service.  I ordered some bottles for my over-worked sister since her birthday...",
  "Not the best wine or tour guides. Interesting variety but overall not the best experience"
 ]
},{
 "name": "Breakout's Imagine Escape Rooms",
 "address": "2830 E Bearss Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/Z7n_4D5bQcrb24gummfYxw/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "By far one of the best escape rooms I've been to! Robbie was our guide and he was incredibly helpful and personable! Thanks for making this such a great...",
  "Been to over 50 escape venues. This is in the bottom three in terms of customer experience. I've heard from others it was much better before Breakout bought...",
  "On a Sunday afternoon, we came up with the idea of tryiNg one of the escape rooms with my son. We called and scheduled an appointment or signed up online...."
 ]
},{
 "name": "Florida Botanical Gardens",
 "address": "12520 Ulmerton Rd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/btR7FtqmJAH4RxhDoc_F0w/o.jpg",
 "tags": [
  "free"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Florida Botanical Gardens is dog friendly and free (including free parking too). But donations are accepted and appreciated.\n\nI came here for a visit with...",
  "We attended the Holiday Lights Festival at the Florida Botanical Gardens and it was such a joy! \n\nWe went on a Saturday night which is their busiest night...",
  "This place is great during spring and holidays. The entrance has a giant fig tree loaded with fruit and massive shade leaves.  \n\nIt's a nice place to sit or..."
 ]
},{
 "name": "Parkesdale Farm Market",
 "address": "3702 W Baker St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/M2U0qYuwF1TRyXLC627HXQ/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This place is nice, but it was a bit too busy for me. There was a line all the way to the road.  You can find jams of every flavor there, and salad...",
  "I've passed the sign for Parkesdale Farm Market on I-4 at least several hundred times and never stopped.  This road side market is AMAZING, especially...",
  "We made a pit stop at Parkesdale on our way through Plant City and I'm so glad we did! Hadn't been there in years , and it was just as good as I..."
 ]
},{
 "name": "Captain Memo's Pirate Cruise",
 "address": "25 Causeway Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/e6JCKpFdR3ZziFP2VcRtcA/o.jpg",
 "tags": [
  "kids",
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This was great experience especially with a kiddo. The staff were great pirates and so attentive with the kids on board and had a lot of activities! We saw...",
  "The pirates tried to get us to participate in the shop and we had blast!!  The staff were wonderful and entertained the kids. Water guns and face paintings...",
  "We had a blast on Captain Memo's cruise! At first I was a little leary of going because the price was a little high but I am so happy we did go. The crew..."
 ]
},{
 "name": "Sarasota Jungle Gardens",
 "address": "3701 Bay Shore Rd",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/oVPsShwhSwkEm5sfVImZWA/o.jpg",
 "tags": [
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Cute place to spend an afternoon.  We were able to catch the bird show at the front of the park which was cute and the kids were enthralled with what...",
  "Anyone who knows me knows I am a flamingo freak.  I just love them - my favorite color!\n\nThis place has all kinds of animals, even reptiles (not my...",
  "Had a great time visiting with a friend for a few hours. Gorgeous birds\nFriendly staff\nTidy gardens and greenery\nWent specifically to feed the flamingos and..."
 ]
},{
 "name": "Bay Area Renaissance Festival",
 "address": "11315 N 46th St",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/diXeEZKZ3OaqZohsMsUQmA/o.jpg",
 "tags": [
  "delicious",
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We go here every year when the Ren fest comes to town. We absolutely love it!  Great food, delicious food, beer, cider and the best people\nWatching!  Fun...",
  "The Ren Fest is something I look forward to every year, however today I was disgusted with what I saw on a stage near the Highland Games area. A whole crowd...",
  "The Tampa Bay Area Renaissance Festival is open Saturdays and Sundays from February 16th through March 31st every year from  10:00am - 6:00pm. The festival..."
 ]
},{
 "name": "Glazer Children's Museum",
 "address": "110 W Gasparilla Plz",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/NgfpvXR6_cENYMEZfV-Udw/o.jpg",
 "tags": [
  "family",
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Not gonna lie, Blippi took us here.  His YouTube videos showed him playing at this huge children's museum, so our family had to go check it out ourselves....",
  "As long as your kid can walk, they'll enjoy the museum! There are so many fun and interactive exhibits that even the parents will join in on the fun. We...",
  "My son had a great time at this museum. Two floors of fun, imagination, and playtime. The first floor is all water activity related and we were on this..."
 ]
},{
 "name": "Electric Glide Tours",
 "address": "1805 E 9th Ave",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/hIFIknzEbia9xSHJpdpWAQ/o.jpg",
 "tags": [
  "history",
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Awesome experience. We went on Tuesday afternoon. Very informative local history. Russell was a great guide. Safety is a priority and they make sure you...",
  "Fantastic experience of new technology, great guides to help you get comfortable with the transportation and affable, amiable banter while discovering Ybor....",
  "An absolutely fantastic first time experience on a segway!  My husband, son and I met with Russell on a Sunday afternoon for a tour of ybor city.  Russell..."
 ]
},{
 "name": "The Shops at Wiregrass",
 "address": "28211 Paseo Dr",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/wF5MCLiPqdlTcTaKQeEfvA/o.jpg",
 "tags": [
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "What a wonderful four door mall. They have so many events, I love it. It's a beautiful venue to spend time. And I'm so excited for all the new additions and...",
  "Nice outside mall. There is ample parking, a decent array of restaurants, a good selection of shops and services, businesses that give up their lease don't...",
  "Muzak forced upon my ears so i can't hear the fountains and at most 5 food choices. I don't say restaurants because the best deal here is Pretzel Twist...."
 ]
},{
 "name": "Coconut Kayak Tours",
 "address": "719 Gulf Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/KSVGU5iu8yZBWIEQ2VpQtA/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "You know when you find a hidden gem activity that you would do over and over and over again.\n\nThis is it.\n\nKC picked us up from the hotel (who cares about...",
  "You really do get what you pay for, and would gladly do it again with KC!  Very nice Pelican Kayaks, quality oars and gear.  Lunch, snacks, and refreshments...",
  "First off I never actually used this service, but I did call and gather information. The owner was very nice and gave me lots of information for the trip I..."
 ]
},{
 "name": "Trey Rod Fishing Charters",
 "address": "5108 W Gandy Blvd Tampa",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/tiTy_0k2BQXxfDX-jiaigg/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This was an amazing trip from start to finish. I have been on many charters and Captain Trey was the best of the best from start to finish. He had..."
 ]
},{
 "name": "Tarpon Springs Aquarium",
 "address": "850 Dodecanese Blvd",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/1iCQKb7qhgPXyvwtZAGvoA/o.jpg",
 "tags": [
  "kids",
  "walk"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "This really is the best place to take kids. We tried to leave about a half dozen times, but our three boys wanted to stay longer! Paige and the other staff...",
  "This Aquarium is very old and smells pretty bad right when you walk in. The animals are in small and dirty enclosures. It's pretty clear no one cleans the...",
  "This aquarium is a total must! It's only $8 to get in (it is small but 100% worth it!) I have always walked by it but seen it was so small and never did it..."
 ]
},{
 "name": "PK's PlayZone & Grille",
 "address": "10019 W Hillsborough Ave",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/PyJSBt_Ze1iMNYkojtxwFA/o.jpg",
 "tags": [
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "We love this place. There is so much to do and the prices aren't bad. They have laser tag, bowling, a ninja course, rock wall, sky trail, mini golf, arcade...",
  "First tim here for a birthday party and there is somEthing for all ages. I'm not too suRe on the cost. There is zip lining, rock climbing, bowling, obstacle...",
  "Fun place to go for kids and adults alike. They have laser tag, ropes course, rock wall, ninja course, candle pin bowling, plenty of games with tickets and..."
 ]
},{
 "name": "Philippe Park",
 "address": "2525 Philippe Pkwy",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/5-w0y4Qt0a0st-pGaX9sVA/o.jpg",
 "tags": [
  "nature",
  "parks"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Oh we are so thankful for this park, especially during the quarantine. It was a bit of heaven on earth. \nSo nice to simply set and enjoy nature. \nThank you",
  "I visited here because an orginazation I belong to was having a get together. It was a bright, but chilly autumn afternoon, and the park was full of people....",
  "Being born and raised in Tampa, this has been one of my favorite parks.  The only negative is there is no turn lane at the entrance when turning left, which..."
 ]
},{
 "name": "The Worlds Largest Food Truck Rally EVER",
 "address": "4800 US Hwy 301 N",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/VbYhKF23ymVLHLjL0yTVmw/o.jpg",
 "tags": [
  "food",
  "food",
  "food"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "How could this be the World's Largest Food Truck Rally Ever? That's a joke to me. I haven't been to the prior ones, and this is the third one so from my...",
  "Yesterday I went to the \nWorlds Largest Food Truck Rally. \nTrying lots of different foods,\nIt was right up my alley!\n\nThis year's show of trucks\nWas a bit...",
  "Going to my first \"The world's largest food truck rally EVER,\" I was expecting something that lives up to the claim. Or even close? Actually I don't know..."
 ]
},{
 "name": "Cypress Breeze Farm",
 "address": "8690 60th St N",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/2GShSLqteCXzQ1Scwm0OxQ/o.jpg",
 "tags": [
  "tour"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "A lot of fun for a small price. Very friendly staff and really nice horses! \n\nThe trails were very pretty. Monica was extremely personable and knowledgable....",
  "Let me start by saying a tour guid will make or break an experience especially one like this, sad to say we were robbed of an enjoyable \"trail\" ride...",
  "My wife and I went to for a wonderful trail early in the morning. It was so peaceful and quiet. Our guide, Jules, made sure that we felt comfortable on our..."
 ]
},{
 "name": "Gasparilla Pirate Festival",
 "address": "Bayshore Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media3.fl.yelpcdn.com/bphoto/rWByjqA3-gxAuvW61s2C9w/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I love gasparilla! \nYou will see tons of pirate ship floats and catch beads no matter where you are.\n\nKeep in mind you will be using port-a potty's (it...",
  "I live in Miami but one of my good friends moved to Brandon . She heard about Gasparilla and wanted to give it a try. I must say that I really enjoyed it....",
  "Had an amazing time at the festival. The ONLY way to do this festival right is to have brunch on the boat (contact Yacht starship cruise). It's a pricey..."
 ]
},{
 "name": "Carrollwood Village Park",
 "address": "4680 W Village Dr",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media2.fl.yelpcdn.com/bphoto/1zPXYUIkrJjI896XzRP92A/o.jpg",
 "tags": [
  "family"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Our Favorite Park ! \nWe visit often \nWe love The Splash Pad on a Hot Sunny Day \nWe Never Forget Our Swimsuits ! & \nThe Hammocks for Relaxing & Watching...",
  "Been here a couple of times and it's nice, spacious and very clean. They even have a splash pad area which is great for anytime of the year here in...",
  "My family and I visited the Carrollwood Village Park as part of the Hillsborough County Hiking Spree. I was absolutely blown away! This park has everything..."
 ]
},{
 "name": "Horse Power for Kids",
 "address": "8005 Race Track Rd S",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/xV5qJxpt1048fmqPZOkzFQ/o.jpg",
 "tags": [
  "kids"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "I loved this place it is a little gem I highly recommend taking the membership if you have small kids they will really enjoy this little farm. The petting...",
  "Nice place off the beaten path. They have more animals than I thought. My daughter rode a pony, held a guinea pig and saw animals that she never thought...",
  "I don't think that they should have certain wild animals if they do not have appropriately sized enclosures.  The Wolf dogs, as well as many other animals..."
 ]
},{
 "name": "Indian Rocks Beach",
 "address": "1700 Gulf Blvd",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/F9rbORdAteFpH4m0MdTc0A/o.jpg",
 "tags": [
  "walking",
  "family"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Amazing little beach community! The beaches are super clean and inviting, the people are very friendly.\n\nThere are lots of restaurants in walking distance,...",
  "Indian Rocks Beach is my family retreat place!\nWe been coming here for many years and out of all the beaches we have vacationed at, this is by far the...",
  "My wedding took place at a cottage on Indian Rocks Beach. It was the middle of May and surprisingly a quiet weekend. The ceremony took place outside at..."
 ]
},{
 "name": "Vertical Ventures",
 "address": "116 18th St S",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/Arybze3G7TWbYw6IPVhc5A/o.jpg",
 "tags": [
  "learn",
  "tour",
  "family"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Up up! \nVertical Venues hooks you up with all the gear to safely climb. \nA fear of falling? That will be conquered here as you learn how to let go (and let...",
  "There is plenty of parking around the area of this gym, parking was not a issue at all for us. \n\nAs we came in we saw that the place is pretty nice and...",
  "When here last time night with the family, I have a 5 + 7 year old, and we had a BLAST!\nZarin, gave us our tour and we set to climbing. Such a fun activity..."
 ]
},{
 "name": "Dolphin Racer Speedboat",
 "address": "3400 Pasadena Ave S",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/sXBo9pLuMOJyOs_K_OCknQ/o.jpg",
 "tags": [],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Go go go, \nIf you do nothing else on the west side of this beautiful state, go to Dolphin Racer. You literally race with the dolphins. Capital Mike and his...",
  "Had a great time spotting leaping dolphins with Captain Mike and First Mate Julia. Temps in the mid 60s and overcast skies didn't stop the dolphins from...",
  "Super awesome experience! It was a scorcher out there, but the captains made sure everyone had plenty of water and offered cold towels for anyone needing..."
 ]
},{
 "name": "Tampa Bay History Center",
 "address": "801 Water St",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": "https://s3-media4.fl.yelpcdn.com/bphoto/qyoE9opLxSFl40hYAkAtww/o.jpg",
 "tags": [
  "history",
  "family",
  "history"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Tampa Bay History Center makes for a great family outing. We stopped in for the Brick History event and opted to become members for the added benefits...",
  "A very cool museum!! Multiple levels with so much to see and do.  Definitely need multiple visits.  \n\nWe were here for the lego exhibit and it did not...",
  "I was quite impressed by this beautiful museum right on the Riverwalk. There is so much interesting information here regarding the history of the Seminole..."
 ]
},{
 "name": "Margarita Wars",
 "address": "4121 N 50th St",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": "https://s3-media1.fl.yelpcdn.com/bphoto/MQaHVlyEHItEeaz1BsfQcA/o.jpg",
 "tags": [
  "delicious"
 ],
 "link": null,
 "source": "Yelp",
 "reviews": [
  "Such an awesome event I tried so many drinks and the atmosphere was amazing. I can't wait to go back next year. I will let the pictures speak for...",
  "Oh my goodness this event was so much fun! I was very happy that I purchased the VIP package which included 1 hour early entry and 2 draft beer tickets (...",
  "This was a fabulous event.  Tons of delicious Margarita samples with lots of friendly staff.  The entry process was very smooth.  The VIP area had great..."
 ]
}]
