[
 {
  "name": "New York State Museum",
  "address": "222 Madison Ave, Albany, NY 12230, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a27934a-932d-11ea-ab4a-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "history",
   "learn",
   "history",
   "organized",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13313036823836325564",
  "source": "GoogleMaps",
  "reviews": [
   "It is absolutely stunning museum with so much history in it. I am amazed with all the exhibitions and details that you can find there. Whole history of New York , old trains , cars , fire trucks , centuries of cultural development all in one place. Highly recommend for the whole family or to anyone really- true highlight of the Albany City . Best of all - it’s free of charge ( donation is appreciated). 5 stars",
   "From childhood to adulthood and across many states this museum has remained a favorite of mine.  The main floor exhibits have always been such a great way to learn about the NY environment and history.  I have always loved the adirondack displays and also the parts about metro life.  The Native American area is amazing.  This museum continues to bring learning to life and remind me of my roots a I have lived in Baltimore MD for almost 20 years now. The love of it has moved on to my children and we will continue to visit in the future.",
   "Lots of exhibits to see. Nicely organized. Poignant 9/11 exhibit. Excellent local animal exhibit as well as locally discovered mastodon and whale skeletons. Minerals and NYC historical sections also interesting.",
   "Gem show! Had a lot of fun. Harlem Display is a great educational tool. Just a relaxing place to be on a lazy Sunday. Good parking. And the Carousel!!!",
   "So we love it. It's a beautiful museum really clean awesome things to look at and explore. Only concern is my son is almost 5 I'm not sure how kid friendly it is. There is a kids part but it's pretty small"
  ]
 },
 {
  "name": "New York State Capitol",
  "address": "State St. and, Washington Ave, Albany, NY 12224, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a7629e2-932d-11ea-877b-14b31f159f22.png",
  "tags": [
   "delicious",
   "history",
   "tour",
   "historic",
   "tour",
   "library"
  ],
  "link": "https://maps.google.com/?cid=8263776940085683472",
  "source": "GoogleMaps",
  "reviews": [
   "If you’re visiting the area, it’s well worth checking out the capitol building. The craftsmanship and history of this building is pretty amazing. Photographs don’t do it justice. You need to see this with your own eyes. The detail in the stone carvings is a must see. The concourse that runs below the area is also pretty cool. You can stop in Logan’s and get a delicious sandwich while you’re there.",
   "Lots of amazing details went into the capitol building. It is a good architectural visit and see how the various architects created their vision over the very long time it took to build the capitol. Do the guided tour and also do the self-tour to get the most out of your visit there. There are so many things to look at and discover, plan to be there for at least 4 hours to discover as much as possible.",
   "How to rate this place? It holds some of the most courageous, dedicated, selfless people... But then it also holds some of the most disgusting, corrupt, and greedy.\n\n There is a cool museum inside though, and the Million Dollar Staircase is impressive.",
   "Beautiful historic place where State legislators come together to create legislation that governs our ways of life and social construct. It's an incredibly breathtaking architectural place worth visiting.",
   "We went on a weekday tour. It was just after a large High School group, and the guide took care to avoid them and the noise that came with them. Our group was just a few folks, so made for a very relaxed and quiet experience that encouraged observation and learning. We saw a good portion of the building and also lingered afterward to poke into a few spots we passed earlier for a closer look. There are lots of inconsistencies in the story of the Capitol's construction that prompt questions these days. Such as, how is it possible to be 8 million dollars over budget (total spent $12mil) after spending the initial 4mil, before the governor \"notices\"? Why did nobody \"notice\" after the project was $1mil over budget? How is it possible to lose a huge portion of historical records in a fire which specifically targeted the library, with a single victim who did not make it out? Weren't there fire safety precautions in place in case of such event? Was the fire an accident? How can you leave just a few stone carving elements unfinished, becoming an instant eye sore and looking embarrassing in the most important Chambers of the building, while the carvings on the staircases are finished? How can you make ceiling decoration out of paper when you know the roof leaks and you've got buckets on the floor to catch the water? Why install giant non-working fireplaces, when you know you need to heat the building in winter, so could use real working ones? There are still lots of questions to ponder and research, and the tour is just the beginning."
  ]
 },
 {
  "name": "USS SLATER",
  "address": "1 Quay St, Albany, NY 12202, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ac339dc-932d-11ea-a961-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "tour",
   "tour",
   "art",
   "history",
   "tour",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=393120351852663886",
  "source": "GoogleMaps",
  "reviews": [
   "John was our tour guide! Very knowledgeable and genuinely answered all of our questions enthusiastically. It truly is a hidden gem located in the heart of Downtown Albany : only 2 of these ships remain in the world, the one in Albany being the only one afloat, the other one in Galveston being on land. It felt like we were back in 1945 while touring this museum. I hope they keep the museum as it is as it represents an important part of our history.",
   "Phenomenal vessel, important ongoing mission, could not be a more dedicated group to care for her. Amazing to see her further restoration since my visit 17 years ago. Here are some shots from 2003. Keep up the great work. Long live Destroyer Escort USS Slater.",
   "This was a really cool land (or rather water) mark when we saw it. The tours were informative, captivating and well-incorporated the restored elements of the ship. Some of the restorations are really impressive - the size of the guns on top are quite shocking in-person. Our guide was friendly and went above and beyond to answer our questions after the tour was done. This was a really cool element of our trip to Albany.",
   "Awesome piece of history. The last floating destroyer in its class. Terrific guided visit that show the rough leaving quarter on board and the state of the art technology for ww2. Guides are passionate. The tour is fast pace and enjoyable and brings tons of interesting anecdotes. Definitively a good visit!",
   "Visited Albany to see friend from Detroit. It’s Friday afternoon and tour was conducted in small group. I love history and knew bit about WW2. However, It was first time I got to know the life of Sailors inside the ship during the war. Our guide was excellent and we learned so much. I’m not sure how I felt.... it was hard to imagine what young people went through... Must have been very steep learning environment for lots of them. Tour is  educational and also you get to relax by the riverside. \nFree parking and easy access to the building. \nDonations will keep going this great piece of history and education. Well recommended. :)"
  ]
 },
 {
  "name": "Albany Pine Bush Preserve",
  "address": "195 New Karner Rd #1, Albany, NY 12205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b1531ca-932d-11ea-94e6-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1217077071136101642",
  "source": "GoogleMaps",
  "reviews": [
   "The discovery center is great. 4 stars because it's kind of small but it's interesting and educational. They also have a small outdoor area to play and have separate rooms for different activities that they organize for children. Plus it's free!",
   "5 yr old granddaughter on break from school. Thought we'd be there a very short time. Almost 2 hours later we left after promising her we'd return another time. Staff wonderful, so much to do and see inside the building.",
   "Beautiful place stop to have a photo shoot with the family. Fall colors setting in on the leaves in the trees. Just absolutely gorgeous!!",
   "We went on a short nature walk it was my husband's cousin his two boys and myself we really had fun it was nice outside and it was nice to walk the trails and get some fresh air will definitely go again if I'm in the area",
   "Such an amazing place. Between the rare ecology and animal species and the miles and miles of trail that truly feel like wilderness this is an extremely special place. \nSad to hear that it used to be much larger than it is nowadays..."
  ]
 },
 {
  "name": "Dutch Apple Cruises & Tours",
  "address": "Broadway and, Quay St, Albany, NY 12202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b5fd0b8-932d-11ea-8cab-14b31f159f22.png",
  "tags": [
   "food",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15191457630927961732",
  "source": "GoogleMaps",
  "reviews": [
   "A cool way to spend a hot afternoon. Nice ocean and river breezes provide relief from the heat.  However you only get the breeze going one way on the river. This day when we were coming back there was no breeze and it was very hot.  The historian, Pat provided interesting stories along the way. My wish was that the cruise could have been longer.",
   "An Amazing experience!! I live in the city, and being able to go on a cruise like that was really fun. There are food onboard as well as drinks. Absolutely recommend it for others.",
   "Q103 Pirate Cruise of 2012--- We were invited to a pirate themed cruise on the Hudson, which turned out to be pretty amazing. Games, drinks, new friends, and more down and back! I am not sure if they do these anymore, but it is worth looking into!",
   "Relaxing boat ride with a bar in the back of the middle level. Shade for all three levels, great PA system for the tour guide. Wish the ride was more scenic than the industrial scenery of Albany. Once we got past this, it was great to see the old mansions and our tour guide spotted a bald eagle in the trees bordering the Hudson.",
   "Very informative cruise....we learned a bit about the history of Albany and got some pictures of American eagles....at 20 bucks each it was good value. The bar had a good selection and the staff was friendly."
  ]
 },
 {
  "name": "Capital Holiday Lights",
  "address": "Madison Ave, Albany, NY 12203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ba53f8a-932d-11ea-bc12-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "kids",
   "family",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3146226423107524636",
  "source": "GoogleMaps",
  "reviews": [
   "It is a great place to spend time with friends. I go there on field trips each year before Winter break. There are a lot of different lights to display. That even have light up Christmas trees. There are polar bears displayed. There is also an elephant helping santa load the sleigh.",
   "It was our first time here we will be going every year the day after Christmas as a tradition from now on. The lights were beautiful everything is really well done... The hot chocolate and the crafts inside are awesome also.",
   "It's a fun family car ride with lights where even my littlest one couldn't get enough lights. The vendors are local and have been the staple of a good market to check out after the lights. Now a family tradition when we are visiting home for the holidays.",
   "This was one of the best light shows I've ever seen. It's awesome because the kids can get out of their car seats as you slowly idle around what seems like miles of roads and light displays. many of displays are animated and there's always a new surprise around every corner. this was the first year we went, but we plan to make this a yearly family tradition. The line can be quite long so make sure you bring some entertainment for the kids while you wait. it took us about two and a half hours from the time we arrived until the time we had completed the entire circuit.",
   "Every year the park does an excellent job lighting up the park with beautiful and enjoyable holiday lights. It is great walking through the park at night or driving your car through or running. Our son lives across from the park and the lights are enjoyable from his apartment. Albany does a great job carrying for their parks in general."
  ]
 },
 {
  "name": "Albany Institute of History & Art",
  "address": "125 Washington Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8bf92d7a-932d-11ea-8943-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "art",
   "history",
   "art",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=12617233855426390701",
  "source": "GoogleMaps",
  "reviews": [
   "Great smaller museum. We've been to many events: First Friday free (night hours), Schuyler Sisters (best exhibit yet), local Victorian wedding dresses exhibit, Hudson River School exhibit, permanent mummies and ancient Egyptian and many others. Lots of kid activities accompany each visit. Snack bar great. We love this museum.",
   "I was expecting this to be a great museum, I didn't realize how great it would be.  I was blown away by the Hudson River School gallery, totally awestruck.  My kids loved the dioramas.  Mr wife liked the art made from reused materials, like acorns and pistachio shells and tea bags.  Very cool, strongly recommended.",
   "Only one floor was open when I went recently, as exhibitions were being swapped out in the other, but there was still plenty to see (and the admission price was halved due to there being the one less floor) anyhow.\n\nThe flow of the place lends itself well to easy meandering, the staff is very friendly and helpful and the exhibits themselves are well-curated.\n\nAnd at only $10/person for adults, it’d be worth coming a few times a year.",
   "This place is one of the most unsung wonderful places in the city of Albany. It's so well laid out. Very handicap friendly parking and display access. 3 floors of beautiful art work and the history behind many of the pieces is detailed and well written. The Jewel of this summer at the institute is the display of the Hudson River school artists. Painting after wonderful painting presented with an instructive guide provided by the museum, that tells you exactly what each picture is of and who it's by. I found this incredibly helpful. There Egyptian area was surprising. It's nice to know that one doesn't have to go to New York to see an incredible and detailed display on ancient Egyptian culture.\nCome early and plan to spend several hours here. There is a gift shop,of course and a snack bar  that has limited beverages and Rich deserts. But a little thin on healthy snacks and food items. There are displays after interesting displays and one day doesn't seem like enough time to spend at such a rich and enlightening space.",
   "While quite small, the quality of exhibits was quite high, especially considering the size of Albany.  The Louvre it is not, but well worth a trip! The docent at Reception was very knowledgeable about the exhibits and super nice. Bonus, they have their own parking lot around back so you don't have to fight the dreaded downtown Albany parking situation!"
  ]
 },
 {
  "name": "Ten Broeck Mansion",
  "address": "9 Ten Broeck Pl, Albany, NY 12210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8c43801e-932d-11ea-8e40-14b31f159f22.png",
  "tags": [
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10105865041824720904",
  "source": "GoogleMaps",
  "reviews": [
   "A National Treasure in the Heart of Albany this Amazing landmark mansion is an absolute delight! The gardens are open year round offering a beautiful green space for the urban surround.  Magnificent views during fall and winter.  The Board members are above and beyond passionately committed to the mansion and their preservation of it. A worthwhile place to endow your support.",
   "A lovely secret garden hidden in the middle of downtown Albany. There was no one else there for the better part of an hour. Plenty of space to lounge about, surrounded by greenery. ",
   "The tour guide is a little short but I  understand it is a volunteer place beautiful place lots of history",
   "Went to see \"The Ideal Husband\", and it was wonderful! We stayed on the first floor, the mansion was beautiful, and the actors were great - all around fantastic.",
   "this is a true hidden gem of Albany. There is something to see here no matter the season - from Santa to flower blossoms to fall foliage."
  ]
 },
 {
  "name": "Far Shot Albany - Axe Throwing/Archery/Knife Throwing",
  "address": "69 N Pearl St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8cb1d424-932d-11ea-9ba0-14b31f159f22.png",
  "tags": [
   "unique",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10275427401187004405",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I went for a little date night and had the best time ! Our coach was Tom and he helped make the evening even better! He not only taught us how to throw safely but how to progress each time. He also spiced it up turning into a game really adding to the fun. \nWhether you are doing a date night, a friend's night out or a party we HIGHLY suggest!! We also found out they have leagues which is some thing we are definitely looking into! \nGuys if you are not going here you are missing out 5/5 HIGHLY RECOMMEND ♥️",
   "This place was so great! I went there with my Mom and friend and we had a blast. None of us knew how to throw knives or axes before but our instructor Erick did a really good job. He's an excellent teacher and helped us to improve our technique. He was also very accommodating with scheduling our time.\n\nIt's a really fun activity and I would definitely go back. 10/10 would recommend",
   "A unique place to go to burn some energy! Jess was an awesome teacher for sure. Great memories created and a cool place to tell your friends about!!",
   "FANTASTIC place to go. Incredibly fun, both for kids and adults, safety is the #1 priority, nobody was injured. Axe throwing is very fun and competitive. Don't worry about not being good at it or thinking it'll be heavy, a couple practice throws and the right technique, you'll do great, especially with an instructor like Ashley/Axeley. Can't wait to go back.",
   "This place was so much fun! I can't remember our coaches name, but she definitely helped make the experience even better. She gave us tips and walked us through how to properly and safely throw axes along with hitting the bullseye. We will definitely be going back some time soon!"
  ]
 },
 {
  "name": "Cathedral of the Immaculate Conception",
  "address": "125 Eagle St, Albany, NY 12202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d2be858-932d-11ea-8204-14b31f159f22.png",
  "tags": [
   "music",
   "free",
   "free",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=16213845401188594968",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to hear a sacred music concert. Architecture and design is stunning.",
   "Beautiful.  Free admission.  A sacred place right next to our infamous Governor's mansion and mere steps from the NYS museum.  Stop by.  All are welcome.",
   "Beautiful place from inside and outside! It's free and you can take your time. When there's no session parking it's free and very central from other sightseens. I recommend to go to the museum next to the church first, because it closes at 5 and it's worth it!",
   "Truly not only Majestic but also humble in accessibility always open to the public , welcoming and Peaceful oasis in the heart of Albany.  A real treasure!!",
   "Great worship place. The head priest have a gifted tongue, he make the bible come to life when he reads the gospel and delivers homily. A must go to place, very historic and great architectural arches"
  ]
 },
 {
  "name": "Discover Albany Visitors Center",
  "address": "25 Quackenbush Square, Albany, NY 12207, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d894c50-932d-11ea-a09c-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1139675757152422150",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent location, exhibits, and helpful and knowledgeable people. Great background for the settlement and development of this area",
   "Fun time spent with my daughter learning about planets and stars",
   "Helpful staff provided great tips on how to spend a day in downtown Albany and offered pointers on walking tour highlights. In addition to maps and brochures, the information centre has a surprisingly large exhibition on the history of Albany. ",
   "Very helpful and friendly, especially Patti, who I dealt with :)",
   "Great little visitors bureau and free museum."
  ]
 },
 {
  "name": "Lincoln Park",
  "address": "228 Eagle St, Albany, NY 12202, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8de7c1c0-932d-11ea-9fb7-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15946237342816421200",
  "source": "GoogleMaps",
  "reviews": [
   "Love this park.  My Buddy 🐕and I walk there all the time.  Always clean and I feel safe there.",
   "Great place to relax away from the hustle and bustle of Albany NY. I was a bbn to knock down 2000 steps in this beauty. Very nice place to walk your dog or just lay back and reflect on the day.",
   "Love the pool, the space for the kids and adults to play. Love the playground, specially in the summer when the sprinkler are on.. Lincoln park is a very clean and nice place to have a great family time..",
   "Love this Park You better visit it before it disappears. The city of Albany is trying to get rid of it.",
   "Great place to work 10 **********"
  ]
 },
 {
  "name": "Irish American Heritage Museum",
  "address": "21 Quackenbush Square, Albany, NY 12207, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e406aa8-932d-11ea-8ddd-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "history",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=588103803134959414",
  "source": "GoogleMaps",
  "reviews": [
   "I would like to have more time to spend here! They are doing some really great stuff with concerts and other events!",
   "First time there. Friendly and outgoing people. Wonderful time there. Many items to buy and lots of books with Irish history \nI will be back.",
   "A great place to learn about Irish history and local Albany facts. We parked right outside the door and spent over an hour inside.",
   "A fabulous little place! Great building!",
   "Interesting about the Irish in Albany and about Albany itself. Very knowledgeable staff."
  ]
 },
 {
  "name": "Six Mile Waterworks Park",
  "address": "135 Fuller Rd, Albany, NY 12205, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e8d2c78-932d-11ea-90a1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "kids",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6121460926007194174",
  "source": "GoogleMaps",
  "reviews": [
   "The food is delicious, especially the chicken and lamb. Love the chickpea appetizer as well. The service is great. They always get our order right and they are super friendly.",
   "Great little oasis within a busy area.  Easy to get to,  great fishing spot for kids or inexperienced.  Nice long paved walking and/or biking path.",
   "Nice and relaxing place to take photos. I have even seen people ice fish when it is colder out.",
   "Nice little park with few swings and a beautiful pond.  There is a picnic area but its not maintained properly.",
   "This little spot has been a favorite of mine since I was a kid. For me, it's just the solitude and catching sunsets. But for everyone else, it's got a few nice trails around the reservoir, a bunch of public bbq grills and picnic table, a decent playground area for kids. It's a nice respite from the hustle around it, and it connects to trails into the Pine Bush as well."
  ]
 },
 {
  "name": "New York State Executive Mansion",
  "address": "138 Eagle St, Albany, NY 12202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8eded064-932d-11ea-8c95-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=9141384314294806730",
  "source": "GoogleMaps",
  "reviews": [
   "Fun and educational",
   "Heard it's cool but it's almost impossible to get in there. Doesn't seem like it's the people's house at all. But my taxes pay for it.",
   "The average public is not allowed there.",
   "Nice looking building",
   "Muy cierto lo que dice el caballero , es un lugar lleno de paz y tranquilidad. Wow, les recomiendo tambien"
  ]
 },
 {
  "name": "The Children's Museum of Science and Technology",
  "address": "250 Jordan Rd, Troy, NY 12180, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f315eb0-932d-11ea-b6c0-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18167602598475854358",
  "source": "GoogleMaps",
  "reviews": [
   "Hello Katlean is very friendly and accommodating. But I was informed by the day manager adults must be accommodate by a children. It a rules . That I was not offended by . But very disappointed to explore and recommend this Museum. Public to pay 8.00 for cost. While you where enjoy your day. It should be posted on site. Parents did not look offend by present. I even laugh with another mom and boys getting in canoes. Smile laughter. I am confidant mom and grandchildren 7. But mine grew up for this ages group. Toddlers and kindergartners age group perfect. Katlean 10 plus . you have very polite and special.",
   "You can play with everything here! It's so hands on and amazing for kids. Learning never stop nor does the fun! I had more fun than my own kids did!",
   "Nice children's museum, perfect for under age 10 and good for about 2 1/2 hours if you help your children to interact with some of the exhibits. If you just let your kids run through you will be done in half that time. Museum looks a bit worn and the animal area was about 3/4 full and the glass really needed cleaning. Friendly staff and reasonable price.",
   "The children's museum is a very nice place to bring your child between the age of 2 + 9. They have a lot of Hands-On activities and the staff there are very pleasant. You could probably get there through the whole place with your children in an hour and a half.",
   "While all ages can appreciate it, its geared about 10 to 14 year olds. Many exhibits have pretty detailed reading at that age level. Lots of room and not that noisy even on Saturday"
  ]
 },
 {
  "name": "Buckingham Lake Park",
  "address": "39 Berkshire Blvd, Albany, NY 12203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f79b3a2-932d-11ea-a6fc-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4795010848788714910",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful park. Quiet, not too many people and scenic. The lake is very nice and has a couple of fountains as well. You will see a family of geese chilling somewhere which is awesome. There is also a playground if you have kids that you want to bring to this park.\n\nOverall, the park isn’t all that big but has everything you could ask for from a park. A nice trail, trees, lake, quiet atmosphere, animals, and parking area. If you’re in the Albany area, definitely check this park out. I’ll definitely be back if I’m in the area.",
   "I have been going here since I was a little boy. My grandparents lived two houses in from the pond/lake on Lenox Ave. I remember fishing with my grandpa, skating in the winter, and now I take my kids here. The new playground is nice and the picnic tables are good for bringing a lunch. Glad to have a place like this to come to.",
   "Very nice park and walking paths. Awesome new playground.  Calling it a Lake is a pretty big stretch . It is a man made pond.",
   "Buckingham is great for running or exploring. I fish in the pond and I find that it has ample fish population to keep me busy. The recently updated playground is very nice and has multiple levels of size for all ages.",
   "We love it here. It's got great equipment on the playground for the kids and a nice walking trail along the pond."
  ]
 },
 {
  "name": "American Italian Heritage Museum",
  "address": "1227 Central Ave, Albany, NY 12205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8fd902a6-932d-11ea-ad61-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=16706196643614267444",
  "source": "GoogleMaps",
  "reviews": [
   "Love the intimate atmosphere ! The curator  had a great knowledge of the history of Italian immigrants. A must-see for all Italian immigrants stopping by in Albany. It truly is a gem that immigrants can relate to their own life and experiences. Also very informative.",
   "Fantasticly preserved heritage of Italian-American heritage and of the Albany area.",
   "Interesting photos and memorabilia.  Fun Italian classes.",
   "Awesome museum and presentations!",
   "Great location 👍 Lots of valuable information."
  ]
 },
 {
  "name": "The Crossings of Colonie",
  "address": "580 Albany Shaker Rd, Loudonville, NY 12211, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90207a92-932d-11ea-9723-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walking",
   "kids",
   "walking",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17136778740795866488",
  "source": "GoogleMaps",
  "reviews": [
   "Such a beautiful well maintained park. The trails, park for everyone of all ages, lawn area for frisbee and picnics and of course the large gazebo and the gorgeous pond of fish. This park is truly a surreal and great place to relax and hangout for everyone in the community. I do some of my photography shoots here and it’s just so beautiful. My cousin had his wedding here and I photographed it for them and the turnout was truly amazing. Love the Crossings!!",
   "This is one of my favorite spots, all year around, to visit in the greater Capital District! Its great for outdoors parties, community events, casual walking, or even avid runners! Its beautiful forest trails and gorgeous pond full of fish and fowls! \n\nDefinitely worth a trip to enjoy a little walk or even a picnic with the family!",
   "Park is really nice with a great play area for kids and really nice walking tracks. Just the pond with ducks and fishes is too dirty. They need a way to clean that water.",
   "Nice park to enjoy with your family and friends. Beautiful and serene location in the midst of a bustling city. A must visit location.",
   "It is a great place to go and walk or watch ducks and fish.  I love taking my dog for walk there."
  ]
 },
 {
  "name": "Historic Cherry Hill",
  "address": "523 S Pearl St, Albany, NY 12202, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/906c7924-932d-11ea-9bd5-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "creative",
   "knowledgeable",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4656955246605834584",
  "source": "GoogleMaps",
  "reviews": [
   "Has a great annual Albany History Fair in Spring and halloween mystery tour in Fall. Besides the garden, there is a hidden lawn that is great for spring picnics.  Interior has beautiful wallpaper and you might leave and decide that you need wallpaper in your house.",
   "the volunteers do such a good job here and they're always trying to think of new, creative ways to make the site hip and fun.",
   "Great museum. Beautiful exposition.",
   "This is a great historic house museum. Friendly and knowledgeable staff, great stories and cool collections. Check it out!",
   "It is beautiful inside"
  ]
 },
 {
  "name": "Shaker Heritage Society",
  "address": "25 Meeting House Rd, Albany, NY 12211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90b5df92-932d-11ea-90d8-14b31f159f22.png",
  "tags": [
   "learn",
   "knowledgeable",
   "history",
   "tour",
   "organized",
   "walk",
   "knowledgeable",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=15017658558667633755",
  "source": "GoogleMaps",
  "reviews": [
   "I give this high marks for the passionate volunteers who work at this sweet underfunded museum.  \n\nIt would behoove the City of Albany to caretake the buildings they have left to rot, shame on them.  I think due to the ramshackle quality of the surroundings buildings many tourists  in the area who want to visit  a Shakers community choose instead to visit the Hancock Shaker Village , a living history museum preserved for generations.  The Shaker story is of high interest and tourists want to learn about this communal lifestyle that has few remaining communities.  \n\nI am glad I was able to meet this small but enthusiastic group of knowledgeable and avid Shaker history buffs.",
   "My mom Worked there when I was a child\nAt Ann Lee Nursing home up till the day the moved all the resident's to the New Albany County Nursing home.\nGreat memories going to work with her at both places.\nThe Building is amazing just sad to see it left the way it is \nBut the grounds are amazingly kept and it's beautiful there.\nGhost Hunter's may like to check it out.\nGot some good pics during my day trip.\nAlso visit Ann Lee's Grave. As well as the pond. \nYou will enjoy it.\nBut I love it so much for the memory of my mom and I working her 3 pm to 11 pm shifts.\nMiss those days and her.",
   "Nice educational tour, custodian great, well organized",
   "Great place great people",
   "I know the volunteers her do their vrry best operating this site,  but it is a shame Albany doesn't provide them with adequate budget to maintain the place as it should be. This is the original Shaker site in America and the founder, Ann Lee is buried here. A place of such historic importance deserves far better preservation than this one is getting. Every other Shaker village in the country has a private foundation to see to its upkeep, but this one is owned by the city of Albany and it is starved for the funds it needs. I love the place and visit it frequently, but it is heart-breaking to see many of the buildings needing repair. It would be nice if the volunteers would organize some \"Hands to work, hearts to God\" days, when people from the community could come together to apply fresh paint, make some simple repairs, and so forth. But, back to the review--the museum and gift shop are very good. The orchard and cemetery are worth the short walk, the critters in the barn are fun, and the herb garden is very well maintained. They have a holiday craft fair coming up that lasts four weeks, has some great craft item, at very good prices, which I recommend highly. The staff are friendly, knowledgeable, and helpful."
  ]
 },
 {
  "name": "Funplex Funpark",
  "address": "589 Columbia Turnpike, East Greenbush, NY 12061, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/910ba234-932d-11ea-8248-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1678601756408158989",
  "source": "GoogleMaps",
  "reviews": [
   "A nice little getaway for a few hours that’s fun and genuine. Alison and Scott, the owners, are exceptionally nice, and if you have any issue they are more than happy to give you excellent customer service. There’s so much to do, and my family loved visiting and look forward to coming back!\n\nI recommend the go karting, rock climbing, and mini golfing, and if you have little kids then the mini go karts look really fun!",
   "This is a great place for the entire family and includes go-karts, a batting cage, a rock climbing wall, a bungee jumping trampoline, a miniature golf course, bounce house, a motorboat course, a mini go-kart course and the water balloon and also a snack concession stand and there are also multiple other little things to do. This place is a great place to host a birthday party provided it's during the season. The only thing that this place could improve is its cleanliness and maintenance which is why I'm only giving it 4 stars. There was puddles of water in the bounce house and other places and it could have been maintained a little bit better",
   "Certainly not what we were expected. Half of the attractions are in need of maintenance. Our kids wanted to use the bounce house, after we paid for them to go in. They did one round through and stated they did not feel safe because there were so many holes. Go carts were fun, but on a very tiny track. Will not be returning any time soon. Experience was not worth the $30 spent.",
   "Great place for an inexpensive kids party!  Hosted our son's 3rd birthday here last week and everyone had a great time.  The bounce house was too wet because it had rained the night before, so the kids rode mini go-karts instead.  They had a blast!  The mini golf course is one of the more inventive in the area, and there was a lot to do and see to keep a pack of small kids busy.  Will definitely be returning for more early fall fun!",
   "Decent play place to spend a few hours. Not much of a wait while we were there. The only part i didn't care for is when there wasn't a line for an attraction the attendant went to the main check in and had to ask for someone. Good local place for kids."
  ]
 },
 {
  "name": "Burden Iron Works Museum",
  "address": "1 E Industrial Pkwy, Troy, NY 12180, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/91530cee-932d-11ea-acf5-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "tour",
   "free",
   "knowledgeable",
   "history",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=16227844182764057434",
  "source": "GoogleMaps",
  "reviews": [
   "Exploring and enjoy sharing my adventures worthy place take children. When they think how boring life is and how more experience they learn and fun time.",
   "Fascinating the building is nice with a good tour guide and artifacts",
   "Call and set up a free tour! Sometime available same day. Great curator!",
   "Went here for a quick visit after Google recommended it as something to do in Troy. And... It was awesome! The curator was extremely knowledgeable and even entertaining. There are lots of cool, old machines, bells, and other historical items, and even more to be learned of what defines Troy's significance in history.",
   "Great place to visit. A small location but surprisingly large collection of historical artifacts with a very knowledgeable curator. Well worth the time to visit!"
  ]
 },
 {
  "name": "Opalka Gallery",
  "address": "140 New Scotland Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/91a1a36c-932d-11ea-90b9-14b31f159f22.png",
  "tags": [
   "art"
  ],
  "link": "https://maps.google.com/?cid=10387429704054419172",
  "source": "GoogleMaps",
  "reviews": [
   "High quality exhibitions and public programs. And a wonderful community partner, hosting events and screenings for other Albany organizations. They have a terrific staff!",
   "Lots of possibilities in presenting art are provided by this gallery.",
   "Small and intimate place. Great acoustics.",
   "They always have fabulous presentations.   You can go every couple of months and see something different.",
   "There were many thought provoking pieces."
  ]
 },
 {
  "name": "Crailo State Historic Site",
  "address": "9 1/2 Riverside Ave, Rensselaer, NY 12144, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/91e69cf0-932d-11ea-be40-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7332209756803206668",
  "source": "GoogleMaps",
  "reviews": [
   "TODAY WE DIDN'T PLAN ON STOPPING AT THE CRAILO BUT WE GLAD WE DID. WE WAS THE SCHUYLER HOUSE FIRST AND THE TOUR GUIDE TO US WE COULD GET A PACKAGE PRICE IF WE WAS BOTH PLACES. SO WE GOT TO SEE BOTH HOUSE $14. $7 DOLLARS FOR EACH OF US TO \n E TO GREAT HOMES. THATS A DEAL IF YOU ASK ME. THE TOUR GUIDE \"SAM\" WE EXCELLENT AND FRIENDLY. AND GAVE US A NICE HISTORY LESSON ON THE HOUSE ANDTHE COLONIAL DUTCH IN THE HUDSON VALLEY. THE HOUSE WAS BUILT IN 1702 AND HAD TWO OTHER ADDITION IN LATER YEARS. BUT THEY THINK THERE MIGHT BEEN ANOTHER BUILT HERE ON THIS SITE BECAUSE PARTS OF THE FOUNDATION WAS BUILT AROUND 1660.",
   "This is a little known treasure about the first settlers of New Amsterdam and New Netherland. Rachel was a great guide and a plethora of information. I just learned that my paternal and maternal ancestors were original residents of this area. I will go back again soon.",
   "Great little museum offering insights into the Dutch history in the upper Hudson valley.",
   "Cool place! Wish there was an interactive aspect somewhere",
   "Brilliant historians, beautiful place, engaging exhibits and artifacts. This is THE best exhibit for life during the time of New Amsterdam, as well as for learning about colonial slavery. Learned a lot about the founding of our nation's history here. Really smart people work there and are a great guide. I actually went back twice."
  ]
 },
 {
  "name": "Falls View Park",
  "address": "231-341 N Mohawk St, Cohoes, NY 12047, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/923fe22e-932d-11ea-b90a-14b31f159f22.png",
  "tags": [
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12301839518745393915",
  "source": "GoogleMaps",
  "reviews": [
   "Great views of the falls, but sometimes hard to find parking on nearby streets. Lots more water after the Erie Canal closes for navigation late each fall. Plenty of signage for the old Erie Canal nearby. It originally took 16 locks to get around Cohoes Falls and it took all day to go only a couple of miles. Great engineering feat and one of the last parts of the canal to be finished.",
   "We have been chasing waterfalls for many years every area we visit we typically search for waterfalls in the area this was one we had been trying to get to for quite some time and glad we did! I thought it was a really great idea for all the life saving floats to be placed throughout the park I'm case of an accident you dont see that at too many parks. It was clean and it had multiple visitors in the hour we wandered around, great experience",
   "We're fortunate to have such a beautiful waterfall so close to home. It is a quick stop, and a nice place to sit and enjoy the sound of the waterfall. Best time to visit is right after a rain or after the snow begins to melt.",
   "Really beautiful spot. Easy to find and nearby parking. I'm happily surprised that there is not all sorts of touristy stuff for sale on the grounds. A few benches, but not much space for picnicking.",
   "The park could really be amazing if worked on. The view of the waterfall looks small in pictures, its much bigger in reality, kinda surprising when you get to see it. The place looked like it was not taken care of. It's a very small park, you can't spend much time here, there really isn't anything to do. The main advantage of this park is the view, and it could really be amazing."
  ]
 },
 {
  "name": "Thacher Park",
  "address": "1 Hailes Cave Rd, Voorheesville, NY 12186, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/929e3054-932d-11ea-8747-14b31f159f22.png",
  "tags": [
   "family",
   "hike",
   "sightseeing"
  ],
  "link": "https://maps.google.com/?cid=3360928457972531157",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place in great experience",
   "We had some chicken BBQ; the area was super clean and quiet, we enjoyed the weather and little rain, restrooms 🚽 unbelievable clean, big thank you and great job to all employees and management.\n😎😋",
   "So many places to picnic and grill. There are covered pavilions. They are picnic tables and benches everywhere. Bring your own grill or use the ones in the park. Go to the Visitor's center for activities and sight seeing. \nPaid parking. $6 I believe.\nMany trails.\nNo trash cans available. Take home whatever you bring. A family left a whole bag of trash at the park, and it was disgusting. Not much staff to pick up after people.",
   "Visited this park on a weekday recently (mid october, 2018). It's a beautiful place with nice vistas of fall foliage. There's also a short hike to see a few waterfalls.",
   "I, I think this is an excellent place for hiking and sightseeing"
  ]
 },
 {
  "name": "Ridgefield Park",
  "address": "316 Partridge St, Albany, NY 12208, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93111870-932d-11ea-be28-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17237252271200969825",
  "source": "GoogleMaps",
  "reviews": [
   "I actually love this park. It's this intrusive Google thing I hate. Why would it want a review of a barren, snowy, cold park, almost totally unusable until maybe April? Obviously they want to take over our privacy and our lives so they can make as MUCH MONEY AS THEY CAN AT OUR EXPENSE.",
   "My 2 sons enjoyed it and it was just a last minute thing to do.",
   "Nice place to make party during summer",
   "The park is my canvase.every day I come in to work I give everything I can to keep our Park safe and clean😀",
   "Good memories with friends great place for reunions!!!"
  ]
 },
 {
  "name": "miSci - Museum of Innovation and Science",
  "address": "15 Nott Terrace Heights, Schenectady, NY 12308, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/938fe7be-932d-11ea-b499-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "history",
   "learn",
   "kids",
   "family",
   "kids",
   "learn",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4651625280074331854",
  "source": "GoogleMaps",
  "reviews": [
   "This was a cool place to stop and learn about some Schenectady history with American locomotive as well and how old homes looked.  There is usually a Groupon which is 20 for a family of 4.  Electrical show was 4 per person and the planetarium was 6 per person.  Overall we had a good time.  It's not very big but there are a bunch of different shows for the planetarium and even a Nasa simulation area.",
   "Such a great place for kids and adults to learn together! We went to see the toy exhibit, and enjoyed the collection immensely. The kids had a blast learning from all of the hands on science exhibits and we're excitedly talking about their favorite ones, and what they learned from each of them. It was a full parking lot when we got there but it never once felt overcrowded or chaotic inside. Great place for the family to enjoy an afternoon of fun education and new experiences, highly recommend!!",
   "Having not been here in years MiSi is a great place to bring the kids. They offer a planetarium and different hands on activities for kids of all ages. I highly recommend this place for a rainy day or just for something different to do. The staff interacted great with the kids in my group.",
   "This is an amazing place to explore different fields of study such as physics, geography and astronomy. Admission isn't very expensive and they sell a lot of useful things to have around the house. They accept both cash and card. You can learn about magnetism and surface tension here. It's excellent for kids and adults alike.",
   "Nice history museum of electrical appliances with thought provoking exhibits on electric cars, renewable energy and the history of cooking appliances. \nThe model train exhibit wasn't working when I visited."
  ]
 },
 {
  "name": "St. Peter's Church",
  "address": "107 State St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93ed5394-932d-11ea-ba3b-14b31f159f22.png",
  "tags": [
   "unique",
   "historic",
   "music",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=8764072928521743878",
  "source": "GoogleMaps",
  "reviews": [
   "A gorgeous historic church that will take your breath away. The rector and associate priest are truly wonderful and caring people. The music is sublime. St. Peter's offers something a bit unique. In addition to regular Holy Communion, St. Peter's is one of the few Episcopal Churches in the area that does a traditional choral Morning Prayer service.",
   "Amazing church in downtown Albany. A must see!",
   "Warm, friendly people! Truly Godly worship!",
   "My husband and I were married here. What fantastic historic architecture. A BEAUTIFUL church! Services are powerful and thought provoking. Congregation is warm and friendly.",
   "Beautiful architecture"
  ]
 },
 {
  "name": "Central Park",
  "address": "500 Iroquois Path, Schenectady, NY 12309, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94489bb4-932d-11ea-b3ee-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "pets",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14512736124475287088",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for the kids to play. It's clean, and fairly quiet today. Just enough kids to make playing fun.",
   "Great place to head to for friends and family! From private trails and a beautifully groomed rose garden, this park has much to offer. \n\n•Ample parking🚗\n•Wooded trails 🌲\n•Playscapes for children\n•Swimming & fishing areas \n•Dog Park \n•Tennis & Frisbee courts/courses \n\nDOWNFALL: the dog park 🐕 is in poor repair and is not managed well. Small and large dogs mingle together and often get into fights. Children run about the dogs and owners do not pick up after their pets. Use with extreme caution. Our dog has been known to be aggressive there as he gets overwhelmed even under close oversight. Best to go in the middle of the day as mornings and evenings are busiest.",
   "Nice place for a walk. There's two ponds, a playground for toddlers and a much bigger one for older kids. There are also a number of baseball diamonds, tennis courts, and basketball courts.",
   "Great place.  Hope to see additional improvements at Diamond A.  Plenty of potential to become a stand- out ball park.",
   "A little run down but I do have some good memories there."
  ]
 },
 {
  "name": "The Pine Hollow Arboretum",
  "address": "34 Pine Hollow Rd, Slingerlands, NY 12159, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94944c06-932d-11ea-b60f-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10607182893828886768",
  "source": "GoogleMaps",
  "reviews": [
   "A hidden treasure. Visited on Sunday for the first time during the rain and it was beautiful and very peaceful.",
   "Great collection of firs, spruces, pines, maples and larches. Trees trees beautiful trees!",
   "I love this place, with magnolias in bloom now - don't wait",
   "Quiet place to walk.  Need boots after snow or rain fall. A bit hilly for some.",
   "It's a lovely place with a very friendly staff"
  ]
 },
 {
  "name": "Wacky Walks",
  "address": "57 Washington Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=12893312542716223812",
  "source": "GoogleMaps",
  "reviews": [
   "I LOVED this experience.  I bought a groupon for Wacky Walks not really knowing what to expect.  It was amazingly fun and entertaining.  My husband loved it as well.  I highly recommend doing one of these walks.",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Washington Park Lake House",
  "address": "Washington Park Rd, Albany, NY 12203, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=5631798427162693818",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Five Rivers Environmental Education Center",
  "address": "56 Game Farm Rd, Delmar, NY 12054, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94d9ac8c-932d-11ea-8693-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "nature",
   "walk",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=12597109610191719384",
  "source": "GoogleMaps",
  "reviews": [
   "Cutting heritage trees for no reason! We took a walk this morning on the Vlomankill Trail and noticed a lot of random tree cutting was done recently, including some healthy 110 year old white pines. The cutting was done by contract because we saw the crew at work a few weeks ago but the workers were badly directed by the state. Healthy Ash and Hemlocks, well off the trail were clear cut while less healthy trees leaning over the trail were left in place. A bad job!",
   "Great for a hike, a run or a visit of the museum. Great community and festivals. Nice views. Endless trails! Love it!",
   "I recall coming here once as a child. There were some great nature trails to go on, and an owl to freak you out on the way out. You can expect to see lots of wildlife on the trails. Just don't touch the plants. Some of them are poisonous.",
   "Would love to go back to walk the trails",
   "This a beautiful place for anyone who enjoys learning about and experiencing nature.  The facility is modern and the trails are amazing.  The kids and parents will love it!"
  ]
 },
 {
  "name": "John Boyd Thacher State Park",
  "address": "830 Thacher Park Rd, Voorheesville, NY 12186, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/95270ac2-932d-11ea-8dd7-14b31f159f22.png",
  "tags": [
   "hike",
   "kids",
   "history",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=10934798122969268879",
  "source": "GoogleMaps",
  "reviews": [
   "Thacher Park is a great place to hike, enjoy views of 2-3 states at once on clear days, take photos, and enjoy history both natural and human. My kids love the tall slide and climbing wall at the visitor center, and they can't get enough of the waterfalls. The stairs under the cliffs make for a quick and picturesque workout. Double back when you get back to the top instead of walking the flats back to your car if you want more cardio.",
   "I went when some of the trails were closed, but the park was still enjoyable. I stopped at the overlook view and it was breathe taking! Plenty of parking spots and restrooms all throughout the park. Maps of the grounds are available at the visitors center.",
   "Beautiful views. Nice location for a picnic. Tables, grills and restroom facilities are available on a first come basis.",
   "Just love the view! Better to visit in summer as it’s pretty chilly up there.",
   "Absolutely love this place. It has almost everything you need to have a great day. Hiking, recreation area, picnic tables. All it needs is a swimming area. If you want a day to just relax and enjoy the views, come here. If you want to get a workout and go rock climbing or hiking, come here. So worth the drive and the 6 dollars to park. Would recommend to anyone who is looking for a nature getaway."
  ]
 },
 {
  "name": "Vischer Ferry Nature & Historic Preserve",
  "address": "Riverview Rd, Rexford, NY 12148, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/957edd8a-932d-11ea-a8e3-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2137216619531795767",
  "source": "GoogleMaps",
  "reviews": [
   "First time there. Loved it. Still so much more exploring to do. Trails seem to average 0.9 to 3 miles but I'm sure you can loop certain ways to make it further.",
   "Among the nature preserve areas in Clifton Park this appears to be the biggest. You can definitely get into some dense woods here along the Mohawk River. The variety of wildlife is great. Do watch out for marshy and muddy places—this is right along a major river after all.",
   "Wasn't thrilled about this place. Lots of power lines along the main entrance and very swampy in the summer. There are also tons of bugs. We did the ferry loop and tall pines. Maybe there are some other good places but here the trails just kind of cut in and out with tons of trail heads for each of these tails. I guess if you live close by it isn't too bad but not worth a long drive to me. The pros are that they are protecting the land so that's good.",
   "One or my favorite places to take a walk with my dog. Will also do some trail running in the summer when it's not so damp. The preserve offers a lot of trail space traveling through the woods.  You will definitely see a lot of birds and may see some other wildlife. The park borders the Mohawk river to one side and a section of the Erie canal on the other. If you like the outdoors and live in Clifton Park this place is a must visit. Very well maintained and clean. Sometimes it gets pretty busy with a lot of people, but only because it's so popular for fishing, dogs, and walking.",
   "Enjoyable trails. Wish I used it more when I lived here"
  ]
 },
 {
  "name": "Friends of Peebles Island State Park",
  "address": "1 Delaware Ave North, Cohoes, NY 12047, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/95cfbe12-932d-11ea-aa8a-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walking",
   "walk",
   "food",
   "walk",
   "kids",
   "walk",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=9455941394539453420",
  "source": "GoogleMaps",
  "reviews": [
   "Peebles Island State Park is perhaps that most beautiful of all the walking paths that I have visited in the immediate Capital Region. These pictures do not do the place justice; there is a pavilion that explains the history of the American Bald Eagle in the area, the path that goes along the periphery of the island is a good healthy walk that anyone can do, and the interior paths are beautiful, diverse, and you can even visit the site of a very old car wreck. If you are lucky, you might find a guide who will walk with you for a bit, and who can explain the island’s history, wildlife, and more.",
   "Peebles Island is a great walk in the woods. And along the Mohawk and Hudson Rivers. It offers great views at every step. Offer a distant but unobstructed view of an Eagles nest on the far shore. This is the pair...one was hunting for food up River and around the bend.",
   "Nice trails.  Restrooms still closed.  Is it to keep people from spreading the virus or just not season yet?   Trails are clean and walkable.  Saw deer and rabbits   Nice walk for kids since there is no school this week.",
   "Great park, nice walkabout.  Great views everywhere. It is even bearable to hike around in December with mucky trails. Definitely worth a walk. Not strenuous in any way. See if you can find the abandoned car!",
   "This is a fantastic spot. I have been exploring this park for the past few months and I still find it quite amazing. Cannot wait to start my longer walks when it gets warmer."
  ]
 },
 {
  "name": "Emma Treadwell Thacher Ntr Ct",
  "address": "87 Stan Levine Dr, Voorheesville, NY 12186, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96246f68-932d-11ea-ba41-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "knowledgeable",
   "art",
   "nature",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2738358839381927147",
  "source": "GoogleMaps",
  "reviews": [
   "Great education and trails.",
   "lovely place, lots to learn!",
   "A well maintained, low key education center with resources for all. Friendly and knowledgeable staff. There is a small shop with a good selection of local resources, books and souvenirs. They do a variety of community outreach activities including nature talks and bird watching, arts activities for kids, and art shows where community as artists can exhibit. They do a lot with relatively few resources, and are worth your visit and support.",
   "Wonderful exhibits describe the natural habitat surrounding the center.",
   "Great place for kids!"
  ]
 },
 {
  "name": "Prospect Park",
  "address": "65 Prospect Park Rd, Troy, NY 12180, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/966faa6c-932d-11ea-ad4c-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1636992756682076976",
  "source": "GoogleMaps",
  "reviews": [
   "It's a very pretty park. There are spots with tables for people sit and hangout. Since it is at the top of a hill, you can get a beautiful view of the downtown. You get see the sunset too!! Parking is free.",
   "Neat little park, kept clean great view. People use it to smoke weed so it's kind of difficult to bring kids in certain areas...but hey do you. \n\nThe four stars is simply because there is a HUGE cement old pool I'm assuming just rotting.",
   "Lot of green vegetatation in the heart of Troy, NY. Children can play with equipments specially meant for them . The view of Troy City from the park is lovely. Lot of space for family and friends to spend time. Nice place for picnic also.",
   "Large heavily used picnic park with grills and picnic tables. Water spray fountain for the kids. Pavilion for rent. Plenty of shade under trees.  Run down bathroom facilities. Road areas seriously in need of repair.  Horrific shame that large pool is empty, and neglected. This park could be a jewel. Wonderful sunset view from gazebo or bench at the top of the park.",
   "Beautiful park close to downtown Troy. Good views of the city from the outlook. A little dirty, but well maintained. Good for dogs."
  ]
 },
 {
  "name": "Schodack Island State Park",
  "address": "1 Schodack Island Way, Schodack Landing, NY 12156, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96d0ea5e-932d-11ea-812c-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=12993196213285806183",
  "source": "GoogleMaps",
  "reviews": [
   "Great camp ground and day use area. Rest rooms are clean. Campsites are large. Plenty of picnic tables in the day use area. Great kayaking (just keep an eye on the tides). Staff super nice.",
   "Great place to go. My kids and I went on the trail for a small walk. Very nice place. Recommend it. Playground is great, pavilions. We have had Birthday parties there. I have seen weddings as well.",
   "Nice NY state park and campground on the banks of the Hudson River. Clean, modern facilities and nice sites - many with electric. Boat launch and pavilion with playground for those of you with those interests.",
   "Clean park and simple camping. Electric hookups available, water posts every few sites. Faces sunset over the Hudson. Great playground. Bunnies everywhere!",
   "I have been to a bunch of NY State parks and let me tell you the facilities here are the beat I've ever encountered. The park is on the smaller side, but the restrooms and sites are very well kept. The firewood and ice delivery service is great! I would highly recommend. If you go here the best easy trail is hannahcroix preserve. It has a nice River for the dogs to play in."
  ]
 },
 {
  "name": "Empire State Aerosciences Museum",
  "address": "250 Rudy Chase Dr, Glenville, NY 12302, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97313488-932d-11ea-9bd4-14b31f159f22.png",
  "tags": [
   "history",
   "knowledgeable",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6595290117350800151",
  "source": "GoogleMaps",
  "reviews": [
   "Explored this aircraft museum while spending the weekend in downtown Schenectady to attend a wedding. Lots of historical artifacts and displays that cover the early aircraft industry in this part of NY plus the contributions of GE to jet and rocket engine development. Amazing collection of static display military jet aircraft including several types I’ve never seen before. Very enjoyable.",
   "I love this museum.\nThere are many things to try here.\nThis place is good for toddlers 2years old and older.\nI definitely recommend it .",
   "Alot of amateur and not very well cared for displays and exhibits. Likely just from a lack of funding as it seems like a labor of love. Could use a good sponsor and a bunch of modernizing and someone familiar with the electronics that were already attempted to get them functioning. \n\nThat said, it was an entertaining afternoon with my daughters, and no competition for time with the displays. Come give them some support!",
   "Awesome museum..lots of history here, airplanes, model of an aircraft carrier, reasonable admission",
   "Fun time for the whole family young and old. I brought my parents when they came to visit and they enjoyed it. The workers are very knowledgeable and helpful for the curios type. The kids also enjoyed climbing into the jets and learning the controls."
  ]
 },
 {
  "name": "Indian Ladder Trail",
  "address": "John Boyd Thacher State Park, Voorheesville, NY 12186, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9778b612-932d-11ea-8bfb-14b31f159f22.png",
  "tags": [
   "active",
   "walk",
   "walk",
   "hike",
   "hike",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7538751307480430133",
  "source": "GoogleMaps",
  "reviews": [
   "The trail is back open!  1.2 miles RT Just over an hour walk.  3 waterfalls, rock formations galore, ledges, and caves.  Park at new visitor center or at other end of trail in another lot.  Waterfalls were all active August 2, 2019.",
   "Great option for a quick day trip, beautiful views. Visitor center was very impressive. Well kept, overall awesome experience!",
   "Short hike with fantastic views. Will take about 15-20 minutes. Need to be able to walk steep stairs, slippery at times.",
   "Beautiful views and incredible sights! However not for those afraid of heights or who are not sure-footed.   The state has added barriers on part of the trail and also added stairs and railings for the steep ascents and decent but it can still be a challenging trail depending on trail conditions.  Beautiful views of the Helderburgs, great waterfalls and caves to see along the way. Start at the new welcome center trailhead and do the whole Indian ladder trail. Then hike back along the ridge and see it from the top.",
   "Beautiful views, easy hike. The area is great for a quick hike or a picnic, prefect to bring the family or go alone. Parking was $6 for the day. Only down side in my opinion is it gets very crowded and feels touristy."
  ]
 },
 {
  "name": "Bethlehem Parks & Recreation",
  "address": "261 Elm Ave, Delmar, NY 12054, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97dc5ba4-932d-11ea-b02b-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8837332016408123537",
  "source": "GoogleMaps",
  "reviews": [
   "All the equipment is kept in excellent condition and there are many different activity areas for all ages. Everyone seems to be watching their children and are polite and respectful of others.",
   "Little bit here for everyone, including people who do Pokemon.Check out the website.Not happy that they close the pool on Labor day.A lot of warm days in September that seniors could enjoy a more peaceful time poolside",
   "A great place to spend family time. Clean, cared for and the kids have so much fun there",
   "Great for many large events including grad parties, sports banquets, etc.",
   "Great place to spend quality time."
  ]
 },
 {
  "name": "Rivers Casino & Resort Schenectady",
  "address": "1 Rush St, Schenectady, NY 12305, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98352b94-932d-11ea-8d59-14b31f159f22.png",
  "tags": [
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6031239591530160716",
  "source": "GoogleMaps",
  "reviews": [
   "Last night I went to the casino to the Al B Sure concert with my sister and her husband and we had a fabulous time!!! Yes, we arrived early and stood in line just like many others! But I can assure you Al B Sure was definitely NOT lip sync any of his music!! This man is genuine and humble! Definitely not the same man back in the day! And his boy can sing!!!  And quite honestly who cares about the seats?! Who sat in them that long anyway?!   And please tell me what artist will go out of their way to talk with you to hear what you have to say and make sure every guest that came to see the show last night received a perfect long stemmed white rose. Al B Sure put on a wonderful show and I can only hope that the River Casino brings him back again!!!!💯",
   "Beautiful casino, amazing rooms, great food.\n\nOnly gripe is the price of beer. As someone from Wisconsin, charging $4 for a PBR is kinda stretching it.\n\nOtherwise had an amazing experience, staff is super friendly and helpful. If you are a smoker, the smokers lounge is very warm and bright with tons of space to sit.",
   "Love this casino, Best one I have been to in New York. Every employee is very nice and always smiling. Went a total 7 times and had a nice relaxing time. I recommend going there to everyone I know. I won some and lost some, still love it!",
   "River's Casino Resort has managed to ride the wave of growing pains to sustain itself in the gambling industry and stake it's claim in profits. With an adaptable business model no complaint seems to go unheard. This has more than assured that each time I returned to River's to gamble that I felt a bit better each time about my experiences. Professionalism is at the forefront of their operation, and diversity in their staff and it's services are continuing to improve.",
   "Superbowl Suday was CRAZY!!!! Best place ever. Had an amazing experience. Casi was in our slot area. She was so nice an pretty brought our drinks out so fast!\nWe will definitely be returning! Hope to see Casi there again. \nTelling everyone to Check out RIVERS"
  ]
 },
 {
  "name": "Overlook Park",
  "address": "Cohoes, NY 12047, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98a666d2-932d-11ea-8118-14b31f159f22.png",
  "tags": [
   "history",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=9664520054131660921",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, and add some history.",
   "Nice view but far enough away it's not great. That park itself is not kept up at all.",
   "Amazing point of Geographic and Geological structure in Mohawk river. Water flows over the huge rocks making a wondergul fall. Regarded by native people as the second Niagra Falls.",
   "A great place to take photos you can see the falls great view",
   "So breath taking"
  ]
 },
 {
  "name": "Henry Hudson Park",
  "address": "Barent Winne Rd, Selkirk, NY 12158, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9906fb24-932d-11ea-83b2-14b31f159f22.png",
  "tags": [
   "field",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17615703592406348106",
  "source": "GoogleMaps",
  "reviews": [
   "There is a car top boat launch (canoe/kayak) and a regular boat launch, plus picnic areas,  covered pavilion, baseball field and bathrooms.  This is a beautiful part of the Hudson River to kayak on. The park is open from one hour prior to sunrise until 10:00PM. Google Maps doesn't have a way to state this opening/closing time for the park.",
   "Boat launch open 24/7, park closes at dusk and is enforced by Bethlehem police  (no fishing allowed after dusk).  Kayak launch on the south end.  Trailer/ truck parking, handicapped parking, porta potties, plenty of picnic tables and space, grills, volleyball net, playground equipment.  A nice place to fish, launch your boat, or come with the family, but it tends to get crowded on weekends, holidays, and during striper season.",
   "Such a quiet cute park. Great for a picnic. Calming with great views.",
   "After Striper season, it calms.. This park is well maintained and offers much more than fishing from shore.",
   "I love to hang out here and photograph the river"
  ]
 },
 {
  "name": "Grafton Lake State Park",
  "address": "254 Grafton Lakes State Park Way, Grafton, NY 12082, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9973a1c2-932d-11ea-bb03-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11063766641547752925",
  "source": "GoogleMaps",
  "reviews": [
   "Good variety of well marked trails for all levels. New visitors center is a great place to check out, especially with the kiddos. Mountain biking is welcome on many trails and the Winterfest is a great event too. They have snowshoe rentals too so you can use this place year round.",
   "Beautiful park, great trails. Can be quite busy during peak days but always a place to lay your towel and read. Or, of course, jump in the water to cool down!",
   "The best! Great place for family’s to hang together. They have a beach and offer boats that you yourself can paddle along the river side. Beautiful views.",
   "Great winter riding.  Depending on snow conditions, can be challenging but rewarding and fun trail system.",
   "What a beautiful park! The lakes are gorgeous l, the views are great, and it's such a nice area. The only place within 2 and a half hours of me in nj! Too bad the ice fishing was not aiiight."
  ]
 },
 {
  "name": "East Greenbush Town Park",
  "address": "Town Park Rd, East Greenbush, NY 12061, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99e3f1b8-932d-11ea-b512-14b31f159f22.png",
  "tags": [
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8039927449542220924",
  "source": "GoogleMaps",
  "reviews": [
   "Great spot for bringing our pup! We love the trails and the freedom we have when coming here to go on adventures! Highly recommended. They have a great new set up for a playground (in the warmer months) and a fence I dog park too!",
   "This is a wonderful Park only a few miles from where I live it's very spacious and the dog loved it he got along with the other dogs very well and the people were very friendly the only drawback is that you have to pay a fee when other dog parks in the area don't I think we pay enough taxes in this town to cover that",
   "Very nice quiet park even a dog section",
   "Pretty nice park. Love the dog park dogs and their people but the town could do more to maintain the dog park.",
   "Nice trails for walking the dog."
  ]
 },
 {
  "name": "Saratoga Spa State Park",
  "address": "19 Roosevelt Dr, Saratoga Springs, NY 12866, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a31e138-932d-11ea-8f77-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "history",
   "tasting",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7148947160635447708",
  "source": "GoogleMaps",
  "reviews": [
   "Saratoga State Park is one of the best parks in Saratoga. As a runner, it's easy to find various routes with tons of variety to keep you exercise interesting. As a photographer, my couples have always loved going to the park to take their engagement or family portraits. Since the grounds are so expansive, there is no shortage of beautiful places to shoot!\n\nThe park is dog-friendly, so there are always a few pups running around too in the spring and summertime, which I view as a great bonus!",
   "This place is absolutely stunning! There are no words to describe the majestic experience! The park comes alive at night with a nightly colored carousel, beautiful fountains that are something that could come from a fairytale.  Saratoga in general is a beautiful place with some neat history!!!",
   "Gorgeous state park with so much to do! My favorite activity is tasting all the different spring waters. Bring some clean, empty jugs to bring some home. Check out the Roosevelt baths it you've got $40 to spare on a bath. The naturally carbonated tubs are like soaking in warm champagne.",
   "I had been here over ten years ago and only visited areas relevant to the venue at Saratoga, but even then the little I saw was so beautiful and very clean and we'll kept.  This past year I had the luxury of visiting Saratoga Park twice two nights for a concert l, in which you once see very little.  Then had an opportunity to visit a friend's family just south of the park and had a chance to see what else it had to offer, unfortunately this was near the end of fall not an ideal time but still very grateful I was able to see more of the beautifulness the park has to offer.",
   "Saratoga Spa State Park is a beautiful place to relax. The gentle terrain offers picnic areas, shady stream side trails, suitable for the nature-lover or the casual walker, as well as certified running courses used by joggers. There are fountain springs all around the park. The fountains have signs that read that the water has medicinal benefits. I know people from all over the country to enjoy the benefits of the water. I did taste the water and some fountains had an effervescent taste to it while other had a refreshing taste. I highly recommend this park if you’ve never been before."
  ]
 },
 {
  "name": "Palace Theatre",
  "address": "19 Clinton Ave, Albany, NY 12207, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a7fb492-932d-11ea-86b8-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=9244840344646195465",
  "source": "GoogleMaps",
  "reviews": [
   "Went to see the Russian Nutcracker Ballet. It was my first time at the Palace. Ushers were wonderful, they helped  us find our seats.  Parking was a little tricky.  We have a handicap sticker and with valet parking we still walked a block and a half.  It felt like a mile but we made it. Beautiful  theater and wonderful show!",
   "Beautiful,  clean,  comfortable seats,  need more bathrooms. Tons of us were literally running at intermission to get there. Smoke machine can be turned down as well for the stage,  almost couldn't see performers. Needs more options for non beer drinkers. Hard seltzers aren't for all.",
   "The venue was absolutely beautiful inside and out. Great sound quality and the staff were so warm and welcoming! One of the ushers told us about other great places to go our the town and how much she loved working for this theater.",
   "This theater is absolutely beautiful. A great place to see movies and concerts. Some people might not like seeing concerts with seating but I am not 18 anymore and I am all about the seated venues.",
   "Beautiful historical venue! Not a bad seat in the house. Concerts, plays or films. Great local place with many different close-ish places to park for free."
  ]
 },
 {
  "name": "Pursue the Clue",
  "address": "1500 Central Ave, Albany, NY 12205, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9acb64dc-932d-11ea-b24c-14b31f159f22.png",
  "tags": [
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=8003211844758438754",
  "source": "GoogleMaps",
  "reviews": [
   "I’ve done escape rooms in Scranton PA, NJ, NYC, Troy NY and Albany NY. Having a lot of experience with escape rooms I was impressed with how elaborate and fun the room was! I went with escape room newbies and we all had a lot of fun and we ended up completing the escape room with just a few minutes to spare. We will definitely be returning!",
   "This was our second annual trip to Pursue the Clue. We've now completed both McWhirley's Mystery and Captain Fermi's Spaceship. Both rooms were excellent and a lot of fun. Some great memories were made here and can't wait to come back again and try the other room!",
   "We had a great time here on two different occasions in two very different rooms.  The level of help was just right, they didn't spoil it by too much help but  didn't let it get too frustrating on our own.   The workers were just great and the rooms were not just your run of the mill collection of puzzles but had a lot of thought put into them.",
   "Man, I really wanted to like this escape room because I know the owner has built them himself, which I think is awesome. Unfortunately, this was probably the worst escape room I have ever done, and I have done around 50, including the ones in Crossgates mall and Enigmatic Escape in Troy (which is far better). \n\nWe did McWhirely room. The flow of the room was awful-most of the clues we found were clues to solve puzzles that we had already solved. The person had to come in at the end to explain how many of the puzzles were meant to work- meaning that they did not work as they were supposed to for reasons that they were broken, or just not well designed. There were several things that just bothered me, demonstrating that almost no money is put back into maintaining the rooms. For example, the door is held together with an elastic band...why not just purchase a door hinge... This really impacted my perception of the room quality. For 26$ (including tax), I expect much better.\n\nThe escape room host was wonderful. But as someone who often does escape rooms, and while seeing the abundant of great reviews for this place , I felt I needed to say something. I think most of the people who view this as an excellent escape room experience have likely never done an escape room before.",
   "Great atmosphere, perfect level of challenge making you feel accomplished for solving each clue along the way without \"gimmes\" that sometimes feel like a cheap excuse to progress you along. You interact with the room, and the props and puzzles perfectly fit the thematic of the room. The experience had me and my partner laughing and enjoying ourselves every step of the way. Will definitely be returning and strongly recommend you check it out if you're in the capital region and love escape/mystery rooms!"
  ]
 },
 {
  "name": "Crossgates Mall",
  "address": "1 Crossgates Mall Rd, Albany, NY 12203, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b17d898-932d-11ea-bff1-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "food",
   "walk",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4110326987130251529",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice and clean mall. Wish the food selection was a little different. Some nice sit down casual dining be nice. Unos sucks and Texas be Brazil is only open for dinner . couple other places offer appetizers and bar foods. This is a nice food court with decent selection of fast food . would definitely visit again .",
   "I like that this mall is always adding new stores and attractions. Definitely has a lot more for kids than other malls as far as stuff to do. The food court isn't the best but there are plenty of restaurants to make up for that. Love the variety of stores and that the mall itself is well maintained.",
   "I really like Crossgates Mall.\nMost of the time I have to go to Best Buy. \nThey have been getting more competitive price wise there. \nThey finally started to bring PC parts back, but there accessories prices like cables and adapters are priced high. \nEvery employee is always very polite and very helpful.",
   "This mall is HUGE! We have been here a few times as a family and we enjoy the assortment of stores as well as the actual time we send here. The mall is much nicer than most malls, it's in good repair and has plenty of space to stop and look around at things without being trampled. They have benches in the center of the walk areas for those that need to stop and take a rest or those who just want to relax.",
   "I went to funny bones to see a comedy show. The little part of the mall that I walk through was not that bad. On the way out I did stop at a jewelry store the people who are very nice even though they were getting ready to close they did allow us to stay and look everyone was quite polite and I didn't have any problem with any rowdy people overall it was a rather Pleasant night. The only thing was the parking. It was a cold night finding parking towards the door and then finding the actual place was hard when you've never been there because I don't do malls. If someone else were to come to the club that I'd want to see I would go again"
  ]
 },
 {
  "name": "Howe Cavern",
  "address": "255 Discovery Dr, Howes Cave, NY 12092, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b620242-932d-11ea-936e-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "kids",
   "delicious",
   "tour",
   "family",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10872407095453386317",
  "source": "GoogleMaps",
  "reviews": [
   "I think the tour was well worth the price. You spend a little over an hour down in the cave. It's in the middle of no where so if you think you are lost you are not just keep going. The only reason I did not give it a five star is because of the tour guides. They all use the same jokes and where a bit awkward.",
   "Nice experience! This a place fully prepared for the tour. Very informative. \nIn the summer and some holidays it can get very very busy, with long waiting lines. \nMy kids love this place and the fudge. \nThey have a nice gift shop, coffee shop and you can buy their cheese and fudge there.\n** Go with a sweater or jacket, the temperature in the cavern is always 52 and you will need something.",
   "I surprised my husband with a wknd getaway for Valentine’s Day and it was worth every penny! From beginning to end this place was amazing. Customer service was beyond what I expected (sry I’m a New Yorker) they were great! I purchased the culinary package and loved loved loved it! The cave tour was super near my husband loved it. The dinner at the American Hotel (comes with the culinary package ) was delicious !! The fudge selections were great and delicious , the Howe cave cheese was really good too. Please do not let the word “motel” fool you if your planning to stay the rooms are beautiful, clean, well maintained and the view from the lot is amazing. The beds were super comfy !  I will b returning in the summer with many more family members so they can experience the greatness this place has to offer.",
   "Beautiful. You are not allowed to have purses, so be aware. Short boat ride. This is the first cave I have visited with a boat ride! Amazing views and knowledgable staff.",
   "A little pricey for a family but a memorable trip. Tours seem to leave every 30 min tour guide was good. Photo they take in cave is only $10. Best bargin sovinior photo in all of our travels."
  ]
 },
 {
  "name": "Bethlehem Town Family Dental",
  "address": "241 Rte 9W, Glenmont, NY 12077, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9ba267dc-932d-11ea-942e-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13615795642514642372",
  "source": "GoogleMaps",
  "reviews": [
   "I have gone to a lot of dentists, but never thought that they were present to the patient experience.\n At Bethlehem Town Family Dental, Dr Henry and his staff demonstrate exceptional service and take great care in understanding the experience of the patient, both from a health and consumer point of view. They have up to date and cutting edge technology and take great care in making you comfortable and at ease. There are no surprises and there is always a discussion about cost, insurance coverage and options. Of course I am partial to my hygienist, Nick, but all of the staff is warm, welcoming and take the time to make you feel right at home!  During my last visit, they accommodated me with great, conscientious care; I felt like I was at the Spa! Thank you Bethlehem Town Family Dentist!\nK",
   "Having gone to my 1st appointment on 10/18/19 I was able to meet some lovely ladies.  The Dentist met with me & thoroughly explained everything and told me how to go about things. They made me feel at home and I left very pleased. (I recommend BTFD to anyone that is looking for a new dentist) you will not regret it. When you’re received with a big welcoming smile it can’t get any better.",
   "Great office and staff! The office is very accommodating to patient's needs and Nick the hygienist does a thorough job, would highly recommend!",
   "Easily the best dentist I’ve been to.  Quick and professional.  Nick is a superstar technician and Dr Henry did some fillings that were virtually painless.\n\nDef recommend.",
   "Dr. Henry is awesome as well as his entire staff.  I switched to Bethlehem Town Family Dental when my previous dentist retired and was replaced with someone less knowledgeable and primarily focused on making money.  The technology is up to date and so far beyond what I was used to that I feel like I've had barbarians working on my teeth...up until now.  Such a great experience going here and I know Dr. Henry and his staff's primary focus is patient care and comfort.  I look forward to being a patient here for years to come."
  ]
 },
 {
  "name": "The Saratoga Winery",
  "address": "462 NY-29, Saratoga Springs, NY 12866, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9be9ab54-932d-11ea-b31f-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=177297875889060754",
  "source": "GoogleMaps",
  "reviews": [
   "Just stopped with sister Valentine's day and had a great time.  Tasted both beers and wines. And had a great meal. There was entertaining going on but we were in a area where we could still chat and hear what were saying to each other..... will be back....some of my friends will love it.",
   "Wine and beer tasting is a great deal. Staff friendly nice spot to relax and grab a bite. Wines all very tasty. Would go back if in the area again.",
   "Disappointing service 1/5 at best. Came here to see a band at 7, got here an hour early. The staff seemed to take care of guests only as an afterthought. \n\nThey sold us a bar pretzel and charged our card\n...only to inform us 20 minutes later that they haven't sold pretzels all day.\n\nVery difficult to actually get the food we ordered, but what they actually brought was great once we got it.\n\nTruly disappointed to see a place with so much potential fail so horribly at basic food service.",
   "Gave this often ,too crowded place a 2nd chance and I am glad we did! On a Sunday it was busy but not crowded. Cute wine flights, decent beer flights. Nice live music. Not too loud. Gorgeous back deck and patio.",
   "Have been multiple times and like it.  Very good food (wood fired pizza) they have some tasty wines (NY finger lakes grape sourcing).  Beer on tap.  We did have to wait too long for drinks considering the amount of bodies behind the bar.  Manager was on-point though and took care of everything but 20 minutes to order drinks with staff standing there.  Definitely recommend regardless, everyone was very nice."
  ]
 },
 {
  "name": "Times Union Center",
  "address": "51 S Pearl St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c546568-932d-11ea-be5e-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7808240469845054340",
  "source": "GoogleMaps",
  "reviews": [
   "Decent size arena, not huge like the MSG in NYC.  We went to see a comedy show and had some nice floor seats.  We were able to see the comedians on stage and of course on the two screens.\nThe food and drink prices were ridiculously high for as lousy as they were, especially the popcorn.  The popcorn tasted like it was doused in salt.  For a 20oz bottle of water it cost $5.  We couldn't finish the popcorn because of how salty it was, and I certainly wasn't spending another $5 for a bottle of water.\nThe staff at the arena was nice and helpful with everyone especially when they were helping guests find their seats.",
   "Love it. Need more parking spaces for visitors but the best safest place to go to see anything. I wish more NY city events took place in the Capitol. Because here is the safest. I send my 13, 14, 15, 16, 18 and 20  year olds alone. The police are outside and inside and who are very helpful and nice.",
   "It's the only place to go for a big venue.  But it has great parking.  Great variety of food.  The seats need to be updated.  They don't provide good seating for larger people.  You must have a tiny butt to seat in any of there seats.  And they always over book there seats and you need to find a usher.  They always correct the problems.  And to many security officers that are want a bee cops that threat the paying customer like bubble gum on the bottom of there shoe.",
   "Parking Garage Review - I've been using and parking at the Times Union Garage 4-5 days a week since July of 2013. I've been parking there for over 6 years as my work is very local. \n\nToday I arrived at 6:50AM to the lower entrance. Upper opens at 7AM. When I arrived the man at the both was having trouble with the PC and needed to restart. The screen was sideways (Ctrl+alt+direction will fix) after him trying for 10 minutes to enter his password and use the mouse sideways he gave up. During this time 6 cars were waiting behind me. My credit card machine is down, you'll have to leave.\n\nLeave? I've been parking here for 6 years! I asked to speak to the manager, he said he was the Assistant Manager. Anytime this has happened in the past, they would let you through and I could pay on the way out. He started to get upset. They're not supposed to do that! Who were they, what booth, what did they look like.... He was far more concerned over them taking care of a customer than himself. \n\nHe made me pull into the garage and turn around and leave...over $8 of which I paid roughly $10k in parking over 6 years at 4-5 times a week. I've paid every single time on the way out as well. \n\nHe could care less. No one in his capacity should be management. Poor business decisions, and does not care for his customers.",
   "Great venue for concerts -- we had the moderately priced seats and the sound and sight lines were good.  But on the return to the parking areas, the escalators should have been set to bring us up but they were not.  We had to climb innumerable stairs on the return trip."
  ]
 },
 {
  "name": "Children's Museum at Saratoga",
  "address": "69 Caroline St, Saratoga Springs, NY 12866, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c95b55c-932d-11ea-b379-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "free",
   "library",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2986633894115874939",
  "source": "GoogleMaps",
  "reviews": [
   "Soooo fun! There was so much thought and research done into the education aspect. It was so clean and so exciting. We HIGHLY recommend",
   "This place was absolutely awesome to take our kids. We were in town visiting family and had since time to kill. We could not have chosen a better place to let the kids get out some energy. Great place for them to use their creativity and cognitive skills.  Staff was super friendly and helpful.  Not sure if early Saturdays are normally slower but not a lot of traffic before Noon.",
   "Totally worth it if you can get passes for free from the library. A little underwhelming if you had to pay full price. My 7 year old was just on the cusp of still finding it fun, but it was perfect for my 2 year old.",
   "Totally terrific for kids! A kick for adults to watch kids enjoy!",
   "I brought my 3 year old daughter here recently and we had a blast! The museum is housed in a large 2-story building, and there are so many hands-on and roleplaying activities available to engage young minds. Our favorite place to play was the pretend market/post office upstairs! There's also a pretend bank, schoolhouse, and diner--Seriously such a fun place where kids can spend hours roleplaying! They also have fun short workshops available at certain times that introduce scientific topics to the little ones. Overall you could spend hours in this place and still come back later and find something to do! We'll definitely be back!"
  ]
 },
 {
  "name": "The Hart-Cluett Mansion",
  "address": "57 2nd St, Troy, NY 12180, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9ce3d6b4-932d-11ea-bce6-14b31f159f22.png",
  "tags": [
   "history",
   "historic",
   "knowledgeable",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3299588963089869209",
  "source": "GoogleMaps",
  "reviews": [
   "It was a very nice experience with the historical memorabilias about \"Uncle Sam\" and the past history of the Troy city",
   "Love thos place.  It is so pretty in December",
   "One of Troy, New York's finest and most historical landmarks!! The architecture inside is truly one of a kind and the marble that is laid out, is also in itself, very historic and lovely! The house is open to the public the 2nd Saturday of the month at 2pm for a guided tour, May through December. Tours are also available by prior appointment. 2nd Saturday tours are $10.00 for adults. If you have some free time, don't pass the chance up to see this historic and beautiful attraction!! These guides really know their stuff and are very knowledgeable about the district of Troy as well! Snap some photos and you'll have them forever!! Don't miss this!",
   "My family's favorite part of the RCHS Museum!",
   "What a pity that I'd lived in Troy for years without a cluett all that this existed!"
  ]
 },
 {
  "name": "Albany Rural Cemetery",
  "address": "Cemetery Ave, Albany, NY 12204, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d3887fa-932d-11ea-bd7f-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "walk",
   "active",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1482392766904646236",
  "source": "GoogleMaps",
  "reviews": [
   "We visited President Chester A. Arthur's Memorial Tomb, located in Section 24, Lot 8 to pay our respects to our Nation's 21st President becoming President after James A. Garfield was assassinated. A man with a history filled life, we salute you. May you rest in peace",
   "Beautiful and huge cemetery with lots of lovely quiet paths and trails. Best place for a quiet walk in the area.",
   "Albany Rural Cemetery is a very peaceful place to visit. The cemetery is well cared for and amazingly they continuously in the process of repairing the deteriorating stones. Each season brings a special treat to those who visit with blooming flowers, birds, and trees in full dress. I n the Autumn the trees put on a show and decorate the tombstone in reds, yellows, oranges, and greens. In the winter everything is decorated in white. In the spring once again flower buds, green grass begins to cover the ground once again, bees begin to hum, and birds sing in the trees. Amongst death life abounds. If you get a chance, I would recommend stopping by the cemetery, take a walk around, read the tombstones, and visit the waterfalls and wooded trails. They would welcome donations, I am sure, to repair those civil war stones that have seen better days.",
   "Very beautiful cemetery in menands ny that is the size of central park in manhattan as it will take you all day to see all the graves here.  There are multiple entrances and exits here, st agnes cemetery next door and a Jewish cemetery next door.  Heads up, a train crossing comes through here and it is active, the owner lives on site, menands police dept patrols here regularly, and do not come here after dark as it is easy to get lost, the police will arrest you if you are caught by them in the dark, coyotes in the woods and other wild animals, stay on the paths and roadways at all times, multiple roadways that have collapsed in this cemetery including a road in the middle ridge section next to the burden family vault, steep dropoffs here too!",
   "Beautiful cemetery but they don’t keep up on the mowing anymore. I have to go over myself to cut the grass. They mow the entrance so it looks good from the road.  Very saf"
  ]
 },
 {
  "name": "Druthers Brewing Company",
  "address": "1053 Broadway, Albany, NY 12204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d861cb0-932d-11ea-94c1-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "unique",
   "food",
   "delicious",
   "drink",
   "food",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=11459949193916587799",
  "source": "GoogleMaps",
  "reviews": [
   "Reserved a table for 9 at the height of the dinner hour. We were seated and our drink order taken. With 3 children, our waitress Sheila was helpful and charming. With a variety of food and drink orders, we were served with a smile and promptness! Nice, comfortable home-brewing pub atmosphere. Reasonably priced, too.",
   "Split two burgers with my buddy.  The Spicy Burger (pictured, right) was well-prepared, but didn't really have enough kick for my taste.  The Peanut Butter Burger (pictured, left), however, was excellent.  Truly unique and surprising.  Would order again.",
   "This place had great beer and great burgers.  Angie was our server and provided us with the best of service!  She had a great personality and made sure we were always taken care of.  I would definitely come back here soon.",
   "The food was really good. Beer cheese dip and the Pig Mac burger. There were 11 beers on tap and one in the bottle. Nothing really screamed that it was the best beer ever, but all of them were good. Service was tremendous. Very lively and fun atmosphere.",
   "This was the first for us and it definitely won't be the last. Food is very delicious.  For our appetizer we got the pretzels and let me tell you.  They have to be the best around...amazing!  I got the chorizo chicken chili burger and I will definitely be back for that also.  My wife got the Druthers mac and cheese and that was also perfect.  Everything was perfectly cooked & seasoned.  The beer is tasty and fresh.  A must go in my book.  My sister doesn't drink so if you have the idea that it's a brewery I can't go there...YES you can and you'll be back."
  ]
 },
 {
  "name": "677 Prime",
  "address": "677 Broadway, Albany, NY 12207, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9dd047cc-932d-11ea-89b0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "delicious",
   "comforting",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9805959684243935146",
  "source": "GoogleMaps",
  "reviews": [
   "The food was absolutely amazing. This is going to sound crazy, but one of my favorite things was the bread, maybe because I had never tasted any bread like that before.. If you like steak, I highly recommend the cowboy steak. My husband got that and I got the strip, my steak was great, but his was even better, which I couldn't believe there was such a difference! I'm not sure of the exact differences in the cut, seasoning or cooking method, but wow! Don't get me wrong, my strip steak was great, but mmmm, that cowboy was something else. 🤣Our server Tim was phenomenal! 👏👏",
   "5 stars. Thumbs Up! Great place. Times are tough for the restaurant industry right now. So many are working hard to offer take out and delivery services they don't normally have. It's my husband's birthday and I was looking for a special meal since our original plans fell through. He mentioned wanting a steak, so when I came across a special family deal 677 was running, I knew we had to try it. The deal included two 7oz steaks, shrimp scampi, lobster mac and cheese, asparagus, bread, and donut holes. They even included a bottle of their steak sauce and a gift card to use when they reopen. Everything was delicious! I loved the char on the steak. I'm so glad I found this deal and supported a local business during this tough time. We will definitely be returning to the restaurant when they reopen. Recommend Google!",
   "Wow! Got the takeout curbside Prime Rib special. It was cooked just the way we asked with amazing seasonings. The roasted potatoes and carrots were delicious  too! A great value!",
   "Absolutely wonderful place. A bit heavy on the wallet, but certainly worth the price if you're in the mood to splurge. The steak was wonderful, and I had a ribeye for two to myself (as well as a strip steak and a wee bit of A5 wagyu).\n\nAs amazing as the food is, the pleasantness of the staff is also of note. They were very nice and comforting. All around, this is by far the most wonderful place for a steak in the capital region.",
   "Everything is always perfect from start to finish. The valet attendants are the nicest and upon walking in we are warmly welcomed by Jackie who always makes sure we are promptly seated somewhere comfortable. Our server Sergio is just fantastic--he is genuinely happy to be taking care of you and does a phenomenal job with absolutely everything."
  ]
 },
 {
  "name": "The Hollow Bar + Kitchen",
  "address": "79 N Pearl St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e2239c0-932d-11ea-83ea-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2124253614074873021",
  "source": "GoogleMaps",
  "reviews": [
   "Food was great! Came here for vegetarian options for a long overdue family gathering. Made reservations in advance was given two circle high top tables which were nice but not very conversation friendly especially since my grandmother was in attendance. This was also a dinner that had brought us together for the first time in a few years, that’s the only complain I have. Would have asked for another table but there wasn’t an open seat in the place. Great atmosphere , great food, would love to have given 5 stars but the seating thing really was a turn off especially because it was hard for my grandmother to get into the stools.",
   "Great venue. The bar staff were awesome and the nachos were extremely good! Saw the band Magic Giant.... What an awesome and intimate setting!",
   "Possibly the best wings I've had in a long time. Get the chipotle maple garlic wings! The pear and brie sandwich was creamy and fresh. Polite and friendly service. I'll definitely be back soon.",
   "Very nice atmosphere and a place to be on a Saturday evening. Food was very delicious and the service was top notch. \n\nWe were leaving when the live band was setting up and we could tell it will be an incredible night just by the few songs they  practiced  with.",
   "When you first enter, it seems like another upscale restaurant/pub. You might not expect much but bar that serves some food on the side. That is not what the Hollow is. After you enter the bar and see the main restaurant area, you can follow the place further back into more restaurant seating and then a live band/ extra bar area. The place is nicely decorated, perfectly lit and you don't need to use your phones flashlight just to view the menu. When we entered, we informed the hostess that we had reservations for about an hour ahead and we'd just grab a drink first. The bartender was nice, friendly, and efficient. They had an extensive drink and beer menu with a good amount of local and others on tap. There was a show at the TU center so the place was a bit full. We didn't expect to be seated for a while but they sat us probably a half hour before our reservation which was really nice, especially for a show night. The tables were close but you didn't feel like you were on each other's laps. The noise level was fine for a full house. \nWe ordered apps including muscles, soup, beer & cheddar dip, and a cheese board. It was all delicious. Our waiter gave good suggestions & he was very personable and attentive. They had a great menu, including several Veg & Vegan options which you don't find most places. After the apps, our meals didn't take long at all. They spaced it out like we requested which was nice because it can be a bit annoying when you  aren't even finished with the first few bites of your app and they bring out the entree. \nWe ordered burgers, sandwiches and mac and cheese but I will definitely be back for the other selections like the ahi tuna, salmon, other cheese boards and scallops. If you like sweet potato fries, you must order them.\n I wish I hadn't waited so long to go here."
  ]
 },
 {
  "name": "Yono's",
  "address": "25 Chapel St, Albany, NY 12210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e6f49a2-932d-11ea-bb8b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4664520584197050653",
  "source": "GoogleMaps",
  "reviews": [
   "Yono’s Formal, You can listen to a wonderful piano player on Friday and Saturday nights.  I chose the five course traditional Indonesian Rijsttafel for dinner. Remind your date to get a appetizer or they will sit there envious, and hungry as you are served course after course of food. My food was cooked to perfection!  I have only positive things to say about all five courses!\nService was spectacular and the staff was well mannered and full of social niceties that many people and restaurants are lacking.",
   "Yono's is, without a doubt, the finest dining in Albany. An establushed culinary attraction for over 40 years, still expanding the palette of patrons with each visit. My guest and I ordered the prix fixe, I the 4 course and guest the 5 course rijsttafel. We also took advantage of the wine pairings with each course. The meals were superb, the wines delightful discoveries, many from New York State, and the service was exemplary.\n\nPictures are the second course plates. Exquisitely prepared and presented.\n\nVisit again and again!",
   "Everything about this place is fancy. The food, service and ambiance. But it is very expensive. They have a small menu but all the items are very well thought out and delicious. They also have wine pairing if you want.  The menu changes very often and the food is always fresh. There isn't a good place to park for free so heads up. \n\nWorth a visit for a celebration or something but too expensive to go regularly.",
   "Atmosphere just right with available seating on arrival... good timing during meal. Brett’s service excellent! Cream of asparagus soup very flavorful... with fabulous catch of the day Cod... bourbon pecan tart... with coffee piping hot... Loved it!!!",
   "Really nice place for dinner, with a very, very extensive wine menu. Staff is really nice, and courteous. Clean, and relaxed atmosphere."
  ]
 },
 {
  "name": "H&L On The Hudson",
  "address": "5 Broadway, Albany, NY 12202, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9eb8b002-932d-11ea-954f-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=16521361229329140147",
  "source": "GoogleMaps",
  "reviews": [
   "Best egg sandwich. Bacon egg n cheese. You get two eggs. Stopped here many times and always good. Prices are fair and worth what you pay for. Only open seasonal.",
   "All most that time Monday morning opening day Everyone",
   "Great  friendly place to grab some lunch! Excellent burgers and fries.Very clean and right on the Hudson River.. it's just a little ways past the U-Haul building in Albany.",
   "The food is excellent, the people are friendly, helpful and provide great service.  The food is always fresh and made to order.  If you haven't tried it, you're missing out on a great breakfast or lunch.  The prices are reasonable and you get a lot of food for your money.  Try it, you'll really enjoy it.",
   "Best place to eat in downtown Albany. Best service & friendly great atmosphere"
  ]
 },
 {
  "name": "Grappa '72",
  "address": "818 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f0b6568-932d-11ea-839f-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=212563844486080307",
  "source": "GoogleMaps",
  "reviews": [
   "Truly outstanding Italian. A deep menu with all the favorites. The preparation is excellent. Service is good and the atmosphere is very nice. It is much nicer on the inside than it's strip Mall location would suggest. Parking is easy. They had live music the night I was there that was at just the right volume; a nice complement to conversation.",
   "One of the best restaurants I have ever visited. We were travelling and came upon this gem on our way. The food was excellent, the service fantastic and we had the greatest time. We ordered various dishes and all were excellent. The desserts were to die for. We will miss this place.",
   "The food was incredibly delicious. Everyone was very professional. They do not rush you, so if you’re on a date, that’s great. But if you’re looking for a quick meal, this isn’t the best choice. I would definitely return, but I’m giving 3 stars instead of 4 because we were sort of forgotten after our desserts were brought to us.",
   "It is a small place with a lot of intimate areas. The menu is large and they have no issues with customizing your order. The portions are large and the food is very good. The eggplant parm is an appetizer and nicely done. They have a small area in the back with a large table for both groups. The place fills up fast. Even early so reservations are a must. The bathrooms are spacious and very clean.",
   "We ordered takeout during the mandatory lock down and were anything but unsatisfied. For starters the bread was phenomenal, soft inside with a good amount of crust (the olive tapenade is delicious and that's coming from someone who doesn't like olives at all!) . We ordered the Mixed greens and Cesar salad and were blown away by how flavorful the dressings were. For our main course we ordered the Chicken Antica and the Mediterranean and were delighted by how savory the sauces were. Chicken was juicy and well prepared. Abundant amount of shrimp in the Mediterranean with an amazing sauce. Overall it was a great meal and we will definitely be ordering from them again and look forward to eating in the restaurant once that's a possibility again. Highly recommend!"
  ]
 },
 {
  "name": "Athos Restaurant",
  "address": "1814 Western Ave, Albany, NY 12203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f5986f6-932d-11ea-b8a0-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "delicious",
   "food",
   "music",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5374791326538534398",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely delicious fresh food. From the lamb infused burgers with hints of garlic and onion, to the thinly sliced lamb on a Gluten Free pita, oregano fries, and oh those homemade Greek style chicken wings. Sheer heaven. Terry, barkeeper and host was amazing, sincere and eager to make your night spectacular!! This will be my \"go to\" spot. See you there!!",
   "Wow, what an exceptional restaurant!  Aside from the wonderful service, the food was all delicious!  The hanger steak was exquisite, and all of the appetizers were very delicious!  Lovely calamari, very tasty hot feta dip, among other things like the eggplant appetizer.  Really wonderful desserts, including the baklava, lemon sorbet, which came out inside of a lemon (very classy), and really tasty rice pudding.  Great wines from red to white!  For a 5 person dinner we had the most wonderful 3 course dining experience and every penny was well worth it!  We will be back often!  The setting is also very classy with a great live music set up at the front of the restaurant.",
   "Excellent Greek food. They cook to order so plan on a long enjoyable meal. Food is expensive but that is paying for quality and taste. Very good, even the simple things. \nMy only complaint is how noisy it can be when they are close to full. The beautiful hardwood floors and wood work reflect all the sound.",
   "Great place for dinner!! Food quality and presentation is fantastic!! We had the vegetarian platter and the our friends had the Octopus. Overall a terrific experience. It is pricey but all worth it",
   "One of the best Greek restaurants I've been to. Service is outstanding. Friendly and knowledgeable staff. Our food was served hot and fresh without a long delay. I highly recommend this restaurant if you are in the area."
  ]
 },
 {
  "name": "Caffe Italia",
  "address": "662 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9fd8a552-932d-11ea-baa8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13317023613409159498",
  "source": "GoogleMaps",
  "reviews": [
   "This is the real-deal Italian restaurant. Small and  intimate makes it a great ‘date’ place as you can hear each other. It’s fantastic for a special celebrations too! Imagine Frank Sinatra, coming in from the back, to meet up with some pals. Can’t say enough about the food. Everything is fresh fresh fresh! Meatballs are my favorite. I’m hoping they’re open for takeout. Please try this delightful little culinary secret. I promise you’ll be back.... frequently.",
   "Best Italian food in Albany. I went here for my birthday and had a great time. The atmosphere, food and dining experience make you feel like you are at a high end restaurant in New York city. The wait staff are amazing and really take care of you. The place is always full. You will leave satisfied.",
   "This is an absolutely fabulous Italian restaurant!! The staff is wonderful and the food is delicious! When you go there for dinner, you're welcomed as family. Top notch, never disappoints!!",
   "It was great . Went for my first time today. The  food was amazing and the staff was friendly and very informative.  Definitely on my list of places to dine now.",
   "We fondly remember our first meals at Caffe Italia. They included a trip to the liquor store on Allen St. to get our wine, a polite and professional waiter, and a very impressive linguine with steamed clams and white sauce that had ample garlic. The classic pot of espresso, with a bottle of anisette placed on the table, accompanied their home made cannolis to finish our meal. Time passes, now a thorough brigade service anticipates your needs, artfully navigating through a packed house. Our evening's entrees; Veal Luciana, Seafood Primavera and, of course, linguine with steamed clams and white sauce, were delicious and substantial. Caffe Italia remains true to its traditional \"Romeo Way\", but we do miss the pot and bottle to finish the meal."
  ]
 },
 {
  "name": "Café Capriccio",
  "address": "49 Grand St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a01e12da-932d-11ea-97e9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=9008719252397872336",
  "source": "GoogleMaps",
  "reviews": [
   "Came here when we stayed in Albany, they have great pasta and ravioli. The burrata ravioli was so good. My husband said this is the best Italian restaurant that he has never had. Leave some place for the dessert, it won’t disappoint you.",
   "Unassuming, delicious Italian gem nestled Albany! The staff is tremendous, the dishes exceptional, the pricing... Leaves something to be desired. Will still definitely return!",
   "We come here every year for Valentine's day, never disappoints! Cute romantic spot. Reservations are usually needed.",
   "Albany is not short of it's fair share of amazing Italian Food. This place is spot on. Old school Italian style food, a little more traditional. Everything is prepared perfectly and the staff is amazing. Ownership really prides themselves on excellent quality",
   "Excellent old world Italian. Perfect for a quiet night out with the better half. Area it is located is a bit sketchy but the restaurant is worth the issue. Staff is always very cool and knowledgeable."
  ]
 },
 {
  "name": "Barcelona Restaurant-Wine Bar",
  "address": "1192 Western Ave, Albany, NY 12203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a06770e8-932d-11ea-8400-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "organized",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5794492233649798344",
  "source": "GoogleMaps",
  "reviews": [
   "Nice cozy place with good food. \nService is good if place not crowded. \nBeer selection really limited, no draft, bottles only. Wine selection much better. Need more visits, will return.",
   "Great place in North Albany. The wait and bar staff were awesome, and the food was great as well. I went on a Wednesday night, and it was pretty full, which is a really good sign! If you like Spanish dishes and good Spanish wine, this place is great and off the radar.",
   "Chicken paella was amazing and authentic. Fresh bread and olive oil delivered to table. Friendly and effective staff. Clean environment. Nice music.",
   "Barcelona's is the best bang for the big in Albany. Reminded me of what good food is all about. This restaurant is clean, organized, and we'll serviced. Easily five stars.",
   "What a delicious find in Albany!!  I stopped in this adorable place last week and had the best meal of my life!  What did I have you ask?  The chicken riccollano and it’s to die for!! Great food, great service and you too will be a regular after one try!!"
  ]
 },
 {
  "name": "Jack's Oyster House",
  "address": "42 State St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a0b82294-932d-11ea-8caa-14b31f159f22.png",
  "tags": [
   "eat",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1161362259226071976",
  "source": "GoogleMaps",
  "reviews": [
   "Class act and old world. Like stepping back in time in a glamorous way!  I do not live in the Albany area anymore but I was looking forward to going to Jacks.  I was with my mother and mother in law who loves prime rib.  The reason we picked Jacks was because you can get a steak or lobster, etc.  We went for lunch and I was very disappointed in the very limited lunch menu.  We all found something on the menu to eat but there were no items on the lunch menu that would be the reason you would think of Jacks.  We had a nice meal but the lack of any steak and only one seafood entree on the lunch menu really missed the mark!  That's why only 4 stars.",
   "Went for a special occasion. The service was excellent and so was the food. Got a free cheesecake that was amazing due to our celebration. Waiter also took our photo and gave us a nice Polaroid to take home. \n\nWorth the hype and the money.",
   "One of the best restaurants in Albany, NY hands down! The staff is extremely helpful, friendly, and professional. I ordered the famous Nantucket Soup which is an appetizer. Once I tasted it I immediately wanted another one and knew I would be coming back here again! I also ordered the Crab Cakes from the lunch menu and my wife ordered the Black & Blue Burger. We were both blown away by the flavor and taste of the dishes. I have since gone back and had dinner there by myself because it was so good the first time! Highly recommended!",
   "Amazing food & service!  Thomas and staff very attentive. Great ambience.",
   "Jack's was wonderful. I had not been there in over 2 years. After a wonderful weekend this was the way it should end. Jason our waiter was great. Going back."
  ]
 },
 {
  "name": "Kismet Mediterranean Grill",
  "address": "1116 Madison Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a0faaaf6-932d-11ea-aa4f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "unique",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7966563084780974852",
  "source": "GoogleMaps",
  "reviews": [
   "The food is nice, coupled with a beautiful ambiance. The service is also pretty good, they like to take care of their customers. The reason I am giving it four stars is, I felt the taste did not justify the price. However, I am not saying the food was bad, rather I expected a little more in terms of either the quality or quantity based on the price.",
   "We moved to Albany from Texas like a year ago and since then we were looking for a nice Mediterranean restaurant like back in Texas. Finally we found it! Great food quality and rest and a really nice sitting environment.",
   "A special place on Madison Ave's restaurant row. My first visit and I was impressed with the menu selection. We had an appetizer, main course and dessert, all met our expectations. Our server was knowledgeable and friendly.  I will definitely go again.\n\nGive it a try....it is worth the visit.",
   "Very clean and tidy, with pleasant decor.  Professional prompt service, good dolma.  Lighting is a bit harsh (I'm guessing either CFL or LED); softer incandescent bulbs would be a big improvement, maybe even candles.  Unique Turkish Coffee.",
   "The restaurant has a great ambience. The food is delicious and has good aftertaste. The one thing to mention is smaller table size which makes it difficult to move dishes when you are with someone."
  ]
 },
 {
  "name": "Cafe Madison",
  "address": "1108 Madison Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1463434-932d-11ea-99c5-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15400892633059547035",
  "source": "GoogleMaps",
  "reviews": [
   "I went here with my parents and fiancée and we had a great breakfast experience. I absolutely loved their Vegan Breakfast Sandwich- delicious! I never thought I would enjoy a breakfast sandwich so much! The staff is also phenomenal.",
   "Loved the quick service even though we came in at 2:30pm and they were about to close at 3:00. We were treated very fast and politely. Great atmosphere and good value for the portions they give you.",
   "Super chill little pub cottage feel.  Food was amazing. Honest salmon omelette was delicious.  The bread is made in house and as thick as a mattress. Cold press coffee was better than cocaine. I just felt like the customer experience could’ve been a little better.  Very low energy,  staff might have been hung over",
   "We got the Mediterranean Omelette and Stuffed French Toast. OMG it was amazing. The coffee was flavorful and the service was outstanding. The only down side... the wait. But absolutely worth it!",
   "Really good brunch. We went here for a late Sunday brunch and sat outside. Our server was really kind and fast, and was sure to refill our drinks every time. The food was also really good. I got the berry & Brie crepes and my boyfriend got the eggs Benedict. They were all amazing!"
  ]
 },
 {
  "name": "The Cuckoo's Nest",
  "address": "234 Western Ave, Albany, NY 12203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a19c932c-932d-11ea-9ed3-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "family",
   "food",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9170328846519468463",
  "source": "GoogleMaps",
  "reviews": [
   "Just had the family style roast chicken meal and could not be more impressed. The ordering process was so easy. The food was outstanding. I don't know what part was my favorite because it was all so amazing. You can tell how much effort they put into each and every meal. Will definitely be returning. Thank you for still serving during these times.",
   "Such great food and an amazing staff.  My family and I have been going here for a little over a year and the food is consistently delicious.  We met the head chef and owner today, who were super welcoming and friendly.  The staff is super.  Great mix of savory and breakfast/sweet menu items...like chicken. And waffles.  Their French toast and home fries take it to the next level though!",
   "We just ordered the family style fried chicken meal and holy smokes. First, the ordering process was fast and easy. I called around 1:25pm, and chose our pick up time for 5:30. At that time I walked in, my bag was labeled with my name, and boom. THE FOOD WAS AMAZING. The biscuits are so good; fried green tomatoes should be the title of a movie; and the fried chicken was superb. We’re so fortunate to have places like this, and even more proud that they are providing meals to hospitals, first responders, etc. “during these uncertain times” [btw thanks for your email every giant company I’ve ever thought of]. But seriously, order a meal from Cuckoos Nest, you’ll be pumped.",
   "A cozy atmosphere hosts very good food and great cocktails. The crave chicken sandwich and grit tots are excellent. Our waiter Miles was very helpful in helping us choose what tot get. Will definitely eat here again next time we're in town.",
   "May be the best southern cuisine in Albany (it's my first time here)... best chicken sandwich I've had in a while. Tasted the chicken entrees too but found it salty. Other than that the rest are good.  Stopped by in Albany on the way to VT. Tip: plenty of parking space right behind the restaurant."
  ]
 },
 {
  "name": "Umana Restaurant & Wine Bar",
  "address": "236 Washington Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1ec6252-932d-11ea-9457-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12964983625612950490",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing brunch! Great flavors & drinks! I went out on a limb & ordered the Cool Mango Bloody Mary & am so glad I did. It was perfection! Might be my new favorite brunch drink as I find typical Bloody Mary's are usually overkill with the horseradish. The staff was so friendly. I really enjoyed the entire vibe of the space. We will definitely be back.",
   "This place is very warm and inviting! Today they had a live band for their brunch and they were very good. This was also my first time and I will be going back. The staff were very friendly and my food was made promptly and was delicious.",
   "Delicious international food!  The fish tacos were amazing.  The service is friendly and quick.",
   "This place is the best! Really cool atmosphere, the friendliest staff, and AMAZING food. I had been meaning to make it for brunch for the Chicken and Red Velvet Waffles for a long time and they exceeded the hype!",
   "I don't know where to start with this restaurant. We had such a pleasant experience. We were looking to host an intimate bachelorette evening and they delivered. They curated a beautiful wine tasting and menu that was absolutely amazing. We had the most such a great time and the food was great. Thank you for helping us make this day a special one."
  ]
 },
 {
  "name": "Sweet Basil Thai Restaurant",
  "address": "370 Delaware Ave, Albany, NY 12209, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2345928-932d-11ea-a545-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15337377502407317314",
  "source": "GoogleMaps",
  "reviews": [
   "Went there for lunch during quarantine. The cashew and mushroom entree and the mango curry were our favorites. Reasonably-priced, ready in 20 minutes. Very good, will return!",
   "Absolutely incredible. The food was delicious, the atmosphere is great. Everyone is so sweet and kind. Definitely going to be coming back!",
   "Some of the greatest Thai I've had in Albany, ordered green curry tofu and it was the most delicious tofu I've ever had!",
   "This place was excellent, great food, nice presentation of the food, taste was great. Service was good and the place was clean. Going back.",
   "Very busy on Sunday nights. The foods are really good. If you like Thai food , you will like this restaurant. Recommend the wings and curry rice. And the soup is very creamy and just like what I got in Thailand."
  ]
 },
 {
  "name": "Tanpopo Ramen and Sake Bar",
  "address": "893 Broadway, Albany, NY 12207, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a28b2e48-932d-11ea-8b69-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11155816885268573660",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. My husband and I go often and we usually are able to sit in the same booth every time. Sometimes it gets crowded on a Friday night but that's to be expected. I enjoy the food, the atmosphere, the beer, and the service. We've brought friends and they loved it too.",
   "Ramen was tasty but the conditions of the place are very old, dirty, and broken. It was hard to be there. Again. The soup was good. But I kept wondering about the conditions and couldn't help myself thinking about the germs in the kitchen and around us. Is the kitchen as dirty and greasy as everything around us? The bathrooms were ridiculously small. How can you (or waiters) clean yourself there?",
   "Absolutely delicious! Seats are a little uncomfortable, hard solid wood booths or metal stools. I only mentioned because my husband has back issues and was ready to leave as soon as we finished. We've been looking for good Ramen closer to home and we certainly found it!",
   "One of my Albany favorites! If you want authentic ramen in the Capital Region, this is the best place to go to in my mind. The atmosphere is very cool, despite the somewhat cramped dining area. If you don't mind being a little squished - when it's busy, that is - then you'll love it here!",
   "Happened to come across this restaurant in an old industrial area that seems to be attempting a revival as a hip residential area. Small diner turned ramen noodle shop. And what an excellent job they did. The ramen is well done, both the noodle and the broth. Fellow diners said the pork dumpling was excellent, too."
  ]
 },
 {
  "name": "The Paper Dragon",
  "address": "5 Clinton Square, Albany, NY 12207, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2d509fe-932d-11ea-ac08-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9156651082016557676",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and outstanding service!  My new favorite place in downtown Albany.  I appreciate the many vegetarian and vegan options! Gotta love the breakfast served all day too.",
   "You DEFINITELY want to eat here. The food is out of this world. The chef is like a culinary Rick Sanchez pulling the best flavors from the food multiverse, taking your taste buds on the greatest thrill ride to euphoria!!!! Literally a party in my mouth and I look forward to eating here every time. The Asian fusion is done with perfect execution giving you a truly unique experience.",
   "Food is great 🥯! Coffee is good (Chris's coffee)☕. The view is fantastic 🏙️. I love the little reggae dub playing in the background 💚. And the staff was nice and very attentive 👍.",
   "Best vegan breakfast in the area. The owners are awesome. Highly reccomend! They have options for everyone and the food is amazing.",
   "Love the diversity of their menu. It's a new age- ma & pa shop.  Breakfast (options available all day) and lunch options . Vegan, vegetarian and carnivore friendly! And there is more than just tofu and salads. Me and my friends have tried over half the menu and have not had one complaint. The bowls are a great size, definitely suggest if you are hungry! \nMy friends love the Jax- typically sells out due to popularity. But the #1 for us all is the Garlic Potatoes!!\nIt's our favorite lunch spot. I cannot wait to see what else they created!"
  ]
 },
 {
  "name": "Provence Restaurant",
  "address": "Stuyvesant Plaza, 1475 Western Ave, Albany, NY 12203, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a318cad8-932d-11ea-a150-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18285668652682801421",
  "source": "GoogleMaps",
  "reviews": [
   "We celebrated the arrival of 2020 with lunch at Provence. Their seafood chowder and quiche Lorraine is to die for. We shared a bottle of wine and had dessert. We had a great time. Happy New Year!!",
   "best place to have brunch with colleagues",
   "Horrible food that was very overpriced. I had a lobster \"bisque\" that was little more than a flavorless broth with a cracker in it. The main course was a portion for a super model and was of similar quality. We had to wait almost an hour and a half  before we had our appetizer. I'm not sure what the issue was but the waitor blamed it on the kitchen and gave us a free bottle of champagne over it. Regardless it was clear that there was a serious lack of communication with the staff. I will never go back. Have never been more disappointed. 🙁",
   "Excellent \"French\" cuisine adapted to local US tastes. I had the quiche and it was excellent. Excellent service, attentive but not bothersome. Nice ambiance.",
   "Service ok. Temperature inside front room was, to say the least chilly. When we requested to be moved they said it wasn't possible even thought there were at least ten options in the back. And at least three still empty as we left. I don't think they took into account that the sub Arctic air blowing in every time front door opened. No fun had! Also food arrived warm not hot."
  ]
 },
 {
  "name": "Wellington's",
  "address": "144 State St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a35c3dc0-932d-11ea-b790-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "knowledgeable",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17037755206941109676",
  "source": "GoogleMaps",
  "reviews": [
   "Couldn’t walk in because I didn’t know where the entrance was, called and was directed in through the hotel. Walked in and was sat immediately. Breakfast menu was simple and direct and the options just right, price was a bit high, but like the normal diner high. Everyone was nice and the atmosphere was pleasant. I got a window sofa chair type seat and the view outside was serene and calming. I ordered a egg Benedict and green tea. Food was good. It was also the only place open on Christmas and it was warm. Quick tip, your water glass smelled a bit funky 8/10",
   "The food was amazing.  But best of all, our server Salvatore was the best ever. Very knowledgeable about the dishes and he explained everything very well. He is a great asset to your  stablishment.",
   "Really nice venue, friendly staff and great bar service. Bartender Alanna, very prompt and attentive, politely and friendly - she's great at what she does. Enjoyed the drinks \"Hip Hop Anonymous\" was my favorite. Will definitely revisit.",
   "Good food, good service. I get grilled salmon every time I go - it's delicious and I can't seem to cook salmon as well at home. (I try to only order things out that I don't cook at home.)",
   "I highly recommend the weekend breakfast/brunch menu. Pancakes are amazing as well as the honey whipped butter. NY Benedict was worth the price in my opinion. Dinner is great for the most part. The best thing about this place for me is the Campfire in a Jar. It is one of the best desserts I've ever had. I love the modern interior and cool ambience."
  ]
 },
 {
  "name": "ama cocina",
  "address": "4 Sheridan Ave, Albany, NY 12207, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a3a8ff8a-932d-11ea-8af5-14b31f159f22.png",
  "tags": [
   "food",
   "creative",
   "food",
   "food",
   "eat",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1161002591333867854",
  "source": "GoogleMaps",
  "reviews": [
   "Such a fun place with a great wait staff and so many options for food and drinks! Definitely would come back over and over to try more dishes! Would recommend the vegetarian pizza for an appetizer and trying a few cocktails!",
   "Just alright.  Was excited to try this place, I've always heard good things.  Ambiance was cool, good location, fun menu.  Service was good and prices seemed fair.  Food was fine, but not great.  Pretty greasy, not much flavor (especially considering the creative menu), and didn't seem all that fresh.  Might give it another shot someday, but not going out of my way to do so.",
   "Some the best Mexican food I have ever had in a very cool setting.  Underrated as a lunch place.  Be sure to make a reservation--especially if there is an event at the TU Center.",
   "Nice food and not expensive. Try the chicken and tortilla soup, next soup I had in my life. When I finished mine I had to eat my friend's too. Cool decoration albeit not Mexican, and friendly staff. We were a group of 7 and we had a take booked online, however the place was half empty on s Fri night so I don't think reservations are needed.",
   "Modern Mexican restaurant with hipster vibes in a nicely maintained and safe neighborhood. Very friendly staff who was very helpful to advise regarding gluten free options on the menu. Recommended to visit."
  ]
 },
 {
  "name": "Van's",
  "address": "307 Central Ave #2508, Albany, NY 12206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a406636e-932d-11ea-9948-14b31f159f22.png",
  "tags": [
   "affordable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3356802373908432953",
  "source": "GoogleMaps",
  "reviews": [
   "Great dinner, we both had a great overall experience, definitely a new favorite. We ordered the  summer rolls to start +  main courses. I ordered the Grilled marinated lemongrass chicken and Jon ordered the Grilled pork with the noodles.  We both had leftovers. Wine is inexpensive and affordable with your meal @ $6 a glass. The place was packed, with 15 out of the 20 tables filled and two waitresses + kitchen staff running around filling glasses and bussing tables.If you plan on visiting on a Saturday night, maybe call ahead because we arrived around 6 and it got super busy after us. Definitely a favorite restaurant for great Vietnamese.",
   "Well done Vietnam foods. We had few kinds of pho and vege dishes. Vege dish was  very fresh and good. I like it! They put tofu in rice paper. Oxtail pho was really aresome. Deep broth make me happy.",
   "I've been coming to Van's for the past 5+ years. Every time it does not disappoint. Real authentic Vietnamese cuisine and service is always fantastic.",
   "Delicious food! The shrimp summer roll and the peanut sauce was nice, the Pho Ga was mild and flavourful. The boneless crispy duck was a surprise..the outer layer of spice was superb! The Vietnamese Hot coffee with condensed milk is a must try..overall good service!",
   "I tried the crispy duck and it was really amazing and cooked perfectly. The spring rolls were also great. I can’t wait to go back and try more dishes."
  ]
 },
 {
  "name": "dp An American Brasserie",
  "address": "25 Chapel St, Albany, NY 12210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a45e972c-932d-11ea-9bd0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16904520798135466411",
  "source": "GoogleMaps",
  "reviews": [
   "I love love this restaurant. The food is delicious and fresh. The Indonesian noodles and short ribs are an must of you go.",
   "Overall, everything was delicious and our server, Amanda R, was top notch.  Great selection of beverages.",
   "Snooty waitress and the food was a poor value👎👎",
   "Diverse menu, nice portion sizes and delicious food!",
   "Everybody's food was great... our only disappointment was that they ran out of the desert special we all wanted to try... #greatfood"
  ]
 },
 {
  "name": "Navona",
  "address": "289 New Scotland Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4b03b18-932d-11ea-bf69-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "nature",
   "creative",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8427986375607984661",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food! Tonight we had take out steak, their amazing bread and bottle of wine. Even in take out containers, the food was plated beautifully.  We are always greeted by their friendly staff and enjoy chatting with them. Food is always exceptional! Can't wait to get back to normal and sit at the bar.\nSupport this incredible restaurant now more than ever!",
   "Nice atmosphere and interesting dishes from breakfast pizza to quinoa salad with salmon. I personally enjoyed the pulled pork sandwich. The place is good for a team lunch. The long table in the back can accommodate a dozen plus people in a quiet atmosphere. I enjoyed the place!",
   "We usually go here for dinner but today we tried their lunch and it was ✨stellar✨. My husband got the pizza navona (margherita pizza essentially, fresh Italian style pizza made in a brick oven, best in Albany) like he usually does and I got their reasonably priced ($15) salmon. It was a proper portion which meant I was unable to overeat its deliciousness like my American nature wants to and FULL of flavor, the roasted asparagus, greens, and onion in the yogurt sauce was sooooooo good. We also got the chickpea panzanella side ($3, great price for a decent sized side that most places would charge $6 for) and were very pleased. I do wish they had pasta offerings for lunch besides a pasta salad, but I was not displeased with my options. I'll be back and I'm probably going to have to try their turkey pepperonata sandwich next. 🤤🥪👌",
   "Great meals at a good price. Creative menu, from grilled cauliflower to steak. Pizza is amazing! creative soups, salads, excellent wine list, variety of brewed beverages, never got to dessert! Spacious and inviting light wood finished dining room, and dining porch in season. \n\nWe will be back!",
   "Went for Happy Hour,  appetizer and pizza specials.  I had the Mr. BILL Pizza.  Meatballs and Salami.  Delicious and only  $8."
  ]
 },
 {
  "name": "Savoy Taproom",
  "address": "301 Lark St, Albany, NY 12210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4f386da-932d-11ea-be4e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17755085418369709173",
  "source": "GoogleMaps",
  "reviews": [
   "LOVE THIS PLACE!! Mostly on the first Sundays of the month when they have a mimosa bar. The mimosas are great, the prices are not too bad to be honest, and their breakfast items are BOMB! I recommend the Farmers breakfast.",
   "Make your own mimosa (first Sunday of every month) is a must try! This just so happened to land on my 21st birthday and it was a great way to start the day. Food is reasonably priced for the high quality taste. I ordered the crème brûlée French toast and it was delicious!",
   "Live music, old fashion cocktails 🍹 \nPretty good, some nice people around, people enjoying drinks and food, in general not bad, could be better.\n😁\n.\n.\nYou're lucky, I saved this place for one if my faves.\nSee u soon",
   "While the bartender was very pleasant, clearly the kitchen was attempting to pass along food very poorly prepared. My friend and I both ordered their $14 Reuben sandwich. Both came out burnt, with over done fries. Really disappointing since clearly they attempted to use some really nice ingredients. We had order at later point in the evening, and perhaps the cooks felt that we were the standard intoxicated crowd, given the large numbers of bars in the area, unable to tell the difference. However, we weren't and left disappointed. My best guess is the bartender felt a bit embarrassed about the food, as once it was laid in front of us, eye contact was not made again until it was time to pay. That being said, she listened to our displeasure at the meal professionally and completely. Perhaps, the only saving grace for this location.  The location itself is nicely decorated, however stay away from the restrooms if possible, as they have a very strong odor reminiscent of some dive bars with the ice filled urinals of old. All being said and done, this location left an actual bad taste in my mouth, and while I hope they begin to produce a product worth consuming, I won't be returning.",
   "This is a place that many people bring up, but I feel disappointed for the price of the things on the menu and the level of satisfaction I felt.\n\nI've come here twice, and feel I spent $30 for a $20 experience each time. It's not much money, but the disappointment stings. It's slightly above average food, presented well at a higher price point. But Applebee's is just as good.\n\nThe staff are nice enough. It's less loud than Lionheart which is about next door, and I feel has equivalent food, so it's a matter of preference. \n\nThis is a decent enough place meet someone for a short bite, but I don't see any reason to go out of my way for what I get here."
  ]
 },
 {
  "name": "Risotto",
  "address": "320 Northern Blvd, Albany, NY 12204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a54bba9c-932d-11ea-9d6b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12254308150098081113",
  "source": "GoogleMaps",
  "reviews": [
   "The bench seats see too low but the food was excellent. The fried cauliflower is indeed spicy. The bacon jam on the steak tips are awesome. Crab cakes are proper with more crab than cake. Everything that was in the seafood puttanesca was cooked to perfection. Based on all the other clear plates at the table, it's safe to say you can't go wrong with anything on the menu. Get some.",
   "Went for Brunch with a group of friends . Everyone loved it and we all look forward to going again!!! If you like waffles you must try a waffle dish. They look beautiful and fluffy and taste even better!",
   "Delicious dinner and nice atmosphere. Staff was very friendly I'd definitely recommend. This place is near my house and this is my 1st time here I will be back. Worth every penny!",
   "Went here for Valentines Day with my boyfriend. The staff was so friendly, the food was delicious, and the portions were decently sized. A garden salad and pita bread with oil came with both of our meals. We also ordered the crab cakes, which I highly recommend!",
   "First timer. Wonderful presentations and the dishes had a delight \"twist\". Well prepared and delicious. Will definitely visit again."
  ]
 },
 {
  "name": "Berben & Wolff's",
  "address": "227 Lark St, Albany, NY 12210, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a597ba4c-932d-11ea-aa52-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11085028599174881215",
  "source": "GoogleMaps",
  "reviews": [
   "This place is great. The food is not to costly and it taste awesome. The place does have sits and a bathroom but it is not very big. The staff is friendly and welcoming. When I come back to Albany this will be my first stop.",
   "Walked in just after opening and was greeted right away. Had some awesome punk music jamming which I really enjoyed. This was my first all vegan meal and I gotta say it was wonderful! The sunflower burger filled me up and had a wonderful array of flavors.  Will definitely stop here again and highly reccomend to people",
   "So amazing!!! Berben and Wolff’s is my favorite way to treat myself to a delicious vegan meal. All of the food is amazing. All the things I thought I couldn’t eat anymore since going vegan they have here.",
   "I love the food, but the amount of waste is ridiculous. Have you guys heard of normal plates? Presentation is lacking. I'm dining in I don't want single use everything (besides forks, until they run out). Believe it or not a lot of people go vegan for the environment and your excessive use is really deterrent for those people. \nThe side containers are recyclable but you provide no area to do so!",
   "Very good quality vegan food. The coffee's great too. While you can have these anytime of the day, this is perfect for breakfasts. The ambience is wonderful!"
  ]
 },
 {
  "name": "The Point",
  "address": "1100 Madison Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5e1b62c-932d-11ea-b9d5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1708238265541360748",
  "source": "GoogleMaps",
  "reviews": [
   "The food was absolutely amazingly there. We were treated very well . service was pretty fast. Would definitely go again when I'm in that area",
   "Amazing drinks and really comfortable atmosphere. Bartenders are great, especially Elaine!! Food is awesome (when made properly).",
   "A popular place however  check the peak times  beforehand it gets really loud. And the cook burnt  my salmon and over cooked it. Drunks was good though.",
   "Food was great. Nice ambience. Dining space was some what close knit. Finding a parking space was the only big problem at this location.",
   "Top-notch food at fair prices. Spacious venue in prime location. Efficient service and clean bathrooms. Décor seems somewhat out of place. This place I discovered after attending Larry Sharpe's debate at the nearby College of Saint Rose."
  ]
 },
 {
  "name": "El Loco Mexican Cafe",
  "address": "465 Madison Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6259e50-932d-11ea-a855-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17769677116496950195",
  "source": "GoogleMaps",
  "reviews": [
   "Best Mexican food in Albany! Great margaritas and friendly service. Prices are reasonable too.",
   "I was in the mood for tacos and we stumbled across this place. It is a MUST visit. The food was so extra wonderful. I can't even wax poetic. I'm still coming down from the food high. My son had 3 tacos. My husband and I had shrimp fajitas. My husband also had the spinach and mushroom burrito. Delicious isn't a great enough word for the foods we ate.",
   "Haven't really found a decent local food spot since I moved here 3 months ago. My girlfriend and I decided to try the place out. We ordered the loaded burrito and blue corn bread. Everything was delicious especially the blue corn bread. The employees were very helpful and nice as well.",
   "One of the better places for Mexican food in the Capital District. The staff is great and the food is always fantastic. Quaint location and parking is good. I have been here 3 times and will definitely be back.",
   "Friendly staff, walked my take out back to the Hilton where I was staying to enjoy it, but the restaurant wasn't too crowded, very nice atmosphere. Food was pretty darn good! A little pricier than expected but company paid so no complaints. I got the combo (taco, enchilada, and rice and beans) (beef)"
  ]
 },
 {
  "name": "Taiwan Noodle",
  "address": "218 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a676f40c-932d-11ea-a6e5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "organized",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9963539230334334227",
  "source": "GoogleMaps",
  "reviews": [
   "Are inside late on a Friday night and it was empty. However, the service and food was still great. We had some dim sum and bubble tea, all pretty good. Neighborhood was a little sketch this late at night, but otherwise great experience.",
   "Hello! 5 stars. Who would have thunk it, a great Taiwanese restaurant in middle of NY upstate.\n\nGot soup dumplings and spicy sour steamed dumplings, both great.\nOur group ordered house special soup (beef and pork chop) with thick noodles, mapo bean curd, beef and curry pot and fried chicken with fried rice.\n\nWe were not really hungry, but that changed when food arrived, we killed each dish. \nVery rare we order many and all turn out to be good.\nPrices were fair too.\nWill be back, highly recommended. Thanks.",
   "Taiwan Noodle is absolutely amazing! The place may not look like much from outside but the food is tremendously delicious and authentic. The restaurant is clean and well organized. I will definitely be coming back often! Also the service was very good and all the workers friendly!",
   "Homey Taiwanese food. Authentic, but nothing that will blow your mind. They’re consistent and the flavor is solid. Great type of food for a rainy Sunday afternoon. The minced meat and egg rice is the best, along with their beef noodle soup. The bamboo rice is lacking because the flavor from the meat failed to deep into the rice. This is the type of place for a quick meal and home style cooking. Reminded me of my times in Taiwan, but didn’t quite hit the mark.",
   "Definitely would come back here for their dim sum! All of it was good and reasonably priced. The seafood casserole was filled with perfectly cooked seafood, but may not be everyone’s favorite dish. Their noodles were just fine."
  ]
 },
 {
  "name": "New World Bistro Bar",
  "address": "300 Delaware Ave, Albany, NY 12209, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6bc1492-932d-11ea-b8a1-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "unique",
   "walk",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17247381415948676633",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent cocktail. I recommend the Reticent Ryder. I had the grass fed steal with Brussels and chorizo  mashed potatoes. Delicious!",
   "One of the best and most unique restaurants in the area.  Everything they serve is super flavorful.  They also have unique (and delicious cocktails).  My only knock is that there is limited parking and the lot is very, very tight.  Recommend parking on the street and taking the short walk.",
   "Wish we lived closer to this great place. Perfect ambience, amazing service, delicious food. Truly a 5 star experience from start to finish. \nAmazing vegan options for apps, entrees and desserts... best vegan food in Albany!",
   "Very good! Purple Haze Wings had a pretty decent bite, by resturaunt standards, but also good flavor. I had the Risotto,  and I was very happy. Service was very quick too.",
   "Delicious food, friendly service and a classy atmosphere!"
  ]
 },
 {
  "name": "Mamoun's Restaurant",
  "address": "206 Washington Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a703a648-932d-11ea-b64d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13071743978722073484",
  "source": "GoogleMaps",
  "reviews": [
   "This may be some of the most delicious food I have ever put in my mouth! Charming little restaurant with tremendous service! Highly recommend!",
   "Very friendly service, got exactly what we ordered. Food was great, nothing fancy, but very tasty and well-seasoned, not overpowering. And decent prices!",
   "Best Falafel in Albany and some of the best I've ever had anywhere. Usually order take out but the dining room is cozy and full of charm. Service is always excellent as well. Definitely one of my top 5 favorite places to eat in the city.",
   "Absolutely awesome food. The falafel were crisp and moist. Kabob plates were absolutely delicious. Zucchini app was super flavorful. Also don't forget the bakalva! So yummy. Everything we ate was better than the next. Delicious middle eastern cuisine!!",
   "Food was excellent as always. Over the past 20 years Whenever I am visiting Albany I make it a point to stop there for dinner. Although the restaurant has changed hands-on number of time the quality of the food has not diminished. The owner of the restaurant was kind enough to take 25% off of our bill because we were having dinner 45 minutes before the sale price was slated to begin. Woul highly recommend"
  ]
 },
 {
  "name": "Salsa Latina",
  "address": "315 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a74df71c-932d-11ea-b086-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "music",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10764098324140403322",
  "source": "GoogleMaps",
  "reviews": [
   "Just spent $27 on online delivery before tax only for tmit to show up 20 minutes before the scheduled time. COLD. He had no change on him. \nMy ENCHILADAS that are smothered in sauce and came with beans and rice did NOT HAVE ANY SILVERWARE. \nSo now I'm out $40 and can't even eat this sub par food. \nNo napkins either.  \nWill not be ordering again.",
   "Very flavorful and generous portions of food. Liliana our waitress was amazing! I had fish tacos and they came with refried beans, rice and corn tortillas. Very authentic and the music it's lovely. They had classics Latin artists. People are very nice and everything is clean and neat.",
   "Seafood stew was great few weeks ago and last night the seafood platter was just delicious!!  Tostones are hot and crispy. Definitely go to Salsa Latina👍",
   "Really like this place. Their food is really tasty, authentic, reasonably priced. Authentic Latin American food is difficult to find in the Capital District but you'll find it here. Atmosphere is nothing super-special but makes for a pleasant dining experience. Wait staff is really nice and helpful. A lock",
   "Food was absolutely amazing, and the wait staff were great."
  ]
 },
 {
  "name": "Crave",
  "address": "217 Western Ave, Albany, NY 12203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7895380-932d-11ea-af87-14b31f159f22.png",
  "tags": [
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=3152201080506159226",
  "source": "GoogleMaps",
  "reviews": [
   "This burger was so amazing! Bacon cheeseburger, with pepper jack cheese & an egg on top! So flavorful and fresh. The fires portion could have been bigger. Price was accurate for the type of burger. When in Albany, I highly recommend this burger hot spot",
   "Very good food. Nice atmosphere and great frozen yogurt",
   "Good burgers. Meaty and saucy. Make sure you order french fries too!\nTry a truffle one.",
   "I had the loaded fries and black and blue burger, my boyfriend had cheese fries and the bacon cheese burger and my son had the crave cheese burger, the fries alone are enough to share with 3 people and the burgers are amazing! I highly recommend the loaded fries with avocado, banana peppers, scallions, tomato's and chives with a cheese sauce. We will be going again!",
   "Great tasting burgers which are always cooked perfectly.  Staff is very friendly. Try the Crave sauce on your burger.  Worth the trip from anywhere."
  ]
 },
 {
  "name": "Iron Gate Cafe",
  "address": "182 Washington Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7d0bdec-932d-11ea-9761-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=2045058433553938197",
  "source": "GoogleMaps",
  "reviews": [
   "I use to come here every Sunday for breakfast because the food is always so incredible. Today I drove 4 hours just to have lunch here again. The have the best eggs Benedict I've ever had and they have multiple different combinations of it.  The have something for everyone here.  The food is localy produced (grown) and freshly made how you want it every time",
   "Great food. Everything is organic from local vendors. They have good vegetarian options. The staff was very nice and I would come back for that reason alone. That plus the tasty food is a guarantee that I'll drop by next time I'm in town.",
   "Everyone in Albany knows about the Iron gate. Food hack, get the pepper jack hollandaise as a side for your hash browns. You won’t regret it. \nJohn Denver is a go to. The cornbread pancakes are so good. They ever have some legit vegan options. Would go again, and again, and again, and again (and have). WORTH THE WAIT.",
   "Beautiful courtyards and indoor seating in one of Albany's more astounding row homes make you feel like you're eating in luxury. Absolutely perfect place for Sunday brunch or everyday lunch. Food was well cooled and prepared. Wait staff were at exceptionally friendly and attentive. I don't know why I waited so long to try this absolute gem of an eatery.",
   "Such a cute place with a great menu. Was in Clifton Park, NY for an event but drove to Albany for this unique restaurant with it's great offerings. Totally worth the drive, and enjoyed the beautiful buildings in this neighborhood. Friendly staff, and worth the wait to be seated during a busy morning brunch."
  ]
 },
 {
  "name": "Rain Modern Chinese",
  "address": "259 Lark St, Albany, NY 12210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a81bd210-932d-11ea-9bb6-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17890978795347114873",
  "source": "GoogleMaps",
  "reviews": [
   "This is such great place to have authentic real Chinese food. The quality is really great, the best pancakes and Peking duck. We drive one hour to Albany for the duck. And orders other stuff it is really good. The ingredients they chose is fresh and good quality and the way how they make the food just make ppl feel so great to eat and stomach really happy about it too",
   "Delicious Gourmet Chinese food. Great customer service. Parking available in the back of the restaurant or on the street. This place is a go to when I’m in Albany.",
   "Rain is the best Chinese in the city! Great service, full menu selection, slightly pricey but not so for what you get. And the food is FRESH! Everything from shrimp to chicken to vegetables is very fresh. Hot food comes hot and cold food is cold. Nothing on steam tables. 5 stars for me!!",
   "This is my go-to Chinese place since moving to Albany and it's pretty solid each time. However, there are some things that bug me about this place which I want to note. I've only ordered take-out so I can't speak much about the service but the people at the counter are always professional and courteous. \nMy main issue is with the dumplings and crab rangoons - there's too much filling. The pork dumplings taste like you're eating bacon with how much pork is packed in there. This may not be a bad thing to some people. Hell, you might actually look at it as a good thing which is understandable. But I like a good ratio between filling and the outer shell and Rain overdoes it on the filling.\nTheir hot and sour soup is also pretty weird. I ordered it once and there were very questionable pieces of meat in it. My guess is they re-purpose their burnt/unusable meat and put it in the hot and sour soup. I'd avoid it if I were you.\nI recently ordered the wok seared salmon with garlic sauce and it was delicious. I'm a big fan of spice and this was super spicy. But...there was no warning of it being spicy (at least not on their online menu) so beware of surprises. I was kind of disappointed in the lack of vegetables as well. The description states \"served with mixed vegetables\" but all I received were mushrooms and onions. For the price, some zucchini or broccoli  would have been nice (asparagus is really good with salmon, just FYI).\nOverall, Rain is probably the best you're gonna get in the area. Always consistent and the food (aside from the hot and sour soup) is fresh and cooked well.",
   "Excellent authentic cuisine. We always get soup dumplings and salt and pepper calamari and it’s spot on every time. Definitely worth a stop in."
  ]
 },
 {
  "name": "The Bishop",
  "address": "90 N Pearl St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a865adca-932d-11ea-8b77-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15357461169002472526",
  "source": "GoogleMaps",
  "reviews": [
   "Was my 1st time here. Service was very good. The server was polite and very helpful. The dining area was nice and clean. Very nice looking bar that you could sit at. The food was very good that I had. I had the smash burger. Others in the party said the food was very good as well. The Bish-up looked very good.",
   "I was super excited to finally try The Bishop.  I was happy I read reviews before I made a reservation because previous reviews said that it took awhile to get food was very accurate.  And I would highly recommend reservations since this is a very small place.  My friend and I quickly put in our drink order in, but it took awhile to get our beers - I saw them sitting at the bar for a little while.  Both my friend and I ordered the french onion soup since we heard that it was pretty amazing.  I thought the soup was pretty good although my friend said that her soup wasn't really warm.  We had to wait about 30 minutes for the soup.  I also ordered the smash burger which was very disappointing.  The two patties weren't as smashed as one would expect and honestly, it was very bland, seemed to be no seasoning.  Also, our waiter never checked in on us the whole night.  I had to get his attention in order to get the check.  \nThe whole experience was a bit disappointing.  I did go on a night when there was a show at the TU so I can understand that service might not have been the best, so I would try the place again on maybe a quieter night.  However, there aren't many places to eat in downtown before a show so I feel like The Bishop still needs to deliver on quality.",
   "The food was good and so was the customer service. It got pretty busy after my group walked in, and our waitress never forgot about us. We also needed menu modifications due to dietary restrictions and it wasn't a problem at all. I'll definitely go back next time I'm in the area.",
   "Wonderful duck with brie and French fries cooked in duck fat. Have also had a great steak salad. Imaginative delicious food and great service. Love the view to outside. Also a fireplace. Highly recommended. Great addition to downtown.",
   "Beautiful place! Decor is spectacular, the selection of whiskeys is impressive, they make great drinks and are super friendly. Recommend you check it out! I was there too late to try the food menu but plan on a return trip for sure."
  ]
 },
 {
  "name": "Sukhothai",
  "address": "254 Lark St #1105, Albany, NY 12210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8b332c6-932d-11ea-8a7f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10239250203973056978",
  "source": "GoogleMaps",
  "reviews": [
   "I had a very nice dining experience here. The strawberry shake pictured here was amazing. For my meal, I had the Horapa Rice plate which was delicious. I had such a hard time choosing what to get because so many items looked good! And being a vegetarian, I get very excited when I have so much to choose from- I need to go back to try more soon!",
   "Really good food and killer Thai ice tea! Prices are good and the staff was very helpful and courteous. I highly recommend this place.",
   "Great food for even greater prices. Lunch for two was about $26 after tax, before tip. The pineapple curry with chicken and shrimp was great. Accompany it with a miso soup. The soup is a good serving, better than some Asian restaurants.",
   "The food is delicious. The portions are so large that even 2 people can share one order (or just take home). They have a rich menu, the prices and service are great. It's a very small restaurant, but has the traditional Thai food taste.",
   "We try various Thai cuisine around the area as we really like it and my daughter in law, from Cambodia, says this is very close to her Khmer cuisine. This place wins, hands down, as our favorite. The dishes are generous, very flavorful and beautifully presented. Our group of 7 all had different dishes and everything was well prepared and our waitress was very attentive to our family. This restaurant is so worth it, despite looking for a parking spot in that are being a challenge!"
  ]
 },
 {
  "name": "Zi Jing Ge Restaurant(aka: Shining Rainbow)",
  "address": "209 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8fe1fd8-932d-11ea-a2f5-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17282868852766609688",
  "source": "GoogleMaps",
  "reviews": [
   "From the outside, looks shabby but on inside is pretty nice. The food is great, and the only complaint that I have is the service. It wasn’t extremely slow, but it wasn’t fast. They also didn’t give/refill water if you didn’t ask. Overall, would recommend.",
   "Gorgeous atmosphere friendly service beautiful decor furniture very nice place the food is delicious and I'll say it again the food is delicious",
   "Great service, excellent ambiance. They have large menu to chose from, whether you like what you order depends on your taste. I liked the chicken fried rice, the fried pork dumplings, the shrimp dumplings, and the fried flounder fish. Kind of reminded me of the indo-chinese cuisine I am used to.",
   "Excellent selection and service, and we visit frequently, so I'd say this is the norm. This should be on anyone's itinerary when visiting Albany. It is the best Chinese in the area, and farther.",
   "One of the most talked about Chinese restaurant in the Capital Region is perhaps Zi Jing Ge, because compare to other Chinese restaurants around the area, this is one of the better ones. You can order lunch and dinner for under $10 and usually comes with a lot of food, which is something I like. For students, they get 10% of the bill, which is still better than nothing. The environment of this place is fantastic, and has a contemporary look to it with calligraphies hanging on the wall. I enjoyed their food even though it’s the typical Chinese food you find in other Chinese restaurants, but still, it was delicious. I would definitely order from here again."
  ]
 },
 {
  "name": "The Standard",
  "address": "1 Crossgates Mall Rd, Albany, NY 12203, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a949820a-932d-11ea-9e78-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "drink",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5476143172290433620",
  "source": "GoogleMaps",
  "reviews": [
   "Always enjoy coming to The Standard. Always greeted with a smile and the service is impeccable. \nThe food is is always phenomenal. Never had a bad experience nor felt uncomfortable. If I could give The Standard more than gives stars I would. Looking for ward to another night out at The Standard.",
   "Very much like a cheesecake factory but better.  The atmosphere and decor is  lovely and comfortable.  The drinks are great with a good variety of house mixers.  But that food!!!  About the most well rounded menu i have ever seen.  There is something there for everyone.  And its all fantastic.  I have been twice and could not find a thing to complain about.",
   "The food was decent, service was good. But dining companion found a button in her food. It looked like a clean button, but still a button. They took her salad off of the bill. So again, the service was good. :) Will give it another shot.",
   "New Years Eve dinner- 2020-Outstanding service.  Delicious food and drink  and dessert.  One of our favorites. Not rushed. Happy New Year! You won't want to miss out.  Get there this year.",
   "I hate to write negative reviews but I was very disappointed with the shrimp scampi it was over cooked and just tasted off. I always order extra shrimp to every meal and I couldn’t even eat all of it. The pasta itself was amazing! The bread and butter was excellent as well lol. I would eat here again but never again will I try the shrimp."
  ]
 },
 {
  "name": "LaZeez",
  "address": "35 Central Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a99254a8-932d-11ea-b628-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11048355095143331583",
  "source": "GoogleMaps",
  "reviews": [
   "Have eaten here a few times now and it is wonderful! Food is consistently fresh and delicious. They are quick with pick up orders too. Additionally, the customer service here is outstanding. They warmly greet you when you walk in and make you feel welcome. I would come back just for the customer service alone but it doesn’t hurt that the food is great as well!",
   "Great food. Clean environment. Friendly service. Inexpensive. Love it. Will bring family and friends here.",
   "LaZeez will always be my go to Indian spot ! \nThey are always so kind and the food is always consistently delicious. \nI have moved to the Bethlehem area where there’s several Indian places close by and they don’t even come close to how good lazeez is ! \nDo yourself the favor and order from this place!",
   "Always great food. Been coming here for 20 years. Our go-to spot.",
   "The service was good and the food was also good but they had a very limited selection."
  ]
 },
 {
  "name": "Nicole's",
  "address": "556 Delaware Ave, Albany, NY 12209, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9d55254-932d-11ea-8d02-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14848063322744296645",
  "source": "GoogleMaps",
  "reviews": [
   "Most often after watching a movie at the Spectrum Theater we have dinner at New World Bistro... One if my favorite restaurants.\nWell we could not get in and decided to try Nicole's. To our surprise, we found the food to be pretty good. Everyone enjoyed there meals. We decided to eat there every other movie visit.",
   "First visit here recently.  Quiet romantic atmosphere especially in the back.  Great meals,  we had veal and salmon.  Both were excellent as were our drinks and appetizers. Attentive service too.",
   "Pretty good Italian spot. Didn't enjoy sitting in the back.",
   "My daughters wedding was October 5, 2019 at Pat’s Barn. This place was the best. The food was fabulous and the wait staff was excellent, couldn’t ask for better. This kind of service and food is what made the even more special. Thank you all",
   "Nicole's catered my niece's wedding this past weekend and the food was amazing! From the appetizers to the entrees and wine .... on point. The service was outstanding!  Sara in particular, was super helpful and gracious. I highly recommend Nicole's."
  ]
 },
 {
  "name": "TapAsia Asian Tapas",
  "address": "227 Lark St #1101, Albany, NY 12210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa2c9ba6-932d-11ea-b391-14b31f159f22.png",
  "tags": [
   "learn",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5294566970096404147",
  "source": "GoogleMaps",
  "reviews": [
   "Best pad thai ever!!\nIt’s sweet and salt with just a bit spicy. with a top of peanut crunch, perfect!",
   "I wish I could give some negative ratings to this place. I went there for lunch  with my friends and ordered drunken noodle with chicken. The food was good and tasty but you would not believe the amount they have given for one person. The quantity was much less compared to any similar kind of noodle plate I had in USA or Albany in any Thai place. \nBut that's not the worst part. The worst part is when I asked politely about the amount, a woman(may be the head/manager) came shouting at me saying that's what they serve. \nAnother of my friend ordered pineapple fried rice with no meat and it wasn't of less amount like mine.  \nI have heard average reviews about this place so I went but it seems like it was my bad luck or may be they are the worst kind of people to run a restaurant and need to learn how to behave with customers.\n\n(I wish I had the picture of pineapple fried rice or similar noodle from a different restaurant to compare)",
   "Small but cute with a nice ambience. Menu has a nice selection of pan-Asian dishes. I ordered the salmon green curry and my husband got the pad thai. Both were excellent and well presented. Taking one star off as we asked for a spice level 7 and they turned it up to 11 🔥🔥🔥",
   "Don’t order from here if you’re looking for pho. The broth taste like it’s just hot water and a beef bullion. The chicken yakisoba, Thai iced coffee and spring rolls were good though.",
   "TapAsia was delicious and authentic thai resturant located on Lark Street ik m Albany, NY. I had the Aloha which was a scallop and Chicken dish seved in a half pineapple. It came in a few different levels of spice and flavor, i has hot thai. It was VERY SPICY but flavor was great and if you like a lot of heat. That be your dish. \n\nWe had sticky rice and mango for desert. \n\nEverything was ok n ppint and waitstaff couldnt be friendlier. \n\nAtmosphere was trendy and warm. Very clean. We sat outside on the small patio.\n\nA hidden gem."
  ]
 },
 {
  "name": "Capital Q Smokehouse",
  "address": "329 Ontario St, Albany, NY 12208, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa8c2286-932d-11ea-a087-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14142407488703998773",
  "source": "GoogleMaps",
  "reviews": [
   "Yall, my NC heart is soaring. I haven't had greens this good since I moved here.",
   "Since it was my first time there I was offered samples of their three barbecue sauces. All of them had great flavor with good spice.\n\nI went with the quarter okie chicken plate with cornbread, potato salad, and mac and cheese. The chicken was delicious and very moist. The cornbread had either maple in it or maple butter which was great. Mac and cheese is kind of what you would expect from a school room lunch but better. I didn't even have room to finish the salad. \n\nI'll definitely be back.",
   "This is some of the best BBQ in the area and some of the best I’ve had. Staff is super friendly and food is always ready quick whether you’re getting delivery or pick up. 10/10 will definitely be going again",
   "The wings were great, however almost everything else was a let down. If you're going to spend $85 on a couple of dishes you'd expect them to be good. The mac n cheese was super plain. The bacon mac n cheese had crumbs on top that were way over cooked and made the meal not a because they were all stuck together and very hard. The chicken sandwich and the pulled pork was good also the sauce is great quality its just the side dishes that need work.",
   "I wanted one of everything. I was painting a house behind this place and all morning all I could smell was the smoker. I had to try it. It was amazing. If you have the opportunity, give this place a go, you won't be dissapointed."
  ]
 },
 {
  "name": "La Serre",
  "address": "14 Green St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aaf56d80-932d-11ea-aa55-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "knowledgeable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3115260210150572703",
  "source": "GoogleMaps",
  "reviews": [
   "This was our first visit and we already know that we will be back. When we made our original reservation it was to use a Groupon but then found out that our reservation was for the first night of Albany's annual restaurant week. Dinner included an appetizer, entree and dessert for $25 per person. It was well worth it. We also ordered 2 different bottles of wine to accompany our meals off a nicely varied menu. Everything we had was well prepared, beautifully presented and delicious. We look forward to experiencing the full menu choices on our next visit. We do wish that the restaurant offered better parking options as they have no parking lot of their own and most parking options entail a significant walk to the restaurant which can be difficult for those with a disability.",
   "LaSerre never disappoints! Our server, John, was knowledgeable, courteous and attentive without being obtrusive and the food is always phenomenal from appetizer through dessert! We will continue to return. If you have never been there, treat yourself; you will NOT be disappointed!",
   "Tucked in the back streets off State St near the Times Union Center. The restaurant is nicely decorated with nice wood paneled walls, and dark mirrors, and a few wine bottles and wine glasses. It was dimly lit with a chandelier and some wall sconces. It could be a somewhat romantic setting, though the seating was fairly close to others. The atmosphere reminded me of a cross between a study in a fancy house, the kind that would have a leather arm chair, and a speak easy. However, something about the decor seemed like it was only 80% of the way there but lacked some finishing touches.\n\nThe waiter was attentive but without being annoying, he seemed to come around at just the right time. There were about three or four other groups dining at the time, but the place wasn't very large, so it was probably at least half full.\n\nWe ordered two martinis, one chocolate flavored and one that was more tropics themed. We then ordered off the restaurant week menus which are three course prix fix menus. For an appetizer I ordered fig caprese. It was good, though only a slight variation of a regular caprese as the fig taste wasn't too strong. The main course I choose the beef bourguignon and my girl got the mushroom ravioli. The bourguignon was a bit salty for my taste, though it tasted similar to many of the beef bourguignon I've had in the past. The ravioli tasted really good, had a very nice mushroom flavor without being overwhelming. There was two choices, a flourless chocolate cake and a lemon something (I kinda stopped listening after I heard chocolate). We both ended up getting the chocolate cake, which was so rich and thick it was like eating a creamier version of fudge. I didn't finish the cake as the sweetness was a bit overwhelming, though I did finish the other half later as a snack.\n\nOverall it was a nice place, though it probably doesn't stand out on anyone's toes 10 list.",
   "One of the best filets I’ve ever had! The restaurant and it’s ambience were perfect, service was excellent and the food was incredible. Couldn’t ask for more!",
   "Food is really not fresh, made my stomach sick after coming home. I told the server the food isn’t fresh and he told me back “no other people said anything”. The food is also overpriced and really not worthy your money."
  ]
 },
 {
  "name": "The Fountain",
  "address": "283 New Scotland Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab5d350a-932d-11ea-b2d6-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5939594652841817436",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I frequent the fountain, usually, late at night after we get off work. The food is good. Our server was great, very friendly and attentive.cThe nachos are amazing! My husband's pizza was good, he added meatballs and they were huge pieces. I love myself a good burger and went with the bacon cheese burger. I asked for it medium and unfortunately it looked more like well done.  It was a good burger, nice flavor, but would have been better if not cooked as much. We will be back!",
   "Wonderful neighborhood bar and restaurant  that has a nice variety of items on the menu. My wife and I have been coming here for 24 years now and have never been disappointed by the food or the service.  The staff are always friendly and attentive,  and overall,  it's a place to go when you want good food and conversation.\nIf you've never been here before, stop in and be prepared for a nice experience.",
   "Excellent pizza and wings.  Good deals on pitchers of beer.  If you're looking for a place to enjoy those three things, you won't do much better than this in Albany!  Highly recommend.",
   "Great pizza! Go early, this place fills up fast at dinner time",
   "We have been every pleased with our past several visits. The staff has been very friendly and efficient. Our meals have been very good. We look forward to returning."
  ]
 },
 {
  "name": "Shining Rainbow",
  "address": "209 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/abb75ee8-932d-11ea-9a6e-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4532225159838196067",
  "source": "GoogleMaps",
  "reviews": [
   "PURE AWESOMENESS!! This place is absolutely amazing and it has a karaoke bar that is pretty awesome in backand you can rent it out and have a party and simply by renting it out there is there amazing food included. They have real dim sum here which I have had to go to New York City to get up until now. Keep on doing what you're doing shining rainbow and keep up the good work",
   "Very fine interior dining area and private party section. Large tables for large parties. Professional and attentive service. Enormous menu - Serving both authentic and Americanized Chinese cuisine. Quick serve times, hot pots, live fish, and alcohol available. Street parking only.",
   "Great food! Great service! Such a quality, enjoyable place for dinner!",
   "Did not expect it but I quite liked this place. The chicken curry fried rice and King's Spicy Chicken were really good. Also, the Red Bean Fried Ice Cream. And such a friendly staff..😊😊",
   "Amazing fried lobster (remember to pay cash for discount!)"
  ]
 },
 {
  "name": "Dove + Deer",
  "address": "32 Dove St, Albany, NY 12210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/abfec974-932d-11ea-b6d5-14b31f159f22.png",
  "tags": [
   "frugal",
   "food",
   "free",
   "food",
   "delicious",
   "family",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7929120273036326044",
  "source": "GoogleMaps",
  "reviews": [
   "Super good food and a wonderful staff. Amazing burger, and awesome location just a block away from the Capital building and LOB. They have amazing specials, and this seems like a place that has people working there who actually care about it \n\nI'm happy to pop in and spend my money. I'm a bit frugal, but the atmosphere and value I feel of the meal make it more than worth it for me.",
   "Always awesome food and drinks! Highly recommended for others with celiac's disease! Menu always includes gluten free options and I've never gotten sick after eating there.",
   "Really enjoyed the Fall menu. Started with a cocktail (Love on Dove) and it was really delicious. We ordered the wings for and appetizer and they were cooked perfect. For dinner I had the salmon and it was seared perfect and tender on the inside. Very good meal overall.",
   "My husband and I have been coming here since inception and I feel the time is appropriate to leave a review. \nSometimes we come just for drinks, other times we bring family and friends for a brunch or dinner. Consistently we were impressed with the quality of service but more importantly,  with the food they serve. I love when I find a place that understands the essence of food. It needs to engage the senses. The inviting aroma arising from an appealing plate arrangement calling you to take a bite. And when you taste it,  the richness and depth of flavor caresses your taste buds. That is exactly what I get in this restaurant and what brings me back. I find their prices reasonable as I usually end up paying more for the food of this quality.",
   "I love a good neighborhood dive, but this is a pretty clear upgrade over Center St Pub.\n\nDrink menu is well-priced — signature cocktails were all $10, every wine was $9 or less and beer was as it should be — and varied. Food menu was small but had variety.\n\nPlenty of space, too. Huge bar, lots of tables and a more cozy area under the domed windows that remain from CSP. TVs and wooden/cork dartboards are here for anyone looking for activities while you drink.\n\nMy one (minor) complaint is you have to print the actual beer on a beer menu. Saying it’s a Jack’s Abby ‘seasonal lager’ or a Grimm ‘double IPA’ doesn’t really help."
  ]
 },
 {
  "name": "Lost & Found Bar & Kitchen",
  "address": "942 Broadway, Albany, NY 12207, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac4740e4-932d-11ea-961a-14b31f159f22.png",
  "tags": [
   "unique",
   "creative",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16106660197221478328",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool downtown location with a unique American brunch menu. Service is wonderfully friendly and relaxed. Feels like a bar in your best friend's house.",
   "I've been here a handful, or two, of times and they always deliver.  *Not actual delivery but more of a metaphorical \"deliver\". \n\nBrunch is always great, please order the 🥓",
   "This bar is 100% a perfect neighborhood hangiut spot. A broad selection of beers, fruity to crisp, ipas to sours with ciders and a lovely cocktail menu. Not to mention their food. With a seasonal menu, with exciting and creative creations. This menu has me eating new things, and wanting to keep coming back for more.",
   "Great food, fantastic beer and cocktail selection. The service was wonderful. Don't come here expecting just another burger and IPA. Lost & Found is more than that!",
   "Amazing bar. First off the food is ridiculously good. It's a bar, who has good bar food... Well these guys do. So much so we can't wait to go back and try other options on their menu. Cool atmosphere as well. Every one seemed to have something they were doing while there. A family was playing cards a bunch of people were outside playing corn hole. Just blew me away, I work right down the street so I am excited to go back."
  ]
 },
 {
  "name": "McGeary's",
  "address": "4 Clinton Square, Albany, NY 12207, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac9bf212-932d-11ea-a9db-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7178899664613549198",
  "source": "GoogleMaps",
  "reviews": [
   "Welcoming attentive bartenders, wings to rival my favorites in Buffalo. Great beer selection.  Live music.",
   "The service was fast and friendly. I ordered the sweet chili wings and they were really good. Others in my party ordered French onion soup, burgers, grilled cheese, etc and everyone was very satisfied with their choices.",
   "Really great spot.  A true pub, with good beers and good food to match.  Tess and the staff are extremely friendly, and there is even some cool outdoor seating when its nice out.  Highly recommend!",
   "Service was awesome, even though it was packed. Owner came out twice to chat! First trip to Albany! Definitely would return!",
   "Food was delicious!  Band was great!  Service friendly and attentive even when it got busy.  One of our favorite places in Albany."
  ]
 },
 {
  "name": "El Mariachi Restaurant",
  "address": "289 Hamilton St #291, Albany, NY 12210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ace223fa-932d-11ea-b3af-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walking",
   "delicious",
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3820808883366211859",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. Food is phenomenal. Staff is friendly and attentive. Clean tables, delicious food, great overall atmosphere. Has a few levels to the building which is kind of cool. Within walking distance to a lot of other Center Square establishments.",
   "Not what I would call authentic Mexican food, but very good nonetheless. On street parking which can be limited and if you want to eat outside (which I totally recommend) then you should make a reservation. The place is always clean and my experience with the staff has been great. Delicious food and drinks, nice dining atmosphere and good prices. This is a great place to eat with family and friends.",
   "Three of us went out to enjoy Mexican food before a show.  The food was delicious, the servings were generous and the service was attentive and pleasant.  Prices were reasonable and the decor was pleasant with a Mexican feel.",
   "Very flavorful! Nothing frozen. All fresh. Good service and friendly staff.",
   "Great food , good price!!! I really recommend this restaurant"
  ]
 },
 {
  "name": "Ocean Palace",
  "address": "68 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad2f8212-932d-11ea-b9be-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5570378928469800144",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down the best Chinese food I've had in Albany. Try the Pork Soup Dumplings!  It's humble appearance is a testiment to how serious they take the quality of the food.\n\nGreat selection, great value, great service. I have never been let down by Ocean Palace and I don't I ever will.",
   "Does this place have delivery ?  Sounds really good and would love to try it today ???\nEdit : 12/16/19 Okay I tried the place now and when i got there it was 1 minute past the time for the lunch special there wasnt anyone in there and the guy wouldnt give me the special price so I came back another day when I could get it. I got chicken with mushroom and the mushrooms were the big black mushrooms I am not a fan of the way they taste. \nI want to give this place another try though since all the reviews make it sound so tasty hopefully I will find something I LOVE :)",
   "I liked the food but I sometimes vomited blood.",
   "This is probably the best Chinese food I've ever had. The restaurant is an unassuming little hole in the wall, but it is a hidden treasure. The menu has a lot to choose from, including some items that Americans might find strange, which I consider a mark of authenticity. As the name suggests, there are a lot of seafood options on the menu. This is a fine place to either eat in or take out; the atmosphere is pleasant. For those who eat in, there is a large round table where groups can sit down for dim sum. Dine-in customers also get hot oolong tea, which may be the best hot tea I've ever had in a Chinese restaurant. The fact that this place is open late is also a plus. I recommend Ocean Palace to all my friends who ask what a good Chinese restaurant in Albany is.",
   "The roast pork lo mein is so delicious. The fried rice is authentic and tasty. I really enjoyed my food"
  ]
 },
 {
  "name": "Oaxaquena Triqui",
  "address": "77 N Lake Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad7936b8-932d-11ea-92a0-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "food",
   "family",
   "eat",
   "food",
   "delicious",
   "family",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18267626442409640605",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, great and friendly service. And very affordable, especially on Tuesdays for Tacos! 3 tacos for only $6! That's something you can't pass on!",
   "Amazing food and service. Highly recommend the tacos the best I ever had. Only authentic Mexican restaurant in Albany, it was definitely shown in the food. Staff is very nice and friendly. Definitely going back soon.",
   "The most authentic place in Albany! The family that owns it is so sweet, the food is amazing, the restaurant has great ambience. One of my top 10 favorite places to eat!",
   "I love this place! The food is fresh, delicious and authentic. Everything I've tried has hit the spot. The owners are very friendly and sweet. Very family friendly restaurant, not very formal. There's also a section up front with imported goods. I highly recommend this place!",
   "Small but very authentic mexican food. Grocery at front and food at back. Very nice food. Nice people. Just water was not good. Take ur own water to drink or use bottled water"
  ]
 },
 {
  "name": "The Orchard Tavern",
  "address": "68 N Manning Blvd, Albany, NY 12206, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/adbdbadc-932d-11ea-8b53-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5799525188113022732",
  "source": "GoogleMaps",
  "reviews": [
   "First off let me say that I have ordered food from here before and haven't had any complaints. Me and my girlfriend ordered a couple salads a chef and a cobb. Starting with the chef. 90% iceberg lettuce and croutons. Almost no meat or cheese. Cobb about 80% iceberg lettuce. Even on the menu it lists the cobb as fresh GREENS chicken bacon egg and tomato. Soggy bacon and rubbery chicken.",
   "The boneless wings are really good. They seem to have black pepper so even if you like your wings hot, try the medium first.",
   "First table at 1130.  Never got our food.  Took it to go.  Had to get back to work.  The 3 booths in the bar area all had food and then came after us.",
   "Very friendly staff, the French fries were so crispy and tastes great. The birthday wing special was really nice too!",
   "Classic Albany restaurant.  Pizza as good as I remember. The new owner Chris introduced himself and told us about the changes that will make the place even better.   The only complaint is the draft beer prices are as high.  For a old classic place, there should be lower."
  ]
 },
 {
  "name": "Jonathan's Pizza",
  "address": "31 N Pearl St, Albany, NY 12207, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae03027a-932d-11ea-b389-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14135942122639289250",
  "source": "GoogleMaps",
  "reviews": [
   "The food is delicious and the staff made us feel very welcomed and accommodated me even though I'm in a  wheelchair. I will definitely go there again.",
   "Jonathan's is the best!!  Everything they make is delicious! Staff is always pleasant and helpful. I will always be assured of a tasty meal when I order from them. Thank you Jonathan's for keeping the customer #1.",
   "Visited here when I was in Albany for training. Food and service was great!",
   "Awesome food good prices quick service",
   "Awesome tasty food. Good drinks great Pizza!  So it's not updated.   So what!  It's really good food and if you want crispy you get crispy!   If you don't want greasy suck it!  Go to Subway."
  ]
 },
 {
  "name": "Emmanuel Thai Restaurant",
  "address": "35 Maiden Ln, Albany, NY 12207, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae4d2c26-932d-11ea-b2f7-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5523136658846230322",
  "source": "GoogleMaps",
  "reviews": [
   "The best food, verygood not junk food Its healthy  lot of flavors",
   "Soooo good! Got the red curry with pork, came out fast and was delicious! Service was super friendly and super quick! Definitely going back!!",
   "Great food, Great service! If you want to discover new places for food, the experience is worth having! I’ve ordered pineapple fried rice and red curry lunch! I’d say must try both if you like a little bit of spicy food. Overall good experience.",
   "The pineapple curry was amazing! I am highly recommend this dish! Omg so authentic!",
   "Really great Pad Thai (medium) and the Pot Stickers have a tasty sauce they come with. A+ food"
  ]
 },
 {
  "name": "Juniors Bar and Grill",
  "address": "1094 Madison Ave, Albany, NY 12208, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae933758-932d-11ea-894a-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17316633709853764143",
  "source": "GoogleMaps",
  "reviews": [
   "Delicioso! Simply put. Have only been there a couple times but they have great food in good portions for a decent price. I recommend the BBQ Chicken salad. Already ate HALF before I even took the photo.",
   "Great place for drinks, wings, laughter and sports! I enjoyed my time there!! Highly recommended fam.",
   "I used to go to Junior's all the time... back in the day. This was my first time back in a little over a year and it has changed. It appears that some updates have been made and the menu has changed a bit.\nWe ordered mozzarella with raspberry sauce. It came out with marinara but when we told the waitress she returned fairly quickly with the raspberry sauce. We also ordered the Harvest Salad. It used to be called the Autumn Harvest Salad and it used to come with chicken on it. It was good but I was surprised when it came out without chicken. We also ordered the boneless moonshine wings. The boneless wings were good but they were a bit small and I'm not convinced the price is in alignment with the quantity. Overall it was pretty good.",
   "The food and service are always GREAT!!!  The Manger and the staff are top notch.  Great environment coupled with the food and service.... Can't go wrong.  Give it a try and you'll be glad that you did.  Don't leave without trying to peanut butter whiskey.... Awesome",
   "Friendly and quick staff. Ordered for take -out and thenfoid was hot. Moonshine wings have a mustard base sauce which is pretty good."
  ]
 },
 {
  "name": "Healthy On Lark",
  "address": "274 Lark St, Albany, NY 12201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aee0e374-932d-11ea-a5ca-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4777253837048810013",
  "source": "GoogleMaps",
  "reviews": [
   "Cute juice bar and veggie restaurant. Tiny and mighty with Spirit and beautiful decor! Hours very variable check ahead and budget to visit and get a nice healthy juice ! I loved it!",
   "Friendly, clean, delicious.  Vegan breakfast burrito is fantastic, as soba noodle stir fry💖",
   "This place is a gem. The place is tiny and cozy and every meal I have had on the menu you can tell is made fresh and with care. The service is fantastic and they have many vegetarian/vegans options!",
   "This place offers a great variety of vegetarian dishes. Everything is freshly made with quality ingredients. Highly recommend.",
   "This quaint, boutique-Colombian jaunt is easy to miss but will not be forgotten once you take a bite!  From Korean taco to Buffalo Cauliflower sandwich paired with their craft juices is out of this world!!!"
  ]
 },
 {
  "name": "The Local 217",
  "address": "12 ½, Delaware Ave, Albany, NY 12210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af2c6cd4-932d-11ea-8642-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8964966543670711319",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome remodel with a more accessible bar and cool new seating. I haven't eaten yet, but the beer selection is amazing.",
   "Great service and they make my favorite french fries around!",
   "Best place for brunch in Albany hands down. Great atmosphere and beautiful deck. Went for brunch today Susie the owner is the best will be coming every Sunday.",
   "It's a staple of Lark St night life. You go out have a few and then around midnight decide you want a breakfast sandwich and damnit if cafe 217 isn't gonna deliver it the best way possible. Love the staff, love the food, love the beer and wine selection. Great outing Everytime all the time.",
   "Good diner like food. Great for a for late night food on the weekends."
  ]
 },
 {
  "name": "El Patron",
  "address": "198 Central Ave, Albany, NY 12206, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af6be7d4-932d-11ea-87b6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1907943964628248177",
  "source": "GoogleMaps",
  "reviews": [
   "Went here on a whim and it was absolutely amazing. Super fast and friendly service. The food was out of this world. Prices for food and drinks are also very reasonable. We definitely will go there again.",
   "Great place to have a delicious meal. This places looked small from outside but had lots of space inside. The entrance is on the side. The food was amazing, and the menu has so much to choose from. The service was great, and I would highly recommend it to others visiting the area. It was nice to have a reasonably priced dinner while visiting upstate NY.",
   "Went for Happy Hour and got an AMAZING Strawberry Margarita for $5! The guacamole was fresh and delicious and the service was top-notch! I will definitely be visiting again soon!",
   "Food was okay, I could tell it was microwaved because of the beans. Devil meat was not spicy, just had chipotle sauce. They give alot of chips and salsa which is nice. Decor and atmosphere is lively and beautiful. Might be one of the few Mexican places here so maybe go once for drinks and appetizer.",
   "We were staying in Albany for the baseball hall of fame weekend and went here on Sunday after the induction ceremony and were totally impressed.  We're from Seattle and have oodles of Mexican joints. This is in our top 5. Margaritas by the pitchers are the way to go. My wife have the child rellenos with poblanos was excellent.  I had the chicken and beef\nfajitas was enough for two and very good. Sarah our server was excellent and very sweet. \nIf you got a hankering for Mexican,  the patron is a must!"
  ]
 }
]