[
 {
  "name": "Quiet Waters Park",
  "address": "600 Quiet Waters Park Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/afb6d4f4-932d-11ea-a883-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "kids",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8811660777936940694",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous Public Park!  This is a beautiful slice of heaven.  A hidden gem, kinda.  Winter, early Spring skating rink.  6 plus miles of trailes, dog beach, and views of the Chesapeake Bay, South River and Harness creek.  You can rent bicycles, kayaks, etc in the warmer weather.  Our little divine hideaway.",
   "Great picnic areas with nice scenic views to the bay at the end of the trail. I loved the paved roads, the large green fields, playground, and the outdoor ice skating rink in the winter. I can’t wait for my future visit in the spring and early summer season :).",
   "This was the #1 park I wanted to visit on our trip to Annapolis. We got here much later than we wanted and only had about 25 minutes before the park closed (8:30pm on a Wednesday in August, closes at dusk) so we just drive around for 15 minutes or so and I got some pictures. We did not have to pay to enter/for parking since the gatehouse was closed. Usually it is $6 to enter the park. This park has some beautiful views and great opportunity for photos. It has several hiking trails, picnic areas, dog park, dog beach, boat launch, boat rental, streams, ponds, compost area, playgrounds, a ton of parking, pavilions, a visitor center/gardens/blue heron center, gazebo, 3 separate restrooms, etc. The park is very clean. We saw some people walking and running at night. The best part about this park is all the deer we saw! We saw over 40 deer (bucks, does, and fawn) randomly driving through the park. I love animals so this was a treat. We would have loved to get here early and walk around. If we are back in Annapolis again in the future, we will spend more time here.",
   "Excellent work from Anne Arundel count services. The place is expansive with room to play, hike, and roam. I recently visited in winter to take kids to their outdoor ice rink and it was great for us, with little crowd.",
   "What a great county park. Trails everywhere, different waterfront areas, boats/kayaks in the summer, ice skating in the winter, a playground, multiple picnic areas. Easy to spend an hour or all day here...plenty for the whole family and for any occasion."
  ]
 },
 {
  "name": "Hammond-Harwood House",
  "address": "19 Maryland Ave, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/affedbc6-932d-11ea-80f7-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=16391508473640026492",
  "source": "GoogleMaps",
  "reviews": [
   "The house is an excellent example of Georgian architexture.  The tour was well worth it and Don was an amazing docent!",
   "Awesome building and tour.",
   "Thoroughly enjoyed the 12th Night concert.",
   "Great historical home in Annapolis. Recommend taking a tour if in the area. Wonderful colonial kitchen representation and beautiful rooms throughout.  Highly recommend.",
   "Great spot to get historical understanding of Annapolis"
  ]
 },
 {
  "name": "Annapolis City Dock",
  "address": "Dock St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0584818-932d-11ea-90e9-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "walking",
   "food",
   "tour",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13927371757588284103",
  "source": "GoogleMaps",
  "reviews": [
   "Lots to do. An east walking,  small historic city. Tour the dock, the Naval Academy and all of the beautiful colonial neighborhoods.  Great restaurants, ice cream shops, coffee cafes.",
   "We had a blast here! Our waiter was awesome and the food was good! We were having such a good time that I forgot to take a photo of our food",
   "If you go during a weekday it's not as crowded. If you can find parking near the dock, its 2hr parking. I parked in the Calvert Street Garage and walked around the area and it's gorgeous. The architecture is beautiful and  there are many historical sites. Incredible shops and restaurants.",
   "We visited Annapolis several times while we were in Md over summer. The city dock was amazing! My kids and I found a really nice street tour, some ice cream, and shopping. There was a naval ceremony going on, so there were alot of sailors just out and about. Must visit town!",
   "Fantastic city-town! Lots of great restaurants, bars, and shops. Awesome for a Sunday afternoon stroll with family or a night out with friends."
  ]
 },
 {
  "name": "US Naval Academy Museum",
  "address": "118 Maryland Ave, Annapolis, MD 21402, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b09f1630-932d-11ea-8590-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6607700926126663566",
  "source": "GoogleMaps",
  "reviews": [
   "A must visit! Large campus, lush green. Young marines running on tracks and practising on the grounds truly adds to the punch and a feel to do something incredible! \n\nDo carry your ID cards and just walk in on a Saturday morning. You are booked for the rest of the day! Have lunch at any of lovely restaurants along the water body at Annapolis, walk around and have fun.",
   "The Naval Academy Museum was very cool.  It was packed full of historical items and displays.  The pictures and videos and displays were very informative. It was a good time. I recommend it to people visiting the area.",
   "I love this part of the academy. The bone ship section is my favorite part. Amazingly detailed models made from bone fragments; Chicken, pork, beef, whatever the sailors had that night. Really cool to look at and the details are amazing. There is so much to see it will take you a long time, even if you are not a usual museum person.",
   "It’s hard to describe the magnificence of this place. Spend a few hours on a nice day to explore. It’s incredible.",
   "Small intimate museum. Free to the public but you need id to enter the campus. Great, well documented exhibits. Don't miss the models upstairs which will be more interesting for younger kids. If you are a war buff, you will really enjoy this."
  ]
 },
 {
  "name": "Maryland World War II Memorial",
  "address": "1920 Governor Ritchie Hwy, Annapolis, MD 21409, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b10294be-932d-11ea-b521-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17741861744866685899",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous spot and setup, wish it had more attention than it gets, I would love to see it one more time before I leave. Just beautiful",
   "Very nice memorial. Overlooks the Severn River, over to the Naval Academy. You will need a few minutes to enjoy it all.",
   "A very beautiful view and nice memorial.  Nice place to just sit and relax.",
   "It is such beautiful spot to stop and reflected, what has been gained and what was has been given. We love it so much. I got engaged here! 10.30.19",
   "Beautiful memorial with views of the Severn River, Naval Academy. Naval Academy Briddge , Jonas Green Park and The Capitol in Downtown Annapolis"
  ]
 },
 {
  "name": "Annapolis Maritime Museum & Park",
  "address": "723 2nd St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1617f86-932d-11ea-8c28-14b31f159f22.png",
  "tags": [
   "free",
   "music",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11898441491984677539",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly staff here. Told us some interesting stories about the ships back then. And it's free.",
   "Very nice museum and venue for events. I often attend their concert series on Thursday nights during the summer. Great view of the Chesapeake Bay. Easy to pull into by boat and enjoy the music on the water.",
   "Amazing place! Great for kids and \"old kids\" young at heart.",
   "Museum officially closed till April for renovation.. But still nice place to hangout",
   "even on an Overcast Day,\nthe view😍never ever gets old.\nVixi Libet Moriar\n\"I have lived, and I shall die, free\"\nYes I have and will.\n\nSave The Bay, please.\n✌️💜"
  ]
 },
 {
  "name": "William Paca House & Garden",
  "address": "186 Prince George St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1ac7282-932d-11ea-b347-14b31f159f22.png",
  "tags": [
   "creative",
   "historic",
   "tour",
   "creative",
   "historic",
   "walk",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1520103302982178990",
  "source": "GoogleMaps",
  "reviews": [
   "Nice garden and pond. Small bridge looks so cute. May be it can be good place for parti and marriage. Didn’t go inside the building but it must be nice inside. There is some trees which look like Christmas trees.",
   "Words can scarcely express the amazing experience we had for our daughter's Sept 2019 wedding! From the very first planning-meeting (many months ahead) through the \"recovery\" days after the wedding, Jody Dalton provided expert, thoughtful guidance and assistance on everything! This was our first wedding (oldest child), so we were very intimidated at first. However, Jody is such a seasoned PRO that we opted to NOT hire a Wedding Planner/Coordinator-- because Jody's involvement was so comprehensive and on-point. (TIP: Book Jody AND any of the Catering companies on her \"preferred\" list {we booked Ken's Creative Kitchen for ours}-- and you get the combined coordination between TWO key players (the Venue and the Caterer), working in concert. ) No detail was overlooked. At the event itself, Jody served as behind-the-scenes \"quarterback,\" directing all the actions of her staff and the catering staff to make ours a flawless, casual and comfortable evening for all 140 guests-- and 100% worry-free for the bride and groom! Jody also helped us (Mom and Dad) personally-- throughout the evening-- with helpful, unobtrusive, \"gentle\" reminders along the way to keep us on-track for accomplishing all elements of the reception (toasts, cake-cutting, etc.) without ever feeling rushed. The venue itself is hands-down the most beautiful, perfectly-sized spot for a true Historic Annapolis wedding! You cannot take a bad photo anywhere in the place! When it was all over, we almost wanted to do it all over AGAIN, just work with Jody some more :-) If you're set on having an Annapolis wedding, we cannot IMAGINE a better, easier, more cost-effective, or more wonderful spot and support team than Wm. Paca House and Jody Dalton. | Lastly-- Brides: go talk with Jody just once-- even if you don't end up booking the Paca House, you'll be glad you met her!",
   "We did enjoy our visit to the garden, however for $5, I did expect to see a bit healthier looking of a garden. I understand it's the heat of the Summer, and there were still plenty of pretty plants and fruits to look at, but some plants looked a bit dry. We did not tour the house and this review strictly pertains the garden.",
   "William Paca was a signer of the Declaration of Independence. The Paca House through Historic Annapolis offers fun and creative events all year long. The Gardens are gorgeous in the Spring and Summer and the Open House in December gives glimpses into Christmas during colonial times. 🎀🎄🎀",
   "We didn't get to tour the William Paca House itself - you have to go on a tour, which have limited availability and are offered at specific times - albeit worth checking out before you go and planning around.  I do look forward to visiting one day!  We did walk the two acre eighteenth century style garden, which had several garden \"rooms\", a pond, a \"folly\" type building and a bridge.  All in all a great place for photo ops (and instagram posts)!"
  ]
 },
 {
  "name": "Banneker-Douglass Museum",
  "address": "84 Franklin St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2059dde-932d-11ea-84a2-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "hospitable",
   "art",
   "tour",
   "tour",
   "family",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3066978547955397492",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderfully kept and inviting museum.  Detailed explanations of the clear and accessible exhibits.  Two current art shows available on separate floors in a portion of the museum.  Very knowledgeable and hospitable attendant at the front desk.  Very kind and personable, as well.",
   "This Museum is absolutely beautiful. Educational and a great vessel to obtain information on Slavery and it's impact on the City of Annapolis. This museum has been an Aid in educating my nieces and nephews on African American culture. They have also participated in many events at the Banneker Douglass Museum. \n#AriseaboveitALL.",
   "The museum is beautiful and the guided tour was amazing! A group of mostly 5-10 year olds listened intently. I highly recommend visiting this treasure.",
   "The staff was very friendly. They gave detailed history of the building and told wonderful historical stories about the area as well. I went on educational tour. Next time I'll be bringing my family.",
   "Fantastic experience! Even better staff! I encourage all to go. Makes for a lovely weeknd visit for the family!"
  ]
 },
 {
  "name": "EscapeTime Escape Rooms",
  "address": "167-A Jennifer Rd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b24da4a2-932d-11ea-aabf-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14656051961204141214",
  "source": "GoogleMaps",
  "reviews": [
   "It was awesome! Me and my friend made a pretty last minute plan to do a room and it was ready when we got there! We went into “Revenge of Atlantis” and you’re immediately immersed into it. The hints we were given were clear, the clues to find were well thought through and we had a blast attempting to figure it out! The room was perfectly decorated and you truly felt like you were in the situation. The room was very clean and the staff were absolutely amazing and very friendly. I would definitely recommend going here!",
   "Excellent and fun filled adventures.\n\nWe arrived on time, filled out our waivers, loaded the lockers and headed to our room.\n\nThe room went off without a hitch. You have to remember that you get four free clues and that each one street that will cost you a minute if your time. Lucky for us we didn't need to use the extra time and escaped with plenty of time left over.\n\nIf you're in Annapolis and looking for a nice place to escape from (just down the road from the prison aka ultimate escape room) then stop by. Lots of parking available.",
   "We would definitely recommend Escape Time in Annapolis. We have done many escape rooms from all over. I have to say this one we had the most fun in.  It's good family fun. It will teach you to work together as a family or co worker's. Awesome time",
   "Mary and Julie were wonderfully friendly and made the experience very welcoming. Dr. Mad’s was an intricate room with loads of fun challenges and puzzles to solve. 10/10 recommend for a great night out to have an exciting adventure.",
   "I recommend EscapeTime Escape Rooms in Annapolis, Maryland.\n\nWe had a corporate team-building outing for our DC Region Sales Team. Our large group was separated into smaller teams and we used multiple rooms that started at the same time. Very Competitive! One of the best experiences ever! \n\nI will bring my family back to experience the fun, solve the clues, and “escape” one of the wonderfully designed rooms!"
  ]
 },
 {
  "name": "St. Mary's Church",
  "address": "109 Duke of Gloucester St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2ba5a9e-932d-11ea-8a1d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6230453494842891121",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I spent a weekend in Annapolis in December 2019 to see the Christmas Lights Parade.  We attended mass at St. Mary's Parish that Sunday.  The church was  gorgeous and even more beautiful because it was decorated for Christmas. The Cantor sang beautifully.  It was wonderful.  We will definitely visit again.",
   "My first-time in a catholic church & mass. Beautiful sanctuary & friendly staff.",
   "Beautiful church.. Mass is amazing",
   "Pretty church . Good service/mass this Sunday",
   "Great church. You have to see the ceiling and how it was painted, wonderful!!"
  ]
 },
 {
  "name": "Pirate Adventures on the Chesapeake",
  "address": "311 3rd St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b30a7748-932d-11ea-9769-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "kids",
   "music",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9870990409490646890",
  "source": "GoogleMaps",
  "reviews": [
   "This is a hidden jewel in Annapolis. My son has a diagnosis of Autism and they made him feel so special on our journey. We went for mother's day when they had an incredible deal: all moms were free. We took a boat ride, shot water cannons at bad pirates trying to steal our loot, and then we drank grog (root beer). The children each received a bag of loot to take home. A fun time for all!",
   "It's pretty decent. Naturally geared toward kids. They do offer birthday party packages. The building itself is large. The boat docks on the other side of the parking lot so it's a short walk. Parking is very very limited (down side) There is shaded areas on the boat which is great. Every part of the boat is fenced / shielded off for kids protection. I would personally like the music to be a tad louder, I think that would have kept them more engaged. The two man crew on ship did a good job trying to keep the kids entertained.",
   "Fantastic time. The entire Sea Gypsy crew did a great job. They keep the kids engaged and are sensitive to each child's needs. A great time for all!",
   "The staff is amazing and quite hilarious not only for the kids but still. The kids were very entertained the whole time. I would recommend this to anyone with kids looking to have a good time in the area.",
   "Great adventure. The kids enjoy it and the parents too! Great views on the water and the staff is very entertaining. They are acting as pirates but their hospitality, kindness, and dedication to the children is very real. Thanks for a great time!"
  ]
 },
 {
  "name": "Armel-Leftwich Visitor Center",
  "address": "52 King George St, Annapolis, MD 21402, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b36e1ddc-932d-11ea-98a8-14b31f159f22.png",
  "tags": [
   "walk",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15864052152918024332",
  "source": "GoogleMaps",
  "reviews": [
   "Low key but very informative on a beautiful campus. On a sunny day take the time to walk along the riverfront.",
   "One of the nicest  museums  I have ever been in,so easy to view  the exhibition",
   "I had an awesome experience at the US Naval Academy Visitor Center, gift shop and grounds when I visited Annapolis recently. They have a very informative video about the most recent class and I am glad I watched it. I did not have time for a formal tour so I toured some of the grounds. I saw a wedding party come out of the chapel which was touching and memorable.\n\nThe gift shop is a must see and has some great items. The view of the United States Sailboat Show from the Naval Academy grounds is also a must see. Highly recommend this and thank you for your service to our country!",
   "Great place , loved to see my grandson graduate and now we have one more , he has two more years to go.",
   "If my parents had brought me here as a high school junior, I would have competed for a position here.  I was pretty hot stuff back then, but I would have been swept away by the challenge, prestige, and honor of the Naval Academy. \n\nThis visitor's center would have been the gangway to that indoctrination. The exhibits are enticing, the staff friendly, and the daily pomp and circumstance of life at the Academy does just what it's designed to do: intrigue the nation's most promising to answer the call to duty.\n\nSo I wish I'd come here earlier."
  ]
 },
 {
  "name": "Visit Annapolis & Anne Arundel County",
  "address": "26 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3c47f24-932d-11ea-9909-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15546913796695549810",
  "source": "GoogleMaps",
  "reviews": [
   "Water tour was nice. A nice small town with lots interesting stuff to see. Enjoyed the seafood as well at buddy's.",
   "My wife and I visited Annapolis for a weekend in December 2019.  We stopped by the Visitor Center early on Saturday morning to see if they had information on the sites.  We were greeted warmly by one of the staff members who gave us an information book and gave us suggestions about what to see that day.  Her suggestions and the book were very helpful in helping us plan our weekend.  I recommend a quick stop at the Visitor Center to anyone visiting Annapolis.",
   "Best place to get information about Annapolis. Janet, one of the crew members helped me and gave lot of information on the places to visit in the area. Very friendly and helpful. Very clean place.",
   "Everyone in here is very helpful. Their knowledge of the Annapolis area is fantastic. Even if you've been to Annapolis before, stop in here to find those out of the way places to see.",
   "Good place to start your visit to Annapolis.  They have three stations that are staffed, and each staff member is knowledgeable about the area.  All the recommendations that we received very good.  If you plan on walking around Annapolis the parking garage beside their offices are the best place to park."
  ]
 },
 {
  "name": "Great Frogs Winery",
  "address": "3218 Harness Creek Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b412ec2e-932d-11ea-97bb-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "music",
   "knowledgeable",
   "winery",
   "tasting",
   "brewery",
   "delicious",
   "winery",
   "unique",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3881964217941087782",
  "source": "GoogleMaps",
  "reviews": [
   "Been wine club members for almost a year and a half. The club is great. No membership fees, 4, 6, or 12 wines a quarter. Free release parties with tastings, food and music. Couldn't ask for much more. The wines are excellent. Very flavor forward. A good variety of dry and sweet wines. A little something for everyone. Finally to the staff. They are awesome. Worked with Ben and Kelly most of the time and they will do anything and everything to make sure you have a good time. I'm pretty sure we will be wine club members for life at this rate. I would highly recommend this place and would give it more that 5 stars if possible. Dog friendly if you are wondering.",
   "Greeted as we entered and we were seated.\n\nBen was friendly, very helpful and very knowledgeable about the wines they served us.  \n\nA little pricey but good.",
   "Visited Great Frogs while I was visiting Annapolis, it’s about 10 minutes from the town center via car. Went to taste their wines, but was told we weren’t allowed to do a tasting as it’s by reservation only and they were fully booked. This is somewhat unusual for a winery (or brewery) as more times than not they offer flights for you to purchase and sample their offerings right from the source before committing to a full bottle or glass. \n\nI was disappointed with my experience. I wasn’t able to see any wine making facilities on site besides the vines which seem quite young to produce grapes, if you’re interested in learning how wine is made I’d give this one a miss as all you’re allowed access to is a bar. We were told they have another facility on the eastern shore which is probably where the actual wine is made.",
   "Meritage was pricey but delicious!",
   "My wife and I were up from Florida celebrating our 13th wedding anniversary and one of our stops was Great Frogs Winery for a wine tasting.  When you first drive up to the winery you're greeted with actual vineyards, which may sound obvious but we've been to wine tastings with no vineyards in sight.  The setting was quaint and romantic, a place where the locals seem to hang out and enjoy some great wine.  As we were seated, we are served a mini palette cleansing charcuterie board and a basket with 6 different wines for the tasting.  Ben (the brother of the owner of Great Frogs) then came over and started us on our adventure in wine tasting.  His unique descriptions of each of the wines, food pairing, and the overall conversation were the most memorable.  Since we were celebrating our wedding anniversary they sent us off with a special gift!  Thank you for the great memory, we hope to be back one day."
  ]
 },
 {
  "name": "St. Anne's Parish",
  "address": "199 Duke of Gloucester St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4595140-932d-11ea-ba04-14b31f159f22.png",
  "tags": [
   "historic",
   "food",
   "active",
   "tour",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=9650488634011321903",
  "source": "GoogleMaps",
  "reviews": [
   "Loves the Welcome sign! All visitors Welcome,  Parishioners Expected. \n\nBeautiful historic building.",
   "Beautiful church.  Very nice people offering a lot of outreach services on Mon 6-8 and Wed 2-4.\nFood pantry. BGE cutoffs. Evictions. I only took the 5th star away because it took forever to figure where to go in.",
   "Annapolis is a wonderful quaint little town where you can step back in time.  There are many old houses and Annapolis was the capital of the US for a while.  George Washington resigned his post as Commander in chief after 8 years of service.",
   "This large Episcopal church sits in the center of Annapolis (\"Ann's City) in the middle of a pair of Colonial-era traffic circles/piazzas. Next to the church is the Maryland State House. \n\nNotable in the church are the twelve stained glass windows. After entering the nave, the he first window to the left (back of church) honors an early rector (head pastor), Mr. Southgate, after whom is named a neighboring residential street.\n\nThis is an active place of worship. While it is most heavily used on Sundays, visitors may encounter religious activities at various hours of the day throughout the week. Note that the space is used for quiet prayer and meditation by all. It's wise to maintain relative quiet while visiting unless on an organized tour of the space.",
   "This church which is a historical building is in a circle. The area is neat, nice & quiet. The people are friendly, helpful & beautiful. I also love the landscape & architecture."
  ]
 },
 {
  "name": "Kunta Kinte-Alex Haley Memorial",
  "address": "Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4ad3f2c-932d-11ea-a62b-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12057076543726823929",
  "source": "GoogleMaps",
  "reviews": [
   "Timeless place of history that everyone would attend",
   "Nice memorial/sculptures located right by Main Street and the city docks of Annapolis. The location of the memorial is beautiful. Located in the heart of Annapolis.",
   "This guy plagiarized Roots from an author named Harold Courlander and his book The African, gotten taken to court in 1977 and loss. They gave him a statue and Pulitzer for a story he stole/made up. Lionizing an author for a piece of work that was plagiarized is an insult to real scholars/scholarship, truth, and history.",
   "Very beautiful",
   "Nice sculptures in a beautiful location by the town docks."
  ]
 },
 {
  "name": "Annapolis Tours by Watermark",
  "address": "18 Pinkney St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4f9b2de-932d-11ea-856d-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "walking",
   "knowledgeable",
   "tour",
   "history",
   "walking",
   "delicious",
   "knowledgeable",
   "tour",
   "walk",
   "history",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5614518491685993642",
  "source": "GoogleMaps",
  "reviews": [
   "We did the walking tour of Annapolis with mistress Kate. Kate was very knowledgeable and interesting and enjoy the tour tremendously. Would highly recommend",
   "My sister and I went on a walking tour with Jamie Foster (Mistress Marian) as our guide. I have lived in the Annapolis area since I was a toddler, and am very familiar with downtown Annapolis. It was nice to be a tourist for a change. We walked down some streets I don't normally go down on my visits so it was nice to see buildings and places I wasn't very familiar with, or haven't payed much attention too, and understand their history better. My 16 year old sister also learned a lot, and was able to fill out several pages of notes in a notebook she carried with her (she is currently writing a comic that is a locally based historical fiction, and has been taking great interest in learning about as much local history and folklore as she can). Our guide was very knowledgeable about the local history, and how different things tied together. She was also kept the child who was on the tour very engaged, interacting with him and having him help her show and introduce things. The groups are not very large so you never feel lost in a crowd. I don't recall any steep hills, just one thing of steps to the state building. Frequent stops, and benches to sit if needed. Many of the stops are under trees too, which is nice for shade (or in our case a very light drizzle that came and went a few times). You leave from the visitor center and end at the dock, ego alley, which is the heart of the town (it also has public bathrooms,  a info booth, and other amenities if needed) so that you can finish off enjoying the best of downtown Annapolis, a place you now have a better understanding and appreciation for.",
   "We did the lighthouse tour on lady Sarah and Bryan and Maria we’re both so nice and helpful and welcoming we just loved them! We loved this cruise and they made it so much fun! Bryan was there to take pictures for us and answer any questions we had about the ship and the area, he was SO KNOWLEDGEABLE! Maria made some incredible and delicious drinks and was just such a people person and knew the ships so well, she told us the best place to sit, we will definitely be back and we hope they are on our next cruise! Thank you Brian and Maria!",
   "We did the ghost walk with Mistress Mary and loved it. Very entertaining and full of rich history. Mistress Mary made the whole experience very delightful.",
   "Great family tour with interesting narration. They also have a bar!"
  ]
 },
 {
  "name": "Historic Annapolis, Inc.",
  "address": "42 East St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b53fe1ae-932d-11ea-b340-14b31f159f22.png",
  "tags": [
   "history",
   "unique",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6355922317329605552",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place full of history and on the water.",
   "An amazing place to go to see awesome sites. For a vacation like spring breaks or summer. Really cool 👏🏻",
   "A wonderful organization that helps preserve our 400-year-old city. It’s home and we love every brick.",
   "Quaint unique shopping and historic . Good food too",
   "Beautiful small town"
  ]
 },
 {
  "name": "Charles Carroll House",
  "address": "107 Duke of Gloucester St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b586468c-932d-11ea-ab5b-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walk",
   "family",
   "historic",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11340982776020478561",
  "source": "GoogleMaps",
  "reviews": [
   "Really beautiful inside. Felt honored to be able to walk around the house freely that one of signers of the Declaration if Independence lived in",
   "This house is an important piece of American History.",
   "Just walked past... We were escaping the flood at the city dock.",
   "The Georgian home of the historic Carroll Family. Acquired by Charles Carroll the Settler. If you study the foundations you will see the progression of additions to the house as the family grew in number, wealth, and prominence during the early history of English settlement in North America. Inside, the lower level of the house has some rooms with exposed walls and ceilings. You can view the building methods and tool marks on the massive timbers lumbered on the property to construct the home and enhance it from 1701 through 1856. Charles Carroll of Carrollton (in Annapolis we call him “the Signer”) the Settler’s grandson, was the only Catholic signer of the Declaration of Independence and survived longer than any other. Visit Historic Annapolis’ website for more details. Visit Annapolis to walk through history. \n\nAnnapolis welcomes visitors. Please remember, only bridges and boats honk. Drive gently, patiently, and politely through our colonial streets. They were built for horses.",
   "Such a great place of history and so nice to see it preserved!"
  ]
 },
 {
  "name": "Jonas and Anne Catharine Green Park",
  "address": "2001 Baltimore Annapolis Blvd, Annapolis, MD 21409, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5e56bb6-932d-11ea-90f2-14b31f159f22.png",
  "tags": [
   "unique",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2554699434106425792",
  "source": "GoogleMaps",
  "reviews": [
   "What can I tell you about Jonas and Anne Green Park?  Great place for anybody who loves being outside.  There are benches for those who want to relax and watch the afternoon sunsets over the Severn. There is a small beach area to enjoy feeling the sand at your feet. There is a fishing pier to cast a line or two.  For runners (or cyclists) like myself it is great starting point for your challenging weekly runs (rides) over the Naval Academy bridge and into downtown Annapolis.   There is a small kayak rental booth though I've not checked it out YET! The park is managed by MD Park Service Resources and there is a manned facility during normal business hours as well as clean restrooms.",
   "If you haven't so far, you need to come here. It is beautiful and Unique. And the best part: There are great fishing spots here. So if you are into fishing try you luck here. Maybe a strong bite will make your day.",
   "Lovely little park with sand or rock edged water. Fisherman love the pier. It's got sunny and shaded spaces with randomly placed picnic tables. Looks like there are kayaks for rent occasionally although I've never seen it open. To the south is USNA and to the north is the Rt 50 bridge. There's a nice little area to walk in the sand, or on the other side, fish from the rocks. It's open dawn to dusk. Definitely a great green space for public enjoyment.",
   "A pleasant, well-kept park, great for watching sunsets on the Severn River",
   "Really chill spot. Mini beach, and a few nice fishing spots.  A really awesome place to bring the entire family, for a cookout and some fishing, or just a nice solo adventure.  Great spot to get some really amazing sunrise and/or sunset photos!"
  ]
 },
 {
  "name": "Chase Home",
  "address": "22 Maryland Ave, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6338d42-932d-11ea-8671-14b31f159f22.png",
  "tags": [
   "unique",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=17257353561137759804",
  "source": "GoogleMaps",
  "reviews": [
   "Unique, functioning home of Samuel Chase, 1774 Maryland Representative and signer of Declaration of Independence. Beautiful gardens and love the large elegant double staircase with windows to 2nd floor. A real treat!",
   "Very disappointed. Walked half a mile yesterday (Tuesday) in Maryland heat and humidity with two young grandchildren, only to find at 3:00   pm that it was arbitrarily closed. Call before going.",
   "An absolutely beautiful historical home",
   "Very very nice.",
   "Was not happy about the tour guide."
  ]
 },
 {
  "name": "The Chesapeake Children's Museum",
  "address": "25 Silopanna Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 3.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b688acb6-932d-11ea-a00e-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "art",
   "kids",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18324098086404260253",
  "source": "GoogleMaps",
  "reviews": [
   "In the past 5 years or so I've taken several groups of Juniors to complete a Girl Scout Journey-in-a-Day at the Chesapeake Children's Museum. The girls always have a great time working together during a workdays' worth of programming. The CCM has all the supplies and fun props necessary to make the journey both educational, thought-provoking and fun. The leaders of the journey events usually have a background in both Girl Scouts and education. The CCM is an excellent option for Girl Scout troop leaders and girls!",
   "We went for the first time on Friday for story time. My 9, 7, and 3yo loved it so much that they asked to go back again that afternoon, once we had finished running errands. We went back again today (Tuesday) for a few more hours. Three times in a week and I still had to drag them out of there.\nI agree with the reviewers who say that the toys are older, but that doesn't make them less fun to play with. There is so much room for imagination in this space and the rooms are set up for free play - kids can choose whatever role they would like and make the space their own. My kids especially like the art area, with a variety of papers, stickers, envelopes, cutting tools, etc. to choose from and the theater with dozens of costumes, wigs, shoes, and masks!",
   "We’ve been going here on a membership since last summer. I really love the idea, and the guy at the front desk is always so nice. But I’ve seen the cleanliness go down hill and last time it smelled unpleasant downstairs so we didn’t even play down there. But I think this would be more successful if they did a big spring clean-out. It is just piles of stuff.",
   "What a great place for kids! It's way worth the value, there's so much for kids to do here, from blocks and duplos, to animals, to exploring art or the dentist office or the supermarket. It may seem random and a little out of the way, but that's just part of it's quirks. If you bring your kids here, be prepared to spend a couple hours cause they'll have such much fun playing.",
   "Very nice Kwanzaa overview for kids! Lots of great kids activities!"
  ]
 },
 {
  "name": "Historic London Town & Gardens",
  "address": "839 Londontown Rd, Edgewater, MD 21037, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6df80e8-932d-11ea-ae07-14b31f159f22.png",
  "tags": [
   "kids",
   "pets",
   "history",
   "history",
   "creative",
   "nature",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8409070277858429882",
  "source": "GoogleMaps",
  "reviews": [
   "Just the perfect place for a wedding! The site is well manicured, historically accurate and waterfront views, spectacular. I’ve been to their garden sale when plants are divided and have bought some of the very best native trees/shrubs and plants, ever. Come early because there’s always a long line for great prices. It is  also terrific for kids - a great learning experience - and pets, friendly and warmly received. Go, spend the day and have a picnic.",
   "Just left a Wedding Open House. Gorgeous venue for a wedding. You have the water, the gardens and a taste of history all in one setting. Beautiful views. Large grounds that are well maintained. You cannot go wrong!",
   "Loved the history & the well preserved condition of the buildings.  Off season so no crowds. The historical placards were concise & yet informative as well as easy to read & understand.",
   "Imaginative play, creative learning and nature exploration all make for a great educational experience.  Yeah, London Town.",
   "Neat little hidden spot. Was here for a tour as part of a convention group. Interesting display of history combined with a botanical garden. Some impressive redwoods!"
  ]
 },
 {
  "name": "Crypt of John Paul Jones",
  "address": "Blake Rd, Annapolis, MD 21402, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b734a75c-932d-11ea-8e94-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=5079216428708888649",
  "source": "GoogleMaps",
  "reviews": [
   "Perfect example of the Russian-American part of history.",
   "I am not sure the stars really matter here -- the whole campus was amazing, and the crypt was an interesting part of the naval history there. John Paul Jones was a fascinating character whose remains were relocated to the crypt below the cathedral. The tomb is ornate, marble with dolphins, and JPJ's history can be found on the walls encircling it. Worth visiting if you enjoy random historical tidbits!",
   "Attention to detail is amazing. What a great opportunity to honor the first Navy officer in the US's brand new Navy. We loved the breadth of information included.",
   "The crypt is amazing.  The fine workmanship and attention to detail is phenomenal.  A must see if your visiting the campus.  This is my third visit to it.  Use to have a honor hard.  But our leadership deemed it unnecessary.  For some reason traditions seem just to be fading away.",
   "Well worth the trip. Seeing the crypt of a Revolutionary hero was very special"
  ]
 },
 {
  "name": "Truxtun Park",
  "address": "273 Hilltop Ln, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7838c1a-932d-11ea-a8f7-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9113043522084074797",
  "source": "GoogleMaps",
  "reviews": [
   "This place lies in the heart of annapolis but is often overlooked or driven past. It has some trails that lead to the pool and the boat ramp. The facility itself is fantastic. Has many options for workouts. Classes are offered. Area for kids to play. I worked for truxton for about 7 or 8 years and I can confidently say I had some of the best times of my life there",
   "Family fun! Great place to spend the day!",
   "My go to place to think and have peace. Very tranquil.",
   "A great trail and park. The trail section goes thru a well-shaded woodsy trail that is both close to the water, as well as in the middle of the woods. Some sections have a few short and steep inclines as well as roots protruding from the ground. But suitable for beginners.",
   "I'm a bird watcher, and this park is quite close to my home. I've recorded about 70 different species here, which is OK for such a small park.\nIt's seldom crowded, and the people you meet tend to be nice.\nIt could use some minor maintenance now, but my request to have a tree removed from the path last year was handled quickly. "
  ]
 },
 {
  "name": "Susan Campbell Park",
  "address": "Dock St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7c9e59a-932d-11ea-9c28-14b31f159f22.png",
  "tags": [
   "historic",
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4152235363622116108",
  "source": "GoogleMaps",
  "reviews": [
   "We came to Annapolis from Baltimore to sightsee and have a date night. Susan Campbell Park is located in the heart of Annapolis. We went to one of the restaurants and then walked to the docks and on Main Street to checkout some stores. The park/city docks have benches to sit on. There are newspaper machines too. Cobblestone walkway creates part of the historic feel but beware you can trip easily since it is not flat/even and some of them are coming up. There are bathrooms and showers for boaters nearby. They have parking but it can be a bit tight – some of it is free while others are metered. We hung out a while just looking at the water and people-watching. Great area for people watching if you are into that. We did not partake in getting the famous ice cream nearby (Storm Brothers) since we were still full from dinner but it is a popular place. The Naval Academy is nearby as well if you want to visit that but check the times. It is very beautiful at the docks/park. Main Street has a ton of different restaurants, dessert/ice cream shops, services like real estate, shopping such as spices, clothing, books, Maryland souvenirs, beach themed items, gifts, and specialty shops. I would definitely recommend going to the park/city dock and main street. It is great if you are by yourself, with friends or family, or a date night.",
   "Absolute perfect place to watch the sunrise. You'll often see students from St. Johns, people in photo clubs, and other photographers. Myself included. I wouldn't suggest taking food if you want peace though. Plenty of the local DTA ducks will aggressively approach you for a bite or two, or everything you have! Literally there's no \"ducking\" them within that twenty five yard perimeter. I'd stick to coffee or tea. \nYou can see from time to time; boats docked from all over the world. Including New Zealand. Not often are there people passed out, whether homeless, or just sleeping off the excessive drinking. \nAll depending on when you visit, you might be fortunate enough to catch members of our local Naval Academy as they're initiated.\nKeep your eye's peeled for huge blue heron that often hang out around the docks before sun breaks. Lighting is good and there's usually joggers passing through, or crabbers on the opposite side of the docks \"chicken necking\" and occasionally that cute couple experiencing their first or one of many Annapolis City sunrises... It's certainly a must do if you're in town.",
   "Really like this area/park! Great place to sit and look out at (the activity on) the bay. Very spacious as well. Make sure to stop by here if you're strolling through Annapolis!",
   "Lovely place , very quite , overlooking the river , you must visit it if you are visiting Baltimore",
   "Outdoor concerts by the bay during the summer make this a very fun spot."
  ]
 },
 {
  "name": "Thomas Point Park",
  "address": "3890 Thomas Point Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b812af54-932d-11ea-adc1-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "historic",
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9860818020147761601",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to take a walk and see a nice sunset. There are two gates, so I don’t believe this would be a great place to watch a sunset. The opening hours are far past sunset and the gates will keep you from getting in to see the sunrise. There are many potholes on the road in, and it’s only a one-lane road, so definitely drive slow. There are a bunch of deer and many birds that live here, so there’s a strong chance you’ll see wildlife on your trip here. It’s a free park, so that’s also very nice. \n\nThe lighthouse is a lot farther from the point than I thought it was, so it was a bit difficult to get a picture worth saving with my phone.",
   "An historic Anne Arundel County park, it is part of Chesapeake Bay Heritage. Beautiful, natural scenery, with plenty of waterfowl and wildlife. Great for walking, picnicking, and fishing. Great longviews of the Thomas Point lighthouse and Chesapeake Bay Bridge. Be sure to read the rules online for going in & out of the park. Permits are required for some parts, except in winter. Also, be aware that there are numerous potholes on the clay/gravel road inside the park.",
   "Excellent 270 degree view of the Chesapeake Bay South of the bay bridge.  My primary use is for Winter bird-watching, which can be excellent at times, but the warm weather fishing is very good.  (Permit required). There are a few picnic tables, port-a-johns, and a reservable  area for larger gatherings.",
   "Good for fishing..not much else",
   "The local guide is not correct about the park being free. During the warmer spring and summer there is a fee to get further back in the park.not so during the fall and winter months .Also I have been coming here for yrs and the scenery here including sunrise and sunset are spectacular."
  ]
 },
 {
  "name": "Sandy Point State Park",
  "address": "1100 E College Pkwy, Annapolis, MD 21409, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8bb0d5e-932d-11ea-963b-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6615515204534615760",
  "source": "GoogleMaps",
  "reviews": [
   "I was here for the 2020 MD Polar Bear Plunge. There wasn't much of a hassle with getting in even with so many people attending, volunteering, and working the event. The only downside was it didn't really seem like there was good signage with parking. We had to park in a particular lot but we had a hard time finding it. We drove around and then had to turn around to get to the correct one. Other than that, the event was awesome. It was my 2nd time doing the Polar Bear Plunge. I will definitely be going back.",
   "**REVIEW FOR LIGHTS ON THE BAY!**\nThis light show is one of the nicest ones around, if not the best!\nIt's a very lengthy course. About a two mile drive along the Chesapeake Bay with approximately 70 animated and stationary displays illuminating the roadway.\nGreat place to bring the whole family for a fun-filled drive.\n5 out of 5 stars!",
   "A nice convenient beachy experience without having to cross the bay bridge and deal with weekend traffic and then a few more hours of driving to the ocean. \n\nThey have a lot of picnic space, and ample space in general so even with a good amount of people there it’s still comfortable. \n\nI can’t imagine the water is the most clean, but it’s not noticeably unhealthy. \n\nOverall a good quick spot near DC to get away from the city for a few hours.",
   "We enjoy Sandy Point. Since OC is few hours away this is a good  place for a day trip! Clean beaches, in-season refreshment stand, and even fishing. Fun family fun for the day!",
   "This place is very dear to my heart. My family has been going here since I was a child and family event would take place there. Ppl normally complain about the jellyfish but I never had any problems with them. I enjoy being with my family here."
  ]
 },
 {
  "name": "Paddle or Pedal",
  "address": "Quiet Waters Park, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9480db0-932d-11ea-9dce-14b31f159f22.png",
  "tags": [
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1402057515534807500",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely amazing a great family experience staff is super nice and helpful",
   "Beautiful weather and very friendly people",
   "Super nice staff they stayed open till 7 to let us get out on the water. Amazing place to kayak. Very well priced too!",
   "A great way to spend an hour or two on the water at a reasonable price. I've rented paddleboards in. August 2018 and again in August 2019 when visiting family. They had great boards and the location is perfect for beginners too.",
   "The staff are really helpful and they have great deals on gently used kayaks at the end of the season"
  ]
 },
 {
  "name": "Maryland Renaissance Festival",
  "address": "1821 Crownsville Rd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba1aca9e-932d-11ea-a8b1-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "music",
   "drink",
   "kids",
   "kids",
   "eat",
   "unique",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13617345820415412809",
  "source": "GoogleMaps",
  "reviews": [
   "Always a good time! Festive, fun, music, food, crafts. Rain or shine, great family fun!",
   "I have always loved the Renn Fest. I don't remember when it was @ Hopkins, back in the day, but I do remember Columbias Symphony Woods. I love the new location in Kingsville, it's darn near a perfect setting. Only down side is that the clientele is changing. Not so many people into the Renaissance theme anymore. A lot of Cosplay folks and younger kids there just to drink beer.",
   "My opinion is unfairly biased.  I really enjoy Ren Tests.  I have been to several different ones in several different states.  That being said, I really enjoy going to the Maryland RenFest.  There are multiple shows going simultaneously, so there's always something to watch/do.  There are elephant, camel, and horse rides, which myself and all of my children have gone together.  My kids always have a great time.  It is a yearly tradition in my household to attend the RenFest, and I see no reason why that tradition will not continue into the future.",
   "Just an awesome experience, helpful friendly players, lots to see, lots to eat, lots to do, come early stay late",
   "Always love fair! Even more fun when you go dressed up! Great food and shows, unique goods for sale, fun for kids of all ages! Hit the ATM before you go, it sucks to have your fun held up by ATM lines. Also if you have a small child, bring an off-road stroller. Makes it much easier to get around and see all the merriment!"
  ]
 },
 {
  "name": "Chesapeake Bay Bridge",
  "address": "Chesapeake Bay Bridge, Annapolis, MD 21409, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/badf6db6-932d-11ea-b0e7-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11422645175808175489",
  "source": "GoogleMaps",
  "reviews": [
   "I received  a Citation Toll Violation for $56.00 dollars. Video Toll amount $6.00 and  penalty amount for $50.00... But that's just it. This is the first time I have received this bill and its from 9/28/2019. First notice includes \na 50.00 fine. I called and spoke to customer service and the woman was very rude and kept talking over top of me,  stating I did receive another notice.  But in all honesty I have not and was not willing to help and make things right. I am a single parent and can not afford a 50.00 fine for a $6.00 toll.",
   "How do I rate a bridge? Lol. I absolutely hated this thing the first time I drove over. Full blown panic attack!! But, if I want to visit my heavenly spot, the beach-I must go over it. Proud to say, that while I still get anxiety, I do it! Stay focused and don’t rush! 🏖",
   "It's a fear buster if you r leary of heights.\nSpeed limit 40 mph it's all good. Enjoy the view!!  And fresh air.",
   "Nerve wracking. Grip the wheel tight. Pray. Make sure if you have kids they don't distract. The first thing that crossed my mind was I paid 4 dollars to die. After. Sense of accomplishment and find another way back.",
   "Eastbound: $4 cash for a car. As of this review, no construction. \n\nWestbound: Toll-free. Bridge deck is pretty bumpy based on where the road seam lies in relation to the striping (this is due to construction so hopefully temporary). Double yellow line is confusing when leftmost lane is open for same-direction traffic."
  ]
 },
 {
  "name": "French Soldiers Monument",
  "address": "Annapolis, MD 21401, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb2a5c64-932d-11ea-88ae-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2993168417255272607",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Ellen O. Moyer Nature Park",
  "address": "7300 Edgewood Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb80947a-932d-11ea-97f7-14b31f159f22.png",
  "tags": [
   "nature"
  ],
  "link": "https://maps.google.com/?cid=12013805909611339911",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice little park and a rare public water-access site within Annapolis city limits. There are 2 parking areas connected by a nature trail through the woods. The smaller parking area is near the dock and boat launch ramp, & has just a few spaces. The other parking area is much bigger but further away. There are picnic tables and a water fountain, but no bathrooms, at the boat launch area. If there are bathrooms at the other end of the park, I didn't see them. The boat ramp is non-slip metal, so you won't get muddy launching a kayak here. The park is in the midst of several marinas full of very fancy and impressive yachts & sailboats, and near side creeks lined with beautiful waterfront homes to sight-see. Not much wildlife to see, other than ducks, as this is a very built-up area with a lot of human activity.",
   "A very small park on Edgewood Road in Annapolis. Its high hill provides a good view, and proximity to the harbor provides habitat for many birds, which is my principal interest in this park. There's a few tables and I've never seen it crowded.",
   "Great place for a girl Scout event.",
   "We watched Passing Strings play there at the Maritime Museums event on Thursdays called Tides and Tunes. It's moved from their location in Eastport to this one. It's a more forest area but hey it's a really nice area and the audience was great.",
   "Great evening at the Maritime Museum!"
  ]
 },
 {
  "name": "Downs Park",
  "address": "8311 John Downs Loop, Pasadena, MD 21122, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bbd0ffc6-932d-11ea-92b5-14b31f159f22.png",
  "tags": [
   "family",
   "nature",
   "walk",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10908636449586633444",
  "source": "GoogleMaps",
  "reviews": [
   "Clean and well maintained with a paved 3.2 mile loop to jog. Beach and dog beach are fun, but people sometimes let their dogs off leash at the dog beach despite the signs warning. Burden rescue has a cool owl and there are lots of pokemon stops to enjoy, too.",
   "Great park. Took my grandson for some hiking, geocaching and play time. Enjoyed the trails a great deal, and met a lot of friendly dogs and their owners. He met a friendly snake in the nature center, and there is a really fun magnet game of name that animal! Playground was fun, as were the health activities along the Eco Trail. The beach is nice, even in winter. the whole family would enjoy this park.",
   "This park has everything a public park in Maryland should have. Beach view of the Chesapeake Bay including a view of the Bay Bridge. A fishing pier ( make sure you have your fishing license and saltwater stamp) for anglers to try their luck on. A dog/ pet beach to bring your pet to. Nature trails that are both scenic and exhilarating. A nature/information center about local wildlife that can be found locally. A garden that is perfect for quiet contemplation or a just leisurely walk. An out door concert and movie pavilion that operates during the warm months. In short this park has it all. Make sure to bring your military ID.",
   "My favorite park! I have been going here for almost 25 years, and have fond memories being a kid and playing with my friends, riding bikes, flying kites, etc. here. My husband and I got our engagement photos taken here, and I now take my family and my dog, and am still creating memories! It is a lovely park with friendly staff.",
   "Be aware of the front gate lady.  She would not let us drive in and get cash from a friend.  \nMake sure you bring your six dollars cash.  \nI would have thought a state park would show a little flexibility."
  ]
 },
 {
  "name": "Lawyers Mall",
  "address": "Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc1b0254-932d-11ea-be3f-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1688224151779716956",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to go for a walk on weekends.",
   "Beautiful dedication to Thurgood Marshall. ",
   "Very inspiring. Also is maintained regularly.",
   "Great place for a rally!",
   "Where the action is,, where you will find the Governor . Where some of the Good laws are put in place for everyone, short or tall."
  ]
 },
 {
  "name": "Mitchell Gallery at St. John’s College",
  "address": "60 College Ave, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc6d699a-932d-11ea-9efc-14b31f159f22.png",
  "tags": [
   "art",
   "walking",
   "art",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=16701465426425698221",
  "source": "GoogleMaps",
  "reviews": [
   "What a great hidden gem. We have been going there for 30 yrs",
   "Art gallery of St. John's College with shows that are of a caliber for university art museums of far larger size. Located within easy walking distance of the statehouse.",
   "A jewel in our fair city and just celebrated it's 30 years of existing.  Worth you making it for a visit.",
   "A good if very small art gallery. Don't plan your day around it, but it's a nice diversion.",
   "Lovely show and gallery at a very unique college."
  ]
 },
 {
  "name": "Severn River Bridge",
  "address": "Arnold, MD 21012, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bcb5978c-932d-11ea-856d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15562663762209949324",
  "source": "GoogleMaps",
  "reviews": [
   "Always pleasant to drive through, especially with the scenic view of the river.",
   "It is a hugh, long, high and very beautiful bridge. It also appears like it is a new bridge. The ferry had more than enough space to pass through underneath. It goes higher and higher as it goes across the river. It also appears very strong with plenty of columns holding it in place to hold all the weight of all the vehicles travelling across. It is a fantastic piece of beauty and a magnificent construction across the Severn River.",
   "It's just so beautiful,",
   "It's kind of an appetizer before the Bay Bridge",
   "Almost always a great view and lots if traffic."
  ]
 },
 {
  "name": "Westfield Annapolis",
  "address": "2002 Annapolis Mall, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd00ab76-932d-11ea-b104-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=10337709240326296159",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, Peaceful, Extra Clean, and quiet, very nice friendly people. My highlight was California Pizza Kitchen potato soup and chicken sandwich with 🧀. Fast service, food was extremely fresh, the staff, servers, and waiters were so kind in greeting and welcoming us, they didn't disappear, they checked on us with genuine concern. The ambiance was very inviting, so relaxing and welcoming. I like the design, layout, and decorum is fantastic! Come and see for yourself. I recommend the potato soup",
   "One of the nicest malls in Maryland for sure. Food court could use a few more options but there's places to grab a bite throughout so it evens out. Lots of kid friendly stores and play areas, a video game lounge and a movie theater. Definitely a treat.",
   "Nice place. Lots of good stores and the food court has lots of different varieties. Reminds me of some of the malls back home in California.",
   "What a lovely place to shop!  I live in Texas, so it will be a long time before I make it to Maryland again, but I will remember my experience always.  If you are fortunate to live in Maryland, be sure to go by Westfield Annapolis!  You will not be disappointed!",
   "Big mall, lots of stores, usually full of Midshipmen in uniforms or civies on the weekends.  Parking can be difficult at times.   I wouldn't recommend going to see Santa at this mall.  Its $44 for 3 digital images.  Its a long wait and they didn't even take three pictures.  You can buy a package in advance and schedule a time.  If you are looking for a good place to see Santa go to Bass Pro Shop, you don't have to buy a package in advance and don't have to wait in line.  You sign up to join the wait list, it gives you an approximate amount of time and then it texts you when its time. You have 30 minutes from the time they first text you to get there.  As a result you can sign up and go shopping at that store or other stores in the area.  After that its only like 5 minutes to see Santa and you get a free 4x6 image.  The digital copy is $15."
  ]
 },
 {
  "name": "National Cryptologic Museum",
  "address": "8290 Colony Seven Rd, Annapolis Junction, MD 20701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd45cc18-932d-11ea-98ff-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "library",
   "knowledgeable",
   "tour",
   "history",
   "kids",
   "history",
   "field",
   "library",
   "history",
   "free",
   "kids",
   "knowledgeable",
   "library"
  ],
  "link": "https://maps.google.com/?cid=16723677367461644828",
  "source": "GoogleMaps",
  "reviews": [
   "There is an unmistakable connection between the NSA and this museum. If you are anywhere near Ft. Mead this is a must see. \nThe staff are very knowledgeable and helpful to visitors. They have free materials for both adults and children.\nI would make it a point to visit their library to see their unique collection and possibly chat with the librarian \nThe visit provides a unique glimpse I to the careers of men and women who assess the secrets in our nation's security. I thank them for their service.",
   "Want to understand why we have and need the NSA?  This place explains the history and gives a lot of insight into the headlines (information warfare, hacking, information security) and some great insights into the future.  Allow a couple of hours, and get a tour from the docents--the exhibits are great, but the people take it next-level.",
   "Really, really worth the trip. I know most people today think, uh a museum? How. Boring!....not here. There is so much history and intriguing aspects of espionage and technology it's simply over stimulating. They have areas for all ages. And they even have souvenirs for the kids, ladies and yes the guys.",
   "A deceptively small museum. You can spend hours learning the history of the technology and the people involved with cryptology and cryptanalysis from their beginnings through today. Lots of hands-on exhibits for school-aged kids (and up :). Docent-led tours packed with information - call for timing. There is also an amazing library covering all topics in the field you are free to browse and read. A very well-curated and well done museum.",
   "I loved this museum. Craig was amazing. Very helpful and knowledgeable. I really appreciate his time. The sweet lady working in the gift shop was great too. The amount of awesome information, artifacts, and everything they have here..... One of my favorites in the area. I am so glad that I was able to make it to visit. It's really great for those who are interested in intelligence and espionage and how our people are working to keep us safe. The library is...... amazing. So many good books."
  ]
 },
 {
  "name": "Baltimore-Annapolis Trail Park",
  "address": "51 W Earleigh Heights Rd, Severna Park, MD 21146, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd91a386-932d-11ea-9159-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16941101563124735398",
  "source": "GoogleMaps",
  "reviews": [
   "It's a bike trail, not really sure what else to say. Usually pretty low maintained and not terribly dirty. Nice place to take a long walk for a good bike ride. Certain parts of it should definitely be avoided after dark.",
   "Nice and long trail with beautiful natural view. See picture below what I captured last time. Clean and nice place to bicycling and walking. Trail so   easy crossing but some street road cross may disturb you. Bikers need to careful for local speed limit.  You can found clean restroom , information at park station. If you are planing to visit here  must try once !",
   "It's an OK urban bike trail but I've been on much better even in and around cities such as Chicago. Maryland could step it up a bit. The section between Rt. 100 and BWI Airport can be sketchy. Lots of homeless and Rx addicts. There are times when it's bad enough I've turned around. Signage is confusing especially around BWI so plan your route before leaving if it's your first time. Observation area at BWI is nice. Rt. 450 and Annapolis bridge crossing can be hairy. Parts of the trail will need lots of replacing. Foliage overgrowth into trail makes for dangerous rides. Hey, it's Maryland. This is what you get.",
   "The perfect amount of up hills and down hills to keep it interesting.  The path is in the process of being repaved and is on its last section.  Therefore it's like a new path. Really nice for biking or rollerblading.",
   "The park ranger is very nice and informative. In my opinion this park would be fun for biking. The road is good and smooth. It's about 6 miles one way from Serverna Park to Annapolis."
  ]
 },
 {
  "name": "Maryland State House",
  "address": "100 State Cir, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bddb09de-932d-11ea-ba8e-14b31f159f22.png",
  "tags": [
   "historic",
   "field",
   "history",
   "history",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3776533505969500878",
  "source": "GoogleMaps",
  "reviews": [
   "Cool historic spot. Very beautiful especially with the sunset in the background! There is also plenty to do around the state house including shopping.",
   "Nice state house to visit. It has historical rooms and photos of past politians, a statue of George Washington in the back left room giving his resignation, and lots of pieces of text which give description of the items and photos in each room. Great place to come for a school field trip or with young children. 4 stars because there isn't a whole lot to see but it's still a really good place. FYI: make sure to bring your ID!",
   "Amazing history, and an even more interesting circular road design.",
   "I didn’t actually have time to explore the inside of the state house, but it sure was beautiful from the outside! I’m sure it’s just as pretty on the inside. I feel like it contributes perfectly to the aesthetic and culture of Annapolis. I’d certainly be interested in taking another trip back and exploring the inside, and learning some of the history surrounding the building!",
   "Interesting historical capitol building. You have access on second floor and you can take pics. Free entrance and free tour. You need to have Id."
  ]
 },
 {
  "name": "Towne Transport",
  "address": "25 Northwest St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be26e158-932d-11ea-97a6-14b31f159f22.png",
  "tags": [
   "family",
   "history",
   "tour",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2867430013629325416",
  "source": "GoogleMaps",
  "reviews": [
   "Towne Transport provides the best view travelling around the area. The higher the better. You just can't miss anything. The bus is small and maneuvered the small streets easily. There're windows all around & offers a 360 degrees view.",
   "Best way to get to know the town and its amazing history. My family and I had a great time!\nHighly recommend it!",
   "Love the history  provided while on the tour",
   "Had a great ride. Got to see the town. Would highly recommend.",
   "Mark was our guide.  Very informative.  Sparked my desire to return to area for a few days.   Had lunch at Chicks & Ruth's which was dinner style, noisey with great great food in huge portions at very reasonable prices.  Crab cakes to die for.   Visited 9/19/16\nNot to crazy about pastrami."
  ]
 },
 {
  "name": "National Aquarium",
  "address": "501 E Pratt St, Baltimore, MD 21202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be779adc-932d-11ea-b4ad-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "walking",
   "knowledgeable",
   "kids",
   "walking",
   "family",
   "affordable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14407200344612044430",
  "source": "GoogleMaps",
  "reviews": [
   "Had a wonderful experience!  For father's day my wife got me the Aquarium Dive.  Took a little class for a certification.  Best part of the dive actually was walking through the Aquarium with my wet suit and gear.  It felt like the scene in \"The Right Stuff\"  everyone was staring and in awe of all us.  The dive itself is cool, not very big a much smaller area and tank.  They encouraged us to interact with the people that we looking in.  Since the fish are so used to people they would swim right up to you.  Very cool.  You can even pick up the sand and let it fall down to the ground and the fish would come up and lay underneath it.  I was told it was like a massage for them.  Anytime you did it, the fish would swarm to you.  My kids loved being able to see me in the tank.  It's not the biggest aquarium but lots to see and well done.  Great staff.  In a very popular area with lots of places to eat and check out.  I would highly recommend doing the dive or just visiting it.  You can't go wrong, for a fun and exciting day.",
   "Great visit. Place was spotless even though we got there at sunset. Got to see every exhibit and enjoy our time there. The view of the harbor was really nice too even though it was cold outside. Nice to see they take pride in their Aquarium. I'd definitely come back next time we're in the area.",
   "My trip was absolutely fantastic! All of the staff were very knowledgeable and helpful. The mystery animal was very interesting and I loved listening to the woman putting on the show. She would ask the group of kids in front of her if they had questions to engage them and keep them interested. When I was walking around the rainforest area the lady in there very nicely pointed out all of the animals and gave us a couple more facts about them. The area was also very clean and the animals all looked happy.",
   "Absolutely LOVE the National Aquarium! Exhibits are well developed and the stacked, ascending layout of the aquarium with the amazing reef exhibit as it's anchor is a sight to behold. \nThere are regularly scheduled daily animal encounters as well as an all day touch tank experience. Scattered stations for learning and interacting are spread throughout and really compliment the exhibits. \nOur entire family - from 8 to 40 yrs old - always has a great time!\nWe also enjoy the central Baltimore location which provides access to ample, affordable parking and many options for dining.",
   "No matter if you live in Baltimore or are just visiting, definitely add the National Aquarium on your list to visit. We loved this place the first time we came. What a cool and fun experience!! The entire family was able to enjoy the Aquarium. There is a lot to see here, so if you're not able to devote an entire day, I highly recommend making time to come back. We asked for year passes for Christmas, so we're going to be regulars here. Very family friendly, no matter the age. 5 of 5 stars for sure."
  ]
 },
 {
  "name": "Lake Waterford Park",
  "address": "830 Pasadena Rd, Pasadena, MD 21122, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bec14f5c-932d-11ea-803f-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "family",
   "hike",
   "walk",
   "kids",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7561011565623721555",
  "source": "GoogleMaps",
  "reviews": [
   "This place is great. Recently updated and had lots of new things like a large swing that I can only describe was on a zip line, several slides, and an instrument area. There's also plenty of tables and benches for picnics and relaxing. Tennis and basketball courts. I was surprised that the bathroom was pretty clean too.",
   "This park is beautiful there are some things to do there is a park for the kids and a lake to see the ducks and geese. You can fish or even hike the trails to see more wildlife. You can go and have a party or picnic with the family or friends. Great place to be outside. There are basketball courts, baseball field, football field and even a tennis court so much to do.",
   "Wonderful park trails. Met a nice local lady and chatted. Great community, you can see it in the diversity of the playground. Large area. Would be cool to see what events take place here. Maybe a Medieval Fair.",
   "It's a pretty decent park to take the kids to play, have a cookout or just shoot the breeze and walk the trails. For the most part the restrooms have been very clean any time I've visited. Great place to go play ball as well. Not sure if anyone has mentioned before but there are 3 pavilions you can rent for events or a special occasion. There's one large pavilion and two smaller ones. The large called Blue Jay is right by the playground. The two smaller ones the Goldfinch and Chickadee are side by side in the wooded area on the lake side of the park. I'll be having my baby shower here in June so I'll give an updated review then according to my experience. I'll be adding a few pics of the Chickadee pavilion below. I hate that they don't have photos of the pavilions for you to see before renting. So figured I'd help out. There are 8 tables and 3 grills to each small pavilion. When you go on there site they mislead you to think each small pavilion is only $100 to rent. However once you go to book that isn't the case. The Goldfinch is $100 to rent but the Chickadee is $160 to rent. Even though they are side by side the Chickadee costs more because it is considered to be the most private of the two. Although I feel this is bs it isn't my call so just that I'd add that.",
   "A large wooded park with a number of playground structures for kids of all ages. Plenty of room to play, large fence around the playground. Nearby walking trails to the small man made lake provide young ones something to do. Highly recommend this park for families."
  ]
 },
 {
  "name": "Pennsylvania Dutch Farmer's Market",
  "address": "2472 Solomons Island Rd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf142bf8-932d-11ea-8c19-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "food",
   "affordable",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4095067521619431729",
  "source": "GoogleMaps",
  "reviews": [
   "We loooove this place! I’ve been coming here since I was a kid and it’s always the same which is great. I’ve never had a problem here for anything. The food is all freshly made. Prices are reasonable. We can’t leave without a soft pretzel or two. If you’ve never had one, stop what you’re doing and go get one!\n\nTheir store in the back is great with a lot of unique things for sale.",
   "It’s not about what to get here. It’s about what not to get. Everything (and they have just about everything) is amazing. Personal highlights are the pretzel dogs, pot pies, fried chicken tenders, and the ice cream \n\nFrom baked goods to furniture. This is the spot. Gets very busy at lunch. Expect to wait. But the staff is so friendly you hardly notice",
   "So much fresh and delicious produce and food! The cheeses are so good and affordable I don’t go anywhere else now! Would highly recommend stopping by and maybe grabbing a pastry! If it’s your first time I would ask one of the helpful people working there how check out works. I got a little confused my first time but they were so helpful and kind!",
   "I want to like this market but too many cons for me.  First, the parking is woefully inadequate for the patrons.  It's difficult to find parking and others shops in that area compete for spaces as well.  Second, while there is a nice selection of vendors it's so darn crowded you have to decipher where the line ends vs crowd of people.  Good luck moving a cart around there.  Go early to try and beat the rush.  Also, trying to leave the shopping center can be a challenge.  Poorly designed traffic flow and exit.  It would be better if they had a larger space elsewhere with better parking, but that's just my opinion.",
   "Awesome place to get anything from fresh meats, produce, preserves, and condiments to delicious cranberry bread, chocolates, breakfast, and sandwiches. The array of choices is darn near overwhelming! You have to pace yourself and know that you can always go back again. The lines can be wrapped around the store at lunchtime and on Saturdays but weekdays in the a.m. are pretty kosher. If you have not been, it is a must experience. With the amount of patrons that come to the market daily and the assortment of goods that can please most any palette, it is a win-win for the Pennsylvania Dutch Market and the community at-large. Oh, I almost forgot,  there is also the option to buy handmade furniture.  Did I say this is a five star establishment?!"
  ]
 },
 {
  "name": "Oriole Park at Camden Yards",
  "address": "333 W Camden St, Baltimore, MD 21201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf5861f6-932d-11ea-a612-14b31f159f22.png",
  "tags": [
   "field",
   "knowledgeable",
   "food",
   "parks",
   "family",
   "family",
   "drink",
   "kids",
   "family",
   "food",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=2605571249100277049",
  "source": "GoogleMaps",
  "reviews": [
   "Camden Yards is a cathedral of baseball compared to many of the newer parks that seemingly have constant distractions and alternative forms of entertainment. The park is striking beautiful, the seats are close to the field, and there really aren't any bad seats. Fans are attentive and knowledgeable, making it a great sports experience. There are some surprisingly good food options if you know where to look too.",
   "Love coming here and bringing family from out of town to the games. We always have so much fun! It is such an awesome stadium and experience. We just moved here and my hubby already got season tickets.",
   "This is one of the few ballparks in the nation that isn’t corporately owned. It’s a perfect location for a professional baseball game and a night out with family or friends. The park has a lot of amenities that will make your baseball experience amazing! If you’re visiting Baltimore during baseball season, make time to see a game.",
   "Best baseball park in professional baseball. Great layout. It’s a blast to go to games. Tons of great food and drink. And they have a great kids package called dugout club that is reasonably priced and gets you access to 5 or so games a season plus discounted tickets for the adults. At these games, they have extra kid activities like balloons and face painting. Overall good old fashioned family fun.",
   "This is such a gorgeous ball park. We’ve been traveling around to different ball parks and this was one of our favorites. The workers were so welcoming (even though we were in full Detroit Tigers gear), helpful, and taught us a lot about the park. Everything about the visit was wonderful. We loved it!!"
  ]
 },
 {
  "name": "Chesapeake Bay Maritime Museum",
  "address": "213 N Talbot St, St Michaels, MD 21663, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bfa4ae98-932d-11ea-a61c-14b31f159f22.png",
  "tags": [
   "history",
   "learn",
   "kids",
   "history",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2772959957728231762",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a treasure, and gets better every time I visit. The boats and the exhibits are wonderful, if not amazing, and they all tell a story about a place and time. The staff/docents are well informed, and only too happy to talk about the Bay, its boats, its people, and its history. Highly recommended. A must-see if you love wooden boats.",
   "This is one of the most beautiful museums I have eve been to. Even though the day was cold we were able to really enjoy all the museum had to offer. We went up and explored in the lighthouse, played in the tugboat, and stepped back in time as we read the stories looked at the black and white photos on display.",
   "It was a great and fun experience. The kids enjoyed their selves which as long as they can touch things and run around lol they tend to be content. Over all its a great place to learn about the bay and the history behind it. Its also a great way to learn about oysters, boats and other water life creatures. Also it was pretty cool watching a boat being built. Im not sure the price to get in the museum though we went on a class trip.",
   "We were visiting from Ohio on a groupon deal and didn't know what to expect or what St. Michael's had to offer as far as things to see and do. We were so very impressed with this museum. When we set out to see it we thought it would be one big indoor building but instead there were a bunch of different buildings set up in a little village style. Everything was so informative and interactive with lots of personal stories. You were very much encouraged to interact with everything which you don't find in a lot of museums. It gave us a great appreciation for the Chesapeake Bay area and the people that made their livelihoods from the Bay. I would definitely recommend a stop there.",
   "Lots of walking but lots of garden benches and places to sit & rest if you need to. Well maintained displays! Lots of history. And of course, the beautiful water. Great afternoon spent at the CBMM!"
  ]
 },
 {
  "name": "Live! Casino & Hotel",
  "address": "7002 Arundel Mills Cir #7777, Hanover, MD 21076, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bff763f6-932d-11ea-a854-14b31f159f22.png",
  "tags": [
   "tour",
   "food",
   "learn",
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12138384903175781443",
  "source": "GoogleMaps",
  "reviews": [
   "Attended a private event and got a \"behind the scenes \" tour of the special event space. What a great venue to host any size of event! No need to worry about adding fees for decor; it's already there! Got to see the dressing rooms for the entertainment and a look at the suite level. Very nice!!! The food was good too! And that doesn't cover the 10 restaurants on-site. If you haven't been there before, go check it out. For a concert, dinner, or gambling and an overnight stay. There's something for everyone.",
   "I enjoyed the Casinos. It was a nice event for my son and I at his request. As a first time gambler, the Black Jack table, the associate was accommodating in helping me learn the tricks of the trade. He was nice and instructive on how to not touch the table and money while the game is in play. I won every game as a first timer. When my son returned and observed my winnings suggested we leave that table. The bathrooms were clean. It was a fun time.",
   "Great new venue!\n\nHad the privilege to see Jill Scott here, it sounded great and visually it looked stunning.\n\nBathrooms, seats and bars are all brand new and staff was very friendly, courteous and helpful.\n\nSeats were a little bit expensive but that's the case for most acts today.\n\nThere is plenty of free parking in the garage or across the street.\n\nWe hit up Prime Rib before the show and I would also highly recommend grabbing dinner or drinks there before a show as well.",
   "This casino has plenty of parking and is we'll lit on the outside. The inside is well taken care of. I have only been to an old casino and this is nicer than that one. I enjoy the poker room and they have good restaurants. It is also a nice facility to walk around and mingle. All the employees there are nice and professional. I would return.",
   "Great casino!  Such a lovely place and the fact that it's non-smoking makes it 5 stars alone (don't worry smokers they have an area for you too!). Staff is very accommodating and friendly. Among the best casinos I've been to. Plenty of games and live tables. And all the restaurants inside are pretty solid as well. Highly recommended!"
  ]
 },
 {
  "name": "Baltimore Museum of Industry",
  "address": "1415 Key Hwy, Baltimore, MD 21230, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c039c566-932d-11ea-a06c-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13123213308938432755",
  "source": "GoogleMaps",
  "reviews": [
   "There's so much to the industry of this famous port. Be sure to attend one of the guided tours. They will provide so much insight and original story telling. It's a real treat to have them demonstrate how some of the machinery works, too.",
   "So interesting! My husband and I have been wanting to visit for a few years and we got a Saturday together without the kids so decided to finally check it out. I have to say, I’m glad we went without the kids. It was worth the wait. There’s a few things for kids to do but not really a whole lot and I would’ve been stressed out trying to keep my toddlers from touching all the things. Plus, it was fun to be able to take our time and really read everything with no distraction!",
   "Super cool! My cousin had their wedding there and it was awesome! Being able to take a break from drinking and dancing to wall out on the docks was so great!",
   "This was a wonderful experience. A beautifully curated collection of Maryland’s industry over the years. We were attended by two extremely kind and patient museum guides, I can’t thank them enough for their care of our little energetic troop of youngsters. Add this place to the top of your list for great family and educational fun.",
   "Very interesting museum. Think it is better suited to bigger kids and adults. They did have a few activities that younger kids may enjoy."
  ]
 },
 {
  "name": "National Mall",
  "address": "Washington, DC, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c083a10c-932d-11ea-82d5-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "walking",
   "history",
   "walking",
   "walk",
   "walk",
   "food",
   "history",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4181780599637681985",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely love it here.  The architecture, the history, exhibits and sense of pride walking throughout is just incredible.  There are also tens and tens of local food trucks and many events that happen on a near weekly, if not daily, basis.  It's definitely worth visiting and seeing all of the things that the National Mall offers.",
   "Wear good shoes bring a pair to change into. Bring powder for chub rub. Use the toilet, very few places to potty!\nLove love love DC \nPlan your trips to see a little at a time. It's a lot to see in one day.\nPersonal favorite Spy Museum.",
   "You can't go wrong visiting the National Mall.  You have all is the museums and monuments within walking distance.  So much history!  It's one of my favorite places to visit.  Best time to go is during the Cherry Blossoms in early spring.  You'll never see anything so beautiful.\nI'll edit this post throughout the years to add photos.",
   "I love the national mall. It is so great. All the memorials and monuments are spectacular and from a few places you can see the White House. If you can see all of the memorials and monuments they are beautiful. It is also an enjoyable place to walk. I highly recommend going up to the top of the Washington Monument.",
   "Awesome place ! The whole mall is huge. It has a lot to see and most of it is free. Lots of monuments to appreciate and take pictures of. You really do walk a lot so be sure to bring comfortable shoes. Walking around could even get pretty romantic with your significant other, on any time of the day, but at night all the monuments are lit up and look really nice. Also, we always felt pretty safe when walking around. Just be careful around the subway exits, as sometimes there's suspicious people around.\n\nThere are museums for every taste, and most of them ( if not all) are free! Really enjoyed the Hirschhorn Museum, Natural history, and air and space! Should not miss those! \nThere's also lots of great food places around, food trucks and restaurants."
  ]
 },
 {
  "name": "The Maryland Zoo in Baltimore",
  "address": "1 Safari Pl, Baltimore, MD 21217, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0c42d98-932d-11ea-a8af-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "knowledgeable",
   "affordable",
   "kids",
   "kids",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5315503223648686679",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent zoo, our kids absolutely love it (and I do too!). A bit pricey, but you can tell they spend the money well -- animals are professionally cared for, and the facilities are in fantastic shape. Every staff member I've encountered has been friendly and helpful. You can do the whole thing in a day if you don't mind lots of walking, and it's well worth a visit if you're in Baltimore.",
   "Love the Maryland Zoo, the staff was so friendly and knowledgeable. I loved seeing all the amazing animals, my personal favorite was the polar bear.  It was nice to have the tram near the entrance as I have a bad knee, it make getting from place to place so easy. Thank you for all your hard work to take care of these animals.  If I have any suggestions, it would be to allow for more affordable animal encounters, so I can see them up close, I dont mind paying a bit more!",
   "I've been visiting the Maryland zoo since I was a child and it was called the Baltimore zoo. Changes of happened over the years including the name, but the mission itself and the quality with which they display the animals they tend to have not changed.\n\nMy kids love the Penguin area and the new elephant habitat especially, for the old staples are still pretty amazing also.This weekend my sister and I went and got to relive our past trips to the giraffe house while our kids were amazed by their beauty. Looking forward to returning soon!",
   "It was a great experience. It was a nice day and most of the animals were easily visible!! The kids really enjoyed it. The only not so pleasant part was the wait on our food was almost an hour long.",
   "The animals are all kinda spread apart so you'll have to walk a good distance before you can see the next animal.  They have a trolley to take you back to your car.  You'll need that bc its quite a nice long walk. They charge for entrance and its pretty pricey.  Overall,  nice zoo!"
  ]
 },
 {
  "name": "Sandy Point Shoal Lighthouse",
  "address": "Sandy Point State Park, 1100 College Pkwy E, Annapolis, MD 21409, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1033374-932d-11ea-8a88-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=10813936301420501918",
  "source": "GoogleMaps",
  "reviews": [
   "Ok lighthouse cruise.  It's 3 h long, and you see only 3 lighthouses and bay bridge. So there is a lot of time to eat or talk. Not much to see for this length of cruise.",
   "Very cool to place to take photos of. Seems to always be under construction but with limited progress. Still, great place to look at from a boat.",
   "Caught a bunch of rockfish here",
   "20 inch rockfish allll day",
   "Seanec place but no fish."
  ]
 },
 {
  "name": "United States Botanic Garden",
  "address": "100 Maryland Ave SW, Washington, DC 20001, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c147b7d2-932d-11ea-89d1-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "kids",
   "art",
   "field",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11346453115262107424",
  "source": "GoogleMaps",
  "reviews": [
   "Our family really enjoyed the Botanical Gardens.  We went Thanksgiving week. It wasn't too crowded. The DC Landmarks made out of plants and plant products were really cool. The place is very well laid out and the plants and trees are beautiful, things are well labeled and easy to read. Our kids ages were from 3-12 and we all loved it. We are looking forward to go back in the spring to tour the outside gardens!",
   "The green house in the Garden is massive and amazing. It truly gives the tropical feeling of warmth and comfort. Beautiful flowers and plants of colorful hues are spread all over the Garden. And the seasonal displays of the Holidays and the changing seasons are spectacular! A definite must for those who love to embrace the beauty of life!",
   "A must visit. Especially around the Holidays. It was really empty on Christmas day when I visited, which made for a short line to get in. There's a stand with good coffee outside. Check out their exhibits, they do a really good job making art with plants. Also, I recommend reading the introductory signs next to the plans. Really interesting information.",
   "Very nicely designed. A huge botanical field.\nmust-see...More green than the variety of colors I was expecting but it was still a really nice place to go.  Definitely worth walking through and wasn't that crowded for a Saturday before lunch time. Mini bazaars are fine looking coffee bar and cute gift shop: selling coffee travel mugs, appropriately, along with botanical logo print aprons and tea towels, scented candles, and so on!",
   "If you want a reason for imperialism here it is. Beautiful and exotic plants from all around the world. Domestic and foreign Origins one always gets a sense of calmness and knowledge from entering Botanical Garden in any season. Best enjoyed in the spring or summer"
  ]
 },
 {
  "name": "Smithsonian National Museum of Natural History",
  "address": "10th St. & Constitution Ave. NW, Washington, DC 20560, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1916c5e-932d-11ea-998c-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "history",
   "family",
   "free",
   "history",
   "walking",
   "learn",
   "history",
   "walk",
   "kids",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14406435510458217903",
  "source": "GoogleMaps",
  "reviews": [
   "First let me say I could live in the Smithsonian museums.  The exhibits are amazing and there are so many of them.  You could spend several days in just one museum in order to truly take in the wealth of information.  They also have theaters, gift shops and cafes.  The best part is admission is free.  I am a member of the Smithsonian Institution because I believe in their mission and I want everyone to have access to this American treasure.  The Natural History Museum is the one I visit the most (Air and Space is a close second) mainly because it is good for kids and all my family members have kids; so we go there when they visit.  I love the dinosaur exhibit and of course the Hope Diamond is cool.  The live butterfly exhibit is a great experience too.  Everyone can find something to love about this place.  Check it out!  :-)",
   "You can never go wrong when you visit DC and the museum. Put on some comfy shoes and get ready for a lot of walking. All museums are free as well as parking if you can find one. If you get to DC early enough you will find a spot. The Museum of Natural History is a must and make sure you do the butterfly section. Well worth the money just to see the joy of your child’s face. I love doing this every time I come here cause it is awesome to see the butterflies and the chrysalis they have. What even more awesome when the butterflies land on you.",
   "One of the best natural history museums! Going here was an experience that I never want to forget. Seeing the fossils was the absolute best part especially with the updated information about how the dinosaurs had feathers. We were ecstatic to see that.i am a dinosaur fanatic ever since i was a kid. Then moving on to the geology and astronomy section was amazing for me. Seeing the rock formations and the space rocks were a dream come true. I'd love to come back here again some day.nice place to spend time and learn some history",
   "This review is for the Butterfly Pavilion Only! \nWe were in DC over the weekend and decided to go into the Smithsonian and finally check out the butterfly experience. I paid $17 dollars for two adult tickets online which if you ask me now is the experience worth the price? I'd say no for adults and maybe for kids, here is why. First issue I had is this is an additional cost experience within a massive FREE museum already curated for kids with endless displays to meet any child's interests and keep them engaged for hours. Second, given it is an additional cost for admission I had an expectation that the experience would align with the price and that was not the case. The room where the butterflies are on display is the narrow length of a cross walk and the amount of butterflies flying around is descent not too many not too few, in my opinion I wanted to see more of them it wasn't what I envisioned. Most people (adults) were taking advantage of the photo opportunities which was fun. Parents beware if you are bringing kids the idea maybe good in your head but I found a majority of small children were uncomfortable or outright scared of the butterflies and moths being so close to their face, ask your children first before you invest it maybe innocent to you but kids can freak out and some enjoyed it not to say all kids were scared. Lastly, it was crowded and you are not allowed to touch the butterflies which is for their safety. Overall average experience with a good photo opportunity, you decide if the price point is worth it for yourself.",
   "Awesome exhibits. More to see, read and understand than can be done in one visit (only opinion and millennials likely can go a lot faster). Going there during holidays is nice because the lines are shorter and they move faster. Our grand children loved the dinosaurs and the gem displays. Great visit .... again and again....I think we have been here on at least 4 or 5 occasions - with different family members. Great place."
  ]
 },
 {
  "name": "United States National Arboretum",
  "address": "3501 New York Ave NE, Washington, DC 20002, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1df189c-932d-11ea-ba42-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=684422293717110923",
  "source": "GoogleMaps",
  "reviews": [
   "I visited in February, before you usually get leaves or blossoms, but it was still awesome. I can only imagine how lush this place must be when it's not winter. Still, the lack of crowds gives a relaxed, meditative feel. Looks like plenty of parking and options for self guided tours. I especially recommend the bonsai exhibits.",
   "It's a lovely place that's got very interesting attractions. There are great picnic spots all over the place, and lots of open spaces. All you need is a couple bikes to get around if you don't want to take your car everywhere. That being said there are lots of parking spaces in and around the attractions. There are a lot of really interesting things that are out of the way but worth the time to get around to it",
   "If your looking for a place to just get away, but don't have the time to drive an hour each way, swing by the U.S. National Arboretum.  The Arboretum has plenty of places to stop for a picnic, nap in the sunshine, take in the Bonsai exhibit, or you can just sit still and take in all that the US National Arboretum has to offer. There is no entry free just to roam the Arboretum.  The Arboretum also offers tours and they even have a cellphone tour!  Now swing by and enjoy the tranquility that the Arboretum provides right in D.C.",
   "This park is bike friendly, kid friendly and dog friendly! It’s a great space to spend time outdoors while respect your “social distancing” needed this days. Enjoy! Magnolias are in full bloom.",
   "What's more to say? The pictures say it all. This is a beautiful place especially in ore-Spring with everything just starting to bloom. There are miles and miles of trails, everything from herbs to ferns. Bike ride, walk, but find a parking place and get out and enjoy."
  ]
 },
 {
  "name": "National Museum of African American History and Culture",
  "address": "1400 Constitution Ave NW, Washington, DC 20560, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c23d8dfa-932d-11ea-b57b-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "history",
   "free",
   "history",
   "food",
   "walking",
   "history",
   "learn",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10953207117944925958",
  "source": "GoogleMaps",
  "reviews": [
   "A Unique Museum experience! Smithsonian has artfully chronicled African-American history from the Trans-Atlantic Triangular Trade to Present Day America. A must-see for everyone young and old, of African descent or not. You will not be disappointed. It's highly recommended that you budget at least 2-3 hours for the entire museum tour. They've curated an impactful collection of artifacts and stories and presented them powerfully. It really helps one understand and piece together some of the outcomes we're seeing today. HIGHLY RECOMMENDED!",
   "It is really recommended to visit! You can spend the whole day there, reading each introduction carefully or choose to be inspired by your interested topics like sports, musics, politics, and so on. I really love the museum not only because it’s talking about cultures but also emphasizing that people should not be defined by its color or races. It is introduced and categorized by different genres of musics and sports so people can choose their interests and know more about it. There’s a gift shop on the first floor selling some stuff like the postcard I bought with Martin Luther King’s quote. Also, the museum is for free! So why not give it a try?",
   "Hands down a beautiful museum with such educational and inspiring exhibits. It is my favorite Smithsonian that I visit several times each year plus the Sweet Home Cafe has the best food out of all the museums. Here are my tips for visiting:\n-come on a weekday\n-you need a minimum of 2 visits to experience the museum\n-plan to spend about 3-4 hours exploring\n-try breaking up the visits between the \"history\" and \"culture\" exhibits\n-bring comfortable walking shoes\n-take your time",
   "It displays the history of African Americans in the US in chronological order. Even before they were brought to the US. It's detailed with a lot of reading. During Black History Month there's a lot of School Group so it can get crowded and you may have to wait a bit to read about the exhibit. There's also audio which helps. It begins from the bottom up. You'll need an entire day to go through it all. It's well done. The history can be horrible and sad but it is what it is and it's time to be told.",
   "The National Museum of African American History and Culture was a wonderful and educational experience for me and my family! My children really enjoyed this place! My husband too! We  were both intellectual and visually stimulated ! Visiting this museum will forever be part of trip planning 4 years to come. From the outside in it was simply stunning ! The displays,the building it self and written materials were superbly orchestrated! Thank you for creating such wealth of knowledge for all people to enjoy and learn. We couldn't have asked for anything better! Look forward to others ....and we will be back!!!"
  ]
 },
 {
  "name": "National Electronics Museum",
  "address": "1745 W Nursery Rd, Linthicum Heights, MD 21090, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c28594ba-932d-11ea-b5ca-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15346181501355290617",
  "source": "GoogleMaps",
  "reviews": [
   "This is a pay to view Museum so check prices before showing. They do have association discounts when given the appropriate ID. What is interesting is that this is actually a Westinghouse Museum that applied and was given Federal status. The desk person was excellent and very knowledgeable. Oh, check out Jacob's Ladder, awesome! Overall, great place to geek out!",
   "This place is a gem, and not just for Ham Radio operators. If you're interested in old military technology, old space technology, proto-microwaves, or motors made in the 1880's, don't hesitate to check this place out. There are lots of hands-on, interactive displays, although it's hard to say if your kids would find this more interesting than your parents if they are veterans.",
   "This place is actually very interesting, a bit dated but some really good exhibits covering the development of electronics, more on the military side, but some civilian exhibits as well.  The down side is they close at 4 PM, which means they close the cash register about twenty minutes early and are ready to exit the building right at 4 PM.  They had a couple of souvenirs I wanted to buy on my way out, but everything was shut down and the lady at the desk didn't seem too interested in taking my money, so we both lost out.  They should advertise this place a little better, I never knew it existed until I noticed the outside radar exhibits by chance as I was passing by.",
   "Great museum they have many amazing displays particularly defense systems and radar. It's almost the Westinghouse radar systems company Museum. Great for anyone interested in electronics military history or science and Engineering in general. Compared to a lot of other museums and attractions in the area is very reasonably priced at $7.",
   "Small but informative museum.  Not really a good setup for children.  Military and technology enthusiasts will love it."
  ]
 },
 {
  "name": "Lincoln Memorial",
  "address": "2 Lincoln Memorial Cir NW, Washington, DC 20037, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2cc3bee-932d-11ea-a40c-14b31f159f22.png",
  "tags": [
   "kids",
   "historic",
   "history",
   "family",
   "free",
   "history",
   "structure",
   "field"
  ],
  "link": "https://maps.google.com/?cid=1173699842503618230",
  "source": "GoogleMaps",
  "reviews": [
   "How can you review a place like the Lincoln Memorial? Over the past several years, my wife and I have been on a mission. The purpose? To visit all 50 states with our children.  We only have one left. The District of Columbia is on the list as a must visit. There are so many monuments and statues, and museums.  Where do you begin? The Lincoln Memorial is historic and beautiful and inspiring. We've visited Gettysburg, so my kids have a grasp of the history.  Seeing this monument to a great man is awe inspiring. If you have the chance, you must visit. It's that simple.",
   "Love it... it's a must visit when you are in Washington. You can feel the peace and the respect for this monument. \n\nIt was raining and my 15 months old baby got soaked but she didn't care. We all did. \n\nSo much fun and it worth the travel from NYC to DC in 1 day roundtrip. I will love to do that again with my family. Place was not crowded. But I can't say in a sunny warm day but it Must be a different story.",
   "2020 February\n\nA must-see.. it's just an iconic structure in American history that symbolizes so much!\n\nIts free. Walkable from the monument but a little far. It's pretty at night too..\n\nIf this review helped you in anyway, please give it a thumbs up!",
   "One of my absolute favorite places to visit in Washington DC. If you haven’t gone it’s a must see. The view of the lawn all the way to the Capitol is absolutely breathtaking. It’s a beautiful place to sit and think. The reflecting pools are unreal too. It’s amazing to think about how many times this great area has been full of people fighting for what they believe in. So much energy, power and beauty. If your in our nations capitol be sure to take the time to go see Lincoln.",
   "Four score and seven years ago our fathers brought forth on this continent a new nation, conceived in liberty, and dedicated to the proposition that all men are created equal.\nNow we are engaged in a great civil war, testing whether that nation, or any nation, so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this.\n\nBut, in a larger sense, we can not dedicate, we can not consecrate, we can not hallow this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us—that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion—that we here highly resolve that these dead shall not have died in vain—that this nation, under God, shall have a new birth of freedom—and that government of the people, by the people, for the people, shall not perish from the earth."
  ]
 },
 {
  "name": "Washington Monument",
  "address": "2 15th St NW, Washington, DC 20024, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c317020c-932d-11ea-9c31-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "walking",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16821866559714672568",
  "source": "GoogleMaps",
  "reviews": [
   "We got walk-up tickets for the tour of the Washington Monument - my first time ever going up the elevator to the observation deck. It was incredible. A truly great way to see D.C. after walking the Mall and to the monuments ... gave our little one a sense of everything she saw, how far she walked, and the connections between everything.\n\nIt is worth getting up early to get walk-up tickets (just go to the ticket window at the back of the gift shop) ... tickets are FREE!\n\nSecurity is a little tight - literally because there isn't much room - so just be patient and prepared. It's so worth it!",
   "This is one piece that just makes a statement in the city, from wherever you are, just sticks right out, sitting at the center of one of the most important places of the world.\n\nAlready when I first came, driving down the highway, I knew exactly where I was, because there, sticking right through the sky, is this iconic monument. Even at night time it's lit up, by the massive lights. Blends in perfectly with the white Stone architecture of the city.\n\nThe best part it's a perfect point place, for a good sense of direction.",
   "I definitely recommend this place. It is great. You get a great view of the nations capital from up there. And even if you don't go up the monument and park are beautiful. The National mall is amazing. Here are some pics.",
   "Had a great person working in front asking people if they had questions. He told us about the tickets to ride up to the top being free... this guy deserves some credit! Great experience. Even better views. They didn't rush us at all. Highly recommended.",
   "Me and my wife and my friends visited here last Sunday for a day trip. It was really good weather to visit all museums and all memorial monuments. I saw it for the first time and I think it was really huge when we get closer. I didn’t go on top but just to visit is really nice. I also noticed that there was so many food track that I can get any kinds of food there that also very satisfying!!"
  ]
 },
 {
  "name": "United States Capitol",
  "address": "First St SE, Washington, DC 20004, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c362d966-932d-11ea-ab59-14b31f159f22.png",
  "tags": [
   "tour",
   "organized",
   "knowledgeable",
   "tour",
   "history",
   "history",
   "tour",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=325002407615199428",
  "source": "GoogleMaps",
  "reviews": [
   "Such an amazing place to visit. Such a beauty to witness seem like I was in some Museum. Breathtaking paintings, photographs and sculptures enhanced its beauty. All memories of the past so much to see. A must visit when in Washington d.c. so many people in queues to take tour. Its was so easy so book online. Everything was so well organized and very well explained 😊😊😊😊",
   "I had the fortune of Visiting Capitol recently. This is the most magnificent iconic building there is. The experience started with great ease at the visitor center. The tour was booked in advance online so it was very easy. We started the trip with north wing. The tour guide was extremely knowledgeable and she gave full details of the history of each part of the building. The best part of the tour was to see the central dome. There is no limit to the time here that you can spend. Each and every portrait, statue and carvings have a story depicting the tales of this great nation. This was once in a lifetime experience for a traveler like me. I strongly recommend this tour on your visit to DC.",
   "An absolutely must SEE for all US citizens!! Is an absolutely amazing place. The history alone is worth it. Rich in stature with plenty of paintings and sculptures. The beauty of it all is breathtaking. Being able to see the both the House and Senate debate while seating in the gallery is amazing and very awe inspiring. Security is tight so don’t bring a lot with you. Well worth the time and wait!!",
   "I came at night and it was very enjoyable. Not a lot of people but was still able to see the building. Walked around and felt safe in the area. Recommend for cool photos",
   "Its on a walking distance from central bus station and one can have walking tour of the Capitol and near by attractions. Nice view from bus station as well as from front and back side of the building. Since there are many attractions near by so you may not cover all areas. Better spend 2 days to fully explore the area around."
  ]
 },
 {
  "name": "Carrol's Creek Cafe",
  "address": "410 Severn Ave #100, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3b5dcec-932d-11ea-8862-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16786469621402143376",
  "source": "GoogleMaps",
  "reviews": [
   "From the friendly welcome by the host and the great personality of our server. Staff gets 5 plus stars. The food, especially the mussels were DE-licious! I consider this a special occasion restaurant. Excellent food. Excellent views. Excellent service! You pay for it and it's worth it.",
   "What a lovely experience! We enjoyed a beautiful evening dining out on the terrace in celebration of our nephew’s graduation from the Naval Academy. The service for our large group was amazing, our food was exquisitely prepared and pretty as a picture. I do recommend the Rockfish...Outstanding!!! The beauty of the sun setting over the harbor was the icing on the cake. Such a picturesque location. We look forward to our next visit to MD and Carrol’s Creek Cafe tops our list on the area’s fine dining. Great atmosphere and ambience.",
   "Great food with a great view!  We enjoyed a lovely lunch on the deck. Our boys loved the grilled cheese and waffles. We all enjoyed some of the best fried calamari we've had. The fish tacos were delicious. The service was good. We would definitely eat there again.",
   "I highly recommend Carrol's Creek Cafe - the service and food were great. All the seafood was so fresh! The phyllo wrapped scallops were so fresh, plump, and juicy and the Maryland cream of crab soup was so well seasoned and creamy. Our waiter made sure we were never missing anything without being too overbearing.",
   "The cream of crab soup was fine, but I have had better elsewhere in Maryland, even at a diner. The fried calamari was decent but nothing special, nowhere near the worst or best I have had. The crab and artichoke dip was good. The real highlight were the scallops I ordered, which were very very good. They were soft, smooth, not at all chewy, seared very well, and simply delicious. Order the scallops."
  ]
 },
 {
  "name": "O'Learys Seafood Restaurant",
  "address": "310 3rd St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3f66980-932d-11ea-bdaa-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3862615473416365620",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoyed O'Learys Seafood. Amazing seafood appetizers and entrees as well as a few non seafood options. I decided to go with the tomahawk steak special and was very happy with my choice, my date got the red snapper and was equally pleased. Dessert and drinks were great as well. We are definitely excited to go back to O'Learys again and try more of their great meals. Personally one of my favorite restaurants in Annapolis after just one meal.",
   "Had a great prime rib!  And there was an unusual cocktail that I enjoyed very much.  Then we watched some boats bedecked in Christmas.lights pass by.  Very nice.",
   "Where to start!?  Amazing service, amazing food.  Not enough words to even describe how wonderful the food was.  Our ahi appetizer we so fresh and tender, and the flavors were so diverse! The red fin entree was cooked to perfection and was spectacular.  When you come ask for Denise, she will take exceptional care of you!",
   "Amazing food, amazing service, great atmosphere!  Will definitely go back.  I got a special for the night, Tomahawk steak... One of the most amazing meals I've ever had!  Duck fat potatoes just melt in your mouth!  And the beet salad was delicious! Everything was just perfect, food seasoned perfectly, oh, and the bread with garlic butter...I could have made a meal out of that! And our waitress was just a sweetheart!",
   "Celebrated my birthday here. Great food and service. Best restaurant that I have been to in years. Great special occasion place. We loved all our meals, especially the Shrimp and grits and Scallops with crab risotto."
  ]
 },
 {
  "name": "Lewnes' Steakhouse",
  "address": "401 Fourth St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c43e4930-932d-11ea-bb82-14b31f159f22.png",
  "tags": [
   "delicious",
   "history",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=904772297092533846",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful restaurant and steak was very tasty. Onion rings was okay - mushrooms was good and clams casino was also good. I wish the hostess was more friendly (smile) a little. After all it’s the experience you take home.",
   "The staff was fantastic and the steaks were tremendous. The rest of the menu though was seriously dated. Felt like the restaurant was stuck in the 80s. They could really use some life added to the sides, apps, and especially dessert. Cheesecake was good but nothing else but the cheesecake, no raspberry sauce or anything. Could use some jazz there too.",
   "Service: 5 star; ambience: 5 star; location: 5 star; food:\nWe had the fillet. If I could give it more than 5 stars, I would. Tender, flavorful, cooked exactly as I asked (medium rare +). It was everything you would expect for a top notch cut of beef!\nSauteed Mushrooms....it's mushrooms but they we're good: 5 stars. Oyster Rockefeller:5 stars. They cheese on top was so delicious! Garden salad: a bit too much olive oil but hey, I didn't complain. Olive oil is freaking delicious.\n\nThey have a cool wine room, the waiters scrape the crumbs off of the table (we aren't savages after all), and they took time to tell us about the aging process, the history of the restaurant, and was super dialed in to their job.\n\nGo here. It will cost a little bit but what are you saving that money for? Retirement? Don't be so short sighted!! Pony up a hundo and eat like royalty for an evening.",
   "Went here for dinner on Valentine's Day, the steaks were by far the best my girlfriend and I have ever had. Atmosphere was great, service was amazing and we left incredibly full and satisfied. Make sure you get dessert, the Key Lime pie is the real deal.",
   "Best restaurant in Annapolis, not just the best place for a steak. A lovely, relaxed atmosphere but not at all stuffy - you won't see a \"jackets required\" sign stopping you at the door. It's a 5 star restaurant with a friendly local feel. The cowboy ribeye is amazing and the mashed potatoes are to die for. This place is worth every penny."
  ]
 },
 {
  "name": "Preserve",
  "address": "164 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c48c9200-932d-11ea-bf05-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "nature",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2352439506497353864",
  "source": "GoogleMaps",
  "reviews": [
   "The food and ambiance was amazing! We went for brunch and had delicious drinks and even better food! I highly recommend the chocolate chip French toast!",
   "Grain of salt:  We went here for valentine's day so the special menu may have been better than usual.\n\nIn my opinion, however, this was one of the best meals I have had in...ever. I have been dying for a flavor departure like this for a very long time and Preserve delivered. \n\nService was great but billing was a little confusing due to the pay-ahead nature of their valentines menu. \n\nThe drinks left a lot to be desired but just go down the street for your buzz. \n\nCome here after and have a fantastic experience.",
   "We came from DC to see Annapolis for the day and had a fantastic lunch at Preserve. Couldn't stop eating the house made chicken liver pate, and I loved the smoked catfish on my salad. My husbands banh mi was also great. Really enjoyed all the pickled vegetables. Worth the drive from DC, we'll be back for dinner and dessert sometime",
   "Weekend getaway with the husband and got to check out this gem on a Friday evening. Such a cute spot and great food. Oysters are a must try and also the brisket was so on point.",
   "We’ve made this one of our new favorites when visiting our daughter in Annapolis. Flavorful and creative food. The Kale salad is to die for. We usually order two, because one isn’t enough. Small and cosy atmosphere with a very attentive staff. Kitchen is open view and those guys are hustling behind it."
  ]
 },
 {
  "name": "Iron Rooster",
  "address": "12 Market Space, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c4d4bfc2-932d-11ea-924e-14b31f159f22.png",
  "tags": [
   "unique",
   "sampling",
   "kids",
   "drink",
   "eat",
   "food",
   "food",
   "historic",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=498087696427514730",
  "source": "GoogleMaps",
  "reviews": [
   "I have been here with one of my dear friends several times - and every time I thoroughly enjoy dining here. From the freshly baked Rooster Tarts to the unique items on the breakfast menu, I enjoy trying sampling their flavors. It's a great atmosphere for all ages - we brought a one year old with us. They have a great kids menu that even includes a mini rooster tart. They also have an authentically cheerful wait staff. I highly recommend dining here.",
   "The Iron Rooster is fantastic.  It's everything you want in a place to eat and drink with a casual bar type setting.  I had brunch there and it was great.  The bloody Mary was amazing and the crab cake bene was outstanding.  You definitely get your money's worth here for portion size and quality of food.  I highly recommend.  Excellent.",
   "Previously dining at iron rooster, I have had nothing but great Experiences. Unfortunately after ordering carry out today, I will no longer be giving them my service due my food being extremely cold. I was able to order online and get to the restaurant at the exact order time and even saw the employee get the food directly from the kitchen. However, when I got home (which was only a 7 min drive) the food was ice cold and even seemed as though it was never heated through from frozen? Also after ordering on the restaurant website they managed to charge me 8 dollars more than the receipt which included a generous tip. Very disappointed!",
   "Located in the old historic area of Annapolis directly on the harbor, the Iron Roster surprises the palate. Known for serving breakfast all day, they also serve a wide variety of comfort foods made from scratch for lunch and dinner. If you're in the Annapolis area and have the time, it's a place you'll definitely want to visit. They offer seating on the first and second level so reservations are not necessary. Casual attire is acceptable.",
   "Quaint restaurant in the heart of Annapolis. Delicious food, fast service with helpful wait staff. Burger with waffle bun was surprisingly very tasty! Would get 5 stars but upstairs windows were a little drafty on the cold night I visited. Otherwise, if you're not seated near the window on a cold and windy day or evening, it's great!"
  ]
 },
 {
  "name": "Vin 909 Winecafe",
  "address": "909 Bay Ridge Ave, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5206cae-932d-11ea-b0e1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1998811466744132616",
  "source": "GoogleMaps",
  "reviews": [
   "Vin 909 was good but not nearly worth all the hype to me. The food was good, not great, and we waited ~2hrs for a table. It definitely will not be my choice but I would go back if invited. We met friends there and we had a great time with them, but we would've had a great time anywhere. We had wine (of course) and shared a couple of pizza and some sides.",
   "Really loved this place. Had a wonderful evening trying several different wines from their wine list, and their food offerings, all at a reasonable price. The pizza and sliders were awesome, however the cheese plate was slightly too small. Overall I’d definitely come back here.",
   "Had lunch here today. Oh my goodness, so so good. Service was great too. Even met a nice couple whose home land is Amsterdam. Perfect place. be prepared to wait when busy as no reservations allowed. Worth the wait",
   "Love their margherita pizza! The chocolate pot we creme was to die for. However, the kale in the kale salad should have been chopped and the stems removed. As it was, it was a little hard to eat. We were seated outside in enclosed heated area. Unfortunately, the noise level was pretty high.",
   "This is my absolute favorite spot for dinner in Annapolis. I tell everyone who visits to eat here. \n\nDo not be deterred by the wait-time. Get a drink at the bar and settle in for a nice long evening of the best food in town. And if you don’t have time to wait, get there a little before 5:30 to wait in a line that forms down the steps. I’ve done this several times. Worth it. \n\nI literally have not eaten one thing here I didn’t like. Parts of the menu change seasonally. Last summer the cold crab cake was the best thing I’ve ever eaten anywhere. The winter squash pizza was a win with my mom and best friend. The Cast Iron Skirt Steak and the Spotted Pig pizza is another personal fave. \n\nDrink selection is also great! Wine and beer are top-notch and listed for a range of prices. \n\nTheir dessert is impeccable. I recommend the chocolate pot de creme. And if you order coffee with it, it comes brewed in a french press. \n\nOn top of it all, service has always been kind, chatty, and helpful. \n\nVin 909 will also always have a special place in my heart because I first ate their with my late father. We shared a winter mussel soup."
  ]
 },
 {
  "name": "Osteria 177",
  "address": "177 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c569abfa-932d-11ea-a891-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "delicious",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15934738407868807614",
  "source": "GoogleMaps",
  "reviews": [
   "Without a doubt the best restaurant in Annapolis. The owner and chef has fresh seafood delivered daily and turns them into the most amazing dishes. The veal chop and Kobe carpaccio are also outstanding. Last but not least, you'll be treated like family.",
   "Everything that we had was delicious.  My Chilean sea bass was the best dish I ever ate.  Perfectly cooked!  Before I had this delicious dish I started with oysters Rockefeller (called something different on the menu).  Every bite was a culinary delight.  To finish my meal the tiramisu  just put it over the top.  I definitely recommend this place as you will not be disappointed.",
   "We visited Annapolis, MD over the Thanksgiving weekend 2019. We stayed at the Marriott nearby and made reservations based on reviews from Trip Advisor. The best part was it was within walking distance. Our reservation was immediately recognized upon arriving, and we were seated in the intimate cozy dining room. \nThe service was outstanding, and the food was delicious. A great place to celebrate Thanksgiving while away from home and traveling. Highly recommended.",
   "Food was decent. Dessert was pretty good too. Its nice not having to cook, but I feel like I can cook a better fillet and dessert for a fraction of the price.",
   "At the first moment  you step in that restaurant  the waiters give you an enjoyable feeling. Very warm stuff, it is a lovely restaurant to  pass time with buddies or with your date. very good  cooking, skillful  chief cook and stuff, decent  pay and nice  service. Warmly recommended."
  ]
 },
 {
  "name": "Carpaccio Tuscan Kitchen",
  "address": "1 Park Pl, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5b9c936-932d-11ea-bf81-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7418026207522024788",
  "source": "GoogleMaps",
  "reviews": [
   "Carpaccio’s has the best Italian hands down! The dishes are so beautiful and equally delicious! The staff is very friendly and accommodating! Definitely one of our favorite restaurants in Annapolis!!!! These pictures barely do them justice! Such a great experience every time we go!",
   "Love the pizza at this location so much that I went back the next day. This is red and yellow tomato with Feta cheese. The second day I had a vegetable slice with tomatoes, broccoli and feta cheese. Best pizza, so far, in Annapolis!! Thank you Ray for making both of my visits a Pizza-riffic great time!!",
   "Went here for a birthday celebration and had a great time. The food was excellent and good portion. The service was excellent as well. I highly recommend this restaurant.",
   "If you love grilled calamari, this is your spot. Had a seafood polenta dish, and the seafood was melt in your mouth. It's not cheap, but the food is yummy. They made me a real old fashioned! Gotta love the bartender too!",
   "Ate here recently. Although it was a really long drive for me to get there, it turned out to be a good experience. The place has an outdoor setting with an exquisite view that oversees an incredible statue fountain ⛲. Furthermore the waitress there was incredible. The food was good as was the drinks."
  ]
 },
 {
  "name": "Galway Bay Irish Restaurant and Pub",
  "address": "63 Maryland Ave, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6030892-932d-11ea-93d1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11535143367518200272",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoyed the atmosphere and food. Great service as well.  The Gin Violet was quite delicious. Went with the waitress' recommendation and she was on point.  The dessert was extra special too. The pub reminded me of being in Dublin. Great memories and can't wait to go back and try something else off the menu.",
   "Really liked this place. Only complaint was that we drove 90 minutes to hear Irish music and didn't. The guy was Irish, and was super talented and very friendly. But I specifically asked the guy if it was going to be Irish music and the answer was yes. Asked a second time and mentioned how far we were driving and wanted to be sure and was told yes again. So great place.  Great server. Perfect Guinness pour. But we drove an hour and a half for Irish music and were hugely disappointed.",
   "Such a cute place! And the food was amazing! We started with the smashed peas small plate and avocado small plate, both were delicious. I had the Tuna Steak which came with smashed avocado and a small salad and my wife had crab cakes. So good!",
   "From the moment I walked into the pub, I felt welcomed. The pub staff was amazing and introduced me to the locals seated at the bar. Great food. Great beer selection and wow, what a whiskey list! I strongly recommend this place. It is welcoming and warm. Also doesn’t hurt that it’s where the locals go for a quiet few pints!",
   "Galway is like a home away from home. All of the servers are so delightful! I went in for the first time and was treated so well (and the drinks were great!), I returned a week later and the bartenders remembered my name and order! Now that’s love! I will be there regularly for the foreseeable future."
  ]
 },
 {
  "name": "DRY 85",
  "address": "193 B Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c64cede8-932d-11ea-97ae-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "delicious",
   "food",
   "knowledgeable",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=9481914232930538843",
  "source": "GoogleMaps",
  "reviews": [
   "Cool place. Great food, alcohol selection and very friendly employees. Highly recommend. The bacon wrapped scallops were amazing.",
   "My husband and I enjoy this place since we are whiskey drinkers. One of the spots we frequent more often than other places in downtown Annapolis. Menu isn't huge but decent options for our tastes. Dark ambiance and gets very loud with a big crowd. Bartenders are friendly and fairly attentive, and there are a variety of cocktails on the menu. Beer selection is not huge.",
   "My burger was very well prepared. the salmon salad seems to be as well.  Service was very prompt, responsive, friendly and engaged. The decor is excellent, very well designed and aesthetically deliberate. It goes very well with the surrounding town atmosphere. Located in Annapolis this give you options to walk around and take in the city. The prices are reasonable but not a particular bargain. I do reccomend!\n\nTraveler and Adventurer - IG @brian.dent",
   "They have a great and tasty variety of beers here that always make for a fun visit. The food is delicious and there is a broad selection to choose from. The fried pickles are a special favorite and we get them every time!\n\nI highly recommend visiting and trying a little bit of everything!",
   "Flight if bourbon is so affordable and the selection is great as well. All if the bartenders were very knowledgeable and extremely helpful and friendly. Would recommend this place to anyone who loves bourbon."
  ]
 },
 {
  "name": "Café Normandie",
  "address": "185 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6a2d7be-932d-11ea-8f12-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1087532568741472332",
  "source": "GoogleMaps",
  "reviews": [
   "I went to this restaurant during restaurant week in Annapolis and at a Meet up event. I had never been here before. The restaurant staff from the hostesses to waiter were very friendly and attentive.  The food and drink were excellent. I had a Normandie fizz with rhubarb ginger liqueur that was very tasty. The roast duck in raspberry raise was excellent. I would definitely eat here again.",
   "Loved the mussels on half clam. one of the best mussels dish I've had. I loved the crispy, crunchy baguette that accompanied the dish.  Used it to sop up all that amazing  garlic sauce. Also loved the duck and Veal dish. \nService was outstanding and the ambiance was great.  Will be looking forward to my next visit here",
   "Me, my husband, and three friends went here during Restaurant Week for their lunch menu. We were seated right away and the waitress was very kind about a few other guests who were running a little behind and got who was there set up with drinks. Lunch menu portions were fair and left me full without feeling stuffed. I really loved the table we had, it was tucked away and right by the fireplace. The decor was really cute and cozy. I would definitely go back again.",
   "Everything is so fresh and carefully made. Excellent staff and the owners are the sweetest people ever. Definitely a must go to for delicious steak or seafood. Nothing generic about this place.",
   "This exquisite find in Annapolis is a must visit! Besides appropriately priced menu items, the variety of food is ideal for some familiar and eclectic tastes. So whether it be a BLT (with avocado and shoestring fries), soup (lamb and black bean), or snail that you're craving, this spot has something for you and your group. It's date and family friendly (choose a good time). And tip well (the service and ambiance are outstanding!) Brunch items are a great deal and the crepes are worth it! I chose a prefix three meal course for $18!"
  ]
 },
 {
  "name": "Level a small plates lounge",
  "address": "69 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6f14734-932d-11ea-9181-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16685317950124518800",
  "source": "GoogleMaps",
  "reviews": [
   "We attended the Pride event, I think in February, at Level and everything was wonderful.  Nathan was a great and attentive bartender. I'm celiac so I was delighted that 3 items off their menu tested okay! The warm mushroom salad, seared sea scallops and cheesecake was amazing! Chef Ryan came out to talk to me and was amazing! Level has excellent food! Thank you",
   "Korean beef lettuce wraps are tough.  The atmosphere is okay; the lighting is too bright for a tapas restaurant.  Not quaint or romantic at all.  Service was good.  The cauliflower was yummy.",
   "This is my favorite restaurant in Annapolis!  The menu is always top notch and they change it up often keeping me coming back to see what’s new.  Their drinks are AMAZING too.  Service is friendly and sincere.  Great spot for date night and I’ve also had large family events there.  I could go on and on.  You won’t be disappointed!",
   "If you like the slightly dark, exposed brick, mixed mediums type vibe- Level is your type of environment! Their cocktails & small plates are great too! Although they never give enough pita bread with their Tour of the Mediterranean.  Love you Level! Just letting folks know they'll have to order a side of extra pita... while you're at it order an extra gimlet too!",
   "Level in Annapolis on West St, highly recommend it. Level is the rare experience where everything is good, the food, the service,  the ambiance. \n\nOur server listened to our likes and made confident suggestions that resulted in a better dining experience. I would recommend ordering in stages and not all plates at one time as to feel your way through the meal. Seems the bar selections are A+ but we are not drinkers.\n\nHigh marks for the ricotta gnocchi, nearly asked for a second plate but truly there was more to try. Not the type to sit there and take food photos but presentation was great. Have photos of interior and outside."
  ]
 },
 {
  "name": "Paul's Homewood Café",
  "address": "919 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7625a86-932d-11ea-ab9a-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "knowledgeable",
   "family",
   "comforting",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12129009834298086872",
  "source": "GoogleMaps",
  "reviews": [
   "Came here for a Saturday evening dinner with my husband. My favorite part about this place is that it is away from all the other restaurants and has its own parking. Has a small bar. Greeted warmly and seated right away. Private party upstairs and about half the tables filled when we sat down, yet not as loud as a lot of others have stated in their reviews. Very friendly and attentive waiter but could do better with his personal appearance. Menu had food stains. Food wise, it was a refreshing change from the typical Annapolis fare. Dolmas and spanakopita were good. Lamb shank was a bit dry but flavor good. My husband said his seafood platter was good, not great. Presentation of the food could vastly improve (see pics). I would eat here again to try the other Greek dishes. It was not as impressive as I've heard personally from friends, but maybe our general dining experiences differ.",
   "My family and I had dinner here last night and it was all-around GREAT! We had Mediterranean chicken, the whole sea bass special, chicken parmigiana, and crab cakes and they were all delicious! The restaurant was very clean, cozy, and comfortable and the staff were very friendly and knowledgeable. My wife has dietary restrictions (gluten) and they were easily able to accommodate. We'll be back someday soon!",
   "My girlfriend and I love Paul's. It's such a cozy atmosphere just outside the hustle and bustle of downtown. The food and service are comforting. We first went in early February 2020 and went again this evening. We'll continue to enjoy this little gem. We may make this a monthly indulgence.",
   "I had the pleasure of eating in this wonderful establishment twice in one week. Once for lunch which was my very first time eating in Paul's Homewood Cafe and then for dinner a few days later. Each meal was fabulous. The food was absolutely delicious. The choices were wonderful and the service was great.  I am new to the Annapolis area coming orginally from New York. I am familiar with great restaurants and Paul's Homewood Cafe is definitely on my list of favorite places to eat.",
   "Love this place. Best food. Best service. BEST desserts!! All home made. Try the Key Lime Pie and the Spanakopita. Out of this world!"
  ]
 },
 {
  "name": "Sin Fronteras Café",
  "address": "2129 Forest Dr, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7a705ec-932d-11ea-9d0b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "cheap",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4828473295148567650",
  "source": "GoogleMaps",
  "reviews": [
   "Decent place. Had nachos and enchiladas which were just ok.  But the servers were really friendly and courteous. Nice place for casual dining.",
   "Happy hour is from 11:30am-6pm, 7 days a week. Complementary chips and salsa are so fresh and crisp and DELICIOUS. I had the Baleada with chorizo and egg; the tortilla is so crisp and the filling so tasty! Chorizo was a bit salty but the avocado balances it out. I also tried the yuca and chicarron - SO crisp and delicious. I have been dreaming about this place all day and can't wait to go back!!",
   "Great off beaten path find.  Very well prepared and authentic food.  Great service.  Lots of great food choices.",
   "Authentic hole in the wall Mexican.\n\nThe servers were all very nice, and the owner walked around making sure everybody was happy, while telling stories and getting to know the customers. Very unique and personal experience.\n\nThe food was phenomenal, but a little pricey compared to what I've seen in other states. That being said, it seemed be be made with fresher ingredients, and wasn't as heavy.\n\nWell worth it if you're craving Mexican, but if you're looking for cheap food, I'd go get fast food or drive out of the area.",
   "By far the best Mexican in Annapolis. Try the ropa vieja, so authentic! And every single time we come here the owner makes an effort to come and talk to us. Feels like one of the last remaining local establishments in Annapolis."
  ]
 },
 {
  "name": "Miss Shirley's Cafe",
  "address": "1 Park Pl, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7ef0cee-932d-11ea-a73d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15069179031265165742",
  "source": "GoogleMaps",
  "reviews": [
   "It was our first visit to this Cafe and we loved it. For Restaurant Week Breakfast this past Sunday, we were treated so sweetly by Ronnie. His adorable smile and well mannered table presence was very appreciated. He asked about food allergies FIRST and then listened carefully as we ordered our meals. Ambiance was nice, everyone's food looked delicious and we were very pleased with our dishes. Will definitely come back again. It was a pleasure to have several of Miss Shirley's staff  ask us if everything was OK. Thank you for a first visit and a first Annapolis Restaurant Week kickoff.",
   "Great service and atmosphere. Server.and managers very attentive to customers. Food was exactly as ordered, hot and quick. A little pricey, but very good. Would recommend. An obvious local favorite as it was half full at 7:30!",
   "Went for Restaurant Week breakfast and it was packed! But I lucked out with a seat at the bar. The service was great!! The staff super friendly. I enjoyed my meal so much. And the drinks were yummy.",
   "Great food that lives up to the hype!\n\nThe Stuffed Coconut Cream French Toast is very good, a little rich, but good. I wouldn't recommend it as a meal, unless you're in the mood for something sweet.\n\nI highly recommend the Slammer Sandwich! That was the highlight by far.",
   "So many people suggested that I eat here and I'm glad I finally did. This is a great place to eat. Food was amazing. Atmosphere is wonderful. Server was very nice and helpful with her suggestions. Food didnt take long and was hot. Definitely recommend."
  ]
 },
 {
  "name": "Lemongrass",
  "address": "167 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c838e870-932d-11ea-9705-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "affordable",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7392419075866376235",
  "source": "GoogleMaps",
  "reviews": [
   "Lemongrass is legendary for Thai food in the Annapolis area, for good reason.  LG is actually the best Thai food I have had anywhere in America.  Keep up the awesome work guys!",
   "Great service affordable delicious food. I got a seafood dish and my boss got the curry with salmon in it  was so good I would highly recommend.",
   "Had a awesome experience in here with my friend. The food comes out rapidly and the customer service is just great. Prices are affordable.",
   "The Pad Pak was good but portions were small and it had giant tomato cubes in it, which was not in the description. The lettuce wraps were not good at all. I got the smallest Romane pieces, not even lettuce cups so I couldn't fit anything inside it. Overall I think it's more of a tourist trap place. Carlsons on west street is waaayyyyy better",
   "Had penang curry and chicken pad thai, for me they're little bit too sweet. And the changing table needs to be changed, it's too high, small and sliding."
  ]
 },
 {
  "name": "Jalapeños",
  "address": "85 Forest Plaza, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8850dfa-932d-11ea-89e2-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5943780753947855235",
  "source": "GoogleMaps",
  "reviews": [
   "The food does not seem as authentic as we've experienced in other places. The ambiance and look of the place is very nice and upscale. We went there for my husband's birthday this morning, and for three orders it was $51.",
   "Great selection of tapas and full meals. Cuban, Mexican, and Spanish dishes... Something for everyone. Service was friendly and efficient. Nice decor. And the mole' was amazing!",
   "I went to recently for a friend's birthday. The service was impeccable, they were accommodating to all of our request, and everybody had a wonderful time. The food is magnificent. You will not be disappointed if you stopped in.",
   "This is one of my favorite restaurants in the area. My grandma and I have made a tradition of visiting together. Get Gonzalo's shrimp in the appetizers. The broth is to die for. The black bean soup and steak sandwich is also a favorite of ours during lunch.",
   "A hidden gem in Annapolis! Love the cozy bar area! Great happy hour deals and strong margaritas.. just the way I like them!"
  ]
 },
 {
  "name": "Vida Taco Bar",
  "address": "200 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8d3a498-932d-11ea-b7d9-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "free",
   "food",
   "food",
   "music",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=17496768395038788018",
  "source": "GoogleMaps",
  "reviews": [
   "Everything was good with service and food for the most part.  The biggest issue was we had 6 people and they randomly bring out the tacos on one platter and don’t give you what you ordered. We asked the server to tell us what they brought out and he quickly told us and walked away saying it is family style. So apparently you can’t order your own taco and I never heard of a family style taco since they are small and hard to share....",
   "Nice little place on the Main Street of Annapolis. Great service, very tasty Margaritas. Food is good, but there is no free salsa, which is a first for me in Mexican restaurant.",
   "Great food, good service good atmosphere.  No wonder they are always pretty full. Each taco is pretty big and served a la carte, so you have a chance to try different flavors. 3 tacos and I was pretty full.",
   "The tacos are amazing!!!!  Margaritas are very nice as well. Great music and good vibe. Highly recommend",
   "The mezcal Paloma pitcher tasted great and the cinnamon salt rim on the glass was an excellent accompaniment!  Easily the highlight of the meal. However, we were charged $44 for the pitcher instead of the $40 listed price on the menu($11 for a single drink). The pitcher gives 4 drinks—if we knew ahead of time, we would have order 4 different drinks instead.\n\nThe cauliflower taco and Korean pork belly taco were the standouts. Both were highly flavorful and sauced well.  The cauliflower taco were lightly breaded and had good consistency throughout.   If you like heat, go for the Korean pork belly since it really packs a punch. The other 4 tacos and pico de gallo were not memorable. \n\nService was friendly. Give it a try for yourself and order the mezcal Paloma. Tacos were hit or miss seeing as we only liked 2 out of 6.  Make sure to double check your bill when you leave."
  ]
 },
 {
  "name": "Federal House",
  "address": "22 Market Space, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9203f5e-932d-11ea-8ccf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17055841628395934738",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious! Great pub food. My senior dad and I  went for lunch on a Monday. Dad got his favorite fried oysters and loved it. Fish and chips were also really good- light and crisp. I do wish they had a better handicap entrance. Besides myself with my dad walker, I saw a mom having a hard time with her two toddlers.",
   "Some food was good.\n1. fries were very good, crispy on the outside and tender on the inside, perfectly flavoured.\n2. Hubby ordered bison burger, that was very tasty and perfectly cooked.\n3. I ordered grilled salmon BLT which was very overcooked and did not have the skin on (though they told me it would be skin-on).\n4. Also tried cream of crab, not bad but nothing to write home about.\n\nTable and chair were sticky (I had a short dress on, my legs remained sticky for the rest of the evening), very loud, and bathroom was dirty and had broken glass on the floor.\n\nService was slow, but friendly enough. After finding out I didn't get skin for my salmon, they took the whole entree off the bill. So no complains there.",
   "Nice place, food was decent bar food fare. Bit expensive but depends on what you want. Many crab & fish options though ample beef choices too. The vegetarian sandwich was good and flavorful. Nice place to being friends for some food and drinks, next to the harbor.",
   "While I have mostly had good experiences here, the softshell crab sandwich was almost chewy, not light, airy, and crispy as it should be.  Others loved the burgers and salads they had.  Good beer selection.",
   "Good location. Great service. This is right in the heart of downtown Annapolis. As a healthy eater, I recommend the salmon salad. Lots of salad options and variations. Don't get the coffee, get tea. Go nextdoor for coffee. ☕"
  ]
 },
 {
  "name": "Sailor Oyster Bar",
  "address": "196 West St #2824, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c97e8dc2-932d-11ea-b32b-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "unique",
   "food",
   "creative",
   "food",
   "unique",
   "daring",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12677652698948938958",
  "source": "GoogleMaps",
  "reviews": [
   "We have lived in Annapolis for more than 10 years.  I can't believe it took us so long to try this place.  Loved it!    \nIn addition to the vast varieties of delicious oysters, they also have a full menu of unique offerings that you won't find anywhere else in town.\nThe service is incredible!  They are friendly, accommodating, and informative.  This may have been the best service we've ever had in Annapolis.\nDefinitely try the truffles for dessert, they may change your life!\nI will be returning soon and often!",
   "This unique restaurant is definitely worth spending your money at. The service here is very pleasant and enjoyable. The food is not filling and pricey but the environment/service will always make it worth while. We usually order about 3-4 dozens of oysters along with many other items. I’ve not had a bad experience with food or service here. The more to talk to the server/bartender, the better the experience will be!\n\nThe appetizers were very pricey for the quantity you get. The oysters on the happy pricing is well worth the try!",
   "This spot is perfect! In town on business and each member of their staff made us all feel right at home. The food was delicious...and I can't believe what they were able to produce in such a tiny space behind the bar. The drinks were creative and the space has a great vibe!",
   "Oh, its a fo real oyster bar and bar.  I love the decor, ambiance and feel of the old place.  The food is simply daring and fantastic.  I love the selection of fresh yummy oysters and great unique bar drinks.  I almost rubbed one off in the bathroom but was pressed for time.......visit and you will see what I'm talking about.  The staff is super duper too.",
   "Sailor Oyster Bar was the perfect spot to start up our day. love everything about it from service and food. We had the avocado toast  and white fish sandwich both item was tasty and delicious!!"
  ]
 },
 {
  "name": "Harry Browne's Restaurant",
  "address": "66 State Cir, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9c6bba4-932d-11ea-b108-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5630088784744912035",
  "source": "GoogleMaps",
  "reviews": [
   "Our dinner experience was fine. Our server was nice. The risotto was a bland but everything else was good.",
   "Our group of the Air Force Academy graduates met at Harry Browne’s in the upstairs dining room. The room is quiet and private. Many of the members showed up early to enjoy a cocktail in the bar. Service for the dinner was excellent as the staff had no problems with a large group. Food was excellent and the desert pastries were a hit.",
   "Old world charm mixed with new world flavors.  This restaurant is truly delicious and the bar is tasty too!  Be prepared to spend a few clam shells here but the food really is awesome.  They have lunch, brunch and dinner too.  The upstairs bar is great for date night with the wife, girlfriend or both if you desire.  If lucky, you can check out the wine cellar!🤫",
   "Outstanding in every way. The food was delightful, the service thoughtful, and the atmosphere quaint but elegant.",
   "Simply amazing. Excellent service from Mike...ask for him. The food is pricey and portions are a bit small, but very tasty. The edible flower is a great touch. I also got a free desert with candle for my bday. Made the night even more special! Will be back to see Mike!"
  ]
 },
 {
  "name": "Severn Inn",
  "address": "1993 Baltimore Annapolis Blvd, Annapolis, MD 21409, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca0e260c-932d-11ea-951e-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14176412039825108373",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent!  Five star dining at a reasonable price.  Tremendous food and great views of the waterfront and downtown Annapolis but with a more relaxed environment.\nAlways a dining delight! Everything on the menu is special and good.",
   "Nice restaurant but you definitely pay for the atmosphere of being on the water. I was there when it was cold out, but I'm sure it's great when the weather is nicer and you can sit outside. Parking is not good, so if you have the option to rideshare, definitely take advantage of that. Great selection of cocktails, specifically anything with tonic.",
   "Sunday brunch - excellent choices and quality (unlimited mimosas and bloody Mary's are included). Our young server was fabulous. As a bonus you get a spectacular view of the Severn River with the Naval Academy straight across.",
   "The Severn Inn is a beautiful, high-end restaurant that sits on the edge of the Severn river. We were here for Valentine's day 2020 while they were running a special 3-course menu for the occasion. Each course had a great selection of options, including non seafood options for those that don't enjoy seafood. Our meals we cooked perfectly and just the right amount of food to feel full and have room for dessert. Their drink menu is extensive with a great selection of wines by the bottle or glass as well as an extensive variety of whisk(e)ys. I would highly recommend this place for a nice night out.",
   "My favorite restaurant I come here often and Everytime the food and service is appears amazing. I have never had a bad experience and would recommend anyone to visit."
  ]
 },
 {
  "name": "Red Red Wine Bar",
  "address": "189 B Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca5fca14-932d-11ea-86c6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walk",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4646395033205944486",
  "source": "GoogleMaps",
  "reviews": [
   "I'm definitely returning. Their truffle cheese is housemade and it tastes just like the one I had in France. I hope they decide to sell it one day. The servers are knowledgeable and great at giving suggestions. The lamb was cooked to perfection. I can't wait to try all of the different flights",
   "We went here after lunch and a walk down Main street.  Friendly helpful staff and great selection of quality wines!  They have food but we did not eat here.  If you are on Main Street and want a good glass of wine then I recommend 👍. Maybe next time we get down town we will eat here.",
   "Great service and we were able to get a table on a busy Saturday night with no reservation. They do wine flights here which are a lot of fun! Cute ambiance inside as well.",
   "Awesome wine bar with an amazing crab dip. Tried several wines here and really enjoyed the time we spent there. I’d highly suggest checking it out if you’re in town visiting.",
   "The service and atmosphere is great. It's never so busy you have to yell to talk but not empty. The drinks were good and they didn't rush you out."
  ]
 },
 {
  "name": "Chart House",
  "address": "300 Second St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cab27f4a-932d-11ea-89ea-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "family",
   "food",
   "delicious",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2725079608658479267",
  "source": "GoogleMaps",
  "reviews": [
   "We love love love this place! Our server Mike was outstanding! He was attentive yet didn't over stay his welcome.  The food was very good, and they were also very helpful with providing me with many gluten free options.  Chart House will always have our business ❤ thank you for making our night special",
   "I was here with a group from my company.  My only compliant they can not control is the parking.  The view is amazing, the bar is serene, the wine list is great and the food is absolutley to notch.  I will be back with my family.",
   "This is good place  for romantic dinner or good brunch with family or friends. Here you can find pretty good steaks or very delicious seafood. You can order pretty good alcohol or non-alcoholic cocktails!",
   "Nice ambience, especially having a window viewing the water and the wait staff were attentive. However, the price of the food was ridiculous! Would I go back? Yes, if someone was paying for my meal and I would get the NY Strip instead of the salmon.",
   "Chart House is in a beautiful area by the water... went there when it was cold its probably gorgeous in the summer time..\n\nWe ordered crab dip for appetizers, it was good. it was very runny for crab dip and the bread was super hard.. wish it was a little softer..\n\nI ordered the salmon it was delicious and cooked just the way i like it.. My husband ordered the steak and said it was good.\n\nIt was our anniversary so we splurges and got dessert.. it was supposed to be 9 layers but it was 8.. haha who's counting? other than that it was a little dry for my liking. \n\nOverall good experience, beautiful ambiance would come back in the future to give it another try!"
  ]
 },
 {
  "name": "Pusser's Caribbean Grille - Annapolis Restaurants",
  "address": "80 Compromise St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb08de4a-932d-11ea-8ed3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5805790653357615903",
  "source": "GoogleMaps",
  "reviews": [
   "First the Painkiller was perfect for a hot late summer afternoon outside. We ordered Empanadas and a blackened chicken bowl off the lunch menu and both were exceptional. My date ordered the black bean soup and it was delicious. If you are in Annapolis this should be on your short list for a meal. And we had a great time boat and people watching.",
   "Awesome for salad and snacks. Great views. These are pics from window seating",
   "Beautiful outdoor seating! Good food and service 👍🏽👍🏽",
   "The Surf n Turf special was a great value at $20 with side salad and cheesecake included with the main course of lobster, petit filet mignon, baked potato, and aspargus. The lobster was excellent. The steak was a little tough and could have used more seasoning, but good. The asparagus, baked potato, & salad were very good. The cheesecake was delicious!",
   "Finest food, super nice staff, regularly good ambience. They charge fair prices and the food quality is excellent. I recommend this place."
  ]
 },
 {
  "name": "Eastport Kitchen",
  "address": "923 Chesapeake Ave, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb672cc8-932d-11ea-bd65-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "affordable",
   "delicious",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=3000640833264461193",
  "source": "GoogleMaps",
  "reviews": [
   "Very cute and intimate. Quality food and friendly service. Extremely reasonable prices. Dinner entree menu changes monthly and keeps it fun and interesting!",
   "I eat here as little as twice a month and as much as twice a week. I love their lunch menu. A particular favorite is the Southwest Turkey, which was also my dad’s favorite. Ask for extra chipotle mayo on the side. Always order with fries. \n\nThe breakfast and dinner menus are great too though! Breakfast bomb for lunch and... well, a Southwest Turkey again for dinner. \n\nIt’s affordable and quick, with great service. And at night they lower the lights and put tea lights on the tables for a touch of ambiance. \n\nThis is another place I dined for the first time with my dad. It will always have a special place in my heart for all the good meals and conversations we shared there. \n\nJust make sure to check the hours before heading over. And keep an eye out for the owner! He’s very nice. Hoping to be on a first name basis soon and be considered a regular.",
   "Great sandwich place! I love the carefree setup, you purchase at register and you can sit in at tables. Everything was fresh, we had the shrimp salad sandwich and the fried fish sandwich(called \"your my boy blue\", what a great have to the old-school movie) and Maryland crab soup. The soup was delicious, huge chunks of crab in it. The sandwiches were on the freshest bread and the fish was cooked to perfection. The shrimp salad wasn't as great, but overall the meal was solid. Lunch totaled $24 so I'm not mad. Would return.",
   "Love this place for its healthy and creative menu selections and for its excellent customer service.   A must stop when visiting from Delaware, which is quite frequent.   Highly recommend.",
   "Love this place. Gourmet yet very casual."
  ]
 },
 {
  "name": "Potato Valley Café",
  "address": "47 State Cir #100, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cbaac68c-932d-11ea-abfc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2405331829113782770",
  "source": "GoogleMaps",
  "reviews": [
   "Thumbs UP! A hundred years ago, when I was 23, I lived around the corner from Potato Valley - I have always loved it & every time I visit Maryland from Colorado, we drive an hour unnecessarily, just to have their incredible potatoes. No exaggeration. That good.  There’s so much terrible food in the world, stop those shenanigans & have a truly stellar potato instead.",
   "Great spuds! Good food and plenty of options, lots of variety for whatever you're looking for. Seating is limited so on busier days you might have a hard time getting a table and parking is challenging if you're not local. Quick & friendly service. Will definitely be back",
   "The Potatoes were very nice. The owners was nicer. Little Jewel in an old city. Was my first time there and she thoroughly explained all the options. I ordered the Steak and cheeeeese.",
   "The first time I had it, I ordered Vegetarian combo with Jalapeno, and it was massive. The ingredients were super fresh, and it was so good. This is my second time here, my boyfriends and I order the Texas and Cheddar? They were still amazing! Tons of food, super delicious, even the crest is so good. I have to mention that the owners, they are amazing people, friendly, nice, nice, nice!  We love this place!!!",
   "A baked potato restaurant? Amazing! This was an awesome quick meal. So fresh, so delicious. Great, friendly service."
  ]
 },
 {
  "name": "Soul",
  "address": "509 S Cherry Grove Ave, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc00142e-932d-11ea-acad-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17466333717778197487",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, quaint, low key restaurant with really great food. EVERYTHING we ordered was executed well!! For starters, you should definitely try the French fries or the cornbread. The jambalaya, blackened salmon and sweet potato gnocchi were really, really good as well! This restaurant won't disappoint, but remember, it is a small plate restaurant. The portions are okay, but will not be significant or as large as some people expect when dining out.",
   "The fried chicken was not that great. I could not even finish it as it tasted nastier to me the more I ate. The sauce was way too sweet for me. The shrimp and grits was okay, but seemed to be missing something. It was served on a small old-looking chipped plate and was running off the plate onto the table; that was a strange presentation. The garden salad was good, but over priced.",
   "Nice place, away from the hustle and bustle of the  Annapolis Mall area. Full bar and outdoor seating. Patrons should know all items are \"small plate\". \n\nSome dishes are better than others. The salmon, brussel sprouts, and cornbread are excellent.  The barbecue sauce on the Memphis Ribs is reminiscent of ketchup.",
   "nice to have southern comfort food done right",
   "Excellent down-home plates. Superb desert as well! The apple crisp was quite tasty."
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "2348 Solomons Island Rd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc4de762-932d-11ea-a347-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "family",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4685745420770018071",
  "source": "GoogleMaps",
  "reviews": [
   "AMAZING! We had a fantastic time and our server Mariah was wonderful! This was our first time at the melting pot and she was very patient with the girls, she explained everything to us and was very attentive. This is a great place to bring the family. We had a great experience and a fantastic time. The girls really enjoyed the chocolate fondue! The manager even came to the table to make sure everything was okay and I've never seen that before. I recommend a reservation. Plenty of parking. Clean restrooms. Really a great time, we'll be back!",
   "Awesome experience our waiter was great! The food was good. Bear in mind the food comes raw you have to cook it in the pot. The one thing I hated about the food was that they cut up the lobster tail into 4 pieces. If you love seafood like I do and you love to dunk the whole lobster tail into sauce you won't get that but its a minor thing. Other than that everything was great",
   "We were greeted as soon as we came in the door and had no wait. It's alot bigger on the inside, than it looks on the outside. The menu was a little confusing since it was our first time but the waitress explained everything so well. She was very patient with our questions and indecisiveness. The food was amazing and service was fantastic. I'm so happy we gave it a try and have decided 1 1/2 -2 hour drive is definitely worth the food and experience. Can't wait to try a different combination next time but that bacon cheddar cheese is going to be hard to beat.",
   "The very best dining experience, my family and I enjoy driving to dine in new restaurant atmospheres. This is one of the most enjoyable family experiences and a must return.  I would like to see this restaurant come to my area of Lewes, Delaware.",
   "This spot remains a favorite. For those unfamiliar with the venue, plan to a spend a good two hours, given the different courses, cooking times, etc. Plan to make reservations to guarantee a table -- especially on popular dates/holidays. Food is always wonderful, with attentive service (at the Annapolis location, our favorite server Linda is the best). Not a cheap meal, though. As long as you're willing to pay for a quality, intimate dining experience you should be pleased."
  ]
 },
 {
  "name": "Flamant",
  "address": "17 Annapolis St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc9c309c-932d-11ea-97b9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14112717282613705113",
  "source": "GoogleMaps",
  "reviews": [
   "Good ambience. The snacks and appetizers had great presentation,  looked like artwork. The restaurant apparently changes menus every 12 weeks. While it may be good for seasonal items, we did not get to order items we wanted based on older pictures we saw online. Food tastes okay, could be more flavorful,  considering the price tag. The pea shrimp came without any shrimp at all, so had to ask for it. Overall a decent experience.",
   "Flamant was an incredible experience. The food was innovative and delicious. The staff was very friendly and whole vibe of the restaurant was clean, modern and multi-faceted; trendy and sophisticated. We will definitely be eating here again the next time we visit Annapolis.",
   "Went for my birthday, everything was delicious but if you aren't into game like venison, quail, duck etc. Not a place for you. They even have a surprise for a birthday but they don't sing. And the decor was beautiful and warm.",
   "Had a great day-before-Valentines Day dinner there with my wife! Makayla and Austin were on top of their game for service and the food was amazing. For anyone who says Annapolis is bereft of fun and interesting food has never visited Flamant. The artichoke was off the charts. The crab rolls were so good my wife and I almost ordered more. Our main dish—the pheasant—was very tasty.",
   "This is a review from over 6 months ago that has been bothering me: This place was not good from the start. When we first arrived, the waitress did not greet us for at least 20 minutes. We then got greeted after we were a bit pushy. My husband and I kept asking for things and she would forget and not come back. We did not tip because of terrible service.\nThe next day, I received a phone call from\nthe owner or manager asking why i did not tip. She was super rude and it was borderline harassment even though I explained the situation. almost felt like she was bullying me. Professional owners/managers would offer compensation in some form, but not her.  She pressured and it was unacceptable. I was super uncomfortable and I will never return. Do not waste your money."
  ]
 },
 {
  "name": "Luna Blu Ristorante Italiano",
  "address": "36 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cce39c18-932d-11ea-8842-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "delicious",
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=14371574151072316366",
  "source": "GoogleMaps",
  "reviews": [
   "Luna Blu is just fabulous!  Really fun staff, great service.  Food is excellent! Wine selection is great.  There weekly specials are a deal.  The owner is the best.  You won’t believe it till you try it.",
   "Luna Blu is my go to experience for fine Italian dining in Annapolis. I am never disappointed; the food is always excellent, cocktails perfectly mixed, and service incredibly attentive.\nPut it on your short list to either eat in or take out!",
   "Food is consistently good, prepared as ordered and presented with good flare by always a great waitress or Erin herself. The wine list will not disappoint. The specials offered are always fresh and plenty of food with each serving. If you are lucky enough to get reservations for the monthly wine dinners, don't miss out !!",
   "My sister and I stumbled upon this quaint restaurant in Annapolis during the Chocolate Festival. Our food was delicious and came out hot. The staff were friendly and knowledgeable about the menu and tgeir recommendations were spot on. Will definitely visit again!",
   "Meals were quite good and the wine selection was excellent. It's a small place but the atmosphere was pretty much what you might expect. The service during meal was friendly and knowledgeable but a bit slow, especially when we waited to be seated even though the restaurant wasn't crowded. No one came by to check while we stood there for a while. The salad was a bit plain, nothing unique but the seafood dish and dessert were excellent. I also had to alert the staff that the bathroom was out of soap...Not that I used the last of it but it obviously had been already empty. So a few smaller things make me feel like 5 stars isn't warranted but still overall a delicious and enjoyable evening, I recommended you check it out."
  ]
 },
 {
  "name": "Main & Market",
  "address": "914 Bay Ridge Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd2a6a48-932d-11ea-ae27-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable",
   "tasting",
   "organized",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9620585145791521398",
  "source": "GoogleMaps",
  "reviews": [
   "We would definitely recommend Main and Market as we had a wonderful experience working with them.\n\nDebra was a pleasure to work with throughout the planning of our cocktail hour and reception. She was well organized, knowledgeable, and personable. She made us feel comfortable and at ease as we narrowed down our choices for the menu. There was no rush during our tasting and Debra was open to our ideas for modifications of certain items.\n\nDebra was very responsive in the months, weeks, and days leading up to our wedding. She did a great job when we did our on-site walkthrough of the property (and she brought desserts!), considering logistics we hadn’t thought of that would have made the day of the wedding more stressful if it wasn’t brought up.  \n\nThe food was absolutely delicious and the service was outstanding throughout the wedding. We received many compliments about the appetizers, buffet, and bourbon ice cream. The biggest hit may have been the warm buttermilk biscuits with honey butter (so good!). The catering staff were professional, friendly, and attentive to guest requests. Debra was also on-site to make sure everything ran smoothly.\n\nMain and Market contributed in a big way to making sure our wedding night exceeded our expectations. -Katie & Derek Event date: Sept, 14 2019",
   "Sweet potato fries were exceptionally good,  and vegetarian sausage was very tasty. The chickpea salad could be better. Overall good experience.",
   "I love everything on their menu with the exception of the chicken and waffles.  This is a great local eatery that offers a hometown feel with a global menu.  Staff is super friendly and the food is always delicious....except the chicken and waffles, they have an opportunity for improvemment.  Regardless, I give them 5 stars for the yummy food, great desserts and super service.  They even cater.",
   "I like that this place offers familiar dishes with a twist. The Main & Market Masterpiece is essentially a turkey and cheddar sandwich, but with panko-encrusted brioche bread and pepper jelly! It was super fun and delicious. They also have poutine, but with duck confit! The portions are generous, everything came out hot, and the service was good. The bakery case is very appealing as well, and now I've discovered their Derby pie which is DELICIOUS and now I'm dying to try to make it at home. I'm so glad I tried this place!",
   "Main and Market offers consistently fine fare. Their menu is diverse - something for everyone. Desserts are made in house. You won't be displeased with a visit to Main & Market."
  ]
 },
 {
  "name": "Boatyard Bar & Grill",
  "address": "400 Fourth St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd72155c-932d-11ea-af22-14b31f159f22.png",
  "tags": [
   "tour",
   "food",
   "delicious",
   "food",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=16353910710659417709",
  "source": "GoogleMaps",
  "reviews": [
   "As a local Maryland girl coming home from a long military overseas tour - this was the first restaurant I wanted to go to. I’ve been going to the Boatyard for years and they never disappoint. This restaurant really does seafood right. I would HIGHLY recommend: steamed shrimp, local oysters, and the crab cakes. Also, do yourself a favour and get a grapefruit (orange is pretty dang good as well) crush...or three. I’ll keep coming here for my fix of home.",
   "Got takeout during this rough time of social distancing/quarantining. Extremely tasty crab cakes (one is not pictured, meal comes with two), & mashed potatoes were amazing. Definitely gave me a better outlook on life. A little pricey but worth it.",
   "In my experience the Boatyard Bar & Grill offers the best crab cakes in the area.  I used to visit Timbuktu and the other notable crab cake places, but this is now my favorite.  It’s right near the water and the prices are reasonable.  Try the cream of crab soup too.  It’s superb.  Parking is limited with some in front, a few more in back, and beyond that it’s catch as catch can.  If you’re looking for good seafood and especially a good crab cake, this place can’t be beat.",
   "This place is great. Local fisherman bar atmosphere, huge menu, tasty food. Servers have been great. I get the steamer bag every time I go because it's awesome! The one time it was missing the mussels and they were so nice and took it off my bill. Great business, best in Annapolis for sure.",
   "We chose this locale, for an impromptu lunch before a sunny stroll through Annapolis. The food came out quickly and was found agreeable by our taste buds. We ordered the Crab Dip, a \"must-eat\", which is also considered the best in the area. My Cobb Salad was delicious and filling. My husband ordered a Burger who met his approval. Overall a solid performance, minus the Tortilla Chips, they tended more torwards bland and stale. Service was great, prompt and professional. We will most certainly stop by again, since we love a good Crab Dip."
  ]
 },
 {
  "name": "Paladar Latin Kitchen & Rum Bar",
  "address": "Towne Centre, 1905 Towne Centre Blvd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cdbadf9e-932d-11ea-90d5-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10206743879450021631",
  "source": "GoogleMaps",
  "reviews": [
   "This rum bar has a fantastic atmosphere. The food was great and the server was accommodating. I don't remember the servers name but he was supposed to bring me a sprite and the machine must have been out of syrup because he brought me carbonated water, when I let him know he asked if he could get me something else instead of going back and fixing the issue and getting what I asked for to begin with. Not an issue to take a star from the establishment, but this is a decent place to vent haha.",
   "Love the rum bar, they have a bible of rums from almost anywhere in the world. The food is great and the ambiance is amazing.  The managers do try and make sure you are taken care of if something goes awry In your visit",
   "Drinks and appetizers before dinner elsewhere. The hominy hummus was amazing! Guac was good, we added goat cheese and roasted garlic... didn't get much garlic.",
   "Although we ended up spending longer at the restaurant than planned, we enjoyed a lovely meal. My tacos were awesome and I greatly appreciated their ability to fulfill my small request to keep them mild. My husband loved his pork shank with rice. And we both loved the trio dessert. We did encounter a small hiccup with our meals, but the manager Justin was quick to fix the issue with amazing customer service.",
   "Taco Tuesday is amazing. Variety of tacos to choose from and $5 margaritas. They ask that you order a minimum of 3 tacos per person. Tacos are $3.50 each.\n\nWe had the Queso Fundido for a starter, which was really good. We will try it with chorizo next time, which will be a $2 upcharge.\n\nI had the chipotle ground beef, chorizo, and blackened fish tacos with a jalapeno Paloma.\n\nMy friend the blackened fish, crispy shrimp, and crispy chicken tacos."
  ]
 },
 {
  "name": "Metropolitan Kitchen & Lounge",
  "address": "175 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce00c38c-932d-11ea-a3e7-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5284062393917718176",
  "source": "GoogleMaps",
  "reviews": [
   "Good rockfish lettuce wraps, and the service was good and comfortable.",
   "Best fried chicken sandwich I’ve ever had! The drinks are amazing. The staff is so friendly! This was our first time here and I would come back a million more times! One of the best restaurant experiences I’ve ever had!",
   "Great bar/restaurant with a nice vibe and layout. Me and a friend got drinks and our waitress was super sweet. Even though we didn't order much food she was still attentive. Even when the restaurant lounge was closing for the evening she still gave us no rush and just let us chat. I didn't eat but my friend told me the food that she got was delicious. Will for sure be back when I am in the area again. The drink I did get was really well mixed. Check it out next time you are in Annapolis.",
   "Food has amazing depth of flavor.  Great selection on drinks and drafts too.  Restaurant week menu is great, portions also leave you stuffed.",
   "We had 3 different entrees between four of us. The salmon was really good, the chicken dish was also really good and the rock fish was as well. The sides that came with the dishes were excellent. The hor d'oeuvres of pokey and cauliflower and brussel sprouts were all delicious.  Really the only disappointing thing was the bread pudding...it was not good at all.  After 2 of us told them that it was terrible and we each only had one bite we really should have been offered something else but we were so full from the rest of the food it was fine.  The chocolate ganache cake was moist and tasty and the creme brullee was delicious.  The staff were nice and the place is really hip."
  ]
 },
 {
  "name": "Evelyn's",
  "address": "26 Annapolis St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce5155fa-932d-11ea-b008-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9227160701620738357",
  "source": "GoogleMaps",
  "reviews": [
   "We love Evelyns! My office is nearby and this is a lunch go to. The manager is amazing and everyone is awesome. Great fresh food for very reasonable prices.",
   "This was my first time here and I would definitely go back. We walked in at just the right time and were seated within a few minutes. The crowd waiting for tables did grow but the wait time did not appear to be excessive. There is not much room inside so those waiting for a table are kind of hovering. The food was delicious and our waitress was very good. We ordered the chicken and goat cheese panini, chorizo breakfast burrito, and pancakes.",
   "Food was great! 100% recommend the Monte cristo. \n\nExperience wasn't great: The host may have been new or something. I had my pup with me so my friend went in to ask for a seat outside. He told her we can eat inside and it would be 20 minutes. I was extremely surprised because my dog isn't a service dog... We waited 20 minutes. We were seated and the manager came to ask for my service animal paperwork.... I told him she's not a service animal and that we had first asked for a seat outside but been told we could sit inside. He apologized and we moved outside. But the entire cafe saw this whole thing. It's a very small restaurant so they could see and hear it all. We were very embarrassed. Plus we has waited 20 minutes when we could have been seated right away if they listened to our request to be seated outside. It was just an unfortunate situation. The food was great and the staff was friendly during the encounter.",
   "We decided to take a quick breakfast outing for the holiday and this place was fabulous. Truth in reporting, we have been here a few times. They are always on point with your order and they are quick. The quality of the food is exceptional and the customer service is outstanding! The customer service is key here. They are always friendly and aim to make sure that you are satisfied. Great job to this local business!",
   "Sweet potato pancake was heavenly. Not too spice like some sweet potatoe dishes are. Ordered checked salad on rye and to my surprise it's on Marble Rye which is my favorite. Chips come with it and I added potatoe salad which is delicious so far. I love my carryout experience and will definitely be returning. My phone order taker/server was too cute!!"
  ]
 },
 {
  "name": "Mason's Famous Lobster Rolls",
  "address": "188 Main St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce990e94-932d-11ea-98a7-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14719624444026912629",
  "source": "GoogleMaps",
  "reviews": [
   "I came at lunch on a Tuesday around 1. There weren't many people in the restaurant, which was nice. I had the classic lobster roll and it was very good. I've had lobster rolls in Nantucket and this definitely competed with them. My roll had lots of lobster meat, the roll was fluffy and perfectly buttery. They don't overdress the lobster, which highlights it's deliciousness. I really like this Annapolis gem!",
   "The Lobster Roll was delicious! As was the clam chowder and lobster bisque. The shrimp salad was ok, I wasn't a fan of the sauce they used on the shrimp. The place was small but quaint and the location was easy to find.",
   "One of the best foods I had. Love the Lobster roll. Lobster tastes really delicious. The bun is also very soft and tasty. However, the portion size is a bit less. A little bit expensive. Compared with the taste, it worth the money. We have ordered two lobster rolls and a lobster salad. I prefer the Classic lobster roll than Connecticut lobster roll because the lobster in that is a bit warm and tasty. If you ever go to Annapolis, Mason's Famous Lobster Rolls is a must that you have.",
   "It's a comfortable little spot wasn't very busy when I went it is very small not set up for a large group to eat in however you could always order it as carryout maybe pick it up and take it to your get together if you will, but I can tell you it's very good reasonable prices for what you get in perspective and consideration too. But definitely a go-to spot if you're into Lobster and warm cozy Seafood soups. They have lobster bisque all the way to clam chowder and everything is very good very fresh and very tasty. Check it out you'll be glad you did.🤙👍💯",
   "This restaurant is pretty good for the food they have and the price! They don’t have that big of a menu, but the items that they do have, they do well! My dad got their classic lobster roll, which had a huge pile of lobster on a freshly toasted Texas toast piece of bread. He said it was delicious! Atmosphere is cute, and the service was really fast, but we were the only ones there at the moment, so not sure how the service would be if more people were there!"
  ]
 },
 {
  "name": "Blackwall Hitch",
  "address": "400 6th St, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cee02ae4-932d-11ea-b59f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "family",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12739162317527643575",
  "source": "GoogleMaps",
  "reviews": [
   "We were visiting the area for Independence Day weekend and decided to try Blackwall for dinner. We had an excellent server and they were very accommodating for our group of 11. We did make reservations. The restaurant has a very cool atmosphere and fits in really well with the neighborhood. The menu had a lot of great options and our entire group enjoyed their food! If we were here longer or if we come back to Annapolis I would definitely go back.",
   "Brunch was a nice spread with lots of delicious choices. Crowd was nice. Definitely get there early and make a reservation. Never felt rushed and the waitress kept out glasses full. Definitely try the fried chicken.",
   "Absolutely delicious and the service was awesome. Very friendly staff. Can't wait to go back!",
   "Me and my fiancée came here today for Valentine’s Day for our first time ever to the restaurant and let me just say it was a phenomenal and fantastic experience. We have dined in a multitude of restaurants all over the DMV area and this by far has to be the most fantastic restaurant we have dined in so far. The service was phenomenal, we dined on the outdoor patio area which they had covered and provided a heater for since it is so chilly outside at the moment. They decorated the entire area in valentines themed decor, had a fantastic ambience and mood to the area, the music was fantastic. The food was beyond fantastic. Me and my fiancée got 2 completely different meal sets from the valentines menu and we were left in an awe. The taste, texture, smell, and design of the food was beyond fantastic. We had Cameron as our server and he did a beyond fantastic job as all the servers did, today was most likely a ridiculously busy day for them and they all held up very forward and happy despite the multitudes of people they had run through the place all day. We got to meet Sid(might have misspelled) and we were able to portray our happiness and overall feeling for the restaurant. Definitely a restaurant worth checking out, will be recommending all our family and friends and will definitely be back! Thank you all for an amazing night we won’t be forgetting! 😃😄",
   "We really enjoy this place. The \"Massive Mary\" a top shelf tall Bloody Mary with spicy candied bacon, shrimp, crabmeat sandwich, pickles, celery, olives, lemon and lime slices and Old Bay rim was a meal in itself. The braised short rib is excellent."
  ]
 },
 {
  "name": "Chris's Charcoal Pit",
  "address": "1946 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf2f84e2-932d-11ea-8a37-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food",
   "food",
   "eat",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8643634243190698590",
  "source": "GoogleMaps",
  "reviews": [
   "If you are looking for real deal Greek cuisine in Annapolis - this is THE spot. \nFamily owned and operated - \nTheir specialty is their Gyro - which is awesome ... but everything else is great too. Try the baklava!\nThe staff is super friendly, attentive and accommodating \nThey offer done in and carry out",
   "I've been coming to Chris's since I was a kid in the 90s. It's got great food and great service! Get the athenian chicken or gyro platter, you cant go wrong. The pizzas are amazing, huge and delicious. The hot steak and cheese subs are also the best around. This place has seating inside for a group or you can get take out, I've done both and had great food either way.",
   "My wife has a classic gyro platter, I had the chicken gyro platter. Best gyros we have had in years. Very hard to find an authentic Greek restaurant with quality food. They nailed it!\nWe are making this restaurant part of our routine.",
   "So I've been craving a gyro for some time now but I live on the eastern shore of Maryland so I've not been able to satisfy that craving, many failed attempts however. \nToday however, thanks to Chris's I was able to satisfy that craving with a great Gyro. I think back to all the missed opportunities to eat here all the time I drove past and never considered stopping oh if i could just get that time back.  I can't wait to try other items off the menu now that I've found this place. \nThanks Chris and great customer service also. \nI attached a photo but...I ate it all before I remembered to take a pic.",
   "Awesome customer service!! Super friendly people!!!! Amazing food!!! Good place to go out and eat or carry out and eat Kid friendly definitely a family restaurant but could be an awesome date night too."
  ]
 },
 {
  "name": "Tsunami",
  "address": "51 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf84f968-932d-11ea-9c5d-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "food",
   "walking",
   "delicious",
   "drink",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=269741080057698165",
  "source": "GoogleMaps",
  "reviews": [
   "This is unquestionably one of the finest place to eat in the region. Whenever I come there I am extremely happy. They manage their very high  level service and the highest level of cooking  they offer. You surely will enjoy this this restaurant. Warmly  recommended.",
   "Solid sushi, Asian-influenced food, and cocktails! Tsunami also has great happy hour deals - $8 cocktails and half off sushi rolls I believe. This place is also in general walking distance of a lot of great spots in the downtown area, which makes it a great spot to eat and then hit the town afterwards. \n\nDownside is this place quickly fills up, making it hard to get a table. Come early or try to make a reservation! \n\n#tsunami #sushi #cocktails #Asianfood #misosoup",
   "Fantastic takeout experience. No contact, super fast. Quality of sushi still top notch. Staff super friendly.",
   "An awesome spot where all us industry folk love to come grab a drink and socialize. Can't go wrong with sushi at midnight and delicious cocktails. And always the best company.",
   "Best sushi I have had.  Happy hour is very affordable and the staff and attentive and work hard.  We went out with a friend for his birthday and it was excellent."
  ]
 },
 {
  "name": "Basmati Indian Restaurant",
  "address": "2444 Solomons Island Rd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cfcc2250-932d-11ea-9b18-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18050597961018202845",
  "source": "GoogleMaps",
  "reviews": [
   "My favorite restaurant! The food is delicious, so amazing! Super healthy and full of Ayurvedic herbs as well!!! I’m vegan and always have lots to eat. The staff are so sweet. I love everyone that works there. Basmati is the best 😊😊😊 been going since they opened, and love them so much.",
   "My first Indian restaurant experience. The food was absolutely amazing and the service was great. My favorite was the butter chicken.",
   "Yesterday was the first time we visited this magnificent restaurant. But It is absolutely not the last. We passed a splendid evening with the attentive service, with the superb  meal and booze and with the friendly payment. We will definitely come back in a short time.",
   "This spot is the one I like best. I go to many restaurants but here I  constantly return again and again. The team is very warm and the food they serve is so delicious. I never decline to have a decent meal in this place. I recommend this place with pleasure.",
   "Good price......and very good Indian cuisine with just the right amount of heat.  Staff was very attentive, unusual for a buffet.  If you like something different for a lunch outing, definitely try Basmati..."
  ]
 },
 {
  "name": "Light House Bistro",
  "address": "202 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d013b400-932d-11ea-ab0b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11667637237528143318",
  "source": "GoogleMaps",
  "reviews": [
   "I saw the Light House Bistro on the map and was intrigued by their story so I decided to try them for dinner.  I was not disappointed.   I tried one of their specialty cocktails and selected the shrimp pappardelle as an entree.  It was served piping hot with four jumbo shrimp and pappardelle pasta in a cream sauce that included bacon.  It was very filling.   For dessert I picked the caramel apple tart with vanilla ice cream.  It's not a conventional apple tart that you might think of.  If was more like a deconstructed tart, in my opinion, but it was still tasty.  The pastry was light and flaky and the apples where thinly shaved in a caramel sauce.  Overall I give five stars for the Light House Bistro and recommend them for dinner.",
   "We came here to celebrate my birthday this year. Everyone really liked their food and the guy serving our table was extremely personable and patient. He provided quick service and checked on us often. I ordered a filet of halibut and the seat on it was fantastic. We will be back.",
   "Amazing! The food here is delicious! I had the Breakfast Nachos for brunch...yummy! Great serving sizes. The service was fantastic. We will be coming back soon!\n\nI am editing my review. I went here on 2/16/20 and today, 2/18/20 I see that the waitress charged my credit card twice. I called and left a message for the manager...we will see if anything is resolved!",
   "Outstanding food, Service, atmosphere! After spending many years overseas and now back in the Annapolis area, this was 1 of 2 outstanding restaurants at which we have eaten. Thank you! excellent!",
   "What a fantastic place! Great food, greater service! So wonderful to be able to help folks get back on their feet and enjoy a delicious meal at the same time."
  ]
 },
 {
  "name": "Wild Country Seafood",
  "address": "124 Bay Shore Ave, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0633a1e-932d-11ea-b2d6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6894281722968468243",
  "source": "GoogleMaps",
  "reviews": [
   "I often take my friends to this restaurant with my highest recommendations. I go their often. I get very good feedback from my friends. The dishes they serve are yummy and the crew is attentive and cooperative. Every time  we go to this place we have a pleasant time.  highly recommended.",
   "Loved it! Food was so delicious, loved sitting at the picnic tables on a sunny day. Great hush puppies.",
   "Wife was very happy with her soft shelled crab. My rockfish was good. Service is not fast but didn't worry us because the seafood is fresh! Everything clearly cooked after we ordered it. 5 or 6 outside picnic benches, plus 3-4 bar stools inside.",
   "Delicious crab, quaint accomodations, friendly people. A real local feel in the heart of Annapolis (east)!",
   "THE freshest local seafood in town. Limited seating and all outside."
  ]
 },
 {
  "name": "Gordon Biersch Brewery Restaurant",
  "address": "1906 Towne Centre Blvd #155, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0b72822-932d-11ea-911b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16139838732016299904",
  "source": "GoogleMaps",
  "reviews": [
   "Gordon Biersch is a safe choice in a world of inconsistent dining experienced. Trust that, here  your beer will always be served to you cold and in a glass.....\nTrust that your entree will be flavorful and cooked to order...\nTrust that your dessert will be able to serve 2 and will worth the extra 2000 calories....\nThis location officers a variety of seating options from outdoor, booth, high chair table, and bar chair.\nYou will feel welcome, satisfied, and safe,.....and if you are lucky....maybe your waiter will take a step beyond and make you feel like a valued community member and not just a patron...",
   "Fantastic place, Great Staff, Great BEER, Great Food!  Also a great VALUE-- you get a LOT for your $$, especially during Happy Hour [2-7pm M-F]!  Kid-friendly (yes, they have high-chairs), and they have an amazing way to satisfy sports-fans (watching games in the Bar area) without ruining the dining experience for those in the Dining area!",
   "I ordered via one of the food delivery services and was mildly pleased about the salad I received. In the food delivery service's app, the salad name is listed as Gorgonzola Pear Salad. It also contains crusted checked that was more plentiful than the pear that is featured in the title. The dressing was very fitting but the lack of pear can be seen in the attached photo. Would order again but I'll make sure that I ask if more pear is an option.",
   "Love their shrimp tacos! Upgraded to delicious sweet potato fries. \nBbq burger and black & blue were cooked perfectly. Garlic fries are made with fresh garlic and it shows. Beer selections are always great.",
   "Great beer, food, and service.\n\nI recommend the Marzen beer and chicken schnitzel. The salmon is good also.\n\nThey sell growlers that you may have filled for consumption at home. I recommend this if you're super hungry and looking for a fresh, heavy dinner out with friends."
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "301 Severn Ave, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0fbb80a-932d-11ea-ae9e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8620081329672499932",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I went here for the first time tonight. We decided to treat ourselves and try somewhere different. The food was amazing. The lobster mac and cheese was our favorite part, the spicy shrimp appetizer was also a hit! The steak was great, of course. The drinks were good and the dessert just really finished off a great meal. I can't remember our waiter's name, but he was very friendly and knowledgeable. His recommendations did not disappoint.",
   "Really enjoyed our dining experience this evening. The service and food were great as I expect from Ruth's Chris. The dining area is up a flight of stairs so it was a bit of a challenge with my new left knee and bum right hip. They do have dining on the ground level but you have to request it. Who knew? The hostess was professional but she could be a bit more engaging and personable. I like the complimentary valet parking. Just tip the valet when he brings your car. All in all an enjoyable experience.",
   "Ronnie was a good server. Great smile and pours a Guinness(and wine) well.  Ambiance was wonderful. But my husband's steak was very overdone and they didn't have the wine in stock that we had selected. Our server did a great job handling both issues, but I do expect better from a Ruth's Chris.",
   "Stephanie & Jeff were the absolute best service while at Ruth Chris. They made sure everything was absolutely perfect for us. The food was AMAZING! And the sweet Potato casserole was our favorite thing on the menu!! We will definitely be back. Thank you so much Stephanie and Jeff!!! You guys are the BEST!!",
   "This was our first time at this location and it was well worth the money. Everything was cooked perfectly and our waiter was outstanding.  From the appetizers to the desserts, I highly recommend this place when you are looking for a great dinner."
  ]
 },
 {
  "name": "Middleton Tavern",
  "address": "2 Market Space, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1419c10-932d-11ea-b896-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "historic",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1802558080074471188",
  "source": "GoogleMaps",
  "reviews": [
   "I had two appetizers, crab ball slider, two the size of meatballs, taste was typical and good, but much smaller than slider bun. But for $5, it's what you get.  Also tasted the oyster shooters, came with double shot of beer.  They were huge and tasty.  I will come back and try something else",
   "We sat on the outside eating mussels on a nice sunny day and it was wonderful. We had the mussel appetizer and it was a huge plate of mussels for just $12 and they were delicious. I also had the smoked brisket sandwich for $12 and it was delicious. I would highly recommend eating here! Prices and food were great, outdoor venue was excellent.",
   "Very popular brunch place right next to the water. The food is really good. We got the french toast filled with creme cheese and covered in fruits. Coffee is not that good, but it's unlimited refills. Sit down outside for the beat experience. Average brunch price is $35 for two\n.",
   "Famous dish here is mussels (very Irish dish), a place with long history in a historic building",
   "The food was okay The service was good and the price was high. You have to take in consideration you're on the water and you're in a tourist area and this is a tourist type of restaurant. I would recommend it for first timer I don't know if I would make it a regular state of affairs but I definitely enjoyed my first time and I will say they tried their best."
  ]
 },
 {
  "name": "Nano Asian Dining",
  "address": "189 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d18ab42e-932d-11ea-92e7-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14278595051524680391",
  "source": "GoogleMaps",
  "reviews": [
   "We had 4 kinds of sushi. Teriyaki chicken, shrimp and veggies tempura for dinner. Everything tasted great. Tempura is very light and crispy. Staffs are super friendly. Very clean place.",
   "This restaurant is my preferred one. I eat in plenty of restaurants but here I go the most. The team is very friendly and the cooking they place on your table is so good. I would always prefer to have a decent dinner here. I recommend this place with pleasure.",
   "Being vegan, lots of great menu choices from rolls to tofu wraps to tempura. Loved every bite!",
   "We love eating here! My girlfriend and I eat at Nano once a week. Ling and the rest of the staff are excellent. The food is hot and fresh. Price is right also.",
   "Lunch was great. However I was more impressed by very clean windows... Seriously :) since we were sitting at the bar spot next to it we could truly enjoy the view :)"
  ]
 },
 {
  "name": "Reynolds Tavern and 1747 Pub",
  "address": "7 Church Cir, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1d1d09c-932d-11ea-b6fd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "historic",
   "food",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12940199655176485635",
  "source": "GoogleMaps",
  "reviews": [
   "My absolute go to place when it comes to afternoon tea! (*Actually booking a reservation for tomorrow after I'm done writing this review.🙂*)\n\n•The staff is so friendly here! \n•The service is also always fantastic whenever we visit, and never had to wait a long time at all for food or drinks to arrive.\n•The environment is absolutely stunning. We've dined in both rooms multiple times and I always enjoy taking photos of things in each room, but always seems like there's more to take photos of each visit here. :)\n•The food and tea never disappoints! The Cherry chocolate chip scones are so decadent and amazing, and Cupid's Arrow is my absolute favorite tea to have here.\n\nI can't recommend Reynolds enough!",
   "Down in the pub it's a very colonial atmosphere but with some great beer. And other spirits, of course.  Wish the TVs were gone but oh, well.  Staff is great.",
   "Took our mom there for a belated celebration.  She enjoyed it. Bo, our waitstaff person was tremendous in explaining the menu. We chose The Colonial Tea which was really a fine choice for mom as she likes small plates of food and she enjoys teas. The Apple Tea she chose was flavorful. The brown sugar lumps took a minute or two to get used to but it was a part of the treat. Our thirteen year old niece found it \"different\" but very enjoyable. She will try it again which says a lot for a young person. We had the Cream of Crab. I had the Shrimp with Bacon soup which I thoroughly enjoyed. It was very flavorful and the vegetables were plentiful. Everyone in my group of four enjoyed their meal; we will do it again.  The Reynolds atmosphere is great way of stepping back in time and the atmosphere was very relaxing.",
   "Visited Reynolds Tavern for tea and found the atmosphere to be fascinating historically and certainly unique, but the wooden tables in the dining rooms are very small and unstable as are the chairs. The dining rooms are also very small, which is to be expected in an historic home, but there are too many tables and chairs, that make both movement through the rooms and seating very challenging. \n\nThe waitresses and the other patrons were constantly excusing themselves to avoid bumping into each other both as they were serving tables, seated at their tables, and as they attempted to move through the room.\n\nThe food portions in the tea service are unbelievably small and surprisingly limited. A single small scone per person, tea sandwiches that are child-size, and pastries measuring literally less than ½ inch square. All of this would be absolutely fine but the cost for the customer is shockingly exorbitant and in no way worth the experience you are offered.",
   "We stayed for a weekend during the Fish for a Cure Event downtown.  Convenient location, great price, beautiful rooms and a very nice light breakfast.  The tavern downstairs is a must visit for history buffs, and beer garden is the perfect place to end the evening... awesome!  \nWes & Marilyn are fantastic hosts."
  ]
 },
 {
  "name": "Joss Café & Sushi Bar",
  "address": "195 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d21ac1da-932d-11ea-81d1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7772733774446762757",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious sushi .. fantastic service - in the heart of downtown Annapolis. Great spot for a date or casual meal. Check out their great lunch specials",
   "Joss has lost its flare. We call to place an order. We are informed that you can only order online (although the website says otherwise). We are having internet issues. We call back. Sorry, we are to.d, we will have to figure it out. The site isn’t working on our Mac. Sorry we cannot help you. Our phones work so we order from there. Slightly confused why they cannot help a customer trying her hardest to order from them. The food was sub-par. We have been coming to this restaurant for over 20 years but this may have been our last time.  The rice was some odd kind, not the usual. The chicken was way overcooked and leathery not to mention half the usual portion. The fish tasted, well, fishy. Not good.",
   "I eat in this lovely place quite a bit! This is my favorite restaurant to grab a bite.  I visit this place many times. The cooking is very good, the crew is courteous and the prices are affordable. I like eating in this restaurant for a rich meal.",
   "Everything was fabulous:\nEel roll with avocado \nSoft shell crab app\nDumplings\nBlue fin tuna sashimi \nAnd our server, Cindy(?), was exceptional! She knew the menu through and through and answered all our questions. Her recommendations were on point!\nHIGHLY recommend this place. \nIt does get busy. We were smart and ate an early dinner. ;)",
   "Our server was amazing! Always on top of refilling our drinks and such. The food was amazing at around the same price as other places around DTA. SUPER IMPRESSED AND WILL BE COMING BACK"
  ]
 },
 {
  "name": "Chick & Ruth's Delly",
  "address": "165 Main St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d264764c-932d-11ea-892e-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "walk",
   "free",
   "food",
   "affordable",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=9489340998484809820",
  "source": "GoogleMaps",
  "reviews": [
   "Not exactly fine dining, but the food is fast and good. The service could have been better the last time that I came, but I've been coming here for years so I don't really expect a whole lot from them.",
   "Absolutely disgusting! Cockroaches and flies are falling in the corners and along a crease of the walls under the tables. The pickles that you order at the table and come in a small bowl are amazing. However!!! Whatever is left in the pickles you ordered and you ate with your fingers are put in boxes and sent 2 pick up or delivery. So if you don't mind that this place is great it seems like this place is protected because politicians get sandwiches named after themselves and got free food. Not always but there's a lot going on there. The food is mediocre at best and you can smell the stale oil always and you know what scent it is if you have worked in that industry. It's really amazing this place is still in business. Just look in the corners on the floor under the tables you will find them.",
   "Great food, great pie. Century old ambience. Popular place. Wait staff diffident but competent. \nSomewhat crowded two floors with narrow stairs.\nWill go back. Pols from statehouse were holding meeting. Apparently everyone in Annapolis knows of this place. Parking garage, free around corner thirty steps away.  Park there to walk to Statehouse,  then to wharf to see statuary of Alex Haley and surrounding info on 'Roots.' Finally, (tho I didn't go) fifty steps away is Naval Academy, which everyone says is excellent experience. Only three block back to car. But, MANY great things to see and do in Annapolis.",
   "My first time visiting this cute, little \"Ma & Pa\" establishment and apparently it’s been the cornerstone of Annapolis, MD since 1965! Some have quoted it as “the-squeeze-'em-in-tight” type Delly but boy do they knock out an affordable, big menu! Heavy on sandwiches and breakfast plates. Visitors can relive grade-school days reciting the Pledge of Allegiance at 8:30am weekdays and 9:30am Saturday and Sunday. Breakfast is served all day. \n\nI’m in love with the COLOSSAL CRAB CAKES! Look at these things! Let me just say that driving an hour from Baltimore for a taste of these lump crab beauties is worth the trip. Til next time Chick & Ruth’s, which can’t come soon enough.",
   "So first off, it's definitely worth noting that their \"20oz\" milkshakes are not 20 ounces.  Closer to 32 I'd say.  They fill your glass, then give you the remainder of the shake to fill it to the top once again.\n\nSuch a cool little place overall.  I didn't get around to trying one of their famous crab cakes, but their burger sure didn't disappoint.  The names are awesome on the menu options.  Wait staff is very personable and clearly have appreciation for their unique place of employment."
  ]
 },
 {
  "name": "Giolitti Delicatessen",
  "address": "2068 Somerville Rd, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2b52fd8-932d-11ea-8044-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11576778466255378382",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant is my favorite place.  Of all restaurants I know I like it most. I never miss an opportunity to go to visit this place. everytime  I feel like having a decent meal, this is the place that comes straightaway to my mind. splendid and   food and a rich menu.trained team, and great spirit. In addition to that, the price is modest. I tell about this spot with no hesitation.",
   "What a gem!  Very quaint place with excellent food.  I got take out but there are tables if you want to stay.  They have a great selection of baked goods and other grocery items you might not be able to find elsewhere. I uploaded a couple of photos.  The Calzone was phenomenal, and the sauce was to die for - plus, it was warm.  A lot of places give you a small ramekin of cold sauce, but not Giolitti's.  I was visiting from out of town so I was very happy to find it.",
   "Oh my goodness, the food was EXCELLENT! Had the Porchetta sandwich and a side order of Antipasto salad, it was divine. The salad had little kick to it and the sandwich was so good. Not dry and not soggy either. If ever in the area again I would definitely stop and have lunch here again. They also have a selection of wines, pastas and breads.",
   "First time here, and both the food and customer service were excellent. The prosciutto and fresh mozzarella were incredible. Definitely will be back and would highly recommend to anyone looking for a great Italian Deli in the area.",
   "Good food and service."
  ]
 },
 {
  "name": "Jack's Fortune",
  "address": "960 Bay Ridge Rd, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d301f1a6-932d-11ea-be8b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "delicious",
   "hospitable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8354370092846441555",
  "source": "GoogleMaps",
  "reviews": [
   "Always delicious fresh food, no MSG, friendly staff and good prices!",
   "Food is amazing I eat there all the time. The owner and her son's are always extremely nice and pleasant to be around. No complaints.",
   "Excellent Chinese cuisine! A tidy, neat, clean restaurant with a delicious menu. Very warm and hospitable environment. Highly recommend it 😊👍",
   "This was my first time ordering from Jack's Fortune.  I had heard great thing about Jack's Fortune and drove 25 minutes for take-out.  Bottom line, I loved it.  The time between ordering and receiving my meals was ten minutes max, and may have been less.  The food was fantastic and most importantly fresh, which is unlike the many resturants in my area.",
   "I can't know who else, if anyone, might care about this, but Jack's Kung Pao chicken is made in a brown sauce (instead of white/clear which seems prevalent hereabouts). I am always hoping to find restaurants that make it this way, as I find it far more enjoyable."
  ]
 },
 {
  "name": "MISSION BBQ",
  "address": "142 Dock St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d349f89c-932d-11ea-857a-14b31f159f22.png",
  "tags": [
   "historic",
   "free",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2289990951465270075",
  "source": "GoogleMaps",
  "reviews": [
   "This is an amazing restaurant. AMAZING service. The cashier gave my grandmother a free dessert because she was cute, she said. The food is phenomenal, very much recommend the pulled pork sandwich with fries. The location cannot be beat; it is right by the water in historic Annapolis.  It is one of the places I'm truly proud to be an American.",
   "Visited here on a recent overnight in Annapolis, really friendly staff and amazing food!! I had the baby back ribs, fries and cornbread and highly recommend them!! The rub on the ribs was a bit intense for me, but was delicious!! Tried the Kansas City and Texas sauces, both incredible",
   "I had a great meal here. I had a gift card that was 2 years old, why was downtown decided to check it out I'm glad I did I will be coming back again. And I will recommend this to my friends, and will probably bring them with me the beer was good too to really set the taste of the brisket I enjoyed so much",
   "Excellent spot to grab something when in a hurry. Their customer service is quick, pricing is reasonable, awesome mood. I highly recommend this place",
   "Love the atmosphere and the staff. Had the Texas Inspired Chopped Brisket Sandwich with Baked Beans and Mac n Cheese and it was pretty darn good!  I would defiantly come back."
  ]
 },
 {
  "name": "Yama Sushi Bar",
  "address": "2049 West St E, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d39f87e8-932d-11ea-8db0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6579962997032378151",
  "source": "GoogleMaps",
  "reviews": [
   "First visit was definitely a great one. They have soy paper and green tea cheesecake. Very impressed. Each person I encountered was pleasant and helpful. Ambiance is beautiful, decor is soothing and order was beautiful. I'll be back as this was a most impressive dining experience even for take out. UPDATE - Max and Joel are my favorite servers so far. Both remembered me from prior visits. You really can't beat the lunchbox special as it is filling and money saving.",
   "My first visit was exceptional. The best customer service in the area!! Reasonable prices and delicious sushi. This is my new favorite restaurant.",
   "This place is doubtless one of the most attractive restaurants in the area. Whenever I go there I am highly satisfied. They maintain their high  standard service and the topmost level of food  they offer. You are always happy with this restaurant. Warmly  recommended.",
   "Fast service and good food. Price is Right at normal for the area. Plus, excellently polite servers.",
   "Great food. Very friendly knowledgeable staff our waitress was wonderful. Atmosphere was very cozy and personable. The dinosaur egg is fantastic a must try. I live about 15 miles away but I have found my new sushi joint"
  ]
 },
 {
  "name": "Bread and Butter Kitchen",
  "address": "303 Second St A, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3f24102-932d-11ea-8fce-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5532562754342982652",
  "source": "GoogleMaps",
  "reviews": [
   "Very tasty food, beautiful view, and the staff is very nice. The owner Monica does a lot of wonderful things for the community which is part of why I like to patronize this business. It is a win win.",
   "Such a great place for lunch right on the water in Annapolis. You can tell they make their food fresh and it tastes great. I had the BBK Burger my first time and the Philly Cheesesteak my second time and everything was delicious. Definitely coming back here when I’m in Annapolis.",
   "This place is a hidden treasure. Food was amazing. Decorated darling inside making the most of no space. Ate outside overlooking the dock while in the shade. \nService was wonderful. Outside was very dog friendly. Scones were the best I've ever had. (Light, fluffy, not over iced, used real fresh blueberries and baked to perfection) \nIced coffee was actually coffee, iced, with frozen coffee cubes while you doctor to your liking. (No prefab liquids) \nYou need to try it!",
   "Super good food and super great staff. It’s small and has a little bit of a DIY vibe. Great location.",
   "Amazingly good food and the staff are friendly and nice. Great view of the water and there's outdoor seating. Always try the soup(s) of the day and their daily specials are almost always their best item on that day. Try the Chicken Chipotle Panini -- probably the best thing on their regular lunch menu."
  ]
 },
 {
  "name": "Little Italy Annapolis",
  "address": "1411 Forest Dr b, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d44ff30c-932d-11ea-a82e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17565244937692176403",
  "source": "GoogleMaps",
  "reviews": [
   "Happened to be near this place, on business.\nMan....I am SO GLAD that I came here!\nDEEEEEEEEELISH!!!!!\nI got a really simple dish of sausage, peppers and onions, over spaghetti. It was remarkably good. One of the best I've ever had!\nNice staff. Quick service. And...again...\ndelicious food!\nWell done Little Italy!!!",
   "Tasty Italian fare with really great service. Comfortable atmosphere, very friendly neighborhood kind of vibe.",
   "This place in fantastic!  We’ve been going there since they opened the doors.  The food, service, everything is incredible.  We have even ordered an item that was not on the menu (something my son orders at a different Italian restaurant), and they said “no problem” and made it for him...many times.  I highly recommend trying out Little Italy in Annapolis.",
   "Wow! Went here for lunch, the pizza & wings are amazing! I highly recommend this place.",
   "I really wanted to try Little Italy, I read the reviews and thought ok great but it wasn’t what I expected, I’m really disappointed I called to place my order they said 20 minutes but it turned out to be 40 minutes for what? a BURNT and very GREASE pizza, wasn’t great at all, not worth it at all."
  ]
 },
 {
  "name": "Carlson's Donuts & Thai Kitchen",
  "address": "1022 West St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d49c189e-932d-11ea-86f0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1601728209446014561",
  "source": "GoogleMaps",
  "reviews": [
   "It was delicious. People are so friendly over there. I ordered a papaya salad which was fantastic. You must try their noodle soup with beef. I will definitely come back.",
   "Intriguing combination... We came for dinner and it was fantastic. Then decided to come back the next morning for donuts. Also delish! Come early and bring cash.",
   "Awsome thai food",
   "Went there for breakfast. Sandwich was kind of greasy. Donut was good. Unfortunately service was non-existent. The lady at the counter was not exactly friendly. Just point to the coffee table when I ask for my coffee. Seems to be very annoyed at me. \n\n1 week later:\nStop by for Dinner, Thai food..\nLove the drunken noodles, crispy duck was dry and tasteless, sauteed shrimp dish was ok. \n\nSo 3.5 stars ..\n\nMore updates 2/28/20\nDon't come here during dinner hour, have to wait 30 mins before they bring you water. Only 1 waitress/owner .. 1 hour before getting the meal. Sigh. Slow.\n\nTom yum soup is just sour with out the taste. I will skip that next time.",
   "favorite thai place, everything always tastes great. waiter is very nice and accommodating of requests and modifications. we even got some free donuts for dessert after dinner :)"
  ]
 },
 {
  "name": "Davis' Pub",
  "address": "400 Chester Ave, Annapolis, MD 21403, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d4f3d722-932d-11ea-83cd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2424842475379752423",
  "source": "GoogleMaps",
  "reviews": [
   "Great American Pub. Great food. Great ambiance. Great service. I thoroughly enjoyed their pulled bbq sandwich and chicken noodle soup. I can't wait to go back soon.",
   "This small locals hangout takes me back to hanging out on the Jersey Shore. Lots of friendly people. The food is killer. The pretzel crab appetizer is awesome. The BBQ sandwich is really good and the thin cut French fries, which many places don't serve, complete the meal. Go and spend some time, meet new people and have a great meal.",
   "They go the extra mile. Thank you for making my quarantine anniversary a fun one!",
   "Best neighborhood pub ever! Immediately greeted after arrival, and then the server/bartender made sure she/he got my name and told me their name. Remembered my drink during several repeat visits (I have been here for lunch approximately 12 times). The menu changes daily - I tried their Reuben, fish sandwich, hamburgers, and several specials  -all were very good and well made, good proportions.",
   "I agree with the favorable reviews. Good service, good food, cold beer, provided in a clean environment with occasional waterfront dinning, due to climate change.  Crab cake sandwich was great. Visiting Yankees may want to request a toasted roll to firm the bite,and get the 5 star rating. The Maryland crab soup was a home run too. Well done!"
  ]
 },
 {
  "name": "Dock Street Bar & Grill",
  "address": "136 Dock St, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d55d705e-932d-11ea-ad39-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6802828317074876069",
  "source": "GoogleMaps",
  "reviews": [
   "Best crab cake place in annapolis.\nStaff is attentive, and provide a fast service.\nFood was on point and really good. Both wife and I enjoy this place every time we are in Annapolis.",
   "The food here is excellent. The 1 pound of steamed shrimp I has was almost more than I could eat. Compared to other restaurants nearby like next door on either side there is no comparison! Dock street is almost always very crowded but no other restaurant nearby compares and you'll like the prices!",
   "Had some of the best wings! Burgers were perfect! Great service!  Will be back again.",
   "Had the tuna, the crab dip and the chicken tenders. Everything was amazing.  The staff is so friendly and the environment is very welcoming.",
   "Best Crab Cakes in Maryland!! Even at 1am when the place is packed on a Saturday night! When in Annapolis make sure to stop by here for good food and service."
  ]
 },
 {
  "name": "McGarvey's Saloon & Oyster Bar",
  "address": "8 Market Space, Annapolis, MD 21401, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d5ae50dc-932d-11ea-a558-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17448032001461830346",
  "source": "GoogleMaps",
  "reviews": [
   "Calamari, blackened fish tacos, crab cakes, asparagus and the fish of the day (flounder) were all great. Excellent tarter sauce. The cocktail sauce is pretty sweet. The salsa with the tacos is spicy and good. I wish I would have taken pics because the plates looked so nice. Our server was super friendly and she encouraged the crab cake which I was very happy with.",
   "We came from KCMO on a vacation for 5 days. We ate here twice. The first time we came the food and service was absolutely wonderful! The crab soup was awesome. The oysters were delicious! We got the special on them the $.50 each. The second time we came my shrimp and grits had a piece of plastic in it. I let the server know just to give them a heads up. The manager came over and asked if I wanted another one. I obviously didn't want the same because I was afraid it would happen again. I had only had a few bites. It was delicious what I had of it though. They ended up giving us a drink.  Better than nothing,but normally you would take off that meal or maybe discount it at least. I also had the crab soup and noticed second night it had lots of shells in it. The house brew is really good and house shandy is delicious.",
   "This place is supppper cool. They have a TREE in the restaurant. That is amazing. The waiter was nice (Didn't catch his name, but you know who you are if you are reading this review) was really nice and helpful. The Stuffed Shrimp was really great. Shrimp with crab? Yes please, Wrapped in BACON? Oh yes. I didn't get it, but i stole some from my grandma, and it was really great. Fish and chips were also really flavorful and good. Decor, was also, amazing because THERE IS A TREE IN THE RESTAURANT. It is also much larger than you think it is. When I first came, it was PACKED in the front room, and I thought 'We're never gonna get a table.\" But then, they had a whole other room, which was really great.",
   "Before a Navy basketball game, we had dinner at McGarvey's sitting at a table in the front bar room. Classic, cozy bar where patrons were talking and having fun, and half the people seemed to know the bartender. At least that evening, this was an authentic \"neighborhood bar\". Yes, I had a couple pints of the Aviator Lager (good) and I had an enormous bacon bbq burger. It all seemed made to order, the burger was hand-formed and bacon was big and just cooked. We will definitely be back!",
   "Nice spot for some good beers and seafood.  The food is pretty decent for pub food. Tasty and perfect mix for the beers."
  ]
 }
]