[
 {
  "name": "Maine State Museum",
  "address": "230 State St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fcc9914c-932d-11ea-bfea-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "affordable",
   "history",
   "affordable",
   "field"
  ],
  "link": "https://maps.google.com/?cid=4361433094976593476",
  "source": "GoogleMaps",
  "reviews": [
   "I have not been since a school field trip probably in 2010. I took a kid who I was nannying for (he was not looking forward to it) . Guess what, HE HAD A WONDERFUL TIME AND SO DID I! And for the 2 of us, he a kid 6-18 Yrs old and me an adult 18+ it was $5.. that's it!! Ask for the scavenger hunt is you go!! Total fun",
   "Its very affordable & a good place to take children. The exhibits are interesting, informative & very focused on Maine day to day life of regular ppl which sometimes gets lost when we only talk about leaders & big events. The animal exhibit is a big hit with the children &  there are a number of good programs presented to engage young kids.  The parking can be good but it depends on the day if the legislature is in session you'll want to allow time to find a space.",
   "This is an incredible museum and an outstanding value. My wife and I had 2 hours to see the entire museum and it wasn't enough! If you are a history buff and especially enjoy Maine history, you will NOT be disappointed.",
   "My son loves it. It is affordable. The staff have been welcoming. Still exploring the programs.",
   "We went to the Maine State Museum on a field trip. We had two sessions with workers from the museum that were outstanding! They answered questions and gave lots of info to our students. They did a great job!!"
  ]
 },
 {
  "name": "Capitol Park",
  "address": "33 Union St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fd1b314c-932d-11ea-a95c-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3060899639855906576",
  "source": "GoogleMaps",
  "reviews": [
   "Wide open green spaces with a great view of the Capitol, especially at sunup/sundown and at night with the Capitol building all lit up. Easy to access and always very clean. Sometimes can be a bit noisy due to its location, but it’s large enough that most spots aren’t loud enough to spoil the day. Great spot for family photos or photographers looking for an easy but engaging location.",
   "Lovely  walking pathways through the park. Lots of green area for picnics.",
   "Peaceful and quiet, cool under the trees. Where the rains had not drained well, they had formed a very shallow pond near us, where ducks played and made us smile. \nThe Maine Vietnam War Memorial stands here, too, somber and solemn.",
   "Walk each day there,so pretty and enjoy the fresh air and it's not that crowded",
   "The park is beautiful with large grassy areas and plenty of shade trees, tables, and benches. There is a playground across the street thats great for kids too."
  ]
 },
 {
  "name": "Viles Arboretum",
  "address": "153 Hospital St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fd697a1c-932d-11ea-971f-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "family",
   "kids",
   "walk",
   "family",
   "art",
   "unique",
   "walking",
   "unique",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15812197159430686551",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to take a walk with friends and family or bring the pet for a wilderness jog. Have always had a blast here and always get to enjoy seeing some wildlife no matter what time of the year it may be. There are snow shoe trails and also cross country skiing trails. The as arboretum does unfortunately close at dark, which kills the idea of a night hike in the woods but still a very cool place to visit . Highly recommended",
   "They also have rooms for rent for meetings.  Lovely gardens lots of things to look at. Great place to bring kids.",
   "Very beautiful, quiet, well maintained trails. Great place to walk or run. Several trails for just a quick stroll or a longer expedition. Several sitting areas for a quick rest or a picnic lunch. The art work throughout is breathtaking. A great place for one or the whole family.",
   "One of my favorite places to go walking. A variety of trails in the shady woods and around open fields of wildflowers. There are unique and fascinating sculptures to enjoy along the paths. Different habitats to explore from a woodland pond to a hillside rock garden and a stroll through the hosta garden. I particularly enjoy the groves of trees clustered by species, stone benches are available to rest in their shade.",
   "Fabulous resource.   The grounds offer multiple well-marked hiking trails for walking,  snowshoeing or cross-country skiing.  Leashed dogs are welcome and unique statues enliven the open spaces.  Beautiful even in the winter."
  ]
 },
 {
  "name": "Old Fort Western",
  "address": "16 Cony St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fdad8934-932d-11ea-a7f3-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "history",
   "field",
   "learn",
   "history",
   "food",
   "tour",
   "historic",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4463324670722088308",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty nice place to visit. I love history so, nice to see an old trading post. Pretty small but they usually were. Nice park about a 5 minute or less walk away. Great for kids as well a nice big playground at the park. Saw some people just reading so nice quiet place as well.",
   "A great place full of history that comes to life! The oldest still in use colonial building in the USA, and home to a number of historical items. A place where everyone of all ages can enjoy a great look back in time, and learn a great deal about how people lived in the colonies that became the United States. From how they made clothes and grew food, to tools and living spaces, as well as the weapons they used to defend themselves in battle. This is an awesome experience that I would highly recommend to all!! I enjoyed being there as a chaperone for my daughter's second grade class field trip, and I hope to go back again this Summer to check out more of what they have at this amazing how e of history! Located right on the Kennebec River in Augusta Maine, and easy to get into from the main thorough fares. Well worth the price of admission, currently 10.00$ for adults, stop by if you can and be ready to learn!",
   "Tour guide was so informative. Historic spot that was important to the areas success.",
   "Interesting looking little fort, but visitors to the area are asked to pay an exorbitant fee for entrance. $10 per adult, $6 per child, to essentially step inside the fence and look in a single building. \n\nMeanwhile, a couple of blocks up the road you can visit the 4 story Maine Museum and see hours worth of exhibits for a tiny fraction of the price.\n\nIt's unfortunate. Because if they had asked for $2-3 we'd have paid it to support the upkeep even though we'd have only spent 15 minutes here. As is, I'm sure they're turning away most visitors with the outrageous prices. \n\nI'm sure that's the way they want it...",
   "Fantastic tour! Ms Arnold was a wonderful guide. Worth visiting if you are in the area."
  ]
 },
 {
  "name": "Children's Discovery Museum",
  "address": "171 Capitol St #2, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fe074392-932d-11ea-a494-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "kids",
   "learn",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9960810038590303944",
  "source": "GoogleMaps",
  "reviews": [
   "My daughter absolutely loves this place. She even wants me to make her a kinetic sandbox for her at home. A lot of the kids here are able to socialize and learn. A very nice place that definitely deserves more attention than it gets presently!",
   "Great place to bring kids. Wonderful membership options. Just a bit small on repeat visits",
   "Enjoyed going to a birthday party here. Many different stations with lots of imaginative play to be had. Six and three year old had a blast. Even had a few activity centers for older babies. Objects are well loved but do the trick.",
   "We just had a great time checking out the Augusta Maine Children's Discovery Museum. A great place for younger children too learn, play, and interact with others kids. For a small location they really have alot to do and see. I'd recommend this place too anyone with younger children and hope you all enjoy it as much as we did. Thanks for having us and we will see you again!!",
   "We had a wonderful first time today. The kids had a great time! We look forward to our next adventure soon!"
  ]
 },
 {
  "name": "Blaine House",
  "address": "192 State St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/fe69145e-932d-11ea-99fa-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=985620600951819869",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit lots of History! Quite honestly it's a lot to take in make sure that you get here early. Well worth the small admission fee",
   "Cute",
   "We should all know Maine's history and it is a beautiful place.",
   "Was great to meet governor wife.",
   "I miss seeing Governor Lepage."
  ]
 },
 {
  "name": "Mill Park",
  "address": "2-32 ME-104, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/feb86e86-932d-11ea-be65-14b31f159f22.png",
  "tags": [
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6992894351569937216",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to hang out and enjoy the summer sun. Lots of events are held here. And the dog park next door provides a great place to bring man's best friend",
   "Excellent park , kept clean and neat. We go there all summer and pet friendly",
   "The dog park is great and divided for large or small breeds. Humans seem to leave messes behind, as always, but overall it’s a nice spot to launch a kayak, walk along the river, or attend the weekly Farmers Market on Tuesday’s 2-6 pm in the summertime.",
   "It is a great place to go to and  get a few things",
   "Fun time with kiddos and awesome free grab bags and t shirts;)"
  ]
 },
 {
  "name": "Williams Park",
  "address": "59 Bangor St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ff086482-932d-11ea-8ae7-14b31f159f22.png",
  "tags": [
   "field",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12416310379948067588",
  "source": "GoogleMaps",
  "reviews": [
   "We could spend all day here, easily!",
   "Williams Park is absolutely beautiful! It is a wonderful family friendly and safe place to be. The pool is clean and the lifeguards are magnificent. it has a wonderful skate park and basketball court. A large field area with playground.",
   "Great place to take kids to play and swim in the summer but the playground needs an upgrade as the upside down slide is unsafe for smaller children and the other equipment is basic. I realize children lose interest quickly.",
   "Great place to skate board, ripboard, play basketball and allow children to play on playground. But keep an eye on them; as any place beware of strangers.",
   "My son lives it here. Good play ground and pool. Nice people and decent area now"
  ]
 },
 {
  "name": "DEW Haven | Maine Zoo and Rescue",
  "address": "918 Pond Rd, Mt Vernon, ME 04352, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ff64bb4a-932d-11ea-93bb-14b31f159f22.png",
  "tags": [
   "eat",
   "family",
   "eat",
   "cheap",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15814472253775381988",
  "source": "GoogleMaps",
  "reviews": [
   "Love this sanctuary! The animals are beautiful! We got to pet goats and llamas and there are geese and ducks that run around loose! The parrot was definitely my favorite! Such a beautiful bird! I LOVED seeing the tigers eat and prowl around! The mountain lions were absolutely gorgeous, and the monkeys were just so cute!",
   "This is an amazing animal haven. Thank you to the staff for answering all our questions on our visit. Thank you to the owners for the amazing job you do in caring for the animals and the wonderful staff u hire. Never realized how much money and work this family does because they love animals. If anyone is looking for an organization to make a donation to seriously come check out this place. The Big cats will steal your hearts!",
   "Admission is for the entire day, so you are welcome to leave and eat lunch on the picnic tables before heading back in. You can feed the animals in the beginning of the park, including the bears! There's even some fowl just strolling around with you! \nMore exotic cats than I have ever seen in one place. You can see they are expanding to include more as well. Staff were friendly and helpful, gift shop available at the end of the park. Definitely worth a visit (or three!).",
   "It was under construction but what a wonderful surprise this little place was to us. We will be regulars every year to support this rescue zoo. I loved the black bear, tigers, lions, black panther, mountain lion,. Bob cat, camel, farm animals (who you feed if you want), and the ducks that follow you but are nice.",
   "It is a great place to go with your friends or take the kids. Kids under 4 go for free we brought our 2 year old and 1 year old and 3 year old niece they all loved it. Super cheap entertainment for the kids as well. Staff was also very nice and were great with the animals"
  ]
 },
 {
  "name": "First Amendment Museum at the Gannett House",
  "address": "184 State St #6406, Augusta, ME 04330, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=11976985848409241196",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "Sonny's Museum & Rock Shop",
  "address": "226 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ffbf243a-932d-11ea-8dd4-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16288245349479506632",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing table tipping session tonight! The store is very well stocked, and the owner is just delightful! I can't wait to go back!",
   "Great place with a lot of selection and good prices!  The store is pretty cluttered with all types of things, so you definitely need to give yourself some time to explore this place fully and get ready to kind of search through things.  The prices were somewhat negotiable,  which made it good for everyone!",
   "Great friendly atmosphere when you walk in you feel like family. Custom handmade wrapped jewelry amazing stone formations.  You need to see it to believe it wonderful place",
   "Very helpful and knowledge..A very cozy  little spot tucked in among other  businesses",
   "Come see the newly renovated place "
  ]
 },
 {
  "name": "Colby Museum of Art",
  "address": "5600 Mayflower Hill Dr, Waterville, ME 04901, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/000b70ca-932e-11ea-a40a-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "art",
   "free",
   "free",
   "art",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=15839263013311796913",
  "source": "GoogleMaps",
  "reviews": [
   "I cannot say enough good things about this museum.  It is free, open to the public, and has plenty of accessible, free parking. \n\nThe collections are amazing and even the \"non-artsy\" patron will be amazed at how many artists he'll be sure to recognize, if not by work, then by name \n\nPlease take your family to enjoy this local treasure house!  Art is for everyone!",
   "Amazing, free museum open to the public & I feel very lucky to be within driving distance  of such a great museum. The exhibits change quite often & they are always interesting & eye-opening. The building itself is gorgeous & there is plenty of parking on the weekend but if you're going during the school week leave time to find a space.",
   "Great museum with collections of modern, American, folk, western, sculpture, photography, world art, and more. Admission is free which is always a plus. I think you could really see everything in the museum in about 3 hours. Parking is plentiful and there is a small gift store and Cafe on site. Definitely recommended!",
   "Outstanding, free to the public, museum. Rather than hocking art donations like Harvard does, Colby builds additions. Spacious and beautifully curated. Has hundreds of Whistler works. Several artists donate their work, e.g. Alex Katz. Has a small coffee and snack shop. I love this museum, and visit every time I'm in Maine. I could go on and on with praise. Have posted my favorite work.",
   "This is a hidden gem in Central Maine,  beautiful exhibits.  Best museum."
  ]
 },
 {
  "name": "Swan Island",
  "address": "314 ME-24, Richmond, ME 04357, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/004e957a-932e-11ea-93b3-14b31f159f22.png",
  "tags": [
   "nature",
   "tour",
   "food",
   "learn",
   "tour",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4596014230150020372",
  "source": "GoogleMaps",
  "reviews": [
   "Close to civilization, yet feels miles away!\nWe paddled over to the campground, about 1.7 miles from the swan island boat launch in Richmond. Campground is well maintained, all spots have picnic tables and firepits. Plenty of hiking trails. Great place to escape to for a day/night and be out in nature.",
   "We will definitely do the lobster bake every year. Great tour is the island and wonderful food.",
   "Swans Island is cool, take the tour so you can learn the history of the island.",
   "Very peaceful and scenic.  You walk on a dirt road around the  island.",
   "Had a beautiful run out on the Island! Cant wait to go back."
  ]
 },
 {
  "name": "Two Cent Bridge",
  "address": "114 Benton Ave, Winslow, ME 04901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/009eb2cc-932e-11ea-8271-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12193043914876085848",
  "source": "GoogleMaps",
  "reviews": [
   "It was awesome! Seriously so pretty! The leaves are changing colors and the view was gorgeous! It was a nice little park to walk with our 5 year old. Worth the quick stop.",
   "We love the walk through the park and the bridge",
   "Very cool park! So good to see folks taking care of the past!",
   "A beautiful day on the Kennebunk River, upstream of the 2 cent bridge",
   "Beautiful river park."
  ]
 },
 {
  "name": "Hidden Valley Nature Center",
  "address": "131 Egypt Rd, Jefferson, ME 04348, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/00f07dc6-932e-11ea-b04a-14b31f159f22.png",
  "tags": [
   "hike",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=17180602394254740675",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful trails plenty of groomed and ungroomed trails and well matked",
   "Full moon hike was a blast! HVNC is a great place, lots of trails, great events like music festivals, trail races, XC ski clinics for kids. A jewel in Midcoast Conservancy's crown of preserves.",
   "Spent a night in the Two Dog Hut. Accidentally walked all the way up to the Dyer Pond cabin but I'm happy I did. Will likely come back with a group of friends. Loved every minute of my time there. Highly recommend this place.",
   "Beautifully groomed trails and lovely, rustic facilities that are well maintained",
   "Great hiking trails! Interesting programming, many different events on the calendar. Lots of wildlife, fantastic place for birding. Beavers, otters, owls and more. They even have cabins and yurts for overnight rental. Members get a 40% discount, so membership basically pays for first few nights rental. Great XC skiing in wintertime, too."
  ]
 },
 {
  "name": "Quarry Road Trails",
  "address": "300 Quarry Rd, Waterville, ME 04901, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/01466786-932e-11ea-9923-14b31f159f22.png",
  "tags": [
   "kids",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16974725770876908396",
  "source": "GoogleMaps",
  "reviews": [
   "It's a great place for country skiing. The trails are groomed and they have ski programs for kids. There's also a great hill for sliding.",
   "Other than being able to hear traffic not that far away, is a lovely place to hike. Lots of variety and easy access.",
   "What are the incredible resource for the Waterville community. Snowmakers, trails, snow shoes, fat tire bikes, places to run, and a yurt, which is my favorite word to say. If you like to be outdoors this spot is a nice little oasis. The folks that run the place are also very youth friendly and frequently engage youth within the community and work hard to ensure those who need a hand up can enjoy all these experiences too.",
   "All kinds of different trails \nWell groomed. Priced right.loved it.",
   "Run her all summer.  Has everything you need."
  ]
 },
 {
  "name": "Monkey C Monkey Do",
  "address": "698 Bath Rd, Wiscasset, ME 04578, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0193777e-932e-11ea-89ec-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=225791564911357833",
  "source": "GoogleMaps",
  "reviews": [
   "I have driven by Monkey C Monkey Do a thousand times. Today did a party for 7 to 10 year olds. What FUN. The place has something for everyone and all abilities. Not sure why we did not do this earlier. It is challenging, easy and hard at the same time, gives everyone a sense of accomplishment. Everyone had a blast. The staff is professional and helpful.",
   "So amazing and challenging!! It was a great bonding experience too!",
   "We love MSMD - we’ve been multiple times and always enjoy our time there. Something fun for all ages and capabilities!",
   "Great ropea course. Fun zip lines. Great experience.",
   "My 10-year-old son and I had a great time. The staff was very friendly, helpful, and safety-focused. As nervous as we were sometimes on the courses, we always felt safe. My son *loved* the giant swing and did it multiple times. It was much more of a workout than I was expecting and I woke up sore the next two days, but totally worth it! Oh - one more thing: would it be possible to have knots on the tether ropes below the tape for better grip (like on the zip-line ones), or would that compromise the load rating?"
  ]
 },
 {
  "name": "Damariscotta Lake State Park",
  "address": "8 State Park Road, Jefferson, ME 04348, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/01fa7890-932e-11ea-9dbb-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "parks",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4617569511194039305",
  "source": "GoogleMaps",
  "reviews": [
   "Great park, nice water, picnic tables, grills, but not too big. Not going to loose your friends in here. Quiet and beautiful.",
   "Perfect place to bring kids for the day. Nice sandy, freshwater beach. Lifeguard on duty, grills and picnic tables available. Always love this place!",
   "Good lake to visit with the kids. Been going here my whole life! Parking lot, restrooms and picnic tables you would expect at other state parks. Very small playground. Beach area with bouyed swim spot with lifeguard during peak hours. It's a nice place to bring beginning swimmers because its quite shallow and no steep drop offs.",
   "We all love this place and you can rent the outdoor area for friend and family gatherings which has a bbq, power, and a sink. Warm water and a small beach with restrooms and camping available nearby.",
   "A wonderful state park. Only thing is that there is a limited amount of parking. So it's advised to get here early."
  ]
 },
 {
  "name": "Boothbay Railway Village",
  "address": "586 Wiscasset Rd, Boothbay, ME 04537, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/02623cda-932e-11ea-a7f4-14b31f159f22.png",
  "tags": [
   "walk",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=1389181599436199236",
  "source": "GoogleMaps",
  "reviews": [
   "This was a really fun last minute idea.  The tickets are $20 each and if you buy online there is a small fee but it is totally worth it.\n\nMy son loved the train ride.  He never sits still but once the train started going he was all into it.\n\nAfter the train ride you wan walk around through the little village into all the buildings and there is something set up all around.  From making an ornament to sitting on the big old fire truck (Aldens favorite).",
   "Update your website to reflect closed...DROVE WHOLE WAY for nothing.",
   "I absolutely love the place, I go there at least once a year and last time I went I got to see the trains up close and I was absolutely in awe. The only thing I don’t really like is that the loop is kinda short and there aren’t any signs saying “employees only” or “stay out” so I’m nervous that I’ll be looking around and end up going somewhere I’m not supposed to go to",
   "What a great place. Was thinking it was just going to be a few barbs with trains to look at but was completely amazed at them having a whole historic village, massive car collection, model train village as well as trains and a train ride set in beautiful grounds. Spent an easy 3 hours here. Staff incredibly friendly too.",
   "It's small. It's cute. It is not an original railroad line, but original pieces. There are some random collections. The Salt and Pepper house is one that is random. My son loves the train.  Your train ticket is good for the whole day. The train runs every hour."
  ]
 },
 {
  "name": "Colburn House State Historic Site",
  "address": "Arnold Rd, Pittston, ME 04345, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/02c60986-932e-11ea-b6ff-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2186835758747921804",
  "source": "GoogleMaps",
  "reviews": [
   "Benedict Arnold stayed here in the 1700s.",
   "",
   ""
  ]
 },
 {
  "name": "French Mountain",
  "address": "139 Watson Pond Rd, Rome, ME 04963, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/03339a64-932e-11ea-b1b4-14b31f159f22.png",
  "tags": [
   "hike",
   "kids",
   "hike",
   "kids",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=3639378211450570770",
  "source": "GoogleMaps",
  "reviews": [
   "Was a amazing hike ,view was breath taking,  but i will not share that view have to see it for your self . ITS WORTH IT",
   "Great spot for the tiny trucks.",
   "Perfect hike for kids!! Takes about 25-30 mins to go up and down.. beautiful views at the top too. Not too far from my house which is a a plus. We try to visit once every Summer.. definitely a beginner trail, but fun either way! Give me a thumbs up if this review helped you out!",
   "I love the views and the peace of mind as sit on the ledge.",
   "Love the view from the top of this easy and fast hike (less than a mile). Great place to bring the dog or kids."
  ]
 },
 {
  "name": "Coastal Maine Botanical Gardens",
  "address": "132 Botanical Gardens Dr, Boothbay, ME 04537, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0388c0d4-932e-11ea-b29b-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "nature",
   "walk",
   "kids",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13901869658567484886",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful light display at Gardens Aglow!  We went right after the fresh snowfall.  The kids enjoyed it as it nearly seemed magical.  \n\nThe staff were extremely friendly and helpful as well.  \n\nWe will be returning in the spring or summer to visit the gardens in the warm months.",
   "So the lights were as beautiful as ever. The lights get 5 stars. However, it was missing a few steps in the family friendly category this year. In the past we have enjoyed the campfires and the kettle corn, both of which were missing.  Hopefully all the money that this event brings in is not going to be diminished by taking a bunch of shortcuts.",
   "Pack a lunch, a big lunch, loads of snacks and come on out here for the entire day.  This place is outstanding when it comes to value, entertainment, education and nature.  This is one of the most beautiful gardens I’ve been to and a must see for anyone coming to Maine.  \n\nChildren’s area is huge and they can easily spend an hour plus playing there.  The hiking trails are fantastic and you’ll definitely earn a big lunch.",
   "Such a holiday delight, GO ! See IT !  \nI can't  say enough . . .  walk around the acres of holiday lights strung all over the trees, bushes, and water bridges at the Botanical Gardens in Booth Bay, Maine.\n\nThe cost was $16 for adults, and kids about $9 each for entrance into the Botanical Gardens. You need to buy your tickets ahead of time . . .  online works.  I believe the holiday lights are up 2 weeks before Thanksgiving to New Years. Over that 6 week period, you can buy tickets for the 4 pm time slot, or the 6 pm time slot. But check out the website for details. \n\nWatch the weather, and temperatures! It was cold the night we went, temps. in the teens with wind gusts up to 25 mph. Dress with all the trimmings, for your head, hands, and feet! There were 600,000 lights this year! FANTASTIC! \n\nThe best news, try the hot chocolate stations! They take cash or credit. They offer a few delightful flavors, I highly recommend  the butter rum or peppermint! \nEnjoy the Best hot chocolate  ever . . . as you walk around and see the best MAINE  light display ever!",
   "We went on Christmas night and we were not disappointed.  Very creatively designed.  Music played as we walked through the gardens. The fairy houses are so detailed and the train village is impressive.   We can't say enough about how beautifully lit the gardens are.  This is a must see for the entire family!"
  ]
 },
 {
  "name": "Fort Halifax State Historic Site",
  "address": "US-201, Winslow, ME 04901, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/03dde736-932e-11ea-93a9-14b31f159f22.png",
  "tags": [
   "field",
   "walking",
   "family",
   "kids",
   "kids",
   "library"
  ],
  "link": "https://maps.google.com/?cid=2546070502825694777",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park but we thought it had a walking trail down by the river. Nice little field and pavilion though.",
   "Nice park for family picnics",
   "Great little park. Small. Nice river views. Picnic tables. And pravilions. Cant wait to get back this summer when it's a little warmer.",
   "Love the Fort and has a spacious area to have a picnic, enjoy the river view, let your kids run around, etc",
   "The local library put on a juggling show for kids in the park. My 12 and 9 year old loved it. Great stage and plenty of room. Parking is good with pic nic tables near by"
  ]
 },
 {
  "name": "Maine State Aquarium",
  "address": "McKown Point Rd, West Boothbay Harbor, ME 04575, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/042d4136-932e-11ea-b61c-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13652052423323559185",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely love this place! Check out the 14lb Lobster Neptune. The views outside are amazing and the Aquarium inside is so much fun to experience. Even for return trips. Didn't do everything available, but it's worth the drive.",
   "Awesome displays of of Maine's Marine animals/fishes. Lobster displays were great. Grandkids had a great time at the lobster education center. Biologist did a demonstration of the lobsters life cycle. Even handling live lobsters was included. Fun and very educational time for us all",
   "Nice place, a lot of different lobsters. I was impressed by Netuno, it's a giant lobster!! And I was also able to pet the fish that was in the big tank on the middle of the aquarium. It's a nice ans small place, really fun for children.",
   "Good for littles with the touch tank and activities. The fishing off the dock was also nice.",
   "Much smaller than expected, big building but only small portion for public. What was there, was very cool!"
  ]
 },
 {
  "name": "Project Puffin Audubon Center",
  "address": "311 Main St, Rockland, ME 04841, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/047a9f6e-932e-11ea-ab5a-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18395729787124603960",
  "source": "GoogleMaps",
  "reviews": [
   "I love Puffins and what they are doing to protect them. Nice people there also.",
   "CLOSES AT 4:00 during the off season, GOOGLE says \"Open till 5:00\" unfortunately we arrived at 4:00 as the clerk was locking the door HOWEVER she was super nice and let us come in for a quick 5 minutes, we looked around, very nice small place, bought some merchandise and left. WISH SO MUCH we could've stayed longer, very nice little place.",
   "I feel that everyone should visit this place. Why? I don't know. There's really nothing there. Poor clerk was sound asleep when we were outside, but sparked up into an impassioned speech about puffins instantly as we entered. You can get puffin mugs, shot glasses, and assorted other puffin accoutrements here. After that you can explore the hallway that leads to a small conference room. There you will find a tiny cave placed on the floor for the kids. Whew! After that exhausting adventure, you'll have seen everything! Still, all jokes aside, preserving the habitats for these amazing creatures is a noble cause, and they clearly love what they do, so get thee in there and donate!",
   "What a wonderful place to visit,  great items to look over and informative personnel",
   "This place is very gigantic if you look at it through binoculars the wrong way."
  ]
 },
 {
  "name": "Wiscasset, Waterville and Farmington Railway Museum",
  "address": "97 Cross Rd, Alna, ME 04535, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/04c2f43a-932e-11ea-ae11-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=11089568695762623391",
  "source": "GoogleMaps",
  "reviews": [
   "If you like narrow gauge railroads this is a great place.  They run live steam trips on their restored route.  You can visit the shops and perhaps take a handcar ride.  Adult admission is only $10 summer 2019. Way cool.",
   "Very friendly volunteers!\nexceptionally nice people, will tell you anything you'd like to know about the railway. I love that everything that is on site is open for you to go and peak in and check out if you want to, just be careful. They have a lovely gift shop which has more than just souvenir items also has some great vintage railroad books for sale. Lovely ride in your choice of several different types of car. Got to love the smell of steam and cinders....(ps...don't wear white clothing!)",
   "The museum is run all by volunteers who have done an astounding job of restoring the equipment. Everyone who works there is friendly and knowledgeable and will take the time to answer any question you may have.  On weekends there is train ride using the authentic, restored locomotives and cars.",
   "Friendly people, a lot of fun for the kids. Nice little gift shop with used books (probably donated) some toy trains and hats for the kids, and other odds and ends. \n\nAnother building with some model trains running for kids to see. \n\nThe ride is not a long one but still fun for the kids. Train and  traincar was beauty inside and out",
   "This museum is unique, if you love trains,this is a must go bucket list place. They are rebuilding this railroad left for dead in the 1930s , on its original right of way, many pieces of the original railroad have been restored to operation and others replicated,take a trip back to the mid teens,Gman."
  ]
 },
 {
  "name": "The Coastal Children's Museum",
  "address": "75 Mechanic St, Rockland, ME 04841, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0508ff1e-932e-11ea-83eb-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=862880367785607052",
  "source": "GoogleMaps",
  "reviews": [
   "What a great experience here. The ladies at the front desk were friendly and informative. There is cool stuff everywhere to keep your little one entertained. Also lots of opportunity for the littles to interact with each other and create fun games to play. The Theater room was my favorite! So cute!",
   "We had a blast here.  My son loved playing and there were so many different activities for him to do.  His favorite was the velcro ball wall.",
   "Perfect little place with lots of hands on, and pretend play. Some things also to climb and simply exhaust some energy. I would say perfect for 12/18mos - 7/8 yo. Really cute. The kids loved it. I wouldn’t call it so much a museum because I think BIG area. But it’s more like a entertainment play place. Either way worth the check out in my books. I was a little skeptical of the size, but after exploring and seeing all the different things they have it changed my mind quickly.",
   "My kids nd I had an amazing trip to the Children's Coastal Museum!!!!",
   "What a fantastic place to bring your kids! So much to do! The staff is so friendly and helpful.  I will definitely be coming back!!"
  ]
 },
 {
  "name": "Olson House",
  "address": "384 Hathorne Point Rd, Cushing, ME 04563, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/05528d1e-932e-11ea-ba19-14b31f159f22.png",
  "tags": [
   "walking",
   "tour",
   "history",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1547928562614327763",
  "source": "GoogleMaps",
  "reviews": [
   "It is something, when you are in this kind of places like this historical house, which appears in many drawings of Andrew Wyeth!!! Visit the house ( you have to book online,otherwise they won't let you in) and get the spirit of one very talented and famous painter of our times!!!!",
   "Felt like we were walking around the painting, beautiful grounds well worth the drive.",
   "This place will bring to life the paintings by Andrew Wyeth as well as a better understanding of Christina's world. A definite place to stop if you are travelling near Rockland, Rockport or Camden. If you are fortunate enough to get Nancy as your tour guide, you will not only be entertained but the history of the house and its occupants will come to life as she tells the story of them all.",
   "Christina's World\nPainting by Andrew Wyeth,We got a tour of the house where Christina once lived.",
   "Interesting place, definitely worth going to if you're in the area – but you should be familiar with Andrew Wyeth to some level in order to get the most out of it. Make sure that there is a tour available when you are going, it is filled with great insights and history."
  ]
 },
 {
  "name": "Fort Edgecomb State Historic Site",
  "address": "66 Fort Rd, Edgecomb, ME 04556, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/05a20d98-932e-11ea-b8ef-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walk",
   "kids",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17309870546898180386",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for a quick walk and a picnic. Very well kept area right off the ocean. Has a great place to sit on a rock and read a book. Highly recommend for a quiet relaxing get away.",
   "Beautiful little park. I didn't get to go in to the actual fort because I went to early, but it looked very cool from the outside. Would visit again to explore some more and to enjoy the scenery. Great views from all parts of the park. Small parking lot that fits at most a handful of cars for those driving.",
   "Very nice change from the ordinary.  Wonderful views and some interesting history.",
   "I'm torn about my rating of the fort. The fort is incredibly cool to visit. It's well worth the visit. The view is beautiful - perfect for photo ops. You can climb down to a tiny little \"beach\". The history is remarkable. The issue, and reason why my rating is so low is because the shear amount of dog waste. We saw a couple of locals allowing their dogs to do their free range pooping, without a clean-up in sight. It is so extreme heading to the picnic tables, that we couldn't walk two steps without having to try to miss piles (and failing). As the grass grows and hides the poop, I can't imagine how many kids are going to be sitting in/rolling in this potential hazard. I've lived in Maine my entire life and I've never seen an area with so much dog waste.",
   "A quiet and sleepy stop on the way to another destination, unfortunately the building was locked and it's too badd because I really did want to go inside but it is a nice quiet area in a good spot to stop for a few minutes."
  ]
 },
 {
  "name": "Androscoggin Riverlands State Park",
  "address": "Center Bridge Rd, Turner, ME 04282, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0604539a-932e-11ea-97a6-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2271163274039995065",
  "source": "GoogleMaps",
  "reviews": [
   "First visit. Sharing a snowmobile trail, and everyone was cool. No scrambling to save my life.",
   "The best fishing in Maine. Hands-down.....",
   "Great trails year round. You could spend a couple hours or a whole day. Great spot for a picnic down at the meadow. My only suggestion would be to do a little more with the parking area.",
   "Great place to bike, hike, run for all ages. Trails deep in the park not marked well. Recommend bringing your own park map if your riding out near twitchell's airport.",
   "Beautiful hike through the forest, and ATV trail. Lots of old stone walls, and a few old stone foundations. Evidently we were in what used to be fields and old homesteads, but nature has reclaimed it. Trails are well marked, moderate to navigate with the rocks and roots in them but not too steep. Little less that 1 mile into a gorgeous picnic area, under a shelter, in a meadow on the river. There's also a composting toilet there that's in a shelter. Used the side by side ATV for getting those who didn't want to hike down to the picnic area"
  ]
 },
 {
  "name": "Penobscot Marine Museum",
  "address": "2 Church St, Searsport, ME 04974, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/066e13da-932e-11ea-a6b1-14b31f159f22.png",
  "tags": [
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4119514734760694087",
  "source": "GoogleMaps",
  "reviews": [
   "This place is captivating. An incredible amount of very interesting exhibits over a surprisingly large area, too. You can easily spend a few hours taking it all in. Tip: Be sure to ask the staff why the museum sits where it does.",
   "Awesome! Very informative staff. Unique museum made up of several buildings, each featuring something different. We saw living quarters, an exhibit of nautical paintings, and great examples of small boats of varied purpose & design. The camera obscura was so cool!",
   "Fun, outdoor exhibits,don't miss a stop at the Lobster Pound",
   "If you are a lover of maritime history or you have a question about something maritime or maybe you love photographs you need to take the time and visit.",
   "Do interesting and visitor-friendly!  Several buildings across the campus have different exhibits and lots to do."
  ]
 },
 {
  "name": "Norlands Living History Center",
  "address": "290 Norlands Rd, Livermore, ME 04253, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/06a9be66-932e-11ea-847e-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "unique",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=7853713586359335820",
  "source": "GoogleMaps",
  "reviews": [
   "A really interesting look at local history with lots of interactive aspects and knowledgeable participants",
   "A true step back in time, with links to Wisconsin and Minnesota. Still under restoration in different parts but open to the public. The history of those who lived there was very interesting and quite unique. Of those of you who are interested in the past and how it created the present do not hesitate to visit. Also check their Facebook page",
   "Norlands is a beautiful place to experience. Seeing how people lived in that era. The house tour was wonderful. A definite place to go. Children would enjoy the school house.",
   "I have always loved going there, and still do .",
   "Its a wonderful step back in time"
  ]
 },
 {
  "name": "Titcomb Mountain",
  "address": "180 Ski Slope Rd, Farmington, ME 04938, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/06f98d88-932e-11ea-81c9-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4259619246917719230",
  "source": "GoogleMaps",
  "reviews": [
   "Talk about a ton of fun! This place is a hidden GEM! Trails are perfectly groomed, mountain isn't too small, price is amazing and you can visit on your snowmobile, it is right before the end of the whistle stop trail on the left hand side. They do use T bar lifts and if you never used one do not at any point try and put pressure on them as they pull you only, if you try and sit then your bum will be in the snow! Overall I am very happy I found this place and can't wait to go back, if your a local you should be here weekly if not sooner! I do hope they put a snowmobile trail into the parking lot so your not just on the side of the trail.",
   "Fun little mountain. A real blast from the past. They do a great job grooming up the trails and all around friendly atmosphere.",
   "I signed my son up for Saturday ski classes, he has only been skiing once in his life for about an hour!!After his class was over, we tried to take him on the pony lift and we’re having a difficult time. A ski patrol girl by the name of Heather came over and offered us assistance and stayed with us for almost 30 minutes teaching my son some fundamental basic’s in skiing. She told me my son was very teachable and Did an amazing job working with him! I saw major improvements from that little bit of one on one time from her! I feel she went above and beyond to help my son!!! Thank you Heather!!!",
   "Great little mountain! Wicked friendly staff! The sweet potato hut, near the lodge, is excellent. Had a delicious potato and some outstanding apple grog!",
   "Has really fun hills and was holding up pretty good for the ski meet I went to. Nice cozy lodge and has a place at the top of the hill that can warm you up"
  ]
 },
 {
  "name": "Hacker's Hill Preserve",
  "address": "174-238 Quaker Ridge Rd, Casco, ME 04015, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/07520f54-932e-11ea-9a73-14b31f159f22.png",
  "tags": [
   "field",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5609399988628725337",
  "source": "GoogleMaps",
  "reviews": [
   "Really amazing sunset view- although take a sturdy car because it's a haul of a hill to get up. Perfect field for picnics. Benches to sit on for a quick visit. Not clearly visible as the access road is nestled into the trees. Easy to miss. Worth the view.",
   "Beautiful views.  Great place to picnic,  exercise the dog, or take photos",
   "Beautiful views. Great place for a picnic. Picnic table provided. Great place for a family to visit.",
   "Nice scenery and picnic area",
   "Great views of the distant mountains. Beautiful in fall. Can see for miles. Must see"
  ]
 },
 {
  "name": "Rockland Breakwater Lighthouse",
  "address": "44.104031, -69.077487, Rockland, ME 04841, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/07b5b51a-932e-11ea-aaef-14b31f159f22.png",
  "tags": [
   "walk",
   "structure",
   "walk",
   "historic",
   "history",
   "kids",
   "structure",
   "tour",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9783667776509933237",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible structure,  great walk.  If it's windy plan carefully.  You'll feel every bit of the 4300 ft walk.  Not recommended for dogs. Too many crevasses for their poor paws to catch",
   "I would rate this lighthouse experience higher, but I have not had the opportunity  to go inside this historic structure for a tour yet? \n\nAs a former history teacher, I look forward to completing  this adventure.  At this time I can share part of this experience   . . . \n\nThis lighthouse project was first started in the 1880's. Over time money was provided to construct a long jetty of rocks spanning 7/8 of a mile, by the U.S. Army Corp.  Folks can walk out with their kids ( over 5 or 6 years of age). Be careful, the cracks between the rocks are often over 12 inches wide, so little children need their parent's help.  When you arrive at the lighthouse, the building itself is usually closed, but you can walk around the building  and take photos.  \n\nThere's  no cost. No restrooms. No tour guides.   But it's  a nice walk, with a view of Rockland harbor. Hopefully I can arrange an inside tour, to enjoy the full experience and share with others.",
   "What a lovely place, esp. loved the stone walkway to the lighthouse!",
   "Wonderful walk down the breakwater (literally a long row of car-sized hunks of granite) out to the lighthouse. They even have a small floating dock off to the side where you can get the perfectly angled picture of the lighthouse.",
   "Beautiful walk to the lighthouse! The hottest day of the summer, 100 degree temps with the humidity, but we were fine. I had sandals on, just be careful of the big gaps between the rocks. Scenery is gorgeous - sail boats, people fishing & dog friendly. Highly recommend! ♡♡"
  ]
 },
 {
  "name": "Fort Knox and Penobscot Narrows Observatory",
  "address": "740 Ft Knox Rd, Prospect, ME 04981, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/08252668-932e-11ea-8a81-14b31f159f22.png",
  "tags": [
   "active",
   "walk",
   "structure",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10867261102254308866",
  "source": "GoogleMaps",
  "reviews": [
   "Fort Knox: This place is really cool and fun to go walk around. It isn't really wheel chair friendly but there are some place you can visit while on a wheel chair. Inside the fort there is tons of cool tunnels and different rooms that are fun to explore. There are some interesting stories here as well. They offer a whole bunch of different events here that are worth checking out. This place is pretty active and offer lots of space for big groups of people to visit. When you come here with some of your friends, it is worth playing hide and seek here.",
   "Love this historical place. They hold great events throughout the year and we especially love Fright at the Fort. They put on a spooky fun and safe show.  Beautiful view of Bucksport. Can visit this place regularly and it's always enjoyable.",
   "Incredible place to visit. The fort is well preserved and the bridge and lighthouse tower are amazing. Unfortunately the tower was closed when we were there. Check ahead before you go to ensure it's open.",
   "I was amazed at the bridge construction using huge cables extremely large granite support structures one of which you can enter and take an elevator to the top observation deck. The structure is clean and has excellent workmanship though out. The structure is made from Maine granite and has an amazing carving in the floor outside the entrance with the state logo. The elevator to the top was clean, new, large and very fast and smooth ride. The other attraction in the park is Fort Knox which again made with Maine granite. This is must see and very well preserved fort. The workmanship again is amazing and very strong structure. The park is well landscaped and kept up.",
   "This place is really amazing and only $8!  The towers are incredible and dizzying just to look at from the ground.  Fort Knox was also impressive.  You can walk through the whole place on your own and imagine what life must have been like for the soldiers back in the day.  I highly recommend this site for one of your vacation stops."
  ]
 },
 {
  "name": "Maine Maritime Museum",
  "address": "243 Washington St, Bath, ME 04530, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/08a6e906-932e-11ea-ac06-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "family",
   "tour",
   "history",
   "kids",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2877796578014114728",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice little stop in New England. Great gift shop, nice educational museum. We stopped in 20 years ago on our honeymoon and we're delighted to see it still has it's charm!",
   "Free Admission during January.  Locals and visitors from away can see the core exhibits at no cost. Once you've done that, you'll want to plan a visit during warmer weather so that you can explore the outside exhibits and take a boat cruise. This past fall, I took the lighthouse cruise and I highly recommend it. \n\nThis is a family friendly museum that is easily handicapped accessible. I included some lighthouse tour pictures from the fall.",
   "Wow, this is a gem of a find. We enjoyed it and could have stayed longer. We had three great tour guides. David gave us an overview of the whole facility. He did not miss a beat. He got us in and out as predicted. He was sensitive to the time. We had to make the boat tour and safely did. \nBen was our guide on the tour boat. He showed us the extensive history of the Bath, ME. Area, such as the Bath Iron Works, the Kennebec River, and light houses. He was full of knowledge. Irene was our guide for the Donnell House.",
   "Great pieces of history.  Love learning about our heritage. They had some cool things that allowed the kids to get some hands on learning. Overall great experience.",
   "AMAZING CREW. WONDERFUL EXPERIENCE.    My wife and I discovered this place accidentally. We entered the facility hoping to see some cool town history when we discovered the crew of artisans building a vintage wood schooner. Then the crew of docents guided us around the place and introduced us to the men and women taking on the amazing task. Wonderful, wonderful, wonderful. Thanks folks."
  ]
 },
 {
  "name": "Lost Valley",
  "address": "200 Lost Valley Rd, Auburn, ME 04210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/08ff3810-932e-11ea-93c9-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1945498660576419472",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to learn with very reasonable rates. The employees seem to be understanding of beginners and I didn’t feel judged when I fell trying to get off the chairlift. The rentals are phenomenal: very fast to get you sized and no shortage of any equipment or sizes.",
   "Best first time experience ever! I was so terrified! But my Ski instructor and the people who were there was extremely helpful! They were do nice from even helping me put my ski gear on! I would go back and take my kids there too!",
   "Wonderful mountain for families and beginners, or if you haven't skied in a long time and need a less intimidating place to get back into the groove. Or if you just want to be outside and get some runs in! Note that more intermediate to advanced skiers will likely feel this mountain is much too small. Reasonably priced given that it's a small mountain.",
   "Really small ski resort that is great for absolute beginners. If you want to take your child skiing/riding and they are first time beginners, this is the place! There is a very short and not steep \"bunny\" hill with a very short magic carpet/surface lift. It is perfect for a beginner to ride the carpet, and point their skis down the hill. It is not long enough or steep enough for them to pick up any real speed so it's perfect for learning the basics. I wouldn't recommend it for adults who want to learn snowboarding, because the bunny hill really isn't big enough for an adult to pick up snowboard. Go to a mountain with a regular size bunny hill for that. But it's perfect for kids! Then there are 2 chair lifts that access green trails.  The shorter chair lift (1) is great for beginners. And chair 2, which is longer, also can take you to some green trails, and some short/easy blue trails.",
   "It is an amazing place!! My friend and I went snow tubing a few days ago. The guys were nice and they were overall fun and funny. I recommend this place to a lot of people. And I promised one of the guys a review. Sooo here u go. And I got to get him pour a shovel of snow on my friend. He missed and she laughed. I love this place and keep it like it is and it will be the perfect place!!!!!"
  ]
 },
 {
  "name": "Reid State Park",
  "address": "375 Seguinland Rd, Georgetown, ME 04548, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/094e1ce2-932e-11ea-ad60-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=17281910660316716264",
  "source": "GoogleMaps",
  "reviews": [
   "Such a beautiful fun space to admire the ocean. Plenty of parking. There is an outhouse available during this time of year. Many trails, BBQ grills, picnic tables. Beautiful Rocky coast line on one side and a large beach on the other side",
   "I love it here. The surf is nice, the changing rooms are clean their is a small lagoon where the water is warmer. You have a choice of 2 beaches. The only drawback is the day I went there was a lot of gulls.",
   "It has a beautiful beach. Usually not very crowded! Some nice big easy rocks to climb. A few sea ducks and loons to watch. Also an occasional surfer!!",
   "Absolutely beautiful all year round. One of my favorite 'winter wonderlands' to hike. Obviously gorgeous in summer, I'd urge you to hike it on a winter day.",
   "Too beautiful! Big gorgeous beach and stunning views of the sea from the rocks. Lots of beautiful rock formations as well. Great bathrooms and picnic areas. Lots of biting flies though, which I am not familiar with bring from out of state!"
  ]
 },
 {
  "name": "Basilica of Saints Peter and Paul",
  "address": "122 Ash St, Lewiston, ME 04240, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/09a3b864-932e-11ea-b192-14b31f159f22.png",
  "tags": [
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=10107718778682369673",
  "source": "GoogleMaps",
  "reviews": [
   "WOW! This church is HUGE. It is easily seen from Auburn into Lewiston. Once one walks to it, the size of the Church dwarfs even the tallest person. The most ornate stone work is in the front of the building, the original church was made out of Bricks and is attached to the stone church at the back. (Please see photos, it will make sense then.) The beautiful stone work portion has a 'plaque' of the date of completion. The Brick Church at the back has a late 1800 date above the door. It was really nice to walk from Auburn to Lewiston, it got my kid off the video games for a few hours. We even found a little store on the way back to buy drinks and a comic store as we were taking our time and debating if we should go the the memorial park. Good time and I hope to do it again!",
   "A beautiful place.  2nd largest in New England, begun build in 30s. Pipe organ sounds great! Check online schedule for free performances.",
   "Just like any other Catholic Church. However the priest does have a very caring attitude.  Very friendly. He also has a flair for putting on a show in his entrance.",
   "Praise God for this beautiful Cathedral that is vibrant in faith and holiness!",
   "I've looked all over for a church that offers the Tridentine Latin Mass, and this beautiful basilica offers the Latin at 8:30 am every Sunday according to their website. The Catholic churches in my area do not offer the sacred and traditional Latin Mass, which, the embrace of traditionalism will be the future of Roman Catholicism come hell or high water. Beautiful place of worship."
  ]
 },
 {
  "name": "Historic Hallowell",
  "address": "1 Winthrop St, Hallowell, ME 04347, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0a05b038-932e-11ea-a4b4-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7342142916304646290",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "South End Park",
  "address": "347-399 Washington St, Bath, ME 04530, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0a553140-932e-11ea-b967-14b31f159f22.png",
  "tags": [
   "pets",
   "field",
   "pets",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9793792223539752588",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful. My dogs had a blast. First time ever that my dogs got in the water and even retrieved balls and sticks. We will be back again!",
   "Best place to bring your dog summer or winter. Great people great dogs great land amazing park",
   "Nice views along the Kennebec river.  Lots of dog owners giving their pets some running around space. Stroll around or relax on the pier. Enjoyed both. I'll add some photos shortly....... hope you like the pics.",
   "Best dog park in Maine. Huge field and borders the river so your dog can take a swim to cool off. Friendly people and their pets. All sizes welcome. Doggie poop bags, water fountain, benches, human bathroom and a great view all available. 💖",
   "South End Dog Park in Bath, Maine is one of our favorite places. Fully fenced in on three sides and the ocean adding it's own kind of fencing make it good safe fun.\nThere is a nice path circling the park for walking while the pups run and play and a big pier with benches to sit and watch the water too. A circulating fountain provides fresh water and there are bags for clean up and waste collection containers too. \nIt has it all and makes a walk, bark, run or frolic in the park something both you and your dog will both enjoy!"
  ]
 },
 {
  "name": "Cellardoor Winery",
  "address": "367 Youngtown Rd, Lincolnville, ME 04849, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0aa96d5a-932e-11ea-afe8-14b31f159f22.png",
  "tags": [
   "tasting",
   "winery",
   "tasting",
   "food",
   "tasting",
   "delicious",
   "knowledgeable",
   "tasting",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13569890101783578004",
  "source": "GoogleMaps",
  "reviews": [
   "What a great place.  The view is remarkable, the wine selection is by far the best in the area, and the people are extremely friendly.  We had a great morning tasting and left with a great assortment of our favorites.  Absolutely worth the trip.",
   "Outstanding establishment! This winery is definitely off the beaten path but well worth the visit. The tasting area is rustic and gorgeous. There is also a nice patio overlooking the vineyard and the rolling Maine hills off in the distance. The tastings are mostly complimentary and prices for food and additional glasses of wine are quite reasonable. I would highly recommend a visit here!",
   "Great atmosphere with a great view overlooking there vineyard. Fell in love with there sweetheart wine during a tasting",
   "We had so much fun at our tasting!! Staff were fun and knowledgeable and the wines were delicious. Ended up buying, ahem, lots.",
   "Beautiful place. Views are amazing, waking and sitting in the vineyards was great. Wine selection for tasting was limited could have a bigger selection."
  ]
 },
 {
  "name": "Pemaquid Point Lighthouse",
  "address": "Bristol, ME 04554, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0aee18a8-932e-11ea-9d72-14b31f159f22.png",
  "tags": [
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14501166405752735470",
  "source": "GoogleMaps",
  "reviews": [
   "Off season so we had the place all to ourselves. And no charge to visit during the winter.",
   "Beautiful place to enjoy Maine. There is a parking lot that has about 30 spots and there is a beautiful lighthouse overlooking the Atlantic. There are some benches and a rocky overlay to enjoy the view. This is a beautiful northeast experience and well worth the trip. The drive isn’t too far away from the city and you will drive through some neighborhoods to get there. Great stop if you are driving up to Acadia from Portland! You’ll be able to see the lighthouse at night lit up!",
   "Been coming to pemaquid point since my childhood. Many fond family memories.",
   "Breathtaking views of the ocean. Well worth the drive down the peninsula.",
   "Nice rocks, and a lot of history."
  ]
 },
 {
  "name": "The Camden Snow Bowl",
  "address": "20 Barnestown Rd, Camden, ME 04843, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0b3eab14-932e-11ea-b784-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11774111055469917773",
  "source": "GoogleMaps",
  "reviews": [
   "The snow bowl is a great place in the winter for skiing as well as summer time for hiking/biking. They have lots of different types of trails and have such friendly staff. They also have different events here that are super fun. They have a little pond that you can go swimming at or bring a canoe on. Swimming isn't the best but it is a spot you could jump into. The directors here are amazing people and do good things for the community. All around, it is a really good place.",
   "Small little family ski place over looking Penobscot Bay. Simple slopes and quick runs, but lots of fun kids and adults.",
   "It's a blast. Food trucks, beer tents and good old fashioned Maine weather and socializing.\nGood times",
   "Nice free pump track for all bicycles. We had fun, bring bug repellant in summer.",
   "Climate change is having a big effect on this friendly ski area.  Christmas week skiing very limited.  Still has a well run personal feel to it. Great little family hill."
  ]
 },
 {
  "name": "Harbor Park",
  "address": "1 Pleasant St, Rockland, ME 04841, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0b8a0d7e-932e-11ea-9463-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "family",
   "walk",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6254821591542480756",
  "source": "GoogleMaps",
  "reviews": [
   "AMAZING VIEW! I love going here with my family and looking out on the ocean. If your looking for some relaxation I definitely recommend coming here.",
   "We visited Harbor Park for Lobster festival and we had a good experience. The people and the vendors were very nice. The pirates that were performing were awesome with the kids and the parents. There was a little of everything for the family. The price on the lobster was a little too much for us and ended up eating at a nearby place called Eclipse who had a really good deal on lobster specials. Overall, Harbor Park was a nice park and wouldn’t mind coming back but doubtful because we live pretty far from it.",
   "Came to see the lobster trap Christmas tree, great fun! Nice walk on the boardwalk and beach as well. Nice and quiet due to it being off season.",
   "This is a nice little park located right next to the harbor (obvi). It is on a hill and has a big flat area as well. This is where lots of events like the Lobster Festival and Blues Festival happen.",
   "One of the best settings for a live music festival I have ever experienced!"
  ]
 },
 {
  "name": "Portland Head Lighthouse",
  "address": "12 Captain Strout Cir, Cape Elizabeth, ME 04107, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0be7232c-932e-11ea-95f7-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "free",
   "kids",
   "family",
   "history",
   "food",
   "kids",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12704858849280520255",
  "source": "GoogleMaps",
  "reviews": [
   "Portland Head Lighthouse is one of the best in the world and the park adjacent to it is awesome with amazing views of the rocky coast and Atlantic Ocean. This is a great spot for a family picnic. Bring your dogs and walk the trails. Explore Fort Williams, a WWII era fort, that is next door. Also, check out the stone remains of the Goddard Mansion. The trails are mostly paved with some inclines and declines that are achievable for most. There is also a beach area. Parking is free in some spots and metered in some of the prime locations. Kite flying is popular on windy days.",
   "A summertime staple but equally delightful to visit during early parts of spring/late winter. You are bound to get great photos with minimal crowd and a lot of quality time watching the waves crash by. The drive through I-95 is totally worth your while. Also there’s ample parking spots if you are even wondering about it. There’s a lot of open space to actually camp around which I believe is what happens during the summer.",
   "Portland Head Lighthouse Is A Beautiful Place. Me And My Family Enjoy Going There A lot. They Have one Food-truck In The summer. My Family Loves The Lobster Rolls At The Food Truck On The Other Side Of The Park. This Place Is A Good Park Afro Kids And teens. There’s A lot Of history There. It’s A Good Park To Explore. I Highly Recommend It For Explorers 🧭. but That’s My Review For Portland Head Lighthouse",
   "Excellent park.  Lots of nice walking oaths and places to picnic with your family and friends.  The lighthouse is beautiful and there are great views of the ocean.  Lots of parking was available.  The kids enjoyed exploring the fort.",
   "My wife and I went in October, which was a perfect time. This Lighthouse is said to be the most photographed sight in the world, with the fog it was surreal. This is an absolute must see, then head to town and get your fill on very inexpensive Lobster."
  ]
 },
 {
  "name": "Farnsworth Art Museum",
  "address": "16 Museum St, Rockland, ME 04841, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0c39b182-932e-11ea-912f-14b31f159f22.png",
  "tags": [
   "art",
   "walk",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=6067560624680803952",
  "source": "GoogleMaps",
  "reviews": [
   "Whenever I come here I am always delighted in the variety of exhibits and the range of talent. Hours fly by here if you want to appreciate art.",
   "This museum is highly recommended to be visited. There is a great selection of the artworks dedicated to Maine. The stuff is very friendly and helpful.",
   "Farnsworth Art Museum has always been one of the best art Museums in the area. They offer a variety of different art pieces as well as a great presentation when you walk in and when you walk out. The gift shop is pretty fantastic and offers a lot of different items in it as well. The service is alright, sometimes unenthusiastic but for the most part it isn't too bad. If you are in town, this is certainly a place to visit.",
   "A very nice collection.  It is not large, but we'll worth the time.  Took us about an hour to cover all three floors.",
   "Good museum, very Maine-centric. Lots of works by Andrew Wyeth of course, but many interesting exhibitions on the calendar... Definitely worth going to if you’re in town and interested in art. It’s in an older building so the layout can be less than straightforward, make sure you get a map and use it so you don’t miss anything! The gift shop is nice and accessible from the street without having to pay the museum admission."
  ]
 },
 {
  "name": "Auburn Recreation Parks Department",
  "address": "48 Pettengill Park, Auburn, ME 04210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0c847774-932e-11ea-a7bd-14b31f159f22.png",
  "tags": [
   "walk",
   "pets",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15950919657046986412",
  "source": "GoogleMaps",
  "reviews": [
   "Great programs for the children and they are always willing to work some arrangements on the cost of the activities.. my children have been able to participate as a team member because they made it possible.. they also do many holiday events check there website or follow there Facebook..",
   "Nice little park.  There are tables,  swings, a porta potty and even some water with ducks swimming.  Pets are not allowed on the athletic fields but there are paths here to walk on and trash cans to dispose of your trash.",
   "Great little playground for the kids to burn a little energy lots of open space to run too. There is also 4 basketball courts.",
   "Awesome 👍👍😊😊 great place and activities for kids",
   "Nice area to enjoy relaxed time"
  ]
 },
 {
  "name": "Wolfe's Neck Woods State Park",
  "address": "426 Wolfe's Neck Rd, Freeport, ME 04032, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ce021b6-932e-11ea-936c-14b31f159f22.png",
  "tags": [
   "family",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=13863618626868660252",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful group of trails not too far off the beaten path. Just minutes from the bustle of Freeport shopping you can find some wilderness solitude. Trails are ready to access in all seasons and well maintained. All the trails are easy and short but offer beautiful views. There are many programs available to new and experienced hikers alike, including group hikes and winter gear try-outs so it's a good location to get your Maine outdoor adventure habit started.",
   "I was up in Brownfield by myself for the weekend and didn't want to waste a beautiful February day. Busted out my Maine Atlas in search of a little adventure not roo far away. I was rewarded with my  choice. Great scenery, easy to follow trails, more than enough directions to go to occupy a few hours.\nI'll definitely be back in the Spring and Summer with the family, or maybe just the dogs.",
   "Nice forest trails with views of the bay maybe a mile and a half to two miles on the outer loop.  Nothing terribly technical but good boots and wherewithal are recommended.  In the winter cleats would not be remiss.",
   "Always so breathtaking. It is God's place. Take your time, take in the ocean air and the views!! Stay a while and breathe. Year round.  Breathtaking beautiful.",
   "Wolfe’s Neck is such a lovely state park. There aren’t many facilities like camping or amenities such as organized tours at this park which helps it, I think, to keep a feeling of being authentically wild and serene. Though there are nicely maintained pathways and of course signage, it is a maintained state park. But I guess what I’m trying to say is that if you want to feel like you’re really experiencing the land here, you can. The couple who bought the property and gifted it to the state, mandated that it would always be the way it is and would stay pristine. That shows! I really loved my visit and wish I could have stayed all day."
  ]
 },
 {
  "name": "Barrett Park",
  "address": "131 Lobster Cove Rd, Boothbay Harbor, ME 04538, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0d2e1aba-932e-11ea-9e0a-14b31f159f22.png",
  "tags": [
   "pets",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17018528352730465012",
  "source": "GoogleMaps",
  "reviews": [
   "A small park, but easy to get to and has some nice views. There is a lot of fishing equipment stored there, so just be watchful when bringing pets or children. No playground area, just a bit of woods, beach, and a cliff with a view.",
   "No winter bathrooms, but very scenic and peaceful.  Came on the rising tide, so it was fun seeing the changes on the shoreline.  If only it wasn't so cold and windy!",
   "Not sandy, no waves, not peaceful or quiet...more like a lake but great for kids. Rocky.",
   "So beautiful and clean! Beach is perfect for kids, lots of fun animals in the water. Water is also SUPER clear.",
   "Beautiful, beautiful, beautiful! Enjoy both high and low tides! Clay to play with during low tide, and adventuring!"
  ]
 },
 {
  "name": "Owls Head Transportation Museum",
  "address": "117 Museum St, Owls Head, ME 04854, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0d805ae4-932e-11ea-af69-14b31f159f22.png",
  "tags": [
   "music",
   "unique",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1540344842091604918",
  "source": "GoogleMaps",
  "reviews": [
   "If your  in the area visiting this museum  is a must do. They honor veterans  and your paid admission  is actually  a charitable  donation  that you get a tax voucher. But the best part of this museum is the contents and the caretakers. The presentation is neet and professional.  And we even got a ride in a vintage model t.",
   "Great place to bring your children to teach them about the evolution of transportation. By far the best display of vintage cars and planes I've seen yet. Very enjoyable!",
   "Owls Head Transportation Museum is a great automotive museum for people to come and visit. They have tons of vehicles of all different shapes and sizes as well as decent prices for the type of museum you are at. The gift shop is small but has some nice little gifts in it however these prices do tend to be on the higher side. The transportation museum does more than offer a place to view different automobiles but they offer different events that are very interesting for locals and tourist. They some times will have live music events as well as different demonstrations of vehicles. When I was younger I attended a plane show as well as different bikes being shown. The presentation of the museum is great as well as the customer service. The parking is large and has easy access in and out of the museum. The location is just on the outskirts of Rockland which is difficult if you don't have transportation but that isn't usually a problem. Overall a great museum to come to visit even if you aren't into automobiles. If you ask questions I am sure you can get an answer as well as being educated on something new.",
   "Such a good place to take the kids. Thay have so many unique vehicles to see",
   "This is a great place but the admission is really high. Was a member 4 a year and a half, so I got to see most of the stuff. Truck n tractor is the best show in my opinion."
  ]
 },
 {
  "name": "Pemaquid Beach",
  "address": "Pemaquid Beach Park, New Harbor, ME 04554, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0dd0173e-932e-11ea-b480-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5640086097984548200",
  "source": "GoogleMaps",
  "reviews": [
   "Quiant beach, powdered sand, embanked by explorable rocky coastline.  Family friendly bikeable roads with historical sites, light house, ice cream, restaurants, and New England living the way it used to be.",
   "Really great, sandy beach with easy access and great facilities. Free after 5pm!",
   "Lots of families enjoying the beautiful beach weather and the clean sparkling water makes this a good kid friendly beach.\n Snack bar is available as well as a rinse off station to get the beach sand off before you head back to the car and they even rent beach umbrellas if you forgot yours.",
   "We loved this beach. Plenty of parking which is rare for Maine. The beach and other areas are very clean. The ocean is beautiful. Be careful of the seagulls because they will go into your bags and steal food. One flew off with our bag of cookies.",
   "Such a beautiful, scenic, out-of-the-way gem."
  ]
 },
 {
  "name": "Colonial Pemaquid State Historic Site",
  "address": "Colonial Pemaquid Dr, New Harbor, ME 04554, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0e2197d4-932e-11ea-a618-14b31f159f22.png",
  "tags": [
   "history",
   "knowledgeable",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=1374818143795147993",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit. Beautiful views. Lots of history. I'll definitely be going again.",
   "Fort William Henry is one of the oldest British forts in North America.  Add to that the nearby archeological digs and one of the best regional restaurants (The Contented Sole)... Not to mention some spectacular views and nearby beaches and you'll want to make a day of it here. Or, perhaps a week or three.",
   "Saw the fort and a hand made house from the time period. The park rangers(?) Were extremely knowledgeable. And if the person who is in time period appropriate clothing,  please talk to him,  because he is amazing in knowledge and skill.",
   "Native Americans used this land lo h before Europeans. Great area to visit",
   "Love the lighthouses of the east coast...this is one of my favorites. And the State Historic Site is a bonus with it’s ruins and old cemetery. I even found a Geocache there, quite unexpected. Nice place to visit, I would recommend going there"
  ]
 },
 {
  "name": "Maine Lighthouse Museum",
  "address": "1 Park Dr, Rockland, ME 04841, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0e8da21c-932e-11ea-8802-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2283584492353370841",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing collection of fresnel lenses. Lots of great exhibits.",
   "Here you'll  find the largest collection of lighthouse and maritime artifacts available under one roof. Many of the artifacts were purchased by Ken \"Mr Lighthouse\" Black prior to his death. The modest gift shop has an assortment of items sure to please. The Maine Lighthouse Museum MUST BE on the bucket list of any and every lighthouse enthusiast.",
   "the museum had a lot of very interesting pieces. Many fresnel lenses and lights which are always great. There is a lot of historical information as well. we really enjoyed it. they had a separate section on women in Lighthouse history and a small section on the u. s. Coast Guard.",
   "Really neat lighthouse museum highlighting their design, history, technology, key figures with attention to local and regional history. ",
   "If your interested in ATON's , this place has a great collection and USCG exhibits, all collected by one man..."
  ]
 },
 {
  "name": "Boothbay Harbor Maine Puffin Cruises",
  "address": "44 Commercial St, Boothbay Harbor, ME 04538, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0ef0361c-932e-11ea-91f4-14b31f159f22.png",
  "tags": [
   "unique",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=10145687734188675846",
  "source": "GoogleMaps",
  "reviews": [
   "Went on the coastal cruise, seal watch, lobster industry and livelyhood unique to Maine.  Absolutely loved experiencing the coast and ocean scenery. Amazing. My first time to Maine.",
   "We did the puffin cruise for my nerd bird!  Very knowledgeable staff!  Clean boat, bar on board, and puffins!  Great afternoon!  Do suggest binoculars or zoom camera for best views.  We were surprised how small and fast the puffins were!",
   "Beautiful n scenic. Took a boat ride to cabbage island! Great ride n enjoyed meal!! Downeast clambake! 😋",
   "Nice harbor very pretty",
   "Great local cruise. Extremely knowledgeable captain that constantly brought the sites to our attention or talked about marine fun facts. I would highly recommend the cruise."
  ]
 },
 {
  "name": "Sabbathday Lake Shaker Village",
  "address": "707 Shaker Rd, New Gloucester, ME 04260, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0f41b31a-932e-11ea-8450-14b31f159f22.png",
  "tags": [
   "active",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2572601980387692017",
  "source": "GoogleMaps",
  "reviews": [
   "I finally made it to the Shaker Christmas Fair and it was so very worth it! So many treasures from baked good to Shaker crafts and gorgeous wool!\nI won't miss this fair again.",
   "Take a step back in time!! This is a beautiful place! They have a wonderful store to buy their handmade items, farm animals for your viewing and petting pleasure and they offer the best classes!! You have to visit at least once...if you do, you'll definitely go back!",
   "Sabbathday Lake offers an authentic look into the last active Shaker community in the world.  The Shakers are a fascinating denomination. There is lots to be learned about the Shaker way of life and history here. We took the tour and our guide Don was informative and friendly. It was great to see some of the actual work and living spaces that The Shakers once used.  I was blown away by the blue paint used in the meeting house.  It was apparently made from a mixture which used blueberries as the color.  I can’t remember the exact date, but I’m pretty sure it was applied over 200 years ago! It still looked great, Benjamin Moore should try tapping into that formula.",
   "Good place for information on their way of life. Store has locally produced goods.",
   "Love the history of the Shakers. Great tours!"
  ]
 },
 {
  "name": "Bowdoin College Museum of Art",
  "address": "245 Maine St, Brunswick, ME 04011, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0f859af8-932e-11ea-be06-14b31f159f22.png",
  "tags": [
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9542893197325339469",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent free museum, recently modernized filling a philanthropic influx. Cleverly curated and arranged pieces. Quiet and peaceful. Really impressive part of campus.",
   "Nice small museum.  Lovely rotunda. Also stopped at the Arctic Museum. Nice collection of artifacts of the trip to the North  Pole.",
   "Nice collection of local Maine history and fabulous Assyrian reliefs.",
   "Great museum. Well worth a visit.",
   "Some very cool stuff here, the biggest downside is it's small and kind of stuffy."
  ]
 },
 {
  "name": "Beaver Park",
  "address": "Pinewoods Rd, Lisbon, ME 04250, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/0fd3203e-932e-11ea-b90b-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12110330181589048224",
  "source": "GoogleMaps",
  "reviews": [
   "Beaver Park was the first park I brought my daughter too when we moved to Maine 4 years ago and it continues to be a staple for outings and a favorite.\n\nThere are hiking trails located throughout the whole park, some have workout equipment located at the trailhead. Multiple spots around the lakes so you can find your perfect spot. Dogs are allowed in some places as long as they stay leashed. You can also go fishing any spot you find cozy. Don't forget you need a license and they have a 2 fish maximum. \n\nThe main area has a nice playground, with swings. A nice little beach that goes slowly into the water, perfect for littles. There are plenty of grills and picnic tables to go around. There are outhouses located around the park and one is right by the main area. There is also a changing building located in the main area as well.\n\nThe fee is $2 a day or you can buy an annual pass as well. I don't remember the exact cost, but it is cheaper if you're a resident of Lisbon/Lisbon Falls. You can buy the pass at the Town Hall in Lisbon.",
   "Very nice trails... Lots of wildlife to observe.  Great place to go birding. I also run the trails.",
   "This is a beautiful peaceful park. It has three ponds and lovely trails. Great for hiking, dog walking and \"forest bathing\".",
   "THIS IS MY NEW HAPPY PLACEEE ",
   "Very nice 👌"
  ]
 },
 {
  "name": "Desert of Maine",
  "address": "95 Desert Rd, Freeport, ME 04032, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10300102-932e-11ea-9b4d-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "tour",
   "nature",
   "tour",
   "kids",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14208195128294733185",
  "source": "GoogleMaps",
  "reviews": [
   "Exploring a Desert on a very sunny day. Taking my shirt off, going to get sunburnt today. Oh well. The Desert Of Maine is location in Freeport Maine. This used to be a tourist trap. But Now this place is under new management. So now you can do a self guided tours. It’s 10$ a person, and you can walk all around this desert. It’s totally a beautiful place. Everyone should go check it out.",
   "Fascinating experience! This takes an hour or two to get a guided tour of the dunes and then walk through the nature trail. Whether your interest is historical, geological, or you just need something to do for a short time, it's a great place to check out!",
   "The grounds are beautifully natural.  I brought my 3 children ages 3-9 and they loved it.  Starting with the natural playground, we found a nice picnic table to enjoy lunch in the shade.  Our tour guide Thomas was fantastic.  Great with the group in keeping the information short and sweet along with humor!\nHe led the kids to the best spot to search for gemstones which they enjoyed the most!\nA great experience.  We will be back!!",
   "Very cool. We were looking for a place to camp for the night and arrived at dusk. They were closed for the winter. There was a sign that said it was fine to stay and or look around, but please leave a donation. We had no idea where we were and it was too early for bed so we explored. It was well into dark  when we got back to the truck. We had alot of fun using a flashlight doing our little self tour. I would recommend it as a fun stop, especially with kids.",
   "We absolutely adored traveling to and staying at the Desert of Maine. The grounds were well kept, tenting area spaces were spacious and comfortable, bathrooms excellent and the desert is absolutely beautiful. I would highly recommend this as a weekend outing to anyone interested in having a fun, wholesome weekend with loved ones!"
  ]
 },
 {
  "name": "The Oak Table and Bar",
  "address": "233 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/107fd030-932e-11ea-9856-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "unique",
   "approachable",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15685240608226528108",
  "source": "GoogleMaps",
  "reviews": [
   "until the Oak Table opened up, there weren't any places in the area that could honestly be described as providing an upscale culinary experience.  We tried many items from the menu and were very pleased. Dining here was truly an event. The decor lacks nothing, and it is an unpretentious atmosphere. Thank you!",
   "Fantastic food, and great conversation with the owners. Will definitely be back!",
   "We shared the chef's table. What a terrific dining experience. Wonderful foods that were expertly prepared before us. Everything was delicious.  A truly unique and exquisite dining experience. Wow!",
   "Love this place! Do yourself a favor and go have an amazing food experience unlike anything you’ll find in the Augusta/Hallowell area. Try any of the unique craft cocktails Kyle mixes up and know that any of Eli’s dishes are sure to leave you satisfied and delighted. Very fun, very approachable, and very much a treasure in our humble city. Cheers!",
   "Up and coming resturant, Augusta needs more of these.  Food was fantastic!  Wine was also, but a bit pricey."
  ]
 },
 {
  "name": "Otto's on the River",
  "address": "287 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/10bc64ec-932e-11ea-958c-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16239662218127578061",
  "source": "GoogleMaps",
  "reviews": [
   "We happened to visit Otto's on a Saturday night during a snowstorm and, amazingly, had the place nearly to ourselves so the atmosphere was nice and quiet and service was very quick. The food was good, I had the Marsala which had incredible flavor. My husband had the seafood chowder, which he said was good but could've used a bit more seafood. Bread, salad and dessert were all fantastic. Will definitely return.",
   "A delightful lunch. As we were traveling through the area we chose to get off of 95 to try a non chain restaurant.  Orton's was great. Unique decor, and an interesting riverfront area.  Public parking lot was ample.",
   "Came here for date night (July 2019). Bacon wrapped scallops were good; bacon a little over cooked though. I got seafood stuffed haddock; yum! We had a good experience, however it wasn’t “amazing”.",
   "If you want to have a phenomenal dining experience unbelievably fabulous food, try this place! Otto's on the River is amazing! From start to finish I could not stop raving about everything! Great service too 🙂 My new favorite spot.",
   "The decor is lovely and our waitress was very nice and efficient.   Unfortunately,  our food was just okay.  The blueberry walnut salad sounded great, but was served too cold and was almost tasteless.   The chicken cordon bleu was undercooked, and the restaurant was kind enough to cook it more and to comp it.  However,  the reheated serving was also not palatable. \n\nI wish that I could recommend this restaurant--we really wanted to like it and to be \"wowed.\""
  ]
 },
 {
  "name": "Riverfront Barbeque & Grille",
  "address": "300 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/110e7e0c-932e-11ea-8569-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "music",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13256140490498920819",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere, great music playing at a reasonable volume so we could still have conversation. The waiter was awesome. None of that weird fake talk, and he was business only, very knowledgeable, no chit-chat. The food was good, and the peach iced tea was exactly right. We will be going back again!",
   "My family and I went in for lunch today. Everything was delicious. Do yourself a favor and start your dinner with the pickled onion rings! I've also been to several events that were catered by Riverside. Their buffet style catering is just as fantastic as eating in. If you're looking for good barbeque in central Maine, look no further.",
   "Riverfront barbecue always comes through for me when I need catering or I need event space. Their food is really good and their owner Patrick cares about people. This is the only real barbecue place in town and I know they take pride in smoking their meats. Their prices are very good and the corn bread is the best I’ve ever had! I’m always happy when we get to go to Riverfront barbecue downtown. A staple restaurant in Augusta",
   "It has a quiet cozy feel with friendly staff. Just be careful on what you order as portion sizes can vary based on what you get. For example my burger and fries was worth the price, but my dates steak was a joking point for a few days.",
   "Nice little place that has good BBQ and dynamite corn bread.\n\nThe bar and tables are dark rich wood adding a touch of old world class to the place. \n\nBeer selection is a bit light but there is variety.\n\nIf I end up back in Maine I will stop by again"
  ]
 },
 {
  "name": "Red Curry",
  "address": "179 Mt Vernon Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1162ba2c-932e-11ea-97c4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "tour",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4398908769920330043",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious delicious delicious. The business is ran by a couple friends with my father. They are extremely polite and kind. I have never had one complaint.",
   "Cute vibes, friendly service and soooo good food :) Wonderful way to have spent my birthday (▰˘◡˘▰)",
   "Really unexpected gem!! In town for work and saw the good reviews. When we walked in we started having second thoughts. But the service was so amazing and friendly and the food was INCREDIBLE!! I highly recommend this place to anyone and everyone! Delicious authentic food!",
   "Having just returned from A two week tour of Bangkok its wonderful to have this little jem of a restaurant in our area.. some dishes are the same as i had in Thailand very good..",
   "This place seems to be pretty vegetarian friendly. Their \"crab\" Rangoon contains shaved carrots instead of crab. Their Pad Thai was sweet and savory. The Massaman curry was light and nothing was overcooked. The presentation was well executed. The Boba tea was refreshing and the tapioca balls were properly cooked- which is VERY important as improperly cooked is poisonous via its natural cyanide!! So don't eat the pearls unless they are chewy..."
  ]
 },
 {
  "name": "Sandy Point Seafood",
  "address": "146 Mt Vernon Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/11ac207a-932e-11ea-a604-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11854256864812967958",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent, fresh fried haddock. Huge portions at a great price. The fish tacos are a popular item among my friends, too. They are also always very helpful if I call and want to pick up lunch: they time it so it comes out hot and doesn't sit around waiting for me to pick up. Highly recommend!",
   "Red Barn has real competition! The staff was friendly and the service was quick. I ordered the Chipotle Shrimp Salad; the amount of shrimp was generous, the vegetables were fresh, and the price was very reasonable. While I waited for my food, a woman stood in line just to tell the staff it was the best meal she had on her trip, and it's easy to see why!",
   "Excellent seafood-whether fresh or fried! The problem  is you never know when open for even take out! Website says open, but you go there like I did today and it’s closed! I even called to see why and no one answered and mailbox full. During the Covid-19 people are being very flexible and understanding but no notice to your loyal customers is really unacceptable.",
   "Awesome place locally to get seafood. Prices are best in town. Got 3 lbs of shucked lobster meat for Christmas stew. 1 tiny Shell in whole batch. Picked fresh and was still warm when I picked up. Saved $30.00 over competitors.",
   "This FRIED HADDOCK lunch plate was absolutely phenomenal. There was 3 adults including myself. We are all over 6feet yall with very health appetites, and this 1 plate went around 3ways and we were alllll super full and super satisfied. \nWe also picked up 10 lobsters for dinner later that night. This place did not disappoint at all. Being from the south, visiting Maine my expectations for food were very very complex. I know good food, and I love love love fresh seafood, and I'm a sucker for great customer service. Everything about this place was perfect🤗🤗👌👏👏👏👏"
  ]
 },
 {
  "name": "99 Restaurants",
  "address": "281 Civic Center Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/11f5adf4-932e-11ea-af67-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "affordable",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9144525743548171863",
  "source": "GoogleMaps",
  "reviews": [
   "Phenomenal customer service. Great humor excellent appetizers. Fantastic for catching up after work or even bringing the whole family!",
   "I had the prime rib quesadilla. It was delicious!",
   "Great place for a home cooked meal in a hurry.  The servers are very attentive and eager to please!  Prices are affordable too especially if you join their e-club to get discount coupons!",
   "Service was great, drinks good, music in the restaurant was surprisingly good! That's where it stops though. Ordered steak tips MR and they came out all sorts of temps from VERY WD all the way down to rare and the taste was lacking. Came in after about 8 years after having a bad meal and not sure I'll be back. 3 stars is because of the server we got. She was great and could tell I wasn't thrilled with the food but I just didn't want to complain.",
   "Great food and great prices. Service was good too. Spacious and clean inside. Loved eating here, though I probably over ate the food was so good."
  ]
 },
 {
  "name": "Kume",
  "address": "19 Stephen King Dr #1, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/123e7810-932e-11ea-b0ea-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "free",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9441273807435118501",
  "source": "GoogleMaps",
  "reviews": [
   "What a great spot and it was really great service and food. Everything was fresh and well cooked.  We got lucky and were seated close to the large aquarium.  I was surprised how elegant the plates were dressed with our food. I ended up doing a steak dish that was so tender and tasty.  Parking is good and easy to find.",
   "We have tried this place a couple times now. We find the hibachi to be much better atmosphere and food than the dine in side. Sushi is a little better than average and they do have very unique rolls. Something about the chicken there every time I try it, it does not taste good. They do accommodate gluten free diets very well. The hibachi chefs put on quite the show each time whether it's just two people or a full table you'll still get the experience.",
   "Great variety in rolls and drink specials from their full bar. The staff was kind and attentive throughout most of my dining experience. The sushi rolls were prepared with care and fresh ingredients. Couldn't be happier with my visit and can't wait to return!",
   "Had the pork dumpling soup, Toro and a Pink Lady Roll. Soup depth of flavor was stupendous, I liked the addition of the veggies, dumplings were on par. The roll was excellent, all ingredients fresh.",
   "Ordered take out online and received email with a pickup time. We arrived and waited 40 past the time and never got out food."
  ]
 },
 {
  "name": "Cloud 9 Restaurant",
  "address": "284 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/128b8802-932e-11ea-b43f-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6052748016270317359",
  "source": "GoogleMaps",
  "reviews": [
   "The food wasn't too bad, calamari was a bit chewy but otherwise delicious. The steak was cooked wonderful but the asparagus was undercooked and still very crunchy, they offered to switch it out but I didn't like any of the other dishes they had. They say us in the very back of the restaurant where there was one other family with a very rambunctious child, kind of ruined date night. Otherwise not bad.",
   "This is my absolute favorite restaurant. We come up to Maine every summer and always look forward to going out to dinner here. The food is amazing, they have a very nice salad and bread bar as well as lobster. The service is also exceptional! This restaurant deserves over 5 stars.",
   "The Sunday Brunch buffet, although quite pricey for my husband and I, is very delicious. Lots of choices already made up or have an omelette made to order. Very nice.",
   "The new pot stickers were fabulous, light and tender and beautiful, Oysters super fresh,  seafood medley great as always, honey soy and parmesan crusted scallops were both big hits. We ended happily with the chocolate mousse and triple berry meringue. It was quiet and the server was very pleasant and attentive. It was a very successful birthday dinner.",
   "My husband and I stayed at the Inn, he made it to breakfast first without me. The staff were very friendly and accommodating. Great sense of humor, I particularly enjoyed. Overall, breakfast was great thanks to the quality, staff, and ambiance."
  ]
 },
 {
  "name": "Rebecca's Place",
  "address": "434 Eastern Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/12ea99c2-932e-11ea-a641-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13784734380418667226",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent variety! Five of us had lunch and we all found something appealing. It all arrived faster than expected and we were all very satisfied. Even our two picky eaters were pleased! I had a soup and a BLT, both of which were exactly what I was hoping for--crispy, fresh-cooked, thick-cut bacon and a wholesome, well-rounded beef and barley soup. I highly recommend them for a casual sit-down!",
   "After an appointment at Togus VA Hospital, Rebecca's Place seemed a good choice for lunch. Even though the restaurant was busy and patrons seat themselves, we were promptly greeted and brought menus. Our orders were taken in a timely manner and our food served reasonably quickly. My friend chose a Taco Salad which she described as \"Yummy\" several times. My choice was Meat Loaf with mashed potatoes covered in gravy and pickled beets. The mashed potatoes were good, the pickled beets excellent but the meat loaf a bit dry and bland. Rebecca's also offers a nice assortment of baked items to take home, most of which looked good to me. Good food along with excellent service earn Rebecca's a solid four star rating.",
   "A 45-minute drive have breakfast I was really wonder if I would like the place from the time you walk in you see all of all the fresh baked pastries then you're able to seat yourself the waitress was really friendly the menu was quite expensive for breakfast the atmosphere is nice to have pictures of all the owners grade kids along the wall the restaurants been in business since 1976 and the food was absolutely incredible it was probably the best poached eggs I've ever had in my life the baked beans were good but not great my wife had a skillet the head egg whites and vegetables mixed in with a side order Canadian bacon it was well worth the $20 for the bill and definitely worth the 45-minute drive it took me and my wife 6 years to get there but it will not take 6 years to get back there I highly recommend this gem which is an out-of-the-way restaurant which is well worth the trip",
   "Nice home cooked /country food.\nKept clean and well decorated during holidays\nFresh baked goods served for dessert or bought to go up front\nFriendly and attentive staff\nGood first experience going & do reccomend",
   "Good food, very pleasant staff. I enjoyed everything I had except for the fries... they seemed overcooked. The fish chowder was exceptional!"
  ]
 },
 {
  "name": "Sweet Chilli Thai Restaurant",
  "address": "75 Airport Rd, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/132ef700-932e-11ea-b16d-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17398435549687551649",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent Thai food. They have a friendly cozy atmosphere. Would definitely recommend and will be returning soon. Their unique location allows you to watch planes land and takeoff. Definitely a hidden gem in Augusta.",
   "Awesome little restaurant. Delicious amazing food. Great place, excellent service.",
   "Great food! Little pricey though. I have been to of equal quality thai food little north and its more for less; other than that had good service and good food.",
   "Food was delicious! Adorable napkin flower. Good place for a date. Location is odd but totally worth the food. Got the pad thai, golden chicken, and veggie tempura. Unfortunately no sushi that night but it was the night before valentines day and we came in later in the evening. would recommend!",
   "Stopped here on a recommendation from a friend. They said I'd be thanking them later and they were right! I didn't have the time to dine in, just ordered to go, but while I waited for my food I found the atmosphere to be relaxing and clean and everyone was very nice. Will definitely dine in next time! Food was ready within 20 minutes.  When I made it home....well let me back up and be honest.... the fried tofu never made it home, I ate that on the way.  But when I got the chance to eat everything else it was also delicious! Chicken satay was cooked perfectly, veggie tempura was not over or under cooked (for my tastes anyway), and everything was  arranged nicely in the containers. No stray/weird hairs, crunchy bits where there shouldn't be any, or unappealing colors my brain had to try to explain away. I'll update my review once I go back for the dine in experience but for now 10/10 - highly recommend! It's my new favourite thai place. ;)"
  ]
 },
 {
  "name": "Margaritas Mexican Restaurant",
  "address": "390 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/138b706c-932e-11ea-8126-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "food",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8659878154716809085",
  "source": "GoogleMaps",
  "reviews": [
   "I have been a regular since the opening in the 90's when I lived in Belgrade and worked at NCFS.  The best shrimp fajitas!\n\nALWAYS on my list when I come back \"home\" to visit, usually accompanied by my \"tribe\" of 10 plus.  We are greeted by servers who are always accommodating, providing great service, with A LOT of patience; we an be a handful at times after being apart for a while (insert wink here). One of my favorite places in Augusta!",
   "Great food and quality service. Went out with the team from work for taco Tuesday and had a blast. Really enjoyed the pork soft tacos and the coconut lime margarita.",
   "Food was good, as usual but everything else about this visit was terrible.\n\nMy girlfriend and I sat in the lounge because the other side of the restaurant had a 20 minute wait and we were starving.  We sat ourselves as we were told.  It take between 10 and 15 minutes before we got a waitress come to our table.  we had one woman come to our table and give us chips.  another 5 or 10 minutes goes by and a different waitress comes over, hands us menus and said that she was going to serve us.  I told her we already had a waitress and she replied that she was moved to a different table.  we order our drinks.  My girlfriend got her soda within seconds. My alcoholic drink took close to ten minutes, I had to remind the waitress twice.  After about 20 minutes, I got my drink, which was terribly made, and she took our orders.\n\nTook close to 45 minutes to get our food.  I witnessed people who sat down after us get their food before us. I also saw 3 couples get up and leave. When we finally got our food it was delicious.\n\nNo one came to ask us our food was or to refill our drinks.  When we were done eating.  I had to ask twice for the receipt.  When the waitress gave it to us, she asked how everything was, and I told her the service was terrible and my drink was garbage.  She asked if I wanted to talk the manager to have it taken off our bill, I told her that I didn't want to wait half an hour to talk to someone over 8$ \n\nI get it, some times places are busy but we spent close to 2 hours here and it should have been close to an hour.  Either hire more staff or train current staff to be quicker.",
   "Always a great place to have Mexican food. Atmosphere is cozy with hip music in the bar with table seating available. Mexican style music in the dining area. Staff is always friendly. Family's are always welcome.  Happy hour specials.",
   "Excellent food. Good service. Pork belly tacos and excellent chips and salsa. Hubby had the steak chimichanga which he says was really good."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "26 Whitten Rd, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/13ebbaa2-932e-11ea-8b3a-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1837843693870512632",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered dinner tonight. It was worth every penny!! The rolls were yummy, the steaks were wonderful, and the salad was fabulous!! We just moved to Maine and we are following the quarantine orders but my husband has been here. We ordered take out to celebrate almost one week here. We will definitely order from you guys again!! Great job to all who made our meal wonderful! Stay safe!!",
   "First I got to choose my steak. Then it was cooked to perfection.  Service was fast and friendly and the price was very reasonable",
   "I worked for TRH for a long time and swore to never return.\nThen I found out one of the nicest dudes I know runs the one in Augusta and needless to say I’ve been hooked since.\nForrest is amazing. The food is always on point and his staff is always smiling and working hard. Travis in the kitchen is the man! Very cool to see this place being run so beautifully. \nI appreciate all the employees and their hard work and dedication in this crazy time.\nIf you live in or around Augusta- this is the spot for some bomb food and good people. Thank y’all 💯🙏❤️",
   "Wonderful staff, wonderful food. Love the bread most of course. Great price during such ah hard time. Thanks for an awesome meal guys ♡",
   "My favorite place for a steak but decided to try the salmon, OMG it was fantastic as were the pork chops"
  ]
 },
 {
  "name": "Augusta House of Pancakes",
  "address": "100 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/14420370-932e-11ea-a2b9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10721705106370666139",
  "source": "GoogleMaps",
  "reviews": [
   "Really enjoyed this local breakfast option as opposed to the big chains. They offered some different & fun menu options. Very accommodating with our two young children. Service was fast & friendly. All the things I want in a breakfast experience. Coffee was good too! Forgot to take pictures of the food because we are it so quick. Husband had Monte Cristo & loved it. I had a big Western omelette (4 eggs!). Will definitely be back.",
   "Good coffee, great omelet (4 egg standard) I loaded it up with the meat and all the veggies. Thing was HUGE. Staff is attentive enough to keep your coffee topped up but not over bearing coming over and asking every five minutes \"how is everything?\". Overall I recommend and would come back again.",
   "My husband and I stopped by for a late breakfast after I had bloodwork and he had a medical appointment. I must admit it has been a while, but the food and service did not disappoint. He had French toast, an egg, ham, and coffee. I had a pancake, scrambled egg, bacon, and coffee. All were just as good as we had remembered. We with be going back more often. How strange that we let this little gem slip our minds.",
   "Not a bad place to eat. I don’t recommend the fresh fruit bowl. The presentation was nice with a whole strawberry on top of the yogurt and granola, but the rest of the bowl was grapes and unripe melons. No more berries. Order something else.",
   "As always the staff is warm and friendly.  Service is quick.  It's not fancy but it is delicious.  Well priced and good quantity. The crepes are to die for!"
  ]
 },
 {
  "name": "Lisa's Legit Burritos",
  "address": "185 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/14a4977e-932e-11ea-b9e8-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8349448689893352218",
  "source": "GoogleMaps",
  "reviews": [
   "I'm from Oklahoma. I'm used to \"legit\" burritos. This ain't it. I ordered the large thinking it means more meat. Nope. Sure didnt mean that. I haven't seen the small but I pray it has less lettuce. The salad is to die for. Of mal nutrition.",
   "Food was good, and the people are nice. Price was a little more expensive than I wanted it to be. We sat outside and watched the town which was well worth it.",
   "Good food. It's like Chipotle.  Mars was great to us. We will be going back for sure. Thank you.",
   "Love eating here. Well worth the money and drive from Waterville!",
   "The foods good but what I love is the atmosphere"
  ]
 },
 {
  "name": "Downtown Diner",
  "address": "204 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1503f740-932e-11ea-95a8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17124817360456410188",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere and decor was nice, and food was good though ordinary. Will go again and try some other dishes to see if they're tastier. We got a spinach and cheese omelette, and the meatloaf meal. The waitress was very friendly but didn't check to see if our meal was okay or if we needed anything until we were finished. Maybe they were spread thin that day. Great place for breakfast.",
   "Excellent service. Extremely clean all the way around and the food was wonderful! Very pleased we stopped.",
   "Great for old school diner breakfast. We went on a Sunday, so they only served breakfast. On Street parking, so you might have to hunt for a place. Inside nice and cozy.",
   "Excellent service, great food. A bunch of us meet at Downtown Diner several times a week for breakfast, it is a great local business.",
   "Wonderful downtown Augusta breakfast spot! Servers are friendly, food service is speedy and food is excellent! Huge plus they have gluten free toast (and French toast!) \nDefinitely recommend"
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "12 Stephen King Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/15694ac0-932e-11ea-8ff0-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11017302619483056715",
  "source": "GoogleMaps",
  "reviews": [
   "The service is excellent (even when losses with customers; as they should be). The steak is superb, and if not, they will either remove from order or replace. They REALLY go out of their way to make the experience as pleasurable as possible! This is why it's my wife and I anniversary spot to dinner and just take the kids for a treat out. I highly recommend this particular eatery as I've tried most in state! Please give them a try if you're looking for steak especially. They have a 22 once steak in menu at a great price which is some of largest available in state.",
   "Cool atmosphere, feels like a real steakhouse. Super friendly and efficient waitresses. Unfortunately, the food was just OK. A potentially great steak and veggies fell victim to over spicing and over saucing. A good steak really just needs salt and pepper. And steamed veggies should be just that.  Everything was cooked right and my meal was a good value. PS Please don't start vacuuming while I'm still eating.",
   "The food was delicious! My steak was well done but still nice and tender. The staff was absolutely lovely and the drinks were strong, but not too strong. The atmosphere of this restaurant was amazingly calm. The lighting wasnt too much, but also not to dim. The seating capacity is great, the parking lot was full and there was plenty of seating inside! Would definitely go back.",
   "Service was excellent!!! Deborah J was great. Everything came exactly how it was ordered. Perfect timing between courses. Didnt have to wait for anything. Food was just as amazing!! Very satisfied all around",
   "Went with a co-worker from Day's Jewelers.  Convenient location, nice staff, and delicious selection of good & drinks. After treatment for neck cancer I have to pick easy swallow foods; the mac-n-cheese plus a sweet potato was a delicious combination"
  ]
 },
 {
  "name": "COLLEGE CARRY-OUT",
  "address": "126 Mt Vernon Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/15b60c92-932e-11ea-a801-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12310834474647056234",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered a hot ham and cheese with pizza cheese and got American cheese.. So disappoint. Never has this happened so my dinner waits. Two bites knew the difference",
   "EPIC lobster roll. Biggest/best of my life and great price.",
   "The prices are ridiculous for what you get. I got a BLT on wheat bread and it cost $7.55 and it is the saddest looking BLT I have ever seen.  My work has ordered from there for years and I have never been satisfied with the food.  Pizza isn't bad.",
   "A wonderful and easy place to order any type of delivery!  I ordered online and my food was here 3min before it was due!  Love this place!  Pizza is always amazing! Sandwiches too!",
   "Great Sandwiches Great pizza Great service"
  ]
 },
 {
  "name": "Applebee's Grill + Bar",
  "address": "136 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/160391b4-932e-11ea-8291-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "drink",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17299751516928092839",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful food. Great curbside service.  Thank you for working hard durning tough times. Keep it up!",
   "I really like this Applebee’s location.. food is typical Applebee’s food but the staff here is very friendly and you can usually get in quickly or with very little wait. Establishment is always clean and the bathrooms are always stocked and cleaned As well. I love their Thai shrimp salad and bourbon street chicken and shrimp, relatively healthy items compared to others on their menu!",
   "I just love 😍 Applebee's! The ambiance, the menu, the specials, the drink & dessert menus! My favorite drink is the pomegranate margarita..with the rim of the glass dipped in sugar.. & 1800 tequila! I have never had anything off the menu I didn't love!! 😋",
   "The Bourbon Chicken and Shrimp was out of this world yummy!  So juicy and tender and just the right amount of spice!!  Also can’t beat the $1 drink specials!!",
   "Wait staff was awesome.. food tasted excellent until my boyfriend found a piece of a wire brush in his steak when he took a bite. Manager was nonchalant about it.. We did receive our meal for free."
  ]
 },
 {
  "name": "Red Robin Gourmet Burgers and Brews",
  "address": "52 Stephen King Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/164c34c8-932e-11ea-8ef8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16710125156421799962",
  "source": "GoogleMaps",
  "reviews": [
   "Great place! The bun on my burger was quite soggy but they were more than happy to fry up a new bun! We got the fiery ghost tavern double, the mad love burger with chili fries, mac and cheese and the prime chophouse! It was delicious and our waiter was phenomenal!",
   "The place is clean and the employees are amazing. They were busy and the manager came out and helped with a smile on his face. He asked if we wanted sauce and I told him to surprise me. He brought out 6 different sauces. Amazing place and the food is to die for.",
   "We have eaten at Red Robin many times.  The service is always good and the food always tasty. Have been using curbside service during COVID19 limitations. Food and service are still great.",
   "I must say the food was very good.\nIt was all well cooked and as advertised.\nThe drinks also seemed like they were priced competitive with other restaurants.\nOne thing worthy of mentioning was the portion size in proportion to the size of the plate.\nThe plates were so large that the meal looked very small and skimpy even though the meal itself was a moderate size and more than enough food.",
   "We love Red Robin in Augusta! The food has always been great and the wait staff always so friendly! It makes a huge difference when you can laugh with your server. I highly recommend starting with the Towering Onion Rings. I don't know what they do for theirs but they are ALWAYS SO crispy and the onion never slides out when you take a bite like with other onion rings. Paired with the camp fire sauce it is a winner!! We only had one incident there over the years where after we were seated no one came to take our drink and food order. We waited 20 minutes and finally had to ask for our server. Before we left the manager on staff came over and apologized and comped our appetizers for the inconvenience. They take pride in good food and good service and make it right when things go wrong. It's one of our favorite places to go!"
  ]
 },
 {
  "name": "The Red Barn",
  "address": "455 Riverside Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/16996bc2-932e-11ea-a3e6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3084911265510940069",
  "source": "GoogleMaps",
  "reviews": [
   "Red Barn is a local institution, & for good reason. They know how to handle seafood! Lobster rolls are scrumptious. Fried clams are breaded fresh, not yanked out of a freezer. Fries have always been cooked just right & served hot. Even though they get busy, they do a fine job of keeping food flowing out of the kitchen.  Recommend!",
   "Great small little fast food establishment.  Friendly, clean, and fantastic exterior dining area.  While the food is a lot of your comfort fried foods, the environment is very enjoyable.  The owner also seems to support various vendor activities with their profits - very cool!",
   "Always love the positive vibes felt here. Used to bring my mom in her wheelchair. They made her Celebrity of the Day once and gave her a pin. A cherished memory.",
   "Absolutely amazing food, great prices, and an extremely friendly and welcoming atmosphere. To top it all off, Laura (the owner) does a tremendous amount of wonderful things for a lot of folks in the community, veterans, and people in nursing homes. The Red Barn is a fantastic place to eat, they have the best homemade whoopie pies, and I would highly recommend trying them!",
   "Best place ever to eat.  Fried Chicken, clams, fish, FF, burgers, etc. etc. Quick service, fun staff, but best of all is Laura Benedict the owner. Laura is widely known as the lady that never quits. She does fundraisers for people in need, she helps military people, you name itLaura does it without expecting anything in return except the joy of doing it. if for no other reason, you need to go to the Red Barn just to meet this lady she will leave a lasting impression on your heart."
  ]
 },
 {
  "name": "Whipper's Pizza",
  "address": "9 Bangor St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/16e2d21e-932e-11ea-a06a-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16852769343270881693",
  "source": "GoogleMaps",
  "reviews": [
   "I am by no means a prude, however it made me quite sad today to stop in and decide to sit in to dine today to hear the staff in a matter of 15-20 min drop the F-bomb 6 times. I literally started counting after the 2nd time. I’m glad that the staff feels like a family however it’s completely unprofessional and I think working in an environment for so long with an open concept kitchen you forget that the dining area is only separated by a counter and not a wall. I’m sorry to have to post this as I’ve been a patron for years and enjoy the food, but I think there needs to be a little bit more respect for your customers that are trying to enjoy lunch :(",
   "Great people, great atmosphere and most of all great food. One of my favorites: Half Buffalo and half Sweet Chili chicken tender basket with Poutine fries.",
   "Price was high for a lg. Steak. Cheese.  Mushroom and mayo and s water.$12.95. Flavor good on sandwich but price way higher then other places.",
   "I wish they still had a place in  Winslow This was an amazing steak and cheese sandwich",
   "Whippers by far has one of the best pizzas in Augusta. Your staff operates like a well oiled machine and you can count on I’m not waiting too long for your food. Everything taste really good, Peters is just so expensive everywhere! But Whippers offers a crazy lunch deal so you should check it out. They also deliver"
  ]
 },
 {
  "name": "Antigoni's Pizza Augusta",
  "address": "23 Bangor St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/173a1b6c-932e-11ea-a0d8-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11889296117255938610",
  "source": "GoogleMaps",
  "reviews": [
   "I don't eat pizza that much, and I've only been to Antigoni's once. It seemed a nice place and the staff were professional and nice while I waited for my loaded pizza. If I'm not mistaken, the price was better than pizza hut and the pizza was just more pizza for the money than pizza hut. Would and have recommended  !!.",
   "Every time i go there, amazing, hot, yummy food, with good and nice customer service. Clean place with two t.v’s playing the news and the other food network. Love it will be back everyday lol. also the “big mac” pizza 11/10 would recommend to any big mac lover",
   "Huge menu!  Everything from salads to pizza is wonderful.  Love the Tuscan pizza and Mediterranean salad.",
   "We were looking for a place to eat lunch wanted a salad had two salads, Cobb and stirfry both were amazing!! We look forward to the next time we are in Augusta. Food was great. Employees were super friendly!!",
   "We are regulars here. When I call, they know it's me, that's how good the food is. Best pizza in Augusta, and jeez, probably past Augusta too. Love the little pepperoni slices on the pepperoni pizza. Very nice people, family friendly atmosphere."
  ]
 },
 {
  "name": "Cushnoc Brewing Co.",
  "address": "243 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1780264a-932e-11ea-986a-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "brewery",
   "food",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=7578197617184162848",
  "source": "GoogleMaps",
  "reviews": [
   "Spicy Pepperoni, Great Drinks. Amazing Staff. The pizza even reheats well for what you end up bringing home, amazing portion sizes is what I'm trying to say.",
   "My sister and I stopped at Cushnoc this past Friday during the snow storm. It was so fun! Andy working in the tasting room was wonderful and we had great conversations with him about all the beers and the brewery in general. The beers were all excellent and the pizza was delicious! We went back up to the restaurant after our flights and pizza to get pints. We also got some gourmet popcorn! It’s a great brewery/tasting room, I highly recommend and can’t wait to go back. I’ll be checking out their Annex location next!",
   "We had six adults and two toddlers and had good service and great food.  Spicy popcorn was a nice surprise, the beer selection was good and pizza tasty. Would recommend for the atmosphere and reasonable prices. Can't beat the wood fired oven.  Nice to have another restaurant in the downtown area.",
   "(5 stars for the pizza and 3 stars for the restaurant) I love their pizza, especially \"The Diner Closes at 2\".  The restaurant has a great atmosphere too, except for one thing:  When it is busy, the noise level is incredibly high due to flat walls and ceilings that reflect all the sound.  Please, owners, add some sound absorbing tiles or do something else to mute the echoes!",
   "Love the beer and the brewery! This is Long Time Listener and is my new favorite IPA. The pizza was also amazing! We had the Mill Park Pie and it was an excellent flavor combo! 10/10 will be back. I’ve also tried most of their beers and they are amazing. Great local company."
  ]
 },
 {
  "name": "Lisa's Restaurant & Lounge",
  "address": "15 Bangor St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/17c742d0-932e-11ea-8e54-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13995925235503301927",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing breakfast! Great staff and fair price! They have all the usual thing along with eggs Benedict and scrambled with you choose!",
   "The staff was nice, the food was fantastic. I couldn't finish everything so I took it home and it was amazing even reheated c: I will definitely go here again when I can.",
   "Food was great. Staff was friendly. Well definitely be back",
   "The waitress was very nice and provided kind prompt service:) and dang the mimosa with a dash of cranberry was on point! I had the breakfast burrito which was good too.",
   "Server was excellent, super kind and knowledgeable. Food was better than most diners. Home fries were some of the best I've had. Monte cristo sandwich was dope. Portion size was enough for two small adults."
  ]
 },
 {
  "name": "Five Guys",
  "address": "274 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1826f654-932e-11ea-9336-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "free",
   "eat",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12108680258765235935",
  "source": "GoogleMaps",
  "reviews": [
   "Five Guys, at least this location, is an over-hyped, over-priced burger joint. The hamburger, small as it was, was good, nothing great. The fries, very abundant in quantity, were good as well but didn't have a freshly cut-up potato taste to them. My beverage of choice, a strawberry milk shake was shamefully small for the price and had a strong artificially flavored taste to it. I've had MUCH better food at other Five Guys locations.",
   "Delicious burgers, fries and shakes! It can be expensive...last time I was there I spent $17 for a burger, small fries and a milkshake which was a pricey lunch... but it was all delicious. So much better than the drive-thru fast food chains. And of course: great service from a friendly, energetic team!",
   "Greatest burgers around. But if you cant eat a double be sure to order the little that's a single patty. Those with peanut allergies beware. Free peanuts to snack on while waiting for you order and I believe they use peanut oil to cook fries in.",
   "Best burgers in town! Can be a little on the expensive side but definitely  worth every penny. Awesome customer service.",
   "Great French fries and shakes. My son says the burgers are also great but I don't eat meat. A veggie burger would be a nice add to the menu. The veggie sandwich they sell is so-so."
  ]
 },
 {
  "name": "Olive Garden Italian Restaurant",
  "address": "205 Civic Center Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/18784b58-932e-11ea-b4ba-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "delicious",
   "food",
   "walk",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12992564719388851707",
  "source": "GoogleMaps",
  "reviews": [
   "We arrived at 11:30....no line and no waiting. We were seated immediately and Brandi our server quickly took our drink orders and within minutes we  were enjoying our cold drinks.\n\nBrandi took our orders and quickly brought breadsticks and shortly thereafter brought our soup and salad. \n\nI had just finished my soup when our perfectly cooked meals arrived....hot, delicious, and cooked to perfection!!!\n\nOUTSTANDING!!!! BETTER THAN THE 5-STAR RATING!!!!! ❤❤❤❤❤",
   "This establishment certainly has its act together. The environment was perfectly clean, the overall ambiance well calibrated to the motif. The service was prompt, professional and pleasant, thank you very much Melody. The timing of courses was spot-on and the food was delicious as well as reasonably priced. The digital table top device they've got going was also pretty spiffy. Worth a stop in. 5 stars, no complaints.",
   "Some coworkers and I had a great lunch today. We were in and out in about an hour. I do recommend using the option online to put yourself on the wait list ahead of time as sometimes there's quite a long wait. My lasagna was good, the staff was pleasant and we enjoyed the option to split and pay for our check at the table. It's your typical Olive Garden, but one of the better options around if you're looking for a chain restaurant.",
   "My daughter and I were stuck in a corner, beside a family of 10! My waitress was wonderful! The other 2 seaters were not so lucky. Their waitress, loudly told them, how she would never eat here and even recommended several other places to go! I told management and watched him walk around and repeat to the staff, what I told him in confidence!! I've worked , in this industry , since I was 14. Never been so embarrassed! Will not go back!",
   "Service was fair, they stuck us in a back corner which was a little unappealing considering they weren't very busy. I was with my girl-friend and kind of felt they stuck us in the corner for a reason. The drinks were great but the plates were a bit small. Would like to try this place again sometime. Maybe a different location."
  ]
 },
 {
  "name": "The Black & Tan",
  "address": "18 Bridge St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/18bb48fe-932e-11ea-b377-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3642290158818289514",
  "source": "GoogleMaps",
  "reviews": [
   "I think it was good, traditional Irish shepherd's pie. First time I have ever tried it. The ground lamb was savory. Not too salty, like most pub foods. Melted Irish cheese topping delicious.",
   "The food was fantastic. Great atmosphere and very decent prices! We will def go back!",
   "This place has it all.  Great beer selection with happy hour deals. Good pub selection with some Irish and Scottish classics. Got the scotch egg it was great the egg was a perfect soft boil.  Prices for sandwiches was reasonable and the service was quick.",
   "I don’t understand why someone would think they can charge 10.80 for a large cup of soup I get soup from everywhere here in town never have I seen any charge that much, if it at least tasted decent I wouldn’t be making this review I was hoping at least it would taste good but it has no flavor at all, it is just broth and vegetables and the carrots werent cooked through. Not too big a deal if it at least tasted good. Just not much too it at all a can taste better and is way less of a cost.",
   "What a great place!!! Awesome food, drink, service are just a few of the many outstanding attributes.  Highly recommend and I'll definitely be going back."
  ]
 },
 {
  "name": "Damon’s Pizza and Italians",
  "address": "244 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1903f09e-932e-11ea-8538-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17927473095021680940",
  "source": "GoogleMaps",
  "reviews": [
   "Have been many times and usually great. I went tonight first burger had tomatoes ask for none wife's allergic to them. Then my chicken was not good at all couldn't eat all together cause had to wait for new burger",
   "A great lobster roll!",
   "Sandwiches are good, but in my opinion pizza is not. All around a good experience.",
   "Just stopped at Damon's for my favorite, Big Whip Jr. I always have it cold but today they accidentally made it toasted and it was delicious! My new favorite sandwich! Thanks for the mistake folks!",
   "Had a roast beef Italian sandwich. It was great. Meat on the top"
  ]
 },
 {
  "name": "Chipotle Mexican Grill",
  "address": "1 Stephen King Dr Ste 10, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/195e476c-932e-11ea-a85f-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13433760036017475279",
  "source": "GoogleMaps",
  "reviews": [
   "I just picked my order up 20 minutes ago, I  Weather in Winslow so it's a far drive. I understand businesses are hurting. When you resort to cheating the customer. Why even try to stay in business. I ordered food for 3 people not one thing was correct and apparently I'm not the only 1 , 2 or 3 other people were headed in to return their order... Before the pandemic I was it 2 to 3 times a week person there, I'm gonna place another order next week. See how it goes , Hopefully this is just a fluke..",
   "The way you want it!  That's the best.  Good wait staff good choices and laid back atmosphere. Only reason not a very comfortable eat in restraunt.  Very likely you will not be seated with people you know.",
   "Stopped in for lunch today at 1:30. The restaurant was filthy. Tables dirty, floors dirty, no silverware. The line moved slower than ever. To make matters worse half scoops of beans and rice at the same full price. Even better I had fruit flies flying around my food...in February. Very disappointing. I eat at Chipotle locations several times a month. This was by far my worst experience.",
   "Love Lisa Nagel, she always goes the extra mile. She does a great job at coring and trim! She has become a good friend!",
   "Chipotle has been front page news for awhile and I admit I've hesitated a few times before going in, but I've never had a poor experience or a bad meal. The food is fres, cooked and prepared right in front of you. The staff is friendly and always efficient. Even with a line out the door I can be in and out in less than 12m. I used to go the way if their classic burrito (because I love the warm tortillas), but now I go with the bowls. \nThe meats are tasty, tender and seasoned well. The guacamole rivals some of the better Mexican stops and the veggies have never been brown or wilted.  It's worth the visit as fast and fresh is better than fast and fried everytime."
  ]
 },
 {
  "name": "Eastern Delight",
  "address": "264 Eastern Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/19bedfac-932e-11ea-8e6c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13510856487699877893",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely the best Asian/Chinese Restaurant around! Huge portions and their food is always super fresh! My family's favorite restaurant!!!",
   "Bloody wings on recent visit. The quality of the food has been going down hill lately with raw chicken wings and tough ribs. There are better options in the area.",
   "First time eating here. Great experience! I'll definitely eat here again.",
   "Really great food and large portions. The people are wonderful, too! Best Asian food for miles!",
   "Absolutely the best Chinese in Augusta"
  ]
 },
 {
  "name": "The Hott Dogg House",
  "address": "170 Mt Vernon Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1a334aac-932e-11ea-8c85-14b31f159f22.png",
  "tags": [
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10337153648630107122",
  "source": "GoogleMaps",
  "reviews": [
   "Great, creative selection, cooked by friendly folks! Tasted great and reasonably priced. I would definitely stop by again.",
   "Good hot dogs and fries.",
   "CHILI CHEESE DOG!!!! DOUBLE CHEESE BURGER!!!!!!  This place is a hidden gem. Must go.. Owner will make sure you are happy...",
   "Great food and a really nice owner and chef.",
   "The hot dogs were awesome, and the 🍟 were even better; all nice and hot."
  ]
 },
 {
  "name": "Arby's",
  "address": "219 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1a8c1a92-932e-11ea-b643-14b31f159f22.png",
  "tags": [
   "drink",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=685925119529323823",
  "source": "GoogleMaps",
  "reviews": [
   "Whoever was running drivethrough around 4 or so I think was really nice. Accidently put ice in our drink but offered a free extra drink without ice. Just very cheery people, much better than Wendy’s who told us to “taste test” our drinks to figure out which is which even though the lids have the buttons lol",
   "Fast. Friendly. Arby's. What more could you want?",
   "The food...The service and the Servers were great. The place is a little shabby run down internally though the men's bathroom is needed some updates. One young lady was staying busy the whole time we were there.. Even though there's no other customers at that time she was a very good employee.. she should be paid more and rewarded in some form ... I personally left her a tip.",
   "I actually have liked Arby's over other fast food types. I like the thin shaved roast beef just plain on the bun, no sauce. I do actually like the Arby's sauce though. I think the roast beef has a nice flavor just plain. The curly fries are my other go to, very good seasoned fries. I always go here when I am up to the VA medical center.",
   "The only Arby's closest to Bangor is in Augusta... Too bad. I think it would do well in the Bangor Area!!!"
  ]
 },
 {
  "name": "Amazing Garden",
  "address": "57 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ae8bb00-932e-11ea-be21-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10243306230421242245",
  "source": "GoogleMaps",
  "reviews": [
   "Our first time in this place was absolutely amazing! There were only our group and one other table in the restaurant at the time. The service was excellent and the food was awesome. One of the very best Chinese food experiences I have ever had. It came up in my Google search and had very good reviews. After eating there I can see why! Our server was quick to seat and set us up, very personable, and the wait for our meals was quite short. I'd recommend the Amazing Garden to anyone seeking a first class meal. The portions were very large and we took a good bit with us when we left. If you're in the Augusta area and looking for Chinese then the Amazing Garden would be, in my opinion, the place to go. Stop on in and try it out for yourself. I garantee you won't leave disappointed! Large menu and drink selection and great atmosphere, and service with a smile. They certainly won me over and I'll be going back again!",
   "Ordered food from their website as they do delivery. The website clearly states that they're open. Yet our food was never delivered and no one is answering the phone when we call. If they're actually closed they need to list that on their website so people aren't ordering food as it's a good way to get poor reviews. I would love to be writing a better review but unfortunately they never gave me that option.",
   "Ordered the food online. Two hours later no one showed up to deliver it and no one is answering the phone. I won’t be going back. Take out or dine in.",
   "We love this place 😋 great food and love the ladies.",
   "The food was excellent! Very friendly staff. Will definitely go again!"
  ]
 },
 {
  "name": "Two Maine Guys",
  "address": "326 State St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1b3d20c2-932e-11ea-8899-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4640491688535162404",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, the Crazy Chicken Sandwich was awesome, and friendly curbside pickup.  Hope they go to delivery someday, it’d be at the top of my list.",
   "Friendly and quick service. Lots of menu options, and excellent food. What more could you ask for?",
   "Great place to eat their Mac n cheese is great and the crazy chicken sandwich was perfect I recommend you stopping by",
   "Had curbside pick up at the new spot they have in Richmond and it was amazing! If you can go, well worth it!",
   "Food was awesome! Can't wait to come back!"
  ]
 },
 {
  "name": "Amato's Sandwich Shops",
  "address": "34 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1b9d6b3a-932e-11ea-808e-14b31f159f22.png",
  "tags": [
   "delicious",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7069346413663241089",
  "source": "GoogleMaps",
  "reviews": [
   "Customer service was excellent. Store and bathroom were clean. But I paid almost $10 for a ham italian with extra black olives. There was less than 1/2 oz of meat and barely any black olives, though I paid for extra. A foot long sandwich shoul have no less than 4 oz of meat. So if you don't mind eating an expensive pickle sandwich, then this is the place. \n\nAs you can see I ate it anyways as I picked the thing up on my hour long drive home. It WAS a tasty pickle sandwich, but it wasn't what I would call an italian sandwich. Side note: their black olives are actually greek olives, which is my favorite.",
   "First time at Amato's, and it won't be the last. For breakfast, I wanted an egg and cheese muffin with sausage and peppers. Asked if possible as it wasn't on the menu. Within a few minutes I had a delicious muffin with filled with an egg, creamy cheese, peppers and onion. YUMMY! Thank you Omar for your friendly welcome and for sharing a bit about Amato's history. Really enjoyed my first visit, looking forward to trying their other menu options as well as getting that muffin again.",
   "Service was good and timely. Veggie stuffers were big disappointment.  Those used to be my favorite even tho I havent had them in about a year. When I opened the box I was shocked. 6 before filled almost the box , now they are the size of a silver dollar. Won't do that again.",
   "Nice quick lunch in the center of agusta. I've never been to an amato's before and this was good. The guy behind the counter was the nicest restaurant worker I have ever encountered, nice job amato's. The food was good too.",
   "I love this place fast fresh and friendly"
  ]
 },
 {
  "name": "Wander Pizza Company",
  "address": "265 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1bf43f18-932e-11ea-94e4-14b31f159f22.png",
  "tags": [
   "family",
   "wander",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8551710494184360046",
  "source": "GoogleMaps",
  "reviews": [
   "Wander Pizza is awesome.   The pizza, apps and sandwiches are all fantastic.  The hand made crust is fully developed, flavorful and consistent.   The variety of pizza  toppings and other  ingredients is  impressive, but what really takes it the over  top is their freshness and quality.  Fresh toppings(no canned jalapenos!) local meats when possible, and a variety of traditional and funky cheeses.  There is a great selection of small-time regional sodas, the big name sodas, seltzers, and a widerange of great beer on tap, local and otherwise.  \nThere's a nice variety of slices available throughout the day, and the best happy hour in central Maine.   On any given day, there's no telling what surprise toppings you might find on a pizza special.  \nTo top all that, the staff is friendly, fun and efficient.  Jesse, the owner,  is ALWAYS there,  busting his tail putting a lot of care into every bit of food that leaves the kitchen.   \nAugusta used to be a pizza wasteland.  Now,  with the arrival of Wander, we  have one of the best pizzas places in the state.  It's very family friendly and also  super easy to access  right off of  95.    \nThis is a legit review that I've been meaning to write for a while.     We've eaten  there probably 30 times since it opened.  It's been great every time, and now Jessie and his staff feel like friends that just happen to serve killer pizza and beer.",
   "Great custom pizza with a good selection of craft beer on tap.",
   "This is a gem!  You will not regret stoping at this pizza shop!  New York style pizza with many toppings available and craft beer.  Nice people good atmosphere.  They deserve your business.",
   "New owners, changed pizza ovens, amazing results. Great place is now fantastic. Possibly best pizza in Augusta. More craft beer and nice update to decor make for a very inviting a cozy spot.",
   "A jewel of a place in Augusta. Nice atmosphere, great tap list and the pizza was outstanding! Give it a try!"
  ]
 },
 {
  "name": "El Tequila",
  "address": "65 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1c4157cc-932e-11ea-af97-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=525826313092396068",
  "source": "GoogleMaps",
  "reviews": [
   "Since leaving Virginia we have tried to find a Mexican Restaurant in the area. Except for not having White Sauce for my chips they are great! Food is seasoned well and very tasty!",
   "First time ever to this place and the service was fast awesome and really good food.  there house cheese sauce is amazing. I tried there  Burrito loco and would definitely order again",
   "Wanted to give this restaurant a try.  Having been born and raised in Texas, with most of my time In San Antonio, I am partial to good Mexican.  \n\nWaking in we were immediately greeted and seated.  The restaurant is festive, and very clean.  Great drink menu, with plenty of choices for margaritas. Chips and salsa immediately upon being seated. A plus!  We ordered the guacamole. We loved it.  For entrees, by wife ordered the combo beef and chicken fajitas.  She said they were out of this world.  I have the enchiladas Del Mar.  Plenty of crab and shrimp rolled in corn tortilla with a creamy, not to heavy sauce.  So tasty, and sorry no leftovers.  What a great addition to Augusta!  A must try!!",
   "Food we had was better than the same from the other Mexican restaurant. Unique/colorful chairs, tables and booths. Best part...they can comfortably accommodate large parties. Roomy tables for 8-12. Sauces flavorful but not burn-your-mouth spicy. Prices are good. Hope they do well.",
   "Food...AMAZING.\nService... AWESOME.\nPrice...PERFECT.\n\nWould definitely recommend to anyone! Will definitely be going there again! 😋"
  ]
 },
 {
  "name": "End Zone",
  "address": "315 Eastern Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1c8eb5ee-932e-11ea-88bb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1575818289359547368",
  "source": "GoogleMaps",
  "reviews": [
   "This was an amazing place to host our son's basketball pizza party!  The staff was great and very accommodating for a large amount of people.  Very friendly and the atmosphere is great!  Arcade games, juke box, candy dispensers!  We called ahead and the pizzas were ready when we arrived!  I will highly recommend this place and absolutely be back for more!",
   "Great food, good prices! Great variety from salads to pizzas, subs hot and cold as well as basket meals. Make sure to check out there 30inch gridiron pizza it's a giant! They have tables for eating in or you can order to go",
   "I had the garlic parmesan wings. Delicious!!! Great service with a smile.",
   "Delicious pizza, I cant get over the size of the huge one!",
   "The girls work real hard to get your order out fast. I recommend the fresh dough pizza. Sandwiches are loaded with good quantity of ingredients."
  ]
 },
 {
  "name": "Panera Bread",
  "address": "37 Xavier Loop Suite 3, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1cdf6f64-932e-11ea-8e4c-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "tasting",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15826759220175146450",
  "source": "GoogleMaps",
  "reviews": [
   "We have been coming here for years, always on our way to and from Canada through Boston, way prior to Panera ever expanding into New Mexico where we live.  \n\nIt used to always be bustling with patrons, clean, and with friendly staff.  This time was definitely a stark contrast to that.  Hopefully it's not like this everyday, but even though there was hardly anyone there, it was hard to find a clean table, and the staff was too busy to pay any attention to the customers.  Granted, the help-yourself tablets encourage the staff to be hands-off, but at other Panera establishments that have adopted that, it's across the way from the cash registers and they are happy to let you choose whether to use the tablet or take your order for you.  It seems like they are understaffed, overworked, and were just plain tired.  \n\nThe food was still exactly what Panera always offers, even if they did make one mistake on one of our sides, that's typical and they are happy to fix it once you get their attention.  I like to get the lobster roll on our drive up this time of year since they are generous with it and it's not finely chopped nor covered in too much dressing.  Their bread bowls, sandwich bread, and baguette on the side is always on point.",
   "Love Panera! We drive over an hour just to go. Fresh, great tasting food. Nice staff. Decent prices.",
   "Great tasting food. Could use more vegetarian soups as there are only 2 options currently as some of the vegetable cream soups have a meat soup base. Sandwiches are amazing too.",
   "Went in at 8:10pm and they were cleaning and we asked if they were closing and they said at 10. I barely ever come here so I didn’t know the soup didn’t automatically come in a bread bowl which my daughter had recommended. When I asked the girl (wearing a plaid shirt with glasses) if the pick 2 came in a bread bowl she said no it doesn’t automatically come in a bread bowl and have to specify it in a very rude tone. Even my teenage daughter couldn’t believe how rude she was. Then we decided we didn’t want to eat there since they worried more about closing than serving us. We said never mind and she just rolled her eyes and shook her head. I’ll never eat there again.",
   "Food was very tasty. They were out of the two side breads I requested (totaling $7) so they offered to give us 5 bagels instead (totaling well over $10) I was very pleased with that! Very friendly associates there"
  ]
 },
 {
  "name": "Cross Cafe",
  "address": "Burton M. Cross Building, 111 Sewall St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1d2bc548-932e-11ea-b8f4-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8513984308853024561",
  "source": "GoogleMaps",
  "reviews": [
   "Salad bar clean and crisp. Very friendly.",
   "Interesting cafeteria in the lower level of the Maine State House which is frequented by visitors and government officials alike. Good variety in their offerings.",
   "Best food around at great prices!",
   "Thursday chicken special exceptional",
   "I absolutely love the food, staff, and prices. Basically an in and out place to eat."
  ]
 },
 {
  "name": "Chen's",
  "address": "238 Northern Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1d811324-932e-11ea-b379-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3205944953138235085",
  "source": "GoogleMaps",
  "reviews": [
   "Food taste good restaurant is filthy and have there very young daughter working the register count you change health inspectors should visit this restaurant",
   "Very yummy food and big portions.",
   "I ledt my Debit card here on accident. I'm an OTR truck driver so that's a very scary thing for me to do. Came back the next day and they had it safe for me. I always eat here when I come home to Augusta. Delicious fried rice, noodles, and chicken. A reliable place for Chinese food.",
   "The staff are nice and the prices are cheap, but that's the extent of the pros. All of our meat was dry and very chewy, the chicken wings were covered in tiny feathers still, and even the fortune cookies were stale. Next time I will order good Chinese food for a little more money..",
   "I ordered the four happiness dish let's say I was far from happy. I found the beef but where was the shrimp I got 3 peices and the pork was pork spare ribs look and tasted like yesterdays left overs so all in all was unimpressed!"
  ]
 },
 {
  "name": "The Oyster Bar",
  "address": "284 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1dc1050a-932e-11ea-bda1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11554379445768709273",
  "source": "GoogleMaps",
  "reviews": [
   "An Augusta classic ... Excellent shellfish selection.",
   "Monica is the best bartender of all time.",
   "Oysters were suburb.  Service was excellent ask for Doug",
   "Nice !",
   ""
  ]
 },
 {
  "name": "Wrapped Up",
  "address": "1 Hichborn St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e0d7976-932e-11ea-9351-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12053274532556189856",
  "source": "GoogleMaps",
  "reviews": [
   "They have the best salads in the area.  I’m a big fan of their cobb salad - the large version of this is a very hearty meal full of proteins and low on carbohydrates.  Most would probably be happy with the regular size, but the large is perfect for those with bigger appetites.\n\nThey make their salads fresh, so you have the option of deleting some items from your salad if you are so inclined.  I take mine with everything - fresh lettuce, tomatoes, avocado, scallions, blue cheese crumbles and a generous helping of sliced chicken.  Dressing comes on the side and is delicious, too.\n\nStaff are always pleasant, even when it’s busy.  Orders never take long, but you can always call ahead if you are in a hurry.",
   "Best wraps anywhere. Although they are a little pricey their sandwiches are delicious. The only con is that they are open mostly when state of Maine offices are open. They make excellent breakfast and lunch wraps. The owner is friendly and hands-on. I couldn’t give them anything less than five stars",
   "Just ordered for the first time, delivery because of covid. They had the wraps at my door in 15 minutes, they were huge, and delicious. Will definitely order again!",
   "Wrapped Up is a great little lunch spot. Their selection of wraps and salads is different from the everyday. Things were made fresh to order. I ordered a small wrap and it was bigger than a 12\" sub from other sandwich shops. The place was clean and the staff was very friendly and helpful.",
   "I always liked bay wrap, but it seems to have gone a little down hill after this ownership change. I always have gotten the bubbas even back then, but the quality was not so great last time around. The pulled pork was hard as a rock and dry. I came in around lunch hour too, so it’s not like it should’ve been dried out. I give 3 stars because I think it has potential to be better next time, and I know it’s pretty difficult owning a food business. But I’ve had better."
  ]
 },
 {
  "name": "207 Nutrition",
  "address": "12 Shuman Ave #1, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1e62d0e8-932e-11ea-a11e-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=1277098598569817048",
  "source": "GoogleMaps",
  "reviews": [
   "Always greeted with a smile by UPBEAT, ENERGETIC and FRIENDLY staff!!  Super CLEAN environment! The BEST teas and shakes around, that leave you wanting to go back for more!",
   "The employees are always super friendly. The shakes are delicious. Absolutely love this place!",
   "The most delicious shakes I have ever tried. I've had Atkins shakes, protein and whey shakes, smoothies and these are super delicious. They give me energy all day. Cinnamon roll and apple cider donut are my favorites right now. The staff and the owners are so nice and welcoming too. Thanks 😊",
   "Just about every day, I go and get a protein shake. Its consistently exceptional, both the product and service, with a wide variety options.",
   "Go see Jesse at 207 Nutrition right behind Charlie’s Kia. Great Coach! Very Knowledgeable! Incredible Lit or Boosted Tea and Shakes!"
  ]
 },
 {
  "name": "Aunt Gin's Restaurant",
  "address": "48 Augusta Rd, Whitefield, ME 04353, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1ea51064-932e-11ea-9ef5-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9793901235582300958",
  "source": "GoogleMaps",
  "reviews": [
   "Talk about a hidden gem right out in the open!  This adorable little home turned restaurant deserves more than the max 5 stars!  The service is superb and the food is phenomenal!  Couldn’t get anymore home cooking than this!  Deliciousness overload!  They also offer a full bar!  And a dessert menu that will make your eyes pop!!!  A must visit on your way south to Rockland or north to Augusta!  Kid friendly!\n⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️",
   "Nice family atmosphere. Tonight there was a choice of the menu or \"all you can eat\" buffet. I had the house burger, which was really delicious! The baked haddock was great, flaky and moist. Lemon herb chicken was overseasoned with too much applied.  Otherwise, great food for good prices and our waitress was attentive, professional, & pleasant!",
   "First time visiting this restaurant. Everything we ordered was fantastic! And it was nice and toasty in there.  We will definitely be back!  I had the seafood newburg, my husband had steak tips, my daughter had lasagna & son in law had a burger with a specialty sauce that he said was delicious! And the service was top notch and the owner also came over to our table and said hello! Great place with a great atmosphere!",
   "My wife and I have discovered our go to restaurant.\nWe have been going there now for the past couple of years and have never been disappointed with any of the meals we ordered.\nOwner impressed us back on our first visit. He came and talked with us with a wonderfull friendly attitude. This and the food quality has made is a frequent patron. \nVery friendly atmosphere and excellent portions at reasonable prices.\nHighly recommended.",
   "Great food and service, with lots of vegetarian options! There is an extensive menu traditional of American dishes, with a surprising number of vegetarian choices, including on the kids menu. The servers were very friendly and accommodating to making some small changes to make other dishes vegetarian. this is not fast food! Everything was made from scratch, and from fresh ingredients. Quality food, but not a quick meal if you're in a hurry. The homemade black bean veggie burger was delicious and the garlic parmesan fries were too."
  ]
 },
 {
  "name": "Bento Sushi",
  "address": "118 Cony St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1eecc910-932e-11ea-b40d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11935826837078348855",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "Subway",
  "address": "225 Western Ave, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f3a5718-932e-11ea-9290-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5646458885984803271",
  "source": "GoogleMaps",
  "reviews": [
   "The western avenue location is hands down the best Subway to eat at in Augusta period. Always fresh product, the business has a semi large environment compared, and they always seem to make the sandwiches look very professional. I'll always eat at this location.",
   "Great food Everytime and pleasant work staff..sometimes;)",
   "The lady with the purple hair was very rude in training Jenny. Also her hair was all over the place when she was making my sandwich. Whatever happened to hairnets? Jenny was very patient and pleasant, by the way. My sandwich was okay but almost $10.",
   "Went in around 12:30 on a friday, line was out the door and only the manger and one employee working. Line moved quickly, they worked fast and quality wasn’t comprised. The manger expressed his condolences for the wait. Never had a problem with this subway, hard working employees there, doing what they can even when the lines out the door busy and taking online pick up orders. 10/10 recommend.",
   "Decent food, made to order.  Great quick lunch."
  ]
 },
 {
  "name": "Denny's",
  "address": "123 Civic Center Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1f97e206-932e-11ea-8631-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15593423239202444903",
  "source": "GoogleMaps",
  "reviews": [
   "Food was good. Not worth the price though. I pay less going to red robin now and get more and better food. Still like denny's. Just cant see spending the same amount of money for a built hamburger as a BLT or club sandwich..60 dollars for 2 adults and a kid..",
   "Our first time at a Denny's was excellent. Breakfast was really good. You get a lot of food for the price. Server was busy, but very friendly and brought back anything we asked for.",
   "They have a scrumptious after-hours menu available with everything from breakfast to dinner meals.  Reasonable prices.\n\nGreat service, too!",
   "Waitress was very helpful with the new menu items. Even the Dieter had a great veggie egg option. Liked the new green smoothie.",
   "Good service and good food."
  ]
 },
 {
  "name": "The Quarry Tap Room",
  "address": "122 Water St, Hallowell, ME 04347, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/1feee18c-932e-11ea-b6a2-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "family",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15523523838304236632",
  "source": "GoogleMaps",
  "reviews": [
   "Really loved this place. Decided to grab an Airbnb right near it for a night and we found this place for a few drinks. They had an extensive tap selection, at least 20 were listed on their wall. It was a good mix variety with a few local breweries. The live music and bartenders were very upbeat which gave the bar a happy/fun vibe. We would definitely recommend this place and plan to go back.",
   "This visit had the makings of a great Sunday lunch, a beautiful day, bright sun and blue skies, and sitting on their outside patio looking down the Main St. and overlooking a the river. I am not sure if this is standard, but someone was singing throughout the meal, taking requests.\n\nThe food was good except my wife’s meal seemed only warm, my burger, which tasted great was slightly undercooked for what I actually ordered. \n\nThe waitress seemed distracted and never checked to see if we wanted our drinks refilled. We also were going to get dessert but changed out minds because of the waiting.It was busy, but not overly so other people that came in later seemed to be getting  waited on quicker.\n\nThis may have just been and off day, another visit may prove different? In the end though it was disappointing when there seemed to be so much potential for a great experience.",
   "With family visiting, we stopped by for lunch and had a great visit. The staff were all super friendly, the food portions were generous, and everything tasted great. Very family friendly place too.",
   "Excellent selection of beer and a great outdoor space, unfortunately I have often found the food to be unexceptional. A good place to go in summer for a brew and a game of bags.",
   "A great atmosphere ,staff , food and .music! Shannon Denbow was amazing!!"
  ]
 },
 {
  "name": "Slate's",
  "address": "161 Water St, Hallowell, ME 04347, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2048f3ee-932e-11ea-bf06-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13370993790620633557",
  "source": "GoogleMaps",
  "reviews": [
   "Wow I love Slates! The gourmet food, the excellent service and superior drinks! It doesn't get any better in central Maine then this! It can be really busy and a little loud so get a reservation ahead and  then enjoy. Ask If Courtney is bar tending try one of her Mojitos, she does an amazing job with them. You wont be disappointed",
   "Hot cider on a chilly day...\nFlatiron steak basil eggs Benedict was all amazing!!! \nOh and coconut blueberry bread..\nI also ate strawberry rhubarb pie... No pic. \nWe stopped in bakery next door for pumpkin chocolate chip cookie..\nMust visit this place again!!!",
   "Delectable seafood, romantic atmosphere, warm relaxing music and friendly prompt waitress. They had a nice table ready for us when we arrived. Fresh flowers and candles were on the table.",
   "Awesome smoked shrimp and caramelized onions benedict... Delicious bloody martini... Short wait, lovely staff. Overall a wonderful brunch experience.",
   "If you're local, you already know how great it is. If you're from away like us, it's an amazing find. We're not passing by Augusta on the highway again without making this short detour."
  ]
 },
 {
  "name": "The Raging Bull Saloon",
  "address": "228 Water St, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2093e21a-932e-11ea-8b5f-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "music",
   "cheap",
   "food",
   "kids",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=18259091225194894415",
  "source": "GoogleMaps",
  "reviews": [
   "My whole family enjoyed eating here. The decision was carefully done, and the food is especially tasty. Every single thing we ordered was exceptional. The menu is small, which to me, is a good thing. They focus on a few things they do well, rather than deliver sub-par food from a large menu. The wait staff didn't bother us while we were eating, and provided just the right amount of interaction when we needed it. I would definitely recommend the pulled pork!!\nOnly thing I didn't like was the blasting country music. We could barely hear each other talking at our table.",
   "Fun bar. Saddles should go.",
   "Cornbread is worth the trip alone! I had the brisket on special and it tasted a bit cheap but the cost was also on par for the food. Chipotle chicken tacos were terrific and just the right amount of spice. Unfortunately I do prefer riverfront a food but the atmosphere here beats riverfront by a mile. Overall worth a visit!",
   "Great food and portions. Like nothing else you can get around town. Saddles are super fun and my kids want to come next time to sit in them. Drinks are NOT watered down. Will be back",
   "Awesome place and great service and awesome music too."
  ]
 },
 {
  "name": "Lucky Garden",
  "address": "218 Water St, Hallowell, ME 04347, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/20e583ac-932e-11ea-8841-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6358537587985302256",
  "source": "GoogleMaps",
  "reviews": [
   "Went here once. It was bad. The food was lukewarm and getting stale. The staff didn't seem to pay attention to what they were doing and the cost is ridiculous. If you want a good Chinese place, check out Amazing Garden on Western Avenue.",
   "Great service today from \"Jlo\". They don't have a lot of vegetarian options for their buffet so Jlo (nickname) our waitress ordered me some vegetarian egg rolls and rice. Making the buffet worth it. Food was delicious. And the service was fantastic!! Thank you!!",
   "Great for fast lunch, buffet has hot freshly cooked food!",
   "I love the fried rice here - has carrots, peas, onions, pork bits . . . Pretty and yummy.  The atmosphere is calm and the location is perfect.",
   "This is a casual Chinese place with optional buffet style service. The servers were friendly and the atmosphere was bright and pleasant. We came at lunchtime on Easter Sunday so business was rather quiet. The food was pretty good (though not exceptional) but you do get a lot for the price, especially if you do the buffet. Overall this is a solid stop for casual Asian dining"
  ]
 },
 {
  "name": "The Liberal Cup",
  "address": "115 Water St #1, Hallowell, ME 04347, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/213579e8-932e-11ea-bdda-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10455623446812152990",
  "source": "GoogleMaps",
  "reviews": [
   "Highly recommend getting the daily vegetarian pasta special with. Chicken, shrimp or salmon. It's the best kept secret of this place.  The chef is gifted in his sauce creations.  Always new interesting and very tasty.",
   "This place is always awesome. Food is the best around in my opinion. Beer is top notch.",
   "The food always hits the spot with their generous portions and the beers are consistently good. I always make sure to get my souvenir cup when i stop by. Make sure they rinse the souvenir cup, those things could be dusty and you'll have floaters in your beer.",
   "Very good beer and pretty good food. The biggest complaint about this place is that it is often packed and noisy. Great for a night out at the pub but not the place for a quiet dinner.",
   "Had a great time here. We arrived late around 9. Was able to locate this restaurant without much hassle of driving around. The place was still a bit crowded even at 9. However since the majority of the crowd had left, we got the seats fairly fast. To the readers: Would definitely recommend reserving a table or be ready to wait for a while. \n\nThe menu had limited veggie and chicken option. We tried the garlic parmesan wings, freshly made fries, salads and the chicken tenders. Food was served fast. They had a great selection of beer. Staff was polite and helped us in making some good choices from the menu. The desert selection is not on the regular menu, do ask the server specifically if you feel like eating desert. We tried the lemon cheesecake and it was delicious. On the outside, it was located near the state house and the place was safe to drive around. There was a small parking lot behind the property but considering the crowd, it may fill up quickly. Street parking was available."
  ]
 },
 {
  "name": "Bolley's Famous Franks",
  "address": "38 Water St, Hallowell, ME 04347, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/218c9c48-932e-11ea-a249-14b31f159f22.png",
  "tags": [
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=264589717890386416",
  "source": "GoogleMaps",
  "reviews": [
   "Donuts - to die for. Fries - OMG yum! Hot dogs - perfection. Burgers - juicy (get lots of napkins!) Reasonable prices. Their breakfasts are good too.",
   "Great fast food, but check with your doctor! The food and service is great! But over eating of anything, well it's good and clean. I'd like to go everyday, but I'm not a young man anymore!!! Check it out!",
   "Best fried clams ever! This Florida baby comes up once a year just for their clams! Service is always phenomenal.",
   "The best homemade donuts and wicked good hotdogs!👍",
   "Delicious hot dogs. Great prices. Quick and efficient service. -1 star for extremely greasy mediocre onion rings."
  ]
 },
 {
  "name": "Café De Bangkok",
  "address": "232 Water St, Hallowell, ME 04347, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/21dce064-932e-11ea-bba5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5988390207907964153",
  "source": "GoogleMaps",
  "reviews": [
   "I got take-out and asked them to minimize plastic and they gave me almost all PAPER containers --you know the old Chinese food ones from way back that work awesome and biodegrade!!  And the food was really good.  I think the food is better than it was several months ago.  It was delicious.  The yellow curry was dreamy and the noodles were really fine.  But the fact that I didn't have to be responsible for eight or so plastic containers is the very best of all! Love them. Everyone offering take-out should go the same.",
   "Great food and service. The sushi rolls were fresh and delicious. Was happy to find this place with a great view along the river",
   "I love the crazy noodle and hot sake. The restaurant itself is a little odd, very open and poor acoustics. Wait staff has always been good. I do prefer to get takeout.",
   "We ordered sushi to go and waited almost an hour to get out food. The sushi was warm and not fresh. Sushi should be served cold. Somebody is going to get sick.",
   "Worst experience ever they call themselves a sushi restaurant but they cant take the crab skin and shell off before they roll it. Totally disgusting the poor excuse of a chef said he wouldn't refund me. I even explained that me and my fiance go out to sushi alot and I have never been more mortified at a \"sushi\" restaurant I've had better sushi at a buffet. Very poor customer service. The front desk lady said the owner wasnt there to speak to me  then the \"chef\" all of a sudden could get me on the phone with him. Once again very poor customer service."
  ]
 },
 {
  "name": "AMATO'S",
  "address": "867 Western Ave, Manchester, ME 04351, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22225b68-932e-11ea-85d5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12518991704981069583",
  "source": "GoogleMaps",
  "reviews": [
   "I stopped into the Manchester, Maine Amatos today on my way home from work today and ordered dinner.  Even though they were very short staffed, Mitchell(the person who waited on me), was so efficient and pleasant I just had to write and thank him for making my trip to Amatos a good decision.",
   "I enjoy the people who work there very much!",
   "I like the real Italian always fresh",
   "It's Amatos, don't expect much and you won't be extremely disappointed",
   "Always super friendly and always get my order right!"
  ]
 },
 {
  "name": "Frye House",
  "address": "557 Maine Ave, Farmingdale, ME 04344, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/227601b8-932e-11ea-b250-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=14468000341876949414",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food! I love good food and have been all over the US and let me tell ya these guys know what their doing. Everything had brilliant texture and moisture to it (chicken is flaky and juicy) and the shakes are well blended and not over flavored like most places. 5 stars from me i will be returning to try more of their menu soon!",
   "Delicious, especially the fried scallops! The fries taste like fair fries, just make sure you add vinegar 😀 The burger is also amazing if your not a fan of seafood!",
   "Frye house gives generous portions and is consistently delicious. It's fresh, clean and a great value. I would highly recommend!",
   "Fry house is one of my favorite restaurants.. not only are they affordable their food is consistent.. and high-quality\ntheir competitor has been around for years yet they have matched if not push forward their standards..",
   "Fast service, good options. Great for take out but a small and cozy dining area as well if you're not getting take out."
  ]
 },
 {
  "name": "Mughal Palace",
  "address": "730 River Rd, Chelsea, ME 04330, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/22d07f40-932e-11ea-a1d5-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4661173692960415298",
  "source": "GoogleMaps",
  "reviews": [
   "Immersive dining atmosphere with authentic Indian cuisine and welcoming service. Large portion sizes alongside the vast menu options. Highly reccomend the butter chicken and peshwari naan!",
   "Had really good lunch. We ordered mild spice which was tasty, probably go up to medium per discussion with owner- nice guy!",
   "This place is our new favorite spot. It’s our comfort food, or go to, our new Christmas Eve tradition. Don’t be intimidated at the prices, everything’s worth it, we always order one dish short for a large group and have plenty of left overs with full happy bellies. We eat out less and just go to this place, guilt free. The food is delicious and despite me mispronouncing most all orders we’ve never had a mistake.",
   "What a delicious and delightful dinner my friend and I had here last night. (We had to order takeout due to the pandemic) Everything was amazing and authentic. We passed by it on the way to our new home the other day and knew we had to try Mughal Palace.\nThe Gobi pakora were amazing as were the samosas. My friend got the daal saag and I got the lamb pasanda and we would definitely order them again, although there are so many other items we're eager to try too. My friend loved the raita and I could have eaten a whole bowl of the green chutney by itself.\nAnyway, give this place a try, it's totally worth it.",
   "This is not just another Indian place . This is authentic food with fresh meat . I would say this is the almost same food I get beach in India . Mutton  tikka masala is Cooked near perfection . Butter naan were fresh . I would recommend you try this place if you are looking for some Indian cuisine with local produce ."
  ]
 },
 {
  "name": "Circle K",
  "address": "284 Civic Center Dr, Augusta, ME 04330, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23211252-932e-11ea-9278-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3643078669413779027",
  "source": "GoogleMaps",
  "reviews": [
   "This store is always busy but they do their jobs well and work at a quick pace so you can get in and out without any issues.",
   "Very cheerful cashier, spreading the Christmas cheer!",
   "Only one person working and a huge line. Not her fault but poorly staffed tonight....",
   "As usual advertised rebate deal. But printer wouldn't print out form. Employee said they don't work most of the time.",
   "Gas smells good"
  ]
 },
 {
  "name": "Mulligan's",
  "address": "926 Western Ave, Manchester, ME 04351, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/237219e8-932e-11ea-bc49-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=940195665620383487",
  "source": "GoogleMaps",
  "reviews": [
   "My mother visiting from Texas had their famous lobster roll. She thought it would be hot with melted butter but instead it was cold with mayonnaise. I explained after looking it up online that it's traditionally prepared cold in Maine. I had a vegetarian pizza. It was very good and I appreciated that they used fresh ingredients- not frozen or canned veggies. They have tables inside and outside if you wish to dine in.",
   "every time we have ordered we have been more than satisfied! The food is delicious and the service is fast courteous! The chocolate pudding parfait is a must!  Give them a try!",
   "Awesome food a people working there !",
   "I've always stopped here for a quick bite when I didn't want to cook. The staff is always friendly and quick, just recently I started working here with the amazing crew.  I am proud to say our food is flying out the door and people are absolutely loving every bit of it! Stop on in for fresh delicious chicken, yummy steak bombs and tasty Italians!",
   "Great convenience store. Has a Krispy Krunchy Chicken and a Dunkin donuts."
  ]
 }
]