[
 {
  "name": "Texas Capitol",
  "address": "1100 Congress Ave, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23b20a54-932e-11ea-b3e7-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "eat",
   "food",
   "tour",
   "history",
   "wander",
   "history",
   "structure",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14659031118466371641",
  "source": "GoogleMaps",
  "reviews": [
   "Great treasure that belongs to the citizens of Texas. There is so much to see and everyone who visits should take their time. My recommendation is to take the 30-minute guided tour first and then go on a self-guided tour just so that you get a little more background on the capital building. There is a basement that has a whole other section and if you visit Monday through Friday you can actually eat at the capital grille which has excellent prices on food. There's a lot of history in the capital and there are photos that explain the restoration, how the capital was restored back to its original beauty, and also highlights the history of the first Capitol building. Don't be surprised if you go and there is a concert on the first floor of the rotunda. The acoustics are fabulous. The exterior grounds are equally as interesting. There are cannons from world war II era and there is a mural that highlights important people in Texas history. A great place and I can't wait to visit again",
   "Absolutely stunning. The details throughout the entire building all have meaning - you can truly spend at least half a day just roaming the halls and examining the various portraits, paintings, light fixtures, etc  and learning their importance to Texas state history. \n\nWhile we did a self-guided tour, I highly recommend taking a guided tour so you can hear more about the stories and meaning behind the many treasures of the capital.",
   "If you enjoy history, and have some time it's a nice location to wander. The grounds are clean with fabulous views of downtown, not to mention the capital is beautiful! The craftsmanship of the builders is on full display and the structure is well maintained. Gawking in the center of the rotunda never gets old 😂🤣",
   "Do You Have What It Takes?\n\nMy wife and I visited the Texas State Capitol Building in May.\n\nAs we were neared the main entrance we were greeted by a man on an electric wheelchair wearing a red \"MAGA\" hat brandishing a Confederate flag next to a sign that read  \"Remember The Alamo\".\n\nIt was at this moment we thought to ourselves, \"do we have what it takes?\"\n\n\"Are we, one Northerner and one Brazilian, worthy of entering the State Capitol of Texas?\"\n\nAs we neared closer the the entrance the man on the electric wheelchair seemed to stare straight into the depths of my soul. \n\nWhat was he looking for?\n\nCould he tell I was born north of the Mason-Dixie line?\n\nWhat should I do?\n\nAs these thoughts raced through my Midwestern mind the man turned his gaze to a woman crossing the main path.\n\nHis turning gaze gave us the window of opportunity we needed to pass by, undetected, into the main entrance where we seamlessly slipped in to an ongoing public tour.",
   "Beautiful grounds and building.  Great history to be seen. Start in Treasury Office and see a photo of the Texas currency prior to it becoming a State.  Grab a self guide tour pamphlet or join a guided tour for in depth info.  For a little bit of fun trivia grab a scavenger hunt page and enjoy!  The fourth floor Bonus question was our favorite!  The grounds are full of monuments celebrating the rich history of Texas contributions to our country.  It also memorializes a time that challenged this Nation with the struggle of States Rights.  The largest of any Capitol building in the entire U.S. including the U.S. Capitol.  Definitely worth a visit, and yes it is made from granite (TX red granite)."
  ]
 },
 {
  "name": "The Escape Game Austin",
  "address": "405 Red River St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/23fbe5cc-932e-11ea-bce1-14b31f159f22.png",
  "tags": [
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=6250885015481600262",
  "source": "GoogleMaps",
  "reviews": [
   "We played The Heist, it was challenging and satisfying to solve! We asked that our game be paced and we used our three clues. Which were perfect clues. They just gave us another piece of the puzzle but didn’t solve the games for us. The puzzles were unique and impressive. They had some show stopper puzzles. We solved in with 7 minutes left and were so excited. I would definitely recommend this place! We were also impressed with staff member Anessa! She was very knowledgeable, gave the perfect hints, and had good high energy!",
   "This place was well worth it. It was 4 of us added another couple whom we didn't know. However we all worked to find clues and figure out puzzles. At the end of the day we all had a great time and would for sure be going back sometime soon. I would recommend as they have a few different options to choose from as well.",
   "awesome place!!! staff is really amazing & friendly. they don’t judge and make you feel welcomed! thank you for having us. i definitely recommend anyone to stop by and have a little fun there’s a few games to pick from all seem like fun but gold rush is my favorite! i will for sure come back.",
   "Great overall experience!  My wife and I have done almost 30 escape rooms.  This is one of our favorites.  Booking was easy.  When we arrived we were promptly greeted and shown waivers to sign.  The greeter was pleasant and friendly.  The lobby was clean and well kept.  The game started on time (always a plus).  We did Prison break.  Super fun room.  Immersive decor and atmosphere throughout.  The puzzles were challenging but we never got \"stuck\", thanks to some well timed and welcomed hints.  The game host was attentive and enthusiastic.  We escaped with time to spare and will be back this week for another room.  If you're in the area you should definitely check them out, whether you are a veteran of escape rooms or have never done one before.  This would be a great choice for any experience level.",
   "This was such a amazing team building experience. Even though we didn’t find everything we still made it out with 39 seconds on the clock. Highly recommend to any teens or adults that want to get closer as a group!"
  ]
 },
 {
  "name": "Barton Springs Municipal Pool",
  "address": "2131 William Barton Dr, Austin, TX 78746, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/244ec236-932e-11ea-81ac-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "free",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16474565573952186553",
  "source": "GoogleMaps",
  "reviews": [
   "Great spot but you really can only enjoy it during the winter months when it's not crowded by the local UT hooligans or the California state jumpers. I've mostly have had to go by the Colorado River part and take a dip or two while avoiding every dog in Austin with their camel Joe looking family. Some of the homeless people will offer to rub sun lotion on you free of charge which is cool.",
   "We didn't go into Barton Springs since it was too cold, but it looked amazing! The water was so clean and calm especially at night time. Also the view was spectacular. I can't believe it's free as well! If the weather was warmer, this looks like the place to be.",
   "Love taking the kids here.  The water is always so nice and cool.  The bathrooms are clean and the crowd is typically very friendly.  Worth the drive up from San Antonio any weekend!",
   "This place is a great place to relax and take a dip. It was a bit cold in February but still was a good time. It’s cool to see the mix of natural and man made features in the pool",
   "This was fun, there's a free side and there's also a side where you pay. The side where you pay is more like a giant pool with natural water in it versus chlorinated pool water. The free side is on the other side of the fenced area and is more natural. You got to get there early to be able to get a parking space though."
  ]
 },
 {
  "name": "Bullock Texas State History Museum",
  "address": "1800 Congress Ave, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/24a4d30a-932e-11ea-82ce-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15204639289390306722",
  "source": "GoogleMaps",
  "reviews": [
   "LOVE THIS PLACE..... the exhibits are FRESH, thoughtful, innovative and enriching.  They give me insight about culture and context historically I didn't know I wanted or needed making time and place more real than I could have imagined!",
   "The staff is amazing. Beautiful museum and if the movies going to be awesome in 3D then you need to see it here. Avatar 3D here was by far the most impressive thing I've seen to this day.",
   "If you are a long time resident of Texas or new to the state or just visiting I highly recommend going to the Bullock! Tells the story of Texas,  Mexico and the Southern states very well with good documentation. Story starts in prehistory all the way through modern times. Also has a IMAX theater that shows all kind of movies. Also has traveling exhibits. Well worth the visit,  more than once!",
   "It is a good place to spend few hours learning about Texas history.  However  they have plenty of space there and I think they can do a better job at selecting more interesting artifacts/aspects of US/Texas history. The place feels empty in some spots and you go  home without too many things to remember.",
   "The Bullock Texas State History Museum (often referred to as the Bob Bullock Texas State History Museum or Bullock Museum), is a history museum in Austin, Texas. The museum, located a few blocks north of the Texas State Capitol at 1800 North Congress Avenue in Austin, Texas, is dedicated to interpreting the continually unfolding \"Story of Texas\" to the broadest possible audience through meaningful educational experiences. The museum is operated by the Texas State Preservation Board, which also operates the Texas State Capitol, the Texas Capitol Visitors Center, the Texas Governor's Mansion, and the Texas State Cemetery.\n\nThe Bullock Texas State History Museum is named after the 38th Lieutenant Governor of Texas Bob Bullock, who championed the preservation and exhibition of Texas history and worked to establish its creation. Bullock was the guest of honor at the groundbreaking ceremony for the museum in April 1999 and died the following June before the museum was completed."
  ]
 },
 {
  "name": "McKinney Falls State Park",
  "address": "5808 McKinney Falls Pkwy, Austin, TX 78744, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/24f194fa-932e-11ea-b271-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=18123339836864710291",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place to visit.  Great hikes, fun swimming.  This is a favorite place to camp.\n\nI would strongly recommend anyone park at the upper or lower falls, visit that falls, then do a round trip hike to the other falls.  It's not a challenging hike at all, but it is pretty and interesting... Especially in the spring.",
   "Nice park 15 minutes outside of downtown Austin.  It’s not removed enough to totally block out the cacophony street traffic and construction, but it’s muted enough to enjoy your surroundings.  There’s a surprising amount of trail miles here that wonder along river banks, meadows and tranquil forest as well as past some historical sites (and the oldest tree in the state!).  The park serves as a nice, welcome escape from the bustle of the city and close enough there’s no excuse not to go.",
   "Great area to hike. Trails are paved, but have hills and turns to keep you challenged. Easy to moderate level of walking/hiking. We only did one trail, which was 2.8 miles. Would like to do them all. Then combine them for a longer day hike!",
   "Great state park close to town (Austin) to go relax, go on a nice hike, and only $6 when it was just me. Good swimming spots too, and one of the trails takes you to a historical house. Great to pack a back pack w small supplies if a long hike but I also saw someone with not much on a run.",
   "A beautiful park to visit. Enormous, lovely Cypress trees along the river banks, nice trails, and of course the falls and swimming area. There is an entrance fee. We paid $10 so I'm not sure if it was $5 each or $10 per car. They do accept credit cards and dogs are allowed (on leash)."
  ]
 },
 {
  "name": "Zilker Botanical Garden",
  "address": "2220 Barton Springs Rd, Austin, TX 78746, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2542a1de-932e-11ea-a828-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "walk",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3143477211538540205",
  "source": "GoogleMaps",
  "reviews": [
   "The layout of the gardens is great because you can make sure you see everything without back tracking through what you've already explored. Not that it would be horrible, it's a garden so it's gorgeous. It is still winter (late February early March), so not everything is beautiful and blooming. So I won't fault Zilker for that, but I do hope they go around the grounds and update all their bee/bug homes (forgot to get a photo). They're pretty run down and look like they haven't been touched on a while. I also wish they had more butterfly and bird houses on the grounds. They have a butterfly garden, but due to the time of year, we didn't see any. But I also didn't see any butterfly homes for them to rest in. There was also an orchid show going on whole we were there, so that was a nice surprise. Great place for families and a great experience for kids to learn about the flora and fauna.",
   "Went in the middle of winter (still a beautiful day), so there wasn’t much color around.  Regardless, a great stroll in a peaceful quiet.\nWas there on a weekday, at about noon, and there were about 5-10 other parties throughout the grounds, so I didn’t really run into others.\nIt is larger than you see at first glance.  Has some nice areas to sit for a picnic, photo shoots, and relax.\nOnly been to a handful of botanical gardens before, but compared to those others, this one is still on the small side, and not very elaborate.",
   "Very nice place. Lots to look at. Beautiful place to take pictures.  We saw one couple taking wedding photos , one couple got engaged in front of the waterfall and many others taking their graduation photos. Beautiful plants and calming walk. A must to see.",
   "Some of the best gardens I have ever visited. There is something for everyone there, kids, adults.. old, young.... Such an amazing place to enjoy in Austin! The azaleas are magnificent in spring and the grounds are meticulously groomed.\nHighly recommended for everyone. An oasis of beauty and tranquility.",
   "I took my kids (4 and 1.5) here and they really enjoyed exploring the trails. The air is so sweet and the views of the foliage are wonderful. The Japanese section was particularly nice. Great place to relax and let the kids explore. Will be back."
  ]
 },
 {
  "name": "Circuit of the Americas",
  "address": "9201 Circuit of the Americas Blvd, Austin, TX 78617, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25948c6c-932e-11ea-9ff4-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "walking",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10009294002508390637",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome place. Went here to see some GT racing and had a blast. A lot of walking but very worth it. Restrooms are very clean with sensor soap and water so you don't have to touch anything to wash hands. They have food and drinks and they range from 6-12$. You can bring lawn chairs and walk anywhere on the property to sit and watch the race. If you love racing and motors, you'll enjoy this place. Highly recommend and will definitely come again.",
   "My wife and I came here for a vacation this year and it was absolutely amazing. The weather wasn't overly cooperative but it was February after all. The event staff was more than helpful and always willing to point you in the right direction. Surprisingly the food and the merchandise was not over prices like my wife thought it would be. We will absolutely be going here again for more races.",
   "Great family fun place! Saw a little bit of F1 Race Cars practicing.  The Kart track racing was awesome! 55mph in a Kart was incredible! Very nice people in general! Check it out if you are near the airport!",
   "Was here for Fully Charged Live event focusing on electric vehicles. It was a great place for a large event. The facilities here are very nice and lots of room for a big show. Would be nice if they had a few larger secondary rooms, at this event the 2nd stage area was packed tight. But may be because the speakers were so good.",
   "We went to the electric car show held here. We tried the cafe that is there. It is a deli style cafe that also sells burgers and fries. It was fresh food and great fries. The staff are friendly and kept the place clean. I did see some people confounded a bit on which was compostable trash and recyclable. Maybe a small picture guide to help? The indoor restrooms are always a plus in Texas! The restrooms were kept clean, a huge plus! The event setup indoors did have good sound control - no resounding echos or cross presenters competing with traveling sound. That is probably helpful since the F-1 track was in use that day. We could hear the track but it was muffled background noise that we were fine with."
  ]
 },
 {
  "name": "Barton Creek Greenbelt",
  "address": "3755 S Capital of Texas Hwy B, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/25f91c66-932e-11ea-bc98-14b31f159f22.png",
  "tags": [
   "hike",
   "pets",
   "hike",
   "walk",
   "nature",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=12826442631111907821",
  "source": "GoogleMaps",
  "reviews": [
   "Can get busy fast so arrive early.   We arrived at 8 am and there were not many people.  When we left around 11:45 the entire parking lot was full.  Good shaded area for hiking with your pets or alone.  The hike is very easy so anyone could do it.   Nice place to visit within the city.",
   "Nice place for a long, but fairly flat hike.  I went on a weekday in December at about noon and it was pretty empty.  Decently peaceful, though you’ll have to go to about the mile and a half mark to completely get away from the traffic sounds of Mopac.\nNot much color nor water when I went, though I imagine the creek gets to be beautiful at the right time of the year.",
   "Austin is an amazing city, growing so fast the city and roads can't keep up. \n There is no real public transportation to most of the city.  Traffic is everywhere. At the heart of this buzzing, growing city, the Barton Creek Greenbelt stands as a work of such visionary genius it seems to make up for everything else!  Escape into woods and streams and rivers and dry creeks.  Walk for miles - days if you like.  Rock climb.   Be in nature - its right through the heart of town.  Central Park gets all the attention but the Barton Creek Greenbelt captures the real magic of beauty and power of nature.  Take a trip there on a beautiful winter day (65 degrees and sunny). It may just change your life.",
   "Beautiful trees and trail but it is far too over used!!! We don't have enough nature to enjoy for the 1M peeps of Austin. Go and enjoy, but tread lightly, be respectful, and don't my leave litter. \n\nIf you haven't heard we're in a Climate Crisis that we started. We're spray billion year old dead plants into the air like The Night King raised the dead at Winterfell. What are we doing? What are you doing?  Why aren't we taking this seriously!?! Our jobs and status are not worth an extinction.",
   "I went there about three times for a research project for Planet Earth, and I personally enjoyed my time there. I would definitely recommend visiting there for fresh air or if you need some green for refresher. There wasn’t any water present when I visited due to fluctuation of water, so make sure to check the water status of the creek.\n\nHave a nice day!"
  ]
 },
 {
  "name": "Lady Bird Johnson Wildflower Center",
  "address": "4801 La Crosse Ave, Austin, TX 78739, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2656594c-932e-11ea-889b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "food",
   "family",
   "free",
   "walking",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=520851327402436129",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place to walk around and let kids play in big green grass area.  You can bring food in. It is wonderful for a picnic.  The flowers are wonderful.  Only neg... Parking can be limited if it is a busy day.      It is not easy to walk through during mid day in the Summer. They do offer extended hours in the evening on particular days.",
   "We love botanical gardens and this was one of the best. Worth the $12 entry for an adult. Walking trails were very easy. Lots of family play areas and picnic areas. Native Texas flowers were coming into bloom. Bluebonnets! Gift store was nice. Tours available and free. Easy to get to and entry of parking on a cloudy rainless weekday.",
   "We came in March and it was a beautiful cloudy cool day. Lots of things were in bloom, like the grape-smelling Texas Mountain Laurel and bluebonnets. So wonderful! Many things will bloom later and it would be worth another trip next month.",
   "This place was so charming and wonderful. It ended up being a perfect day to go walking around this wonderful place. Everything was so beautifully maintained, and the staff was so nice and friendly. Can't wait to go back in the summer when more wildflowers have bloomed.",
   "I never knew about this park. The exhibits were awesome during Fortlandia, great family fun and the park is so spacious and beautiful it’s easy to have a wonderful time with the little ones. The last exhibit was, build your own fort. Which my son and did not hesitate to do."
  ]
 },
 {
  "name": "Thinkery",
  "address": "1830 Simond Ave, Austin, TX 78723, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/26b2369e-932e-11ea-9d19-14b31f159f22.png",
  "tags": [
   "kids",
   "active",
   "kids",
   "kids",
   "family",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5791177094304251559",
  "source": "GoogleMaps",
  "reviews": [
   "The Thinkery is a great experience for anyone who has children that love to explore. The exhibits have very little explanation which motivates you to have those cherished moment with your kids to figure it out. Leading them to use their minds, and create in a way they may not be accustomed to. If you have a day off, and want something new to do then stop on by. You will not regret your experience, and neither will your children.",
   "Awesome hands on place for the kids. They have a blast with all the interactive exhibits. My son love the tech take apart area and my daughter loves the painting wall. There are so many areas to keep the kids busy and active. The playground next door is also amazing. Membership is very reasonable for the year and well worth it.",
   "Great place for kids and adults! Lots of fun things to check out. The price $14 is well worth it! Only complaint is the process they take for adults without kids that want to come In and explore. Kinda awkward, they keep your ID and make you sign something. Great for keeping kids “safe” I guess but kinda uncomfortable if you just want to check out the inside. I felt like I learned more things from this  museum then I do with most museums! Info on plaques is easy to comprehend and super educational! I really loved this place but prob won’t be back since I don’t have a child to take in with me. But over all this place is so fun and interactive for the whole family!",
   "great place for young kids. There is plenty to do plenty to explore and plenty to learn at this facility. This is a great hidden gem that everyone visiting Austin should try to visit if they have children under the age of 12. There's an outdoor facility that really helps with them in their motor skills and figuring out how to maneuver obstacles. There are healthy snacks available. There are several areas for kids to explore different aspects of life and help them with their cognitive thinking and motor skills. Currently the cost is $14 per person for all over the age of two. The ticket is good for an entire day's visit and it's very well worth it.",
   "The Thinkery was absolutely awesome.   Went with the whole second grade from the school I work at.  I was so surprised at how much there was to do.  Our students had so much fun that I wish we would have been able to spend more than just two hours there.  The staff was really friendly starting with the lady that gave our students the speech on where to go and how to act inside.  She made it fun and very kid friendly."
  ]
 },
 {
  "name": "Mayfield Park and Nature Preserve",
  "address": "3505 W 35th St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/270d47c0-932e-11ea-a15c-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=16810831707813911808",
  "source": "GoogleMaps",
  "reviews": [
   "when I lived in the area this was one of my favorite places to visit. The tranquility, the peacefulness,  the ponds with the koi fish, and all of the flowers make this a place that you can just sit and stay for hours. The peacocks are in the trees they're on the house they're on the grounds and some of them can be quite friendly and come right up to you. it's a great place to take kids it's a great place to just walk around and take pictures of flowers. I have several pictures of the flowers and peacocks that I've taken over the years and I've given them as gifts and people treasure them.",
   "This place was absolutely breathtaking. I felt so in tune with the atmosphere around me. The peacocks  were stunning. Thank you for this wonderful experience. It was the perfect send off back to Michigan.",
   "The best time of year to visit this park is definitely in the spring since the garden has gorgeous flowers in bloom. That said, while the park grounds were undergoing some restoration and thus looked a little sad compared with their typical state (including a couple of the fish in the pond that I'm pretty sure were dead), the peacocks still seemed happy to roam the grounds and roost in the trees, and the preserve trail was gorgeous with the tail end of fall leaves adding bright red and orange here and there. I can only imagine what the park looked like a few weeks ago, and if I manage to visit next fall I'll bet that will turn out to be my other favorite time of year to visit.",
   "My life is accomplished after getting to see so many beautiful peacocks and peahens from such a short distance. And who knew peacocks sit on tree branches! A must go, at least once. The park is free and not so very crowded. You can spend 30 minutes and leave with content eyes!",
   "The Mayfield Park and Nature Preserve is a very beautiful park to visit. There are a few small trails in the back right part of the park that loop around the parking lot making it very difficult to get lost. The garden was also very lovely the only complaint I have would be that the flowers were not labeled by their name rather by the volunteers names so I had no idea what type of flowers I was looking at. There was also a coipond that had many fish in it and a few peacocks that were roaming around. There were a lot of great places for a photo opportunity. In addition for the trails I would recommend comfortable shoes because it can get rocky at some points."
  ]
 },
 {
  "name": "Ann W. Richards Congress Avenue Bridge",
  "address": "Congress Ave, Austin, TX 78704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/276888be-932e-11ea-ab73-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "walk",
   "eat",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14341732068178455807",
  "source": "GoogleMaps",
  "reviews": [
   "Even though it was too early for the bats, this is a gorgeous walk. The parks along the banks of the river offer several activities including rowing. Lots of photo opportunities, including this little overhang off the walkway. The area is very clean - cleaner than I thought it would be. I would come back often if I lived there.",
   "It's a bridge. It conveys cars and pedestrians. There are trails underneath. Sometimes, I'm told, there are bats, but none were to be seen in early March. But it's a very effective bridge. Maybe not the most attractive bridge in the world. But a bridge nonetheless.\n\nOverall, I honestly think it was an 6-7/10 bridge and I'll tell you it lost points for lack of flair or style. I'm going to give it 5 stars for the Google review though because it did its job well and it's really my fault for coming to Austin so early in bat season when you think about it. I'll re-review next time we're here.\n\nAgain, good bridge.",
   "Here to watch the bats. Pretty amazing! The bridge alone is great but I'm sorry, too many homeless laying around the streets and asking for handouts. Kind of scary for families wanting to walk around without fear.",
   "Those pesky bats haven't been trained very well! They were late and flew out on the wrong side of the bridge...... actually very nice views in the area, well taken care of area and a good sized crowd the day I went. Would recommend going to see if you\"re in the area, be prepared to wait, since the bats  still need training, but they will come out.",
   "Went across this bridge for regular sports of transportation around Austin. While walking across early evening I saw the extraordinary sight of the bats flying out from under the bridge in order to go eat for the night. I had never seen anything like it. It was quite incredible."
  ]
 },
 {
  "name": "Austin Aquarium",
  "address": "13530 US-183 #101, Austin, TX 78750, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/27c10476-932e-11ea-a4ec-14b31f159f22.png",
  "tags": [
   "kids",
   "knowledgeable",
   "kids",
   "walk",
   "active",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14266381592025822419",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place for Kids and Adults. This place is a little on the smaller side, but it more than makes up for it with its interactive exhibits and range of exotic animals. Want to hold an exotic bird on your wrist? Pet a stingray? Or have a pair of lemurs run across your shoulders? This place has it all.\n\nMake sure to research their 'Token' system, as this is about 1/2 the cost of the attraction. These let you feed animals and get into the more expensive 'interactive experiences'.\n\nThere is a wide array of animals, so the fact that this place is called an aquarium is more of a technicality. Fish, Birds, Reptiles, and even an Octopus!\n\nThere's even a play area and other fun surprises that will leave a lasting impression for those visiting with young ones. Definitely a great weekend activity for anyone who enjoys animals",
   "Excellent place, tons of fun for kids. To fully enjoy the experience you have to buy quite a few tokens.  One of the managers Alex was super helpful. And very knowledgeable. He Brought out a snake for kids to see and hold.  He made the experience awesome! The best experience was the lemur encounter.  Kids loved feeding the stingrays as well.",
   "This place is spectacular when it comes to entertaining your children. The reptiles, birds, monkeys, and all the interactive activities is amazing. Make sure to have your children have shoes on otherwise they cant enter the activity areas. Overall loved it and would ho back a 100 more times if I could.",
   "This place exceeded my expectations beyond belief. It was amazing. Yes, it's smaller than most aquariums but the amount of interactions can't be beat. They say when you walk in and get ready to start that \"if you can reach the animals, you can touch the animals...\" That pretty much describes the experience. Hands down loved it.",
   "All of the animals here are extremely healthy and active! Great for both kids and adults. It’s in a shopping plaza and it looks more child-friendly on the outside but once you get inside it’s honestly one of the best aquariums I’ve ever been to!"
  ]
 },
 {
  "name": "Covert Park at Mount Bonnell",
  "address": "3800 Mt Bonnell Rd, Austin, TX 78731, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2803952e-932e-11ea-a40a-14b31f159f22.png",
  "tags": [
   "hike",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12535247186597342205",
  "source": "GoogleMaps",
  "reviews": [
   "Lots of fun with nice views of the river and the city skyline. It is a disappointingly short/easy hike; you'll get to the top in about 10 minutes or so. Still, a pleasant visit especially with friends or family and food in tow. I'd recommend you find some other activity to pair with it since this doesn't take much time at all.",
   "Wonderful views of the Texas Hill country right outside of Austin! Also,a good place to take people from out of town to show them Austin. It's nice to see the fancy homes too.",
   "Mount Bonnell is an iconic Austin view I adore to share. It's definitely a destination for out-of-town visitors or locals who have never seen it need to be taken there. Beautiful view. Amazing sunsets. Also gorgeous in the morning when it is quieter. I have visited many times since a child and ensure others are able to enjoy it also.",
   "This was our first time here. The view is amazing. Well worth the small climb up the stairs. Awsome photo ops too!",
   "Great view and wonderful vibes. Came here after a work camping trip with the crew to enjoy our return home to Austin. Took some time to enjoy the park and the skyline of our home town"
  ]
 },
 {
  "name": "Blanton Museum of Art",
  "address": "200 E Martin Luther King Jr Blvd, Austin, TX 78712, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/284b4e7e-932e-11ea-b230-14b31f159f22.png",
  "tags": [
   "art",
   "organized",
   "walk",
   "free",
   "art",
   "free",
   "art",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=13749455008237930349",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful museum, though small, shows off a wonderful variety of pieces. From American to European, to Latin America and more, the art on display are delightfully thought provoking some even being interactive. The gift shop/cafe was also very nice. I recommend if you have time, or are showing a friend around who enjoys art museums to give this one a shot. It's very clean, organized, and the staff are polite. It's a very pleasant experience overall.",
   "This was an interesting museum. A must visit if you are into arts! It's got arts of all kind(classical paintings to sculptures, modern to abstract kinda). This place also has a building that is also an art installation. Pretty cool place to walk around and appreciate classic works of art. Plus, you get free access if you're a student at any University of Texas campuses. Just have your I'd on you.",
   "This museum is absolutely beautiful. There is artwork from multiple time periods and genres. Overall there is a really great collection. The museum is clean and very open and spacious. I would definitely recommend going if you are ever in the Austin area.",
   "The Blanton has a great permanent collection of art from various eras and styles, as well as excellent rotating galleries and pieces. The permanent pieces bear repeated contemplation, and the museum is free (as of this review's writing) every Thursday courtesy of the Moody Foundation! It's also open late every third Thursday of the month.\n\nThe museum validates parking in the garage next door for a very affordable rate, so it's easy to stay as long as you like!",
   "It is conveniently located close to where I was staying @ AT&T Convention Center hotel. There's a museum and a separate Cafe & Gift shop. The little Meditation building on-site is stunning. Inside the museum, ($12 per ticket) the architecture is very appealing and several comprehensive exhibits, all well displayed by subject, type of media, or date. \nHighly recommend."
  ]
 },
 {
  "name": "LBJ Presidential Library",
  "address": "2313 Red River St, Austin, TX 78705, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/28a86462-932e-11ea-83a7-14b31f159f22.png",
  "tags": [
   "nature",
   "library",
   "historic",
   "family",
   "library"
  ],
  "link": "https://maps.google.com/?cid=9308350639075832188",
  "source": "GoogleMaps",
  "reviews": [
   "Architecture of the building is amazing. Inside has a great atmosphere, as it is a large open atrium at one point. My favorite idea of the museum is that it relates bills signed into law into how they affect current everyday life. They could provide more detail, but it is something I've not seen in other Presidential museums. The oval office is neat, and NASA is a personal favorite of mine, so it was awesome seeing a moon rock, and learning that LBJ sponsored the legislation in the Senate and President Eisenhower signed the law creating NASA. This is one of the better Presidential museums!",
   "A must for those who remember the 60's, although all of LBJ''s life is represented. This was a complex man, despite his aura of unflappable stability. Many items displayed from familial, state capitol and White House stock. Ease of layout means free-flowing viewing without a need to double-back or divert direction erratically.. The museum's planners deserve an 'A' for effort and accomplishment. A 'must see' in Austin.",
   "My 60's era President. Introduced a passed monumental legislation. Got the job done. Vietnam did him in though.  He was truly a force of nature. Museum is very well done.\n.",
   "The LBJ Library is a great experience. Seeing all the president's papers as you go up the grans staircase is inspiring. The exhibits are rotated frequently enough so it doesn't get stale.  If you are a total wonk, make an appointment to go through the archives. When done enjoy the great lawn outside the library and maybe take a stroll on campus.",
   "The LBJ Library is a thoughtfully engaging museum incorporating not only the incredible accomplishments of President Johnson and Lady Bird, but the state of the world during the 1960's. From 5,000 hours of phone conversations to 45 million pages of historic documents, this museum gives in depth insight into the presidency of Lyndon B Johnson, as a president, family man, and social worker. There are plenty of interactive exhibits, videos, letters, and photos to keep you entertained throughout the three floors of the museum, finishing with the Oval office replica on the 10th floor."
  ]
 },
 {
  "name": "Walking Tours of Austin",
  "address": "242 W 2nd St, Austin, TX 78701, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/28e6f4f8-932e-11ea-a2f3-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "history",
   "walking",
   "tour",
   "tour",
   "walk",
   "knowledgeable",
   "family",
   "tour",
   "learn",
   "tour",
   "walk",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7529027348005530976",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoyed our morning walk tour with Jim! He shared many small tidbits and facts that made the experience very interesting. He also took the time to answer individual questions we had. And we could feel his passion and love for Austin! We highly recommend this tour with Jim if you want to learn about Austin history in a short and easy walking tour.\n\n-Che & Munjuli",
   "I took this tour last night with some friends that were visiting and we all loved it. Jim has great energy and is an excellent storyteller/historian. His knowledge and passion for the stories he told was infectious. Definitely recommend taking his tour!!",
   "Jim was FANTASTIC, very knowledgeable and passionate. We throughly enjoyed our ghost walk tour and would encourage all to make it part of their Austin experience. We would definitely do another one of his offered tours. Thank You!\n- Chicago family",
   "Great tour with interesting stories told very well by Jim.  He was a great guide and it was definitely a different way to experience and learn about Austin that we enjoyed very much! Thanks Jim!",
   "This was a fun tour that touched on Austin history, supernatural hauntings, and a serial killer! Not a bad walk at all. Our tour guides were enthusiastic and kept the crowd's attention."
  ]
 },
 {
  "name": "Greetings From Austin Mural",
  "address": "1720 S 1st St, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/292f3452-932e-11ea-8f0c-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=18260568494574457353",
  "source": "GoogleMaps",
  "reviews": [
   "Huge iconic mural in south Austin. Make sure you go inside of Road House Relics to see some other cool stuff and get some really neat Austin souvenirs, and maybe even get the chance to meet the famous Todd Sanders!",
   "This mural in Austin is so vibrant and looks exactly like the picture. It is the perfect place to tale some touristy pictures and there was great lighting in front of the mural. You also do not need to step that far back to get the whole picture in the frame which is good. I would definitely recommend visiting this mural if you ever visit Austin.",
   "A very beautiful and well preserved mural. It is too easy to spot as it always looks bit crowded. We had to wait to get  in to take photos. This is directly on the road , because of which it also affects the traffic because many tourist literally stand center on the road to click pictures in different angle. The road is a busy one.",
   "Great place to take a picture if visiting Austin. Generally not too busy so you can get a quick photo and leave. A lot of restaurants and shops nearby too.",
   "So so so easy to find. It’s actually downtown on the side of a business. I thought it would be on the highway as you enter. I was able to take lots of photos and other people were willing to help. But you do need to stand in the street or across the street to get the whole painting in the photo."
  ]
 },
 {
  "name": "Pennybacker Bridge",
  "address": "5300 N Capital of Texas Hwy, Austin, TX 78730, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/297a2174-932e-11ea-b3b3-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "hike",
   "hike",
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=15822908396058364497",
  "source": "GoogleMaps",
  "reviews": [
   "There’s a small trail to climb up a hilltop where visitors are allowed to see the magnificent bridge and the lake overview. Parking is on the side of the road and free but may get busy with lot of visitors. Kids have to be little carefully as there is no ropes to safeguard them. The hike itself is not that complicated and can have fun time on the hilltop.",
   "360 view point and you can get a view of Austin downtown near to the bridge. The bridge gives an iconic prestige view to the Austin area. You can enjoy the evening sunset over the bridge and it gives elegance feeling.",
   "Beautiful Bridge in Austin. Great place to relax and enjoy the sunset. Also great outdoor for some photo ops. There is a little hike but the view is worth it. Bridge, Colorado River, Boats and Sunsets gives a perfect composition.",
   "Great place to bring family and friends visiting from out of town. The view is amazing! Make sure you wear sneakers and are able to climb up the slippery rocks. My mother had difficulty getting up to the top. If your visiting Austin be sure to stop here!",
   "Beautiful trail! Views of the river, bridge and lots of green. Easy hike that turns into narrow path"
  ]
 },
 {
  "name": "Peter Pan Mini-Golf",
  "address": "1207 Barton Springs Rd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/29d541ae-932e-11ea-bde1-14b31f159f22.png",
  "tags": [
   "art",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4546098976964668771",
  "source": "GoogleMaps",
  "reviews": [
   "7 bucks a person (cash only), and I definitely think it's worth it if you have a couple of friends you want to bring along. There are only two courses, and each took my friends and me about an hour and a half for each. They're open late, so it's good for evening golfing. Some of the sculptures for the holes are... interesting to say the least. You can tell the artwork is more in line with the art styles of when the place opened (1948!), but they're well made and stand for a good laugh/photo shoot. The only thing I didn't like was the assortment of empty/half full beer bottles along the sides of some of the courses. They weren't in the way, but it would be nice to have seen a little bit of cleaning up, although we might have just come at a bad time, it was a Saturday night after all so who knows. Overall, even though the place is a little old there's lots of fun to be had at Peter Pan Mini-Golf, definitely would go again!",
   "This was a fun place.  It was great to experience a small part of Austin's history.  It was nice to see the history articles at the end of the West course too.  I will say though that although I enjoyed it this was probably the worst mini golf course I've even been to.  I get that it's old but the greens were covered in leaves and debris, the cement was in a state of disrepair, the carpet needs replaced where it's worn thin, and the night lighting is so bad you can't see all the deformities in the cement under the greens.  Needs some pretty extensive maintenance and walkway lighting to help with the shadows but overall I'm glad I finally did it.",
   "Although this place is quite old and seems rather run-down, still there were a lot of people around, and my 7 year old daughter really had a great time. The décor is rather interesting. They have two courses, and you will have to pay per course, only by cash. Parking can be a bit of a problem. It’s a good way to spend an hour or two with kids.",
   "Great afternoon activity for a group. Make sure you bring cash (cash only) and ask at the front which of the two sets of holes is less busy. BYOB with lots of kitschy statues on the holes so you know it’s gonna be a good time.",
   "VERY crowded, but everyone moved right along. Pretty nice courses and reasonably priced at $7 per person with an additional 18 holes for only $4 more.\n\nThe only negative I have is that the greens should be swept/vacuumed a little better than they've been doing it."
  ]
 },
 {
  "name": "Museum of the Weird",
  "address": "412 E 6th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a28c9cc-932e-11ea-844f-14b31f159f22.png",
  "tags": [
   "kids",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=10430403330259199010",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun. An eclectic collection of oddities. Some taxidermy of mutant farm animals, neat wax statues from movies and such, and a fun side show. Guy with a three legged dog gave us a great show. We were lucky to have him as a guide too.  We got some stuff from the store front. Worth checking out in smaller groups.",
   "Nothing super weird about it, but enjoyable nonetheless. I took my 9 year old daughter and she said the best part was the special show at the end. I agreed. It is a small \"museum\" in the back of a gift shop and I personally think the admission is too high for what you get. This is best for kids and those who don't generally know about weird and unusual things or oddities (like me).",
   "Definitely worth a visit. We took our toddler daughter with us and she enjoyed it too. There are some areas that you have to be really careful with young ones though to make sure they're not getting handsy with displays.",
   "I LOVED IT! The people were amazing and so nice. The things that were displayed for us to see were really cool and interesting. My favorite part of it was when we went to see the little side show. He was funny and really cool, what he did was really cool. I HIGHLY recommend this place.",
   "My boyfriend & I came here and wow what a great way to start our, “ keep Austin weird” journey! We decided to take the tour and it was only like $13 a piece. This included admission to the museum, a tour, and a little show at the end. The museum itself is not very long but it is packed with odd stuff I won’t spoil! Then we were taken by the tour guide and his adorable 3-legged dog. We walked the building and he told/showed us a lot of interesting things ( that I won’t spoil either) and we ended with a fun show with a lot of surprises that might make you squeal! He was an awesome tour guide, super funny and made our tour great. Also had a cute dog! He accepts tips at the end via cash, Venmo, etc in case you don’t have cash on hand.\n\nSide note: I was scrolling through some reviews, many of the bad ones seem to be bad because they didn’t know what to expect so here are some tips for people wanting to go\n\nIf you go take the tour, the first part is a little area not very big of “freak show” type stuff like 2 headed animals and whatnot, then the tour guide will come and take you around the building to the Minnesota ice man, then to a room with wax figures of characters such as Frankenstein and a good photo opp with King Kong, then you will see the tour guides show. It is very entertaining, some may find it “gross” or too eclectic, if you do not like it or find any part of this, “satanic” or that your children cried and you found it offending then I suggest you grow a backbone."
  ]
 },
 {
  "name": "Umlauf Sculpture Garden & Museum",
  "address": "605 Azie Morton Rd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2a731a9a-932e-11ea-91d8-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "art",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4128896571516237611",
  "source": "GoogleMaps",
  "reviews": [
   "The grounds are beautiful and peaceful;  UT campus has Austin's other concentration of Umlauf sculptures. The 2nd Sunday of the month is family day, free admission, sculpture seek-and-find by age, and musical or educational entertainment. Details on their website (some family days aren't on the normal schedule due to holiday overlap).",
   "A very calm and relaxing place to indulge in nature and mesmerising sculptures..... People take their time looking at all the sculptures there....some sit on the benches for hours, painting or reading books.... They have a little waterfall near the entrance and you are able to sit at the top of it.....There is a little walkway and a canopy leading to it from the sculpture garden. It is a very romantic place for art or nature enthusiasts.....It's very close to a dog park and the Botanical garden....So if you are looking for a quieter place around the area, then this is your spot.",
   "WOW\nThis artist really was at the height of his craft!!!\nBeautiful. Inspiring. \nFilled w emotions.\nBring a friend!",
   "What an intimate gem! Space, light, sculpture, water, flora breathe a collective life into the artistic and ambulatory  experience. I still walk the hallowed grounds of the Nelson in KC whenever I find myself there, but return to the Umlauf I shall , anytime",
   "Interesting sculptures. Nice grounds. Not far from the botanical gardens. My wife and I have been there a couple times now when visiting Austin."
  ]
 },
 {
  "name": "Austin Zoo",
  "address": "10808 Rawhide Trail, Austin, TX 78736, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2ad31a12-932e-11ea-bf6f-14b31f159f22.png",
  "tags": [
   "kids",
   "knowledgeable",
   "family",
   "kids",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5054540521410942947",
  "source": "GoogleMaps",
  "reviews": [
   "The animals all look happy and healthy. The staff is very nice. And it's very kid friendly. You know I've been to a lot of zoos and it's a smaller one, but I could of spent hours there. My niece and nephew got tired. But only spending 11.95 for a great experience priceless. And it looked like they are expanding. My point is the animals looked not stressed out I saw a mountain lion peacefully sleeping in a tree. We walked by the wolf exhibit and they started howling. And they have a petting and feeding the animals part that the kids loved. It great I'm going back again next week. If there was a ten star rating I'd give it that.",
   "There is always a possibility for a close up encounter. Absolutely love the wildlife here. Foxes and wolves are by far my favorite of them all. It is a small zoo but they are here to protect and rehabilitate animals which I find far more important than bringing in animals for the sake of having them as an attraction.",
   "They have a decent amount of animals. They have all kinds of monkeys, alligators, lions, tigers, parrots, wolves, sheep, llamas, peacocks, etc. It is very family friendly as well. This zoo saves animals. They had a few animals under vet care. The staff is very friendly and knowledgeable. My 10 and 13 year old kids loved it. It has a train for the smaller kids, an ice cream truck, gift shop, and you can feed the animals for an additional cost.",
   "Such a great little zoo and something I can feel good about supporting because every animal is a rescue. There is a lot to see and the peacocks that roam free across the whole zoo are beautiful. Just a really cool experience all around",
   "My family loves this zoo! It's not this huge place or grand. It is just a friendly and nice sized zoo. I feel this zoo does try to respect the animals and most are rescued. Child friendly and handicapped accessible."
  ]
 },
 {
  "name": "Lake Travis Zipline Adventures",
  "address": "14529 Pocohontas Trail, Volente, TX 78641, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b17c59a-932e-11ea-b818-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=13077092507426058584",
  "source": "GoogleMaps",
  "reviews": [
   "This was one of the best times I’ve ever had in my life! So dang fun and the thrill was amazing. The boat ride there and back to the mountain was beautiful and relaxing. Our tour guides were the absolute best, they took their time with us up the hill and let us get plenty of breaks. All why telling us hilarious stories and jokes. Please request Lucy and Tonya, they are the best! \n \nCharlotte Listerine aka Shirley  lol",
   "I had an absolutely amazing time! Amanda was a wonderful guide, she had us laughing and entertained entire time. She was very engaging with her entire group, and gave random factoid’s during the trip. She was also very considering of our entire group, whenever you go here definitely ask for Amanda!",
   "Best Zipline experience I've had. Been Ziplining in California, Florida, and a few spots in TX now. This is the safest and most beautiful course I've been on. Two guides accompany you the whole way. They clip you in and make sure you get on, take off, stop, land, and dismount safely. No obstacles or rope courses to climb. Just hiking and zipping. It was also great to have adult guides. Joseph and Charlotte were extremely fun and professional at the same time. We (me and my 3 daughters ages 11, 13, and 15) all wanted to give them hugs when it was all done...but that would be awkward. Also...drinks for 21 and over.\nNo regerts 😊",
   "Tonya & Lucy took my Wife, son,that's 8, and I on a Zip Tour today. Super fun. The staff was amazing. Highly recommend to all ages.",
   "Beautiful scenery, great hike, extremely friendly staff, and very nice zip-lines. The price is a little too much and I would’ve really liked it if they used a better camera for taking pictures of the tourists. Most of their pictures were blurry. I still highly recommend the place and the experience."
  ]
 },
 {
  "name": "Austin Nature & Science Center",
  "address": "2389 Stratford Dr, Austin, TX 78746, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2b653040-932e-11ea-8bf7-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "free",
   "wander",
   "kids",
   "free",
   "family",
   "kids",
   "hike",
   "walk",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6972521043423707181",
  "source": "GoogleMaps",
  "reviews": [
   "I loved seeing the animals that were there and the beautiful plants. I would love to go there again. Its also a great place to bring your kids to learn a bit about wildlife. I recommend going, I'm sure others will love it as well. There are also some fun activities that you and your kids can do there as well.",
   "Free to visit, but they have a little donation box in the visitor's center, so we left what cash and change we had. They have a lot of birds of prey as well as a raven and a bobcat. There are also reptiles and bugs. It's on like 80 acres, so they have some nice hiking trails to wander around. Great place to take children or go on a date.",
   "A lot of free fun to be had, great place to take your kids. Multiple animal exhibits, plenty of scenery for family photos, and the Dino Pit will tire out the most energetic member of your crew. If you have a family, I highly recommend setting aside a few hours for a visit.",
   "This is for kids and is not a museum. So it wasn’t what we expected. That being said we found an awesome hike out past birds of Prey!",
   "Great for kids AND adults! Nice quiet and serene place to walk around and learn. My kiddos LOVED the dinosaur pit where you can excavate replicas of large fossils. So fun!"
  ]
 },
 {
  "name": "Hippie Hollow Park",
  "address": "7000 Comanche Trail, Austin, TX 78732, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2bb5c69e-932e-11ea-a27c-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6245484632170711332",
  "source": "GoogleMaps",
  "reviews": [
   "The turn sneaks up on you if you aren't watching for it. Also, they only accept cash or check at the entrance for a pass. Come on a day with moderate overcast for perfect solace. There are two trails/ paths. Don't take the left one that goes up along the mountain if you have issues with cedar.  That path is full of the stuff. The path on the right next to the service entrance gate l follows the coastline by the water. There are also restrooms along the path (thank gawd). To get close to the water I think #8 is the best stairway to take along the trail.",
   "My wife and I visit Hippie Hallow at least a few weekends each summer. It's a long drive from Dallas just to go there but we do anyway making a weekend of it and enjoying Austin night life.\nThe place is clean, it's safe, we've never been bothered. Of course there are some walkers with dark glasses kind of taking in the sights but that's understandable. My wife seems comfortable and I am as well. We have actually made some friends out there and shared the same tanning area.\nIt's a fun and relaxed place. It's always a good practice to be non judgemental as you'll see all sorts of body shapes and sizes. We usually carry a cooler with food and drinks, funny alcohol is allowed but you can not display it. Listen and be forewarned, it can be dangerous walking down to the Waters edge, notice I didn't say beach. It's very rocks and finding a flat spot can be a challenge. Just be careful, you do not want to fall down, especially in the buff!!\nThank you Austin Texas for allowing this to exist. Austin, the heart beat of Texas!!\nOh, there's and entry fee, and it does often reach capacity meaning you'll be turned away!! Get in early on a beautiful day.",
   "Second time here and I love it. Water is cold as expected during January but the sun was bright and warming. Got some melanin charged!",
   "Great place to tan. No lines. Water was warm. People were friendly. Will go back when weather is better. I invite everyone to come and be free in your own skin. Relax and enjoy yourself.",
   "To truly understand yourself you must go into the wilderness completely naked in front of complete strangers to understand that your mind is the true enemy. Being nude is complete freedom & Hippie Hollow is the place to start."
  ]
 },
 {
  "name": "Auditorium Shores at Town Lake Metropolitan Park",
  "address": "900 W Riverside Dr, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c143b7e-932e-11ea-98c6-14b31f159f22.png",
  "tags": [
   "eat",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=6276687789387309616",
  "source": "GoogleMaps",
  "reviews": [
   "We actually saw 2 fresh water otters there in the pond next to the Palmer Events Center which shocked us since we have never seen otters here in Austin. Also to have seen the otters there instead of the lakes here in town or swimming holes. I have lived here 32 years and I have never seen this before. I do hope that no one goes there and messes with them!",
   "Went to the Texas Roller Derby Girls show  tonight at the Palmer Events Center. Always great craic,  that's \" Gaelic \"  for fun.  Tonight was the Holy Rollers. Vs  the Cherry  Bombs. The wifey , mother in law and friend had great night. Would recommend for a good night out. It is on the fringe side of Austin's  eclectic community so you see a great cross section of our wonderful city. Well worth a visit.",
   "Beautiful landscape. Went to work out with a friend the people there are friendly polite and sharing. Big park and lots to do. The ppl there make you want to enjoy your time there. Visit and you will be glad you did!",
   "Amazing facility with incredible views. Great parking with so many places to eat around the area. It's a wonderful place for photos, picnics, and just to sit and read a book.",
   "Beautiful area. Great dog park. Clean walking trails. And most importantly Stevie Ray Vaughn."
  ]
 },
 {
  "name": "Stevie Ray Vaughan Statue",
  "address": "210 Ann and Roy Butler Hike and Bike Trail, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2c620fa4-932e-11ea-981d-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=4863867422637644911",
  "source": "GoogleMaps",
  "reviews": [
   "I visited Austin in April 2019 and spent a lot of time at the Stevie Ray Vaughan Memorial. He was one of the greatest musicians of the 20th century and certainly a tribute to the state of Texas. I love his music because  he played from his heart. In Stevie's own words, \"I use heavy strings, tune low, play hard and floor it.\"",
   "I enjoyed seeing this statue, but wouldn't suggest seeking it out unless you are a solid Stevie Ray Vaughan fan. Greetings from Austin, Texas, USA",
   "Good spot see the Austin skyline and hike/walk around.",
   "The memorial is set on the Colorado River with a picturesque backdrop of Austin. A fitting tribute for a Texas Blues Legend.",
   "SRV is a staple of Texan culture and was a hell of a musician. The park itself is a great backdrop for a statue well worth seeing if you're a fan of the man. Make sure to pay close attention to the cool details (ie. the ring , earring, etc.)"
  ]
 },
 {
  "name": "Cathedral of Junk",
  "address": "4422 Lareina Dr, Austin, TX 78745, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2cbc3f54-932e-11ea-b364-14b31f159f22.png",
  "tags": [
   "kids",
   "unique",
   "tour",
   "art",
   "structure",
   "family",
   "art"
  ],
  "link": "https://maps.google.com/?cid=12821393960957175584",
  "source": "GoogleMaps",
  "reviews": [
   "BE SURE TO CALL AHEAD AND RESERVE! This is his home in a private neighborhood and you must call ahead. Adult entry is $5/person. \n\nA must-see in Austin! Vincent, the artist, is welcoming and friendly. Had a great time wandering through corridors and up and down staircases, peering closely at conglomerations of knickknacks. Great photos, nostalgia, whimsical creations, and impressive structural creativity.",
   "I visited a week ago with my kids, and they had a blast. We had fun exploring and can't wait to go back. It's a fun place to take out-of-town guests to give them the Austin experience.",
   "A different way to spend an hour in Austin that isn’t eating tacos or drinking. Definitely a sight to behold, and a cool feat of human tinkering. Minus a star for the seeming  reluctance of the artist/owner to acknowledge the level of notoriety this exhibit has reached, and not yet setting up a simple website, or even just adding a few pertinent details on the google maps listing. Unless you read through multiple reviews, you wouldn’t know until arrival that the structure is located in the artist’s backyard, in a residential neighborhood. There is a faded hand-scrawled note on an old drum in the front yard that says “By Appointment Only” - extremely easy to miss. Luckily the owner was out attending to other guests when we arrived, so we apologized for showing up unannounced (though we had tried calling multiple times during our short 3-day trip and there was never an answer nor a machine message saying not to show up without a confirmed appointment) and paid a $5 donation before entering his back yard, where the structure is. The artist is a unique person, and has a way of speaking that can come off as pretty rude or blunt. It’s understandable: he views it as allowing random strangers to show up at any time and tour his backyard for a small donation. And as an outsider/visitor/google map peruser who stumbled across this “outdoor art gallery” listing with no website or hours or other info, I viewed it as this dude being a bit brash in his tone when you think you’re simply arriving to look at some public art. All this to say, I see both sides, and just think it would serve him (and purveyors of local art & culture) well to set some viewing hours, and a simple website link with an appointment plugin. So that’s my suggestion, and reason for docking 1 star. Other than that, yes it was cool & you’ll probably enjoy it. (And hey if you’re not super sensitive like me, you won’t get hurt feelings from his tone and you’ll REALLY enjoy it!)",
   "Definitely an interesting art installation. It was an inviting place and lots of junk to see which was turned into artwork. I felt like some of the pieces had peaceful messages. I took my family to see the place and although they were a bit hesitant about seeing it, they ended up really enjoying it as well.",
   "Such a cool experience! Vince is very talented and gracious to allow people into his own private property for this. Try to call ahead and park on the crossroads to reduce traffic at his house."
  ]
 },
 {
  "name": "Lockout Austin",
  "address": "1700 S Lamar Blvd Suite 327, Austin, TX 78704, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d13f8e8-932e-11ea-a62d-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17389939075199082394",
  "source": "GoogleMaps",
  "reviews": [
   "It was really scary and anxiety inducing. That's the name of the game, though.\n\nWe were in a group yesterday or the day before with a trio of kids who were former DC interns getting together in Austin. There was one girl who was extremely impressive with the puzzles. She said I was admirable, but like, ethically. It had nothing to do with the puzzles. Generally good vibes. Hope she's doing well, wherever she is.",
   "We had a great time. Fun staff and helpful. Played the enchanted chamber. Lots of fun. Would love to have a lockout in my town!",
   "This was my first escape room and I was not to excited to go but everyone in our group had a blast I highly recommend.",
   "So much fun. Puzzles were the correct hardness and everything worked out so well. I’ve done a few other escape rooms, this was the best. Watch out for Crazy Mike!!",
   "Hands down the best place for a live escape room experience, since they have actors acting the prolog! Their bookings are not private, but they accept walk-ins a few minutes prior the beginning of the game and pretty much we never had anybody other than us in a room like that!Their themes are awesome and you can complete most rooms as a couple. They have limited hints, so make sure to ask them at the right time. My husband and I loved Cursed Ship. Great experience!"
  ]
 },
 {
  "name": "Mexic-Arte Museum",
  "address": "419 Congress Ave, Austin, TX 78701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2d5ebba4-932e-11ea-8ec1-14b31f159f22.png",
  "tags": [
   "educate",
   "walk",
   "art",
   "art",
   "free",
   "art",
   "walk",
   "art",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17718997533140222831",
  "source": "GoogleMaps",
  "reviews": [
   "Super small and not a lot of art to call a museum in my opinion. 7.00 just to walk a few feet.\n\nThe gift shop was nice and tons of cool items.\n\nThe staff was incredibly RUDE. The little girl at the gift shop register was miserable and unwelcoming. Not to just to our group, but others I witnessed. I noticed there's been other reviews about a girl in the gift shop being rude. Her daddy must own it, can't get fired and miserable cause of it. Just my guess, why else would they keep such bitterness on staff. I was embarrassed she was a representation of the Mexican culture at such a place that supposed to celebrate and educate on my roots. Shame.",
   "A nice space with an interesting variety of work. When we went it was a collection of graphic art. I very much enjoyed the exhibition of  12\" x12\" works from local artists on a common theme that is used to fund their local projects. \nWith a visit!",
   "This place has more of a gallery feel than a museum you can even buy the art in the second half. It's worth noting that it's free on sundays and the day of the dead stickers in the gift shop features popular characters from every genre.",
   "This museum caught my eye walking by, and I was blown away by the pieces inside. I loved how local art was displayed and highlighted. The themes were moving and spoke to me. As a native Texan and Latina, this experience was humbling and inspiring. Whatever walk of life you come from, please stop by and see what meaning you glean from this special gallery. Whether you're looking for beauty, emotion, or something else, you'll walk away with something important.",
   "What a terrific museum.  I highly recommend Mexic-Arte Museum.  So many amazing print artists!    I can't wait to come back."
  ]
 },
 {
  "name": "Texas Military Forces Museum",
  "address": "2200 W 35th St building 6, Austin, TX 78703, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2da743e4-932e-11ea-a411-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2891917103710051996",
  "source": "GoogleMaps",
  "reviews": [
   "A free museum in which you can spend a healthy 1-2 hours checking out all sorts of military items?  Sign me up!\nAwesome place to check out tanks, planes, attire and so much more of what our armed forces (mostly, if not all, Army) utilize.\nI really enjoyed the D-Day area.  Lots of great info!",
   "Fantastic free museum. Definitely worth the visit. Lots of great history and some really fun interactive portions. And don't forget to check out the Jets and cannons on the parade grounds.",
   "My boyfriend and I went here on a date. It was very cool and interactive as well. There was much too see, from planes, to trucks and tanks. We got too sit in a cockpit, and you also have the option to try on some Uniforms. So very neat all around. The historical sections are great for learning and visualizing everything that happened in historical wars or major events.\nThere was also a cute little shop for suvanears and gifts. This museum was probably the better part of that day in Austin.",
   "They have a great array of informative exhibits from the different wars. There is a cool fighter jet that you can climb into for pictures, as well as full army uniforms for the kiddos to try on. They have tanks, wagons, and more. I think there may also be stuff to see outdoors but we went on a rainy day and stayed inside. It was cool and more importantly...free.",
   "A wonderful place to go on the weekend or anytime! The exhibits are easy to follow and entertaining. My family and I have visited more than once, and I'm sure we will return."
  ]
 },
 {
  "name": "Elisabet Ney Museum",
  "address": "304 E 44th St, Austin, TX 78751, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2dfc6aee-932e-11ea-b147-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "kids",
   "art",
   "kids",
   "art",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7738470496051917648",
  "source": "GoogleMaps",
  "reviews": [
   "This studio museum was amazing to explore.  Love Elisabet Ney and her husband's history. The studio she designed was equally impressive.  Her clay sculptures were beautiful,  including the last piece she  had worked on before she died, Prometheus! This place is a must for anyone visiting Austin. Architecture was incredibly designed and built by her, totally functional and resembled a  small castle.",
   "Free to public..museum had docent (guides) to help you around or if you want to go alone cheat sheets.  I love the fact it's free and about a female artist that I didn't ever hear about before.  Please go to the web site and vote for them.  More of these hidden gems need to be saved.  No bathrooms..and staircases to climb.",
   "Such a fun little museum. They have a lot original plaster casts and a couple marbles. The building and lot were awesome with secret doors and a bookcase door that we got to look at. The kids loved all the secrets. Nice little contemporary show of wall art in one room that is has rotating shows.",
   "Awesome history and displays of art. Staff is very knowledgable , no question they can't answer. Great place to take kids who love art also.",
   "The grounds and landscaping here are beautiful! It’s so nice to just walk around, especially on a warm spring day like today."
  ]
 },
 {
  "name": "Mueller Lake Park",
  "address": "4550 Mueller Blvd, Austin, TX 78723, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e4fbc66-932e-11ea-955e-14b31f159f22.png",
  "tags": [
   "field",
   "walk",
   "kids",
   "family",
   "music",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14315970095901078493",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun park where you can easily spend half a day. The field is perfect for lounging or pickup games and picnics. The lake is great for strolling around, and there is lots of wildlife like turtles, ducks, and fish. The playground is very fun, well maintained, and safe. Public restrooms are available just next to it so you'll never need to go far. In the spring the trees bloom making it the best time to visit, and in the weekend the best farmers market in the city  is next door. It's an overall great park that's worth multiple visits.",
   "The farmers market is great on Sundays and the path is a great spot to walk your dog. If you have kiddos, there is a neat park and one of the restaurants new by has a play ground thing in there. My dog and I enjoy seeing all of the geese/birds at the pond.",
   "I took my niece and nephew here for the day and they had a blast. My nephew ran around the lakes my niece couldn't get off the playground. It's a great place to spend on a Sunday with kids with family or with friends. Don't be surprised if you see a couple of dogs running around; they're usually friendly too. They have live music concerts, holiday events and almost anything else you can think of. The farmers market on Sunday is a must I highly recommend it to anyone in town even if you're just visiting",
   "One of my favorite areas of Austin. I have spent many years in Mueller watching it quickly rise. The lake brings great energy and an abundance of animals scattered through out. \n\nGreat environment to bring your kids and dogs to play. You can spend a whole day here with countless activities to participate in. They stock the lake with rainbow trout once a year where fishing is permitted.\n\nAs you can see I enjoy practicing yoga, as well as setting up photoshoots with my business here. \n\nIf it’s a beautiful day outside I highly recommend checking out Mueller Lake Park.",
   "This park is so clean and pretty. My husband took me out here for a walk and i really liked it. It was so peaceful even though there were many people. The air was fresh and even on a hot summer afternoon, it was breezy. You can do a picnic here while enjoying the lake view. It is also pet friendly. Its also nice to come pit here for a run."
  ]
 },
 {
  "name": "Texas Memorial Museum",
  "address": "2400 Trinity St, Austin, TX 78705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2e95c95e-932e-11ea-aea2-14b31f159f22.png",
  "tags": [
   "family",
   "walking",
   "history",
   "kids",
   "kids",
   "cheap",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3432920704519923478",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place it has 6 floors a nice variety of fossils & minerals. It's a great place to be with your family to see fossils minerals and even dissected animals. The stairs can be a little bit of a work out too if you are not used to walking much. The second floor is where the main entrance is and the first floor is underground.\nThey have a nice little shop which to be honest have ripoff prices because I'm not about to spend $15 dollars for a little rock. Overall it was a good experience.",
   "Great state natural history museum accessible for all ages. The main entrance is the second floor which is a nice geologic exhibit that has an amazing skeleton of a Pterasaur dangling from the ceiling. The first floor (basement level) has a beautiful assortment of prehistoric skeletons that showcase life found in Texas before recorded history. It's a great museum for everyone.",
   "Great spot for all ages! Their exhibits are well explained. The dinosaurs from Austin, Big Bend and around texas are amazing. This is an inspiring spot for kids who are interested in fossils, paleontology, geology and the natural world. There are even large fossils from around Austin!",
   "One of the more underrated gems in Austin's weak museum scene. Not the largest museum out there, but they have a great collection of fossils, minerals and Texas wildlife exhibits on display, as well as opportunities to interact with scientists in those areas. Good place to pass an hour or two with the kids, especially for the price.",
   "Our first time here and our 3 year old son really enjoyed it as did my husband and I. I see some complaints about how it used to be free but they charge now, the building is old and is only getting older and upkeep and salary (i.e. security guard and gift shop) is not as cheap as it used to be back in the day either. It was a well $19 spent for our little family. We were there for about an hour and a half."
  ]
 },
 {
  "name": "Allens Boots",
  "address": "1522 S Congress Ave, Austin, TX 78704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2eda9fc6-932e-11ea-89bf-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10758570619703789610",
  "source": "GoogleMaps",
  "reviews": [
   "I spent well over an hour trying on boots and getting assistance from Andrew. Spectacular selection of traditional boots, but not really riding or work boots. They were great about finding my size if I saw a style I liked. Since I was traveling, they shipped my boots to my house and I had them in 3 days! Great place, go find your perfect boot!",
   "Loved this cute store! You can find boots, hats, belt buckles, bags, clothes and all sorts of cool things. Everything is good quality and the variety they have is unmatched. I would definitely recommend it if you’re in the market for some leather goods.",
   "I very rarely get to come this way, and it's always a treat going to Allens. The amount of artfully crafted footwear at large ranges of pricing, including great sales, is a true sight. I had the opportunity to bring someone this time around who was mesmerized at the sheer amount and variety of beautiful boots, and got to relive the experience in their eyes. There's a boot for every style and personality, the staff is very cordial, attentive, and it's overall a great experience. Even if you're not planning on buying a pair, I thoroughly recommend a visit to this magical land that smells of leather and wood.",
   "Where do I begin?!? So many gorgeous boots to choose from. Most importantly,  the grear selection and reasonable prices are even made better with the quality of boots offered. As if that was not enough,  the Stetson hat collection and belt/buckle selection is really good too. A must see in Austin.",
   "I walked in here not expecting to find a boot that actually fit my foot, but ended up with a pair of luccheses on sale that fit perfectly. Noah was the best. He helped me so much and was very friendly and a pleasure to talk to. I loved my experience in this store and expect you will too."
  ]
 },
 {
  "name": "Sculpture Falls",
  "address": "Barton Creek Greenbelt Trail, Austin, TX 78746, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f1f7214-932e-11ea-a32a-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=1951849506294715484",
  "source": "GoogleMaps",
  "reviews": [
   "The hike down the hill of life is not bad, the hike back up after swimming is the challenge. Bring water, and a backpack if you want to bring anything else. Totes and other bags can make the hike more difficult. \n\nWater had warm and cool spots, warmer the further up stream you were. With it low like it is now, you could easily stand in most parts.",
   "Beautiful place. Cristal clear water. Be sure to clean up after yourself after visiting this place so it can stay that way.",
   "This is our absolute favorite swimming spot right now. Easy hike down, maybe 20 minutes. Be sure to have shoes for the water, rocks are very slippery. We bring a couple of lightweight camping chairs and sometimes our hammock. It's a beautiful spot and dog friendly!  Enjoy!!",
   "Beautiful place with very shaded hiking trails. It’s beautiful no matter what season you go to visit there. The trails are pretty long but it’s worth the hiking. I always love to go after a rain because the creek and falls are full with water and it’s just an amazing experience. Lots of people go their to swim as well. It’s another hidden gems of Austin.",
   "Lovely spot. Busy on nice days. Too many dogs off leash."
  ]
 },
 {
  "name": "UT Tower",
  "address": "110 Inner Campus Drive, Austin, TX 78705, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2f797aa4-932e-11ea-9166-14b31f159f22.png",
  "tags": [
   "library",
   "historic",
   "historic",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15208178884767857649",
  "source": "GoogleMaps",
  "reviews": [
   "The major landmark of UT. Make sure to take a photograph of this iconic tower if you visit UT Austin. Extremely scenic place and well maintained.",
   "I've always loved it and now I work in it. The people inside are as great as it appears on the outside. Built for rollerskating librarians with dumbwaiters to deliver books, what more do you want?",
   "Loved the library, would like to have an information sheet about how to use the projectors in the discussion rooms",
   "Historic University of Texas Austin Tower and observation deck. There’s fountain in front of it and a turtle pond behind it. The state building is facing towards it.",
   "Such a lovely campus, the buildings are beautiful and the UT Tower, so historic.  It was so nice to take a slow drive all around the Tower and see it from all sides. It was 107° that day, so walking wasn't a option for me. Another 'Must See' here in Texas."
  ]
 },
 {
  "name": "Austin Visitor Center",
  "address": "602 E 4th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/2fbdfef6-932e-11ea-a75a-14b31f159f22.png",
  "tags": [
   "tour",
   "drink",
   "knowledgeable",
   "tour",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=13728048775468674139",
  "source": "GoogleMaps",
  "reviews": [
   "Love Austin just wish I had more than a day to spend there. So much to see. Highly recommend The Duck Adventure Bus Tour!",
   "Open to air bus tryp in the city of Austin, the bus not only take you on the road tryp but also on the water. One tryp gives you two type of experience!! The drive of the Bus/Captain of the ship give a good commentary which gives the information about the city and make the tryp interesting and exciting. The tryp is arount 1hour and 15 minutes long and being you back to the starting point.\nThere is a sovinere shop in the center from where you can buy the memory of your tryp to Austin USA.",
   "A very cozy visiting center in Austin. Great atmosphere and great service. I highly recommend!",
   "Harrison is a great help and resource. I asked about lockers and he mentioned bag check, and was going to go out of his way to see if he could find lockers near by. What great staff!",
   "This is a great place to stop and check in. Awesome knowledgeable people ready to give great advice about the city and awesome places to visit, eat, and drink!  Our tour met there as a starting point. But we got there a bit early and had a chance to peruse all of the amazing items. My group ended up deciding it was worth it to come back after our tour and buy some goods. Bottom line cool place to stop and cool off. Get info and even a cold water or soda to go with you."
  ]
 },
 {
  "name": "Harry Ransom Center",
  "address": "300 W 21st St, Austin, TX 78712, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/300605ba-932e-11ea-a894-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=2120310770481742037",
  "source": "GoogleMaps",
  "reviews": [
   "Open to the public, the collections housed here are beautiful and intriguing. However, the limited exhibition space limits the scope of these collections. Also, it's focus on literary material limits it's appeal to many. The building itself was very clean and the staff were quite friendly.",
   "Great literary and photographic displays. \nFriendly staff.\nBeautiful space.",
   "Absolutely fantastic repository. I was so impressed with the two photography exhibits up right now. The curators did such a great job. I don’t think I will forget them any time soon. The selections from the Arthur Miller papers were also very cool and I have to give props to the processing archivists for getting a collection of that size ready for researchers in two years. The staff here were also very friendly and helpful, which is sadly quite rare with rare book and manuscript repositories. It is definitely worth a trip to the HRC if you’re in Austin.",
   "This is a must see while you’re in the Austin area. This museum is small but also free. They do except small donations. There’s a Frieda Khalid painting, the first ever photograph, and a Gutenberg Bible. An incredible amount of history in such a small space. The staff here were helpful and friendly. There are not large bags allowed. You do have free use of locked lockers. There is a small exhibit on at this time, which I assume rotates. There is no free parking for this building.",
   "This place is always fun to visit. They have really well put together exhibits, but it's not overwhelmingly large. Plus it's free, so you really have nothing to lose."
  ]
 },
 {
  "name": "The Contemporary Austin - Laguna Gloria",
  "address": "3809 W 35th St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/305a0226-932e-11ea-9b93-14b31f159f22.png",
  "tags": [
   "art",
   "nature",
   "free",
   "unique",
   "art"
  ],
  "link": "https://maps.google.com/?cid=18166194945307176024",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely peacock sanctuary full of art and picturesque nature nooks. Located down the street from scenic Mt. Bonnell.",
   "So worth it! The exhibits are so fun and interactive! Spend a beautiful day outside! Lots of parking. Pretty sure it’s free Tuesday. And if you buy admission you get admission to both museums: this on and the one on Congress.",
   "I found out about the Place through some friends and I'm really glad I found it because has some pieces from some amazing artists. Would highly recommend this place to anybody looking to spend a few hours in the beautiful Park and as a tourist fell really welcoming into Austin plus the staff was really nice at the help desk.",
   "Fantastic museum with low admission fees. They even participate in Bank of America's Museums on Us program. Friendly staff and the outdoor sculpture garden is initially confusing but once you orient yourself, it's pretty easy. Lots of cool and unique pieces. Worth a visit if you're in the area.",
   "It's hard to beat an outdoor sculpture garden that's also on the water! Definitely worth a visit for the location itself. The art is quirky and fun, but definitely very modern. You can go into the house and see a few of the rooms on the bottom floor. Your ticket also gets you access to the Contemporary Museum on Congress."
  ]
 },
 {
  "name": "The Contemporary Austin - Jones Center",
  "address": "700 Congress Ave, Austin, TX 78701, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30a84ab6-932e-11ea-a480-14b31f159f22.png",
  "tags": [
   "affordable",
   "art",
   "art",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13336695189358342550",
  "source": "GoogleMaps",
  "reviews": [
   "Close to UT and if you are hungry, they can accommodate. We took our son here after the marathon, and he ate all of his steak and the parts of the ample portions that my wife and I could not finish.\nWe all had different cuts of meat and all were excellent. The staff was very good also.",
   "The curation of the exhibits was excellent and the staff were friendly. It was also not too crowded when I went during a Sunday afternoon, which was welcome. The gift shop, although small, had lots of interesting gifts with that local \"Austin\" flavor. Last but not least, ticket pricing is really affordable for people from most backgrounds.",
   "We had an amazing experience here. The staff was extremely friendly and helpful. The art was very moving. For me especially “The Boundary of Life”. Many great artists work here! We enjoyed the day pass to the outdoor exhibit as well and was well worth it. I believe we only paid around $10 to get in which included the dual admission. Highly recommend to anyone and for all ages! Thank you for making our trip to Austin more memorable.",
   "Cool modern art museum with a great city view from the rooftop. We will be visiting here often.",
   "If I was on Food Network's \"The Best Thing I Ever Ate,\" the The Contemporary Austin - Jones Center would be one of the places on my list. Can you say \"raiment delicious\"?"
  ]
 },
 {
  "name": "Jourdan-Bachman Pioneer Farms",
  "address": "10621 Pioneer Farms Dr, Austin, TX 78754, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/30fa15a2-932e-11ea-8b8d-14b31f159f22.png",
  "tags": [
   "hike",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8733940930740036104",
  "source": "GoogleMaps",
  "reviews": [
   "I was here because Austin's first Annual Witch Fest was being held there. The feel of the place made you want to dress old worldly. As the tiny hippy with me and her mom said...it was like a western in color....I had so much fun and the vendors were wonderful. I say it was a success.",
   "Went for Witch Fest. Hope you host it again next year. The place is BEAUTIFUL. Need to take the kid to check it out on a regular day. Blacksmith work is wonderful. Love my new knife.",
   "Really great place for a nice hike or a picnic. Bring sturdy walking shoes, drinks and snacks! Very small shop in front but they are often sold out of food",
   "Came here for witchfest. Lovely people, great experience. Long lines at food booth but that is common sense with so many hungry people. Be prepared. \nI will come back. Definitely.",
   "This farm is really cool. We were here for the Austin Celtic Festival. The place is a lovely venue. We weren't allowed to bring water in, probably because gin and vodka look the same. There were no places that we could find for refilling our drinking water after we had to dump them out at the gate. :'("
  ]
 },
 {
  "name": "Willie Nelson Statue",
  "address": "310 W 2nd St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3143f142-932e-11ea-a31d-14b31f159f22.png",
  "tags": [
   "walk",
   "music"
  ],
  "link": "https://maps.google.com/?cid=11270736958746284011",
  "source": "GoogleMaps",
  "reviews": [
   "So cool that Austin celebrates Willie with his own statute. It's close to the park by Austin City Limits. Worth the short walk.",
   "That's cool I love willie.",
   "Super cool. And he sits in from of Austin City Limits. Great venue for music. Legendary!",
   "Statue of one bad mofo who brought the cowboys and the hippies together.",
   "Meh... I like the Stevie Ray Vaughn statue better"
  ]
 },
 {
  "name": "Texas Capitol Visitors Center",
  "address": "112 E 11th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/319cea26-932e-11ea-8acd-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "free",
   "tour",
   "free",
   "history",
   "drink",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16999015886122381305",
  "source": "GoogleMaps",
  "reviews": [
   "My 8 year old daughter and I had a very enjoyable time visiting the Texas Capitol Visitors Center. The lady at the help desk was very informative, friendly and had excellent tips and advice for our time in the visitors center and the Capitol itself. We learned so much information about the Capitol. There is a kids page they can fill information out as they go along at the help desk with crayons. Upstairs there is a 2 sided, more detailed fill out sheet that my daughter and I used. We spent an hour and 1 half here easily. Right now in one of the rooms there is a Lego replica of the Capitol building. It's amazing!",
   "Not the most exciting thing you'll do in Austin, but it's free, interesting, and air conditioned, so why not?! Check out the gift shop and tiny O Henry museum (a single room, but still well done) downstairs, and go upstairs for an interactive kids' area and some more information about how white people settled in Texas.",
   "Wonderful building with lots of Texas history.  Worth a look. Took the guided capital tour. Its FREE.",
   "Fantastic place at night love the way it's lit up",
   "Wonderful stop for a quick visit, (but if you're in a hurry, then skip it).  Informative & little museum on the 2nd floor provides the history of the State Capitol building.  A neat little gift shop, and travel center with brochures for all of Texas.  (Restrooms too.) No food or drink allowed.  Great place to cool down too!"
  ]
 },
 {
  "name": "Twin Falls",
  "address": "3918 MoPac Expy, Austin, TX 78746, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/31f321e6-932e-11ea-8af7-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=12931726311197197370",
  "source": "GoogleMaps",
  "reviews": [
   "Fun hike with a couple of falls when there is water but ours was dry.  It's pretty rocky but our 3.5 year old was able to do it with help.",
   "It was dry when we hiked (3/11/20) but it was enjoyable especially because the weather was cool. Michael's Tree was a great stop.",
   "Water is good to bath only during spring/fall and is seasonal. During summers its very dry n pond looks dirty with stagnant water.\nGood place to place with family/dogs",
   "Relaxing hike. On the short side of things, but you could make it longer if needed. Shaded most of the way. Dry bed in winter. We would come back.",
   "Had a lot of fun out here with the pups! Barton Creek is mostly dried up this time of year so we walked the creek bed which can be a little slippery after a sprinkle so be careful. Definitely a recommended trail if you haven’t been before. It’s even better when the waters back so you’ll want to return in the spring time for both experiences"
  ]
 },
 {
  "name": "Statesman Bat Observation Center",
  "address": "305 S Congress Ave, Austin, TX 78704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3246e8e4-932e-11ea-afd1-14b31f159f22.png",
  "tags": [
   "unique",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10755031983697065841",
  "source": "GoogleMaps",
  "reviews": [
   "A must see! I can’t believe that many bats came rushing out from under the bridge! They just kept coming! Also what a beautiful sunset.",
   "It's a pretty neat experience to see all the bats come out and circle around. There are hundreds of bats.",
   "If you get there early enough, you can get your very own stone to sit on. \nYou’d think that for all the people who turn out every night that the city would provide some proper seating.\nThe bats are amazing.",
   "Wow! Such a neat experience. There are so many different vantage points to enjoy the bats coming out from the bridge and the scenery is amazing with the skyscrapers and the water. There were an incredible amount of bats flying everywhere!",
   "It is quite a unique thing to see millions of bats flying around in a single area! You need to be down there after sunset to see them, but they will always emerge. Sometimes if it is too hot out, it can be hours before they finally come out. They are down in Mexico for the fall and winter, so certain times a year it's not something you want to try and do as you'll be staring for hours without a single bat passing by. Definitely recommend taking the kids, or a date down here! Bring a blanket, bug spray, some drinks, and some snacks and you will have fun!"
  ]
 },
 {
  "name": "Haunted ATX",
  "address": "501 N Interstate Hwy 35, Austin, TX 78702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/329cfa58-932e-11ea-aeed-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "tour",
   "history",
   "family",
   "knowledgeable",
   "tour",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14496764632509931195",
  "source": "GoogleMaps",
  "reviews": [
   "The wife and I had a great time. Got this as an anniversary gift for the wifey and myself. Had a blast. Our tour guide, Jane, was awesome. Keeps you captivated with the haunted stories, with just enough comedy to break the ice. Would recommend for anybody new to the area, or wants a tour of some of the haunted history of Austin.",
   "My wife and I did the herst tour with Diane for our anniversary and it was so much fun. We loved  visiting all the placing and learning a little bit of history and having lots of laughs. She was such a great tour guide and made our trip memorable",
   "I surprised my family and friends with a night off the beaten path! Super cool creepy night!!! This guy scheduled plenty of spots for us and filled the night with all the spooky stories!!! The night starts with a scheduled pickup in a hurst and your off. The event is reasonably priced room enough for our group of six.",
   "A group of us did this tour in their 12 passenger van. Our tour guide was amazing! She was very knowledgeable and did a great job of giving the history and facts behind all the locations we visited. The tour gained us access to some cool places that we would've never been able to see otherwise. BYOB in the van is a nice touch and the van was in very good condition and fit 11 of us pretty comfortably. Definitely worth the time and money to check out this tour!",
   "I took my brother on a private hearse tour and we had the big white hearse and Diane. Both were fabulous and it was SO fun to have an entire hearse (that carried MANY bodies in its heyday) to ourselves. I knew it was BYOB but Diane had a bucket of ice, water and sodas for us which was a lovely touch.\n\nWe were picked up at our restaurant and dropped off at our hotel, in between visiting four haunted places. Thankfully, the tour itself wasn't TOO creepy (though you bet I kept looking at mirrors) but it was chock full of history, actual images from the places we visited with hauntings and packed with personality as Diane was SO great. \n\nI can't recommend this tour enough and throw in a few extra bucks for the hearse, trust me!"
  ]
 },
 {
  "name": "Red Bud Isle",
  "address": "3401 Redbud Trail, Austin, TX 78746, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/32e619fa-932e-11ea-9fbe-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14172216614050782431",
  "source": "GoogleMaps",
  "reviews": [
   "Being not far from the downtown Austin and one of the rare islands on Lake Austin, Red Bud Isle is quiet and nice place to spend an hour or two. It is dog friendly, but even if you don't have a dog, you will enjoy. Parking is very limited,  less than 20 card at a time, so be prepared to wait, or come by bike or walk to here. There are many bald cypresses and fee red bud trees which bloom right now from end of February to mid March. In summer might be too hot and the swimming is not allowed.",
   "Nice little idyllic spot to chill with my dog. The fishing is not great here, but it's always relaxing so I keep coming back. It's off-leash, and most dogs we encounter here are well socialized. I rarely hear any scuffles going on.",
   "Excellent place to take the dogs off leash. No need to worry about them going anywhere because the park is surrounded by water!",
   "A gorgeous place to take your dogs for a walk  offleash!!\nVery clean and fun for hiking!! \nThis is by far my favorite dog park!!\nParking is a bit tight, but it's really worth it!!",
   "Outstanding off leash dog park. Parking spots can be hard to come by though."
  ]
 },
 {
  "name": "Before I Die Wall Austin TX",
  "address": "206 E Elizabeth St, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3336d36e-932e-11ea-91a2-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4518486115452345578",
  "source": "GoogleMaps",
  "reviews": [
   "Super cool mural that you add your own goals and dreams to. It's a little off the beaten path but well work it. The plant is right in front of the mural. The house is next door but also really cool!",
   "Novality idea in S. Austin. It literally is on the back of someone's garage in a residential neighborhood. GPS got us there just fine. Fun.",
   "Its cool, but trees in the way if you have a huge group. We went and wrote as small as we could fit all of the dreams. They have chalk for you there to be able to write on the wall. Its so cute! What will you do before you die!",
   "This ATX community prize is a great idea, and I am glad that the idea is a reality where people can dream! You can take the wife, girlfriend, kids, or go at it alone like in the shower!  Just be sure to read others dreams and wishes and respect everyone as you write your deepest secrets or some brash fantasy involving whip cream and 2 brunettes! Either way enjoy it and remember kids visit this ATX community to do the same with chalk!",
   "Top 50 things to do in austin, local home owner put up a before I do chalk board and it's really cool to add your own to it for others to see"
  ]
 },
 {
  "name": "Capital Cruises",
  "address": "208 Barton Springs Rd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/338d8080-932e-11ea-865b-14b31f159f22.png",
  "tags": [
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15391392047702082198",
  "source": "GoogleMaps",
  "reviews": [
   "This was a a wonderful cruise. Our guide was very informative. Beautiful Austin skyline on one side and the park on the other side. Great to view bats under the bridge (unfortunately January is not month for Bat viewing since most of them fly to Mexico). Reservation highly recommended as tours can get full quickly.",
   "Great tour guide and great experience! Every tour guide is different and ours had a lot of fun facts and knowledge about the bats and the surrounding area. Amazing view of the bats especially during the warmer months when they venture out further. I'll definitely be going again soon!",
   "Took the Bat Watching Cruise. It was great weather and the operator of our boat was informative and entertaining. I really enjoyed the whole cruise in Lady Bird Lake.",
   "Beck was incredibly informative and funny! Could not have chosen a better company to go with!! The bats were an incredible sight, really worth going, plus we saw a generous amount of other birds too.",
   "Had a great time with my wife and children on this bat viewing excursion. We had fun, and yes, we saw bats, lots of them!\nOur tour guide Georgia was awesome. She shared so much info about the city, and her passion was authentic Austin, not some imitator looking for a pay check. She even suggested some local restaurants for us to try after the tour. \n\nI suggest you have reasonable expectations during this outing, the bats do what they want to do when they want to do it. There was one customer with the most sour of attitudes, first off she was about the size of the boat, and her poor husband looked ashamed of her obnoxiousness. Poor guy. \n\nWe saw this swan before the sun went down. Had a great time.\n\n(Edit typo)"
  ]
 },
 {
  "name": "Escapology Escape Rooms Austin",
  "address": "2000 S, I-35 Ste E2, Round Rock, TX 78681, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/33ea6f3a-932e-11ea-83b9-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=507473259122034522",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing experience, I design puzzles as part of a hobby but this was still a fantastic challenge. Reasonable priced, and even accommodated my walk in. Devin was very knowledgeable and nice even when she came to tell us we failed and drowned in the submarine. 6/5 stars. I will be back to try the other rooms!!!!",
   "We recently tried the Assassination Express escape room w/our son, daughter in law & her mom. We weren't sure about doing this adventure but our family swore it would be fun. They were right! We had one hour to solve a mystery and escape the room. Lo and behold it took us 57 minutes & 46 seconds to save FDR in 1932. We loved the escape room and highly recommend it to anyone! Our Game Master and Escapologist, Christopher Ambriz, was a great guide into our time travel mystery adventure. Make sure to bring family & friends as it's more fun with a group. Escapology is worthy of it's 5 star Yelp review.",
   "My friend recently planned a girls night for me to celebrate my birthday and this was my favorite part of the night. We enjoyed the Nuclear Annihilation room! The whole thing was well thought out, professional quality and full of surprises. The staff there that night explained what to do and not to do in a very clear and friendly way. We will all be returning to try the other rooms!",
   "I took my team to this great escape room, 17 people, college educated folks, some with engineering background, some with language background. They all loved it. We were split into 3 rooms, a virus theme, a nuclear theme and an assassin theme. All teams completed their challenge on time and had to really work together to make it happen. Fun!",
   "Amaizing place! its worthy to spend time with your friends and family members, they providing 4 different themes with diffrent difficulty levels and the stuff are very kind & cooperative."
  ]
 },
 {
  "name": "Visit Austin",
  "address": "111 Congress Ave Suite 700, Austin, TX 78701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/343017fa-932e-11ea-98d2-14b31f159f22.png",
  "tags": [
   "unique",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15173645697666008755",
  "source": "GoogleMaps",
  "reviews": [
   "To Travel to Austin, Texas is worth your while because of its awesome location, unique weather, and enjoyable activities. When it comes to weather in Austin, You either have very hot weather or very cold weather. There are many places you can visit in Austin. You can visit Barton creek where you could swim for the whole day, the Alamo, a little south of Austin, and not only can you see some of the many lakes in Texas, but you can also go boating on them!  Most of Texas is Fields of cotton and cattle, but the cities are the complete opposite! They are Packed with People and Cars Rushing like a wolf pack to get to work. Texas is also famous for its brisket which is incredibly good. Traveling or moving to Austin, Texas is worth your time because of its awesome location, Unique weather, and enjoyable activities. That is why you should travel to Austin, Texas sometime.",
   "Beautiful space & great people.",
   "If you need help with any form of conference..both personal (family reunion, wedding, etc.) or business (huge conferences, business meeting, team building)",
   "Visit Austin perfectly showcases the commitment, quality, and dependability our industry strives to maintain. It is an outright pleasure to be a small cog in the wheel that makes this city so welcoming and unforgettable.",
   "Has the size and location you expect in a convention center."
  ]
 },
 {
  "name": "You're My Butter Half Mural",
  "address": "2000 E Martin Luther King Jr Blvd, Austin, TX 78702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/347e6c9c-932e-11ea-bd41-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=10188880700273085128",
  "source": "GoogleMaps",
  "reviews": [
   "While in Austin my husband and I visited all the murals we could in one day and this was, if not my very favorite, one of. \n\nIt has a super convenient place you can put your phone to set a timer and take the picture and it has a little blurb on a podium that you can read about the mural. \n\nSo cute! Made it into one of our Mixtiles covering our living room!",
   "Recommend visiting while site seeing in Austin! It's an iconic Instagram worthy mural!",
   "AMAZING pictures and even had a phone stand to take photos if you don’t have an extra person!! street parking available, as well as a few spaces in the United Way. when we went there was no line!",
   "This mural Photographs beautifully. Great for taking selfies in front of!!",
   "It's just somewhere to snap photos.\nThere's also a place that'll hold your phone so you can do selfies."
  ]
 },
 {
  "name": "Live Love Paddle",
  "address": "1610 E Riverside Dr, Austin, TX 78741, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34d2826c-932e-11ea-8a11-14b31f159f22.png",
  "tags": [
   "tour",
   "walk",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11217537932921000007",
  "source": "GoogleMaps",
  "reviews": [
   "Thoroughly enjoyed kayaking down the river with Austin city buildings in the background.  This was the first time ever on a kayak and it was exhilarating. The staff were very informative and helpful in mounting and dismounting the kayak. They also had tandems and paddle boards. Fun for all ages. They supply everything you need for a good time. And it was inexpensive.",
   "10/10 would recommend! \nEveryone who works here is super friendly and made it feel like we were old friends getting together to go paddling! The 4th of July tour was spectacular, the sunset was perfect, and we had a beautiful panoramic view of downtown Austin.\nYou could hear the symphony playing from the water. And it was the perfect place to watch the fireworks! “⭐️⭐️⭐️⭐️⭐️”",
   "I cannot recommend this place enough. They couldnt have made the kayak-renting process any easier for us. Parking was a little tight in front of the store, but there was a free parking garage right across the street. There is a short walk down to the dock with the paddles. The staff was unbelievably personable and fun to talk to. I was very anxious about getting in and out of the kayak on the dock and the employees made me feel at ease. We kayaked under the bridge towards the city which was an incredible way to see Austin for the first time. The price was great too. We paid just under $40 for two kayaks, two drinks, and the tip for the employees.",
   "Best place to view bats in Austin. Sunset paddle and tour. Everyone who looks down from the bridge sees mostly shadows. Look up and see the glory against the twilight sky. Support this ecological wonder of the world.",
   "Loved this place staff is very friendly and very helpful. Great atmosphere enjoyed it every time my wife and I went. For sure worth the experience when visiting Austin on a sunny day"
  ]
 },
 {
  "name": "Emma Long Metropolitan Park",
  "address": "1600 City Park Rd, Austin, TX 78730, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35192864-932e-11ea-ab48-14b31f159f22.png",
  "tags": [
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14781686213575077032",
  "source": "GoogleMaps",
  "reviews": [
   "Love this location in the Austin area. It is very beautiful. Right next to the Colorado river where there are places to have a nice picnic or even places to camp during peak seasons. Very well kept and would definitely visit again for sure.",
   "We were traveling from Maine to visit my family in Austin. We reserved a utility site on the river.\nThe site was spacious and the river pretty\nThe bench seat on our table was missing\nThe bathroom was dirty and the showers open with no privacy. I rigged up a shower curtain with a beach towel \nThere is no place to wash dishes so you have to wash them at your site \nMy complaint is about the lack of staff at this park\nThere were homeless people staying under a tarp on a picnics table and a huge party given by people who didn’t  tent a site, they drove into the park. There isn’t anyone at the entrance. They decided to set up next to our site. They played loud music and drank alcohol until nearly midnight. They came over to our site repeatedly,  we almost called the police but they left about 11:50 leaving 5 huge bags of garbage behind\nI spoke to a man who worked at the park the following morning. He told me it happened all the time at this park. They obviously don’t care. We will never stay there again. It is not a safe place to camp with children and especially not in a tent",
   "The bike trails are pristine.  Awesome scenery.  You can find some great views of the hills.",
   "Showers weren't that great and the road to the entrance is very long took us a while to find the camp sites but it was fun and we had a great time",
   "Park is awesome.  Huge area for picnics near the water, hiking, etc.  I typically go during the week so the crowds are kept to a minimum."
  ]
 },
 {
  "name": "Republic Square",
  "address": "422 Guadalupe St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/355fa46c-932e-11ea-8612-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=12852208163527475367",
  "source": "GoogleMaps",
  "reviews": [
   "There are public restrooms, which is good id you need to go.  On the other hand, it also means that the dozens of homeless that live in the square can use them/hang out near them too.  They actually drove a local business (Round Rock Honey) out of the area with their violence and harassment.",
   "This nice young lady had assisted me in finding the right bus stop. Sguck with all the way there at # 2 & 6 East Bound she was wearing an Ambassador type uniform and she was very polite and courteous.  This is a great, safe place to be. Thank you. And be sure to give that gal a round of applause!!! Thank you .🤗",
   "There's a lot of people who aren't privileged in this area, but there are a lot of events here. Every Saturday there's a Farmer's market and that's why I go. They have artsy things. And it's a bus stop. So if you don't want to park or find parking, there's a way to avoid that. It's pretty dope.",
   "If you're catching the bus, a taxi or just plain old CATCHING up, this is the centralized meeting location. Clean. Safe. Friendly. Clean public restrooms, security and shops, including a DOMINOES right across from the Park.\nDid I mention that it has Clean Public Restrooms? ;)",
   "Aesthetically and visually pleasing.Has places to charge you phone. Clean and available restrooms. Plenty of places to sit and enjoy the day with your friends and family."
  ]
 },
 {
  "name": "Gus Fruh",
  "address": "2642 Barton Hills Dr, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35ad2964-932e-11ea-8a50-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walking",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=2296503899046439822",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous hike and creek entry point. There’s plenty of swimming spots deep and not deep on this trail. Keep in mind that the trail is partially blocked by trees. After the blockage, it gets really hairy. The trail is thin and climbing through lots of rocks and tree roots. It is not an easy walking hike for many! Bring hiking shoes. After a short 15 minute walk through the cliff side, we discovered beautiful views and place for us to hang out. Loved it!",
   "Very nice place to hike and bike. I saw a lot of bikers there while I was there for a research project for a class called Planet Earth in my school, and I had a very enjoyable experience. I would definitely recommend visiting Gus Fruh if you need some fresh air or green for a refresher.\n\nHave a nice day!",
   "Truly incredible and beautiful in all parts. Take the trail that's waterside first.",
   "Nice rock beach. Deep swimming hole. Rope swing 😎",
   "Great when there is water. One easy windy trail for the kiddos. Water is clear and usually wading level."
  ]
 },
 {
  "name": "Butler Metro Park",
  "address": "1000 Barton Springs Rd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/360096f6-932e-11ea-aa72-14b31f159f22.png",
  "tags": [
   "art",
   "nature",
   "sightseeing"
  ],
  "link": "https://maps.google.com/?cid=9143100201009943774",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome park to picnic, motorized scooters to rent & ride there, let your dogs run & play, go check out the pond where I saw 2 fresh water otters ( no one go mess with them please) Honestly was shocked to see those 2 otters there since I have lived in Austin for 32 years and never seen this before. Awesome place to do some art work, yoga, meditate, just relax in the sun, or work-out but overall it is a cool park",
   "Beautiful park, Austin residents should be thankful for having such an amazing park. The combination of nature and city is surreal. Clear water river, calm enough for many canoes and little boats. Right next to it, the amazing and modern Austin Skyline. This park helps you explore this amazing location.",
   "Beautiful park along the water that is like heaven for dogs! So much room to run, things to sniff, and fun to be had. Also lots of pretty places to sit, picnic, read, and relax for humans. Great spot to be on a nice day or around sunset!",
   "Incredible view of the Austin skyline. Having lived here for most of my life, it really is special to see how much Austin has changed and reminisce about the \"good old days\" and celebrate the good new days to come 👍",
   "Very beautiful and super clean park. You will find people doing almost all sort of activities you can imagine doing outdoors. Running, dancing, cycling, playing sports, working out, dog-walking sightseeing, boating, picnicking..you name it. For every activity you will have plenty of space available there. The location of the park and the Austin downtown view from a different angle are bonuses."
  ]
 },
 {
  "name": "Pease District Park",
  "address": "1100 Kingsbury St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36489d9a-932e-11ea-97b0-14b31f159f22.png",
  "tags": [
   "parks",
   "walk",
   "kids",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=18357554210300390233",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite parks in Austin for volleyball and pickup sports. It also includes an off leash dog park and pristine (short) running trails. Limited parking sometimes.",
   "A park offers bike trails, playground, picnic area and \"fossil picking\". Lots of people walk their dogs here. You can bike or walk along Shoal Creek to other greenbelt park, too. This is one of my kids' favorite parks in Austin.",
   "Very clean, came here for Tai Chi event and ended up walking around the area for a couple miles.\n\nThere are a few homeless but they aren't causing trouble.\n\nBonus was seeing air plants on the trees growing in their natural habitat as well as cute lizards scurrying.",
   "This was a very fun place to explore. There’s a lot of random cool foresty areas that we went into and also in these pictures, some rivery areas. I’m not sure what else to call them but I enjoyed going here a lot and especially with friends. Beautiful scenery, clean park, not a lot of people, and its fun. There’s also usually a lot of space to roam around so its a great park to go to in Austin. If you need some of the s e c r e t spots this is one to show up to. Not that secret but perfect for all your Austin friend shenanigans.",
   "A good park to stroll around. I really enjoy that they didn't do the typical Austin updates, but left it familiar."
  ]
 },
 {
  "name": "Uchi",
  "address": "801 S Lamar Blvd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36a0d16c-932e-11ea-8f27-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7800725174736543982",
  "source": "GoogleMaps",
  "reviews": [
   "This place is tip top. Each dish is carefully planned with many elements and the complexity in each flavor combo is simply epic. I never feel inspired to leave reviews and here I am so I can find it again. Come here and be delighted. This is top notch, be ready to spend a grip of money. I’m currently sitting here waiting for the bill telling myself It was without a doubt worth it.",
   "I went in February when they had their Valentine’s Menu and it was delicious!! We had a great waiter, the drinks were fantastic and so was every dish! I highly recommend.",
   "The food was absolutely phenomenal. There are plenty of reviews discussing how lovely the meal is. What really put this experience over the top for us was the customer service. The hostess and our server Melissa were both incredible, charismatic, attentive and had the intuition to really make sure our meal was perfect. Definitely recommend the omakase route- the people here will absolutely take care of you.",
   "I have to say I was impressed.  Not just your average eat rolls sushi type of person but the I've traveled to Japan to eat at Michelin level sushi spots.\n\nThe rice is spot on, they had an array of both traditional and unique fish to try and a changing menu.\n\nWas able to get sit at the bar as a solo diner so no wait and the service was impeccable.",
   "Simply amazing and perfect in every way. We had a large-ish group of 7 and enjoyed a relaxed dinner on a saturday night when the restaurant was busy. The service was impeccable and we felt we were treated like we were the only table in the place. The staff were incredibly generous and personable. The food was nothing short of extraordinary. This restaurant was highly recommended to us from friends. We love sushi and this a James Beard Award winner. We were told they do not take reservations so get there when they open or be prepared to wait. Good information and spot on. We arrived at 4:30 with hopes of being seated a 5:00. Perfect."
  ]
 },
 {
  "name": "Odd Duck",
  "address": "1201 S Lamar Blvd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36e7edda-932e-11ea-b337-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12766655180848736231",
  "source": "GoogleMaps",
  "reviews": [
   "I've been sitting here trying to decide whether the cocktails or the food were the highlight of the evening, and that pretty much sums the place up. Excellent food, and equally excellent(and unique) cocktails. Rotating menu with farm to table options - every item on their menu shows where it was sourced. Fast and friendly service with complimentary valet. Cannot go wrong with this place. I'm already looking forward to my next visit.",
   "Took me way to long to finally get here and very pleased.  Great atmosphere, service, and fairly priced.  Enjoyed all 6 items ordered, but 2 (recommendations from our server) really stood out as special.  10/10 will be going back to try the rest of the menu and seasonally as the menu changes.",
   "Works for us. Have not had enough. Probably won’t in the foreseeable future. 5 star concept, service, food prep, product, delivery, and ambiance – food, drink, atmosphere – all works. And, they held back some of my favorite barrel aged drink for us – who knew they actually read the reviews ?! Tried them every which way on all accounts, and mediocrity, much less failure, are not in the vocabulary. Get your smile eraser appointment in advance. It will take a while to restore any semblance of an expressionless face, Austin traffic notwithstanding. Bring your pocketbook, but be prepared to lose your mind and give a flying flip what the damage is. Not my first time, and can vouch for the result – introduced probably double digit folks to this tortuously resplendent exercise in gustatory delight, and never found a naysayer. Flip me over, I’m almost done! I’m out. I’m happy. Good night. (smiling, disturbingly, possibly, to some, all the rest of the evening)",
   "Gave it 4 stars for the atmosphere and for trying, and while its a nice rustic place with great cocktails,  I expected more from the food. Heard some mush of the place, but food is luck of genuine flair of flavors. Not much of creativity either but just a mix of what seems to sounds good on the paper but the result is poor and the ingredients do not bland well with each other.",
   "No fries, no parking at lunch, and no way you won't love Odd Duck. It's a seasonal menu restaurant covering all your taste preferences. The fish tacos and wagyu burger are the most popular and it's easy to see why when you taste them. You almost can't find a better flavor balance in Austin. Wash it down with a cocktail that has been aged for a month like the Martinez. Be sure to come during off hours if arriving without reservations because it does fill and parking is limited."
  ]
 },
 {
  "name": "Franklin Barbecue",
  "address": "900 E 11th St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3739d50c-932e-11ea-9672-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "family",
   "eat",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3579139785445756036",
  "source": "GoogleMaps",
  "reviews": [
   "The best BBQ I have ever had, and I worked in a BBQ restaurant for years. The rub was so flavorful, the meat was so tender and juicy. The sides of beans and potato salad were delicious. Price wise, it is completely fair! Good BBQ costs money, and this place does not disappoint.\nI eaten here 4 times and I tried everything and it's all 100% top notch BBQ on a level you have to try for yourself",
   "Had the Brisket, Ribs, Sausage, Turkey, and sides. Brisket and turkey were my favorite. Both were very juicy, had great flavor, and brisket fell apart. Ribs were very good as well. Sausage could use a little help. Potato Salad had a strong mustard flavor which is different from what I'm used to but still enjoyed it. Make sure you eat it as soon as you can while warm.",
   "As a Texan with a ton of choices, I can honestly say that the guys in my family cook better BBQ. The texture of the meat was fine, but all of it was way over-salted. Over-salted to the point that I stopped wanting to eat it. The sausage was just OK. Best thing if I had to choose was the pork ribs, but I wouldn't recommend this over every other BBQ joint in Texas. Long ago, Sam's in east Austin would've knocked this place out of the water. For the wait, the time and the price, unless you want to say you've eaten Franklin's, head elsewhere.",
   "Best brisket I've ever had!  Juicy with just the right amount of spice!  Get there VERY EARLY.  It's worth the wait in line.  Plus they have extra chairs to sit outside in the early morning hours (hint 530am good time to get there).  Pack a cooler or grab some Java. Do NOT miss out.",
   "We debated whether a 2 hour wait for \"the\nbest brisket in Austin\" was worth it, and decided that tasting it was the best way to find out. We were not disappointed! \n\nOn top of the excellent food, the staff was incredibly friendly. They accurately estimated our wait time, took orders in line, and gave everyone reasonable expectations of whether there would be enough brisket, ribs etc. \n\nWe showed up at 10:45am on a rainy Wednesday and were among the last to get brisket and ribs. They were sold out of everything by 1pm."
  ]
 },
 {
  "name": "Uchiko",
  "address": "4200 N Lamar Blvd, Austin, TX 78756, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37875a40-932e-11ea-8339-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4397274347057868509",
  "source": "GoogleMaps",
  "reviews": [
   "Still one of Austin's best restaurants. Expertly designed and prepared, the food here is sublime. It's way more than a sushi restaurant with plenty of cooked items and interesting twists on traditional Japanese cuisine. Everything I've had here over the years has been delicious. I highly recommend you ask your server on the best order to receive and eat your dishes since the more subtle and delicate dishes can be over powered by the holder ones. And definitely try the Breakfast Cereal dessert! Happy hour is a bargain here for the quality of food you receive. Make reservations if you can, it's always crowded.",
   "Probably one of the best dining experiences in Austin. Every dish is prepared very intentionally and artfully. Service is excellent and the drinks are fantastic! \nI actually came back two nights in a row!",
   "Incredible design and ambience for a date night or a group for social occasions. They also have a great happy hour if you want to check out their offerings before committing to a big night there. I will say it's definitely a fusion Japanese place. Not so much traditional. This is a place to explore, not necessarily get a traditional roll you would normally get. They're cocktails are beyond what you would normally expect at an upscale place because they try different things. They also have an extensive sake collection.",
   "In my opinions I would avoid comparing the so call authentic Japanese foods which I have opportunities to enjoy in Japan with same type of Japanese foods I have had in U.S.A. The availability of original ingredients and the different ethnic taste palates would require making some modifications in ethnic foods we sample here. Nonetheless, I was very pleased with the selections picked from Uchiko’s menu.",
   "I enjoyed the romantic ambience of the restaurant. I tried the crab roll, tuna roll, prime rib, and Jasmine cream. The food was very flavorful and delicious. I love the the creativity in regards to the flavor combinations. However portion sizes are very small. Overall I had a great experience. I will be back."
  ]
 },
 {
  "name": "Jeffrey's",
  "address": "1204 W Lynn St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37d3cdd2-932e-11ea-9f73-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15676038141914699544",
  "source": "GoogleMaps",
  "reviews": [
   "Great date or anniversary atmosphere. The servers know it's a special occasion, and treat you very well. It seems more \"old Austin\" and traditional.\n\nFood is good - they are not doing anything particularly unique, but doing what they do well. \n\nThe martini cart is a bit gimmicky or fun, depending on your mood. \n\nWould recommend",
   "One of the best restaurants I've ever been to, I've had nearly every steak house worth mentioning in Houston and this place is right there or better than the best. I was not left disappointed in any way. Great food, service and atmosphere. I will definitely be back when I'm in the Austin area.",
   "This place is set in a super cool quaint area, near downtown Austin but nestled in a neighborhood.  This place is all about service and ambiance with a touch of excellent food on the side!  They are most none for their steaks according to our server but she stated everything on our menu can compete for the best, so we tested other dishes.  I had the seafood risotto and my wife had the dover sole.  Our word...magically delicious!  If you like chic, cool, hip but not over the top places try this spot.",
   "10* if I could give it: this restaurant is a well oiled machine! Definitely on top of all the fine dining restaurants I’ve experienced so far all around the world. I mean the service was impressive: a bunch of different waiters gravitated so discreetly around our table the entire evening, reading our minds and taking care of each detail. Couldn’t pick a better place to celebrate my husband’s birthday: intimate, relaxing, romantic! No need to say the food was memorable also! We will be back!",
   "Probably one the best dining experience that you can find in Austin. Food is amazing and services are impeccable from checking in to last step out of the restaurant. There's no better way to take your special someone for a memorable dining experience. They filled up quick so reservation is the key.  The only item that I was skeptical was the baked alaska. The whiskey is a bit strong and they use a carrot cake base, which I am not a huge fan.  Nevertheless, it was pretty majestic seeing a flambéed dish coming your way. We will come back for sure!!"
  ]
 },
 {
  "name": "Moonshine Grill",
  "address": "303 Red River St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3837c19c-932e-11ea-93a5-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "delicious",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=4403592168116976372",
  "source": "GoogleMaps",
  "reviews": [
   "Such a wonderful place to dine in with the family. They have a very excellent place, great outdoor and indoor seating with a good patio. They have a good interior setting, cozy inside and minimalist decor. Seating was quite good with its great chairs and tables. We had our seat right away as we dine in for brunch.\n\nWhen it comes to food I was very overwhelmed and also my wife to the food we had. Their menu was extensive and plenty of options but our entree were Hanger steak with Mac n Cheese and breaded chicken breast and artichoke to my wife. The food was well-cooked and has a decent taste. It was delicious and the ingredients were on-point. Well-prepared and portions were average. They have a great selection of drinks as well. We had their Lemonade cocktail and it tastes so delicious and refreshing.\nFantastic service, the staff was very attentive and welcoming as well.",
   "Location was close to our conference at The Fairmont and I'm so glad we stopped here for lunch. We had fried green tomatoes for an appetizer and the Hanger Steak special. Both were amazing. We hanger steak was nice and tender. Also had the Hard Lemonade which was good. Our server was Glenn and he was so spot on and efficient. He's a highlight for sure!",
   "Cool vibe, terrible parking situation. Closed road takes you to a parking lot that costs $20. Valet is only $9 though but waiting around for your car can be tough. \n\nVibe is you basic trendy, dark space, small bar but cool employees. They are friendly and attentive and seem to handle the chaos well. Wait times are a bit too long for my liking. \n\nFood was pretty good. Grits were thicker than I expected but were well seasoned and soaked up sauce well. Shrimp had a nice flavor and were cooked very well. Beyond burger was forgettable, fries were fine, tots were better. Steak was delicious and fried green tomatoes were a hit. Worth the visit but arrive before 5:15.",
   "The manager came out and showed me all the gluten free options on the buffet.   That was so nice.  The patio was beautiful.  We were there right before Christmas so they had a beautiful real Christmas tree on the patio that smelled wonderful.  The drinks are amazing too. We will come back.",
   "Location was close to our conference at The Fairmont and I'm so glad we stopped here for lunch. We had fried green tomatoes for an appetizer and the Hanger Steak special. Both were amazing. We hanger steak was nice and tender. Also had the Hard Lemonade which was good. Our server was Glenn and he was so spot on and efficient. He's a highlight for sure!"
  ]
 },
 {
  "name": "Launderette",
  "address": "2115 Holly St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38a3ba06-932e-11ea-97fd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3857902619508366330",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and atmosphere. Came here for lunch and the food was perfect. Nice mix of menu items. Cute inside and although the patio was closed for some maintenance, it looked really cozy too. Highly recommend. And not to be taken for granted, the service was excellent!",
   "We've bee meaning to go here for 2 years and finally made it last night. It was all we could hope for and more. We didn't have reservations so we sat at the bar. Food was fantastic and service from Jeff working the bar was some of the best we've ever experienced anyway. He was extremely busy but very attentive ensuring that our time at Launderette was one that we would not forget.  Kudos to Jeff. We will definitely be back soon.",
   "We are very excited to live so close to this Austin gem. We just moved in down the street and tonight was our first night dining here. We got the brussel sprouts and cauliflower as our choice for small bits. Both were incredible! My Old Fashion was perfection and the bartender, Jeff, whipped up an incredible Penicillin for my boyfriend. This is absolutely our new hangout spot. We can't wait to go back.",
   "I loved the atmosphere at Launderette! It is absolutely adorable. And the food was great! I had bacon and eggs (I think it's called the American?) and the pricing and portions were just right. Get the zucchini bread... Amazing!",
   "Excellent atmosphere. Great menu. Horribly pretentious, especially for a neighborhood restaurant - they carefully prioritize their clientele, like a valet prioritizes the cars parked next to the valet booth. Including, one time, insisting that we had to sit outside in 38-40F temperatures, with our newborn, despite there being open tables inside. One of the best burgers in Austin, though it and some other plates are a bit overpriced for their quality. Note to people with special diets or food allergies: Launderette consistently provides no sympathy/alternatives."
  ]
 },
 {
  "name": "Barley Swine",
  "address": "6555 Burnet Rd #400, Austin, TX 78757, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3900a8a4-932e-11ea-b289-14b31f159f22.png",
  "tags": [
   "creative",
   "delicious",
   "drink",
   "tasting",
   "drink",
   "tasting",
   "food",
   "tasting",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5174943467783230460",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely the best meal I had while in Austin during a weeklong business trip there. Had a reservation, but opted for the bar since I was by myself. Glad I did as I was able to watch the chef and his team prepare a number of different dishes. There must have been 12 people in that kitchen working in unison, each doing his or her part to make every dish special. I was drawn to Barley Swine because it promised farm fresh, seasonal produce, and a creative culinary team. As I was seated, the bartender gave me a menu and said quick, pick something, happy hour is almost over. It was 6:30pm. A $7 tequila cocktail was a perfect way to start along with some shrimp and grits for about half off.",
   "Wow! Everything we ordered at this restaurant was delicious. Great selection of small plates, you have to pick about 2 per person. We split the Pork Shoulder as our 'main course'. Totally tasty. They also have a $95 chef tasting menu if you would rather them make the choices for you! The cocktail menu is just as varied. I got the Stone Road whiskey drink, and my dad got the Fried Chicken Infused tequila drink. It even came with a tiny chicken wing on the side! Perfect restaurant for a celebration or a small night out. Nice southern atmosphere. Oh, and Parking is Valet.",
   "This place should be named as one of the Michelin stared restaurant! Barley Swine never fails to interesting me with their renovations of the tasting menu! They always make sure that’s they deliver the best food quality from the freshness to the taste of their food to their customers! They have very good drink selections  from wine to cocktails! Also great atmosphere for couple, as well as big group party!",
   "Superb dining experience and service! Pig Face Rolls and  smoked goat dish were definite highlights. Great cocktail and beer/wine selections too. We live very close to Burnet Road location. Can't believe we took so long to stop in. We had regular menu tonight but will be back for tasting menu ASAP.  Wow!",
   "Highly recommend the tasting menu on Sundays when its discounted. Went with a group of 6 and the food was phenomenal. Plus they were really great about catering to my dietary restriction, so would highly recommend!"
  ]
 },
 {
  "name": "Suerte",
  "address": "1800 E 6th St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3950027a-932e-11ea-a745-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "unique",
   "food",
   "food",
   "family",
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5197602663932924785",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent variety of delicious small plates, and main entrees.  Great ambience.  The Don Dario margarita was really unique and tasted great.  Will definitely be going back again!",
   "The food was good and fairly unique compared to most traditional restaurant. Staff was friendly and efficient. The plates were a little small and our group felt they fell short on quantity for each plate they brought out for our group. So in other words, for each plate or dish they brought out for our group of diners, they brought at least one portion short and we felt this could have easily been fixed.",
   "Basically - unimpressive. Not a great value.\n\nIt's a beautiful space - very sleek and dimly light and nicely painted. All the trappings are spot on... given our tech-city vibe. \n\nHowever, the food was bland. We went out with a friend, ordered two drinks and a smattering of dishes. The bill was over $100 and we were generally unsatisfied. I can't really remember any of the dishes, which is an indicator of its worth. I do recall a tiny, expensive tamale. \n\nThe waiter was rude and dismissive. I understand that we all get weeded on occasion, but the behavior kinda added to a generally un-great experience. \n\nNot worth the effort.",
   "Excellent food. Sharing each plate family style was a wonderful sample of the menu. Eric helped with the arrangement of the food delivery. I would recommend this for any group who wants good food and fun while eating it.",
   "Excellent, fresh food that tastes like it's been made with a lot of thought & care. Amazing service; everyone was very attentive & kind. Creative, peaceful ambiance. \nThe only thing that was a little disappointing was that the portions were really small."
  ]
 },
 {
  "name": "Fonda San Miguel",
  "address": "2330 W N Loop Blvd, Austin, TX 78756, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/399a5350-932e-11ea-8b32-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8904233960722141259",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant for any night of the week but Saturday nights always a great night out. This place gets packed, the bar area is free seating, you’d need a reservation for larger parties for sure but also just to secure your table here. It’s a very popular restaurant. They have valet parking, and a car park. The staff are very attentive, they don’t bother you but make sure you’re good on drinks and food. We had lots of appetizers and beers and margaritas. I have a hangover this morning but it was so worth it! Life’s short play loud we had such a fun time here catching up with friends and storytelling. As the night went on the stories got funnier. Oh and we had ice cream with some choc sauce over it yummy. If you live in Austin drop by some time. If you’re visiting Austin the food and atmosphere is authentic.",
   "So grateful that our favorite Austin restaurant for 45 years is doing curbside pick-up.  Saturday my wife and I decided to have a \"date\" -- set the table at home, even dressed up a little.  Ordered (and paid -- one less \"touch\") online, established a pick-up time, stayed in the car as our well-packaged food was graciously placed in the back seat, went home and had a magnificent meal.  Multiple meals, actually -- such generous portions.  And the usual excellent food.  Big thanks to Donnie and the team for a little bit of Austin normalcy in these times.  We love you guys.",
   "This is a very happening spot, awesome atmosphere and we were surprised to be seated so fast on a Friday night. We tried tacos and shrimp and old fashions. It all came out correct and quickly. I will recommend this spot and maybe try their brunch this year. To get 5 stars they need more restroom stalls (there was a wait) and our server really didn't chat us up, (most likely he was just super busy).",
   "This is a beautiful restaurant, you have to see the gardens. It’s a great place to celebrate something special with a big group, they serve crowds seamlessly and there’s plenty of space. The food is very authentic, any of there enchiladas are on point. There is plenty of good Mexican food in Austin, but this place takes the cake on atmosphere. They have great margaritas too, I’ve heard the brunch is amazing!",
   "This place is way overrated. \nIf you value your money... it is quite expensive.\nIf you expect a well-served dish for the amount you're paying... go somewhere else.\nIf you know about Mexican food... you'll be disappointed. \n\nI enjoy paying good money for good food but I don't understand all the good reviews this place has when you'll find better food at a food truck."
  ]
 },
 {
  "name": "Salty Sow",
  "address": "1917 Manor Rd, Austin, TX 78722, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39f59474-932e-11ea-a42e-14b31f159f22.png",
  "tags": [
   "tasting",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8030984187829816362",
  "source": "GoogleMaps",
  "reviews": [
   "A group of us decided to try this place the day before Valentine's Day to beat the rush. \n\nAll I can say is WOW! We had a bunch of different things and we all shared. There wasn't one thing that didn't taste spectacular. \n\nWe shared the Warm Olives and Triple Fried Duck Fat Fries. Both were exceptional, especially the hot, crispy and perfect tasting fries with egg and Bearnaise sauce. \n\nFor dinner I had the Milk-Braised Pork Butt with White Beans. It was marvelous. The meat was fork tender and really tasty, the beans perfect. \n\nTastes of the other dinners, another pork dish and Swordfish, all were really good. We shared a Banana dessert that was great also. The service was as good as service can be. This is obviously a great restaurant and we will be back for sure.",
   "We stopped in for a light dinner and ended up enjoying a few tasty draft craft beers with equally tasty appetizers off the Happy Hour menu. The truffled deviled eggs were large and delicious, and the biscuits and Rosemary honey fried chicken thighs......WOW, they were great! Actually they were incredibly great! Highly recommend a stop here. The atmosphere is very chill and you will be happy you dropped in! Our server Chris was also super friendly and efficient!",
   "Wow... and I do mean wow. The food at this place is incredible. They brought me a pot roast that literally came in the pot. The bananas foster beignets (you read that correctly) is in my top 3 desserts. The only reason it gets 4 stars and not 5 is because the drinks leave a little something to be desired. I feel like they could improve the ingredients, the recipes, or both... and produce a better margarita. Other than that though the food is quite perfect!",
   "Great food and awesome atmosphere, with a super friendly staff. Prices are very reasonable considering the quality, and compared to most “new American” style restaurants. The Happy Hour is something you should take serious advantage of too.",
   "Great experience. The servers were friendly and helped us squeeze in on a packed evening when we should have made reservations. The staff was all very caring and attentive. \n\nThe food was amazing. Pork belly was perfectly done, delightfully seasoned, and served over collard greens. The duck fat fries were pretty amazing also."
  ]
 },
 {
  "name": "Olamaie",
  "address": "1610 San Antonio St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a390738-932e-11ea-95b2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5468639644178705957",
  "source": "GoogleMaps",
  "reviews": [
   "The service is great. They're always there when you need them but never intrusive. The food was wonderful. Get the lemon bar for dessert, it is the best I have had outside of Paris.",
   "The food is amazing, every dish we took. The portions are not tiny as you would expect in such upscale place. The service is great.",
   "Friendly service. A relaxed atmosphere with a very homey feel. Thoughtful cocktails and fantastic food. We will definitely come back.",
   "Great restaurant in a cool old house with a few amazing dishes. They'll tell you about it but make sure to order a bunch of the off menu biscuits with honey butter. Easily the best thing that we ate. The hoppin john was also fantastic and the crisped rice was a nice touch. Service was uncomfortably good! :)",
   "We got a last minute reservation in the patio on a chilly night. But with the heating lamps on, it was really pleasant sitting outside. The snapper was excellent and you can't go wrong with eating too many of their biscuits."
  ]
 },
 {
  "name": "Bouldin Creek Cafe",
  "address": "1900 S 1st St, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a779818-932e-11ea-9210-14b31f159f22.png",
  "tags": [
   "food",
   "creative",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15682172389234257804",
  "source": "GoogleMaps",
  "reviews": [
   "I am honestly a picky eater, and trying to be vegetarian sometimes complicates that, but this was some of the best vegetarian food I've had in a while. It was seasoned well and cooked to excellence. I tried some of my friends' dishes and I didn't find one thing I did not like. My only suggestion is to plan ahead for parking because their lot seems to get full and tight very quickly.",
   "Bouldin Creek made my “meat ever meal” to “it’s okay not having meat for ever meal” transition sooooo easy. Their Ruben is better than a classic Ruben. Whenever I go here, I try something new and am always pleased. Never have I ever left unsatisfied. Not to mention a true gem of a interior design with a sweet little coffee shop and bar.",
   "Fan!  Big fan!  Love this place!  \n\nFresh creative menu. Healthy options with lots of choices for those days when you want something a little more decadent.  Great brunch. Yummy salads. Variety of cuisines. So much wrapped up in this amazing place. Expect a wait but you can get on the waitlist before you arrive by going to Yelp.",
   "Good vibes at this super hip eatery.  Laid back atmosphere with a great pooch friendly patio.  Lots of great plant based food choices that will satisfy the pickiest of eaters.  The cornbread is a must try!  We will be back!",
   "We were driving from Midland, TX after a cancelled comic convention. We were STARVING, so we decided to eat lunch with my sister and she chose this place. It was. SO. GOOD. Even my carnivore friend enjoyed his penne pasta dish he got! Also, the lavender lemonade was exactly what we needed to get refreshed to make the final several hours of our road trip back to Houston perfect. Thank you Bouldin Creek Cafe. We loved everything we ordered! Oh, order the stir fry. ❤❤❤❤"
  ]
 },
 {
  "name": "LENOIR",
  "address": "1807 S 1st St, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ad5981a-932e-11ea-b133-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "foodie",
   "knowledgeable",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12405965875814844894",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible food and warm, thoughtful staff! The carrots are absolute bliss. Be sure to pick up a loaf of their bread when you go! It's always a huge hit with our friends and family. We just love it here!!",
   "The atmosphere of this place is insanely cute! If you're looking for a memorable date night, this is definitely the place. All the dishes we had were great, but the desserts are what shined the brightest to me!",
   "Such a lovely experience. I’m a big sf foodie in town for the weekend and was so impressed with everything about this place. Quaint small atmosphere that feels very homey. Kind attentive service. And incredible food. Especially the whole roasted fish, perfect. Highly recommend.",
   "Most enjoyable meal by far. Had an awesome time with my friend's. The host Bryan was very friendly and knowledgeable in addition to our waiter. Was throughly impressed with the baked items that accompanied our meal (not pictured) by Max Sage who was also recently on chopped. I definitely recommend taking a chance and delving into this fresh take on Indian/Mediterranean cuisine.",
   "A French Country dining experience to enjoy!  We didn't know much before going in but it seems like they have some sort of modern french cuisine thing happening. It was also farm-to-table so it seems like their menu rotates often.  Either way, it was delicious!\n\nWe shared a variety of snacks and small plates, which was enough to fill us up (we were 3 women, just as a reference). We had the hush pups, smoked fish, the bao, stuffed quail, and other stuff I'm forgetting. They even elevated a bean salad! I mean ... seriously!  We certainly left room for dessert and their wine selection was superb.\n\nIt's a cute little restaurant off of 1st St. They have a couple of parking spots right next to the street, and slightly more spots in the back. But they're not prolific by any stretch.  No valet that I could see but you might want to call and check.\n\nIt seems like they have a lovely outdoor wine garden.  We're definitely planning on coming back when it gets a bit cooler so it's comfortable sitting outside 😎🍷"
  ]
 },
 {
  "name": "Foreign & Domestic",
  "address": "306 E 53rd St, Austin, TX 78751, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b1e1422-932e-11ea-8237-14b31f159f22.png",
  "tags": [
   "unique",
   "tasting",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2080247999671460506",
  "source": "GoogleMaps",
  "reviews": [
   "My friend and I were really excited about this place and, after going there for dinner, all we could say was \"wow\". Great service and great food, amazing wine menu. Small and unique and not too pricey, as someone else stated, and the small part means it can be noisy too (people, right?). I went for the tasting menu, and even though they did not have a vegetarian one for my partner, they were able to adapt and have dishes coming at the same time. I would only suggest a wine-pairing option for the tasting menu. Definitely the best we went to in Austin.",
   "Gnocchi and pasta made in-house. Chefs Sarah and Nathan are a great team that produce innovative, fresh, and balanced dishes. While known for their \"whole animal\" approach which can be eye opening for some, they also have a rich and varied vegetarian selection of dishes.",
   "Absolutely wonderful, top to bottom, this restaurant was a delight. The service, the food, the atmosphere, it was a perfect evening. I'm a picky eater AND a vegetarian, so I was apprehensive, but I had a variety of options and they were all good!! My husband, a serious omnivore, agrees. Honestly, I've never been blown away by a salad! I wish I could have it every day! My only regret is that the first courses were so good I didn't have more room by the time the entrees came. The service too was incredible! Special kudos to our server, Max, who went above and beyond. I loved the lemon curd dressing so much he asked the chef and added a little cup of it in our to go bag ❤️ All the servers and the host did an awesome job. If we lived in Austin this would be our go to for a special evening. Thank you, F&D!!",
   "Excuse my french but DAMN this place was good.  We were lucky to get right in for Sunday brunch.  It was SO good. The flavors were delicious. My taste buds were WHOA! Its a must. Small place so make a reso.",
   "Came here for brunch (definitely need a reservation).  I have the steak and eggs which might be my favorite steak and eggs ever.  Friends had the burger (good) and the blueberry crepe? (AMAZING)  my ONLY wish and reason for one star deduction is that I wish they had an espresso machine."
  ]
 },
 {
  "name": "Truluck's",
  "address": "400 Colorado St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b6270ca-932e-11ea-bfed-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "drink",
   "food",
   "music",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13514735727124765649",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food and great service. The steak was phenomenal and the scenery is one of a kind. Price was a little over the top but if you have the money it is worth every penny.",
   "The food was phenomenal. We got stone crab claws, tuna tartare, meatballs, and oysters. Down a star because the last thing we ordered was oysters.. from the time we ordered them to the time we got them it was around 30 minutes of wait time and our server completely ignored us. My boyfriend even ended up pouring me the rest of the wine himself because we weren’t even checked in on in that time. Oysters were also small for the price. Everything was great up until the end, sadly.",
   "Great restaurant in the heart of downtown.  Good for large groups, small parties and intimate dining.  Live music and very good drink and food happy hour specials.  Management and staff are extremely attentive. Extensive wine list and good cocktails.  While a generally a seafood.restaurant (and the seafood is so good) there are also steaks that as a good as any steakhouse in the area.  Worth the visit!",
   "Absolutely delicious food! I've never had escargot before and it was amazing. The soft that it came in was so good and had a very lemon creamy taste. We also got the oysters, the brine was salty and so good. It came with a bunch of sauces that you can put over it! The drinks were very good as well. I highly recommend their wine, very good wine choices. Definitely coming back!",
   "This is an excellent bar. The bartenders are usually top notch. However, if you can get one of the male bartenders they usually are better at customer service. I say this because every once in awhile when I visit downtown I like to have a cocktail or a glass of wine here and every time I have had a male bartender, they are usually kinder, attentive, and will talk to you. The females however are a whole different story. Unless you look like a Chad model, they will barely talk to you other than saying \"open or closed tab?\" without a hint of a smile. I have not eaten here yet and hopefully when I have a date one day I will try out their food."
  ]
 },
 {
  "name": "Kemuri Tatsu-Ya",
  "address": "2713 E 2nd St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bab3aa8-932e-11ea-93f5-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=3553143944041219506",
  "source": "GoogleMaps",
  "reviews": [
   "I've always liked this place, to say the least, but during quarantine I LOVE it! Their brisket bowl is out of this world. I crave it at least 3 times a week and have been talking about it over FaceTime non stop to anyone who will listen. Please keep it on the menu! The service is out of this world. Thanks for always being so cool.",
   "Oh man, I can't say enough great things! To start, I will say that it's a bit pricey, and the portions are on the small side. However, between the ambiance, the service, the fantastically original takes on Asian/Texas Smokehouse cuisine, you absolutely get what you pay for. Such unique menu selections. We tried a LOT of options and loved, literally, everything. They give you instructions with each dish, and trust me. Every step elevates each experience. Hats off to the chefs. Cheers!",
   "Innovative, small plates Japanese in a funky neighbor setting outside downtown. Clearly, a hipster spot. A very younger crowd, my daughter pointed out I was the oldest person in the restaurant at 8:30pm.. great cocktails, the smoked mackerel was perfection, flavor and texture. I wish someone would reinvent those fried tako balls... these were no better than others. My only disappointment.. well worth the drive, reservations recommended.",
   "My wife and I ordered take-out last night and both beef and chicken bento bowls were amazing! A coordinated explosion of southern, smokey flavor with Asian spices. 🤤",
   "Recommend trying several things from the “weird menu” (you nasty!) as well as ordering the pickled cucumber salad to go along with all of your dishes. Most of the plates have a heavy or smoky flavor and the cucumber is light and refreshing, serves as an intermezzo course. The marinated jellyfish has a texture like none other! Will return for the BBQ ramen!"
  ]
 },
 {
  "name": "Lonesome Dove Austin",
  "address": "419 Colorado St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bf0d150-932e-11ea-9be8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14523804670143904167",
  "source": "GoogleMaps",
  "reviews": [
   "They have perfected takeout! Great packaging. Terrific presentation in a to go container (seriously, how does one do that?).\nThe best meal I've had since this all started.\n\nGo get a great meal, you will be so happy!",
   "Foods are strange and interesting! Meat quality is great, my I hope there is more sauce for steaks. Overall satisfied. Recommend ones who like to explore and experience.",
   "This place is great! Staff very friendly! Very eloquent. Burger and prime rib were delicious. It was out so quickly also. The decorations were amazing and the seating was very comfortable 👌",
   "My girl and I don't high paying jobs so it was really nice that we could go somewhere for lunch that was super good and didn't break the bank. Best burger I've had in a very long time. We'll definitely go back soon",
   "If you read my bio, you'll see I am finally realizing my dream of being a \"food critic\" in Austin, Texas. I will be posting my honest and uninfluenced opinions on everything from the front door to paying the check (no handheld credit card machines, please). For my first batch of reviews I am seeking out the true Austin staple: meat. What better place to start than rustic Lonesome Dove?"
  ]
 },
 {
  "name": "True Food Kitchen",
  "address": "222 West Ave Ste HR100, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c38ff40-932e-11ea-94e9-14b31f159f22.png",
  "tags": [
   "creative",
   "eat",
   "food",
   "creative",
   "food",
   "delicious",
   "food",
   "drink",
   "food",
   "family",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15979877724592806828",
  "source": "GoogleMaps",
  "reviews": [
   "True Food Kitchen was just a delight to visit. We were looking for some creative food with good quality and they delivered. The service was great from the first minute until we left. Out food arrived quickly, we were very happy with the amount of food and the options in the menu. The restaurant itself is also very nice. We preferred to sit in the patio, with the heaters, it was perfect. Inside it was a little too noisy than I prefer. I'd definitely recommend this place if you're trying to eat healthy as well. They have several choices in the menu for every taste and diet.",
   "Fantastic food: creative recipes with fresh, savory ingredients; a large vegetarian selection. A good-size wine list and a selection of locally brewed beers, though not on tap. Excellent service: professional and thoughtful, with your glasses topped off and dishes cleared away in a timely, unobtrusive manner. Highly recommend the roasted cauliflower appetizer.",
   "Delicious food and wonderful service. Went here for the first time the other night and had a great time. \n\nI had the Korean Noodle bowl with salmon and it was very tasty and filling. The salmon was perfectly cooked and juicy. Wish I had a photo, but ate too quickly! There was a tiny issue with my order and it was rectified immediately and they went above and beyond to fix it. Was not expecting that level of customer service!\n\nWe also ordered the roasted Brussels sprout and the fig & Gorgonzola flatbread - also delicious! Everyone enjoyed their meal.\n\nService was spot on as well and everyone we met was very friendly. The restaurant itself is also in a super cute area that you can explore before or after your meal.",
   "Excellent heathy food choices and so full of flavor! Great service too! I love a casual meal here or meeting friends for a big celebration dinner. \nSpecial food needs, no problem. \nEven the drink and desert menus are wonderful!",
   "Incredibly underwhelmed. My family and I were so excited to come try out this location as we had heard a lot of good things. There were 4 of us and we made reservations so we were seated quickly, but that was the peak of our service. \n\nOur orders were taken and our waiter forgot to bring 2/3 of our drinks, both forgotten drinks were just plain coffees (we had to remind him later and he made no comment about why the never arrived). \n\nWe placed our orders, including an appetizer for the table and a bowl of soup as my entree. I also asked for bread to eat with my soup. The soup came before even our appetizer, so I had to eat before anyone else so it wouldn’t get cold, and they had forgotten my bread. \n\nI wouldn’t have even minded as much if the soup was worthwhile. The bowl was only half filled with lukewarm subpar tomato soup. \n\nFinally the appetizer arrived (fig and Gorgonzola flat bread) which was admittedly very good, shortly followed by the rest of the order. All of us were in agreement that it was decent, but not memorable or worth the price tag. \n\nThe atmosphere is very fun and trendy which I can see as a huge attraction, but our service and food was incredibly disappointing. \n\nAnd as I am writing this, we are still waiting for our waiter to come around and hand us the check. I have lost track of time, I’m starting to get hungry again, send help."
  ]
 },
 {
  "name": "Perry's Steakhouse & Grille",
  "address": "114 W 7th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c8265c0-932e-11ea-8e09-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4620661984350240395",
  "source": "GoogleMaps",
  "reviews": [
   "We are always doing what we haven’t done yet. The martinis are wonderful to start. Blueberry, Cucumber YUM After being seated in a booth because there were 5 of us we chose our appetizers. A booth is very hard to engage in conversation, corner to corner and I would insist on a table if ever doing this again. The appetizers were great. We had Shrimp, steak tartare and crab cakes. Delicious. Wine next. At this point I started to feel rushed. The atmosphere and food were very up class but I was disappointed with our server. 0 personality. The only way to show this is in the gratuity. 75.00 instead of 100.00$",
   "Celebrated our anniversary here last night.  The ambience was very romantic, they spread rose petals on the table, it was a nice touch.  The food and service was outstanding.  It is expensive but the food was well worth it.  I loved every bite, it was a very special evening.",
   "I absolutely love this place we were seated quickly. Nicholas our server was amazing he provided top notch service. I requested a nice romantic table for our anniversary and they went above and beyond. Our table was decorated with rose petals for the occasion. My expectations were exceeded. We will be returning!",
   "We really enjoyed this place and sat outside which was very nice. Friendly server staff. Great food and we went there during the sunset.  We tried a couple of their drinks which were good.",
   "Our favorite restaurant! We've been going to Perry's for years. They ALWAYS have great customer service, a romantic ambiance, and good food. We love their Famous Pork Chop, Mac n cheese, with their Fields Green Candied Pecan salad."
  ]
 },
 {
  "name": "Veracruz All Natural Food Truck",
  "address": "2505 Webberville Rd, Austin, TX 78702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3cca539a-932e-11ea-a932-14b31f159f22.png",
  "tags": [
   "cheap",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8028204683900683477",
  "source": "GoogleMaps",
  "reviews": [
   "I ate some VERY good food here. Particularly the guacamole was just perfect. It was all cheap as well! I’m taking off one star because there is not nearly enough covered areas to eat or wait in line. We waited in line with no shade for almost an hour. It was miserable. Despite the food being so good, I’m not sure it was worth it. They do have cheap water bottles, but it would be a lot better if they had water stations nearby. You still have to wait an hour to get your water after all! If I could go back and do things over, I’d stop by the brick and mortar version, not the truck.",
   "I finally understand why everyone in Austin is crazy for Migas. Delicious. And juice was great.",
   "Best Fish taco I ever had. Chips and guacamole were very fresh and chips were clearly home made. Might be the best food truck in Austin. Not the best area but worth the risk.",
   "Great tacos! Had some breakfast tacos and some regular ones. Both were great. The area was great and we were able to meet up with a friend who had a dog.",
   "Poss Best tacos in Austin, don't let the old prison bus look scare you. Friendly service with patience and good advice on menu. Decent prices and broad menu of tacos and drinks to choose from."
  ]
 },
 {
  "name": "Justine's",
  "address": "4710 E 5th St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d16eb8c-932e-11ea-b481-14b31f159f22.png",
  "tags": [
   "unique",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12020484857284367043",
  "source": "GoogleMaps",
  "reviews": [
   "I really like Justine’s. My husband and I love to go there for a nice dinner on special occasions. The reason for four stars is that our last dinner at Justine’s was a little lacking and the price per plate is pretty high. But all in all it’s a nice experience.",
   "Justine's offers one of the best unique dining experiences in Austin. Year-round outdoor seating, daily menus paired with their stock menu, and a great cocktail + wine list. The staff reflect \"Keep Austin weird\". \n\nHighly recommend their seafood when it's available. I've enjoyed oysters and scallops. They also have a good french 75, leaning into the citrus component.",
   "Very elegant and classy..The menu was well put to gather. My meal was excellent, very juicy, just simply the best. I love the music that was being played, it really set the mood..I will most definitely come back to this restaurant..",
   "Fantastic restaurant. Great atmosphere and service. Daniel served me and my fiance and we both loved him and his seriously amazing customer service. The amazing employees there only add to the delicious food. All local and so delicious with a twist. Will be back tons!",
   "My favorite French restaurant in Austin. Ambiance is beautiful and they have a great outdoor patio. Character and flavor is something they do not fall short on, their cocktails are superb as well."
  ]
 },
 {
  "name": "Red Ash",
  "address": "Colorado Tower, 303 Colorado St #200, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d7788de-932e-11ea-9b67-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=781942648408772286",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing rustic Italian with a great atmosphere.   If you're looking for a great dry aged piece of meat this is your place.  Dont be fooled by the name they have amazing steak.",
   "In town for the weekend. Wanted to have a nice dinner every night. The first night I went to a highly rated restaurant, but it wasn’t near as good as the Red Ash. I wanted to try the happy hour which starts at 4:30, I got there at 6pm. Everyone did their best to get me a seat. I was fortunate and got to sit at the chefs bar in front of the kitchen.\nI ordered clams, in-house pasta, and the Caesar salad. Several of the professional waitstaff stopped and made sure that I had everything I needed. Everything that I had was excellent, I can’t wait to get back!\nI would recommend this restaurant to anyone. Happy hour or not this is by far one of the best restaurants that I’ve visited while in Austin.",
   "Great date night spot downtown. Make a reservation or grab a seat at the bar (first come). The sides and starters are the best part of the menu, carrots and beans were delicious! Small portions of entrees are plenty and recommend sharing everything. Chianti Classico (2015) goes well with everything. Could be an occasion place or every night. Oh and sit downstairs for a better atmosphere. We sat at the kitchen table and enjoyed watching the show that is the staff!",
   "They have the best pasta in this city. I would know I've tried every Italian restaurant in a 100mi radius! Their steak is also amazing. They have a very unique atmosphere perfect for a date!",
   "Everything was great in terms of selection within the menu from wine to food. We had done the happy hour and it was a challenge to find 2 seats, let alone 1 seat for the hour we stood there. \n\nThe steak over bruschetta was the only dish I did not like. Not really steak but the fat trimmed off and placed over bruschetta with a lot of Parmesan cheese. Wish the menu had specified that or the waiter/bartender. Every dish ordered had a lot of Parmesan cheese which took the Flavor away from the main entree. It was also interesting to see it on top of all the dishes ordered. \n\nOver good food and ambiance, just some items to be improved upon."
  ]
 },
 {
  "name": "Emmer & Rye",
  "address": "SkyHouse, 51 Rainey St UNIT 110, Austin, TX 78701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ddc1ae2-932e-11ea-ab3b-14b31f159f22.png",
  "tags": [
   "eat",
   "knowledgeable",
   "food",
   "delicious",
   "food",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=18092359907513002252",
  "source": "GoogleMaps",
  "reviews": [
   "Best dinner we had in Austin. Sat at the chef bar. Cool to watch the kitchen while you eat. Every single dish we had was excellent. A party in your mouth. Standouts - nettle pasta, pork shoulder, lions mane mushrooms, Johnny cakes. Great cocktails too. If you are into quality over quantity, don’t miss this place.",
   "Died and went to Heaven!  We lucked out and sat at chef’s table.  We were delighted by countless taste combinations and “small plates”. The waiter explained everything and was very knowledgeable about menu.  This is a special place and we will highly recommend it to anybody visiting Austin.   The BEST!",
   "Entirely underwhelmed by the food served to us last night. The shrimp salad contained possibly the smallest, most measly shrimp we had ever seen, sat in a puddle of water as if defrosted on the plate, swiftly soaked furthermore in a cream sauce leaving us both feeling rather sick. The steak tartare was, at best, average and the portion sizes of each dish were quite unbelievably poor. We tried an avocado on toast which looked as though it had been going round on the tray for a few hours. The oysters similarly did not appear appetizing. Despite the politeness of the staff as they presented their pitch, and the nice ambience of the setting, I found the experience almost insulting. We had to cancel our final dish as we did not wish to continue further, we had seen enough. We paid our bill at $115 and left hungry and disappointed. The staff did give us a cork for our wine and 5 slices of bread in a bag as an apology, and we ventured on to find more sufficient food elsewhere.  I can only assume that a) the culinary team were having a bad day or b) the other people leaving reviews are not particularly experienced in good quality tapas and dim sum. I hate to leave a bad review like this, but we both felt quite compelled to leave our honest thoughts on the experience. If you try it out, I hope they prove you otherwise.",
   "What a great experience. From friendly, accommodating hostess to a wonderful server Megan S. They made our girls trip memorable. Food was delicious and great recommendations from our server. She may honestly be the friendliest and most accommodating server I’ve had in all of my years. Thank you so much for a great experience!!!",
   "Best dinner we had while visiting Austin. Servers are knowledgeable and each dish is complex as they were delicious. The dim sum cart concept really didn't work here, but otherwise service was fantastic. The mole pork shoulder was the standout dish - flavorful and perfectly cooked."
  ]
 },
 {
  "name": "Terry Black's Barbecue",
  "address": "1003 Barton Springs Rd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e38f2fe-932e-11ea-9974-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "delicious",
   "art",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=13851597096564644039",
  "source": "GoogleMaps",
  "reviews": [
   "Terry Black's BBQ on Barton Springs is phenomenal!  I have never tasted better BBQ!  Their ribs are to die for, and everything else is, too.  Their sides are great, and they have green salad for those who may be vegetarians.  The thing that makes this restaurant unique is the way they treat their clientele, who come from all over the world to eat there.  The entire staff is friendly, and despite the crowd that is always there, they recognize their \"regulars,\" and genuinely appreciate their patronage.  There is a line, but the way it is set up, the line moves quickly.  The atmosphere is happy, and you meet interesting people from everywhere! It's an experience to eat there, which is why we go every week!  The owners, twin brothers Mark and Michael, have set such a positive tone with their employees that they love working there, and the mood emanates throughout the crowd.  I wouldn't eat BBQ anywhere else!",
   "Over the many trips to Austin I have enjoyed great barbecue. Terry Blacks is among the very best. This was my first time the food was delicious. The brisket was perfect and the sausage was awesome. When I return I will try the beef rib as one of the members of my team enjoyed that immensely. Hats off to the entire team for their excellent work and craftsmanship in the art of barbecue.",
   "“Brisket is king” and the beef rib is Emperor of the BBQ galaxy! Oh sweet baby Jesus is it delicious! Traditional Central TX BBQ with a slight upscale flair in decor. One of the best BBQ experiences I’ve ever had. Try the mini pecan pie for a dessert! (((eye rolling into back of my head))).",
   "Hands down the best BBQ restaurant I've ever eaten from. Everything from the brisket, to the pork ribs, to the sausage was amazing. I will say their mac n cheese could use a little work; it was somewhat bland and could use more seasoning but their pinto beans and potatoe salad was amazing... A little pricey but well worth it.",
   "One of the best Barbecue experiences I've ever had. prices are expensive but it is more than Worth the price. Probably the best Brisket I've ever had and the Beef Rib is massive and just everything is amazing. Even the sides were better that I thought They would be. highly recommend going for any reason. There's constantly a long line, so get there early For a shorter long line."
  ]
 },
 {
  "name": "Dai Due",
  "address": "2406 Manor Rd, Austin, TX 78722, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ec7ad86-932e-11ea-913a-14b31f159f22.png",
  "tags": [
   "drink",
   "knowledgeable",
   "delicious",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15015697098925794981",
  "source": "GoogleMaps",
  "reviews": [
   "Waters were brought to the table quickly and the server returned quickly to take our drink and appetizer order as well. The line list is expansive but also just a tad on the pricier side which IMO can be excused due to the large selection. Waitress was also reasonably knowledgeable about her wines and was able to assist us in making a choice. We ended up waffling between two different bottles so she kindly offered to bring us a small taster of each to help push us over the edge.",
   "My partner requested this restaurant for his birthday dinner last week, so we ordered it to go.  I got the pork chop and green salad, he got the wagyu burger with beets.  It was excellent; my only regret was that we couldn't dine there.  And my dog LOVED me for sharing the pork chop fat and bone.",
   "Came here for brunch and would definitely love to come back for lunch or dinner. Brunch has a good mix of savory or sweet and breakfast or lunch items. We had pancakes, tamales, a pastry, and a pigs in a blanket kind of roll. Everything was delicious! The pancakes had a great crisp crust but light and fluffy inside with a delicious honey and orange syrup topped with fresh cream. The tamale was incredible filled with wild boar and wrapped in collard greens, also they had a great green hot sauce that went perfect. The pastry was also delicious, light and fluffy. The other pastry was incredible with a venison sausage with so much flavor.",
   "A restaurant which also sells locally sourced meat, most of the items on the menu is locally sourced as well. It is surely pricey, brunch average is $15 per person plus any additional for drinks. Service was okay, a tad slow. Serves dinner as well. Had the Biscuit and Gravy with venison sausage, the gravy was lacking kick, venison was a bit on the dry side. Biscuit could have been softer, will give it another shot and try something else on the menu the next time.",
   "The staff was super knowledgeable and everything was meticulous. I will say that things were quite a bit smokey for my liking. Even the restaurant itself felt smokey... the cocktails alone made it worthwhile though!"
  ]
 },
 {
  "name": "Wink",
  "address": "1014 N Lamar Blvd, Austin, TX 78703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f1ad8ac-932e-11ea-9f15-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "drink",
   "eat",
   "tasting",
   "food",
   "tasting",
   "food",
   "foodie"
  ],
  "link": "https://maps.google.com/?cid=2432580875027835006",
  "source": "GoogleMaps",
  "reviews": [
   "As this place is allowing only takeout and curbside delivery, my review really only concerns the ordering and food that I had a chance to enjoy. Very friendly service and easy to find while driving along N Lamar Blvd. I ordered online using the URL on a sign outside the restaurant. No problems. I live downtown, so it was just a short bike ride to get there, but there is also parking. My food was waiting for me shortly afterwards and had a chance to enjoy their delicious burgers! Glad they’re open during these times!",
   "We’ve been meaning to eat at Wink for some time now, because it’s been years since we’ve eaten there. It’s no wonder that in a brutally competitive restaurant scene like Austin’s, that Wink is still in business. We were with another couple, all 4 of our appetizers were beautiful and delicious, and our entrees were on point. And to make our meal even more memorable was the service we received from Nicole. It was above and beyond, and it’s so obvious that she truly enjoys her job. I even told her so. After our meal, we decided to skip dessert and an after dinner drink, but Nicole treated us to a round of port and 3 desserts to share. We were all blown away. She’s a credit to the service industry and to Wink as well. We’ll definitely be dining there again soon, and we’ll be certain to request Nicole. I highly recommend this restaurant and our lovely server.",
   "One of the few Austin places you can bring your own wine, with a small corkage fee. \n\nRecently did the 7 course tasting menu with a group of friends.\n\nAll of the food with wonderful, but the service was a bit slow tonight... which isn't the norm for this place.\n\nThe highlight of the tasting was the duck breast. Perfectly seasoned and cooked, easily in the top 3 duck dishes I've ever had and the best in Austin.",
   "Super memorable date night. My husband and I first had drinks at the wine bar then walked over to the restaurant side for dinner. We had the 7 course tasting menu with wine pairings and had the most wonderful experience. The food and service was fantastic.",
   "No other word but fantastic.  I am very disappointed in myself for not visiting this amazing place sooner.  My friend and I ventured here one summer Saturday evening and had our socks clearly blown off of our feet. There have been a barrel of \"over hyped\" restaurants in Austin lately, and let me assure you , this is not one of them. From the time we entered their wine bar for a glass before dinner, to when we left the restaurant, we were in a  foodie paradise.  We opted for the 5 course meal without the wine pairing, which was a mistake we will not be making again.  Every course was better than the last.  The most impressive part? Everything was made for the menu, that day. That's right, daily rotating menus. The creativity and production of the kitchen is magnificent. The portions were handled with ease, but by the end of the meal you didn't feel hungry; but you didn't want the tastings to stop.  The wine bar adjacent has a speakeasy feel, but that quickly dissolves to a exuberant atmosphere when you began a conversation with the lovely people behind the pine. Everyone was simply delightful.  It has been a long time since I've found so much enjoyment, and charm from a first time visit to a restaurant .  I cannot wait to go again!"
  ]
 },
 {
  "name": "Contigo",
  "address": "2027 Anchor Ln, Austin, TX 78723, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f5ec024-932e-11ea-baf3-14b31f159f22.png",
  "tags": [
   "food",
   "foodie",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17627320090670369131",
  "source": "GoogleMaps",
  "reviews": [
   "I came here for New Year's Eve party and was not disappointed. For the price of admission, there was a buffet and open bar. \n\nAll of the food was amazing, vary tasty. The open bar cocktails were perfectly be made with premium alcohol. \n\nTo end the night, they provided tacos to go which came in really nicely after all the drinking.",
   "One of my absolute favorite brunch spots in Austin. Weekend brunch starts at 10, and we never have trouble getting a table right away. Dishes are the perfect serving size, and while the menu is relatively small, there’s a little something for everyone, from the picky eaters to the foodie enthusiasts.",
   "Great for parties. This was our first visit and we had a group of eight of all ages. The service was fast, especially the drinks and now I have a new favorite cocktail, Hell or High Water. Definitely coming back to have an entree because I filled up on snacks and had too much fun to care.",
   "Overall I was disappointed in the experience here for brunch. We came with a large group and the food was fine, it was displayed beautifully but the pork Benedict was a little salty and the pork inside was mushy. The bloody Mary’s are just okay but certainly not the best I’ve had in Austin. Based on the reputation of this place I expected the food and service but it to be better but it certainly wasn’t bad. The service was a little slow considering it wasn’t busy while we were there. While I’d also like to try this place for dinner it is no longer a top priority.",
   "Great atmosphere. Excellent service. The burger I had was amazing. We will definitely be back. Can’t recommend it enough."
  ]
 },
 {
  "name": "Botticelli's",
  "address": "1321 S Congress Ave, Austin, TX 78704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3fab0cd2-932e-11ea-8c80-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "unique",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15251155985323929193",
  "source": "GoogleMaps",
  "reviews": [
   "Food is excellent quality! Great authentic Italian food at a reasonable cost! The bread they serve as an appetizer is no ordinary bread! It’s full of meats and grilled veggies and dipped in their amazing marinara sauce that is served warm!!!! Great customer service and overall great experience! I’ll",
   "The food was excellent, from antipasto to dessert. We had the best, most vivacious waitress as well. The outdoor section was in the shade and cool. If that is not your speed, the indoors had air conditioning. They were setting up for live music, but we left before it started.",
   "I was here over the Thanksgiving hoilday with my wife and daughter who lives in Austin the service the atmosphere, was very nice the food absolutely wonderful ! A very good variety of dishes to choose from , our experience was very good and when I'm visiting Austin again I'm sure to visit Botticelli's again and I would recommend others to do so also. Highly recommended this cozy restaurant. Friendly service. The lasagna and carbonara with chicken was excellent. We would suggest the beet Napoleon salad to start - unique and full of flavor!",
   "Great Italian food. Nice service. Prices a bit steep.",
   "The good : The food was delicious, but you can't really go wrong with Italian food. But not good enough to justify the price tag. Expect to pay $30 a head before alcohol. The drinks were okay, strong but like the food also very expensive.\n\nThe bad : The restaurant was hot and humid inside. It felt like a sauna, and when we mentioned it to the hostess on the way in, she said that she would talk to the owner about it because they were worried it was too cold outside. There was literal steam on the windows and they never cut the AC on. It's a very tiny restaurant and the kitchen is right next to all of the tables.\n\nThis review is my opinion, and should be taken with a grain of salt as all opinions should be."
  ]
 },
 {
  "name": "III Forks",
  "address": "111 Lavaca St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ff1df86-932e-11ea-a707-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=10923781143488940167",
  "source": "GoogleMaps",
  "reviews": [
   "good dinner, good service in fun upscale setting.  This place is highly rated in downtown Austin. I went recently and had a good meal.  Service was friendly and old school but great.   my bone in rib-eye was done just right. came with bread too.  my caesar was good but not great. onion rings great.  Priced fairly also. Well worth checking out.",
   "We held a dinner meeting here and were extremely pleased. Emily helped us plan the event and was professional, responsive and attentive. She is truly exceptional! The room was beautiful and everything was set-up on time. They had an IT team that ensured all the equipment was working. The wait staff - Mick, Kimberly and Nick were fantastic. They were professional, friendly and meticulous with details. I would not hesitate to hold an event here in the future!",
   "A must-eat for anyone looking to woo clients, experience high class Austin, or try some of the best steak in the city.  With a choice of booths to bar stools to tables with a lake view, you will have a wonderful dining experience that the waiters ensure a wonderful experience.  No matter the reason for your visit Three Forks will impress on all fronts, however be warned- the faucets hot water will get to boiling extremely quickly- so be careful when washing up.",
   "We picked up our curbside order for Easter meal and it was amazing!  Everything was so delicious and well  worth the price.  I always enjoy celebrating our anniversary at III Forks and once again they did an excellent job on this Easter menu.  Thank you for making this Easter a memorable one.",
   "Probably the best filets we’ve ever had. You must top it off with the King’s Crown! The lobster was cooked perfectly. Waiters are very attentive and helpful- top notch. The only reason for the rating of 4 is due to the unpleasant odor right as you walk in the doors, but I didn’t notice it after we were seated. My friend, however, was sensitive to it throughout our meal. Still, we would definitely dine here again."
  ]
 },
 {
  "name": "Cypress Grill",
  "address": "4404 W William Cannon Dr, Austin, TX 78749, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40379c76-932e-11ea-a4c0-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=444434188960911195",
  "source": "GoogleMaps",
  "reviews": [
   "We really enjoy the seafood gumbo appetizer and, for dessert, the bread pudding. We always look forward to the holiday season because they do a special pumpkin bread pudding which is incredible! If you're not into seafood or Cajun food, the pot roast is fantastic. Great selection of oh so tasty food. Excellent service with a fun atmosphere. This is probably our favorite place in Austin.",
   "To go margarita kit is awesome🤠👍👍. \n\nMakes a STRONG rita. Very good, This is a semi sweet rita. My advice is to ask for double or triple the \"simple syrup\" or add an additional 1 1/2 oz of fresh squeezed lime juice.  Their kit includes only 2 oz of the simple syrup.  \nThis kit by the oz:\n3 1/2 oz tequila\n1 3/4oz gran gala\n2oz simple syrup. \nAdd 1 1/2 oz fresh lime and make it less sweet🤠. See photos",
   "Pretty good food and atmosphere. It was a pretty busy time of day. They get a pretty good crowd through there during Sunday brunch. Service was expected during such a busy time. Food was prompt and good. The crawfish egg rolls were pretty good!!",
   "I sent my friends to this place with my warmest recommendations. I go their often. I get very good feedback from my friends. The the cooking is yummy and the crew is welcoming and cooperative. Whenever we go to this place we pass a pleasing evening.  I warmly recommend this restaurant.",
   "Me and the hubs decided to give this place a try for our date night out. We will definitely eat here again. The service was fantastic, the drinks were fabulous, and the food was so tasty. I had an old fashion to drink (the perfect amount of sweet and citrus), the red beans and rice for an \"app\", and the small portion of fried catfish. Everything had so much flavor and was cooked to perfection. You can tell they soak the catfish prior to frying. It was so moist and super flavorful. But YOU HAVE to try the red beans and rice. We even got a side to go to eat the next day. Thanks for a wonderful date night!!!"
  ]
 },
 {
  "name": "la Barbecue",
  "address": "2027 E Cesar Chavez St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/407d3224-932e-11ea-9d75-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18254912055511811922",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down the best bbq I've ever eaten. The line at 11:30 took until 1pm to get food but it was worth it. The brisket had amazing melt in your mouth flavor. Each slice had an incredible smoke ring and it was so savory and rich. The pork ribs were sweet and tangy from the sauce but so amazing. The pulled pork had nice depth and flavor and the two types of sausage had great texture and depth without trying to overload your pallet. The shells and cheese side was really good. The only things that didn't knock my socks off were the turkey and side of beans. The turkey was really good, being moist and flavorful but it lacked a deep smoky flavor I had hoped for. The beans were also good, but didn't feel write-home about. \n\nAgain, this was the best BBQ I've ever had. I would gladly try any and all of what we ordered again (and again, and again)!",
   "Wow! That was the best sliced brisket sandwich I've had in my life! Best barbecue I've had in Austin in 7 years. Perfect flavor, moist, tender, flavor of the meat stands out and doesn't get drowned between the bread, sauce, and condiments. Will add pictures tomorrow when I return for more brisket!",
   "Waited 1.5 hours on Saturday morning Feb 29, and the food was definitely worth the wait!  Best brisket of the three places in town we tried that weekend, and best pork rib I've ever had in my LIFE!  Turkey breast was also juicy and tasty, and the pulled pork was good. They let us try a wee sample of this and that which helped our ordering. We would return!",
   "So worth the wait.\n\nGet here early, they open at 11 am, but we got here at 11:15 and waited for almost an hour and a half. First time to Texas, and while I haven't had the most experience with BBQ, this was definitely my favorite. Come with time to spare, make some friends, and order a beer in line and enjoy the wait before demolishing some delicious meat.\n\nMust orders: Brisket, Beef Ribs (if they aren't sold out), and some sides (always pickles) and put yourself willingly into a delicious food coma.",
   "Some local friends brought us and we all enjoyed the food. This place is very popular and ran out of much of the menu. This was my second visit and the preordering is the way to go. I don't understand the appeal in waiting in line for 2 hours if you have a choice. We had the brisket and then ate the beef rib. Both were smokey and tender and a good balance of protein and fat."
  ]
 },
 {
  "name": "Eddie V's Prime Seafood",
  "address": "301 E 5th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40d2f4dc-932e-11ea-9c13-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "drink",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=2555005985271487131",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place!  It is consistently wonderful!  They have the best servers and waitstaff who really know how to make each visit a unique and special experience.  I went with a group of 4 friends to celebrate a birthday.  The hostess  asked if we were celebrating anything special upon our arrival and to our surprise when we were seated at our table there was a birthday card which had been signed by the waitstaff.  There were also fresh rose petals scattered along the middle of our table along with a candle.  \n\nAfter having a delicious meal with cocktails, we decided to splurge and order the bananas foster to share.  In addition to the dessert we ordered (which had Happy Birthday beautifully written on it), the restaurant treated us to a second complimentary smaller bananas foster for the birthday girl. It was incredibly decadent and a very generous and sweet gesture.   \n\nIf you are looking for a special night out, or simply delicious food in a delightful atmosphere, this is your place.  I come here as often as I can.  Thanks for your great food and service!",
   "I went to Bristol on a business lunch last week and it was quite impressive. The wait staff was extremely knowledgeable about the menu. I would recommend getting an entree from the \"fresh catch\" section of the menu. All of the fish on the section is flown in (never frozen) and you can really taste the difference. The sides were all delicious and great. It's a bit pricey, but you're paying for high quality food and it is well worth it!",
   "This place is fantastic!  Never disappoints.  I highly recommend the Bone-in Filet and the Bananas Foster Butter Cake will be among the best dessert you've ever had.",
   "Had dinner at the other location last week. Great experience but not the best. This week, we had New Year's Eve dinner at this location. Perfectly wonderful! Our server, Krystal, was amazing. She was professional yet personable and she made our experience perfect. The food was amazing, as always. We had the Chilean sea bass, half a dozen oysters, the Fuji apple salad, Au Gratin potatoes and the absolutely wonderful bananas foster cake. Everything was so good! The drinks were also much better than the other location. The bartender really knows how to make a drink. I had an amazing lemon drop. This will be the only location we visit when we come to Austin. Eddie V's is still my favorite restaurant in the world.",
   "Incredible! We started with happy hour. The bartender was knowledgeable and friendly and the cocktails he concocted were just what the doctor ordered. For dinner, I had the king crab and lobster bisque. We started with the shellfish tower. Try the truffle Mac and cheese, it was the hit if the night! Be careful, this place is PRICEY. But for a one time treat, go big. We loved every minute. Highly recommended!"
  ]
 },
 {
  "name": "Hillside Farmacy",
  "address": "1209 E 11th St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/411ecc4a-932e-11ea-81d7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10564411408943372096",
  "source": "GoogleMaps",
  "reviews": [
   "Always love Hillside Farmacy. First time not going for brunch, and the high quality of food is of course not lost! I would give the burger itself a 4/5 as the patty was just slightly lacking in flavor. The fries on the other hand were absolutely incredible!! Some of the best I’ve had in recent memory. The Brussels sprouts were out of this world and the sautéed greens were delicious as well. 4 stars only because this time around the service was a little bit sub-par.",
   "Amazing everything. The experience was super lovely. Staff very friendly, with a comfortable and clean establishment. The food was scrumptious. You won't leave without finishing off every crumb on your plate. Check this place out!",
   "We are still talking about we can’t believe that everything was so good even 30 minutes later. We got a caesar salad, burger, the Trees Knees, and Hot Country Doctor. The last two were cocktails and both were amazing. We even asked the bartender how the Trees Knees was made",
   "Parking is a mess but the pancakes makes up for it....so fluffy and rich.   Kale salad left me wanting a little something more...The biscuit gravy was delicious.  Dog friendly.  Clean and well kept bathrooms.  The bloody Mary, is a work of art...just look at the care they took to make it.",
   "This place fits right in with the Austin feel. Great food, great service, great atmosphere! Must try the fried green tomatoes egg sandwich, it's so good."
  ]
 },
 {
  "name": "Fogo de Chão Brazilian Steakhouse",
  "address": "309 E 3rd St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4177660a-932e-11ea-a952-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "eat",
   "eat",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=3662433321807993520",
  "source": "GoogleMaps",
  "reviews": [
   "If you want a world class case of the meat sweats after dinner this is your place. Tender cuts of delicious beef and pork and don't ignore the chicken. Try it out you'll go home happy and full! Convenient valet parking out front. Friendly and attentive staff.",
   "Oh my goodness this is my favorite place in the whole wide world. Our experience was amazing. Everyone was so professional and nice to us. We came to celebrate my promotion at work and we could have not picked a better place. We will be back in a couple of months to celebrate my birthday. Thank you so much for making our experience amazing!!!",
   "It's definitely an experience. The meats are plentiful and they come out quickly, maybe not fast enough for a quick eater like myself but good enough. The salad bar is pretty good and expansive. The meats were delicious. They weren't so good that I'd spend this much money again to eat, but they were definitely good. Little bit on the salty side. Service overall was pretty good, although we waited quite some time to get our bill.",
   "The fresh meats just kept coming to the table. You take what you want and decline the rest.  when you want them to stop offering new meat, turn your coaster over to the red side.  Ready for more?  Turn it back to the green side.  It was great. each person had a different type of meat that was freshly prepared and ready for serving.  There was also a huge market salad table with so many options You could eat just that and still be very full.  The homemade Brazilian flan was fantastic!",
   "We came for lunch and choose the breakfast/brunch buffet option. The buffet is comprehensive, is very fresh and of noticeable quality. For a protein option I opted for the Sausage and that maybe the best sausage I have eaten. I had decided on mineral water to drink but once I had tasted the spicy sausage I knew it begged a Mendoza Malbec. The house labelled wine was a 2017, very young, and it is going to be very drinkable in 3 - 4 years. Right now this wine is very closed but the potential is excellent. The service was exceptional. I really enjoyed this restaurant right down to the traditional dress being worn. I  can't wait to go again and try a steak."
  ]
 },
 {
  "name": "Comedor",
  "address": "501 Colorado St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41c03022-932e-11ea-a5d1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6958240678106455106",
  "source": "GoogleMaps",
  "reviews": [
   "We had heard so many great things about the Comedor that I was concerned our first visit wouldn't live up to the hype. I am so glad to report the experience not only met our expectations, it exceeded them.\n\nWe were fortunate to have the weather cooperate, so sitting on the outdoor patio, on a cool, yet comfortable evening added to the experience. \n\nService was friendly, yet professional. We elected to sample tapas style allowing for each dish to come out as it was ready. My photos don't do justice to the tastes 😊",
   "They earned their number one spot as best restaurant in Texas. Truly inventive and delicious. The chef is a genuine treasure, and the staff is stellar. Just look at this heavenly dessert!! The space and menu, and even the play list is thoughtfully and brilliantly designed. Meant for an intimate shared dining experience. So great!",
   "Service is a solid 4 stars, bathrooms are 3, food and drinks are a 7 out of 5. Don't leave Austin with out visiting here, small plates are amazing as is the wine list. Cocktails alone are worth a visit. Small plates are where the action is on the menu, they are all amazing, put your focus there and you'll leave happy. Expect to pay about $100 per person, inclusive of drinks.",
   "Beautiful vibes. Gorgeous light on the inside. Love the simple and dark design. The food is delicious. We went with some pros, so I didn’t have to order anything, but everything that was brought out was amazing. Staff was kind and stylish. 10/10 would return. Ps - I never thought I would eat a bone marrow taco 🌮 and love it... yet here we are (drool... 🤤) Don’t leave without ordering that dish.",
   "Amazing and worth the visit. Make a reservation in advance, unless you can find a spot at the bar for happy hour (which I need to attend soon). Great atmosphere and environment with a focus on specialty cocktails and exquisite food. Their most popular dish is the bone marrow tacos which we ordered. Loved the margaritas they made, ordered spicy margs and enjoyed. The only pitfall we had was the reservation we made was for the patio. However, when we got there they said the patio was full. Either way, specialty restaurant for special occasions."
  ]
 },
 {
  "name": "Hoover's Cooking",
  "address": "2002 Manor Rd, Austin, TX 78722, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42115ed8-932e-11ea-a134-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11242317709971741295",
  "source": "GoogleMaps",
  "reviews": [
   "That ham steak with Jezebel sauce was delicious.  Everything tasted awesome.  Clean bathroom, nice staff and home cooking....great way to be welcomed back into Austin.  Nice selections of cobblers.  Open til 10pm which is also great on a Tuesday if your plane gets in late.",
   "I don't come here often but need to start coming more often. Service was fast and friendly and the food was delicious. They have many side options and I love that they give you three! They also have special sides do don't forget to look at the chalk board.\n\nI haven't tried the BBQ yet but I will next time. \n\nThere is plenty of parking.",
   "What can I say. That chicken from the smokehouse was on point. Perfect smoke, flavor, and just falling off the bone good. Service was excellent. Aaron was on time and on target with the service. You guys have something good going here, obviously. I travel all over the world and this place just became a top shelf spot to visit while in Austin. Keep it up.",
   "Atmosphere: Country diner\n\nService: Friendly and quick \n\nFood: Chicken fried chicken was on-point and a very generous serving. We opted for mashed potatoes and cream gravy (perfect) and fried okra (soggy breading). Corn muffins and strange spiced biscuits were okay. Banana pudding cheesecake was a decadent innovation.\n\nPricing: $36.00 for above with 2 teas",
   "Large portions. Down home cooking with a twist. Some kick and spice to most dishes. (Edited to say) And the food? Outstanding. We used to eat at the one at Anderson Mill and were so disappointed when it closed years ago. My office was beside it and needless to say I was a regular. You can't go wrong. I can only say hurry up. What are you waiting for?"
  ]
 },
 {
  "name": "Clark's Oyster Bar",
  "address": "1200 W 6th St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42551fd2-932e-11ea-95c4-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7769812336814339815",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere was great. Staff was pleasant and courteous. Quality of food was excellent. Presentation and taste were on point. Highly recommend and well worth the price point. Great cold bar and dessert selection! Kinda almost felt like I was in Martha’s Vineyard.",
   "Amazing meal with amazing service. Impeccable place! Make sure to make a reservation! Nice place to enjoy lunch with friends. We were seated and greeted immediately. Our server was knowledgeable and helpful. The oyster selection is great as it has choices from a few different regions. I really enjoyed the sex on the bay oysters. And the shaved horseradish, wow! I would recommend the dressed oysters as well. The flavoring was divine. I especially loved their salads and the lobster roll. Their matchstick fries were so crispy and plentiful. Can't wait to go back!",
   "Delightful neighborhood oyster bar + seafood joint. Portions are on the smaller side though they make it up in flavor and texture. The roasted cauliflower with hazelnut and raisins was the highlight. As were the shoestring fries - the whole mountain of them! \nService is great - server was friendly and food was served fairly quickly. Generally children-friendly.",
   "The food is amazing. We change the oyster menu about 2 twice a day, so people have a variety to choose from. We get oysters from all over, but we don't have gulf oysters. My favorite oysters are Onset and Murder point. \n\nMy favorite dishes from the hotline are crispy snapper and cioppino. The grits are really good. I also like the kale and brussel sprouts.",
   "Oysters were AWESOME! Seafood is super fresh. Service was great by Scott. The boss with the big red beard was accommodating and very professional. Outdoor seating was peaceful and really comfortable. I highly recommend this place, especially if you need a good change of scenery. ALOHA."
  ]
 },
 {
  "name": "Corner Restaurant & Bar",
  "address": "110 E 2nd St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42a78708-932e-11ea-8489-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2814634074907806452",
  "source": "GoogleMaps",
  "reviews": [
   "Not bad. Music was pretty loud. I had the fried zucchini corn bread and a house salad. I asked for a different vinaigrette than the spicy, because I have a weak mouth, but the salad itself was spicy too, alas.\n\nThe salad required cutting. I've never had to cut my lettuce and croutons before, but they wouldn't even fit in my mouth otherwise. \n\nThe fried zucchini corn bread was interesting. I could taste the grease from frying. Some honey or other topping may have improved the taste. It was nicely moist.\n\nThe greeter and waiter were both very friendly and attentive.\n\nIf you like loud music and spicy food, this may be the place for you. If you like quiet and \"boring\" food, maybe skip this place.",
   "I had the crispy fish tacos which were amazing! The chipotle sauce is on the side which is a good thing because it had kick. Appetizers we good. We got the nachos and three dips and they even refilled the nachos for us. Our server was excellent.  Overall great time",
   "Traveling around the downtown area of Austin, this bar totally caught our eye! Bartenders Joe and Dave were super attentive from the second we sat down. We ordered the Bacon and Spinach salad which was one of the best salads we have ever had, and the Short rib nachos. The bartenders were very knowledgeable about the cocktails and food! Great ambience too!",
   "We came to corner for a girls night out and it was the perfect spot! Great location downtown, super clean environment, good crowd. I had the salmon and it was cooked perfectly. Our server Chelsea was super accommodating, giving us good recs for the city. She had the most upbeat attitude and made our dining experience that much more enjoyable, we will miss her!!",
   "The highlight of my visit here were the 3 dips and chips appetizer. Seriously, check it out. Really nice interior and various seating areas. While the app was good, the entree I ordered was good but not exactly notable. I will be returning sometime for dinner and I'll update my review when I do, but as of now I would just say the food isn't anything to write home about."
  ]
 },
 {
  "name": "Roaring Fork",
  "address": "701 Congress Ave, Austin, TX 78701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4307a0e4-932e-11ea-8521-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "drink",
   "eat",
   "food",
   "knowledgeable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14874993945797901026",
  "source": "GoogleMaps",
  "reviews": [
   "We had a great meal and the service was very good too. We have visited before and every time the food has been consistent well prepared. I will say it is pretty expensive, but I think when you decide to eat on Congress Avenue you probably should expect to help pay for the high rent. I enjoyed soup, salad and a cocktail. Cliff was helpful with making suggestions, super attentive and a great server.",
   "Invited by coworkers to eat here. Customer service was good. Seated quickly & drink orders quickly taken. Customer service was decent. Food served hot and was nicely seasoned, and tasted good. Prices were expectedly in the high range, but food of high quality. Nice meal. Only downside was the restaurant was dark and it was very hard to read the menus.",
   "Great atmosphere, white table cloths and candles kind of place, but very welcoming to a couple of travelers in tee shirts and shorts. \nWait staff were very friendly and knowledgeable. I definitely recommend the salmon. The fish tacos were good as well. A must try in downtown Austin.",
   "Loved our after Valentine's day, Valentine's celebration.  This downtown restaurant had an a amazing menu. The steak was prepared perfectly.  But surprisingly the guacamole was one of the best we've had!  Server was very helpful and kept our glasses full. It was definitely a great night out.",
   "We had a phenomenal time at the Roaring Fork.  The food was delicious and flavorful.  We had the best waiter Cliff attending to our table.  He was on top of it from start to end offering suggestions on what to try on the menu.  Everything that was brought out was delicious.  The burgers are giant, so bring your appetite.  The green chili Mac and cheese is delicious and very cheesy.  If you’re a dessert person you definitely want to try to pecan pie, the peach pie was amazing also.  Next time I’m here I’ll definitely return."
  ]
 },
 {
  "name": "Bufalina Pizza",
  "address": "1519 E Cesar Chavez St #200, Austin, TX 78702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4357e568-932e-11ea-86a8-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "foodie"
  ],
  "link": "https://maps.google.com/?cid=15594052442158171729",
  "source": "GoogleMaps",
  "reviews": [
   "The food is five-star for this kind of resto, it's a fun, laid-back place to eat but our server was having a bad day (although previous reviews have noted service attitude issues). The pizzas and salads were excellent, and it's clearly a regular spot for locals. We'd definitely go back for the food and hope for a more gracious server. We were introduced to Bufalina this weekend by our son in Austin. Excellent Pizza and a wonderful wine selection. We will definitely be back and have already sent out a recommendation to our foodie friends. Add it to your list.",
   "Great pizza and wine spot! There is usually a wait, but it is well worth it (and you can have a glass outside while you wait). The pizza is cooked in a blazing hot wood fired oven that sits in the middle of the restuarant. On top of that, they have one of the best wine lists in Austin, and really know their stuff. Would definitely recommend!",
   "Go early because the space is small and fills up fast. The apps, pizza, and wine are all amazing. The service is fast and very friendly. The only drawback to this location is the noise level when the restaurant is full. The chef let us try a dessert tart that isn’t on the menu yet... and it was a solid finish to a great dinner.",
   "The pizzas from here give a NYC pizza a run for its money! And it’s right here in Austin. The sauce is rich and tangy, and the decor is casual but fancy at the same time. The firing oven is right in the sitting area so you can watch your pizza being made while you sip one of their wines. Good place for friend meet ups, having a birthday dinner, or a sweet date.",
   "One of best pizzas I ever had! Nice selection of wine, great desert, quite a bit of waiting (we waited an hour on Friday night)."
  ]
 },
 {
  "name": "Rosewood",
  "address": "1209 Rosewood Ave, Austin, TX 78702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43b71ddc-932e-11ea-8911-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "delicious",
   "unique",
   "food",
   "tasting",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11164874465239479489",
  "source": "GoogleMaps",
  "reviews": [
   "Rosewood is great! We had a work dinner here and reserved the outdoor patio and it was perfect! Our team enjoyed spending time together playing the games Rosewood had outside. The weather was perfect and they took great care of us! They’re food was unique and delicious! Please go enjoy this beautiful restaurant!",
   "Wonderful location that seems to breath at brunch rather than suffocate. Food is spotty with odd beignets swimming in a bourbon sauce but then a great fried chicken sandwich and delightful breakfast of eggs. \n\nGo for the atmosphere and be alert to the menu fluctuations.",
   "Recently ordered their fried chicken dinner to break up the monotony of cooking at home during quarantine. Ordered the night before and received a prompt and courteous confirmation from Jeb the next day. Fried chicken was juicy and delicious. The greens and potato salad were tasty 😋 They are also selling produce that we will look at next time. Thanks!",
   "A unique atmosphere that was inviting and fun. Made for a lovely night out with friends and co-workers. I highly recommend if you want a more relaxing night out with amazing food and service.",
   "Tasting menu!!!! It changes daily and we had a wonderful time enjoying then anticipating our next dish. The home itself has a very interesting history. We want to try the picnic basket on the lawn and brunch next!"
  ]
 },
 {
  "name": "Péché",
  "address": "208 W 4th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/442ee81e-932e-11ea-a714-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "drink",
   "eat",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=991668141432350343",
  "source": "GoogleMaps",
  "reviews": [
   "Visiting from Dallas and wanted a place to get yummy cocktails. It was suggested we come here, and boy are we happy we listened. \n\nIf your just getting drinks, sit at the bar, the bartenders are great company. The drinks are delicious and unique. Prices are reasonable for what you get. Keep in my this to not 6th St. You're gonna pay more than $5 for a drink. But you're not going to get gut rot the next morning.\n\nThe old fashioned is fantastic. Made the correct way with a large ice cube and strong. It's our go to beverage to see the quality of the bartender and the restaurant.\n\nI also had an adult milkshake. YUM! You really can't go wrong here.\n\nWe didn't eat any food, but it all looked delicious as it passed us by.",
   "The drinks were fantastic.  The bar has everything you could imagine.  The bartenders are incredibly personable and experienced, and like what they do.  The food was well intentioned but the execution was a tiny bit off.  I get that it's Friday and all so that might have been it.  I do need to mention the food came out perfectly timed and the restaurant has great ambiance  too",
   "I came here with a friend for their milkshake that has alcohol in it. I suggest the Grasshopper if you like mint. It’s really good. I went around happy hour.",
   "Great atmosphere. Wonderful service even though we came in a big group with kids. \nThey have the best Mac and Cheese, even the adults loved it.",
   "The drinks are usually great. The burger is good but can sometimes be overcooked (all 3 were this time). I do love the French onion soup and the Mac and cheese. \nService at the tables is less than mediocre, and actually completely apathetic. Definitely sit at the bar!"
  ]
 },
 {
  "name": "Chez Nous",
  "address": "510 Neches St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4492095a-932e-11ea-a8c7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1898130549471281605",
  "source": "GoogleMaps",
  "reviews": [
   "Love. Love. Love this place! Great customer service. Great ambiance. Food is ALWAYS delicious. They split our meal for us too. We ordered Escargot, wine and New Zealand Lamb Chops.",
   "Very Nice atmosphere . Did remind me of France. Quaint, food simple, well prepared. All waiters are waiting on you and service was fast! I came because of the other reviews and that the owner answers all of them personally!!! Impressive. I had the trout. It was light, which is good, watching my weight. Needed a little salt. That’s ok. Much worse if the food is salty.",
   "Really surprised by this place.  It has the authenticity and feel of an old school mom and pop shop with the caliber of food from a high end restaurant in an unassuming and genuine package.  It's a small and cozy place has much more intimacy than most of the other restaurants in Austin that I've been.  Great service and wine selection.  I'll definitely be back.",
   "The food was really good. I really enjoyed the crème brulee. Be ready to wait some time during pick hours. The good thing is that they call you when a table is available so you can go look around if you want.",
   "This was a very fun family activity. One thing that I was suggest would be to lower the prices a bit, because I don’t think that the price is worth how longer than they are and what you’re doing. If you were to go it just a little bit may be 10 or $15 per person I think you to get more business."
  ]
 },
 {
  "name": "Caroline Restaurant",
  "address": "621 Congress Ave Suite 101, Austin, TX 78701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44d6e026-932e-11ea-b002-14b31f159f22.png",
  "tags": [
   "drink",
   "free",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4093074264320094839",
  "source": "GoogleMaps",
  "reviews": [
   "Great happy hour for brunch and lunch! Had a coffee and a free raspberry danish. The happy hour drink feature was a blood orange margarita. Loved the quality and prices. The bar area was clean, comfortable, and beautiful. Staff were cordial.",
   "I usually avoid hotel restaurants if at all possible, but Caroline was great. This was the best fried chicken and waffles I've ever had, as the chicken skin was extra crispy while the meat was moist. The waffle was fluffy and served with sides of both syrup and honey butter. I also had a tomatoes, olive oil and sea salt side that was on the pricey side, but well worth it.",
   "The biscuits and gravy was an amazing mid afternoon brunch. Perfect amount of crunch and softness to the biscuits. The gravy had sausage and ham which was delicious. The poached eggs were perfection on my plate but a little over done on my friends plate. Over all a great experience. It was beautiful to sit on the patio and people watch.",
   "Trendy spot attached to the Aloft hotel with an upstairs and downstairs seating area. Clean and the staff are friendly. The food took a bit of time to arrive but the taste was worth the wait.",
   "Wonderful food and Kevin was an amazing server. Portion size was great and I even have some left over. Definitely one of our favorite spots downtown."
  ]
 },
 {
  "name": "Swift's Attic",
  "address": "315 Congress Ave, Austin, TX 78701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4529e392-932e-11ea-90ec-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=7686845846754392187",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed lunch here. Both of us appreciated that the restaurant was quiet enough to hold conversation. Salads were perfect and I thoroughly enjoyed the lunch special which was a crab cake sandwich.",
   "Really great V-day dinner at Swift’s. Cool, rustic decor upstairs and welcoming staff. The set menu for dinner had lots of nice options that all came out delicious and full of flavor. The manager noticed we only got one dessert at the end of our meal and brought us two to enjoy. They also brought a red rose to my girlfriend with the check so really made her feel special. Keep it up!",
   "I love the cozy, warm wood tones and industrial metal accents. The decor though still doesn't stack up to how good the cocktails are. Everything is incredible and potent! A great places to relax and have a few drinks with friends without having to shout over crowd noise.",
   "We ordered three appetizers and split two entrees and everything was amazing! Staff was great and ordered some drinks. I ordered their old fashion ice ball drink - best part, the ice melts and makes an old fashion slushy but if you add an extra shot you get two drinks.",
   "This is an interesting restaurant that is an Asian fusion with a good mixture of options. \n\nI sat at the bar and the staff Zack and Sam were incredibly friendly. They switched off serving me and it took a little bit for me to get noticed as there is a pole in the center of the bar. Otherwise everything else was great!\n\nThe drinks were awesome, they had these great drinks where they take a variety of ingredients freeze it into a ball and then pour liquor on top! Over time the ball melts flavoring the drink, essentially allowing you to choose how strong you want the drink. They will also let you buy another liquor shot to top off the drink! So you get two drinks almost got the price on one. I got the strawberry ice ball and the Pimm's one. Both were good just in different ways. I also got another interim drink while I let one melt the was very good.\n\nI had the calamari fries which were amazing. Think cut calamari lightly battered. Then I had the pork cheeks with sour dough, it was okay but lacked flavor, and finished with a desert. It was also very good.\n\nI'd recommend stopping in, but if you want a table make sure to get a reservation!"
  ]
 },
 {
  "name": "Koriente",
  "address": "621 E 7th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/456ae564-932e-11ea-b42a-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "free",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13268314626462974099",
  "source": "GoogleMaps",
  "reviews": [
   "This was a pleasant surprise! My boyfriend and I came here for Valentine’s Day expecting the regular sushi type restaurant with sushi prices. Turns out the sushi prices were nonexistent! We got bowls with unique oriental cuisine. I had the sushi and my boyfriend had the steak. Both were phenomenal with the spring roll! \n\nI also am a huge tea lover. They had loose leaf tea served in tea pots with however many cups you need! Every detail is amazing!",
   "This place is a gem! Two people that have moved from Austin have told me that it’s the place they miss most - on separate occasions! It’s that perfect place to suggest when with a few friends and no one will make a decision, because it’s laid back, but still feels like “going out to eat”. The prices are hard to beat, location is fun for drinks afterwards. The best part besides the food- a flavor you can’t find anywhere else - is the people! The people are AMAZING, so friendly and positive, they brighten your day.",
   "Hidden Gem in Austin. Upon entering, you feel the good energy. You can wait for your food or drinks while enjoying free soup",
   "Wow. I'm glad we got there early because soon after we ordered and sat down there was a long line forming outside, which took people 15-20 minutes to get inside and order. The young lady taking orders at the counter was really nice, patient, and extremely helpful about my order. The food was really good. You get served a lot! I am definitely visiting again!",
   "Fresh and delicious ingredients.  Consistently great food.  Awesome service.  Love coming here for lunch!"
  ]
 },
 {
  "name": "Fabi + Rosi",
  "address": "509 Hearn St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45b3b30c-932e-11ea-b457-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6621090568173783163",
  "source": "GoogleMaps",
  "reviews": [
   "I checked this place out with a couple of friends of mine tonight. This is a very quaint and cute little place right across the street from deep Eddy dive bar. It's a super cute place and the food was very very good. I love their happy hour! I had a mushroom ravioli dish that I thought was absolutely amazing! The environment of the place was very nice and outdoor seating was quite pleasant. If you are as prone to mosquito bites as I am, ask the staff for some mosquito repellent. They have a ton of them! I would definitely come here again and I recommend this place!!",
   "The restaurant has a great classic ambiance. I attended with a party and the service was good. They have a great menu and the food did not disappoint. The price is great as well.",
   "Everything here was excellent. The only feedback I would have for the owner is to increase the sizes of the main courses. The Halibut was excellent but almost as small as an appetizer, in my opinion. The lobster risotto felt a little held back on the lobster for it's price. Other than that, it's a lovely place.",
   "Well... this place has entered in contention for one of the best places to eat in Austin. I really enjoyed my meal here. Before I get to the food, I got to say that the restaurant space has an excellent vibe and really cute. Great space for a nice little night out on the town.",
   "Exceptional. The menu isn't extensive but has just enough options to satisfy all palettes. I love that the meals are made from sustainable and locally sourced ingredients at a fair price. The warm and inviting ambiance of the restaurant is an added perk."
  ]
 },
 {
  "name": "Café Josie",
  "address": "1200 B W 6th St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45f88002-932e-11ea-b2f8-14b31f159f22.png",
  "tags": [
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14386090397241319353",
  "source": "GoogleMaps",
  "reviews": [
   "Really outstanding small plates. Lots of flavor in everything we ate. The roasted Brussell sprouts and wedge salad were perfect. We did the \"Experience\" and were absolutely stuffed afterwards. The mixed drinks were also expertly crafted.",
   "There's a lot of things in life that I truly appreciate and one of them is great food. Cafe Josie has the most talented chefs in Austin. The food is unique, always served fresh, and the atmosphere makes for the perfect date night!",
   "My wife and I came here for date night.  We both had The Experience which was amazing.  We tried 9 different dishes and loved all of them, but the pork belly, the brussel sprouts and the deviled eggs really stood out for us.  We normally love pork belly anyways, but the smell of the grill infused into the cauliflower confit provided this amazing balance to the pork belly.  I normally dislike eating brussel sprouts, but they roasted and seasoned these perfectly that I had two extra helpings.  Service was great and very attentive, bringing out the dishes as we were finishing other dishes so that we neither felt impatient nor rushed.  Over all it was a great evening, and if we had the opportunity to, we'd come back again.",
   "Absolutely loved everything we tried! Excellent presentation and very flavorful and our server Mary was very pleasant. I am already looking forward to going back.",
   "In a word, Cafe Josie is amazing! With 13 small plates to choose from, I think we tried everything - crudo, Brussels sprouts in a balsamic vinaigrette, fried oysters, short ribs, meatloaf, salmon, shrimp, and I can’t remember them all. The flavors all worked together and the staff incredibly friendly and helpful. We went with another couple to celebrate our wedding anniversary and we will be going back very soon. Highly recommend"
  ]
 },
 {
  "name": "Home Slice Pizza",
  "address": "1415 S Congress Ave, Austin, TX 78704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/463ff5be-932e-11ea-bb3f-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12299280573550492680",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome pizza! This is my favorite place to go to in Austin. Several weeks back I got the white pie with spinach and the eggplant pizza and its was incredible! \nThe only downside is that they allow kids at the bar. Hopefully that was a one time thing that I saw, but if not, that's bad business practice.",
   "Service is outstanding and atmosphere is cozy yet fun. If there is a wait, I highly recommend going to the back patio and ordering the garlic knots. They are fantastic. We had a pizza and it was good, but not amazing. Overall, it’s a good place and you can tell it’s filled with locals.",
   "We popped in to look and the host explained that there would be a lineup if we came back after five and besides “if you cone back before five I’ll still be here so you get to see me again.” Perfectly delivered -neither arrogant nor inappropriate- just fun and funny. It worked and when we returned a colleague was about to put us on the back patio (it was getting a little cool) she came running up and told her co-worker “I got this” and within seconds she had cleaned up a booth. It was more crowded after five not no lineup. If this is her “routine” I might be even more impressed. As for the food we went simple with pepperoni and mushroom- one word - fantastic! When they asked if we wanted our pizza boxed we said we’d rather it wrapped in foil for easy carrying. No problem.",
   "This place is an amazing! The seating arrangement in the backyard is a perfect family style setting. The pizza slices are made fresh and they taste delicious. We ordered two different slices. Strongly recommend trying the house special pizza as well.",
   "Sooooooo good. Crowded. Better to get and go. But there's nothing better than a slice of pizza from here while strolling on congress Ave."
  ]
 },
 {
  "name": "DeSano Pizzeria Napoletana - Downtown Austin",
  "address": "301 Lavaca St Suite 200, Austin, TX 78701, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/468c8dba-932e-11ea-b353-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3865327066180748277",
  "source": "GoogleMaps",
  "reviews": [
   "A great place for pizza in downtown Austin! I came across this place while I was waiting for a bus one morning. Finally got around to trying it out a week later...delicious! Well, worth visiting a few more times to try out other selections! Parking is…well, it’s downtown parking. Easily seen along Lavaca St between W 3rd and 4th St. Friendly and great service!",
   "We got the DeSano pizza, the crust was tender on the inside and crispy on the outside, charred to perfection! The crust had a good flavor, you could tell they used the best ingredients out there! The sauce had lots of flavor, the toppings were quality choice ingredients too! Do yourself a favor ... get the garlic butter to dip your crust in ... its great without it but with it it’s mindblowingly delicious! We also tried the meatballs and they tasted like a little old Italian lady had rolled them out by hand, they were so tender and juicy! Some of our party got salads and said they were tasty too! I highly recommend this pizza as the best I’ve had in Austin TX!",
   "Amazing spot! Pizza was fantastic and I'm from Jersey! If you are in Austin and want some good pizza, come here. If you're from NYC and want pizza, come here! Chat with Nick; he'll tell you the real deal! Super helpful, cared about our experience and has an awesome sense of humor. Thanks for satisfying my pizza craving!!",
   "Great atmosphere! Good pizza! Seating can be tight when they are busy. I ordered the Pepperoni Margherita Doppio and it was amazing. Will definitely be back in the future.",
   "The tomatoes and Mozzarella cheese is my favorite. Some of the best pizza I have ever had right here. Everything tastes fresh, ingredients are shipped in from Italy. I highly recommend this place to anybody who wants some great pizza. Great Location right near Stay Za Za Hotel downtown. The pizza is indescribable and the service was superb, it's the best pizza experience I've had in Austin.  My favorite was the minced garlic at the condiments bar. I will definately go there again."
  ]
 },
 {
  "name": "Z'Tejas",
  "address": "1110 W 6th St, Austin, TX 78703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46d7a7ee-932e-11ea-bddd-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3482349314898839457",
  "source": "GoogleMaps",
  "reviews": [
   "Our server Michael was great and attentive during our visit. He had great suggestions for food and drinks. Would definitely come back!",
   "This was our first time to eat out publicly since quarantine and we had the best dinner experience! We felt super safe and our server, Michael, was amazing. Definitely coming back!!",
   "Had a great time dining outside here. The drinks were amazing, food was delicious and our server, Michael, was excellent! Would recommend and will be back!",
   "Food was really good!! Only issue was we are strict Vegetarian and they served beef in vegetable fajitas! If you eat non vegetarian you can get best food here",
   "Great experience! Everyone was wearing masks and I saw them cleaning the chairs after each party. Michael was a great sever, very attentive!"
  ]
 },
 {
  "name": "Juan in a Million",
  "address": "2300 E Cesar Chavez St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/471d16cc-932e-11ea-919d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9725571444559478307",
  "source": "GoogleMaps",
  "reviews": [
   "Whether you live in Austin or just visiting, if you've never been to Juan In A Million, you need to do so! I recommend the Juan In a Million which is such a huge portion. It's a great place to start your day! \n\nI will say if you go during prime breakfast/brunch times, then you will have to wait. There isn't enough seating for the amount of people that come to this restaurant at one time so it will be a bit cramped. Parking may be hard too but they have a parking lot behind the restaurant and there is street parking, but those are obviously first come, first serve. \n\nThis place is popular and it's a great price for the portion. I do hope they can expand their restaurant but other than that I do appreciate the authenticity of the place. Even though they've become super popular, they still keep it very simple.",
   "Juan you definitely are one in a million along with staff. I felt like I was invited to your home and you brought out your best service,food and drinks. This was my first visit to Austin and this be a memorable experience. The food taste, quality and portions does not disappoint. I will definitely come back.",
   "The food is pretty good. Definitely satisfied our desire for breakfast tacos. The Don Juan is, indeed, way too much food for 1 person and can be broken into 4 or 5 smaller tacos. The salsa is quite good, and the service is efficient. \nIf you're looking for tasty food on a budget, or like the idea of buying local at mom/pop style places, this is a great choice. It is authentic Austin.",
   "My boyfriend and I live in Houston but we love traveling to Austin. Our first stop is always Juan in a Million. The food and service is amazing. It feels like Home. My boyfriend always looks forward to the handshake and the Don Juan Taco. As soon as we can safely travel to Austin again, we will make sure to stop by Juan in A Million. Thank you.",
   "Three of us shared the Don Juan Grande and a chorizo and egg taco. Both were so delicious! There’s so much flavor in the food. The tortilla chips they give you when you sit down are also really tasty. The service was great and everyone was friendly. I can see why they’re always so busy. Even if you see a long line at the front, don’t get discouraged. They move quickly. We waited about 10 minutes and it was very worthwhile."
  ]
 },
 {
  "name": "Intero Restaurant",
  "address": "2612 E Cesar Chavez St, Austin, TX 78702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47657424-932e-11ea-983d-14b31f159f22.png",
  "tags": [
   "food",
   "approachable",
   "food",
   "art",
   "drink",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6058362839333934542",
  "source": "GoogleMaps",
  "reviews": [
   "Wow... wine selection was amazing. We went for a special Monday event so I can't comment on the food but other attendees were raving about it. We will return when restaurant is open to sample all the yummy offerings.  The menu looked amazing. Special class offered was fantastic!",
   "Love Intero! Food and space is fantastic. Really approachable menu. The husband wife owners are great. My wife has a dairy allergy and they were more than accommodating.",
   "Every bite, every meal, every experience, every single time...pure perfection. My husband and I have never not had a perfect night from start to finish here. Whether we're having date night, or with guests, it has always left us in awe. It's why we keep coming back. \nThe service here raises the bar in Austin. Be sure to ask to sit in Theodore's section (we're pretty sure he has a cult following at this point).\nDon't forget to pick up the chocolate works of art to take home...decadence like nowhere else.",
   "Beautiful restaurant, great staff and incredible food, had an amazing time with my Girlfriend on are First Anniversary will staying in Austin. One drink I would recommend specifically is the: after apple-picking, sweet and ever so slightly sharp. Make shore to book ahead as can get busy. Plenty of space in the restaurant for a romantic setting and private conversation.",
   "Welcome to the east side Intero! A great little spot with an even greater happy hour menu ($2 off any drink and half price bar food) from 4:30-6:30. \n\nWe have slowly gone through almost every item on the bar menu in two visits. The wine selection is really nice - they carry different varietals that pique your curiosity. The cocktail menu has it going on while the friendliness of your bartender is hit or miss. Our first visit we had a very engaging and informative bartender that made our first experience a great one. The second time our bartender only responded with “uh huhs” and didn’t seem too enthused to be there. Come on folks, that’s why people like sitting at the bar because we wanna engage!\n\nThe food quality is high, the flavors are great even with items I tend not to like - in fact, my favorite dish thus far has been the roasted cauliflower! The white bean dip is another favorite. Their hand made pastas are good (the actual pasta could be better as sometimes they are over cooked), but the ingredients and sauces are superb. All in all, a good food experience. \n\nWe are hoping our next trip doesn’t include the grouchy bartender."
  ]
 },
 {
  "name": "Andiamo Ristorante",
  "address": "2521 Rutland Dr #325, Austin, TX 78758, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47a8bffe-932e-11ea-a6d1-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11260116493209775777",
  "source": "GoogleMaps",
  "reviews": [
   "Went this hidden gem last night with my family and ordered some plates and shared family style. The food and service was amazing. Great date spot as well. Don't forget to order the Gelato. It was amazing!",
   "Amazing bread! Rolled with spices. I had the summer menu pasta - squid ink pasta with octopus. Fantastic! Great flavor and not overly sauced. The spaghetti carbonara was also amazing with flavor from the Guanciale (pork cheek bacon). Highly recommend.",
   "We had never been here before and weren't sure what to expect when we arrived. The location wasn't what we expected when we booked reservations as it's in a small strip mall and the inside is much smaller than what we were expecting. \n\nI took my girlfriend here for dinner the night I proposed (she said yes!) and the food was absolutely delicious! We actually forgot about drinking our wine because of the food quality being so high!  The wine pairing was very descriptive too with some great suggestions from our waiter. Very professional wait staff, great food, and the interior was nicely remodeled as well. I would suggest this place for sure! All around a great experience.",
   "Don't let the strip mall location fool you. The food took me back to Italy! The tastes are amazing, the service is excellent and the atmosphere is nice. I had two specials for the day, the salad and the swordfish. Both cooked to perfection. Delicious! The wine list also took me back to Italy. A wide variety of Italian wine is offered. The Branchini sangiovese went perfectly with the food. Thank you Andiamo for a lovely dinner!!!",
   "Wonderful, authentic Italian food made with love. I could say more, but you should try it for yourself! I especially like their seasonal changes. Right now they're serving an incredible pumpkin ravioli and seafood penne. Their garlic bread is also the BEST in town!"
  ]
 },
 {
  "name": "Elizabeth Street Cafe",
  "address": "1501 S 1st St, Austin, TX 78704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47e6185e-932e-11ea-a342-14b31f159f22.png",
  "tags": [
   "food",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5132560538989797291",
  "source": "GoogleMaps",
  "reviews": [
   "This place is pretty insane. The food was prepared and served super fast and super quick. You can't go wrong with anything on the menu. The pork belly is from local pigs who h is cool. Will tell everyone who will listen to go here when in the neighborhood.",
   "This is a must try while in Austin!  We tried the French toast and banana Nutella crepe and OH MY so good! Also had their white tea and it was very tasty. Didn’t get to go back to try their lunch but wish I had.",
   "Super fresh, creative and friendly in a warm and attractive environment. The combination of traditional French and traditional Vietnamese cuisine together is brilliant. Where else can you get a perfect croissant AND pork belly with vermicelli cake for breakfast? Terrific!",
   "What a pleasant surprise! We absolutely loved this place. We sat outside because inside seemed stuffy. I loved the mango salad. Great flavor. I was less enamored with the Bahn Mi sandwich. It was good, but I was expecting more based on the reviews. It did have a satisfying crunch. The beignets and jam were out of this world. I order you to get them.",
   "Vietnamese food in a pretty French bistro.  Food: Tasty!!  Portion sizes: Good.  Coffee: European strong and served in a small glass.  Not a fan of the coffee but I would definitely come back for the food and airy atmosphere!"
  ]
 },
 {
  "name": "The Carillon",
  "address": "1900 University Ave, Austin, TX 78705, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/483460b6-932e-11ea-b3d4-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4202049172984800307",
  "source": "GoogleMaps",
  "reviews": [
   "The food is amazing here but I will return because of the staff. Me and my partner booked a reservation through OpenTable and I made a note that it was our six year anniversary. The staff made and signed a card for us and we were greeted to a champagne toast. Everyone on the staff was incredibly attentive and every course of our meal was artfully crafted. We will definitely be returning.",
   "Great food, great atmosphere, excellent service! Shout out to Oscar the manager for a great experience.",
   "I go to this place  a lot! This is my favorite spot to eat.  I go there at least once a month. The cooking is fantastic, the crew is welcoming and the rates are good. I enjoy meeting in this restaurant to have a tasty supper.",
   "Great to have such a cool bar/restaurant in town. Super selection of cocktails, wines, and beer. Not the largest selection of wines and beer - I think they have gone for quality rather than quantity, but the wines and beer I have tested were excellent. They even have a dry cider that my wife is happy about.",
   "Celebrated our 9 years of marriage here. Staff was great and the food absolutely amazing! Would recommend to anyone! A definite must! They gave us free champagne for our anniversary and added a happy 9th anniversary to the menu. It was very sweet and appreciated. Will go back! Looking forward to it!"
  ]
 },
 {
  "name": "Loro",
  "address": "2115 S Lamar Blvd, Austin, TX 78704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48793424-932e-11ea-9068-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "delicious",
   "food",
   "drink",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13539345899590166404",
  "source": "GoogleMaps",
  "reviews": [
   "What happens when a Asian restaurant and steakhouse have a love child?  Loro is what happens.  Interesting \"self-service\" kind of set up -- you order at the bar, and then they bring the food.  Service was excellent, and the food was unique.  I had salmon over rice with some Asian cabbage and other vegetables.  Seriously, I don't remember what they were, but it was all very, very good.  Probably better for a group and than date.",
   "Delicious variety of food. My friend and I ordered several items to share. They are all small plates.  Everything was very tasty.  You order food at the bar, and serve your own beverages.  It was cold when we went but they do have nice outdoor space. Nice casual place. Would definitely go again.",
   "This self proclaimed Asian smokehouse knows how to churn out quality dishes at a fast pace. Plenty of room for seating and also both in and outdoor options! The concept of ordering from the bar makes things pretty streamlined as well. I really love the corn fritters and the rice bowls. I notice the menu is getting new items added often too. Some of the meat serving sizes are a bit conservative, but overall, a must try place that is great to try for anybody looking for a culinary blend.",
   "Had never been, was BLOWN away. I’m vegetarian and upon first glance thought I was screwed, but was shown several options from the menu which I ordered— the corn fritters, peppers and Tofu bowl. Each one is a standout choice! But that Tofu bowl, I mean what in the world is going on there??!! Sweet, sour, savory, crunchy, soft, tart, bright... it was a sensory explosion in my mouth! Very fast service, great iced teas, ample seating and fun atmosphere. I’ll definitely be back.",
   "The Asian BBQ fusion created by Aaron Franklin and Tyson Cole was even better than I could have imagined. The explosive flavor, unique food and drink offerings, and refreshing atmosphere all contributed to the amazing experience. I was able to try the pork belly and brisket sandwich and both I would highly recommend. If you are looking for a one of a kind food experience in Austin, look no further than Loro!"
  ]
 },
 {
  "name": "Siena Restaurant",
  "address": "6203 N Capital of Texas Hwy, Austin, TX 78731, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48c84a4a-932e-11ea-8696-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3341999042700581687",
  "source": "GoogleMaps",
  "reviews": [
   "Handy hint: Please have reservations.  Pretty inside.  Good food. Yummy drink pairings.  Dessert is is hard if you have a nut allergy.  Beet salad was great...and the presentation of the beet salad was picturesque.  Handicap parking is in the back which I find sad. Included are pictures of the meal and menu.",
   "My sisters and I took my daughter here for her birthday dinner. Our server was amazing, friendly, patient, polite. I know it's part of her job, but she was helpful in explaining the menu to us, check on us often, and made sure we were happy with everything. Her kind attitude made us feel welcomed and relaxed. We even stayed after they closed, and I was worried that we wouldn't have time for the cake. Our server and the entire staff never once mentioned that we need to leave. I was very surprised and impressed. Not only the food was fantastic, but the atmosphere was wonderful and of course our server was the best. Thank you for making us feel welcome, and memorable birthday for my daughter. This was our first time here. We would definitely come back.",
   "My wife and I liked our experience overall. Most of the food was excellent and service was professional. We both felt that the crostini served with the Baked Brie were too thick and a bit over baked and difficult to enjoy. We look forward to returning and enjoying another quality meal in the near future.",
   "I love this place! It’s a gem! I’m nowhere near it, but I enjoy the drive just for the food. That truffle butter is heaven. 🤤 Always ask for bread!",
   "This is a great little Italian restaurant in Austin. The feel is old Italian, the food and service are excellent.  We had trout dish, our was cooked to perfection and the side of spinach was excellent as well. The Calamari appetizer was superb,  one odd there's dishes where you can't put you're fork down!"
  ]
 },
 {
  "name": "Eureka!",
  "address": "200 E 6th St, Austin, TX 78701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/492315f8-932e-11ea-b70e-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6298259428620781736",
  "source": "GoogleMaps",
  "reviews": [
   "The food was excellent. We ordered the truffle fries for appetizer, husband ordered the bison burger with sweet potato fries, and I got the veggie burger with fried mac & cheese balls. The whiskey sampler was great, although they were out of our top two choices. (It was a Monday, so I'm not terribly surprised.)\n\nService was so-so, only because we weren't checked on for about 10 minutes and needed water. Then asked, did not receive, asked again and it took a while... Servers were very friendly and helpful though, loved to make recommendations, and talked us into the bourbon barrel cake. (Oh. My. Goodness. Try it, you won't be disappointed!)",
   "I usually order a burger here, but had the fish tacos last time for lunch which seemed a good choice to pair with the Mexican style lager. They were great - not as filling as the burgers, but still very satisfying. I've always favored this place as a solid go-to with a great beer and whiskey (or whisky) selection.",
   "We stopped in after walking the entire block because their menu outside said they had craft beer. They didn't disappoint.  While I really only took pictures of the food the beer menu, both standard and rotating was quite great. The live music was good and our service was top notch!",
   "The atmosphere was cool. Other than that, I’m not happy with my experience. \nI went in with a group of 3 people. We had poor service from the staff because they were to busy to give anyone attention. \nThe waitress (black hair) had the time to ask me if I wanted sweet potato fries instead of regular fries with my burger, but when I asked for more - I was ignored. I paid $2.50 more for sweet potato fries and I got half of the amount of fries than everyone else. For perspective, I got about 10 small fries. My plate looked bare. \nI’m upset because I even asked another waitress (short with black hair), that assured me that I would get more. They never came.\nThe food was fine, but the staff ignored me. And when the kitchen neglected to give me enough fries, and the server didn’t care and brought me the food anyway, and when I asked for more I didn’t get them - that’s when I got upset.\nThey obviously care more about making a profit than making a customer satisfied.",
   "Very good serving staff. Good no, excellent, food and bartenders were careful to let me know exactly what I was ordering. Made experience extra nice. Thanks guys. Good, not awesome, beer selection. Food was the thing for me."
  ]
 }
]