[
 {
  "name": "USS KIDD Veterans Museum - Temporarily Closed",
  "address": "305 S River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4975f854-932e-11ea-8e95-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1245703742813388990",
  "source": "GoogleMaps",
  "reviews": [
   "Great displays, clean and polite staff, facilities are great and clean restrooms.  If you can get on one of the tours on board, it's extremely informative.  Our group loved the info and historical significance. Kids seemed to like it too and you get to go to most places on the ship and examine everything.",
   "Great museum with well preserved historical artifacts. I really enjoyed how the curators have chosen to display ships of different types to give visitors an idea of how important naval defenses are to national security. Local heroes are highlighted and honored as well. I highly recommend a visit to the museum to anyone!!! If your kids are younger, all about how they and a group of friends can spend the night on the ship.",
   "A wonderful tribute to those who served. The museum was great, highly interactive and well kept. Parking was easy. I could park 10 feet from the door. The gift shop had some very nice things. The memorials to those who died in Vietnam and in many other conflicts was touching and serene. And the battleship was well kept. The tour was top notch because you could go to probably 85% of the ship. There weren’t many rules or ropes preventing you from really getting a scale of the Kidd. The sick bay, the radio room, the guns, the showers and bathrooms, the crew quarters and the various decks of the ship all were kept in really good shape and made for a great tour. If you haven’t been and you’re driving through Baton Rouge, you should absolutely spend a few hours here",
   "Had a great time.  Haven't been here since I was a kid.  My wife had never been and she really enjoyed it.  Didn't realize it but by the time we were almost done looking at the ship 2.5hrs had passed, and we were moving pretty quick.  \nIt's something you can definitely sink some time in to if you try to see everything.  We didn't spend much time taking photos, but there is lots of things to photograph.",
   "Self directed tour. Fascinating look at what it would have been like to serve on a destroyer in WWII. Must not have been an easy experience for those sailors. Worth a look if you are into military stuff and don't mind climbing around in close quarters"
  ]
 },
 {
  "name": "Mike the Tiger's Habitat",
  "address": "16 N Stadium Dr, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49c97b08-932e-11ea-9995-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2700649573237436756",
  "source": "GoogleMaps",
  "reviews": [
   "This is a wonderful exhibit that shows the actual tiger in his enclosure. It is near the stadium and on campus to that it is easy to get to. There is plenty of parking nearby and it allows lots people to see Mike. It is one of the best places to see a tiger up close. Both times that I stopped by the enclosure, Mike was outside and sitting on the rock making picture taking easy. I think this is a must see for anyone in the area.",
   "We always love seeing Mike the tiger!  He has a wonderful habitat and there are plenty of places around it to help you get a great view of him. My 10 year old took this photo of Mike.🙂",
   "Always fun seeing Mike. Especially since he is a younger version and very spunky. He was extremely playful. He was playing in the water and looking through the glass. He got very up close and personal. We visit here often.",
   "Mike is a good sport. He's the local bengal(?) tiger which is LSU's mascot. He lives in a nice habitat accessible to the public to come admire such a majestic animal. He was up and about and lounged around.  He actually looked at me turning his head 180 degrees when I called him. I was not aware how pointed and chiseled a tiger's head is from it's profile and how round it is when it faces you. Because he is relatively close behind two wire mesh fences you can feel his presence.  If you are in the area drop by, you will enjoy it. The students are scurrying to and from places, however, my daughter asked a young lady to take photos and she was impressively kind and attractive.",
   "Came to see the complete dismantling of Texas A&M and enjoyed every second of seeing Burrow rip through these guys. The Tiger Habitat is amazing, and Tiger Stadium is the place to be on a Fall Saturday night. What an experience. Can't wait to get back."
  ]
 },
 {
  "name": "Louisiana's Old State Capitol",
  "address": "100 North Blvd, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a1533da-932e-11ea-9db9-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "history",
   "learn",
   "history",
   "historic",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11405592240314346467",
  "source": "GoogleMaps",
  "reviews": [
   "The castle architecture is amazing! The spiral staircase is magnificent and the stained glass dome is beautiful.  It's free to tour and well worth the time. The museum contains some fascinating stories about Louisiana and the men and women who played an important part of Louisiana's history.",
   "Last April I was in town from Michigan for a week visiting Baton Rouge and I  had a great time visiting the Louisiana Old State Capital. It was a beautiful sight, and I got to learn a lot of history and info about it. I would recommend if you are visiting Baton Rouge that you come check out the Louisiana Old State Capital.",
   "Beautiful building with an amazing interior stained glass dome! Full of useful historical information. Well worth a visit.",
   "If I could hide in a room and live here at night- I totally would. Is nice and has great air conditioning. The architecture is cool too.",
   "My tour was cut off prematurely due to personal reasons, but what I saw of it was absolutely stunning! It was free, beautiful, and absolutely enjoyable. If you enjoy historic venues, this place is a must-see!I especially like how they will change different venues to make sure that the venue is always fresh."
  ]
 },
 {
  "name": "Capitol Park Museum",
  "address": "660 N 4th St, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ab20908-932e-11ea-bcd2-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "music",
   "learn",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=2339880932962862590",
  "source": "GoogleMaps",
  "reviews": [
   "This museum was no nice! Being from Louisiana it was great to visit this museum on the history of my state. The exhibits are very detailed and give so much history. I learned a lot by visiting this museum.",
   "Two floors museum. First floor - history of Louisiana from French time to the modern and exposition covering whole economic diversity of the state and the second floor is abundant presence of the different cultural phenomenas of Louisiana. Different regions, different aspects: from voodoo culture and jazz funeral to Mardi Gras and different variety of music. \n\nSorry for many words, but the place is amazing, must see.",
   "Always a terrific treat! So much information, you learn something new Everytime you visit. Staff is extremely helpful and knowledgeble too.",
   "A must visit to appreciate what a rich historical Louisiana means to you all, in-state and out-of-state!",
   "I love visiting this museum. There is so much to see and take in. I always learn something new. One of my favorite places."
  ]
 },
 {
  "name": "BREC's Bluebonnet Swamp Nature Center",
  "address": "10503 N Oak Hills Pkwy, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b12ef9c-932e-11ea-889f-14b31f159f22.png",
  "tags": [
   "family",
   "nature",
   "walking",
   "walk",
   "kids",
   "library"
  ],
  "link": "https://maps.google.com/?cid=2824684837745137382",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome and so pretty. You could hear owls all while walking through the stunning swamp. It was very easy to find and isn’t expensive to visit. However, I’m giving it 3 stars because we wanted to buy something in the nature center and they had already “closed down the system” even though they were still open for 25 more minutes. So my family, and the 3 other families in there who ALSO wanted to buy something could not do so all because the two girls working the counter wanted to leave right as the center closed. Super annoying. Definitely go visit here, but make sure it’s an hour before they close if you want to buy something.",
   "I was very disappointed with the service Jessica Guthrie, Manager promised during the walk through of the rental facility prior to my daughter-in-law baby shower. When I arrived on site at the facility, their staff member was very unprofessional and rude after I had brought my concerns regarding the uncleanliness of the facility. The floor of the entrance was dirty, the carpet needed vacuum. The tables and chairs was not setup as promised during the walk through. The kitchen had roach eggs and spiders on the counter tops. There were nasty dishes left in the sink with dirty wash sponge. The refrigerator was not clean or cleared out. The bathrooms was not clean. This is suppose to be a place where kids have day camp. If your child go to this place, I would think twice about taking them there. Then the female staff person had the nerve to check me off to see if I cleaned the area before leaving. My crew had to take 30 minutes to clean before setup. In the contract,  I was only given one hour setup time.\n Therefore, we only had 30 minutes to setup, not fair. What’s the purpose of having a hour setup time, if the rental guest have to come in to clean and setup their space. It doesn’t make since to give the guest one hour  setup time when you have not kept your end of the agreement. Also, you need to get rid of that staff member girl that was overseeing 12/29/19, Sunday. She was unprofessional and does not need to be in that position. She gives your company a poor representation. For this reason, I will never rent this facility again.\n\n By the way, let me give you qualities a representative staff member should have: someone that is warm welcoming and inviting with a smile, willing to make sure the guest is satisfied with their space, and helpful in resulting issues that my arrive in a professional manner.",
   "Worth a visit if you live in the area.  Not the beat scenery.  Go to Tickfaw State Park for good trails in a swamp setting.",
   "Great nearby spot to get away from the city vibe. Bring binoculars and a lunch find a bench along the trail and just wait for the scene to unfold. Kinda wierd to see buildings along the library trail but still a great little spot in the woods.",
   "It's a great little hiking trail through a swamp, with wooden walkways for the wet bits. Surprisingly scenic for being in the middle of the city"
  ]
 },
 {
  "name": "Louisiana Art & Science Museum",
  "address": "100 S River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b5ec6f6-932e-11ea-8907-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "family",
   "free",
   "field",
   "kids",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=14273213866423041216",
  "source": "GoogleMaps",
  "reviews": [
   "This is an entertaining spot to visit. The facility is impeccable as were the employees.  Its right smack in the middle of things so you can reach just about everything that you may want in the downtown area. I guess my favorite was the skull of a triceratops which is easily viewable to provide one with the magnitude in size and power this beast once had.",
   "I grew up with the LASM as THE museum school field trips went to. Their children's discovery area was AMAZING! I'll never forget the pulleys and ropes that you could lift yourself up with...those are gone. I remember the satellite dish-looking echo communication devices being farther apart and even more impressive for it. They're not very far any more. I remember fossil stations that made me feel so smart and accomplished. Those are gone too. The planetarium is still pretty great! They show wonderful videos and documentaries that are very informative! I deeply miss the meaningful and physically visual interactions kids used to get from the full discovery area. Something they get a mere FRACTION of at the new, reduced area.",
   "The family took advantage of the Museum being free the first sunday of each month. So we toured the whole thing and had a blast. My 8 year old couldve enjoyed it all day long. My 4 and 6 year olds really like the space exhibits and seeing the MUMMY in egypt exhibit! They didnt allow pics of the mummy sorry. But this not the only free thing downtown Baton Rouge. In feburary we saw USS Kidd free of charge as well. Next month we might check out old state capital. ( not sure how 4 y.o. will enjoy that one)",
   "Fantastic museum and place to spend an entire day.  Lots of reading on the first floor.  The second floor has a fantastic, big, colorful exhibit on the different cultures and customs of the different regions of Louisiana.  Am anxious to return soon!!!",
   "Went with a 4th grade field trip and it was insightful, organized, and educational...but also fun for the kids AND parents. Great facility and staff."
  ]
 },
 {
  "name": "Louisiana State University Rural Life Museum",
  "address": "4560 Essen Ln, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4bbd8a68-932e-11ea-b4bc-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "walking",
   "organized",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4409674487009545137",
  "source": "GoogleMaps",
  "reviews": [
   "It is a living history museum.  Tells some of the happy and sad history of Louisiana.  Bring your walking shoes, great way to stretch your legs and learn.",
   "Definitely a place you can spend a good bit of time with so many historical things to see. Spent three hours here & that was just skimming over most things.\n\nThings have been greatly organized and labeled since my last visit in the late '70s. So much has been donated that everyone is bound to find an interest - old farming equipment,  kitchen tools, blacksmithing, old country store, medical instruments,  mourning hair jewelry,  etc.",
   "We happened upon this amazing museum on a recent trip to Baton Rouge. If you are in this area this is a must see place. Many old style buildings and they seem to be true to the time period depicted by the buildings and grounds. I placed four photos on this site. One of the exterior of the Black Smith Shop, and the Hardware store, as well as an interior shot of the Hardware store, and another of a typical home of the era.",
   "Wonderful place to visit! The kids and I both love it. It's fun and very educational. I love their special events, all of which have informational available on the website. Definitely worth the trip!",
   "I was impressed with this indoor and outdoor museum.  It really feels like your walking back in time through a southern community in the 19th century with real buildings that were preserved from that time.  Fyi: the grounds can get wet and mushy.  Worth the trip."
  ]
 },
 {
  "name": "Veteran's Memorial Park",
  "address": "599 State Capitol Dr #523, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c0a9f18-932e-11ea-892d-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=2307544584456767467",
  "source": "GoogleMaps",
  "reviews": [
   "What an incredibly beautiful park! While I was there wedding photos were being taken as well as some other photo shoot with models. The trees are old, lush, and large and the flowers are vibrant. I would love to see it in the Summer! Absolutely stunning! A must see! My pictures don't do it justice at all! ⭐⭐⭐⭐⭐",
   "Very nice park to take a walk in. A lot of history and really wonderful to read about the different monuments and buildings. I feel like this is a hidden gem within the city and definitely recommend anyone visiting the city to stop by and enjoy the park.",
   "Nice Park next to the State Capitol. Great place for glamour shots with a cannon. \nAlso, a small bit of trivia:\nThe 1982 movie \"The Toy\" starring Richard Pryor and Jackie Gleason was filmed in the park. Watch the movie then visit the park to see the sights in the film..",
   "Nice place to take a walk, inside the park and around the lake.",
   "This is a very lovely and well kept park, they had a nice display out for Memorial Day. It would be a great place for a stroll with a date or to enjoy a nice picnic lunch. There was plenty of free parking nearby on a Friday at late morning, and of course the towering Capitol Building dominates the sky and makes for a nice visit to overlook the park from the observation deck."
  ]
 },
 {
  "name": "Old Governor's Mansion",
  "address": "502 North Blvd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c599474-932e-11ea-abff-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11847089895477498377",
  "source": "GoogleMaps",
  "reviews": [
   "The tour was very interesting! The tour guides were friendly and helpful! They even gave us suggestions for places to visit after we left there.",
   "Great venue for a wedding, I mention this due to the separation of the rooms i.e. a cake cutting room, dressing rooms etc. for a wedding. Please bear in mind the space is formally a home/Mansion built many years ago to accommodate LA's governors and their families, so the rooms are separated. The ground floor is not very open. The outside grounds balconies and intricate details in and around the property are beautiful! Gorgeous venue!",
   "We were unable to take the 1 hour tour, but the guide let us look in the first floor rooms. The ballroom has large mirrors at each end with 3 chandeliers in the room. In the middle of the room, looking at either mirror, the chandeliers seem to go on for ever! The guide was a true Southern gentleman, a year younger than the mansion.",
   "The Old Governor's Mansion is a great place to visit for a tour and see very good art and historical exhibits.",
   "This was closed when we arrived but it was cool to see."
  ]
 },
 {
  "name": "Blue Bayou Water Park",
  "address": "18142 Perkins Rd E, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c9af75c-932e-11ea-8b1d-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "drink",
   "kids",
   "food",
   "kids",
   "kids",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15328128400231169280",
  "source": "GoogleMaps",
  "reviews": [
   "The park is great for adults and kids but nothing is perfect. Let me give the run down....make sure you have $5 cash for parking. Bring a coke can to get $5 off entry fee. It helps. The ground is rough as hell and blazing hot so make sure you have some type of swim shoes or flip flops or socks. Do not bring food or drinks in the park as they will check your bags and make you either throw it away or you can go bring it to your vehicle. They do allow bottles of water but nothing else. Instead of paying their food prices which really weren't too bad at one place...put an ice chest in your trunk and fill it with drinks and sandwiches. The workers were attentive and the water slides are awesome. They have quite a few places for parents to take their little children too which was very nice. There+ is multiple lifeguards at every slide and swimming spot so if your teenager wants to wonder around with their friends...they will be fine. Overall a great trip with the family. If I can think of anything else I'll edit my post. Bring sunscreen!",
   "This waterpark was so much fun. They have awesome water slides, my favorite being the rocket. They also have a lazy River and wave pool which were very fun and relaxing. Best part is you can also access their theme park that is connected to the water park. My daughter and I just loved it. I would recommend getting season passes.",
   "Not much of a crowd today. We were able to find open tables and ride everything without long, long lines. Cement was fiercely hot, so bring water shoes!\nFood and drink prices not too bad. It's definitely a dated park. We had seven kids with us, and they had fun.",
   "Kids loved it, but not very pleasant for parents of middle-older kids who want to run around by themselves. I tried enjoying sone shade beneath a cypress tree on  some lovely grass and was told by a lifeguard with a rather nasty attitude that the grass is off limits.  Concrete and plastic furniture only for waiting parents.  Parents have to pay full price whether they slide or not.  For the high cost of admission, it would have been nice to have something to do--a lap pool for example,  or some grass to sit and relax on without getting attitude from young men with power complexes. I should qualify that most of the lifeguards were nice,  and the Pirate's Cove play area is great for whole-family fun.",
   "This place is really fun. Our kids are 12, 10, and 9, and they were able to enjoy all but one of the slides. (One slide has a 95 lb requirement, which our 9 year old didn't meet.)\nLots and lots of shaded tables to enjoy for free. If you want to tan (or roast in the summer), there are plenty of lounging chairs as well. The food options are plentiful and not horribly priced. \nWe left the park for lunch and had no trouble getting back into the parking lot ($5) or through the reentry line. There are lots of nice options for food nearby. We went to Zoe's Kitchen, but there was also a Church's Chicken, a burger joint, a marketplace with a deli, a sushi place, and a few other things. \nThere's also a Starbucks conveniently nearby for a java jolt on the way home.\nYou're allowed to bring water bottles into the park, so definitely take advantage of that. There are lots of trees to take shade under, but if you're prone to burning, definitely pack tons of sunscreen (Not the aerosol stuff-it doesn't last in the water. We know cuz we burned.).\nTip: There's a special right now wherein you bring an empty can of a Coca-Cola soda, and you get a $5 discount from your ticket. Take advantage of that!!!"
  ]
 },
 {
  "name": "Magnolia Mound Plantation",
  "address": "2161 Nicholson Dr, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4cdeb84a-932e-11ea-82f1-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "tour",
   "free",
   "field",
   "free",
   "art",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10958294229380923729",
  "source": "GoogleMaps",
  "reviews": [
   "Take a trip 200 years back in time!  Nice grounds, interesting docents and questions welcomed.   Huge ancient oak trees and outbuildings complete the story of the people who started life on the River,  made themselves rich and their history is still here for us to touch.  Free first Sundays with visiting artists from time to time. A terrific afternoon trip.",
   "The volunteers here go out of their way to make this an exceptional and fun learning place. I love their First Free Sunday tour. Thank you!",
   "I went to Magnolia Mound Plantation with my daughter on a field trip and we had a great time. The outdoor kitchen was my favorite part. It was very informative. I unfortunately could not go into some area because it was too crowded but the places I did get to go were really neat.",
   "We went on First Free Sundays in Baton Rouge. That's when the art and science museums are open free admission. Also the USS KID is awesome to climb around on. It was a destroyer.  Goggle 1st free Sundays in Baton Rouge...it will all pop up.",
   "The grounds are gorgeous and the trees are so cool! The tour was interesting and informative.  My family enjoyed it even though it poured rain!"
  ]
 },
 {
  "name": "Riverfront Plaza",
  "address": "300 S River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d3c6a50-932e-11ea-bc5c-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "family",
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14766547634163017574",
  "source": "GoogleMaps",
  "reviews": [
   "We had a really hard time to find public parking. Finally, we got into the public parking and pay $10 dollar for half day. There is a track on the side of river which is good for quick walk and roam around riverfront. There is historical war museum as well. We could not make it because it was closed for a day. It is good place to snaps  picture  and spend few hours with friends and family. The cool breezes from the river also add adventure of your time. \nYou will definitely enjoy your time here.",
   "The plaza has been revamped a lot since I was a child. We watched the sunset around 6:30 and then later that evening walked along the river. We were surprised at how beautiful the sunset was over the Mississippi. The walkway is well lit even at the darkest part of the night. It was pretty clean on the day we went.",
   "It's a nice spot for a picture and view of the river. If you walk the levee during the afternoon or evening it's even better. Just make sure you don't go too late, a lot of shady people around at night.",
   "I love running at the levee on a daily basis prior to hitting the anytime fitness right off of government street ... they have a lot of events down town and this is a great place to take a stroll with family or even alone . It is pet friendly with water fountains equip for our furry friends ...",
   "Excellent view of the Mississippi River. Went there after dinner for a walk with family and loved it. There are bikes available if you want to ride. Surprisingly it was not at all crowded and you could sit peacefully there and appreciate the view. There is a train track parallel to the river. If you are traveling to Baton Rouge, this place is a must visit."
  ]
 },
 {
  "name": "Hilltop Arboretum",
  "address": "11855 Highland Rd, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4db1ea94-932e-11ea-9f8f-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6277665360031110389",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful and lovely place to stroll as well as to purchase some greenery!\n\nIt's not a long stroll, but perfect to take kids on a walk to teach them the names of many varieties of trees, shrubs, and ferns. It's short enough that most children would be interested most of the way through.\n\nIt's a beautiful venue for a wedding, too. The space is serene, the pavilion next to the pond is open, and there really would be so much natural beauty! I wish I had scheduled my wedding here, but my guest list was too long to be sure we'd all fit. We wouldn't once it was all days and done. Maybe for another party!",
   "Interesting & peaceful place. Free admission. Very clean. Loads of information about native trees & plants. Majestic & massive trees. Loved our quick stroll through. Gift shop on premises.",
   "Beautiful facility! Loved the peaceful books where you can quietly sit. Public restrooms would be nice however.",
   "Wonderful park, cool in the shade of the hundreds of trees even in full summer. The kids really love rolling down the hill and being able to run freely. Excellent educational and fun experience with several habitats represented and all plants and trees identified. Brought to us by LSU.",
   "It's winter bit still beautiful...can't wait for the spring."
  ]
 },
 {
  "name": "Forest Community Park",
  "address": "13900 S Harrells Ferry Rd, Baton Rouge, LA 70816, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e203edc-932e-11ea-87cf-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "free",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6432583997821840942",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a cool little park with a splash pad. I say little, but it's quiet large. A lot of places to sit & keep cool.  Good locations for parties & other activities. Tennis spots. Nice restrooms. Really up-to-date park! We will definitely be returning!",
   "Lots of space, a stocked pond and a well maintained dog park. Would love more walking trails through the woods.",
   "Ammending my review from 5 stars to 3 as there is now a cut-through on one side of the park funneling a lot of traffic through it now.  There are always a lot of cars, travelling much too fast, not heeding pedestrians, kicking up dust from the new unfinished road and making the air smell like exhaust.  The kid side of the park is still fine, but avoid the dog park side if you're a walker; it's dangerous and unpleasant now.",
   "My baby and cousin really love going to this park. A great way for your kids to cool down for the summer for free. You can also have a picnic out there. Because, the park is beautiful. They also got a walking trail too.",
   "Its pretty good walk around the lake, I think it's better walk in mornings time. You can found ducks near the lake so it's nice. If you have children this park has enough space and it is beautiful too. So I can say this is one of my favorites park"
  ]
 },
 {
  "name": "Perkins Road Community Park",
  "address": "7122 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e934dee-932e-11ea-9516-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk",
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7274798514394820957",
  "source": "GoogleMaps",
  "reviews": [
   "Great park with tons of activities and great walking paths. They have everything you need for skating or extreme biking. They also have a rockwall and a stocked fishing pond. Further down they have a great river walk and a nice outdoor work out area.",
   "We were so excited about the nice weather yesterday so we headed to the park. We love this park. There's so much to do without feeling like you're on top of each other. You can strength train, walk a trail, run, swing, watch a sport, enjoy the view, explore, skateboard, ride a bike, etc. at this park. It's clean and I feel safe when we go to the Perkins Road Park.",
   "Great place to bring the kids.  The park has a skate area with plenty of space, a play ground, a bike track, lots of grass and tables if you want to picnic or sit and read.",
   "Great family park",
   "Plenty of space. Kids loved it and had other friendly kids to play with. Just hot. Bring water lol"
  ]
 },
 {
  "name": "Odell S. Williams African-American Museum",
  "address": "538 South Blvd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ef51ed2-932e-11ea-ad7d-14b31f159f22.png",
  "tags": [
   "art",
   "history",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16450865390037183525",
  "source": "GoogleMaps",
  "reviews": [
   "🦚 Vibrant. 🎨 Hopeful. 🌈 Hidden gem. 🕊️ \nThis history museum and folk art installation is located beneath a highway overpass and next to a Baptist Church. \n\nIt was closed when I visited however walking the grounds was a pleasure. I was encouraged to see it as a vibrant and joyful celebration of history and testament of determination. \n\nI look forward to visiting again when it is open and I do hope more folks will stop in and check it out and support this wonderful art and community project in Baton Rouge. Recommended. ⭐⭐⭐⭐⭐\n\nSee you on the road,\n📸 🙋‍♂️@gabrielcraft.me",
   "rest in heavenly power, Ms. Sadie Roberts-Joseph. all of us will mourn your departure and honor your life forever more!",
   "It’s a lovely, quaint place. Very colorful and full of life. The lovely woman who runs the place is very passionate about it. It’s so sad to see that some areas have been Vandalized. It is a beautiful piece of history and run by a woman who deeply loves and cares about her community.",
   "Is there a new contact phone number?",
   "Love this museum even though I never went"
  ]
 },
 {
  "name": "BREC's Baton Rouge Zoo",
  "address": "3601 Thomas Rd, Baton Rouge, LA 70807, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f436358-932e-11ea-8e69-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "free",
   "food",
   "delicious",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17245502165592535061",
  "source": "GoogleMaps",
  "reviews": [
   "This place is very fun for children and if you like something that will take a few hours. This isn’t a very large zoo so don’t expect all day to walk through. But it is a little fun extra thing to do. The lights at the zoo for Christmas are fun for the little ones and takes about 45 minutes to an hour to walk through the hole thing. Only a mile. The animals during the day are awesome to see and a great variety of small and large animals. The food is your typical hot dog and nachos food. The price to get in is reasonable and I believe it’s free if they are two years and under. I took my now wife on a date here years ago and we had a lot of fun. It’s something different and outdoors for a date. We now took our son here for the Christmas lights and it was fun. He got to see Santa and hang out with family. All around the Zoo here is not New Orleans large but big enough for a couple hours visit.",
   "We really enjoyed our Sunday afternoon here. Its a smaller zoo, but very nice. Everything was clean, staff was great, animals looked well taken care of, and the cheeseburger at the flamingo cafe was delicious. We really enjoyed the Otter Chat. Worth the money. Also noticed they have space for weddings, birthdays etc.",
   "Met expectations. A little out of the way but an easy drive. Free parking. Liked the wide walkways. Great play area and petting zoo. Standard animal displays with lots of birds, no lions or elephants.\nTrain was out of service but looked like a decent attraction. Will go again. Four stars for meeting expectations and value, does need some investment.",
   "Always love to go here, my 2 yr old always ask me to bring her to the zoo. Relaxing place and great walking exercise as well. We love to watch the peacocks walking near the cafe as we rest.",
   "A great fun and relaxing place for all ages in which you get to see many different types of Animals and species. I loved seeing the animals and it allowed me to relax and be calm. The zoo is a must see in Baton Rouge and my favorite part was seeing the tiger at the zoo and taking a picture of it."
  ]
 },
 {
  "name": "North Sherwood Forest Community Park",
  "address": "3140 N Sherwood Forest Dr, Baton Rouge, LA 70814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f9d0b6e-932e-11ea-bece-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "free",
   "walking",
   "kids",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7706965616375356448",
  "source": "GoogleMaps",
  "reviews": [
   "My family have been residents of the area for more than 25 years. I have seen this area go from United States Air Force Depot 2 a FEMA trash collection site to the facility that it is now. The Reformation of it over the last few years has been beautiful. Today my youngest grandson and I enjoyed 4 hours at the facility. We only played on the playground equipment, the bike path, and did a little fishing. We did not utilize any of the Interior facilities, but we had a great time. I think it's great that b r e c has provided an area like this for this community. Thank you. Please don't dump all the trash next door anymore. I'm sure we can find another site to do that. Thank you again!",
   "First and foremost, for those of you who are parents there is a decent inside area for children to play as well as a nice outside. This is a very calm park. I love that there is not a lot of calamity going on around me as I walk or jog around. The one thing I love about this park is that the sidewalk goes completely around surrounded by a lake that you can fish in if you'd like. However, the only issue I have with this park is that there are days that there are so many ducks. The issue is not with the ducks themselves, but the tiny splotches of dung that they leave behind along the parkway. Luckily, the establishment itself is pretty good at clearing that off along with the rain of course. There is an inside track that I also utilize and love. The only issue with the inside track is that it is definitely not designed for a lot of people. It is free to use, but there are only three lanes for walking one of which is a single lane that is used for running. Like I said before the perks of this is that there aren't that many people. It's neat in there and relatively clean (for the most part.) For the price of free--I would say you can't beat it. By-the-by, there is a inside gym but in order to use it you must have a $15 membership monthly.",
   "Great hidden gem in Baton Rouge for birthday parties. Only thing is, I think with rental of a birthday room, the indoor playground should be open as well. As is the indoor playground is only open and open to public certain hours during the week and only open on Saturday on the weekend. We had a party on Sunday last year and it was great but the indoor playground being locked was a big tease to the kids. Hope they change this rule in the future... even if it cost a little more when you rent a room, I believe it would be worth it.",
   "Beautiful park with a duck pond, play areas for little ones and older kids. Well maintained like all other brec facilities. Walking loop is a bonus for adults taking the kids to the park. Indoor facilities were looking good as well.",
   "Love love love this Recreation center and the park is amazing,no one should have any complaints,its in a great location and has something for the young and the young at heart, great use of our tax dollars!"
  ]
 },
 {
  "name": "LSU Museum of Art",
  "address": "100 Lafayette St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5014d4ae-932e-11ea-b714-14b31f159f22.png",
  "tags": [
   "field",
   "art",
   "history",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4714814116049237245",
  "source": "GoogleMaps",
  "reviews": [
   "Looks really great! The photos by Children are thought provoking.  Nice downtown location. A group of children on a field trip were fascinated by the quirky schedule of the water sprouts.",
   "Some very interesting exhibits in a beautiful location with awesome point of view on the Mississippi River. A boutique on the first floor with artifacts reproduction and a restaurant on the 6th floor rooftop. Really worth the visit!\nAlso, next door you can visit the Old Louisiana State Capitol with its spiral staircase and its stained glass dome (see photos), worth a look! Didn't have time for a full visit :-(",
   "We just happened to come on a day they had an event and really enjoyed the conversation and wine. It was very enjoyable!",
   "Lovely museum in miniature. Think of it as a 1/2 & 1/2 museum.   The portrait gallery and Asian art are truly masterful whilst the other 1/2 feels out of place, i.e.,  spiritistic \"art.\"  There  are only 2 pieces of local furniture with rich history which left us looking for more.  Beautiful views of the mighty Mississippi from the expansive windows up there!",
   "Excellent art museum in the heart of downtown Baton Rouge.  Has displays of cultural signifigant art by Louisiana artists as well a prices from around the world. The bottom floor has the student gallery, show casing the student's work, which was my favorite part. Free to students and faculty of the LSU system too."
  ]
 },
 {
  "name": "LSU Museum of Natural Science",
  "address": "Murphy J. Foster Hall, 119 Dalrymple Dr, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/507593f0-932e-11ea-b641-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=501794833956863931",
  "source": "GoogleMaps",
  "reviews": [
   "A very small but diverse museum located on the LSU campus. It focused mostly on animals but there was a small section devoted to rocks and fossils. The animal collection was extensive from giant polar bears to a large bird collection. My favorite was the insect collection at the entrance.",
   "You can see several extinct species in this nice bird collection.",
   "Pretty cool for a small museum to check out when you gotta kill time and it's free!",
   "Visited it whilst in the state for a wedding. The variety of exhibits is interesting and educational, but I feel that having 80% of the huge, boasted collection be a single insect display is cheating slightly. The staff were friendly and helpful but were hesitant to share the visitors WiFi access, which made hiring an Uber home slightly difficult.",
   "Fantastic displays of birds, reptiles and insects. \nA lot to see in such an intimate space.  \nMike the Tiger is also on display"
  ]
 },
 {
  "name": "Liberty Lagoon",
  "address": "111 Lobdell Ave, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50d4a598-932e-11ea-8085-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "free",
   "kids",
   "cheap",
   "kids",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9015684409499341665",
  "source": "GoogleMaps",
  "reviews": [
   "Normally, this is a great place to visit because it has enough slides to keep older kids occupied for the most part, good area for small children, and the park is small enough to see everything if you make a 360° turn. The bad part about this park is they've started limiting how many people enter at one time. This means you'll regularly see a line as long as a football field waiting to enter the park. Today we waited over an hour to get into the park only to be ejected from the water because of lightning. The lightning part I understand, the hour long wait, I can't. It doesn't take near that long to get into Blue Bayou and there are tons of people there. We've been going to Liberty Lagoon since the year it opened, and we've never had to wait like this before. From speaking to others in line, apparently, the long wait has become the norm. Small children were crying, understandably, up and down the line. One woman fainted in the heat and had to be taken to the hospital by ambulance. We were able to get a free pass to return to the park, however, the day was ruined. LL really needs to do something to get the lines under control.",
   "Kids had a blast....great environment!! Pools probably could use more chlorine....lol other than that, GREAT PLACE!!!",
   "It was amazing all of the kids loved it. There prices are wonderful. Plus there good food. I will definitely go again. One more thing if you are looking for a cheap but fun place go there it will be way better than blue bayou",
   "Nice friendly family place.  Very inexpensive",
   "The lifeguards are always very attentive and the toddler area has more than enough to keep them entertained! My 3 year old had a blast today!"
  ]
 },
 {
  "name": "Botanic Gardens",
  "address": "7950 Independence Blvd, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/511a3c18-932e-11ea-a4a9-14b31f159f22.png",
  "tags": [
   "library"
  ],
  "link": "https://maps.google.com/?cid=5732044684634588406",
  "source": "GoogleMaps",
  "reviews": [
   "A little out of town, but worth the drive.  Very relaxing place with the gardens. Many different types of plants & trees. Paved or semi-paved walkways.",
   "Great place to relax and enjoy.  My wife enjoyed it too.",
   "Pretty little gardens connected to the library.",
   "Good for the mind and the body. Very beautiful.",
   "Lovely facility and landscape. What a joy to have in Baton Rouge"
  ]
 },
 {
  "name": "West Baton Rouge Museum",
  "address": "845 N Jefferson Ave, Port Allen, LA 70767, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5176b5a6-932e-11ea-895e-14b31f159f22.png",
  "tags": [
   "family",
   "sampling",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13687481912950907761",
  "source": "GoogleMaps",
  "reviews": [
   "The perfect place for taking photos of any kind. We were there for prom but it would make a lovely place for family photos as well.",
   "Great festival here. The museum has some parts to it that are very interesting. Blues section in the back and a sugar mill scaled to size in the front.",
   "I love this place, and the stuff very great about the \nGuided Tour.its very awesome!!!\nIf you don’t want there before, you must be go at least once!!!",
   "Can't find a better quality museum with top-notch community activities. Love their French language initiative and their professional and upbeat staff and volunteers",
   "Went with my daughter's 1st grade class here. I had been here years ago, hadn't been back in some time. They've added a lot new exhibits, etc. It's very clean, lots of great information about the town of Port Allen. The staff was great in engaging the children and keeping their attention. Sampling the sugar was exciting and taught the kids about the different types of sugars grown here. I'll definitely go back. "
  ]
 },
 {
  "name": "Pentagon Barracks Museum",
  "address": "702 River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/51e4f7ba-932e-11ea-815e-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history",
   "historic",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7255371446082164727",
  "source": "GoogleMaps",
  "reviews": [
   "Very interesting part of our history.",
   "Lots of history here.  Its right across from the State Capitol.  Previous location of LSU!",
   "A hidden gem near the Lousiana State Capitol.  Lots of history.",
   "Great, historic place to visit.",
   "A historic location near the State Capital of Louisiana where Louisiana State University first held classes."
  ]
 },
 {
  "name": "North Boulevard Town Square",
  "address": "222 North Blvd, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/523dae4a-932e-11ea-bbb9-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=7343794456259975289",
  "source": "GoogleMaps",
  "reviews": [
   "Baton Rouge is doing a great job by constructing the boulevard. A great place to walk with family. At one side you will find tje old capitol, simply beautiful.",
   "This was the second year I went to the Festival of Lights downtown and overall it is an enjoyable experience for the whole family.  There is a snow hill for \"sledding,\" a band stage, vendor's village, and the Coca-Cola truck is there.  \n\nAt six o'clock the mayor is supposed to light the square's Christmas tree, but they seem to run late every year by about twenty minutes. \n\nImmediately following the tree lighting, there is an excellent fireworks show that lasts for a lot longer than expected. \n\nThe festivities start at four pm and end at nine pm.  There is a fun run earlier in the day.",
   "Beautiful place.  Small, clean and just feels good.   Music is piped in and there are tables and chairs under the ancient oaks.  Lovely place to have lunch; even prettier in the quiet of the afternoon/evening.",
   "Great public space. Lots of festivals here.",
   "This was a very relaxing experience as this certain church happen to be putting on an event at my partner's and I's time of arrival!"
  ]
 },
 {
  "name": "Highland Road Park Observatory",
  "address": "13800 Highland Rd, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52942292-932e-11ea-8afc-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "field",
   "knowledgeable",
   "free",
   "knowledgeable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17448068204379856014",
  "source": "GoogleMaps",
  "reviews": [
   "Went there on a field trip. There is one Scientist, who is great with kids and explains astronomy in a fun way. The rest of them have very little patience with children.",
   "This wonderful facility is located directly off of Highland Road. It is complemented with a staff a very knowledgeable people who are enthusiastic in the field. They tend to host a wide array of events open to the public. Perfect spot for all ages.",
   "Really Great Place for families and even small children. I went with my daughter, her fiancee and her 6 yr old twins to see the Super Blood Wolf Moon lunar eclipse last night. They had activists for the children as well as large telescopes set up for viewing.  They are very informative about any questions you have. To my surprise there were people out with chairs and even blankets and sleeping bags on the ground to watch this event. I would definitely recommend this place. There was ample free  parking and fresh hot free coffee.  I did purchase a map of the moon for $7.95 and also a Baton Rouge star guide for $17.95 for the children.  I'm so glad we got to go to this event!!!",
   "Knowledgeable attendants. Plenty of telescopes to look through.  Nice family atmosphere.",
   "Fun place. B.                                         B....,...........bla"
  ]
 },
 {
  "name": "Repentance Park",
  "address": "275 S River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52ea81b6-932e-11ea-97e0-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "family",
   "art",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13429583832640385107",
  "source": "GoogleMaps",
  "reviews": [
   "Cool spot. The USS Kidd is located here and a neat back drop for the park. There is a nice path to walk along the water, neat art and a great fountain. There is small grass areas to play catch and lounge.  It's pretty unique how they have a staircase that goes right down into the water all along the waterfront. My family really enjoyed area.",
   "This is had slowly become my favorite part of downtown baton rouge! Its nice for going on walks. It always nice to go see the Mississippi river and just sit there and people watch, read a book or listen to music. Some people fish, work out, have picnics and enjoy family friendly time.",
   "I was doing work across the street from this building, but I decided to go into the old State Capitol when I was done and it was just as beautiful as ever",
   "Cool spot to watch the river and the sunset.",
   "Live after 5 is the best experience"
  ]
 },
 {
  "name": "Raising Cane's Dog Park",
  "address": "1442 City Park Ave, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/532e1b68-932e-11ea-b245-14b31f159f22.png",
  "tags": [
   "field",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16636160795042635260",
  "source": "GoogleMaps",
  "reviews": [
   "They are expanding the park right now.  I like this dog park.  It's a nice size and the people I've met there are very friendly.  They have 2 sets of double gates foot entree as well as a water fountain for you and your fur baby. I can't wait to see what they are adding with the renovations.",
   "Nice field for running dogs and water for cooling them off. It would be nicer if BREC set up some agility courses or other fun equipment for the dogs.",
   "Nice dog park, but small. Dogs are almost always friendly. They've got a small dog pool that always seems to have a hole in it. Dogs are almost always friendly. No lights, and they close at dark, which is very limiting in the winter. Small parking lot nearby. Lots of trash cans & waste bags.",
   "I have a very energetic puppy and it is hard to find a place with other puppies who actually want to play! This place has them! I was so excited to see him letting out some energy with his fellow furry (new) friends. Will return!",
   "Enjoyed this hideaway park. Spacious, clean with lots for kids to do to burn up energy 👍🏼"
  ]
 },
 {
  "name": "City-Brooks Community Park",
  "address": "1515 Dalrymple Dr, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/537bf692-932e-11ea-a86a-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "kids",
   "free",
   "kids",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=11595101934554915324",
  "source": "GoogleMaps",
  "reviews": [
   "This park is very well kept. I've never seen any trash,  the play equipment is well maintained, and the wood chips are raked every time I come with the kids. They're are plenty of benches,  a bathroom,  and water fountains.  Attached I'd a dog park that i live bringing my dog to. There is also plenty of grassy places to lay out on a beautiful day. The LSU lakes are close by if you want to take a walk,  ride a bike,  or feed the ducks.",
   "Great free fun for the kiddos !!! Feed the ducks and then walk around to the park and let the kids run out all the energy they can. Lots of fun on a sunny cool day!!!",
   "I enjoy looking out at the water, and watching the ducks play and fight.",
   "Love it... Great place for kids of all ages. Can't wait to go in the Spring and Summer. Educational AND fun!!!",
   "I like this park, I hope more people come to this park, because more people means more fun for kids, and Sometimes we just need a break and sit down to breathe air and relax with nature, so this is the perfect place more nature and life, and less PHONES 👍😉"
  ]
 },
 {
  "name": "Hollywood Casino Baton Rouge",
  "address": "1717 River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53c6e3a8-932e-11ea-b248-14b31f159f22.png",
  "tags": [
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18402849101138518483",
  "source": "GoogleMaps",
  "reviews": [
   "Fun and entertaining place to let it roll. Too bad the fellow at $5 table acted as if it was a $100 table. If betting your rent money I'd suggest going other places, but if want to have good time then let it rip. The dealers were fun and professional. Enjoy your time at Hollywood!",
   "Great buffet. Lots to choose from. My favorite was the meatloaf with mashed potatoes and the stuffed bell peppers with shrimp.  We really enjoyed eating here. The view was great. Right on the river. You can see the baton rouge bridge. The customer service was amazing in comparison to laberge casino. The atmosphere was Quant and everything was very clean.",
   "We went to the buffet on Christmas Day when we didn't feel like cooking, and were pleased to find consistently good food. The hours have been reduced since we visited before, and we generously tipped the waitress who brought our drinks and extra silverware and plates as she was working on Christmas Day so we could eat out. My only negative finding has been the same for years. The desserts are pretty but don't have much flavor.",
   "Feeling great time for myself and friends to bring for sharing good times.",
   "It was okay.   We didn’t win anything but it was nice.  You well we had to buy our drinks.   I always have a good time when I’m out with Jeffery so... check it out"
  ]
 },
 {
  "name": "Independence Community Park",
  "address": "7500 Independence Blvd, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54126ce8-932e-11ea-8edb-14b31f159f22.png",
  "tags": [
   "field",
   "library",
   "library",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=8210561485775873847",
  "source": "GoogleMaps",
  "reviews": [
   "Clean, beautiful, and well-maintained park. Must go for a peaceful time.",
   "The grass surrounding the soccer fields is poorly maintained, and the bathrooms near them are in disrepair. There is a downed tree touching the edge of the field closest to the library as well. However, there is adequate parking and a well shaded bench to sit at near the library. Overall, I prefer Burbank, but it's okay.",
   "This park has come a long way in its many years. Now sporting a nice soccer complex, probably the nicest library in Baton Rouge, a beautiful botanical garden, a park for children, a summer water park for all ages and a state police station that makes everything feel very safe. Definitely worth a visit and a place to relax and kick back on a day off if toy want to get out the house.",
   "If you are the type to actually read reviews on community parks, this is the one you’re looking for. Plenty of room to run, playground equipment, restrooms, covered picnic tables, and soccer fields. Plus, it’s an uncrowned area so you won’t lose the kids in a mass of children. Great park!",
   "Probably one of the better kept BREC facilities. The pond is stocked and well kept around the perimeter. All the rest of the facilities are clean and well kept. Everything here is basically the best of the best you can possibly expect from our local Baton Rouge facilities."
  ]
 },
 {
  "name": "Waddill Wildlife Refuge",
  "address": "4142 N Flannery Rd, Baton Rouge, LA 70814, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5459fe8a-932e-11ea-ab9c-14b31f159f22.png",
  "tags": [
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11632060176994526438",
  "source": "GoogleMaps",
  "reviews": [
   "This is an awesome secret in the BREC Park system. Love the fishing lakes that are stocked with plenty of fish. Great place to take kids. I go for the Air Rifle Range to target shoot. The free price is awesome. The place is clean and well managed.",
   "My dad and I had a nice time. The two pond areas are very neat and clean with benches around them. Saw several people catching bass and catfish. I caught one little bass myself about 8 inches long right before we left.\nThere is limited shade between 3-5pm. It would have been nice to know which pond held which type of fish at the sign in post. Bass are in the first one BTW and catfish in the other. They have public restrooms that are supplied and clean. And cane poles that can be borrowed. Overall really nice nice fishing spot we plan to check out again with some different bait!",
   "The facility is great. Very clean. Fishing is very slow",
   "It is some big fish over there",
   "Good trails for hiking and bird watching."
  ]
 },
 {
  "name": "Milford Wampold Memorial Park",
  "address": "901 Stanford Ave, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54a476ae-932e-11ea-bdc5-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12235007159445843969",
  "source": "GoogleMaps",
  "reviews": [
   "Went today with my dog. Did the whole 4 plus mile walk around the big lake.  Enjoyed it very much.  Beautiful ducks, docks, benches.  Bikes for rent as well.  Walk through the Greek area of college town.",
   "The park is always clean with lovely views. There are benches, a dock, and launch for kayaks and paddle boards. There's often fun events here such as the sunset paddle. It can be a little bit busy at times since it's a very popular park, but it's really quite lovely.",
   "The park borders LSU lakes and provides easy access to running / walking paths. There are fitness stations and filtered water foundations located on site in addition to picnic tables and a restroom facility. The restroom almost always needs attention - it rarely has soap & toilet paper and the toilet is often filthy. Parking is limited which results in the lot being fully occupied during peak fitness times and seasons. I suggest arriving early and carpooling if you're visiting with a group.",
   "Very beautiful and serene park. Love it!",
   "Very nice for running or walking. Gets breezy and the temperature is usually a bit lower than further away from the lake. Helps to cool down during the hot days. View is really soothing."
  ]
 },
 {
  "name": "Highland Road Community Park",
  "address": "14024 Highland Rd, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54fafc5c-932e-11ea-99f3-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1928200388670069194",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing place! The disc golf course offers something for every skill level. A little light for people who have 450' on demand but still challenging and most importantly fun. Bathrooms and pet friendly are a HUGE bonus. Baton rouge should be proud of this place.",
   "My favorite park in the world! I grew up going here and playing softball here and now to be able to take my own kids, it is just beautiful. My kids love walking around, riding their bikes and scooters and having picnics here. The view alone is breath-taking and peaceful.",
   "Was a beautiful park but the address for this location needs to be different from the center around the corner. I went to a baby shower at the center around the corner and when I gps the address it took me to the park not the building where the party was but the center had the same address. I think that should be done better. Someone was kind enough to show us where the place was but overall I enjoyed the shower.",
   "Peaceful, stillness, love of the beauty of GOD'S wonder!!!!. A time to think of our connection to his creation.",
   "Nice, clean community park.  Concrete sidewalk for walking/jogging.  Nice open areas for lounging and enjoying nature.  Disc golf course for the stoners.  And a nice pavilion and splash pad for kids/birthdays/parties."
  ]
 },
 {
  "name": "Greenwood Community Park",
  "address": "13350 LA-19, Baker, LA 70714, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55557a1e-932e-11ea-980b-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=1238179200190002682",
  "source": "GoogleMaps",
  "reviews": [
   "I play the disc golf course here. It's a fantastic little technical course and not really as populated as most others so its quiet and relaxing. But overall the whole park is maintained and just generally what you expect out of park. I've been coming here for years and it is definitely an underrated park for all that it offers and it is right behind the Baton Rouge Zoo so you can make a day out of just one area. 5 stars, highly recommended.",
   "Really nice and clean park. Great place to take the kids.",
   "Beautiful park!  I love that you can rent canoes and kayaks. Great playground.  ",
   "First visit.  Beautiful day for it.  Loved walking the trail around the lake.",
   "Great safe place for family reunion exercising fishing picnicking or just relaxing in the sun"
  ]
 },
 {
  "name": "Spanish Town Historic District",
  "address": "Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55a76876-932e-11ea-b380-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=6866087917306266657",
  "source": "GoogleMaps",
  "reviews": [
   "Cute houses. I didn't really see many shops though",
   "Best parade in southern Louisiana.",
   "Really nice area. Good examples of Old Louisiana style in buildings and housing",
   "The oldest neighborhood in Baton Rouge. Great place to walk and home to some unique architecture, especially bungalows. Several historic houses if you keep an eye out for the plaques.",
   "Best neighborhood in Baton Rouge, friendly neighbors, and eclectic lifestyles. It's where I live so might be biased."
  ]
 },
 {
  "name": "LSU AgCenter Botanic Gardens",
  "address": "4560 Essen Ln, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/560d5c76-932e-11ea-942a-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "organized",
   "walk",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13539616533897422565",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place, perfect for hiking, spending the afternoon, doing photo shoots and even having a wedding!  I am planning my wedding and was very well attended by the wonderful Katie Guitreau.  Loved this place!",
   "The Annual plant sale was fantastic with a huge variety of not only the super Plants but also a large variety of plants being studied for their ability to survive the local elements.  This event was very well planned out and very well organized.  All the Master Gardner’s were very knowledgeable as well as helpful.  This location has lots to offer and even rents out their facilities for Weddings etc.",
   "Great place to take a walk and enjoy the beautiful flowers and trees! Many others plants as well! They have about 4-5 different trails and have a map to show you the way around the property! Lots of signs that provided great information about the area and the plants. The gardens are beautiful and vast in the front. And it’s free which is great!",
   "This is a great place on a day you have nothing else to do but stroll and get lost hiking around. You’ll pass along tangerine trees where you can stop and have a treat. Really cool.",
   "Beautiful, peaceful grounds; well-maintained gardens; rustic tree based playground equipment and modern pollinator garden playground equipment for kids; nice easy to navigate hiking trails; helpful and well-informed staff."
  ]
 },
 {
  "name": "St. Joseph Cathedral",
  "address": "401 Main Street, Postal: 412 North Street, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/565e8b30-932e-11ea-b47d-14b31f159f22.png",
  "tags": [
   "historic",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14322870639467010958",
  "source": "GoogleMaps",
  "reviews": [
   "This historic cathedral features German-designed stained glass and a magnificent crucifix which must be seen in person to truly appreciate!",
   "I didn’t particularly care having the cross off center.  The cathedra is in the center of the sanctuary.  Who is supposed to be the center of our worship?",
   "Visited Cathedral Square during the Saturday Main Street Market which was all about healthy and delicious and it was Fabulous!!!   4 Stars because Indidnt actually visit the inside of the cathedral.",
   "I'm a parishioner there.  Great sermons",
   "It was a great mass . I am from Borger Texas and I have gone to mass there several times and I have always felt welcome.  Great place to meet for mass"
  ]
 },
 {
  "name": "Burden Museum & Gardens",
  "address": "4560 Essen Ln, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56c4b734-932e-11ea-a195-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11945236116411411492",
  "source": "GoogleMaps",
  "reviews": [
   "I have lived in NOLA for many years, but I had never visited here. I must say, that was a huge mistake. The park is beautiful. There is plenty parking, great scenery, and a huge plot if land to set up for picnics and gatherings. What I found most spectacular was the accessible and relatively clean restrooms. I am quite picky about using the toilet outside and in public places. This restroom was pretty decent and did not smell like a urinal.",
   "I had a wonderful time for my first visit to the garden.  We enjoyed the hayride. Got the opportunity to pick my first orange off a tree. \nThe pet animals was nice and the food was delicious. Hamburger's and corndogs was a hit. So was the corn on the cob.\nI forgot to mention the Corn Maze. That was fun too!!!!!",
   "I took my small group os adults with special needs. We all had a lot of fun. The tour guide was great and kept every excited about the things we were seeing.",
   "So much to see at this museum! Wish we had come with more time. A lot to see indoors and outdoors. Very educational.",
   "It's absolutely beautiful place. It's very well kept it always has great holiday events for families to come enjoy and fun."
  ]
 },
 {
  "name": "Mississippi River Park",
  "address": "299 River Rd, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5710dcba-932e-11ea-8b70-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5642901791016342321",
  "source": "GoogleMaps",
  "reviews": [
   "Water. A safe paved path to walk, bike, jog, or stroll. Steps, benches and cool Red Beach chairs to sit closer to the Mighty Missisip!  Great venue to watch bands and parades. Relaxation at its best downtown. Enjoy your visit(s). Oh, education and photo ops are plentiful. Ciao!",
   "It is so wonderful to see the mirror sculpture, the American Duchess Cruise Ship floating and docked, walking/jogging trails,  bikers, skate boarding, visitors and citizens congregating on the River Front enjoying the  Mississippi River view. Great place to get your exercise on and it is free. The sunset is gorgeous and a must see. BR Proud!",
   "Beautiful place to run/walk/bike, very flat and with a view",
   "Wheelchair accessible \"trailhead\" to the Mississippi River Levee Path and Levee Loop (1.5 miles). Water fountain, power outlets, wheelchair ramp, few chairs, stunning view.   Walking on top of the levee offers great views and provides a perspective when the Mississippi is at flood stage and higher than downtown Baton Rouge. Anglers, joggers, walkers, photo shoots, I even saw two young women practicing pole dancing moves on the plentiful lanterns.",
   "It's a beautiful scenic place to watch the sunset on the river as you watch the river boats and barges pass by. It's also a great spot to get a run in."
  ]
 },
 {
  "name": "Baton Rouge City Park",
  "address": "1515 Dalrymple Dr, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/575b7d36-932e-11ea-b0c4-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16708067678270177991",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent! Family and fitness oriented!",
   "Perfect place to bring my little kids",
   "Quiet park bring bread for the ducks and geese+",
   "Great park. Excellent playground for the kids. Lots of tree cover for shade.  Plenty of bemches and picnic tables. Very well kept grounds. Nice dog park. We were very impressed.",
   "A very quiet Serene place to sit and have breakfast."
  ]
 },
 {
  "name": "Louisiana Department of Wildlife and Fisheries",
  "address": "2000 Quail Dr, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57a9d73e-932e-11ea-b685-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7811685736182681120",
  "source": "GoogleMaps",
  "reviews": [
   "As an animal health professional, I agree that the speckled trout population is on the decline and much of it is due to the Corps of Eng's. Most of the eggs from juvenile trout in the Biloxi Marsh will die in the fresh water from yearly Spillway openings. Eggs from the trout over 20\" in Breton Sound will more likely to survive in higher salinity. A slot limit worked for redfish and makes more sense for specks.",
   "Very quick in an out.  Nothing worse than spending the day at the government offices. \nWas very helpful...",
   "Excellent service and we walked in and was called to the window right away",
   "Great customer service. If only the drivers license office was this nice and polite and efficient.",
   "Pretty nice place it's set back to make it look like it is in the woods. The staff are welcoming as you come in and direct you quickly. We came to get our boat registered and were in and out within 20 minutes. We were able to pick up booklettes about fishing, boating laws and even maps of the area. The staff member that helped us was awsome and answered all our questions with a big smile."
  ]
 },
 {
  "name": "Gus Young Park",
  "address": "4200 Gus Young Ave, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57f0a56e-932e-11ea-a63d-14b31f159f22.png",
  "tags": [
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=8104917714506828644",
  "source": "GoogleMaps",
  "reviews": [
   "Well kept park. Area didn't feel safe. Not an are where I would take my family.",
   "They need to put the swimming pool back",
   "Very quiet park in a weekday morning. Well-maintained playground, and a quiet place to park and talk on the phone or make a grocery list.",
   "Fun",
   "Needs the restoration that has been applied to other BREC parks in the city. The wood chips are dangerous and uncomfortable for the small children and people in sandals. But my toddler enjoyed herself"
  ]
 },
 {
  "name": "BREC Recreation & Park",
  "address": "3140 N Sherwood Forest Dr, Baton Rouge, LA 70814, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/586b55e2-932e-11ea-9d01-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10328939981642916027",
  "source": "GoogleMaps",
  "reviews": [
   "Great facilities except for the fishing. Everybody he's a big lake but when you cast out it's only if you feed beef all the way across. I know they probably want to prevent drowning but it also prevents the fish life for such an expensive fishing facility.",
   "The place is awesome!  Love the ducks outside.  Very popular place for sure.  Lots to do for all ages!  Everyone I met while there was cool except for one guy that worked in the gym that musta thought I wasn’t paying so instead of just looking up my name AFTER I signed in he asks me if I had a membership.  I told him yes, then he promptly went back to sleep.  I kid you not, I literally never saw the guy lift his head from that desk except to walk outside or start collecting the trash if it was getting close to 8pm.  Not trying to throw shade on the place but he was wrong for that.  If I was working there, a middle aged white dude, and I asked him, a middle aged black guy, the same thing without even checking first, Lord only knows what would happen to me.",
   "Was very quiet, friendly visitors, great place to fish and not crowded at all. Could use more seating near fishing areas for visitors that cannot stand for longer periods.",
   "Beautiful walking trail, larger than some of the other parks. I gave 4 stars instead of 5 because I hate that people come out there smoking weed. In broad daylight. No respect for the kids or others. May need someone to patrol the area.",
   "This is a very cool place to go if you just want to be outside or picnic or shoot basketball or do anything that consists of the outdoors it's very clean and a very fun place to be I go there just to relax and breathe in some fresh air and think I'd recommend this place to anyone"
  ]
 },
 {
  "name": "Independence Park Tennis Facility",
  "address": "7501 Independence Blvd, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58b66a08-932e-11ea-bcae-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=2739603375375992053",
  "source": "GoogleMaps",
  "reviews": [
   "A really nice place, and I will bring my family back for another visit",
   "Go to a NA meeting here its great",
   "Great courts, Friendly Staff",
   "This facility is wonderful!",
   "Thrive Church meets here on Sunday, 1030-1200, come check us out"
  ]
 },
 {
  "name": "Cohn Arboretum",
  "address": "12206 Foster Rd, Baton Rouge, LA 70811, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58f8a486-932e-11ea-816d-14b31f159f22.png",
  "tags": [
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15245976996152753702",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice gardens and vegetables planted. Well maintained and friendly staff.",
   "Beautiful garden with various plants, trees, flowers, fruits, and vegetables growing. There is also an old slave house that can be toured if it's not a holiday. I like to go and walk around.",
   "Beautiful place.. definitely worth checking out.. kids loved it",
   "Well kept up. The people were real polite",
   "Beautiful place to relax and reflect."
  ]
 },
 {
  "name": "Frenchtown Rd Conservation Area",
  "address": "17819 Frenchtown Rd, Central, LA 70739, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5940fe0a-932e-11ea-866b-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "kids",
   "family",
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=11822858053431325695",
  "source": "GoogleMaps",
  "reviews": [
   "Always a beautiful experience. The trails are well kept, but not so overly kept that it's not a fun hike. Love exploring.",
   "This was a great trail walk !! I rate 4/5 due to not much “to see” visually for myself. However I enjoyed myself . What I liked most was the trail is “unmarked” on the ground (so it felt like an adventure) its obvious the path and they do have a few tree marks just in case the very light tracking on the ground gets confusing. My first time I only walked the trail, did not visit the “beach”. I will next time.",
   "Pretty good trails. A couple of the smaller ones could use a trimming.",
   "Great place for a family hike through some beautiful nature. My kids loved the bamboo forest the most. They have two trails, we took the shorter one the first time out.",
   "Some of the trails were not maintained but we still had fun exploring!"
  ]
 },
 {
  "name": "Hooper Road Park",
  "address": "6261 Guynell Dr, Baton Rouge, LA 70811, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/598d0ae2-932e-11ea-8bd9-14b31f159f22.png",
  "tags": [
   "hike",
   "organized",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2733854032069435287",
  "source": "GoogleMaps",
  "reviews": [
   "I really want to like this MTB/hiking trail. The issue is it is not as popular or well maintained as Comite. I arrived at 10am on a Saturday and no one else was there. I had to run with a stick in my hand to knock down the 100s of spider webs crossing the path. It feels more shaded and rooted than Comite up the road. Also more moist. The trail itself is strenuous for runners or bikers. Just dont forget to bring the bug spray.",
   "Nice quiet and relaxing  environment.  I working and take my lunch break there. Fishing and hiking is the name of the game here.",
   "Signs could be more organized but a fun hike regardless",
   "Great play area for kids and trails are nice as well",
   "Lovely outdoor hiking trails."
  ]
 },
 {
  "name": "Comite River Park",
  "address": "8900 Hooper Rd, Baton Rouge, LA 70818, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59f944c2-932e-11ea-8d3f-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=705211482073047600",
  "source": "GoogleMaps",
  "reviews": [
   "We just moved to Louisiana, and were looking for a good park to get the kids out of the house and walk. Perfect park to be outdoors and chasing trails. The kids loved it too (6, and 10).",
   "This is basically the only option around here.  That being said, it’s pretty good.  Nothing crazy technical or anything with big exertion.  No big downhills although that’s to be expected in the South.  Maybe like 3 spots where I gotta drop the seat.  Great flow and a great workout.  Do it twice!",
   "We hiked over comite river park a couple of times last year. Definitely recommend everyone to go! Great for hiking and biking, with various landscapes! Make sure you wear waterproof hiking boots because it may have some water ponds on your way if it has rained a couple days before, which is very common in Louisiana.",
   "Awesome trails for beginners and up. Fun loop",
   "I went here because  there were so many great reviews. We were using Google maps and it brought us to the middle of a neighborhood I’m in Google says park and you have to walk the rest of the way. We see a small fence so we decide to go right under we saw a little trail so we  followed it.  It lead  to a  ditch with trash and a  bike tire.  We decided to keep on going and found a electrical machine thing and in a little trail\n  We fall in the trial  and it was just a bunch of trees and bugs it was complete silence then all of a sudden we hear her yell watch out it was a biker. I do not Recommend this trail. It be easier to drive a little bit farther for a good trail."
  ]
 },
 {
  "name": "Blackwater Conservation Area",
  "address": "9385 Blackwater Rd, Baker, LA 70714, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a475b92-932e-11ea-b24a-14b31f159f22.png",
  "tags": [
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6701258821885776146",
  "source": "GoogleMaps",
  "reviews": [
   "The trails are great. Lots of options for length of him. The trails are easily accessible by our small children, but interesting enough for our older kids. We love that large sections are shaded, and you have a mix of docks on the water and trails through the trees. A great, free outing!",
   "Very beautiful place out of the hustle and bustle of the city.",
   "Be careful when visiting.  My wife's wallet was stolen from our bag while we were fishing and our belongings were out of eyesight.  By the time we got back to our car and realized, charges were already made to her credit card. This is a pretty nice place but beware of some of the clientele visiting.",
   "Well maintained trails and plenty of spots around the lakes to fish.",
   "Very nice place, but can't fish in the big lake! It's full of lilies! So limited to where you can fish!!"
  ]
 },
 {
  "name": "Baton Rouge Sunset Museum",
  "address": "Baton Rouge, LA 70820, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5aa28724-932e-11ea-b436-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=201903760381300917",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "Rivault Park",
  "address": "900 S Jefferson Ave, Port Allen, LA 70767, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5aea1430-932e-11ea-a892-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=14360366800862035959",
  "source": "GoogleMaps",
  "reviews": [
   "Very clean, has covering, and benches. The restrooms are clean. Multiple fields to play on.",
   "Nice for the kids. Nice place for baseball ",
   "Just drove through while birding.",
   "Beautiful trees and really nice baseball diamonds",
   "Nice family place. Clean and kids love to be out on field playing ball."
  ]
 },
 {
  "name": "Old Bogan Fire Station",
  "address": "427 Laurel St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b3ef39a-932e-11ea-ae69-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=6141435862868100531",
  "source": "GoogleMaps",
  "reviews": [
   "A must to go visit! Amazing atmosphere and plenty of amazing history. Can't wait till the renovation is completed!",
   "Looking with bride as wedding venue, fantastic",
   "Awesome",
   "Downtown Baton Rouge gem!",
   ""
  ]
 },
 {
  "name": "River Center",
  "address": "275 S River Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5ba3f8c0-932e-11ea-be29-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=12294081243904876652",
  "source": "GoogleMaps",
  "reviews": [
   "Not a great venue. But, not terrible either. Went here for a conference. The food, selection, facilities, etc. were all perfectly ok. But, not stand out or great.",
   "Great venue for live acts! Right on the mighty Mississippi!",
   "Came to work a booth during hollydays and the power went out. It was out for about 4 hours. Place can get very hot quick but staff made sure the staff were comfortable.",
   "There for a ball. Fantastic place!",
   "Great place for a Concert!"
  ]
 },
 {
  "name": "Plaquemine Lock State Historic Site",
  "address": "57730 Main St, Plaquemine, LA 70764, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c02d046-932e-11ea-943f-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "history",
   "tour",
   "free",
   "walk",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=813462128713428065",
  "source": "GoogleMaps",
  "reviews": [
   "This was such a neat little place tucked away in this small town in southern Louisiana. I was passing through on business and I stopped by and spoke to a very friendly knowledgeable man named Stanley. He took such pride and joy sharing what was special to him and imparted great knowledge about the area. I'm grateful people like this exist who take pride in what they do and are excited to share their passion with others..",
   "Awesome history lesson 30 minutes from Baton Rouge",
   "Great historical place to visit. Learned more than I would have expected. Was shown all of the lock and museum by wonder people that were actually locals and knew the history first hand. Thank you both for a great memorable visit.",
   "Interesting tour of how and when the lock was in operation. Beautiful building in perfect condition. Grounds are lovely and includes a very nice view of the great muddy Mississippi River. It is free and has a small donation box.\nI recommend it!",
   "If you're a hardcore enthusiast of Louisiana history, you may enjoy this very niche tidbit of our state's story. The centerpiece of the town's attractions, there are a few things to check out inside the museum regarding the lock's history and how it all worked. You can also walk around outside and across the short bridge spanning the long-defunct lock, which once connected to the Mississippi River.\nBeyond that, there's not very much to do outside of simply walking around. Most people in the area come here just for that, and the area is rarely crowded outside of several events occurring nearby throughout the year.\nLast time I checked, there's no fee to enter the museum, but call ahead just to be sure."
  ]
 },
 {
  "name": "Zachary Community Park",
  "address": "20055 Old Scenic Hwy, Zachary, LA 70791, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c6b7f30-932e-11ea-8f85-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "library",
   "free",
   "library",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=827784299875245208",
  "source": "GoogleMaps",
  "reviews": [
   "It has multiple bathrooms, a little library,  fishing spot and dog park. There is some outdoor exercise equipment  and a nice path to walk/ run on. There is an area where you can do an outdoor birthday. My kids favorite part besides the playground equipment  is the splash pad.",
   "Niece loves this park. Always clean and nice equipment with a pretty good variety. The splash pad is very fun too!",
   "This is a top notch park.  There is a splash pad, the most amazing playground and fishing pond.  The facility is impeccably kept.",
   "Great park! The grounds are clean and there is plenty of space for everyone to play. The splash pad is great, especially since it's been so hot out. There's even a little lending library box on the grounds where you can take a book and leave a book for others absolutely free. There's a dog park as well and work out space. The walking trail is also awesome!",
   "Excellent playground equipment. Super clean and fun. Lots of seating and shade. Skateboard park, basketball court, walking/running paths, dog park, fitness equipment, and a splash pad.  There is no shortage of things to do here or try. Pavilions are available for rental for special occasions. Excellent park!"
  ]
 },
 {
  "name": "LaHouse Home and Landscape Resource Center",
  "address": "2858 Gourrier Ave, Baton Rouge, LA 70820, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5cc33c62-932e-11ea-94c0-14b31f159f22.png",
  "tags": [
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3543199764368586805",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful energy efficient home concept. I went mainly to show raised garden beds to a friend. We decided to do a tour of the LaHouse Home. It is just grand.",
   "Fascinating and necessary research for our environment and comfort",
   "First time I went I thought \"this iangoing to be lame,\" but ut was actually very good. Every year I take a group of highschool students and they have a blast. The people there will arrange interesting educational activities for students to do to break up the tour. Also, some of the stuff I have learnee has helped me ro lower my electric bill.",
   "Awesome place, but make sure to register ahead for classes, because they fill up fast!",
   "A great LSU establishment for parties"
  ]
 },
 {
  "name": "Jackson Community Park",
  "address": "12250 Sullivan Rd, Baton Rouge, LA 70818, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d1b492e-932e-11ea-b27c-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16136655720064710887",
  "source": "GoogleMaps",
  "reviews": [
   "It's not a bad little park, it really isn't, and I also adore the Tiny Steps program here. But be aware that this park is currently undergoing major renovations and has been for several months now. Particularly if it's been rainy, getting into and out of this park can be a challenge in its current state.",
   "The staff at Jackson/brec park is unbelievable.  They are so nice,  helpful,  kind,  and accommodating.",
   "As far as the BREC  facilities go this park this park is a bit on the small side but is equipped with covered park benches for picnics or birthday parties. Has tennis courts and indoor facilities that have a gymnastics set up. At the time I went the front parking lot was still under construction.",
   "Splash Pad is Great!!! Could use a better playground.  No baby swings and the actual playground is more for little kids and not really good for kids 6 and up.  I mean they can play but it does not really seem to be intended for a older kids who actually need a little bit more of a challenge.  Please please please upgrade the playground.  Considering the splash pad is located here, the playground needs to be up to par.",
   "Great environment My children had a lot of fun"
  ]
 },
 {
  "name": "Burbank Park",
  "address": "12400 Burbank Dr, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d6eeff8-932e-11ea-8caf-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6209027845321780824",
  "source": "GoogleMaps",
  "reviews": [
   "The dog park here is amazing. Very large with an attached pond the dogs can swim in and a place outside the gate to hose off. The dog owners enforce behavior and generally I'll tempered dogs leave from the prompting of people there without incident.\n\nDon't forget to pick up after your dog!",
   "There is lots of deals everywhere they are improving the facilities",
   "Great place to play soccer but bring chairs!!",
   "Great open space",
   "My son plays soccer for BRSC.  There are plenty of fields that are in decent shape.  We have visited other fields that are more impressive in quality lately, but not as plentiful.  BRSC has tons of potential though."
  ]
 },
 {
  "name": "Sanova Dermatology - Baton Rouge",
  "address": "6411 Perkins Rd #100, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5db6f6b6-932e-11ea-973d-14b31f159f22.png",
  "tags": [
   "comforting",
   "economical"
  ],
  "link": "https://maps.google.com/?cid=13193396898701097160",
  "source": "GoogleMaps",
  "reviews": [
   "I saw Donna Vial, PA for a skin check. The check in process was easy and quick, the waiting room comfortable and serene. I was called back promptly and the nurse and PA were both personable and professional. Donna was cheerful, thorough and provided easy to understand explanations about my skin. My appointment took less than 20 minutes and checkout was a breeze.",
   "My experience at Sanova Dermatologist clinic was absolutely amazing! The staff there made me feel comfortable throughout my entire procedure. I would definitely recommend them to anyone. Thank you again Dr. Prather and for your wonderful staff members.",
   "Dr Prather\nThe care and concern you receive from the entire staff is very comforting. The best I have had.!! They talked me through every step. They are wonderful people.",
   "Dr. Tucker has worked out my issues with me and saw to it that I understood the problem and what to do about it.   She provided me with economical solutions and gave me samples of the meds to get me started before I invested in the prescription. I would not go anywhere else!",
   "The atmosphere is warm and inviting; the staff is just wonderful; Dr Donna Vial is warm and friendly and so thorough and takes time to explain everything! This will be my dermatology clinic from now on! And appointment was right on schedule.. no long waiting"
  ]
 },
 {
  "name": "Parrain's Seafood Restaurant",
  "address": "3225 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e26aa90-932e-11ea-93e1-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15284907034067192899",
  "source": "GoogleMaps",
  "reviews": [
   "Great down home atmosphere is what's best about this place. Shared raw oysters (that are half price all day on Tuesday) and had great drinks from the bar. Our waiter was great and very attentive even though he had another table of 20!!!! The hostess staff were great and overall it was a good experience. The bar is lively and everyone seemed to be well taken care of. My only gripe is concerning presentation. The raw oysters do not come on ice. I've come to expect it and I am convinced it serves a purpose. Other than that small nuance (mine only), it was a great place that I'll be returning to soon.",
   "The food is good at best, and that's mainly because you don't have to go through the effort of frying it all up yourself. You barely get any food for what you pay, the whole shebang platter which costs around $24, resembles more of a plate lunch I would get from my local church, and those usually taste better. Everyone has an opinion and this is mine, better places for seafood easily.",
   "A wonderful dining experience. Service was excellent, food was wonderful. My daughter had the vermilion nice size portion, excellent flavor. I had the drum which was the dinner special it was amazing, my husband had the seafood platter.  It was also a very large portion and tasted absolutely delicious. Will definitely be going back. A little pricey but worth it!",
   "The food was good, but not as good as I remember it from my 1st visit several years ago.\nWhat I am missing is the \"fresh, vibrant, original,\" taste of ingredients.\nThe food is good and rich but also lame because the main flavors don't shine in the dishes.\n\nWhat I ate:\n* Charbroiled oysters. Sadly oysters were overpowered by strong cheese flavor. \n* Seafood gumbo - Please serve the rice on the side. It hides all the other ingredients that should be there, though some small mushy shrimps were discovered eventually.\n* White cholate bread pudding - the sauce is the best part here!  Presentation of the dessert is well done. However, I recommend serving the sauce with bread pudding dipping chunks instead. It would be an awesome taste sensation that way.",
   "What a pleasant surprise! This was my first time to visit, and boy I'm glad I did. I'll definitely come again. Seating was fast. I really enjoyed the decor, particularly the colorful painting of the bayou. Our waiter was excellent. Pleasant, knowlegable, and attentive...not too attentive. Food was excellent. I had the chicken platter. Well prepared and cooked."
  ]
 },
 {
  "name": "Louisiana Lagniappe Restaurant",
  "address": "9990 Perkins Rd, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e7233a6-932e-11ea-a763-14b31f159f22.png",
  "tags": [
   "eat",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3901602611457430982",
  "source": "GoogleMaps",
  "reviews": [
   "I eat here every time I'm in Baton Rouge because I love it so much. It's a little pricey, but definitely worth it! Listen carefully to the specials and try to select one of them. The bread is awesome and the house salad makes me want to lick the plate. Don't miss this place, you'll thank me",
   "I THOROUGHLY ENJOYED THE CHICKEN ACADIAN. The seafood gumbo and stuffed mushroom for appetizers were great, too.\n\nThe 🍓 strawberry cheesecake was a tasty dessert. Do not order the pecan pie unless you like your pecan pies heavily piled with pecans and...tasteless.",
   "I came in for Valentines day with my girlfriend and had a delightful dinner. Our server Austin was quite pleasant and knowledgeable about the menu. We took his reccomendations, which were all incredible. Honestly this was one of the best meals I've ever had. I'll definitely be back!",
   "There is not a single negative to say about this restaurant. Maybe it was a little loud? But you know what that was? People happily talking and not a single phone out anywhere. People were enjoying great food and each other's company and an overall wonderful dining experience. The a la roland was perfect, and I ate every bite of my salad, which I rarely do. Our server was the best. Thank you for an awesome dining experience.",
   "The food was rich and tasty but it left me thinking how much I'd have to work out for the next week to burn off the calories. I hoped to find something a little lighter but gave in and went with a  fried fish entree. The servers were very attentive and friendly."
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "4836 Constitution Ave, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5eb5f4d0-932e-11ea-8d2b-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5496496299167480866",
  "source": "GoogleMaps",
  "reviews": [
   "Our first visit to Ruth’s Chris Baton Rouge was nothing less than stellar.  Our server Christine was 5-star herself.  She was friendly, knowledgeable, helpful, and had a great personality. She really helped make our evening extra special.\n\nThe food was exactly what we expected from Ruth’s Chris.....Amazing!  The manager Brent was extremely friendly, professional, and courteous.  We will definitely return to indulge in 5-star service, ambiance, and of course, the food.",
   "This Ruth's Chris was the best one I went to. Everything from the Calamari to the cut of steak was amazing and perfect in flavor. (Highly recommend the Calamari) Our server Vincent was very nice and very sweet. He honestly brought this experience up and made it even better. I will definitely come here again and bring my friends when I go to College.",
   "Great take out experience, service was delightful and since I ate at home I was able to go caveman on that awesome bone in ribeye. The food was too good to eat on plastic so I plated it and lit a candle.",
   "Service was excellent as always. The food was to die for. The T-bone was melt in your mouth tender, and seasons to perfection. The lobster tail was amazing as well, served with candle lit warm butter. They even through in a birthday cheesecake for my wife. The drinks were nice and refreshing 👌 . Would give ten stars if the chart went that high. I've eaten at Ruth's Chris steakhouses all over the country but this is the best one by far. Thumbs up to the chef too!",
   "I used to enjoy this restaurant, however I will never return. This publicly-traded company took $20 MILLION from the Paycheck Protection Program, (with help of Chase Bank) beating out small businesses in our city that need funding. I WILL NEVER RETURN HERE! SHAME ON YOU!! Hopefully, you will be forced to close permanently and will be denied Bankruptcy protection."
  ]
 },
 {
  "name": "Stroubes Seafood and Steaks",
  "address": "107 3rd St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5efc4562-932e-11ea-a457-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17766470154817585735",
  "source": "GoogleMaps",
  "reviews": [
   "When I go out to eat not only do I look for great food and a great atmosphere but I also look for great service and Stroubes has just that. I went in and ate at the bar and was greeted by the bartender Layla right away. I just ordered a water and asked her for her recommendations because it was my first time there. I ended up getting the Pork Porterhouse. The food came out fast, hot, fresh, and delicious. My water never at one time was empty and once I was completed with my entree I was immediately offered dessert. I took Layla's recommendation and went with the bread pudding which was phenomenal. I highly recommend if you're sitting at the bar Layla is an amazing bartender and if you're sitting in the restaurant Sidney is one of the best servers! Overall I had an amazing experience and I will definitely return!",
   "We have just had the best meal EVER at Stroubes Seafood and Steaks. The martinis 🍸 were delicious and the filet Oscar was superb!!! Dessert white Chocolate Praline pudding out of this world! Waiter extremely attentive and courteous. So worth it! If you are looking for a dining experience that will cap off a great Baton Rouge vacation this is it! A must stop for fine dining.",
   "LOVE,LOVE,LOVE THIS PLACE. GREAT FOOD. AWESOME ATMOSPHERE. AND WHERE ME AND MY WIFE ATE AFTER I PROPOSED.",
   "The place was nice, and had good reviews, so I thought I'd try their 1942 sandwich recipe, for a change. As I entered for lunch, the place was mostly empty. Seeing that there were more than 9 empty tables next to windows, I asked the girl at the front desk if I could sit at one of them. She went to check (what, I don't know, there were multiple available...) and ended up sitting me in the middle of the restaurant, like 10 feet away from any window. Maybe she didn't hear me correctly, but I didn't want to be pushy, so I let it go - but this didn't set me up for a great experience at this place. I saw no less than 4 waiters and waitresses walking around (doing what, who knows, because every single table was set already). Instead of them, the woman at the bar took care of my lunch. This was the only person in the restaurant who seemed to be working, with me and two other gentlemen sitting at the bar. Notice that she was working at the bar, yet getting my order at a booth - while the other 5 people were doing... what exactly? Now, this lady from the bar was absolutely delightful. She took my order, made sure I had water a couple times, and brought me my check when I was done, all while having the most wonderful attitude that, frankly, made my meal. The 1942 sandwich was what I expected - different, a sign of simpler, more basic times, tasty without blowing you away. Then again it's $8 plus tax, but maybe instead of throwing a giant amount of fries, this restaurant could consider giving about 2/3 the fries and adding something like a pickle to spice things up. Other than that, it was a decent sandwich. Only my confusion at the rest of the staff lowered my impression of Stroubes a bit, but the lady at the bar that took care of my lunch, she made the day. Give her a raise.",
   "Food is high quality.  Some materials management issues. I have been here several times in the past 4 months. 2 times in the last month I ordered a Manhattan and they were out of vermouth. And no, not the next day, visits separated by several weeks. And for a seafood and steak place that only has 3 steaks on the menu, you can't run out of rib eye at 730 on a Saturday night. But 4 stars,  the food is good."
  ]
 },
 {
  "name": "Texas de Brazil",
  "address": "10155 Perkins Rd Ste 100, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f40a29c-932e-11ea-bfae-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12802965843976095325",
  "source": "GoogleMaps",
  "reviews": [
   "Fun night. Some of the cuts had a little more gristle than on previous occasions, but for the most part they did not. Not a good value for kids, but for adults who love meat, it's the best in town. The salad bar is even pretty good. The pickled spicy shrimp were my least favorite. One adult, and six kids was right over $350.00 with no alcohol.",
   "Texas de Brazil never fails to be amazing! The food was perfect. We went for our anniversary with a coupon for dessert, and they even made a little note on it for us. Very kind of them to celebrate with us",
   "This place is awesome! Many different selections of meat that are brought out to you along with a great selection of wines and desserts. Also, there's a salad bar with everything you can think of. My husband and I have been there multiple times. Trust me you'll love it.",
   "Best restaurant I have ever been to in my life. The atmosphere was beautiful and elegant but yet casual enough that people were having great conversation and laughing and having a great time. Everything was so well taken care of and so clean. Beautiful decor and very spacious room and very much space. Beautiful dining tables and settings. The food was absolutely amazing. I have never had anything so good in my entire life! Everything was cooked to perfection. The right combination of cheeses from the salad bar along with the different types of meat was so amazing! The waiter and the rest of the staff were so professional and courteous and generous with every part of our dinner. We had an amazing experience and I would recommend to everyone to go there and experience for yourself.",
   "This restaurant is the one I like best. I eat in a lot of restaurants but to this one I  constantly return again and again. The stuff is very warm and the cuisine they place on your table is so good. I am always happy to have a good meal here. Highly recommended."
  ]
 },
 {
  "name": "Cocha",
  "address": "445 N 6th St, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f924682-932e-11ea-8175-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11861289744885715982",
  "source": "GoogleMaps",
  "reviews": [
   "Cocha has superb, high quality, fresh, locally-sourced menu items that are sure to please your palate! There are plenty of dishes suitable for herbivores AND carnivores! Cocha has an excellent lunch menu that hits that sweet spot. What I mean by this is - you won't go back to the office overly-stuffed; rather, you leave this establishment pleasantly full and euphoric! The atmosphere is great... something you'd see in a much bigger, more cosmopolitan city than Baton Rouge. You definitely owe it to yourself to try Cocha. I suspect it will quickly land within your top few favorite local restaurants! It's definitely a great restaurant for going on a romantic date!",
   "Love this place! Very attentive service, amazing cocktails, great ambience and usually has one or two veg friendly dishes though this is definitely an omnivore's place. They now have outdoor seating as well. Upscale but with a neighborhood feel: they aren't pretentious.",
   "Superb dining with a nice atmosphere. Waiter was great. Service at a nice pace, not rushed but not waiting forever either. \n\nHave eaten here about 4 times over several years when in town on a business trip and never have I been disappointed. \n\nSpecialty cocktails also great, odd combinations that work well together. Pricing is very reasonable compared to the quality of the food. Highly recommend this place for a good dining expetience.\n\nThe menu while not extensive features a good variety of dishes, about a dozen main ones they can concentrate on to make excellent. Daily specialties also. Menu changes quarterly with the seasons.",
   "The food was very good. The Garden Focaccia bread was great. The bread was lightly toasted, and the balsamic dip provided an exquisite flavor complement. The Garden Fettuccine was good, and the natural blending of the tomatoes and asparagus gave an extra depth of flavor. The salmon that I ordered was cooked to my request and flaked very well. I definitely recommend this restaurant.",
   "I had high hopes for this restaurant because it has such excellent reviews, but I was a bit disappointed. First, they gave us menus and when it was time to order the waiter said they just changed the menus and didn’t have what we wanted. So he went to the server station and got the updated menus for us to look at, which was a bit strange and should have been given to us in the first place. The food was well received by the group, but took a very long time and the portions are small. If you are very hungry this might not be the place for you to go, but for a small bite it would be fine."
  ]
 },
 {
  "name": "Mansurs on the Boulevard",
  "address": "5720 Corporate Blvd A, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5fef0e64-932e-11ea-bed5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1237835292013119024",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome spot in a quiet area for dinner dates! It came to my surprise that Mansurs is able to accommodate large parties as well. They have many specials especially with seafood depending on the season. You can't really go wrong with anything on the menu. The Duck Mansur topped with shrimp scampi is a personal favorite of mine and will be looking forward to trying their seafood options in the future!",
   "Ahi Tuna, dozen oysters on the half shell, shared seafood salad. Great choice for a quick bite at the bar.",
   "Omg!!! So good. Food was amazing,  service was great, drinks were delicious. 5 of us came for dinner. Great atmosphere that is a nice balance between quiet/romantic and fun energy.  Beautiful and clean area, quick service and attentive about clearing dirty/empty glasses and plates. Will definitely be back every time I come to town!!!!",
   "Wonderful food, great service,  great atmosphere.  We had crab cakes,  spinach dip, shrimp and grits, steak and bread pudding.  All were outstanding.  Loved everything.",
   "We had an incredible meal.  Everything was so very fresh and well presented.  Brandon was our server and he was extremely professional and polite.  He totally enhanced the whole experience. Highly recommend Mansurs for a total fine dining experience."
  ]
 },
 {
  "name": "Juban's",
  "address": "3739 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/603e1a2e-932e-11ea-b810-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6285434247359701163",
  "source": "GoogleMaps",
  "reviews": [
   "Wow. \n\nThe crab cakes were phenomenal. Very pleased with the amount of Thriller to filler ratio. Very solid depth of flavor. Fresh and flaky, not dry.\n\nThe shrimp were excellent as well. I could not get enough of that sauce. And the mango and bacon topped it off. \n\nThe Hallelujah crab was five star. Tender and clean, not overcooked, and the potato was smooth and season perfectly. Those veggies...perfection \n\nThe butter and bread were standard fare. The butter was so light, it did not have much of a butter flavor, and it was slightly sweet but not salty at all. The bread needed salt, kind of bland. \n\nThe sensation salad was slightly oily, and could have used a little bit more zip with either Citrus lemon squeeze, salt or cheese.\n\nWe will be back.",
   "Always a good experience. High quality food and service. Try the favorites or the chefs special, you really can't go wrong. The crab cakes are way more crab than cake and delicious.",
   "We came for lunch. This place has great atmosphere! The service was excellent (Nick & team). The food looked and tasted great.",
   "A Baton Rouge favorite in my wife’s family. Celebration and special occasions are great here with a nice Bayou / hometown touch. Whether it’s air, land, or sea food you’re feeling, you can something good here.",
   "Good food and great service. Nice ambiance for a date night. Definitely recommend the crab cakes and the hallelujah crab."
  ]
 },
 {
  "name": "Roux 61",
  "address": "8322 Bluebonnet Blvd, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/608e1062-932e-11ea-b4f0-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "kids",
   "food",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11133601778420756720",
  "source": "GoogleMaps",
  "reviews": [
   "Traveling from Dallas to Gulf Shores we decided to stop here for lunch because of the reviews. It was mixed for my family. Not really worth the trouble to stop. \n\nSome of the food was really good but there were lots of missed steps. Our waitress was very friendly but didn't listen to our order. We were missing several items ordered and the things we got were not done to request. \n\nI had the Delta Queen and the fish was really good. But the lobster cream sauce was not good. It was more like a creole Alfredo sauce. Way to over reduced to the point of a cheese sauce. Bread was horrible, hush puppies were worse. Even my daughter said her sandwich bun was gross. \n\nIced tea was great as should be for the deep South. \n\nNot a place I would go out of the way for.",
   "The food was so delicious.  Grilled oysters are a must.  The stuffed mushroom was also a welcomed surprise.  No complaints about the service or the food.  I'll have to go back and see what the rest of the menu has to offer.  The kids popcorn shrimp is enough to share.  My 6 year old son barely put a dent in it.",
   "Very nice place food is excellent. They give you plenty of food when you order something. I think the prices are reasonable. I got the Fish platter combination and I also got the oysters. They were cooked first time for me with garlic and a little bit of breading. They were fantastic. The place sits right next to This Little River right on the water. The only problem I would have with this place is the people that go to seat you. There not the friendliest. But the actual waitresses and waiters are very nice. I went there twice already. Definitely a place I will go back to in the future. There's also believe it or not two different sets of bathrooms. So if you're in the back of the restaurant you have bathrooms or if your towards the front or middle of the restaurant you have bathrooms. Pretty nice",
   "The oysters are outstanding! The shrimp and alligator cheesecake cake was very flavorful and unique. We were in town for my son's soccer tournament and someone told us about this. It was the only place we ate at twice the entire week. Everything I had, which was oysters and seafood, was delicious. The beer was cold and had 2 great servers!",
   "AMAZING food. Especially the Shrimp and Alligator Cheesecake. Sounds weird, but it's amazingly good. Not sweet as the word cheesecake may sound, but instead savory and rich. The staff are very friendly, welcoming, and helpful. Definitely will be back. Hopefully, sooner than later."
  ]
 },
 {
  "name": "The Chimes",
  "address": "3357 Highland Rd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/60d57aec-932e-11ea-8ab2-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "eat",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15056109343281320606",
  "source": "GoogleMaps",
  "reviews": [
   "It was good to my liking. To be honest the waiter had just started a month ago. She was very patient with me and she explained the menu very well. I had the chimes boat I think it was called. I had a wonderful time there. The salad I had was tossed in pepper jelly. It was not as presentable but it was okay",
   "In general, I always enjoy The Chimes. Unfortunately, this first trip to the new rooftop patio did not meet that expectation. We went on a Sunday during brunch so, we figured it would be busy. It was. But, the food was good and the patio was really nice. We enjoyed the views, the weather and the people watching. What really ruined it was the service. We waited nearly an hour for a beer and, even after asking several of the staff a few times about it, still didnt get that beer until we were almost finished the meal. We also waited a really long time just to order anything at all and were only successful after flagging down several different people. We were never really sure who was our server since  we never saw the same person twice.  The staff was running ragged and almost impossible to catch. The patio experience definitely had a hectic and understaffed feel to it from the start to the finish of the meal. I strongly recommend more upstairs staff if only to avoid detracting from an otherwise very nice experience.",
   "Decent place not as homey as the much larger one in Covington. Plenty to drink and eat + a few extra items.\n\nIt could use a touch of personality tho in the building and staff. Other than that great place for a weekend",
   "Great food and Great customer service.  Special shootout to our server Deston who made every effort to give excellent service!!",
   "The food was good but small portions. Too much presentation for my taste. Staff a bit young and too playful. Music too loud to talk, love music but i wanted to be able to visit being from out of town to see my cousin. Chadd was nice and courteous! Ty!"
  ]
 },
 {
  "name": "Mike Anderson's - Baton Rouge",
  "address": "1031 W Lee Dr, Baton Rouge, LA 70820, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61234e10-932e-11ea-b9f9-14b31f159f22.png",
  "tags": [
   "drink",
   "knowledgeable",
   "eat",
   "food",
   "delicious",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3393043889210431525",
  "source": "GoogleMaps",
  "reviews": [
   "When I come to Baton Rouge this is a must, especially when craw fish is in season.\n\nGreat selection of local food and seafood that can rival seafood restaurants in my home of Seattle.  \n\nThe service is great and very knowledgeable about their menu and drink selections.\n\nThe interior is rich wood walls that bring a great feeling while you eat.\n\nParking is good and the place is easy to find.",
   "I visit Mike Anderson's for lunch or dinner any time I visit Baton Rouge. It is my favorite restaurant there and in my opinion makes the best seafood in southern Louisiana!",
   "Always have good service & delicious food. Atmosphere is very good?   I've never left disappointed. I got fried shrimp & fried onion rings.  Both were delicious.  Portion was too much for me to eat in one sitting so took the rest home for supper.  I reheated in my Emeril air fryer and they were just as crisp as they were for lunch.",
   "Met a group of friends here for lunch. Hadn't been here in a few years but liked it when I had last eaten there. This time not so much. Service was slow, drinks were slower. Chowder was good but they rest of my seafood was mediocre. Had to ask for clean silverware as my fork was dirty.  They seem to have pretty good reviews so hopefully it was just an off day for them. Will give them a go when I'm back in BR. Pretty lengthy wait for lunchtime as well. Will update next visit.",
   "The atmosphere was great. The waiter George was great. The raw, grilled and BBQ oysters were excellent. We as a 13 top did bombard them by initially ordering 5 dozens oysters, but the seared tuna had no flavor, the blackened tuna was over cooked as well as the Salmon. Of course the fired things were good and the sweet potato fries were delicious. I think the cook was overwhelmed with a lot of late parties. They close at 9 and we were served dinner at 9:30. :("
  ]
 },
 {
  "name": "J. Alexander's",
  "address": "6457 Bluebonnet Blvd, Baton Rouge, LA 70836, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/616dc5e6-932e-11ea-8a08-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11933472590227705637",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great choice - fantastic food and fast service.   Good bar with quality selection of wine & spirits.   Steak, fish, veggies all good.   Deviled eggs appetizer a great starter.",
   "If you where looking for a place that was a bit more upscale in cultural black hole known as Baton Rouge. This place has decent steak and seafood. My mother loved the speckled trout. I had the emerald coast shrimp and it was well done.",
   "I visit J Alexander’s frequently.  \n\nThe host and service are very good and attentive.  The service is also very consistent: the greeting is always the same as is the presentation of specials - no matter who is on staff.  The dining staff work together to fill empty glasses and remove finished plates.  Despite the mechanics, the staff are personable and knowledgeable about the menu and wines.\n\nI typically order salmon, trout, red fish, or drum.  The salmon is prepared to the desired temperature.  The trout is usually prepared with a Cajun inspired spice.  It’s not spicy, and not too salty.  The red fish is prepared with a lemon butter sauce, which get on the side.  The drum is done with a creamy seafood sauce that is delicious and filling. \n\nThere is an assortment of sides on the menu as well as 1-2 daily specials. I usually opt for the special because they are a bit more interesting.  The menu features the usual (broccoli, baked potato, fries, etc), and the specials range from fresh heirloom tomatoes to roasted beet salad to haricots.  \n\nOverall, I have never had a bad experience at this restaurant.  The service is always great, and the food is delicious, fresh, and prepared to order.",
   "I used to enjoy this restaurant, however I will never return. This publicly-traded company took $15 MILLION from the Paycheck Protection Program, (with help of Pinnacle Bank) beating out small businesses in our city that need funding. I WILL NEVER RETURN HERE! SHAME ON YOU!! Hopefully, you will be forced to close permanently and be denied Bankruptcy protection.",
   "The ambience was perfect for a romantic evening but omg don't get me started on the crab cakes; they are hands down the best I've ever had anywhere, period!! They were full of crab meat & the buttery crust it was surrounded in, complemented it well. I wanted to go back the next day just to get some to go. The fries were even seasoned to perfection. Thank me later 🤤"
  ]
 },
 {
  "name": "Acme Oyster House",
  "address": "3535 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61b347ba-932e-11ea-921d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10372202007339505440",
  "source": "GoogleMaps",
  "reviews": [
   "If you are looking for oysters this is your place.  Busy lunch location.   Everything is good and food comes out quick.   Friendly service and table side checkout.",
   "Plenty of parking as this location is connected to a larger shopping center. We were greeted by a hostess and seated immediately. The waiter was quick in the beginning but was absent near the end of the meal. The menu was fairly extensive and the food came out quickly and was good. I would recommend this location to anyone in the area looking for good food (like jambalaya).",
   "We visited the baton rouge location in January. The young lady in training as waitress and the young man training her were caring helpful answered our questions and helped us set up rewards points loyalty card. The food was wonderful. But today went back the staff was rude could not explain loyalty card not sure going back.",
   "Enjoyed our servers enthusiasm. \n\nThe food was good and served on time. \n\nThe prices were fair. \n\nDefinitely stop there again if ever presented with the chance",
   "We sat for about 5-10 minutes before we had a waiter come up to us. It looked like there were 3 waiters and only like 6 tables sat in the restaurant. That being said, the seafood gumbo was yummy. I'm not from Louisiana, so I hope it was up to par. Heading to N'orleans. I should have a better idea then."
  ]
 },
 {
  "name": "The Little Village",
  "address": "447 N 3rd St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62082008-932e-11ea-a43f-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2512825360417999378",
  "source": "GoogleMaps",
  "reviews": [
   "I've been to this location numerous times and it is always just as fabulous as the previous time. I want to compliment the ENTIRE staff on my recent experience there on Christmas Eve. Everyone from the hostess to our fabulous waiter Jordan were phenomenal. With it being a holiday you never heard a single complaint about an employee having to work. Keep it up!",
   "The servers push the wine menu too aggressively. You can definitely tell they are trying to up group bill total for tips. Avoid seafood and the wines on special. Otherwise amazing. The group garlic knot is a must.",
   "Love this restaurant. Went with a group of 11. All were very happy with food choices. Love the bread and atmosphere. Not too noisy to enjoy conversation. Will be going back.",
   "Has to be the best Italian food in Baton Rouge.  Best bread for sure - AMAZING!  Good bar.  Service is quick and friendly.  Put this on your list for places to eat in Baton Rouge!",
   "This is our new favorite restaurant! My husband and I first came here for our seventh anniversary but we went to the Airline location. The food is absolutely incredible. Every year my husband and I have a fancy Christmas Eve dinner (we usually go to Fleming's) where we order everything we want without worrying about the bill. We loved The Little Village so much when we went for our anniversary date that we decided to start coming here for our big fancy Christmas Eve dinner. Everyone always says to order the bread so we started there and got all of the bread sides as well. The tapenade was perfect as well as the amazing red sauce and roasted garlic. Everything paired so nicely with the stunningly delicious bread. My husband ordered the veal alla parmigiana (you can tell in the picture that he loved it because it's almost completely gone) and I ordered a ribeye with jumbo lump crabmeat and bearnaise sauce. This was easily one of the best steaks I've ever had. We also decided to split the baked lobster mac and cheese (to die for). Everything also came with a side salad and a potato or vegetable of the day. We couldn't finish the cheddar mashed potatoes or half of the lobster mac so we got those to go. We thought we didn't have room for dessert but our waiter, Jeff, talked us into the sticky toffee pudding cake. It was a gingerbread-esque cake served with caramel gelato and warm toffee sauce. We ate every single bite. I will say that this restaurant is on the pricier side but definitely worth every penny."
  ]
 },
 {
  "name": "Red Zeppelin Pizza",
  "address": "4395 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62555722-932e-11ea-bde6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7340109441193437952",
  "source": "GoogleMaps",
  "reviews": [
   "Great pizza paired with an equally good selection of local beer. The ambiance is casual and fine for families. The pizza is good - it is the thin crust kind and gets the basics right. Recommend the artichoke dip and the Margarita pizza.",
   "Excellent thin crust pizza and probably  the best spinach and artichoke dip I've ever had. Cool place but usually very busy. Expect it to take some time to get your food. Your patience will be rewarded.",
   "This pizza place is amazing. Food is always on point and they have a ton of amazing draft beers. You can fill growlers here as well. The spin dip is, in my opinion, the best in baton rouge.",
   "Happy hour at Red Zeppelin is awesome. Pizza is very inexpensive. It was an awesome day to sit on the patio. They have a pretty good beer selection too!",
   "Great place. Parking is horrendous. Food is delicious. Once again parking and getting in to park is a hassle. That's really the only issue. Other than that the waitress was wonderful the bar was good."
  ]
 },
 {
  "name": "Anthony's Italian Deli",
  "address": "5575 Government St, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62b022e4-932e-11ea-bdb8-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17588804469254692929",
  "source": "GoogleMaps",
  "reviews": [
   "Best Italian food in Baton Rouge hands down... Extremely consistent. I have eaten at all of the well known Italian restaurants in Baton Rouge and the surrounding area, and Anthony's is still my favorite for the last 18 years. A quaint atmosphere accompanied by great flavor.",
   "I haven't been to Anthony's Deli since they moved into the new location, which was probably +5 years ago. I'm realizing now that their absence from my life is hands down the largest regret I'll ever have. The muffoletta I ordered could not have been more perfect, you can tell that the little Italian woman in the kitchen made it with love.",
   "Best Italian anywhere very authentic and family owned operation.  Best people and best food in br!!",
   "This place is amazing! My husband and I frequented it when we lived in LA and always make sure to drop by when we come for visits home! We usually order a couple of sandwiches to bring home with us! Their pepperoni pizza on muffuletta bread....I've yet to find anything better!",
   "Anthony’s is an excellent lunch spot for a nice day even in the fall you can sit outside and enjoy the views on government street while you eat all done at Italian food. I love the pasta salad and also go simple at this place meatballs and spaghetti is the best. Friendly owners"
  ]
 },
 {
  "name": "Bellue's Fine Cajun Cuisine",
  "address": "3110 Scenic Hwy, Baton Rouge, LA 70805, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/630e856e-932e-11ea-a34b-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13232759104682021683",
  "source": "GoogleMaps",
  "reviews": [
   "The owner was the nicest person I've met. Food was so delicious and his welding toys are so cool. Me and my family will definitely be there again when we are in town.\nThank you so much",
   "I received a box of frozen products from this place as a gift. Worst Cajun food I’ve ever tasted. Being from Lafayette, Louisiana I consider it a real insult to call this food Cajun. Everything was gross! Maybe the food at the restaurant is good (big MAYBE) but don’t even think about buying a frozen product to make at home. They’re all TRASH!",
   "The internet brought me to this place!  This is by far the most flavorful Cajun food I have eaten!!!  I had the Crawfish/shrimp etouffee with dressing, honestly there are no words to describe this fine delicacy.  I enquired about the glazed chicken (chicken souse) they sell in the deli fridge and they quickly offered a sample....  \"that souse has flavors that pop in your mouth\" is how my son described that to me.  The pecan pralines I took home have a perfect sweetness.  I will definitely make a pit stop here again or take a 7 hour road trip just to eat here!",
   "These people hit the mark when they set out to be the best in fine Cajun cuisine. The deer and chicken sauce piquant is to die for and the pricing there is very low for the quality dishes that they serve.",
   "Googled \"Best Lunch in Baton Rouge\" when leaving the airport and this place had the highest reviews. I wanted a real cajun experience and got just that. Exceptional hospitality and the food was GREAT. Served fast and hot. Highly recommend. A+"
  ]
 },
 {
  "name": "Poor Boy Lloyd's",
  "address": "201 Florida St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/635ed2ac-932e-11ea-bd67-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=644646795754500076",
  "source": "GoogleMaps",
  "reviews": [
   "We were looking for a restaurant near the Mississippi walkway that was nice but casual and Poor Boy Lloyd's was perfect! I got the shrimp poor boy, and the bread had a nice crispy crust to it without being tough. The shrimp were lightly battered and fresh without being heavy or greasy at all. The sandwich had just the right level of spice to it and was full of flavor. The Mississippi Mud was one of the best desserts I've had in a long time. Staff were friendly and helpful. We had a great visit and will be back.",
   "I'm visiting from out of town and I'm so glad I stopped here! The gumbo was awesome! Loaded with shrimp and crawfish! At least 3 of each in my tiny cup of it! The fried pickles were amazing! The best I've ever had! Spicy but not too spicy, crispy with a flaky batter and still crunchy! Three onion rings looked just as good and I can't wait to come back to Baton Rouge to visit again and try them! The bread pudding was heavenly! And I don't normally care much for bread pudding (but they were sold out of the Mississippi Mudd!) The Community Coffee was the perfect addition to the meal and the staff were all so incredibly friendly! I seriously can't wait to return! 🌟🌟🌟🌟🌟",
   "Ordered catfish and a salad. They brought me catfish and coleslaw but the waitress caught the mistake on her own and brought me my salad. Food was good. Everyone was very nice. Restaurant was clean and cool. Liked it, I would go back.",
   "This place is very good. I would drive to eat here if I were hungry and in the area. Everything is always good and the atmosphere is old school. Good place to eat. Always enjoyable!!",
   "Great food and staff. The onion rings are amazing. Highly recommend if you’re in Baton Rouge area."
  ]
 },
 {
  "name": "Elsie's Plate & Pie",
  "address": "3145 Government St, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63af75ee-932e-11ea-8141-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7986138129953569272",
  "source": "GoogleMaps",
  "reviews": [
   "Let me start by saying that you cant let the exterior of the building fool you, what may almost come off as questionable quickly gives way to an updated interior with a touch of nostalgic history. The building is interior is well maintained, everything was clean, and the staff is immediately friendly.\n\n The food is prompt and fresh from the kitchen and tastes like home, the service is frequent and warm, and the desserts (and pies) are fantastic. They are worth what they charge, and while some of the foods might seem odd, they are well worth trying. Fantastic job and thank you so much for the experience.",
   "Wonderful food and great service!!  We will definitely be back. So many things on the menu we want to try. We went during brunch and just didn't realize how busy they would be. But, our wait was less than they said and the food came out pretty quickly. Our server was super friendly as well. Everything was so good!  If they have the brussel sprouts as a side would highly recommend. Loved the Eye of the Tiger pie so much we almost took a whole one home.",
   "Cute modern place with great food! Just discovered this place and decided to go with my mom. Everything was great. We shared the seafood pot pie and had a side salad that came with it. I liked the dressing that came with the salad as well! The pie was great too. Well come back and try the other dishes.",
   "Excellent experience at Elsie's. It's just one of those places where you know everything is good and you have to limit yourself to one or two things. They pride themselves on their pies and deservedly so. We got the apple pie, which is baked to order. Brunch has some good local offerings but can't wait to come back and try more of the menu!",
   "We love this little place, too bad it's downtown which is way across the city from us. On the rare occasion we are downtown (like once a year) we stop in at Elsies for some fantastic food and service in a casual atmosphere. And definitely save room for dessert!"
  ]
 },
 {
  "name": "TJ Ribs - S. Acadian Thruway",
  "address": "2324 S Acadian Thruway, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63fa8a0a-932e-11ea-b4a2-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6824808276707243941",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome is really all I can say. Visited this place traveling from Michigan to New Orleans. A coworker suggested I stop and try the platter. It was well worth the 1 hour detour coming from a stop in Arkansas. The platter had sausage, brisket, pulled pork, pulled beef, smoked turkey, 1/2 chicken, ribs, red beans and rice, potatoes and gravy, fries, and squash casserole. DELICIOUS...",
   "Besides the AWESOME LSU atmosphere and FABULOUS STAFF, they had the biggest and best fried pickles I have ever seen! The Brisket Quesadilla just melted in your mouth!! Beyond Delicious!!",
   "I never order wings, I’m not a wing person but I tried one from my friend’s order and they were pretty good!  Fun place.",
   "This isn't the same restaurant I went to in the 90's\nI'm afraid that restaurant died with TJ Moran. The service was great, but the food is meh. There was a time when Baton Rouge restaurants served food   that rivaled food found in New Orleans. Those days are gone. This restaurant makes food that rivals food you would find at a Denny's in Missouri. Wheres the passion? Very disappointing.",
   "The food is always good. This last time the food was still good but there was something different about the beef rib. The platter use to have the beef rib included but that changed. Still a great place with very good food and drinks."
  ]
 },
 {
  "name": "Solera",
  "address": "4205 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/644f143a-932e-11ea-8b65-14b31f159f22.png",
  "tags": [
   "approachable",
   "delicious",
   "delicious",
   "food",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=122425640123447526",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious! The gazpacho is summertime in a bowl. But, honestly, everything really was decadent and yet approachable and just plain good. The staff was attentive but not intrusive, full of great recommendations, friendly and knowledge about the menu.  I highly recommend Solera if you are looking for something different or just want to go some place special. This is it.",
   "My son and I stopped in for early tapas dinner on the advice of a friend, and I'm glad we did! We ordered two shrimp small plates (one skewered, the other with fabulous toasted bread) and the potatoes with manchego flaked on top - all were delicious! My pet peeve is overcooked shrimp, and ours were prepared perfectly. I also had a bowl of squash soup which tasted great and had a velvety consistency. Our service and cocktail were excellent. Highly recommend for authentic Spanish food!",
   "This is my fourth time at this new restaurant and everyone I go with LOVES it. The food is incredible. Where are you gonna get tapas like this, I felt like I was in Spain. Tons of options for small shareable small plates plus a regular menu, something for everyone. The whole Branzino grilled fish was a wonder. Paella, vegetarian, all types of things. Amazing. Great cocktails too and the sangria is incredible. Its a must. We just sit and keep ordering tapas sometimes. Great service staff, super friendly.",
   "Solera is something new and fresh in Baton Rouge!  The food is super good -- the tapas offerings are unique and tasty.  They have good cocktails and extensive wines and wine knowledge.  The entrees we have had are also excellent.  We've been twice and haven't been disappointed with anything.  The Romesco sauce is different and so good!   You really need to try it!",
   "The owner greeted me. I had an excellent experience. Highly recommend. Will be back for more!"
  ]
 },
 {
  "name": "The Kingfish Grill",
  "address": "201 Lafayette St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/649c2424-932e-11ea-a7b8-14b31f159f22.png",
  "tags": [
   "tour",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12079194938129402190",
  "source": "GoogleMaps",
  "reviews": [
   "Never having tried Louisiana Gumbo, I ordered room service after traveling from 1am on to get to Baton Rouge, by noon I needed to order lunch. No menu in the room however, went on the Hilton Capital Center to find a brunch menu. Next, called down to place my order, all good so far. Got a call back about half an hour or so later and they didn’t have what was on the menu, and all the prices likewise were different. The food arrived about an hour and a half later, but I also knew they were slammed. The wait was well worth the Gumbo, best Gumbo hands down I’ve ever tasted. I would suggest menu’s in the rooms or directions about room service and menus at check in and update the online menu, it was not terribly difficult to look up, but it took some doing, and then wasn’t correct. The person on the phone was super friendly to ask what else I would like, since what I ordered didn’t exist and brought some extra cokes for the wait and cheesecake. I didn’t order fries but I guess they came with the sandwich, man, the fries were so darn good also! I would recommend their food, the restaurant is highly sought after, so the wait is expected to some degree, but the food is worth the wait, the service was accommodating so if not staying in the hotel for sure make reservations. The Kingfish is set in the Hilton Capital Center Baton Rouge, there’s an inspiring eclectic riverscape circle of cultural sites surrounding your dinning experience. Don’t forget to grab your bowl or cup of gumbo, the hotel itself is well worth a tour, or even a stay if out of town, for a much needed respite, or artistic inspiration. It is a historic hotel, it was left empty for over 25 years, the restoration is magnificent, and it does have a bit of a haunting feel FYI. The hotel was still working on opening old tunnels that run from the Capital Building to under the hotel, from the days of Gov. Huey Long (assassinated in 1935) so I didn’t get to see that part but it should be a cool tour once they complete the excavation.",
   "Awesome restaurant located in the Hilton Baton Rouge.  I went there for dinner and had their Crawfish linguini.  It was fantastic.",
   "Loved it they had breakfast in the morning and the young people where awesome and kind one day ill be back",
   "Went for our anniversary and they did not disappoint.",
   "I loved the drinks. I went to the bar but didn't spend the night there. However, nice ambiance and awesome drinks."
  ]
 },
 {
  "name": "Eliza Restaurant",
  "address": "7970 Jefferson Hwy j, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64eabae8-932e-11ea-8885-14b31f159f22.png",
  "tags": [
   "food",
   "tasting",
   "food",
   "delicious",
   "field",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15556629743052746901",
  "source": "GoogleMaps",
  "reviews": [
   "Adorable place we had lunch at and enjoyed a few different dishes! Very good southern food.",
   "I really had high hopes for this place after seeing one of their dishes in a magazine. It is a fancier type atmosphere prices accordingly. I do not mind paying for quality i prefer quality to  quantity any day. But overall I was let down on our first trip here. The food all looked great and presentation was nice I will give them that.\n\nThe fried green tomatoes appetizer was very good though the remoulade type sauce on it was a bit on the sour side for me especially going on an already tangy vegetable. The shrimp on top were big and cooked perfectly. \n\nI ordered the fried seafood platter with all 3 items fish shrimp and oysters for 25 dollars. I was very disappointed in just about all of it. The catfish had a very muddy fishy dirty flavor that allot of places that serve catfish have but the good places have clean tasting catfish, this place was on the bad side of that but not the worst I've ever had. The oysters were very small and also had a strong fishy dirty taste unlike oysters I get from other places that I frequent,  and the fries were soggy and tasted just like the oysters and somehow even more of a fishy smell and taste to the fries. The shrimp were good, the coleslaw was just ok. Their tatar sauce was also not to my liking. I am much more pleased with I get at other places for around 17 bucks with much better seafood\n\nMy girlfriend got the eggplant and crawfish pasta. It tasted ok but was very dry not much of any sauce on the noodles. The eggplant was way undercooked and the crawfish tails had to be chinese , they were super tiny and hard as rocks kinda rubbery with no flavor. For 17 dollar pasta dish we were highly disappointed I cannot believe they use chinese crawfish tails or if they arent chinese they are the tiniest ove ever seen come from Louisiana.\n\nOver all after tip it was 70 bucks for lunch for less than mediocre food, maybe we ordered stuff they aren't their best dishes but we maybe may not return for another attempt.\n\nIn all honesty I have had much better meals with similar food at casual style seafood and poboy shops with just as big if not bigger portions.\n\nI also ordered a dirty martini on their 1.50 happy hour and it tasted like an entire glass of olive juice with a splash of gin.\n\nIt wasnt the worst meal I've ever had but not near satisfied from a sort of place this is supposed to be",
   "Love it !!! The service was great and it’s very clean ! The hamburger is juicy, the margarita is just right and the fish is fried well! It’s tucked away in a corner with a nice atmosphere. I will definitely be returning here.",
   "was extremely excited about going to try Eliza’s because many colleagues have recommended this gem. But upon arriving today my mind was changed. I went today thinking I was going partake in some delicious food and spirits but that was changed once we met the bartender/ manager. My cousin who like me uses LA Wallet. For people who\nare not familiar LA Wallet is your mobile version of your drivers license. Not a picture but an actual app that we (I) pay monthly for. The bartender/ manager told us that she could not accept the LA Wallet because the owners do not accept it as a valid form if Id. When asked if I can speak to the manager/owner she informed me that she was the manager has the final say. But it’s the tone and matter of fact in her voice that made the situation even worst. It almost made me upset because other people were not asked for proper ID. Was it because we were of a different race. Regardless I will not be returning.  I work in the customer service/ hospitality field for 16 plus years and I’ve  never been more disrespected and discriminated against. If you are not going allow people to use State approved, bill passed ID. I recommend it’s posted. And have your manger have more empathy without being rude!",
   "Been here 5 times now & each time the food has been great. Fried Green Tomatoes were done perfectly and had fried shrimp & house made sauce on top of each was good as well. Bowl of Gumbo tasted really good also."
  ]
 },
 {
  "name": "Chow Main",
  "address": "501 Main St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/653580ba-932e-11ea-911d-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1941761272355569291",
  "source": "GoogleMaps",
  "reviews": [
   "Great staff and nice healthy food but it is pretty bland.  Noodles had no flavor and the chicken was alright.  Some sauce options that you could add from packets or bottles would go a long way here to compliment your food since its healthiness draws away from the flavor a bit.",
   "Best modern Asian fast-food in Baton Rouge! The service is quick, the food comes out fast and is delicious! The Sloppy Zhou is a must-try for anyone who likes Sloppy Joes. This great new restaurant is also fantastic for vegetarians. There are TVs on the wall and yes they have soft drinks and water. The location is literally facing Main Street, just outside of the Main Street Market. The owner, Austin Wong, is here all the time and really gets to know all his customers. Try this place, you'll really like it! Two thumbs up!",
   "Best shrimp tacos ever.  Quality corn tortillas, great flavors in the shrimp and sauce.  Great take-out option downtown.",
   "If you are looking for something out of the ordinary but don't want toempty yout pockets this is is the place. It is a modern twist on traditional Chinese fare. Portions are huge. Service is extra friendly, the go above and beyond to make sure you enjoy your experience. The decor is fun too. Full of flavor and several health choices. Great for vegans and vegetarians. Check it out now!",
   "Awesome, original food and concept. A must if you’re downtown for lunch."
  ]
 },
 {
  "name": "Doe's Eat Place",
  "address": "3723 Government St, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6596190a-932e-11ea-ac34-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=127342879332504416",
  "source": "GoogleMaps",
  "reviews": [
   "There's not many places to get a good steak in Baton Rouge but if you're craving one, Doe's Eat Place is where you need to go. Holy tastebud delight! My steak literally melted in my mouth almost like butter it was so good! Angry Shrimp, Oyster salad, drop biscuits, an 11 ounce fillet and don't forget dessert! You will leave stuffed but looking forward to your next visit 😉",
   "The steak was great! The rest of the food was fine, nothing spectacular. I wish they had smaller steaks available, though.",
   "2½lb Porterhouse... Perfection! Service was outstanding! Best steak I've ever had! Ever! Thank you Doe's!",
   "Absolutely delicious! Steak was flavorful and cooked to perfection. Service staff were friendly, courteous and attentive. It was my first time eating  at Doe's but not my last.",
   "Amazing as always!  Don’t on in the burger. Best I’ve ever had."
  ]
 },
 {
  "name": "Faye's Subs and Salads",
  "address": "311 3rd St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65e8322c-932e-11ea-9fa5-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10767169650824003526",
  "source": "GoogleMaps",
  "reviews": [
   "Very good food, good customer service and friendly and patient employees. Explained the options to my kiddos as we'd never been there before. My only complaint was the music, had my little kids in there and they were playing music with tons of f-words and other garbage language.",
   "I have never once had any topping or meats that was anything less than fresh and delicious and high-quality. eating there, you can definitely sense the pride and love that there is in their craft of making sandwiches.I know that sounds kind of silly, but it's kind of an interesting thing to enjoy if you go there. I highly recommended out of every other sandwich shop in downtown.",
   "This place is terrific...better than any chain sandwich shop hands down. Excellent service and wonderful food. Don't pass Faye's by if you are visiting Baton Rouge!",
   "The subs and salads are fair priced and you get a large portion for your money.  Excellent downtown lunch location with speedy service.",
   "The sandwiches are good. Nice place to go on lunch break"
  ]
 },
 {
  "name": "Fleming’s Prime Steakhouse & Wine Bar",
  "address": "7321 Corporate Blvd, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66361552-932e-11ea-96f3-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11945679139674464575",
  "source": "GoogleMaps",
  "reviews": [
   "Every time I come to Fleming's I sit in the bar. The service is outstanding. The bartender Tyler always makes sure everything is to perfection. Fleming's probably has the BEST happy hour in the city and not just for drinks but also for food. This time I came in I was celebrating my birthday late and I came with my friend and we started off with the Crab Cakes and shared the 35oz Tomahawk Ribeye and got the Fleming's Potatoes and Creamed Spinach for our sides. We finished off with the Chocolate Lava Cake and it was all phenomenal. I highly recommend Fleming's because of the atmosphere, food, and the service I always receive.",
   "We visited this establishment as a continuation of marriage celebration. It was Absolutely Awesome!! The cuisine is soooo Good!! You must try it. We will be returning. My compliments to the Chef and all of the staff. We thoroughly enjoyed our evening here!☺️☺️☺️",
   "Went to Flemings for lunch this past Friday and I had a delicious lunch but the service was not up to Flemings standards. I sat in the bar and ordered salmon with a barbeque glaze and a side of sweet potatoes. When I say delicious I mean it was delicious, but the server / bartender was not up to Flemings standards. She did not greet me and barely checked on me after I ordered. There was one other person sitting at the bar eating lunch and she talked to him just about my entire lunch. Usually the bartenders are top notch at Flemings. I have been going there for 12 years and the last 2 times the food was excellent but the service was mediocre to bad. This is why I'm giving a 3 star rating.I don't want to see one of my favorite restaurants go down because of bad service. When you're paying $40 for lunch for one person - the food and service should be top notch and a 5 star experience.",
   "Had curbside service from Flemings tonight and the food was fantastic.    Everything was cooked to perfection and tasted delicious .   Get out there and support your local Flemings.",
   "Wow. I haven't had a meal experience like this before! The service was impeccable, very friendly and attentive. The bread was done of the best I've ever had, crusty and soft. I had the Sunday special, three-course filet and lobster, ceasar salad and key lime pie. Incredible deal for INCREDIBLE food! I am so grateful to God for such wonderful experiences. Praise the Lord!"
  ]
 },
 {
  "name": "Tsunami Sushi Baton Rouge",
  "address": "100 Lafayette St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66898278-932e-11ea-9db7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "drink",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=17865990570120227376",
  "source": "GoogleMaps",
  "reviews": [
   "Can't say enough good things about this place!  Incredible food.  Incredible view.  Great vibe!  Never disappointing.",
   "The service is always excellent and accommodating. Taylor was our latest great waitress. The baked salmon should be named crab surrounded with salmon. Great lunch.",
   "In planning a birthday dinner for my daughter, I reserved a table of ten thinking it would be to our advantage.  Getting to the restaurant our table wasn’t ready, the food was extremely slow to come out while orders weren’t correct, and finally our bill didn’t reach their “minimum” of $350 for a group booking. I had to pay $350 even when our ticket was under 200!  Moral of the story...don’t make a reservation for a larger group!!  Tsunami put a damper on our celebration. We should have gone elsewhere-",
   "I had such a wonderful sushi lunch here ! The food was delicious! The service was friendly and attentive. The GM even took the time to come check on me and my experience. Aside from all that, there is no comparison in the category of atmosphere in Baton Rouge! That river view skyline is incredible! Food & Drink: I had the Green Monster roll and it was DELICIOUS and refreshing!!! Their cocktails are delightful too. I don't even want to attempt to type the name but it started an F lol! One of my favorite sushi restaurants in Baton Rouge.",
   "i dined here one evening while in town for business. i was seated very quickly upon arrival and the waitress was very attentive and nice. i ordered some soup and then ordered the sea bass for my meal. the sea bass was amazing. one of the best tasting meals i have had in a long time. however, i was very shocked when my bill came and the market price for a piece of fish was $48... considering i have had a bunch of sea bass, and i know it's one of the more expensive fish, i was shocked to see they were charging roughly $50 for about 5 oz of fish. other than that, the meal was great and i would be back. i loved watching the sunset from up top over the river"
  ]
 },
 {
  "name": "Beausoleil Restaurant & Bar",
  "address": "7731 Jefferson Hwy, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66cca71e-932e-11ea-a2f7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=503195363286832901",
  "source": "GoogleMaps",
  "reviews": [
   "A nice French cafe vibe offers excellent service and truly outstanding cuisine. It may be on the pricey side for some, but you do get what you pay for. Take a chance, you won't be sorry.",
   "Food and atmosphere for both wonderful. This is a fine dining establishment and priced accordingly. The 14 oz bone in rib eye was fantastic mushrooms and sauce compliment it perfectly.  V Pan roasted chicken breast was slightly crisp on the outside and super tender on the inside with the pesto butter was outstanding. We did not care for the cabbage it was a bit tart sort of a vinegar flavor. The crawfish fries for the appetizer was also delightful. The oysters Rockefeller soup Was enjoyed immensely by both of us comes with a  Fried oyster on top. The white chocolate bread pudding and the chocolate pot de creme was probably 2 of the best desserts we have ever had had a restaurant.  We had very good service and all of the courses came out perfectly timed",
   "What a great meal. The entré was duck with spaetzle and tomato jam. The sauces were excellent. The brussels were fried, and had a sweet molasses style glaze. The shrimp and gnocchi was simply excellent. The peanut butter cake topped it off. We got the cake togo because we were so full after dinner. The cake was excellent!!",
   "Wait staff was nice and attentive. Food was cold. Would expect that not to be the case for an expensive restaurant.",
   "Great food. Blackened Gulf fish was well presented and very flavorful. Craft cocktails are top notch. Definitely worth coming back."
  ]
 },
 {
  "name": "Frank's Restaurant",
  "address": "8353 Airline Hwy, Baton Rouge, LA 70815, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6713002e-932e-11ea-a96f-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3568902824645017344",
  "source": "GoogleMaps",
  "reviews": [
   "Frank's on Airline has been a constant for us for a couple months now. We go for lunch often throughout the week and have never had a bad meal. The staff has always been almost as good as the food! (Joking) We love it and think you will too. 😁",
   "The prices are a bit steep but the amount and quality of the food you get for the price is definitely a bonus. You can just go to cracker barrel up the road a bit and get almost the same thing but at cracker barrel you won't get the amount, quality or hospitality that you will at franks. In my opinion id rather pay a little more money and get a better overall experience then go the cheap way out.",
   "The food was good. The chicken livers and gumbo were delicious. The corn poppers were my favorite. The shrimp poboy was a little dry. If I went back I'd request it to be grilled instead of fried.",
   "Awesome. Great family oriented restaurant. The staff always greets you with a smile and a hello. The food is the best by far. It's like being at home with family. I highly recommend this place for breakfast and lunch. Just a good ole hometown feel with great service and great food.",
   "Great food great service. The server that helped us, I think his name was Kory, was very helpful. I had the Atchlafalya benidict, OMG it was awesome. Alligator sausage was so good we bought 3 lbs to take home to Georgia. My husband had the seafood grand omelet. It was very good as well.  So glad we stopped for breakfast. If we ever come back through we will stop at Frank's."
  ]
 },
 {
  "name": "George's",
  "address": "2943 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67636b78-932e-11ea-ac9c-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2655078956872981378",
  "source": "GoogleMaps",
  "reviews": [
   "Bomb local spot in Baton Rouge. Been coming here for years. Food is on point and excellent service to match. Super laid back atmosphere. They also have weekly specials, this is the Oysters Acadiana 😋🤤",
   "Had a great time here. We're from New Mexico and it was really fun",
   "Great service and great food! Will definitely be back",
   "Fun, quirky establishment! Servings were big & very tasty.  Worth trying....worth going back!",
   "Small but nice. Sweet girls behind bar. Loved the fried fish. Go LSU!"
  ]
 },
 {
  "name": "Chow Yum Phat Overpass",
  "address": "2363 Hollydale Ave, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67c78654-932e-11ea-8f99-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "knowledgeable",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9774025007095540185",
  "source": "GoogleMaps",
  "reviews": [
   "They were nice enough to give me the curry fish during lunch time and it was good! Could be a little less salty though imo but would def give it a try.  4/5 taste wise but 5 stars for Google would go again.  Glad to have more Asian food in BR.",
   "I love this place. Just took my family there. The service was great and the food fantastic. Definitely recommend.",
   "Amazing and SO romantic! Best ambience in town! EVERYTHING is good!!!! Wings, and cauliflower are above and beyond, though.. OMG! Baos at lunch are phenom (and only available at lunch) so don’t think you’re missing out by not making it to dinner.. The manager (Kyle) is also wonderful, super knowledgeable, and will make everything feel as if it’s going to plan despite the restaurant being super packed. 10/10.. will visit again!! Baton Rouge needed this one!",
   "Great ramen spot!  Featuring dumpling and Bao.  Vegetarian options available as well.",
   "We have eaten here several times since it opened and been extremely pleased with the quality of the service and the exceptional quality of the food! The ramen bowls are all delicious (Oskar is my personal favorite) and the pork belly fried rice dish is smoky and amazing. Also, be sure to try the cold sake or a specialty drink. There is a very nice outdoor seating area where we were able to bring our dog. I HIGHLY recommend this restaurant to anyone from or visiting Baton Rouge!"
  ]
 },
 {
  "name": "Kalurah Street Grill",
  "address": "2857 Kalurah St, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6815f5f8-932e-11ea-b897-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11249469238737250477",
  "source": "GoogleMaps",
  "reviews": [
   "Simply amazing! Went here for my birthday and was not disappointed! I had the fried chicken with greens and my wife ordered the shrimp scampi. Appetizers we shared lamb meatballs. Highly recommend",
   "Definitely an intimate date setting or formal business meeting dinner type of feel. The lighting is dark inside, and the music is softly playing in the background. I came here with a group of old friends, and we had great time! The food and service were impressive! I ordered the fried chicken with collard greens and cornbread. I have to admit, these were the best collard greens and fried chicken I’ve ever had. However, the location of the restaurant was hidden and somewhat hard to find. The prices were a bit more expensive than I was anticipating considering the location of the restaurant.",
   "We frequent K Street for dinner and drinks and always have a wonderful experience. When my 16 year old son asked where to take his Valentine date, Kstreet was the choice. I appreciate the respect they gave a 16 year old as they created an experience that impressed his date.",
   "Good atmosphere, good service, but the food did not taste very good. Not good dishes compared to the price.",
   "Went there last night and had the best customers service we had, had in a while! Darien was extremely knowledgeable about the menu, great with the wine, and fantastic with all of the recommendations he gave. Our first impression was solidified when he became our waiter. The food and drinks were SUPERB that  would we would visit again, but his customer service definitely knocked it out of the park for us!!! "
  ]
 },
 {
  "name": "The Gregory",
  "address": "150 3rd St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6861cd5c-932e-11ea-8c28-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "drink",
   "food",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11397794820027845373",
  "source": "GoogleMaps",
  "reviews": [
   "Great dining experience! We made reservations for my sisters 45th birthday. The food was delicious, presentation was awesome and the staff was excellent. If you're looking for a delicious steak in Baton Rouge with a great ambiance this is it! Ember was our server and provided QUALITY service!",
   "The Gregory is located inside the lobby of the Watermark Hotel. There is plenty of parking nearby. We dined in for dinner for Valentine's Day. The atmosphere inside is wonderful. I ordered the steak and my wife had the duck. While the steak was underwhelming, the duck was incredible. The drink selection rotates and features mostly local brands. The craft cocktails were delicious. When I am in town for another holiday I will definitely consider coming back.",
   "Food was very good. The decor is nice and there's a persistent subtle goose theme to the restaurant which is kind of endearing even though geese are vicious. Found the drinks to be too sweet, but otherwise a great experience.",
   "Incredible place, really. A gem of the city. Have eaten here three times and haven’t been disappointed yet. I will say the wine prices are a bit pricey... ($12-25 per glass?!)",
   "I absolutely loved visiting the gregory. It is located inside the watermark hotel. The building used to be the old Louisiana national bank and it still remains inspired from its history. Every thing is marble and the basement  includes 3 vault style conference rooms."
  ]
 },
 {
  "name": "Christina's Restaurant",
  "address": "320 St Charles St, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68c731d4-932e-11ea-9377-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12617318442482386984",
  "source": "GoogleMaps",
  "reviews": [
   "Christina's was easy to find with google. I arrived at opening so there was no wait. I was greeted by friendly staff. I picked my table.  Annie was my server and is cordial. I ordered two eggs scrambled, grits, bacon with wheat toast. I must say, this is my second visit to Christina's and the food is still DELICIOUS !!! Everytime I am in Baton Rouge, I will dine here.",
   "This was a great spot for lunch. Went after touring the Old Governors mansion. Great selection of menu items and good lunch specials. Had the catfish special on a Friday. It was nicely done. The wife had a grilled chicken. The southern sides and sensation salads made the meal.",
   "A very well-known, local restaurant, and the food is high-quality and cooked to perfection. My first time here today, went to pickup lunch for my office. It's a small place. It's hot lots of character and history in it. Parking lot in front is small, so there's a side lot for parking just on the side street. Very happy with my experience. I will be going back.",
   "Great lunch eatery.  Fast and friendly service.  Large portions.  Great dessert!",
   "Great little breakfast spot in Baton Rouge. The staff were so welcoming and the service was great! We ordered omlette, french toast, eggs, and all the sides."
  ]
 },
 {
  "name": "The Chimes East",
  "address": "10870 Coursey Blvd #4019, Baton Rouge, LA 70816, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6911aa8a-932e-11ea-b58a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=380680217929063671",
  "source": "GoogleMaps",
  "reviews": [
   "One of the waitresses in The Chimes on Coursey was very RUDE because I used a chair from an empty table to sit my purse on. This was during the very early part of lunch hours around 11:30am where traffic in the restaurant was sporadic.  The waitress came over, while my friend and I were conversing and spoke with my friend inquiring if it was her purse in the chair. I informed the waitress that it was mine and she asked me to remove it. I informed her that I'm not a rude person and if someone comes and need to sit in that chair I will remove it.  I asked for the manager and another waitress. The manager came over, very RUDE, to say the reason the restaurant needed the chair was to hold it as a placement. Again I informed her that I'm not rude and since the hostesses are placing other customers upstairs, it shouldn't be a problem. The manager then proceeded to bring me a mangy chair from the back of the restaurant to sit my purse on. I declined her offer, so she sat the mangy chair in public view in stead where the other chair was. I inquired to my friends if they wanted to leave but they refused to let anyone drive them away. The replacement waitress name was Chloe. She changed the whole atmosphere with her pleasant attitude. She said that she's a server and she's there. at The Chimes on Coursey, to make sure the customers have a great experience. The kicker of this story was that a group of 4 came and sat by us, remember I have the extra chair, one of them noticed the chair was missing as I was trying to place it back,  the lady politely shook her head no, and got the other chair by an empty table. The lady said if someone comes by looking for it, they'll give it to them. However when the waiter/waitress noticed that the chair was missing from the empty table nothing was said. The prior waitress or the  manager didn't apologize for their rudeness. The food was very delicious, as it WAS one of my favorite go to places. But the professionalism on that day of January 25, 2020 was very devastating, demeaning. and unacceptable. I will not go back and spend my hard earned money at The Chimes to get demised and humiliated...",
   "Awesome Cajun food here. Place can get very packed so make sure you come here at certain times. Especially when there’s a busy bar at the place. The food is very tasty, flavorful and filling. Definitely recommend giving this place to try if you’re in town.",
   "Everything was awesome. My food's quality was consistent with how it always is, and my waitress was great as well. The atmosphere was inviting and friendly. As usual, the upkeep was up to par, so I have \"0\" complaints about any aspect of my visit. Both my cousin and I had a pleasant experience dining and visiting at this establishment.",
   "The food was delicious and a lot of food was provided. The chicken wings are some of the best. The salmon plate was incredible and the grilled chicken breast was amazing. I honestly couldn't believe the price for the quality and quantity. I'll definitely be back here to eat soon!",
   "This place is the mac daddy. It is by far one of the finest establishments in the country. The craft beer selection is a 10 +. The menu is loaded with Razzle Dazzle and the food quality and taste is absolutely exceptional. All of the bartenders are super friendly and attentive. The decor and environment is outstanding. The bourbon and liquor selections behind the bar seem endless. You cannot go wrong picking this place for a nice dinner or drink."
  ]
 },
 {
  "name": "Maison Lacour French Restaurant",
  "address": "11025 N Harrells Ferry Rd, Baton Rouge, LA 70816, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69679430-932e-11ea-a752-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=12668728689663242327",
  "source": "GoogleMaps",
  "reviews": [
   "My parents, Terry and Joyce Ryder treated us to Maison Lacour curbside tonight. Just absolutely amazing. Every single thing we ordered. Please help support our local restaurants during this crazy, uncertain time!! The food was fabulous ❤️❤️",
   "Great lamb chops",
   "Wonderful food, wonderful service, perfect setting. We will be going here on a regular basis. This Restaurant makes me believe that there is hope for Baton Rouge's food scene. \nReservations required for dinner and they are closed on Sunday and Mondays.",
   "Best restaurant in Baton Rouge in my opinion. Food quality is unmatched and great service also. A very good and affordable wine selection too.",
   "Hidden French gem in Baton Rouge."
  ]
 },
 {
  "name": "P.F. Chang's",
  "address": "7341 Corporate Blvd, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69b1bdec-932e-11ea-907e-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9691160731486750460",
  "source": "GoogleMaps",
  "reviews": [
   "PF Chang's is consistently a great place. Especially if you have an open mind to plate sharing. \n\nToday I got the Mongolian Trio for my entree.\n\nIt's an off menu item, but they are kind enough to do it from time to time. \n\nOf course we started off with the lettuce wraps, but I was unable to get a picture before we devoured them.",
   "Food was pretty good but just a whole bunch of vegetables that takes away from the main dish of Sesame Chicken. Tried the Moonstone Asian Pear as it was good. The waiter at the bar was very attentive and polite. All around good place to drink, eat and chill. Nice atmosphere",
   "The restaurant looks good but the menu is quite weak.  The portions are among the smallest and the taste of the food is completely lacking.  I took Mongolian Beef which was just fried meat with onion, just so, without any taste.  I was upset because the menu was past the price for lunch and normal price.  I went to lunch and I was charged the high price.  I do not recommend this place.  There are many other city-specific restaurants on a much higher level.",
   "My family really enjoyed the incredible meal at this location although the new Brussel Sprout dish was a “hate it or love it” only.  This dish is very tart.  They also have a nonalcoholic Ginger Beer that will make you want a refill. The atmosphere was pleasant and the service was great. This will be a place that I would recommend returning to again and again.",
   "We just had dinner here, and we had an enjoyable and pleasant experience. The service is always great, from the host to the servers, everyone works together to get the job done. My husband ordered the Salmon with the glaze on the side. The team in the back realized they made the Salmon wrong. After a very brief delay, the chef himself brought out the correctly prepared Salmon just as my husband ordered it and he apologized for the error. Wow! I have never seen that before. Talk about great customer service!! Everything was cooked to perfection. Our waitress was so attentive and nice.We drove over 1 hour to eat here and it was worth it!"
  ]
 },
 {
  "name": "La Contea Italiano Ristorante",
  "address": "7970 Jefferson Hwy ste f, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69f5a5f4-932e-11ea-8d39-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "affordable",
   "food",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=4762424495624116692",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is exquisite! It's apparent they use all fresh ingredients. The food didn't come out quickly but, we didn't wait long either. They pay attention to detail with their food & take the time to make sure it comes out properly to the coustomer. The cocktails we had were presented beautifully &, tasted very good. The alcohol per mixture ratio was perfect. The atmosphere is very clean & elegant. The prices are high but if, they continue putting out excellent food & service. I don't have a problem with it. I can honestly say, this is one of the best Italian Restaurants I've ever eaten at. I Will be back.",
   "EXCELLENT !!!! VERY GOOD AND AFFORDABLE PRICES, VERY GOOD FOOD. I enjoyed the atmosphere. The staff very friendly and professional. The food was so far THE BEST I ever had in Baton Rouge. I will definitely come back again. I love it !!!",
   "Quite a wonderful experience, the staff was inviting and friendly. The dining room had a subtle elegance with the circular shape and the lighting gave it a romantic level of class. Each table was set and ready for you to enjoy some of the best italian food I've had in the Baton Rouge area. The food came out timely with filling portions and with quality that rivals places like the Little Vilage and other similar joints. A very nice choice for a special night with a loved one.",
   "I have eaten here quite a few times now. The service is always great. They checked on us a few times throughout our dinner and even poured our wine for us. Prices are especially reasonable considering the atmosphere and the quality of service and attention provided to each table. Modern design aspects that don't take away from a great feel of an Italian restaurant. Went on a Saturday night and enjoyed live piano music! Definitely returning for more great experiences.",
   "Eggplant parm, Italian cream cake for dessert. Delicious! Great service. Will definitely come again."
  ]
 },
 {
  "name": "BLDG 5 Market | Kitchen | Patio",
  "address": "2805 Kalurah St, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a55f022-932e-11ea-b19e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3806438233219604823",
  "source": "GoogleMaps",
  "reviews": [
   "I came across BLDG5 after looking for prepared meals for pick up. The menu looked awesome and during these times it is difficult to find a healthy, well rounded meal from the grocery stores. Many are picked over and being 34 weeks pregnant my only trips are to my OB appointments. My husband and I ordered lunch from the regular menu ahead of time - he ordered the original chicken sandwich and I ordered the short rib sandwich. It was by far the best sandwich I have ever had. My husband also raved about his sandwich. We ordered the blueberry lemonade and it was very tasty. My husband told me pick up was easy, he stayed in the car, called ahead and they brought everything out to him. We also ordered frozen meals and a prepared meal. It was delicious. We heated up the food per the instructions and everything tasted great, all while getting the vegetables we have been lacking and proteins. Thank you to Amber for assisting with ordering ahead. She communicated quickly to me and  I really appreciated BLDG5 being able to make the frozen meals requested that were not in stock at the time. They really went above and beyond. We look forward to these times passing and being able to have a date night here, hopefully sooner than later!",
   "Beautiful setting! Great patio with lovely outdoor seating. The drinks are great - well balanced and interesting. The boards are a lot of fun - great way to share a meal. Lots of options on them, with some delicious sauces. Highly recommend!",
   "The best (and I mean BEST) vibes in Baton Rouge. Nuanced + classy design and feel, the cocktails are off the charts top-shelf, and the food is remarkably phenomenal. Easily my favorite place to eat in BR, thank you Misty and the whole team for realizing such an excellent vision in our city!",
   "Amazing dinner last night.  Food is delicious.  The dinner boards are a great idea. Going back soon.",
   "Fantastic restaurant all around! Food was delicious and well prepared, cocktails were tasty too! Atmosphere is exceptional and the wait staff and owners were friendly and informative. Can’t stop thinking about this place - excited to try other menu items soon! Thanks for 3 years of hard work w this plan - it paid off, BLDG5 is outstanding!😊"
  ]
 },
 {
  "name": "BRQ Seafood and Barbeque - Takeout Available",
  "address": "10423 Jefferson Hwy, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ab10a3a-932e-11ea-8fc6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2452558490012545311",
  "source": "GoogleMaps",
  "reviews": [
   "The pickles! Reason enough to visit. We have sampled all the BBQ options at this point and nothing negative to say. Same for the 3 or 4 non-BBQ items we've had so far.",
   "The food. The location. The decorating of the building. The service. AND the location. Just love telling people about this spot!\nYou're welcome! ☺️",
   "Really great meal. Everything we had was delicious from the pulled pork to the ribs to the Mac and cheese to the catfish and the sauce selection they bring out is really tasty (I liked the mustard one best!) the hush puppies were a great starter.",
   "Delicious food, portion is huge and free potato chips and pickles! I ordered sliced brisket and smoked peas. I definitely recommend. It's close to I-10 if you are just thinking about having a quick lunch like we did.",
   "The first time I went to this place not long after it opened, I really enjoyed it. The meats had excellent flavor and were cooked very well. On the most recent trip, the flavor was still there but everything was dry. I used a fair amount of BBQ sauce to help with that but there's only so much you can do. For the price, I expected better"
  ]
 },
 {
  "name": "Stinky's Fish Camp Baton Rouge",
  "address": "5500 Hilton Avenue, First Floor, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6af455e8-932e-11ea-80d9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17803109510549890306",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome experience dining here for it first time. Many have read my reviews of other restaurants and know I'm picky. Stinky's gets high marks in all areas. The restaurant was clean, the staff friendly and the food was on point. I had an oyster basket and my wife had the shrimp basket. Both were cooked to perfection with just the right amount of batter. My oysters were plentiful, served with a small container of coleslaw which was a different recipe than most places, it had pineapple, and was delicious (I wished there was more of it). There was also a generous portion of french fries that were an interesting cut, not too thin not too thick, also very good. We ordered a side of mac-n-cheese, which was a great move, best I've had in a restaurant in a long while. All-in-all, you can't go wrong here.",
   "We went for Happy Hour half priced oysters. The waiter took the order after 10 minutes the manager (I assumed)\n came to the table with drinks. I had a question about the oysters, when I asked her she said we don't have any oysters. My waiter never told us this, so we really were waiting for nothing. Then the manager said well since you have already been waiting let me see what I can do, comes back in 5 minutes to say, \"Yeah we're out.\" \nThat's confusing! If you knew you were out why would you say you'll see what you can do?\nThen I remembered she said they were out of Happy Hour oysters, so I wondered if I was there outside of Happy Hour would they miraculously have oysters again?!?!?\n\nMy son's pork nachos were good however.",
   "Since we were staying at the hotel, we decided to dine there for dinner. Service was pretty quick and our waiter was helpful. The only issue I had was my catfish was quite salty. Also my dessert was frozen so if I knew that, I probably would have picked something else. Overall it was not bad.",
   "Amazing food! They were a little slow for it not being very packed in the resturaunt, but the food made up for that. Great aesthetic.",
   "We stopped here purely because of the name. We enjoyed the food and the service was friendly. Boyfriend ordered the “shoyster” po boy and I got the shrimp and grits. We also tried the oyster shooters, that was an experience to say the least."
  ]
 },
 {
  "name": "Jolie Pearl Oyster Bar",
  "address": "315 North Blvd, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b3c83c6-932e-11ea-95f6-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "library",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15726880135478437175",
  "source": "GoogleMaps",
  "reviews": [
   "What a great place with outstanding oysters! We were craving fried tonight and Jolie hit the spot! It's kind of like a oyster sport bar if there is such a thing. I got a po-boy and the better half got a salad. We'll for sure be back to try out some of the other items.",
   "Walked in about an hour before close and 5 STAR SERVICE AND FOOD! Definitely one of the best spots for date night or even group gatherings!!! Drink menu is awesome and best bloody Mary in town. Definitely will be home for our love of oysters!!!",
   "This place is great and has very good service. The food is ok. The oyster selection is good, the atmosphere is good, and the prices are good. The three start eating is due to cleanliness. Clean your outdoor tables at least once a week, please. I've been to this location a lot and go because the outdoor seating is right across from the library. I love the decor inside, and I'll keep going back, but I shouldn't have to clean my own table.",
   "Get ready if you really love oysters - these are the best I've tasted in a while! I had 4 of the Brie and Bacon and 4 house style chargrilled - the seasoning and preparations were delicious, but the oysters themselves were astounding! They were lush and fresh and juicy and cooked perfectly - I was so in awe that I took a close-up photo for you! The ouster was beautifully intact and firm, gorgeous and delicious. I washed it all down with yummy grapefruit margarita. The service was great, even though the lunch server was by herself. I wish I worked downtown! Highest recommendation!",
   "I've never seen such big oysters in my life. Soooooo good!"
  ]
 },
 {
  "name": "Warehouse Restaurant",
  "address": "12328 S Choctaw Dr, Baton Rouge, LA 70815, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b82c9e4-932e-11ea-a2d7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10284182684936674001",
  "source": "GoogleMaps",
  "reviews": [
   "Unassuming place serving comfort food for breakfast and lunch. Daily specials are great. You won't leave hungry. Or broke!",
   "Great breakfast, very friendly staff and I shall return",
   "If you miss mother's home cooking then you won't be disappointed when you dine here! I would recommend to anyone to skip the fast food restaurants and give yourself a treat at Warehouse restaurant.\nThis place is clean, friendly and offers a generous serving with a friendly price.",
   "Great lunch, very friendly waitress/server, thank you Wanda!",
   "We have been eating here for years!  Always consistent food. Breakfast is the best in town"
  ]
 },
 {
  "name": "El Magey Mexican Restaurant",
  "address": "8290 Siegen Ln E, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6bccf3ba-932e-11ea-bcba-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "hospitable",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13713689723074767042",
  "source": "GoogleMaps",
  "reviews": [
   "Very good food with lots of variety and at a fair price. The setting is humble but clean.  Friendly staff and sweet Mama Gwen seating the guests. All you can eat at $13.95 for adult dinners.",
   "I can't say enough good things about this place.\nThe food on their buffet is so tasty and fresh.  \nRanchero beans!\nI don't live in Louisiana any more but any time I am there for a visit, this is a must.\nI travel extensively in the US and have looked for something that equals this and never found it.",
   "One of the best Mexican buffet's I've ever had.  All food was fresh and outstanding.  They even had ridiculously good BBQ ribs on the buffet for lunch.",
   "I was extremely pleased with this place. Every dish was just as good as the last with a surprisingly big selection. Very reasonably priced (especially since everything was so good) That's not to mention the hospitable service from start to finish. Will be coming back and highly recommended to try.",
   "This food is so delicious and well seasoned. Also VERY, VERY CLEAN.  This is one of the Cleanest Mexican Restaurants I've been in.  I wish yall  sold Margaritas.  I had a girls party that wanted to come but they didn't come because there were no Margaritas.  So I will bring my hubby next time."
  ]
 },
 {
  "name": "Capital City Grill",
  "address": "100 Lafayette St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c1373f6-932e-11ea-bb29-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14518483575567913548",
  "source": "GoogleMaps",
  "reviews": [
   "We visited Capital City Grill on a Saturday evening and made sure to check the closing time, 10:30pm, before we arrived since it was a bit late-9:00pm. There was a large party finishing up and another table was seated after us, so we didn’t feel bad about it being too late. \n\nWe ordered drinks and I had my heart set on something small like an appetizer of fried green tomatoes! Unfortunately, the tomatoes came out soaked in a melted sauce that made the breading soggy and unappetizing. I was able to eat one that was resting on top, but the others I couldn’t eat and the breading fell off. The really nice server took the appetizer off of my bill, so I was thankful for that great customer service. Our table ordered the seafood pasta and grilled chicken dinner. Both meals were ok, but we felt that the quality of the dish didn’t match the prices. \n\nThe restaurant was really nice and cozy, clean bathrooms and a really friendly server. I would go back and try again during a lunch hour.",
   "What a blast! Great place to meet with friends on a Friday evening and be able to have a nice conversation, it's not too loud but great atmosphere.  This place has excellent service and food. Highly recommend the tuna. It also has an excellent location close to rue Lafayette .",
   "Had an awesome time with friends during our company dinner last night. Saw at least two happy birthday party at the restaurant so this is nice.\nPros: Excellent spot in downtown with a lot of customer and The staffs are attentive and very nice. The food is pretty decent and the speed is not a wait at all. The atmosphere is really awesome. The restroom is clean and they are not busy even on Friday. They offer wine and beer which is awesome and everyone loves it. What I like most about this place is the waitress service\nCons: It is hard to find a parking lot on downtown at night especially on the weekends. You may need to reserve a table before your meeting.",
   "A SPECIAL TASTE OF DOWNTOWN BATON ROUGE. LOVE THE FOOD AND SERVICE",
   "Honestly, I'm not normally a fan of this restaurant. I don't find it has enough variety with good size portions for lunch or supper....BUT their brunch is absolutely amazing! Splurge! Go for the seafood omelet. It is so yummy! The sauce with the crab...amazing! The mimosas are good, but not really that great of a deal in my opinion. They make you think it's all bottomless, but each glass of juice costs extra...but again that omelet, so worth it!"
  ]
 },
 {
  "name": "Superior Bar & Grill MidCity",
  "address": "5435 Government St, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c5d7676-932e-11ea-b081-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5489211623863817118",
  "source": "GoogleMaps",
  "reviews": [
   "Love it here! Been coming here for over 16 years. Always had Benny as server, always have a fresh, delicious lunch! Salsa is always great! All friends/family I brought over the years love it and always ask to go back. If you love authentic Mexican, this is best place in town!",
   "The ambiance and aromas that hit you upon entering the front door is akin to winning the sensory lottery. This place just looks and smells authentic and amazing! Chips and salsa come out right away and are always really fresh and delicious. Margaritas are AMAZING, strong, and able to adjust any given attitude on any given day. The chicken fajitas are by far my favorite dish here. Queso is also fantastic! Give this place a try and see why I call it a FIESTA for your taste buds!",
   "My all time favorite spot, nice dim setting, amazing food its always hot and tasteful. Great drinks. Great service. Nice people. Good spot for the whole family to enjoy.",
   "This was our first time at Superior Grill. Let me start off by saying that Mexican cuisine is not my favorite. I only came because my wife loves it. I'm absolutely blown away by how amazing the food and service is here! I ordered the Fajita Steak Tampiquena and my wife ordered the Superior chimichanga. The steak was simply amazing! The marinade is delicious and it was cooked perfectly! My wife said \"This might be the best Mexican food I've ever eaten!\" and I'm going to agree with her. You owe it to yourself to try this place if you have never been!",
   "Ordered 4 margaritas and 2 chicken fajitas Togo. It cost me $142. There was a service charge of $17 that I was not informed of. And on top of that I tipped them an extra $10. I got home with my food and drinks and found out I had to tortillas, no salsa, and no chips. I even asked the person who brought it all out of it had tortillas and he said yes. How do I get fajitas with out tortillas? At least the drinks were good."
  ]
 },
 {
  "name": "Crawford's Restaurant",
  "address": "1980 Staring Ln, Baton Rouge, LA 70810, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ca6dcc8-932e-11ea-ad7f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "hospitable",
   "food",
   "food",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16819242836625509311",
  "source": "GoogleMaps",
  "reviews": [
   "Average at best. The food is consistent and if you visit when its busy you will understand the average age of its customers. The sides dont stand out and the gravy looks and tastes like the powder packet from the grocery store. My hangup is the dining area. I personally made the decision to no longer dine in. The chairs and the tables dont look to be regularly cleaned or replaced. Even the napkin dispenser was dirty.  Yes, it's been here for a long time but that's not an excuse for not keeping things presentable.",
   "Me and my Pops heard about this amazing home town restaurant from a local, we are out of town from Texas, wanting some delicious food on our way back home from NOLA.\nWe came here, and were greeted so kindly, with patience and delight.\nThe staff is incredibly hospitable, and whoever is cooking the meals, you can truly feel the love, care and pride in every bite.\nIf you are looking for some fantastic home cooked food that taste like your grandma is in the kitchen, come here. You will not be disappointed!!!",
   "My first visit and the food was wonderful. I forgot to ask her name but the server was great. The grits were the best I've had in years. They cook over medium eggs just right. I highly recommend.",
   "My two kids and I dine in here today. The waitress was very warm and polite, and quite patient as well. This place makes you feel like your right at home! The welcoming service was speedy without missing the homestyle taste!",
   "A true feast!  Did not disappoint.  Friendly service, and free ice cream for the little ones."
  ]
 },
 {
  "name": "Bonefish Grill",
  "address": "7415 Corporate Blvd, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ced83fe-932e-11ea-8a5a-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6456664734232984149",
  "source": "GoogleMaps",
  "reviews": [
   "The servers were nice and our primary server was kind and funny. It is a bit expensive but it had a great atmosphere that makes it worth the try. The food I got was good but not as worth the price in some cases and that's the only reason I'm not giving 5 stars.",
   "Awesome experience! Our waiter Jacob was awesome. Not only was he a great waiter but he was also a bartender so I didn't need to wait for someone else to fix my drink. No complaints.",
   "So, the service here is impeccable! Pam has made my experience so great, she is a very friendly person and she's definitely fit for this line of business, she makes me want to order furniture and move in! Thanks Pam!! Friendly staff, great food! I would definitely recommend this place to close friends, family & colleagues!",
   "The Next Best Thing Other Than The Food And Atmosphere Would Have To Be The Servers. My Girl Pam Does An AMAZING Job!!! It’s Never A Dull Moment When Me And My Friends Come In, She’s So Full Of Joy And That’s What I Adore Most About Her. So If You Just So Happen To Take A Trip To Bonefish, Make Sure You Ask For Pam Trust Me You Won’t Regret It!!!!!!!!!",
   "So freaking good! Excellent service. Had the coconut shrimp, salmon, and key lime pie! Off the chart. It was my first time to try Bonefish Grill but “I’ll be back!”"
  ]
 },
 {
  "name": "Stab's Prime Steak and Seafood",
  "address": "7666 Jefferson Hwy, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d345274-932e-11ea-bbcf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1765566781250613970",
  "source": "GoogleMaps",
  "reviews": [
   "If you need an amazing place to go for an anniversary, date, or just to celebrate a special night out, I would suggest Stab's Prime. My husband and I enjoyed the atmosphere and the food was amazing! Delicious steak, lobster topped mac & cheese and Asparagus... and to finish it all off with a skillet cookie topped with ice-cream! Dustin was our waiter and he was phenomenal! Highly recommend :)",
   "My absolute favorite for a quick cocktail and delicious meal on my lunch break! My go-to cocktail is a new fashioned (updated old fashioned) and their yummy seasoned fries... and then I’ll add different entrees each visit. Sonya, Jeff, and Allie are beasts at the bar!! I’m never disappointed here!",
   "Wow.  Best steak I have ever had, hands down.  Cooked to perfection.  The drinks were strong and the service was impeccable.  Make sure you are dressed.  We were not planning to have dinner the night we went, so I felt a little out of place.  I'm pretty sure they seat people not dressed to their standards in the bar...lol... no matter.  We had a great dinner and honestly, the lounge is more my speed anyway.  They had a guy playing the piano, quick access to drinks, and a TV so my husband didn't miss any sports.  Pretty sure it's the most expensive meal we have ever had- but 10/10 would do it again.",
   "Very nice wait staff and food. The Waiter had was very friendly and helpful. He always made sure our drinks stayed full and brought us plenty of bread. My wife ordered a caesar salad and it was very well done. The dressing and toppings were evenly spread. Many places server salads with just clumps of dressing in one spot but, this was not the case. The steaks were very good. I love raw steak and the first steak I ordered I requested \"Ultra rare\" came to me medium. I sent it it back and the next steak I got was the best steak I'd ever eaten in my life. The meat was so tender, it was like cake batter or butter. My knife went through the steak without any resistance. It was so tender, you didn't have to nearly chew it. The seasonings were perfect on the top. The french fried onions on the top provided a nice contrast to the meat and made for a perfect topping. My wife ordered the Cajun New York Strip in a cast iron skillet. She absolutely loved it. The marinade and seasonings on the outside matched well with the excellent cut of meat. The only thing she would have done differently was order the steak a few levels rarer because the skillet will continue to cook the steak. The side we ordered was Au Gratin Potatoes. It was also enjoyable, but the cut of the potatoes was not what I was expecting. I expected more of a thin slice and this was more along the lines of cubed potatoes or hashbrowns. Nothing really was negative about the entire dining experience. While Stab's Prime was somewhat pricey, our total bill was only around $120 without tip. I have no problems paying a for an expensive meal, if the meal is worth it. This was absolutely worth it. Excellent way to spend my birthday and I look forward to my next visit.",
   "The service is impeccable.  This was my first time visiting Stab's and I will be going back in the future.  The food was cooked perfectly and the portion was very reasonable. The ambience was very nice.  The light quality was perfect, not too low and not too high.  The noise level was perfect. It was apparent that everyone was socializing,  but there was no really loud talking. The restaurant was easy to walk through and the smell of food didn't suffocate the social atmosphere.  I loved it!  It was perfect!"
  ]
 },
 {
  "name": "Phil's Oyster Bar & Seafood Restaurant",
  "address": "4335 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d8ef71e-932e-11ea-95c6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15847114691080308079",
  "source": "GoogleMaps",
  "reviews": [
   "THE ABSOLUTELY BEST chargrilled oysters I have ever had! Leroy prepared them phenomenally, no pieces of shell, juicy, cooked to perfection. Dana, our server was awesome and recommended my crab meat augratin Pizzaza. Not a lot of you have large appetite, super flavor, very rich. My wife had the shrimp and spinach dip, also very good. Lastly I had the white chocolate bread pudding, custard texture, delicate in flavor, not too sweet. First time customer, feel foolish for not having come here years sooner!",
   "This place is LEGIT! Fresh raw oysters, great Bloody Marys, and the sauteed crab claws were right on point! Classy style sports bar that is a staple in the neighborhood, and has been serving customers since 1950. If you want good service, good food, and a cold brew with your seafood Phil's is a must! Monday nights is 50 cent oyster night and would make a great way to enjoy any game. I will definitely be coming back!",
   "This place is fantastic! Service was great Dana was our server. The oysters were so good! I highly recommend Phil's. The food was amazing the service was fantastic it wasn't crowded when they has 50 cent oysters! Will visit whenever I'm in town.",
   "Nice restaurant. Friendly staff. Good atmosphere. I like how they allow you to make your own cocktail sauce for your raw oysters and control the intensity. Tried the crawfish cheesecake. Don't know how to describe it but it had a good flavor.",
   "Phil's food is the best Baton Rouge has to offer. I hear there's a new out of town oyster restaurant coming to BR from over New Orleans way. Well they had better bring their A-Game because Phil's Char Broiled Oysters are cooked perfectly and are absolutely outstanding! Now, I have eaten the char broiled oysters at the other mentioned restaurant many times and they are good. I'll put Phil's up against them any time. I also had the Shrimps Piazza...OMG. it is fried shrimp abundantly topped with crab meat and cheese.. Fabulous! Also, are you ready for this? The dressings are all house made. I had the absolute best blue cheese dressing I have ever tasted. They also have fabulous specialty bar drinks and beer in a frosted mug. There is nothing fancy here. It is an oyster / sports restaurant and bar. So, if you don't want fancy and do what some of the best food you've ever tried, Try Phil's. Our service was also outstanding."
  ]
 },
 {
  "name": "Portobello's Grill",
  "address": "7622 Old Hammond Hwy, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6df5f814-932e-11ea-88db-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "knowledgeable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1196376220888232371",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, great service! Didn't get photos of food but we had the napa salad ( approx $12) and chicken fried chicken ( approx $14)biscuits and they were both delicious. Bottled domestic was $4. Bottomless mimosas were $10. Bloody May's were $8 pc and really good. Place was clean ( posted pictures of that). We were there for a large and loud birthday party and it was a good time. Gabby managed the staff like a boss and staff was pleasant! 👏👏 great first experience",
   "This was a wonderful dining experience. Amanda treated us kindly and gave genuine and knowledgeable advice on the menu. The shrimp scampi was divine and was rich with lemon in the sauce. Portion sizes were nice, and we left full in both body and heart.",
   "We went for brunch and it was a rather large group of us, so a wait was expected. However, you would think that with the wait time, the food would be piping hot. Although my meal was seasoned well, it arrived to me lukewarm, which was unacceptable due to the fact that my table had a longer than usual wait(two staff members came at separate times and apologized for this, which I appreciated). The staff overall was friendly and attentive so for that I give them 3 stars. My suggestion to anyone going for brunch - get there as early as you can.",
   "The brunch food is good but the service is nearly nonexistent. We got a bottomless mimosa and a coke and over 45 minutes we had to flag our waitress down to order food and to get a coke refill (never saw another mimosa after the first) as well as flag someone else down for the check. Meanwhile the wait staff was talking and messing around by the host's counter and behind the bar. I'm sure I've had worse service, I just can't remember when and definitely not for a $46 brunch.",
   "My wife and I attended around 1330 (1:30pm) on a Saturday. It was not real busy at the time we arrived. I ordered the Twin Medallions and the wife got the chicken parm. We also split an order of bread with pesto and finished it all with some bread pudding. So the medallions were very tender and tasted great. The sauce on the medallions was a bit strong but paired nicely with the potatoes. The chicken parm was good but nothing spectacular. The bread and pesto were great. The bread pudding was not that good. The pudding was to soft, sauce was a joke, and the banana slices were from a banana that was still VERY green. Overall the food and experience was good."
  ]
 },
 {
  "name": "Downtown Seafood & Grill",
  "address": "130 3rd St, Baton Rouge, LA 70801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e4fd992-932e-11ea-be91-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5394668412716088986",
  "source": "GoogleMaps",
  "reviews": [
   "The fried oyster is so good. The staffs are also so nice and friendly. She gave us free samples to try (which helped a lot in decision making).\n\nReally worth visiting to fill your hungry tummy! 😋",
   "The fish and shrimp were fried too hard, but the fries were good. The cashier who took my order was extremely nice and very welcoming. The salad was okay, nothing to relish over.",
   "My first visit I ordered seafood platter i was speechless everything was perfect. My second visit I ordered the cheeseburger fully dressed add bacon #OMG its huge #booyah 💪🔥💯 I loved it, The amazing  staff is very friendly and services was speedy. I also give them 5 stars for cleanliness and clientele👏",
   "Great food and lots of it for a reasonable price.  The service is fast and friendly.  The location is fantastic but I feel like the inside decor could be improved on to help with the overall experience.",
   "It's a nice quick bite. Like fast food restaurant. Staff is really friendly, overall good experience. Food could've been fresher but still pretty good."
  ]
 },
 {
  "name": "Mestizo Louisiana Méxican Cuisine",
  "address": "2323 S Acadian Thruway, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ed42d1c-932e-11ea-9c24-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "food",
   "food",
   "creative",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16920532832486730458",
  "source": "GoogleMaps",
  "reviews": [
   "Nicer atmosphere, high end menu options. Delicious, but pricey. Specialized menus include Keto, Vegetarian and Gluten free. Large portion sizes. Enjoyed our lunch before the game!",
   "Must visit one of the best Mexican cuisine in Baton Rouge.  This is one of the small hidden gems for Mexican food.  The restaurant is very clean and quiet.  Very friendly staff who will help you with the menu. The chef/owner is very friendly.  The food the amazing and to die for. Best seafood Mexican dish in Baton rouge.  \nMust visit this location.",
   "They're ok. I love Mexican food and I understand they're trying to be on the classier scale. However, the few times I've eaten there, it's just been kind of bland. Not bad, not good. There are just better options. The place itself is nice, though.",
   "Came from out-of-town and this restaurant BLEW ME AWAY!!!! They have some very creative dishes that are out of this world! I've never experienced a restaurant like this one. Trust the chef. I almost ordered my mashed cauliflower and eggs without the sauce because it sounded weird together. Nope. The flavors blended perfectly! The menu is extremely creative and they literally have a section for everyone - including Paleo, low-carb, vegetarian, and low-fat. The owner came to our table and when I asked about the cauliflower mash, he brought me a sample. Heaven!!! Brunch was so good we came back the next day for lunch.",
   "The food was amazing. My family and I went for Father's Day since my dad loves the food here. We brought two 3 for 2 fajita plates and the cuatro and it fed 7 people including a child. The chef took care of us and made us feel at home. The waitress was very professional and patient. I love the vibe and the artwork. Will definitely come back!"
  ]
 },
 {
  "name": "Cecelia Creole Bistro",
  "address": "421 N 3rd St Suite B, Baton Rouge, LA 70802, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f3714b4-932e-11ea-9a11-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "walking",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7565386401101845246",
  "source": "GoogleMaps",
  "reviews": [
   "New to town and walked here for dinner. Sat at the bar and ordered the Steak with potatoes and fresh veggies also added a side of shrimp. I had high hopes for the place considering it was walking distance from my place. The food came fairly quick but the shrimp were no longer warm, even tried them first as I know shrimp cool rather quick. Ordered the steak medium but was really only able to eat around the edges as the middle was still completely raw. Was never once asked how my meal was or the steak was cooked to the temperature I requested. Other than that the potatoes and veggies were hot and very good. Uncertain if I’ll return.",
   "Went to Cecelia Creole Bistro during restaurant week. This was my first visit.  I had the BBQ rubbed pork ribeye on top of a bed of White Rice and black beans. And my dinner date had the Shrimp and Grits.  We both enjoyed our dishes.  The pork ribeye was cooked to perfection.   It was perfectly seasoned and so juicy.   The rice and beans was very flavorful and complimented the pork rib very well.  My dinner date said his shrimp and grits was very good, seasoned well and tasted so good. \n\nThe prices on the menu was very very reasonable The atmosphere was very trendy and nice.  We would definitely visit again.",
   "Food was very tasty and hearty. Staff was friendly and professional. Not giving it 5 stars because it was a bit pricey (particularly the short ribs) for what you get.",
   "Great spot for some fresh local cuisine.  Shrimp and Grits were amazing.  Wonderful service - so good I had to bring my friends all back for dinner.  Loved it.",
   "Very welcoming, the food is delicious. I had the Redfish Cecelia and my husband had the Pork chop dish."
  ]
 },
 {
  "name": "Simple Joe Cafe",
  "address": "3057 Government St, Baton Rouge, LA 70806, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f77af8c-932e-11ea-bae7-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "music",
   "delicious",
   "walk",
   "food",
   "food",
   "unique",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3361972250103015945",
  "source": "GoogleMaps",
  "reviews": [
   "Not enough stars. Great atmosphere!! Food is outstanding. Got to get the grits!! Omlettes are huge!!! Service is professional and make it personal that they appreciate you have come to eat with them. The music could be rage against the machine then frank Sinatra. Simple Joe is simply great. Check them out!!",
   "The food is just down right good.\n\nMy first time to Simple Joes, I walk in and I’m ordering to go.\n\nIf you have eyes that work, you know just what to do, so I walk up and place my take out order and the counter.\n\nI’m not really sure where to stand at this point, so I position myself somewhere off to the side of the growing line to order; somewhere between ‘in the way’ and ‘in the way’.\n\nAfter a fair wait, my food is ready. It’s hot and smelling tasty, and after a quick inspection by the head honcho, it’s missing an item. A quick fix, and I’m on my way.\n\nThe coffee is delicious, they serve it up fresh and you make it yourself— my preference.\n\nFrench toast was bomb, eggs were bomb, salmon bagel was bomb. No complaints.\n\nIf you’re in the neighborhood, definitely stop in. It’s just tasty stuff.",
   "Landed in Baton Rouge early and starving. Looked up \"best breakfast in Baton Rouge\", this place came up. It absolutly nails it! Super good food, friendly vibe, Joe is super nice and passionate about his business. We had his famous grits, chili, french toast and more, awesome! We will be back!",
   "One of a kind experience. Super busy! You stand online to order, then take a seat with a number. There was a lot of confusion on tickets, but in my opinion, it added to the unique charm. Food is amazing. Very homey, get your own refills kind of place.",
   "Classic, very delicious, breakfast food. Everyone that works here is very nice as well. Heather, one of the owners, is very personable and remembers your name! Good place to get a quick bite, meet with friends or business partners,  and to study."
  ]
 },
 {
  "name": "Dempsey's Poboys",
  "address": "13580 Coursey Blvd, Baton Rouge, LA 70817, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6fc66d86-932e-11ea-808c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16562401708597078977",
  "source": "GoogleMaps",
  "reviews": [
   "Fried shrimp and catfish is delicious. My wife and I enjoyed the gumbo. Service with a smile and will not let you down. I will definitely be going back.",
   "One of my favorite places when I come to town! Love their grits!",
   "Feels like a small town diner!  Staff is always quick to great you.  Love all the food.",
   "I love the fact that Dempsey's has a meatless poboy!! I wish you guy would start selling a fried cauliflower poboy.  Everything was delicious we were all satisfied and the waitress was very nice. They were really busy and still gave great service.",
   "My favorite Little Gem everything on the menu is absolutely delicious there is never a disappointment and you have to check out the daily specials!"
  ]
 },
 {
  "name": "Drusilla Seafood Restaurant",
  "address": "3482 Drusilla Ln D, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/700c78ec-932e-11ea-b0bb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5590630516192577026",
  "source": "GoogleMaps",
  "reviews": [
   "A new reason to come to Baton Rouge! I used to think Louisiana Lagniappe was alone as my favorite but this Drusilla is outstanding. The hush puppies were like nuggets from heaven. The  fish (Drum) smothered in some butter sauce was done to perfection. I then ordered some bread pudding to go and it did not disappoint. Wonderful food at a manageable price!",
   "It was all good.  Hush puppies were crispy on outside and soft in side, with fresh butter it was delicious. The fried oysters and shrimp were good. My mother had the stuffed flounder which she really liked. We have been before and will visit again.",
   "This place reeks of ambience. I absolutely adored the dark wood everywhere.in fact, the only thing I liked more than the ambience was the absolutely amazing food. Everything was completely top notch!",
   "My family and I enjoyed a very special evening here recently. We were treated very well in this beautiful place. Everyone loved their food as well.",
   "Not as good as they used to be but they still have decent lunch specials and delicious hush puppies (when they’re fresh)"
  ]
 },
 {
  "name": "Digiulio Brothers Italian Cafe",
  "address": "2903 Perkins Rd, Baton Rouge, LA 70808, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7055decc-932e-11ea-8897-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11233482829125377652",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere and service were fantastic. Wine was delicious but the food didn’t quite meet the high expectations from referrals. Hearty portion though!  Would go back",
   "Just the nicest family atmosphere with stellar, authentic Italian food, thoughtful wine pairings, a charming patio and dimly lit romantic interior. Chicken parm & red velvet cake is a must!",
   "First time ordering here.  My eggplant parmesan came with spaghetti, salad and bread.  From phone through pick up I am impressed with the courtesy, food and will be back!",
   "This restaurant was simply perfect. Excellent dinner, excellent service. All on Valentines day. Great job. I will be back soon. Finally found perfect Italian dining. Thanks to the staff.",
   "The food, service, and environment were exceptional. I had the lasagna and meatball and my only complaint is that it was HEAVY on the red sauce. I scraped a lot off and then had some left. They only take RSVP on Valentine's Day and New Year's Eve so we did have to wait for a minute but that was our fault. Overall a great experience! I will be going back."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "10360 N Mall Dr, Baton Rouge, LA 70809, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70981924-932e-11ea-a722-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2904050177500678801",
  "source": "GoogleMaps",
  "reviews": [
   "First things we love the rolls and butter. The wait is not to long. Our food is always good and the staff works hard to wait on us. The drinks are good. I think they put enough liquor in them. We always enjoy our outing at Texas Roadhouse!",
   "Really good burgers.\n\nGood selection of menu items.  Could have a few more beers on tap.\n\nFriendly and well versed staff about the menu.  They also stayed on top of things.\n\nGood deal of seating and the place was almost full. \n\nPlenty of parking but this place is popular so it can fill up fast.",
   "Waiter was wonderful and the food equally as excellent. If you're entire party hasn't arrived, you have to wait until everyone arrives to be seated. Bread rolls and shelled peanuts are complimentary. Some dishes were very salty, however, overall experience was pleasant.",
   "The food was amazing. The bread was great as always. Our server was good but I would recommend she doesnt blame everything on her coworkers or in the fact that the restaurant is busy. If you dont see the customer upset no need to give explanations where no one ask for. If we ask for something is only to help you remember not to imply that we are angry. She was a sweetheart but a lot of servers are like this nowadays.",
   "First 2 pics are from Valentine's day 2020, in Louisiana for our 10yr anniversary & he set this all up to make sure while we were over in Louisiana seeing the Pelicans & Zion play the Oklahoma Thrashers that we had this mushy romantic thing going on & so, the last 2 pics are from North Carolina in Nov. of 2018 but it was again a Duke basketball game to see Zion Williamson, Tray Jones, Joey Baker, & Jack White & the rest of the Blue Devils, but this is how romantic he is, this was our very first ever lunch date in February of 2010 & we having been going strong ever since."
  ]
 }
]