[
 {
  "name": "Dakota Zoo",
  "address": "602 Riverside Park Rd, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/70d7947e-932e-11ea-acc4-14b31f159f22.png",
  "tags": [
   "walking",
   "family",
   "unique",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1690636724931071030",
  "source": "GoogleMaps",
  "reviews": [
   "Went the first of March and so enjoyed the visit. Since it was cool out almost all those animals were out and the one who need warmth were inside exhibits. It made the visit really enjoyable to be able to see so many animals. I will say good walking, enclosed shoes are important here as the walkways are rough and broken in places (I fell once) and this early there was a lot of snow melt with flooded walkways making that not an enjoyable experience. Overall loved it!",
   "I had no idea there would be a zoo in North Dakota! Our family visited it was a lot of fun. Great zoo, lots neat animals to see and great meeting rooms. Bring your sunscreen if it's during summer time",
   "This zoo was amazing!  Coming from Wichita,is where the Sedgwick County Zoo is phenomenal, I found this zoo refreshing and unique.  It was amazing to see all the North American animals along with some exotics.  My wife and I will be bringing our kids with us in a couple of years to this zoo.",
   "The zoo is okay.  It's small and the admission fee is very reasonable.  Good for some entertainment.  A lot of small enclosures which could do with some renovations.  Park is clean and well maintained.  Lots of shade. The tigers were the best part.",
   "Went to go to take photos with Santa which we were led to think were free. Paid $19 to get in, saw a sign with the prices on it for pictures $10-25 (depending on what you wanted). Decided it wasn't worth almost $40 to take a photo with Santa, so I requested a refund for the zoo entry since we hadn't gone in. The lady stated she can't give refunds and that I would have to come back another day to get one. She then gave us a Supervisor's # to call, but when we tried to call, it wasn't an actual number. Moral of the story, don't try to get refunds, as they will make you jump through hoops to get it. I did get it in the end."
  ]
 },
 {
  "name": "North Dakota Heritage Center & State Museum",
  "address": "612 E Boulevard Ave, Bismarck, ND 58505, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/71236bec-932e-11ea-a543-14b31f159f22.png",
  "tags": [
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16928675257532388291",
  "source": "GoogleMaps",
  "reviews": [
   "A break from the road for some much needed culture. Beautiful modern facility with very warm and friendly staff. A great deal of educational and historical material   allowing for a wonderful experience. Ample parking and easily accessible from the highway. Well worth the detour. Thank you and good use of your $.",
   "My kids love this place. Such a great place to go and explore on a cold winter day! They playground is a great bonus!",
   "Very interesting place! Was so cool to look around the exhibits and see all the stuff they have to offer. Really cool experience. Really cool artifacts. Overall ready awesome place!",
   "This place gets better everytime I visit. It's very accurate with some of the exhibits. But a great place to visit.",
   "1 to 6 hours of awesome! You can whip through this museum and still get something out of it. Or get lost in large warehouse-like rooms filled with great exhibits that continually provided organization, flow, and detail for me to understand and digest. Artifacts everywhere and I was told only 4% of what they have is on display at any one time. \n\nI spent about 4 hours total here and was most impressed with their North Dakota and WW1 exhibit. So interesting to put it in perspective and see how it had affected the people of ND. Also had so many artifacts that soldiers had brought back from war. \n\nDont miss the petrified wood and natural cannonballs in the garden area.  And it is all free to see. Thank you North Dakota!"
  ]
 },
 {
  "name": "Gateway to Science",
  "address": "1810 Schafer St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/716cd392-932e-11ea-9cf8-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16896723624408418101",
  "source": "GoogleMaps",
  "reviews": [
   "A lot of interesting science activity. You can do a bunch of interesting activities with your kids. It's not too big, and tend to get crowded. You can also pet a iguana there, and you can also learn about aquaponics, and if you get lost on the trivia quiz, the guy or girl at the gateway to science will help you solve the quiz. They also gonna expand the building and bring more exhibitions. Me, my wife, my daughter and my son have a fun time here!",
   "Best place for kids of all ages to have fun while (even accidentally) learning about science. My children and now my grandchildren have always loved GTS!",
   "Very cool exhibits for kids. Highly educational and experimental.",
   "Great interactive displays for the money! Highly recommended for anyone!! The staff need huge attitude adjustments though—they tend to like to snatch your forms of payment  (and paid membership cards) from you then throw it back on the counter, so\nBeware of Kim Eslinger.",
   "Very interesting. I recommend it for anyone who is curious!"
  ]
 },
 {
  "name": "Keelboat Park",
  "address": "1605 River Rd, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/71aff6f0-932e-11ea-8841-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17424038989624125753",
  "source": "GoogleMaps",
  "reviews": [
   "Nice walking trail. There is a great source of information about the area on many sculptures and statues. There could be more things to do. Even a shelter for picnics or something. Over all, a great place.",
   "Great location to start a run or bike ride, convenient boat ramp, and the river boat is always a nice way to spend an evening. The sunsets aren't bad either.",
   "Nice trail along the river to run, walk, or fish.",
   "Kids love it and great views",
   "Interesting. Was hoping for the keel of a boat but only found a replica off a partial boat no keel"
  ]
 },
 {
  "name": "Former Governors' Mansion State Historic Site",
  "address": "320 E Avenue B, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/71fe4446-932e-11ea-bb33-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walk",
   "tour",
   "tour",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7686974180812537093",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful house. There's an attendant there as well so if you have questions or anything he can help....the gentleman we had was very knowledgeable and friendly. There was no admittance fee. Plaques mounted to the walls to describe the different living areas. They've actually peeled away different layers of wallpaper and paint as well as the lath and plaster. Definitely worth stopping to see.",
   "This is a must to see while visiting bismark. Tour guide was so informative.  It's like talking a walk back in time.free admission and very well keep",
   "This Santa was wonderful. Spent real time talking with the children and nice tour of the historic governor mansion.",
   "Interesting and very tight quarters...steep narrow staircase!!!",
   "This a really cool place with detailed history about the governors of ND. The wormwood is beautiful. Seeing the different wallpapers of past decades will be interesting. Do not forget to check out the carriage house!"
  ]
 },
 {
  "name": "Buckstop Junction",
  "address": "3805 E Bismarck Expy, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7252b32e-932e-11ea-8dfe-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=552895297098168992",
  "source": "GoogleMaps",
  "reviews": [
   "It is a little ways out of the city, which helps to maintain it's atmosphere. It's a fun little historic town with lots of buildings. I went there for the Apple Fest, and each building had different activities or musicians for the event.",
   "Well taken care of old buildings and antique equipment.",
   "Great place to use as a venue or visit if you enjoy the history inside",
   "Excellent place to visit that most people forget is right in plain sight!  The tour guides are very knowledgeable and for the low price you pay, there is so much to see!!  If you're in the bisman area, this is a great place to visit and help keep our local history alive!",
   "Had a great time at the Halloween party today"
  ]
 },
 {
  "name": "Chief Lookings' Village",
  "address": "2023 Burnt Boat Rd, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7298e552-932e-11ea-a72d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12053639662664741257",
  "source": "GoogleMaps",
  "reviews": [
   "The beauty here is unrivaled.  This little gem of a park is tucked into a lovely residential area with spectacular views.  Don't miss it if you're in the area!",
   "Fun and informative historical site. Also, perfect place to watch the sun go down! 😁",
   "A great view and phenomenal place to watch the sunset",
   "It is beautiful here! The view is amazing and there are a lot of great trails around for biking!!",
   "One of the best trail systems in Bismarck, lots of ups and downs, and phenomenal views. It connects to the college trails, as well as the river road trail."
  ]
 },
 {
  "name": "Sertoma Park",
  "address": "Riverside Park Rd, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/72e9ee7e-932e-11ea-9cb4-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10127777202911305536",
  "source": "GoogleMaps",
  "reviews": [
   "Sand volley , walking/jogging trails, picnic shelters you can rent for family get togethers , lots of swings and other playground fun, and restrooms close by.\nAmusement Park in the middle of everything ; Big Slide, mini golf, fun rides and concessions... one of the best parks in Bismarck... let’s not forget the awesome Zoo right there too. Train rides available at the Zoo",
   "Great place to have a walk. Working on losing 50 lbs. Like or contact me with your support. Or check meetup join me.",
   "This is a well maintained park that has something for everyone, even an amusement park within the park (rare to see an amusement park, not a theme park nowadays, especially outside the East Coast). Parts of the original riparian forest are still preserved here. You can't go wrong spending a Sunday afternoon here.",
   "Such a gem in our community. There's so much to do for ND! And it's relatively clean and well kept.",
   "One of the best parks in town. Usually has a hustle bustle going. Full of people who will wave and occasionally stop and talk."
  ]
 },
 {
  "name": "North Dakota State Capitol",
  "address": "600 E Boulevard Ave dept 110, Bismarck, ND 58505, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/734ad470-932e-11ea-a845-14b31f159f22.png",
  "tags": [
   "walk",
   "practical",
   "tour",
   "free",
   "unique",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11968724222963108188",
  "source": "GoogleMaps",
  "reviews": [
   "Another stamp in the boys state capitol books 😉\nThe elevators are a bit high tech here with a touch screen to request an elevator going up to the observatory floor (or back down). There's a bit to see here (mostly photos and views from the observatory) and the ND Heritage Center is a quick walk from the Capitol building.\nI'll boost a review with pics for the heritage center separately since they are technically two separate areas.",
   "A practical but beautiful state capitol building. Guided tours are available during limited hours but self guided tours are allowed as well. Visitors can access the observation level on the 18th floor for nice views of the town. Both chambers of the house and Senate are also open to view.",
   "Cool place to check out. They have a free guided tour most hours. Or you can always self-guide yourself through this beautiful building founded in hard working North Dakotan spirit. Our tour guide was knowledge, informative, and obviously very proud of her home state. Great views on the top floor.\nCheck out next door while you're here.  ND Heritage Center and state museum. Also free and really well done.",
   "Somewhat unique among capitol buildings in the United States with its high-rise design, the grounds are still very attractive and the capitol stately.",
   "Closed when I arrived, but worth the walk around. Found the heritage museum on the grounds; a great surprise."
  ]
 },
 {
  "name": "Camp Hancock State Historic Site",
  "address": "101 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/739b18fa-932e-11ea-9582-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6437662842119264131",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely, peaceful grounds. A pretty covered open building housing the rail engine. Plenty of pigeons/doves roosting above it so don't get past the railing! There is also a gorgeous old church on the grounds and the weather service building. Lots of sweet scented peonies on the grounds, a well maintained lawn, the perfect tree to frame photos of the beautiful church from the back, a pair of soft stained glass windows complete the site. The railroad runs behind it and the front of the site is framed by the street with lamp post signs.",
   "Nice place to go and see history of bismark nd. Check out the old church",
   "Great history, beautiful church,  and the grounds nicely maintained.",
   "I love history",
   "This is a cool place in downtown Bismarck."
  ]
 },
 {
  "name": "Bismarck Art & Galleries Association",
  "address": "422 E Front Ave, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/73f1ece4-932e-11ea-8991-14b31f159f22.png",
  "tags": [
   "art",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=15685897644406863973",
  "source": "GoogleMaps",
  "reviews": [
   "Fun little art gallery with a regular rotation of local artists",
   "Wonderful little gallery. It has a good meeting room.",
   "Beautiful artwork in a very nice gallery.",
   "Great place for local and other artists. What a gem in Bismarck.",
   "Beautiful photographs of the national parks"
  ]
 },
 {
  "name": "Raging Rivers Waterpark",
  "address": "2600 46th Ave SE, Mandan, ND 58554, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7436e67e-932e-11ea-8201-14b31f159f22.png",
  "tags": [
   "cheap",
   "eat",
   "kids",
   "cheap",
   "kids",
   "family",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6415558780969719817",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent place! Good is cheap and don't have to wait long to eat.",
   "This waterpark is really fun! All the features are truly enjoyable and there's lots of fun new people to meet for kids and adults! It's a great place to spend a hot day",
   "The kids had a blast!! Cheap fun entertainment for the family. The lazy river was awesome! I was impressed with how clean and well kept the park was. It’s fun for all ages! Our party had an age range of 3-8 years old and all of them loved it.",
   "Very fun, it's only 10$ after 4:00 so that's a good deal",
   "Delicious concessions! Fun for the whole family! I could have stayed on the lazy river all day. Very relaxing and the perfect getaway. It wasn\"t very busy either. Very impressed!"
  ]
 },
 {
  "name": "Fort Abraham Lincoln State Park",
  "address": "4480 Fort Lincoln Rd, Mandan, ND 58554, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/748168d2-932e-11ea-83a0-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17059307135747423148",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit and see the views. Great campsites, rentable yurts, plenty to do. I love the trails at this state park for running and mountain biking, very gradual.",
   "Tour of the Custer House was educational, informative and surprising!\nSome of the owners pieces were actually in the home.\nThe guard house and mess hall were neat to see, reading all the info signs along with the stables was informative.\nGood place to take the family.",
   "Fun stop. Toured the old barracks and training grounds. Comfortable area with good parking. Small entrance fee was charged. The big hit was the generals house and all the artifacts and historical information. Additionally, the Indian village and museum was quite interesting. You will also find a gift shop at the location.",
   "A bit pricey for a State Park.  We had only electric and water and it was $25 + $7 day use fee.  But the park was beautiful.  Some of the sites are crowded as they have 2 hook ups on many of the looped \"pull thru\" sites.  The back in ones are best and have nice views of the river.",
   "I have been going to Fort Lincoln since I was a child (for the last 25 years or so) and it has only gotten better over the years. It has great places for hiking along with historical sites. Both Native American history as well as the history of Custer. Great place to take kids especially for picnics, camping or fishing."
  ]
 },
 {
  "name": "SuperSlide Amusement Park",
  "address": "500 Riverside Park Rd, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/74c8b358-932e-11ea-9c9e-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3733327147821273028",
  "source": "GoogleMaps",
  "reviews": [
   "What I expected for a family fun park. We wished there were enough workers to cover all the rides.  Some wait times were really month for the little kids rides. Batting cages were pretty outdated.  Overall fun and fair prices.",
   "I have came here my whole life and love coming back every year when they open.",
   "Great people great place",
   "Great place to take the family. Even better if you combine it with the zoo!",
   "Great place for everyone! You have to pay for batting cages, mini golf, and bankshot(can't use tickets).  Understaffed. But quite enjoyable!"
  ]
 },
 {
  "name": "Fort Lincoln Trolley",
  "address": "1989 3rd St SE, Mandan, ND 58554, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/751d3d80-932e-11ea-8ee0-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=4293496135244893118",
  "source": "GoogleMaps",
  "reviews": [
   "Such a fun day trip!  There is plenty of shade to wait in if you get there early. You can get off the trolley and take a later train back or stay on and go back right away.",
   "Slow enjoyable ride, views along the route, beautiful.\nWildlife dotted between Mandan and Park",
   "I love riding chu -chu treen I enjoyed! I recommended 👌",
   "A fun way to do a day trip to Ft. Lincoln State Park",
   "Nice trolley ride, 9 mile ride to Mandan from Fort Abraham Lincoln and back for $9 per person.  Rise along the Heart risk er beautiful scenery and wildlife.  We saw lots of deer."
  ]
 },
 {
  "name": "Pioneer Park",
  "address": "2020 River Rd, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7571a098-932e-11ea-9a9e-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10524253297628988871",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for a walk or just for fun.",
   "Great place if you want to go for a walk, jog, run, or play volleyball.",
   "Nice park",
   "Beautiful park by the Missouri river. Bike and walking paths with shelters & play areas",
   "Shaded trail, sand volleyball, picnic, parking playground. Good options."
  ]
 },
 {
  "name": "New Generation Park",
  "address": "Valley Dr, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/75d2871c-932e-11ea-af45-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=13725395453567789743",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent modern wild west theme playground. It has large areas for tots, preschoolers, and older kids plus wheelchair access and features. There is also a splash pad, public restrooms, picnic shelters, and reservable party room. There is a nice parking lot and additional street parking.",
   "Great play areas for young children as well as older ones.  Lots of slides, climbing options and bridges.  Also a sand sifter, picnic area and skating rink.",
   "The splash pad is so nice. Perfect for all ages and a great way to cool off. Also, it is free! The park area is great as well. They have two different sized parks so again great for all ages!",
   "Nice playground, has a few different age appropriate areas all within sight. Community center was very nice!",
   "Great place for our 2 and 4 yr old to run around  and play.  They loved the splash pad.  We'll definitely be back."
  ]
 },
 {
  "name": "Tatley-Eagles Park",
  "address": "602 Airport Rd, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7618e01c-932e-11ea-8cea-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=6773602569585786011",
  "source": "GoogleMaps",
  "reviews": [
   "Gear park, especially since the addition of FOMO icecream! It is a truly idyllic space in town, with community gardens, volley ball, free yard games, softball spaces, a play ground. If you get a chance to just enjoy the evening while eating icecream at golden hour in this park... just do it.",
   "Nice place to go camping for the weekend close to town but yet still quite enough you can enjoy time away from the hustle and bustle City living",
   "Great park, I've played volleyball here a few years, and now there's a gelato stand here for the summer. Two baseball diamonds, two sand VB courts, a playground, an ice rink, and tons of room here for just about any activity you can think of.",
   "Really nice place to hang out play volleyball here but wish the same was a little better",
   "Fun at the park"
  ]
 },
 {
  "name": "Eagles (Universal) Park",
  "address": "100 14th St NE, Mandan, ND 58554, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/76626d92-932e-11ea-8ebc-14b31f159f22.png",
  "tags": [
   "unique",
   "kids",
   "structure",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14722249351247924513",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing playground! Soft padding on the ground without small pieces getting stuck in the shoes. Good amount of shade and different options for all ages to entertain",
   "So many fun things to play on...for all ages.",
   "Excellent playground. The kids love the zip line. Lots of unique play structures to climb on. Unfortunately the benches are in the sun and the adults have to hangout under the play structure to get any shade.",
   "This place was so much fun! The ground in the park was rubber and felt springy to walk on. The park had a lot of different play equipment both accessible and non it started low to the ground and went up higher as you climb through. It kept us busy for a long time! Cant wait to stop by again!",
   "The grandkids had tons of fun and cant wait to return."
  ]
 },
 {
  "name": "Wachter Park",
  "address": "Unnamed Road, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/76a25e70-932e-11ea-8bbb-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15679749491980953009",
  "source": "GoogleMaps",
  "reviews": [
   "Great place!  Play Equipment from ages 1 to  8+ !",
   "ACCESSIBILITY #1! This park is from another planet on the disability access front. Those in wheel chairs and with limited mobility can roll right up the interactive & canopied play spaces. It can get busy but it has the capacity to accommodate MANY families at once with its multiple playgrounds. Great park in very safe neighborhood!",
   "So many different equipment to play on for the kids.  A nice breeze and a swimming pool right next to it.",
   "Just a great park",
   "This park is clean and has tons of things to do from toddler to adult. Pool and ice rink"
  ]
 },
 {
  "name": "Optimist Family Park",
  "address": "2098 N 16th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/76f2a250-932e-11ea-91a8-14b31f159f22.png",
  "tags": [
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1669764249152942394",
  "source": "GoogleMaps",
  "reviews": [
   "Very family fun, smart thinking with the portapotties",
   "Very open and well kept grrah for gatherings",
   "So nice great for big kids and little kids! My daughter loved it! Don't forget to stroll around the water tower the view is beautiful",
   "Nice park with play ground, sand volleyball, basketball, horseshoe and picnic benches.",
   "It a very open park, my son and I love coming here. Its has a perfect playground set-up for children and adult playing areas also. Its great for picnics or outdoor meetings or birthday parties on a nice summer day."
  ]
 },
 {
  "name": "North Dakota State Railroad Museum",
  "address": "3102 37th St NW, Mandan, ND 58554, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/77430d9e-932e-11ea-bb54-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10259705045612054725",
  "source": "GoogleMaps",
  "reviews": [
   "Closed when we got there but a gentleman doing some maintenance gladly showed us around",
   "Great place to visit plenty of old trains old buildings trains that were here before I was very interesting if you're into trains history show the state of they do try to answer questions you ask",
   "It was a neat little area. Lots of awesome pictures and items from back in the day. Very cool history.",
   "Visiting from California  this is the best train museum  I have ever been to. Lots of historical items.",
   "Lots for kids to explore and experience. They have many railcars open to venture into and explore. Such a fun family outing!"
  ]
 },
 {
  "name": "T R Roughrider Hall of Fame",
  "address": "600 E Boulevard Ave, Bismarck, ND 58505, USA",
  "avg_visitor_review": 3,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=10462807182555028374",
  "source": "GoogleMaps",
  "reviews": [
   "Pictures and plaques on the main floor of the capitol building commemorating North Dakotans for significant accomplishments"
  ]
 },
 {
  "name": "Johnny Gisi Memorial Park",
  "address": "2601 E Calgary Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/77a8d436-932e-11ea-a1ed-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10384198072000926847",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little gem. My kids love this park. Unfortunately, there is some maintenance that needs to be done and the city doesn't bother. Kids are too busy on their electronics at home to venture out.",
   "Good parking space for access to the trail system. There is also a playground and some tennis courts, but I mostly use this area for trail access.",
   "In a good area, so much space to roam. It's really peaceful and nice.",
   "Great space for anyone to play or do some thing",
   "Swings, tennis cou t, oicnic area, kids playground, sand box area"
  ]
 },
 {
  "name": "Double Ditch Indian Village State Historic Site",
  "address": "ND-1804, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/77eb0e9a-932e-11ea-a88b-14b31f159f22.png",
  "tags": [
   "history",
   "walking",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8203509978137834127",
  "source": "GoogleMaps",
  "reviews": [
   "The area is clean, easy to navigate, and beautiful. There are plaques detailing the history about the site, and are very interesting to read. It's a medium sized walking area, and is good for a quick stop to soak in some scenery. The sun sets on the other side of the river, and can be viewed very well from here. There are benches to sit on as well. If you are passing through, I would recommend stopping here for a quick stroll.",
   "Beautiful place to watch the sun set.  Poignant reminder of our history.",
   "This is an amazing spiritual place, with beautiful views of the Missouri river! Rich in history of local indigenous people!",
   "Nicely maintained trails and informational signs. Few benches. Watch for pocket gopher or squirrel holes.",
   "It might seem a little barren but there's a ton of history behind this place. Fantastic view of the river, great place to get out and burn afew calories or even a nice place to go by yourself to relax."
  ]
 },
 {
  "name": "DK Orthodontics",
  "address": "4401 Coleman St #105, Bismarck, ND 58503, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/784435d2-932e-11ea-aa36-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=4027163426182042939",
  "source": "GoogleMaps",
  "reviews": [
   "DK Orthodontics has been amazing with my 2 daughters and my son. We went to them for a second opinion and are so very glad we did. Dr Dan had the same treatment recommendation but much more reasonably priced and we love the staff! They are super friendly and caring. They truly care about their patients and want Ortho treatment to be a positive experience. My girls got their braces off in May and they actually miss going to see Dr Dan every couple weeks!",
   "The people are amazing and polite! My teeth are straight and I highly recommend this orthodontist!",
   "This place is wonderful, very personable!!! Extremely impressed!! They explained everything so well and showed us pictures and videos of what they will be doing to my daughter's teeth. I feel like I know all the details of how this process is going to go and won't have anything to worry about down the road!!! Thank you so much Dr. Dan and Danielle for being so awesome with Britt and I!!!",
   "I want to thank Dr.Dan and his amazing staff! Since day one they have made me feel so welcome and part of their DK family! It was a bitter sweet day today, as I got my braces off. I was thinking of all the faces that I will miss seeing on early Monday mornings. Although, I will be a guest in his office as my children will be future patients, giving me even more of an opportunity to continue the friendships.  You do it right!!",
   "Just got braces on our 13 yr old daughter today and couldn’t be more impressed with the dr. and staff at DK Orthodontics!  So friendly and helpful from day 1 with the initial consult.  They have been so kind in all their interactions w us, explaining thoroughly any questions we’ve had.  They remember us each time and ask how things are going.  THANK U, DK ORTHODONTICS, for everything!  Excited to see our daughters amazing smile in a couple of years 😁"
  ]
 },
 {
  "name": "Laughing Sun Brewing Co.",
  "address": "1023 E Front Ave, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/78844d36-932e-11ea-8917-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "delicious",
   "music",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13405067817097641369",
  "source": "GoogleMaps",
  "reviews": [
   "Service is what kept this from being a 5-star. I don't mind ordering at the bar, but there was not enough staff resulting in a wait every time I went up because they were too busy doing other things to take my order.  And this was mid-afternoon on a weekday!  Food was good (could use more smoke flavor) with generous portions.  Nice facilities.",
   "Nice atmosphere and good craft beer. Some of the food options on the menu are unique and fun. All that I have tried, taste pretty good, but none of it has been hot. Good flavors but the food is always just warm to warm-ish. My friends all feel the same way and some of them I have never been there with. Unfortunately if it stays consistent like that I will probably stop going there altogether.",
   "They moved to a new Bismarck location in the Fall, and now they have a ton more room, and live music almost every night it seems! Just had the Taylor Made barbecue for the first time tonight (Chopped Brisket Sandwich) and holy smokes is it delicious! The Mac n Cheese will blow your mind too. Beer, as always, is on point. Will definitely be stopping by more this spring/summer!",
   "Best place for live music in town. Great beer. Good BBQ food selection. I love being able to order at the counter - it seems to speed up things. The expanded size is a welcome addition, but even this place fills up very fast and it can be hard to find seats for a larger group if come too late on a busy night. It's neat seeing the owner(s) hanging out here with their friends and having a good time - it speaks more highly of a place. There's an excellent, varied, and eclectic group of music here which is very welcome. I wish that when bands are taking their breaks, there would be no music played instead of background music on their radio. The nice thing about the old place was the silence between sets to catch up on conversation. The bread part of the BBQ sandwiches could be better - it seems too thick, not soft enough, and not hot.",
   "My girlfriend wouldn’t even kiss me after a couple of your golden ales. I almost bought some kona golden ales, which I enjoy immensely, but instead but was like well, laughing sun golden ales will be similar. \nWrong. Wrong. Tastes like keystone light gave up."
  ]
 },
 {
  "name": "Double Ditch State Recreation Area",
  "address": "Double Ditch Loop, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/78cd175e-932e-11ea-bf55-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6770075072971903830",
  "source": "GoogleMaps",
  "reviews": [
   "This place used to be good until everybody started coming here to walk their dogs.",
   "Great views during a walk while learning about the early native inhabitants.",
   "This used to be a place I'd go to get away from it all but they did some work out there to make it look pretty. Now it sees some foot traffic but is still a beautiful place",
   "The perfect place to be \"one\" with Mother Earth. Visit the place and you'll agree!",
   "Not much here. Lots of mud."
  ]
 },
 {
  "name": "Pirogue Grille",
  "address": "121 N 4th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/79291bb4-932e-11ea-bd04-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2633695696051075201",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious! Everything was cooked to perfection. Beautiful location with excellent service and five star food. Definitely the perfect fine dining experience in Bismarck. Take your time and enjoy each and every course of delicious dining.",
   "Food was amazing! Order the Rabbit Spoetzel (pictured) and then I had the Bison Medallions and the wife had Swordfish for main dish -it looked so great we forgot to take pictures! ...and tasted even better!! It IS abit spendy, but if you like great food -dont worry bout $$$ bill",
   "They have wonderful food and very unique dishes to try each time we go! I enjoy the scallops with cream curry and jasmine rice while my husband likes the lamb loin. It has a very nice atmosphere as well with excellent service!",
   "Waitress could have been a little nicer. Great food and atmosphere",
   "Awesome service and great food!"
  ]
 },
 {
  "name": "Cross Ranch State Park",
  "address": "1403 River Rd, Center, ND 58530, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7989db14-932e-11ea-bbcf-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "eat",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8575337807649881211",
  "source": "GoogleMaps",
  "reviews": [
   "Loved Cross Ranch! The camping was way fun, and the main office had several activities on Friday and Saturday for the kids to do, while we were there. They will even drop you off up river so you can kayak back down again! The camp site was well keep and with plenty of space for two tents. The fire ring was also cleaned out, so we didn't have to worry about too much ash inside it. We went for a walk on one of the trails, and the view was really beautiful. We got quite a few ticks on the walk, but we were able to get rid of them all without much trouble. Definitely recommend this to anyone looking for a fun camping trip.",
   "I have visited all of the state parks in North Dakota save one. (Graham's Island). My favorite so far is Cross Ranch. I have camped there  numerous times. For newcomers, it's a little tricky to find. It's off the beaten path for sure. But it's worth it.\n   The park is divided Into two sections about three miles apart. They are connected by a trail. The smaller section cannot accommodate large RVs. 20ft. max. However, I like the smaller section better. (Also known as Sanger campground). It's very close to the Missouri River. If you like to go rafting it's perfect. There's even a rafting company in nearby Washburn, that rents rafts and will even pick you up downstream.\n   The Park is open year-round with plenty of activities. There's a nice trail for cross-country skiing in the winter or hiking in the summer.\n   If you're a fisherman, the Missouri River has plenty of fish. Although I am not a fisherman, I heard there's walleye! I don't like to fish but I love to eat them! Yum!\n   The last time I visited, there were upgrades taking place at Sanger. Water was being installed. Electricity is available as well.  There are vault toilets. Althoughl Sanger was considered primitive, that may not be the case now.\n   The park is well-maintained and the toilets are clean.\nI think the best thing I like about the park is the location. Next to the Missouri River, it's awesome. I'm not the type of person that likes to go out on big water but I like the Missouri River and I'm not afraid of it. It has a slow-moving current and is very picturesque even if you don't want to get into the water. I've heard that there are bald eagles living along the river.\n   If you're the type of person wanting to get away from it all, Cross ranch is the place to go!",
   "We come here every year for the Bluegrass Festival. Good place to camp with clean facilities and a playground for the kids. Had to put up with the ticks (and tree worms this year) but still had fun.",
   "We love camping here especially in the fall. Lots of wildlife and great trails. Friendly and helpful Park staff. Everything is well maintained",
   "We rented a cabin cross country skiing for two days very peaceful and quiet and relaxing the staff there were a great to talk to and renting skis from them was great"
  ]
 },
 {
  "name": "Salem Sue",
  "address": "New Salem, ND 58563, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/79fb65b4-932e-11ea-9d38-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=11991427484554638302",
  "source": "GoogleMaps",
  "reviews": [
   "Very large cow. A good place to stop for a break. There are some picnic tables. Also, plenty of portable toilets. Lovely views all around. Great high place to take pictures from. There were some orange fencing that I did not care for. Apparently Salem Sue needs a new paint job.",
   "Salem Sue is very impressive as well as the view from where she sits especially from the top of the hill. It was really interesting getting info on her dimensions. Highly recommended!",
   "What a wonderful place to visit. I've seen this from the interstate many, many times and this time I finally went up the hill to see the \"cow\" up close. \n\nIt was well worth the time! The view is amazing and it is a wonderful place to stop and enjoy the peace and quiet, and eat your lunch. \n\nSalem Sue is every inch as big as she looks. A great landmark, well kept, and not commercialized. A free will donation suffices to keep Sue in good shape. \n\nTake the time to visit Sue if you are in the neighborhood. I wish I had done so years ago. I won't pass her by next time.",
   "Salem Sue (or The World's Largest Holstein Cow) is a large fiberglass Holstein cowsculpture located in New Salem, North Dakota, United States. Salem Sue was built in 1974 for $40,000. The project was sponsored by the New Salem Lions Club in honor of the local dairy farming industry. The artist was Dave Oswald and the construction was done by Sculpture Mfg. Co in La Crosse, Wisconsin. The statue stands 38 feet (12 m) high and 50 feet (15 m) long. It sits on School Hill near Interstate 94 off exit 127 S and can be viewed for several miles.",
   "If you're traveling as a tourist on 94, there's no excuse not to take fifteen minutes of your time and drive up to see Salem Sue. A quick walk up the path gets you a fun photo op with the world's largest Holstein statue and a great view of the surrounding land. If you have a few minutes extra, walk all the way to the top of the hill and get a stunning 360 degree panorama of the area surrounding New Salem.\n\nFree to everyone, but drop a buck or two in the donation box for Sue's upkeep."
  ]
 },
 {
  "name": "Pioneer Park",
  "address": "1500 River Rd, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=11543092900870154363",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Mandan Park District",
  "address": "2600 46th Ave SE, Mandan, ND 58554, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=4629695312082661366",
  "source": "GoogleMaps",
  "reviews": [
   "",
   "",
   ""
  ]
 },
 {
  "name": "General Sibley Park and Campground",
  "address": "5001 S Washington St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7a4c1602-932e-11ea-aa9d-14b31f159f22.png",
  "tags": [
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15649938431183136226",
  "source": "GoogleMaps",
  "reviews": [
   "It was winter do long to of snow.  Great 24 hole disc golf course though.",
   "I love General Sibley! It's clean n quiet. Nice frolf course and a boat ramp. Many beautiful birds to enjoy listening to. Day use and camping areas. Tenting here is awesome!",
   "Massive Campground, beautiful clean, boat launch and water access is available. Convenient dump station yes electricity at the sites. All right close to Bismarck and Mandan",
   "I had a great experience here!. Friendly lady ant the desk and a great camping area for our tent. We were here on the 4th of July and there was fireworks all evening at the homes around the park so that was neat.",
   "A very well maintained park.  A peaceful place to take a break from the busy part of life and relax.  No matter if you just want a place to stop by and take a walk with your best friend or maybe spend some time taking a few photos of all the nature you will embark on upon your visit,  I am without doubt you will have a splendid time here."
  ]
 },
 {
  "name": "Peacock Alley",
  "address": "422 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7a9a73ae-932e-11ea-87bf-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14623071309367097821",
  "source": "GoogleMaps",
  "reviews": [
   "In town for a family event - stopped by Peacock Alley for drinks and ended up having dinner there too.  Super wine menu.  Food was excellent.  And staff was so friendly!  When you're in Bismarck, go eat at Peacock Alley!",
   "This place has been around for several years and moved from one location to the current one. Occupies the ground/street level of a multi-story building with apartments for the disabled on the upper floors. The main entrance opens into the bar area (tables and around the bar) with a corridor between the bar room and the sit-down restaurant. There is also an outdoor patio area. Extensive menu, lots of microbrew and we got an amazing waiter, Rudy, who made sure we got good vegetarian food. Everything he recommended was amazing. This was definitely a great choice for us!",
   "My stake was really good cook, and awesome service, I was there like a month ago",
   "This place is awesome. Great menu, huge beer selection and quite a few beers brewed right in house. Great place atmosphere too. I would recommend it if you are just looking for great local beer or if you want a complete pub experience.",
   "Ordered the Salmon dinner via DoorDash for my husband while he was spending the night in Bismarck.  He called me back and said it was THE best meal he has had on the road.  The bed of spinach the salmon dinner was on was wilted perfectly and the salsa on top was fresh and delicious.   The onion rings were crispy and tasty.  He was very happy with his dinner.  And the portion was perfect for him.  \n\nIf I ever find myself in Bismarck, I will certainly stop in for a meal in person!"
  ]
 },
 {
  "name": "Lewis and Clark Interpretive Center",
  "address": "2576 8th St SW, Washburn, ND 58577, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7ae11be8-932e-11ea-87b4-14b31f159f22.png",
  "tags": [
   "art",
   "tour",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2139924079787380703",
  "source": "GoogleMaps",
  "reviews": [
   "Husband and I enjoyed our short trip here at the end of the day. Wonderful exhibits, educational information, gift shop, and staff. Definitely worth a visit when you are in North Dakota.",
   "Give it three stars because the restrooms are clean, good parking for RVs and nice sculpture art outside.  Did not go in because we had limited time and the cost is $8 per adult.  The items in gift shop were nice however also expensive.  From what I could see it looked like nice exhibits and would probably spent some time going through the center if it was $3.",
   "I would have liked to have seen more about their winter here and their return visit. I think all the centers should just tell the story of the trio up until that spot. Kind of let each interpretive center be like a continuation from the last. This would encourage people to tour the entire trail.",
   "Really enjoyed it, very informative.\nI, also, enjoyed walking to the river on the Lewis and Clark Legacy Trail. \nThe information that I found said the trail was 2.2 miles, that's 1 way, end to end; I went  a bit past the riverboat and back and went 3.5 miles. It's a very nice, easy walk with some elevation; there's, also, a Frisbee Golf course. \nThe entire visitor center was well worth the stop.\nMake sure you go to the Mandan Fort, also.",
   "Great museum full of information and stories about Lewis and Clark and their journey out west."
  ]
 },
 {
  "name": "Fort Mandan State Recreation Area",
  "address": "838 28th Ave SW, Washburn, ND 58577, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b2a5a36-932e-11ea-93f2-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "historic",
   "tour",
   "unique",
   "history",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=17253766070189819393",
  "source": "GoogleMaps",
  "reviews": [
   "A great visit to though historic site and re-creation of Ft Mandan.  The tour costs $8.00 per person and covers the Interpretive Center as well as Ft. Mandan.  The ladies providing the tour were fantastic, very knowledgeable and good communicators. Don't be shy if driving a big RV and towing a car. There is a turn around loop next to Ft Mandan.  No problem with a 42 motor home towing a car.  I parked on the side of the road facing out.",
   "It was nice. But, the fact that is was a reproduction and at a different place was a bit of a let down. But, I understand about it being lost. The inside rooms were really nice. They gave an insight to their lives in the area.",
   "Unique fort replica (@2 miles from Lewis & Clark Interpretive Crt and museum) with history of Lewis & Clark who wintered here from 1804-1805.  The museum covers ND history, several local Indian tribes & Lewis and Clark explorers.  No discounts but only $8 pp for museum & fort tours.  Great gift shop.  Park Rangers are very nice & helpful.",
   "We arrived after 3:00 pm, which was the last docent-led tour; however, one of the docents took us on his own tour. It was informative, and I leard a few things that I did not glean from reading \"Undaunted Courage\" or by watching the PBS documentary on Lewis and Clark.",
   "Awesome recreation of Lewis and Clark's winter fort. Great tour guide gave a great lesson and answered all our questions."
  ]
 },
 {
  "name": "Knife River Indian Villages National Historic Site",
  "address": "564 County Rd 37, Stanton, ND 58571, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b74aafa-932e-11ea-9089-14b31f159f22.png",
  "tags": [
   "parks",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7721870831892448350",
  "source": "GoogleMaps",
  "reviews": [
   "Initially I stopped here for the cancellation stamp in my national parks book, but this stop was so much better than I expected!  Easily one of my favorites.  Fascinating earth house model, beautiful grassy area with visible mounds where these homes used to stand (and had collapsed), extremely helpful and kind rangers, and a great museum with lots of interesting bits of information.  We even got to see some archeologists in action while we were there!  Lovely and interesting place I would highly recommend to everyone!",
   "Nife River Indian village was nice all the facilities are clean. The walking trail is great because it had great little interesting  displays of their huts and way of life. We saw a spotted fawn really young right beside the trail",
   "Great history to be had. Try to visualize life here in the 1790s. Camping is close by and the trails are great! Nice museum!",
   "Very neat Indian home and several fields showing where other huts once stood.",
   "Pretty cool place to visit. Every dip in the ground was once a house."
  ]
 },
 {
  "name": "Prairie Knights Casino & Resort",
  "address": "7932 ND-24, Fort Yates, ND 58538, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7bc7fcc8-932e-11ea-88c3-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2787267107565478786",
  "source": "GoogleMaps",
  "reviews": [
   "It's okay, really like the size of the room & the bathroom was super nice. Casino left you desiring more tables & more drinks as it's all self serve. Non smoking slot machine area was nice, but not a lot of options. Food was decent but nothing worth remembering. Customer service was not outstanding, but employees were cordial. Recommend for something to do for one weekend but won't be back again.",
   "The employees are super. Friendly and courteous. Always willing to help you in some way.",
   "Fun place to get away to, but don't expect much from the amenities... very old and outdated.  It's a nice drive out from Bismarck, and something to do.",
   "Nice clean casino. Full bar and beautiful hotel with two restaurants and food served until the wee hours. Pool and fitness room as well. For a great time and great service give this casino a try. I loved it there!",
   "Great casino and staff. Would definitely recommend for a stay or to play."
  ]
 },
 {
  "name": "Kirkwood Mall",
  "address": "706 Kirkwood Mall, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c0a8500-932e-11ea-83d4-14b31f159f22.png",
  "tags": [
   "organized"
  ],
  "link": "https://maps.google.com/?cid=14276048413847494586",
  "source": "GoogleMaps",
  "reviews": [
   "As long as I can remember, Kirkwood Mall was the big shopping places to go when in Bismarck... a lot of businesses have left with new ones not far behind... hope they fill the Herbergers spot this summer... great place to shop..",
   "This is an ok mall. If you want to call it that, there is not alot of store choices here. Now there is several in the area. However, you do get the small town feel, which I think is great. I hate to see these dieing off.",
   "The few stores I was interested (Penney's and CJ Banks) in were clean and organized. The sales associates were friendly and helpful. The mall as a whole would have rec'd a five star rating but their parking lot needs potholes filled.",
   "Back years ago this was we're everyone shopped. It was busy and so hard to park. Now this dinosaur looks so sad even thou maintained well it is over. Overpriced stores with only overpriced stock. It has only become a power walker heaven for the 60-95 age group. I love that on a cold North Dakota morning they have a warm and safe place but I know they are not shopping.",
   "Impressive mall.   Reminds me of what a great mall looks like. Plenty of thriving stores."
  ]
 },
 {
  "name": "Zorells Jewelry",
  "address": "221 S 9th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c534f3e-932e-11ea-857b-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15906447211621727334",
  "source": "GoogleMaps",
  "reviews": [
   "I came in to have a ring setting changed. Keith was more than helpful. I didn’t know what I wanted. At the end of the day I knew I had picked the right jeweler. Very knowledgeable. Not pushy. Extremely courteous. Very impressed. I cannot wait to see my finished product.",
   "We heard from friends (who got married a year before us) they got there ring from here and that is where we will find ours! I was skeptical at such a bold claim but, they were right and Zorells did not disappoint! Tim Jr helped us pick out the ring and he was very knowledgable and helpful! They have a great selection by the way! They made sure the ring came in before we took off to Hawii! After she said yes in Hawii, she did the usual things for brides and lost weight. Little did I know the a diet would change her finger and ring size. Zorells has been great about resizing the ring and has not charged us for it ever! (We resized the ring 3 times, every time smaller) Zorells has done a outstanding job with the ring on all fronts! I would strong encourage you to go here! (Picture does not do the ring justice! Looks way better in real life!)",
   "Hannah, my \"sales\" lady was very knowledgable and patient...I really liked the fact that she was not pushy in the least.",
   "The staff at Zorell’s are awesome! They always take care of me and have an awesome selection of jewelry. Their new store is amazing and worth a visit. Also, thanks to Jeff for the speedy repair to my bracelet!",
   "Pam was absolutely wonderful to work with. She took the time to help us fill out a wish list for my wife and show us new interesting pieces specific to her taste. The jeweler/goldsmith is the greatest!!! He buffed, polished, and replaced a diamond in my wife's wedding set. She was thrilled to get her ring back in new condition. Her smile sparkeled as bright as her ring. Thank you, Zorells!"
  ]
 },
 {
  "name": "Lake Sakakawea State Park",
  "address": "781 42 1/2 Ave NW, Hazen, ND 58545, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c97102e-932e-11ea-bd30-14b31f159f22.png",
  "tags": [
   "parks",
   "hike",
   "family",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2267853470652437051",
  "source": "GoogleMaps",
  "reviews": [
   "Very peaceful and beautiful too. This is one of the nicest state parks in the west I've seen. Even if you don't get out on the lake it's a great place to hang out and watch the world go by.",
   "Favorite campground and have been coming here for years with my family.  Love the super friendly staff and the fact the camp sites are spread out.  Love to get out in the evenings to catch the wild life.  The park and the comfort stations are very well taken care of. If you like to hike there are plenty of groomed trails to get out on.   Best of all, mother nature creates some beautiful picture taking opportunities!",
   "And fishing here before pretty good place to go good place for family under the sun tried out you might like it",
   "Just beautiful and so much to do!",
   "Beautiful park.  Well maintained.  RV park is no cell but they need sewers.  The comfort station has three women's stalls and two showers.  Good hot water, low water pressure."
  ]
 },
 {
  "name": "Lewis and Clark Riverboat",
  "address": "N, 1700 River Rd, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7ceb9a5a-932e-11ea-a23e-14b31f159f22.png",
  "tags": [
   "cheap",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1145138643536479602",
  "source": "GoogleMaps",
  "reviews": [
   "The drinks are fairly priced and the trip is long enough to relax, but not long enough to get bored. Don't go during the hot parts of the day because there's no AC.",
   "This is such a waste of money!!! The history was a joke. Two or three minutes of history and then it repeats. We drove up the river less than a mile and circled back. The went the other way. The beer is cheap. Get there earlier to get seat on top.",
   "Gorgeous views and courteous staff.",
   "It's a wonderful place to enjoy the river",
   "Very cool and smooth ride.  The boat was nice, well kept, friendly staff and crew.  I sat on the top deck directly in front of the captains helm. It was a great experience."
  ]
 },
 {
  "name": "Bismarck Event Center",
  "address": "315 S 5th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d3d852c-932e-11ea-afe1-14b31f159f22.png",
  "tags": [
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12197383683507922901",
  "source": "GoogleMaps",
  "reviews": [
   "The new addition is clean and looks really nice up to date. Its great for the smaller events that they hold. I wish they would get more big name concerts like Fargo dome does. Great place for events the food and drinks could be a little cheaper though. Just be aware they close off part of the south parking lot during concerts, rodeos,  monster trucks, etc. which can make it very difficult to maneuver in the parking lot.",
   "I was a vendor at the Pride of Dakota in December of 2019. The staff is very friendly directing you once you pull into the parking lot. I love how you can pull your car inside to unload.  Especially in December. Great place to be a vendor as many people attend from the surrounding towns.",
   "Great meeting place. Nice atmosphere, temperature and walking around space at break time. Clean.",
   "I went to the tribes pow wow. It was an experience, I never seen so many dancers and all looking so beautiful. Plus some of their dance contest were different,  I loved it.",
   "This place is very disappointing. I honestly don't know why the city decided to build the new addition when they can't fill the current venue. The staff can not get new artists. All they want in there is old outdated artists that would be better off at a casino or a county fair. When they do have great bands like, Avenged Sevenfold, Five Finger Death Punch ect, they act like they're afraid of them. The community wants better and newer groups, not musical's, plays, ballet, piano artists that are the same every freaking year!"
  ]
 },
 {
  "name": "McDowell Dam Recreation Area",
  "address": "1951 93rd St NE, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d831ae4-932e-11ea-ad92-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8190355944822666600",
  "source": "GoogleMaps",
  "reviews": [
   "We love to take our dogs to walk here its perfect!!",
   "Beautiful little out of the way park.  Nice lake and picnic spots.  Nice restrooms.  Paved walking path around the park.  Dogs on leash welcome",
   "Nice place to visit.",
   "Convenient, clean water recreation area.  \n\nEven if the fish are not biting, good times.",
   "Very clean beach with good sand. Good place to swim or rent a kayak. Kayak rental prices were very reasonable and the girl there that helped us was very friendly. Bathrooms were a little questionable."
  ]
 },
 {
  "name": "The Enchanted Highway",
  "address": "607 Main St, Regent, ND 58650, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7dcdbf3a-932e-11ea-b9c7-14b31f159f22.png",
  "tags": [
   "kids",
   "art",
   "tour",
   "creative",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11631877975353705266",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful drive with amazing art sculptures all along the way.  Plenty of parking at each sculpture location as well as picnic tables and some play equipment for the kids at some.  Awesome ride!",
   "We loved the Enchanted Highway. It was amazing to meet Gary! Here's the beautiful tree outside the gift shop! Tour the great state of North Dakota and make sure you have this on the list! We're going to stay at the Enchanted Castle the next time we're through!",
   "Fascinating story, stop in to the Enchanted Castle hotel and have Gary tell you his story. The Enchanted Highway is a work of love and determination. Gary and a small group of farmers are working to save the small farming community and they found a interesting and creative way to accomplish this. Hearing the story is worth the trip.",
   "What a neat concept. My kids loved getting their pix next to each sculpture.",
   "A super fun drive along scenic roads. The sculptures are super interesting and fun to look at."
  ]
 },
 {
  "name": "Assumption Abbey",
  "address": "418 3rd Ave W, Richardton, ND 58652, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e14dbc0-932e-11ea-b20b-14b31f159f22.png",
  "tags": [
   "historic"
  ],
  "link": "https://maps.google.com/?cid=17555598069122072851",
  "source": "GoogleMaps",
  "reviews": [
   "Did not go inside but had to stop when I saw the beautiful architecture on this church an amazing building worth the stop to take 5 minutes out of your day",
   "Always awesome. Historic. Benedictine hospitality. Beautiful prairie.",
   "Beautiful and full of grace. Was the home of one of my most favorite people.",
   "Wonderful Wonderful  .\nHoly,Holy,Holy is the Lord Jesus. Hallelujah❤🎶",
   "A must visit when passing through Richardson! A truly special and interesting place."
  ]
 },
 {
  "name": "Belle Mehus Auditorium",
  "address": "201 N 6th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e739f1e-932e-11ea-b84e-14b31f159f22.png",
  "tags": [
   "performance",
   "music",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=2244031706542278273",
  "source": "GoogleMaps",
  "reviews": [
   "A delightful night of beautiful music in a first class venue. Our balcony seats afforded excellent acoustics, unimpeded view of the stage, and reasonably comfortable seats. I'm not petite, so shoulder room was wanting. We sat right of the stage, about as far right as you can get. There are two more sections of balcony seating behind us and I could image the view would be great. I bought the tickets two weeks before the performance of Bismarck-Mandan Symphony's American Pie concert. I think that might have been just a tad late. Still, great selection. Looking forward to our next visit.",
   "Wonderful venue for concerts and other performances!",
   "Watched The Dakota Film Festival and it was very enjoyable.",
   "Had a great time but was disappointed that only one Pop machine and it broke down",
   "I Love This Historic Place. it's just Sooo Beautiful. I recommend if you like Beauty, Then Check it out ! Esp. When \"Surprise Church\" is @ It."
  ]
 },
 {
  "name": "Theodore Roosevelt National Park",
  "address": "North Dakota, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7eb51640-932e-11ea-bffb-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "knowledgeable",
   "history",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10763935676142240939",
  "source": "GoogleMaps",
  "reviews": [
   "When I was working in North Dakota, I always looked forward to hiking and fishing. I saw all there was of Theodore Roosevelt National Park, hiking it, or just driving around. Saw some incredible bison breeding behavior. Some of the views in the park are unrivaled.",
   "Theodore Roosevelt National Park is a true hidden gem!   Love the bison and wild horses, especially.  Best part is many good hiking trails and not very many people.  The rangers at the visitor center are wonderful!",
   "It's North Dakota, right???    But wow.  A must see place... And get it at sunset too.   Great picture taking location.      Bring food and water though because there's nothing around",
   "Theodore Roosevelt National Park is a hidden gem!   One of the most intimate of all the national parks, it boasts many hiking trails of various lengths and levels.   Be prepared to see American Bison in their natural habitat of the nineteenth century, comical prairie dogs in extensive ‘towns’, wild horses roaming and running with freedom, along with elk, antelope, deer, coyotes, rattlesnakes, and more!   Walk in the footsteps of Theodore Roosevelt, where he ranched and wrote prolifically.  The history of this area is impactful beyond what most people realize.  Stop at the visitor centers to visit with super friendly and knowledgeable staff. Don’t miss this National Park!",
   "An amazing national park. Views unbelievably gorgeous, expansive. Saw bison, coyote, wild horses, deer, prairie dog cities and cool looking birds. Drive through of park is good but best vantage point is buck hill and a short climb up a asphalt trail."
  ]
 },
 {
  "name": "Badlands Overlook",
  "address": "Medora, ND 58645, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7eff3fec-932e-11ea-b0fa-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=9909826043611695252",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful scenic drive worth a stop. We saw buffaloo up close, a coyote crossed the road in front of us with her pup, and absolutely loved the fields of squeaking prairie dogs",
   "Amazing beauty and so worth the trip",
   "Last point to view TRNP on the southern loop as the road is it the last few miles. Absolutely gorgeous!",
   "Beautiful place to drive and hike.",
   "Gorgeous view , always something new each drive through."
  ]
 },
 {
  "name": "Scandinavian Heritage Association",
  "address": "1020 S Broadway, Minot, ND 58701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7f56d758-932e-11ea-8057-14b31f159f22.png",
  "tags": [
   "learn",
   "walk",
   "walk",
   "learn",
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13441548596445731420",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice!  Great for people to learn a few things about Scandinavian heritage. The monuments, statues and buildings show beautiful heritage.",
   "I absolutely love this place. You need to visit this place in July when all the walkways are filled with flowers. Its a stunning park. Its great if you want to walk the paths enjoying the weather, or a place to have lunch on many of the tables scattered around, or just hang out in general. One of Minots best places to be.",
   "Nice little place to visit while in Minot.  Just wish that the buildings had been open to go inside.  Gift shop was fun.",
   "Such a beautiful park with water features,  amazing buildings statuary and flowers! Makes you proud to be Scandinavian!",
   "Wonderful, unique place to learn about the cultures of Denmark, Sweden, Norway, Iceland, and Finland. We recently visited there with my husband's parents and our children.It's so fun to look for trolls, and our youngest enjoyed roleplaying the Three Billy Goats Gruff across the bridges! I love the natural wood smell inside the Gol Stave Church - and the carvings are intricate and beautiful. It's a very peaceful place, and the volunteers I've met there have been very friendly and knowledgeable. One of my favorite statues is the one of Hans Christian Andersen. You can see some hints of his stories in the statue, like a duckling and a pair of scissors. Sometimes the sauna door is open so you can see the sunlight streaming through the beautiful stained glass windows. Don't forget to check out the Heritage House a short walk down the road from the cabin - I overlooked it the first time I visited the park.\nThe gift shop area is fairly small, and doubles as the Visitor's Center for Minot, but there is still a great variety of trinkets, t-shirts, gifts, books, and treats. Definitely check out the toffee chocolate bar from Iceland; it's one of the most expensive chocolate bars I've ever bought, but soooooo very worth it! (Actually, don't  - if there's more demand the price will go up and I'll only be able to get it at Christmas!)"
  ]
 },
 {
  "name": "National Buffalo Museum",
  "address": "500 17th St SE, Jamestown, ND 58401, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7fa4b73a-932e-11ea-8742-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "affordable",
   "walk",
   "free",
   "walk",
   "tour",
   "free",
   "library"
  ],
  "link": "https://maps.google.com/?cid=5493795548810972462",
  "source": "GoogleMaps",
  "reviews": [
   "Cute place! Great for families, couples, or groups. I highly recommend the gift shop before the Jamestown village, the people who run it are lovely. The giant buffalo is a must see along with the buffalo family at the gift shop! P.S. if you see the buffalo, buy a feed bag for 50¢ from the front counter... they love it!",
   "A bit pricey, with buffalo were a little closer. But loved the experience!",
   "I enjoyed this place. Small but good. I think kids would enjoy a stop here. Very affordable. Plus, there is an observation deck to look at the buffalo. The gift shop has great gifts too.",
   "Wife wanted to see the world's largest buffalo 😉\nWe were on our way to Bismarck from Fargo and Jamestown seemed like a good place to pullover for a break.  Google Maps directions took us along a gravel road to get here but upon leaving my TomTom GPS avoided that gravel road.\nThis museum has a building that serves as the \"main\" museum that has a gift shop and you pay/donate to go through the exhibits but there is also an outside \"town\" to walk through (most buildings have a donation box) and step into some of the buildings that are on \"display\" with furniture, manikins, etc.\nAt one end of the town is a playground/picnic area and a path leading to the world's largest buffalo.  There are two pay binoculars here to use to see the buffalo nearby is desired.\nParking is free, we parked near the chapel and I believe I saw a handicap spot here as well and perhaps near the museum as well?  Some folks just drove to the end of the town, made a u-turn and drove back.  It wasn't too busy when we visited.",
   "This is the second time we have stopped in on our travels. Love being able to see the buffalo and enjoy the walk around the town. The museum has a great little free library and the tour inside is very informative. We really enjoy the walk around the Frontier Village also."
  ]
 },
 {
  "name": "Beaver Lake State Park",
  "address": "3850 70th St SE, Wishek, ND 58495, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/802470f4-932e-11ea-b5fc-14b31f159f22.png",
  "tags": [
   "eat",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=10447449973551673339",
  "source": "GoogleMaps",
  "reviews": [
   "Campground is great, but bring a 50 foot hose if you are camping. The water hookup is far away.",
   "Good place for camping. This park is in bortle scale class 2 dark sky, for people like astrophotography this gonna be the right place for you.",
   "We almost had the place to ourselves because It was almost off season. \n   The shower house is awesome. It's heated and neat as a pin.\n   The park is well maintained. Only one employee on hand but she stopped by to see if we needed anything.\n   Self check in wasn't tough. You need a cell phone though and a credit card with this method. Check or cash are accepted as well with a drop box. No cell phone needed with this method. Honor system somewhat.\n   A nice dock for fishing but you can't eat the fish because of algae problem.\n   This place is very dark at night with not much lighting. 🔦 Flashlights are advisable.\n  \"Drive thru\" style campsites. Picnic benches, as with most state parks, are supplied with nice fire boxes for cooking. Electricity as well with clean outhouses nearby.",
   "Great place. We only stayed a quick night driving cross country.",
   "Nice and clean Park. Shower Room is perfect 👍🏻 Very quiet and we feel safe in the area. Staff are nice too"
  ]
 },
 {
  "name": "Trapped in Bismarck",
  "address": "3333 E Broadway Ave #1219, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8080521e-932e-11ea-a5a2-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17616413783034285121",
  "source": "GoogleMaps",
  "reviews": [
   "We went here with a group of 6 and did the mafia room. It was way to many people for this room. The game maker for the room was not a very pleasant person. She was very unfriendly whenever we tried to joke with her and when she gave any clues they were usually delivered in a very condescending manner. At the end we laughed about how many times she just said rude comments like \"Does anyone in this group know how to open a lock?\" And \"Uhhh you have to hand it to me...\" I feel like this is a great addition to Bismarck and I hope I continues to improve. It could start with training the staff to be a little more upbeat and friendly or at least able to give information in a less rude manner. I've done multiple escape rooms in Minneapolis and each time the game maker is the person who made a huge difference in how enjoyable the experience is. It's not a good feeling to already feel lost then look over and see this unfriendly person judging you. I will also add that one of the boxes was missing a lock and the employee straight up told us that if she hadn't forgotten the lock we would have never escaped. She wanted me to include her name in the review because she apparently gets bonuses based on reviews but I don't think she wants her name on this one.",
   "We escaped the Z.M.B. Virus Trials featuring Jordan as The Patient in 51:16! Super fun and great puzzles! The Patient was funny and scary but not freeky. Had a great time and recommend Trapped in Bismarck to anyone who likes puzzles or games!",
   "Highly recommend Trapped if your looking for something fun to do with a group! Our Guide was great, gave us clues just when we needed them, we didn't \"escape\" but she did walk us through it in the end and explained what we missed, ect. Great place, great staff!",
   "We did a room one night and had so much fun we went back the next day and did two more!! Jordan was fantastic and we were able to escape all 3 rooms!! Would definitely go back!! Go Team Megadesk!!!",
   "I came here with a group of friends and had so much fun. All the puzzles were fun to figure out And the storyline was cool. Our guide Anna was hilarious and fun. She helped us pass the room and made us laugh along the way. I definitely will be coming back here again"
  ]
 },
 {
  "name": "Paul Broste Rock Museum",
  "address": "508 Main St, Parshall, ND 58770, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80dddd28-932e-11ea-a61e-14b31f159f22.png",
  "tags": [
   "kids",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11274924652717253088",
  "source": "GoogleMaps",
  "reviews": [
   "Very educational and the kids enjoyed it. This place has a great collection and exhibits with interesting rock formations.",
   "Awesome place for those interested in the earth and what she puts out. (Rocks)   Love rocks myself so this was an awesome place. Miss Joyce was very informative about the whole place. When we come back to Stanley we will be back. Thank you Mods Joyce. 😉🌻",
   "Photos do not do justice to this local geological treasure. The museum is worth a special trip. Nothing else in the world like the Infinity Room.",
   "This is an incredible place; well worth the effort to go to Parshall and see. Doris gave us an excellent tour with history of the museum and knowledge of the rocks.",
   "Charoyal and Doris are the best! and most informative regarding this museum and the area.  The museum is worth the $5 admission.  A must visit."
  ]
 },
 {
  "name": "LÜFT Rooftop Bar",
  "address": "510 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/812c4c9c-932e-11ea-ba03-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1420304215883871552",
  "source": "GoogleMaps",
  "reviews": [
   "Aesthetically appealing but service was fair (had to order everything at the bar) and food was only okay.  The worst part was the constant stream of rednecks driving up and down main street in obnoxiously loud and smelly vehicles. As an \"outside\" visitor, this reflected quite poorly on the community.",
   "Really cool rooftop bar. Just 3rd story, but on a nice day it’s beautiful. Cool bartender named Henry from my home state of Texas!!! Awesome service and great craft cocktails. Also, a pretty good selection of craft beers and local brews. Nice place, I’d hang here if I were a local. Thanks guys!",
   "I’ve been here several times and the food has always been great as well as the drinks. Tonight I had the humps burger and truffle fries and once again I’m blown away at the quality of this “bar food”. AMAZING! Best burger I have had in Bismarck for sure!",
   "One of my favorite places in Bismarck. Great for weekends. Usually pretty light on bat traffic. The summer you can hang out outside.",
   "One of the nicest bars in town. Decor is like the San Francisco area, and they have fire pits to keep warm outside at night. Plus the view is great, not many other bars let see all of downtown. But this place is limited by the bathroom selection. Durring peak hours their is usually a line, and the extra bathrooms are down the elevator (or stairs is your in a hurry).\nEdit, there's another bathroom on the left hand side. Five stars!"
  ]
 },
 {
  "name": "Jumped-Up",
  "address": "2390 E Bismarck Expy, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81760128-932e-11ea-beb7-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10266733695405172682",
  "source": "GoogleMaps",
  "reviews": [
   "Had a birthday party their today and what a great experience! At the door they even provided masks if you were feeling under the weather or wanted to be cautious! Hand sanitizer was provided through out the building. And the employees were spraying Lysol periodically! Very impressed!",
   "Great place for a birthday party. Our group had a blast!",
   "Had our daughter's birthday party here.  It was absolutely perfect for a bunch of kindergarteners. Everyone went home happy and tired.  Very nice and clean facility, and extremely helpful staff. I'd highly recommend for a party, or if your little one needs to run off some steam on a cold winter day!",
   "My son and I have only been here once or twice and haven't been here for nearly 2 years but the owner remembered us from our prior visit. A very fun atmosphere, always clean, and the staff is always friendly. Would recommend to anyone with children",
   "This place is awesome. First time coming here and we will definitely come back. Our son loved it, and for the price it was worth every penny. Is a great way to burn that extra energy off kids seem to always have."
  ]
 },
 {
  "name": "Roosevelt Park Zoo Office",
  "address": "1219 E Burdick Expy, Minot, ND 58701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81b6dbe4-932e-11ea-b0af-14b31f159f22.png",
  "tags": [
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=711113622163287306",
  "source": "GoogleMaps",
  "reviews": [
   "Extremely sad... the tiger was pacing because it was extremely stressed out (along with no mental/physical stimulation) in it's small, muddy \"enclosure\" with nothing but wooden stumps around in it... the okapi was closed in a small room with ONLY a little bit of sawdust in the room, nothing else.... that was the final straw for me (among several other things) in my 20 min visit that caused me to abruptly leave. No photos because frankly it was too sad to take any. I do not expect this to be like the Zoos in San Diego, Toledo, etc... but they should at least be able to properly accommodate their animals... would give 0 stars if I could.",
   "Cute little zoo, but I feel the cages need to be.bigger for certain animals but I do like the setup as how they have cages going across trees for the\nLemers and Monkeys which is cool but for the bigger Animals, I feel they need bigger cages. Still a nice place to go on a little adventure.",
   "This zoo is making huge improvements to the animal enclosures right now. The new enclosures are beautiful and what these animals deserve. The landscaping and upkeep of the zoo is just beautiful and really well cared for. The zookeepers love to share knowledge and help families get to know the animals better!",
   "Beautiful zoo. Many animal exhibits, many activities for children an adults. Well done!",
   "This is such a nice zoo! It's better than some of the zoo's I've been to in cities twice Minots size. They have a kids train zoo tour (I think its $5) and concessions and bathrooms throughout. There are lions, tigers, bears,giraffes, monkeys, lemurs, penguins, some local wildlife(wolves, buffalo, etc) and much more! It's in Roosevelt park, which is a beautiful park and also has a public pool. Highly recommend!"
  ]
 },
 {
  "name": "Oxbow Overlook",
  "address": "Arnegard, ND 58835, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81f71a64-932e-11ea-b80f-14b31f159f22.png",
  "tags": [
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16809737440446454294",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful culmination to the 14 mile road travelling through Theodore Roosevelt National Park.  You can see for miles and look down into what my family calls the baby Grand Canyon. There is access to trails for hiking and enough parking to make it convenient.",
   "Great camper spots, nice RV parking, a lot of buffalo or bison. Just wow !",
   "Just love this place and will be back",
   "This overview and hike is amazing! Unforgettable... Got rained on.",
   "One of the top 3 views in the park that do not require any hiking."
  ]
 },
 {
  "name": "Welk Homestead State Historic Site",
  "address": "845 88th St SE, Strasburg, ND 58573, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/824b5676-932e-11ea-98cd-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=6618976039842030820",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place. Very informative staff.",
   "I stopped in the winter,I had drove by lots of times and finally drove out to see it.\n   Pretty cool",
   "If you are old enough to remember Lawrence Welk, you will love the Welk homestead",
   "Interesting stop. Very comfortable, self-paced, walkable and flat terrain. Would see again gladly.",
   "A fun history lesson on the the settlers of the ND prairie and the early life of Lawrence Welk. "
  ]
 },
 {
  "name": "Butterhorn",
  "address": "210 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/828f65ec-932e-11ea-b596-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "unique",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15051704625243083235",
  "source": "GoogleMaps",
  "reviews": [
   "Loved this place. Really nice atmosphere and the food was delicious. It is on the more expensive side, but is so worth it. The food is very filling. I went with several people and we shared a little bit of everyone's dish so we could try many things. I recommend their butter roll and the apple tart. Both were very delicious.",
   "Let's do brunch!  Today I had the Eggs Benedict (very good), but my husband always has the biscuits and gravy.  Says next to his favorite Aunts, the Butterhorn makes the best around!  And he's tried them all.",
   "Best place to eat in town. Amazing food. Wonderful date venue. Butterhorns are warm and delicious. The service and food presentation is excellent. Everything tastes so wonderful and love the unique combinations of different foods together. They perfectly balance sweet and savory foods for a one of a kind tasty entree.",
   "Very nice place. Extremely friendly and competent people working there. The butterhorns were fantastic as was the pasta. We had a wonderful anniversary celebration and were treated so very well. Kudos to ALL!",
   "Excellent food and service. Loved the pear and arugula salad, walleye cakes and beef tenderloin. Only wish the serving size was a bit larger on the tenderloin for $35..."
  ]
 },
 {
  "name": "Walrus Restaurant",
  "address": "1136 N 3rd St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82d410e6-932e-11ea-bccf-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family",
   "pets",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6262898842874529621",
  "source": "GoogleMaps",
  "reviews": [
   "it has 3feet on the best way for you in this country and to be the best way for you to the right person to the right of the city to get the best way for them to get the right people to the party is the fact that means that you're going out with a friend who has a good time and to you and to the people that are doing it has become the best thing for you to have 3to 3 or more in the same place you have at the time and don't have to worry too hard about it and to be the best way in the game and the other thing that means you're a great player and to have a good 423time 353feet in this world 4will 4the game 4will and to have a lot more to 4be is a great way for you guys 4in the ball 4to in a game where you can be the most important person in 4this to the right 4th and to be sure you can play the best way in this world series for the next three games and a lot more than the best of us all season for you in this country where the best place to",
   "I’m a particular guest in that I don’t like my food items to touch each other on the plate. I order accordingly & politely ask for what I need to make the dining experience happy. I was a server for years & get it. At the Walrus there was so much potential for it to be great.... but alas it was a hot mess. Timing was off. Food all came touching & everyone made me feel like it was my fault my order wasn’t as I ordered it to be. Zero apologies or attempts to remedy. No adjustments on price. We had a large tab & I didn’t tip, super rare for me. The staff were not on the same page & definitely not trying to make sure the guest was happy. Would not do this again & I was disappointed.",
   "Cozy environment with truly personal service. Everything my family has tried on the menu tastes great. If you want to try something original but amazing, go for the crispy ravioli appetizer! They named some of their meals after their family pets like the Bailey which is a fully loaded burger. Any time you come, You will see the owner and manager Jill Sanford helping serve and deliver delicious meals. It’s a must stop if you want to have a Bismark experience.",
   "Nice American style restaurant in Bismarck. They're menu has a solid selection of American style food to pick from, but what really won me over was their selection of craft beers. Their staff was friendly, and had great recommendations for what beers to order. Next time I'm in Bismarck I for sure will stop in again.",
   "Just had curb side from The Walrus. Our food was out quickly and still hot when we arrived at home. Tasty as always. Delicious again.  Will do this as long as is required."
  ]
 },
 {
  "name": "La Carreta Mexican Restaurant",
  "address": "505 E Bismarck Expy, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8317f8f6-932e-11ea-ad04-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "tasting",
   "food",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11393059283650318928",
  "source": "GoogleMaps",
  "reviews": [
   "Just ordered it very first take out from La Carreta. Have eaten in before... Perfect. Excellent. Would recommend this Mexican food restaurant to everyone.",
   "Service was fast and the food was excellent. I had the Chile Verde and my wife has the carnitas. The meat was super tender and flavorful. The margaritas we ordered were perfectly made. Would definitely recommend!",
   "Go here for lunch. I've had several lunch menu items. I've never been disappointed and the prices is really good. Huge portions for under $10 weekday lunches. They also have really good complimentary chips and salsa.",
   "BEST IN BISMARCK. AUTHENTIC AND GREAT TASTING FOOD. I GET ARROZ CON POLLO EVERY TIME. 😃",
   "You have not LIVED till you've tried La Carreta's food. The food is excellent and the price is cheap for how good it is. If I want Mexican food I will no longer go anywhere else! The service is also wonderful such friendly staff!"
  ]
 },
 {
  "name": "Fireflour Pizzeria & Coffee Bar",
  "address": "111 N 5th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/835b8028-932e-11ea-ba04-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7962263922213049522",
  "source": "GoogleMaps",
  "reviews": [
   "I've been coming here pretty much since they opened. The food is delicious and fresh. If you want a great pizza, you've found it. They also have coffee and house-made gelato. You're missing out if you haven't visited Fireflour. Don't forget the MexiCoke!",
   "This is how they did our buy one get one free coupon. $13.50 + $15.50 + $10 = $39 + a 20% tip + tax = $50.54. My total for 1 pizza and a salad came to $35!! You know you're scamming people. The 20% tip should be after the coupon is taken off and so should the tax.  That's ridiculous - $35 for one pizza and a salad. Plus you didn't reply to your message on Facebook. Quit taking advantage of your customers like that.  Not cool. The owner did reach out to me and refunded over $8.00 I appreciate that!",
   "I absolutely LOVE this place! My husband and I meet here for weekly dates, and it never gets old.  We highly recommend the Daisy with chili oil! We also add the fennel sausage to that. It is incredible. And to top it off you can add freshly made gelato and a latte!",
   "The barista/server was really nice and sweet. She helped explain anything my party and I had questions on. The pizza was absolutely amazing. You could tell it was all handmade. The coffees we ordered were all delicious. It was over all great service.",
   "The pizzas were okay at best. They lacked flavor and toppings. There was hardly any sauce on either one of our pizzas. They were pretty expensive as well being around 20 dollars per pizza for GF. They were roughly 12 inches in size. The service and staff were good, our waitress did a good job, and the pizzas came out fast. My wife ordered mocha latte and it came out more milk than coffee. We probably will not go back as there are other options that work better for us."
  ]
 },
 {
  "name": "Kobe’s Japanese Steak House and Sushi Bar",
  "address": "915 W Interstate Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83a9a17a-932e-11ea-a52f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9564836237870859269",
  "source": "GoogleMaps",
  "reviews": [
   "LOVE this place! My favorite sushi place in the nation!! I stop by at least once everytime I come into town.",
   "I would normally be giving 4-5 stars...I LOVE Kobe's...but this time I found metal in my edamame...please make sure the staff is being more careful...consuming metal is a terrifying thought.",
   "Favorite sushi spot in Bismarck and Mandan. The Hibachi grill is always a blast when you have a party - business or personal. We almost always start with a King Crab Crunch roll, then order from the grill. Soup comes with the order. Always pleasant service and the food is delicious. Great place for bringing doubters to try sushi for the first time. Plus, call ahead to book a table Friday & Saturday. Even thirty minutes ahead can save you a lot of waiting.",
   "Always fast service with a smile. Prompt preparation of the food.",
   "Love the hibachi chicken and rice.   Great family atmosphere.  My daughter is home from college and was craving the chicken fried rice.  I got her take out and surprised her with her favorite meal when I walked in the door at home. Kobe’s has a fast and friendly pick up service.  I highly recommend Kobe’s for dine in or dining out."
  ]
 },
 {
  "name": "LongHorn Steakhouse",
  "address": "1070 E Interstate Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83f87e2e-932e-11ea-bcdb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15509456774927746285",
  "source": "GoogleMaps",
  "reviews": [
   "We went to Longhorn Steakhouse on ND Smart Restart (5/1) and were extremely impressed with how well they handled the reopening.  The measures they have taken to make sure that everyone is safe and comfortable while serving wonderful food was amazing. Kudos Longhorn!",
   "Great atmosphere. Excellent service. Food cooked to perfection.",
   "I enjoyed my flat iron steak medium rare. The menu gives accurate guidance of how they cook the steaks.  The hosts accommodated my seating request within reason.  It was clean, everyone was polite. The menu can be compatible with a low carb diet.",
   "In comparison to Texas Roadhouse on service and food, this place loses big time, especially since both experiences are similarly priced. The environment in Longhorns is quiet and rustic and more sophisticated, but it doesn't make up for the amount of blah-ness on a menu. Even the burgers are blah. The two stand out items on their menu is The Longhorn and the onion petals.",
   "The parmesan crusted chicken is the main reason I come here. It is so amazing. The steakhouse mac & cheese is amazing as well. I have not had a bad meal here. Service was good and the restaurant was clean. The loaf of bread at the beginning has been slightly hit and miss. Texas roadhouse offers better buns with cinnamon butter."
  ]
 },
 {
  "name": "HuHot Mongolian Grill",
  "address": "Kirkwood Mall, 409 S 3rd St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/844e71a4-932e-11ea-bd95-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3913831326919701944",
  "source": "GoogleMaps",
  "reviews": [
   "The food is fantastic and the staff was friendly. So why the three star review? Cleanliness of the restaurant. The eating area was clean and tidy but the bathrooms, on multiple occasions, were overly dirty. I understand that it's something that is hard to keep up on but definitely ruins your appetite. Any time my friends and I have gone here, at least one of us gets sick. It could just be coincidence but it never happens at any other restaurant we go to.",
   "Awesome food. Great service and friendly staff. Certainly a must try if you are in the neighborhood.",
   "To tell the truth, was very disappointed in the quality and quantity of the food. Most containers were empty and the area was dirty. I gave a three instead of a two because of the cook. He was very personable and entertaining.",
   "Now this is good food. Load up a bowl with everything you think is tasty, drown it in one of their many sauces, and watch them cook it up for you. Then go back and do it again as many times as your body can handle. Who wouldn't love it?",
   "Food was so delicious. The cooks were very friendly and made sure we felt welcomed. It was my niece's birthday and they made sure to tell us that the next time we went through the line, they'd do a birthday flame for her and proceeded to sing to her. Definitely recommend HuHot."
  ]
 },
 {
  "name": "Sickies Garage Burgers & Brews",
  "address": "3130 N 14th St, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8491bd78-932e-11ea-a8bc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=18398216261920847991",
  "source": "GoogleMaps",
  "reviews": [
   "Very good food. Deep fried ham and cheese with a raspberry dipping sauce 😋. Fried pickles one of my favorites. Even though not in Wisconsin their cheese curds were on point. Would definitely recommend and will be back.",
   "This place is amazing! Busy on the weekends. The menu has a variety of burgers and chicken sandwiches, a large selection of sauces for wings and dipping sauces! Great atmosphere with numerous TVs displaying different sporting event. Love the employees, most are super friendly and happy to be here.",
   "We are rating at 2 stars because we never received our appetizers, or food. The place has a nice atmosphere, and the menu looked wonderful. After 45 minutes of waiting for just the appetizer, we left. \nOur server was nice, but we were unable to get any information as to why we never got our order. I literally got up and stood next to the server and attempted to speak to her, but she apparently didn't notice I had been standing there. \nNormally, one would ask the customer, or say, \" let me check on your order\"",
   "Food was very good. Service was wonderful. From the time we ordered until the time we received our food was maybe 10 minutes.",
   "After just over 20 minutes of sitting without even so much as anyone asking if I wanted a drink, I left. I had no less than 4 servers look at me and never so much as acknowledge me. One was busy sitting at a table with his friends. Yes, sitting at the table with them. Menu looked awesome. Too bad I wont go back to try it. Atmosphere was cool, but loud, very loud."
  ]
 },
 {
  "name": "The Toasted Frog",
  "address": "124 N 4th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/84ff0046-932e-11ea-881e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9411066347637293339",
  "source": "GoogleMaps",
  "reviews": [
   "The response that Toasted Frog has shown to the COVID-19 pandemic is above and beyond. \n\nI love to visit for the great apps and martinis, but I love them even more for being a caring and responsible employer. No wonder their employees give great service! They are respected and valued. \n\nKudos, Toasted Frog!",
   "My favorite happy hour down town! From 4-6 PM all beers and martinis are on sale with amazing discounts on delicious food. Parking can be a headache before 5. Not a fast food destination. Love the wings during HH.",
   "The servers were excellent and we loved the atmosphere! Our only complaint was how spicy some of the food was. Our favorite shoestring fries were so spicy I couldn't eat very many, and they took over the flavor of the fish in my fish & chips...  my husband's salmon was also overpowered by the spice.  My son had the sweet potato fries and had the same complaint.  Next time we'll ask for plain salt!",
   "I went to this restaurant and they treated me like a king. I walked in there and the hostess said, \"Look, there's Luke Skywalker, the savior of the galaxy.\" I said, \"Yes, it is I.\" I didn't need any food, I just needed a place for Han to land the Millennium Falcon.\" They said, \"Sure, but we are going to have to charge you an overnight parking fee.\" I asked them if republic credits would work and they refused them. So I left and went back home to Tatooine.",
   "What a good selection!!!  The waitress was outstanding, she took the time to explain everything and was very accommodating.  She even gave me a pitcher of water instead of letting my glass get low.  The pizza was good, the caprese salad was really good too.  Atmosphere was as expected."
  ]
 },
 {
  "name": "The Bistro",
  "address": "1102 E Front Ave, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/854ab08c-932e-11ea-894c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "food",
   "music",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14413294448838855046",
  "source": "GoogleMaps",
  "reviews": [
   "Was a great place to go and meet friends.  Always great service  and food",
   "The service was outstanding. We sat out on the patio and our server checked on us frequently. The beer was cold and he made sure our glasses were refreshed often. I had the seared kangaroo tenderloins and they were fabulous! I highly recommend them. My sister had the lobster bisque and said it was very good. The food quantity was more than sufficient and the food quality was superb.",
   "Fantastic food and service. All food is made at the time it is ordered (i.e., if you order a pasta dish the sauce is made at the time it is ordered).  Daily lunch and dinner specials are posted on their Facebook page.  Live music in the lounge on various Thursdays (dates posted on FB page).  Monthly and quarterly unique specially created cocktails.",
   "We were just visiting Bismarck and a friend recommended this place. Service was exceptional. Menu was intriguing...food was excellent...you gotta love those signature Bloody Mary's..we will definitely be back next time we are in Bismarck.",
   "One of the best places to eat in town for a nice meal."
  ]
 },
 {
  "name": "MacKenzie River Pizza, Grill & Pub",
  "address": "4510 Skyline Crossings, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/858d600a-932e-11ea-b12e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9162754872651926968",
  "source": "GoogleMaps",
  "reviews": [
   "Really good pizza! (Probably a good thing since they're a pizza place.) Has a cool wooden, outdoorsy atmosphere. I've never had any issues with my food and the wait staff is attentive. They also have a separate space for bigger parties. Would recommend for birthdays.",
   "Honestly the best pizza i had in my life. NO JOKE!!! This place is always busy and always a wait. I happened to get in early on a Saturday and sat at the bar. Never been here before and asked what to order. I was recommend the pizza and wasn't disappointed. Quality ingredients!",
   "Most of the food was Great. However I got the sliders and it was like 1 burger was half uncooked. While the other burger was cooked just right. However the place was very clean. I love the Pictures they have up on Canvas. Really enjoyed for the first time checking it out.",
   "Excellent service. Wait staff (Peyton) in the bar went above and beyond. Highly recommend. Great food very reasonably priced.",
   "Excellent selection of menu items. Great wait staff (a big shout out to LUKE). Very interesting decor."
  ]
 },
 {
  "name": "Oahu Hawaiian BBQ Sushi Bar & Thai Cuisine",
  "address": "2626 State St, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/85dc2b2c-932e-11ea-a014-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7397362560903887384",
  "source": "GoogleMaps",
  "reviews": [
   "Great rolls.  Reasonably priced.  Try the Thai Fried Rice - moist and perfect.  Good service even if server was grumpy.  But then, so was the hostess.  In spite of the lack of welcome will go back.  Hope more appreciated next time.",
   "Very good delicious I love this place people do a wonderful job",
   "Haven't received our entrees yet,  but the shrimp shumai and calamari are both the best I've ever eaten at any restaurant. Beautiful and tranquil atmosphere with an extraordinarily friendly and attentive staff.  Pricing is also phenomenal for the high quality exotic foods!  First time here and it will certainly not be our last!",
   "This is my edited review\nI have been here quite a lot 😂✌️\nSushi taste really good!!!!\nDrunken Noodle and Pad See u also really good!!\nThey have an award winning bartender there (Tony)!\nThe price is considered cheap, especially when it is a happy hour time. They have 2 cycle of happy hour. I forget about the first cycle, but the second cycle starts from 8:30 p.m till close, and It's a all day happy hour on monday!!",
   "Fantastic tasting food and customer service. The lunch deals are definitely really good but the evening food prices are significantly higher. The BBQ chicken I ordered was $14 because it was 3:30, if I had shown up roughly 30 minutes earlier, I could have ordered it for $8. This is just a small issue, the rest of the experience was awesome. I would recommend giving this place a try but make sure to bring $16-17 per person."
  ]
 },
 {
  "name": "Cracker Barrel Old Country Store",
  "address": "1685 N Grandview Ln, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/863152ca-932e-11ea-a2fd-14b31f159f22.png",
  "tags": [
   "kids",
   "delicious",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13685990322812490665",
  "source": "GoogleMaps",
  "reviews": [
   "Very well priced with many, many options.\n\nThey have everything from breakfast, lunch, and dinner available all day long. Some menu items are reserved for Fridays or Sundays, but you won't have to worry about not finding something you like. \n\nThe store at the front of the restaurant has great items for the kids and adults that wish to find something nice. Great candy selection.",
   "Pretty good home-cooked style food. Usually order the Country Boy b-fest for this hungry guy. The steak was good and juicy enough that I didn't need to add any extra sauce. Eggs came out just the way I wanted them. Warm biscuits with jelly were delicious. Hashbrown casserole was yummy. Fried apples are usually good too. Lines to pay can be a bit long.",
   "Service: always amazing. Food: always amazing. Value: terrific. \nThe only reason they did not get 5 stars today: the men's restroom was disgusting. Urine on the floor that was beginning to dry, feces on the toilet seat, and paper towels everywhere. I informed the hostess of the issue as I was being seated. I never went back to check; I used the gas station restroom after lunch.",
   "My family and I love this place! Always good food and good service! And I adore the little store there with everything they carry!",
   "The bigger the group. The slower the service. However, it's clean, the servers are friendly, reasonably priced food. And EXCELLENT biscuits."
  ]
 },
 {
  "name": "Noodlezip",
  "address": "208 E Main Ave #2, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/869efb1a-932e-11ea-9ab9-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "drink",
   "family",
   "food",
   "unique",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14290801658331566455",
  "source": "GoogleMaps",
  "reviews": [
   "The service is quick, the food expertly prepared, and it's always busy. Vegan options are available, too. This is one of our unique local places I recommend to anyone and everyone. Pictures are from their special Classic Chinese Gastronomy event.",
   "Good place to get some Ramen & other types of Asian food. Place is a little small and largest tables are for two people. Price is a tad higher than other places I have tried in the state. Portions are smaller than others. Taste is superb and I will definitely be coming back to try other menu items. 1 appetizer and a entree with a drink was around $50 for 2 ppl. Staff was very friendly and service was great. Only reason its 4 stars instead of 5 is the price and space. I would highly recommend this place to my friends and family.",
   "Good local restaurant. Food comes very fast. Almost felt like fast-food kind a fast. Seafood curry is unique, but high price. Maybe seafood are expensive here. Taste is okay if you want something new, I think it's good choose. Beef pho is good. Very tender. Spare rip is also good as well, Sauce is sweet  not juicy kind a rip. Korean BBQ sauce rip.",
   "Amazing food! We had a short wait at noon, but every minute is worth it. We had several dishes, all amazing, dessert and we have leftovers.  One of my favorite places to eat! Service is friendly and accommodating.",
   "We love the food❤ Awesome service😊 Friendly and helpful staff. We're glad we googled you, us being out of towners and all!! Thank you ❣"
  ]
 },
 {
  "name": "A & B Pizza",
  "address": "1017 E Interstate Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/86f06d64-932e-11ea-a070-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=2397322514788110184",
  "source": "GoogleMaps",
  "reviews": [
   "Thank you so much ! I live in MN and ordered a pizza for my mom in Bismarck! It was easy to do and arrived nice and hot! You made her day and made me feel better in these trying times!!",
   "Just passing through town. This restaurant got recommended to us at the front desk of our motel. Good pizza. Cold beer. Hit the spot. Nice casual dining. If you're looking for something different than another burger, don't hesitate. Staff was very friendly.",
   "House special is my husbands first love. I am his second. Wonderful locally owned pizza place! Highly recommend! \n\nGarden pizza is my personal favorite!",
   "Better prices! No liquor license just beer, alright by me with a slice or... Well slices. Great staff very friendly for a lunch for by the slice pizza or burger and frys.",
   "Awesome pizza. We had a meaty type. Delivery was on time and pizza was piping hot and scrumptious. Also they delivered to the Bismarck koa. Wonderful evening."
  ]
 },
 {
  "name": "Famous Dave's Bar-B-Que",
  "address": "401 E Bismarck Expy, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8736031e-932e-11ea-a8e3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11771769600044643733",
  "source": "GoogleMaps",
  "reviews": [
   "Best barbecue I have ever had!!! Great atmosphere. The staff were amazing! Ribs were fall off the bone, brisket melts in your mouth, light and fluffy corn bread. Highly recommend!!!!",
   "We got the lunch special 2 meats. Was great and the food was cooked perfectly to each request.  Got the bread putting fur dessert and it served all of us at the table.",
   "I decided to give them a second try because this chain usually has pretty decent service and food. Firstly, we sat for over 15 minutes before we got a server, then she came to our table with a really nasty disposition. That’s when we got up and left. No one service or food is THAT good where I am going to tolerate being treated that way as a customer.  From my previous review: Horrible food and service. Small portions on the catfish fingers.",
   "Food was cold. Meat was overcooked and dry. Place was nearly empty during the lunch hour. Should have been a good indicator but I didn't catch it.",
   "My coworkers and I went here for a team lunch and my personal experience was fine but there were some issues that happened to my coworkers. One of my coworkers got normal wings instead of boneless wings, the manager came by and started working on getting boneless wings done for him. They eventually came to the table with the platter of wings but they were the completely different flavor/sauce. My other coworker ran into another issue. The entire table had already finished eating except one person who had ordered at the same time and ordered the same food as someone who was done eating. This was brought up to the manager and the food was later made but the person had to scarf it down at the speed of light to eat it before the lunch ended. I used to love this place but it appears to be going down in quality. I would recommend other options if you're expecting a quick lunch without issue."
  ]
 },
 {
  "name": "The Wood House Restaurant",
  "address": "1825 N 13th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/87797606-932e-11ea-904f-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10418792827941514920",
  "source": "GoogleMaps",
  "reviews": [
   "Recently I went through the drive thru. Ordered a Wood House wonder meal with no onions and a Coke. There was only one car ahead of me and I had to wait for a long time. When I was paying for the order the employee was wearing gloves, with which he took my money and preceded to cook the food while wearing the same gloves. Wow. Very sanitary. It took awhile for my meal and while leaving the drive thru I hit a big pothole and my Coke spilled onto the floor of my car. After this I tried to avoid the other potholes in the parking lot but couldn't avoid them all. On my way home the low tire light in my dash came on so I must have some kind of tire or rim damage from hitting all the big potholes. After heading home and having to clean the sticky mess up in my car I finally was going to eat my meal. But I had to pick my burger apart first as it had onions on it even though I specifically told them no onions. There were hardly any fries either.\n\nPortions are small and the prices keep getting higher. Will NEVER come back again. Fix the parking lot, its pothole city. Not the same since the new owners took over.",
   "This is the first time I've visited since the change of ownership. I was not disappointed.\nI had the buffalo burger that was obviously hand-made from scratch, (not  a frozen machine made patty)....Delicious! Fries were also very good. This is the place to go if you just want great local home-style food where the service was fast and friendly.",
   "This is the worst place I’ve eaten at so far. I ordered fried fish but was told they were out. So they gave me a fish sandwich that was bland and greasy.  We also ordered double cheese burgers. The meat was awful. And the bread was tough. You had to rip it apart to eat it. Don’t go here. I’d rather eat moldy fruit than eat here again.",
   "This was the worst meal we have had when eating out in Bismarck. First time and last.  Would not recommend to anyone. Had a hamburger and onion rings , husband had Philly and onion rings.  Actually feel ill thinking about the food. Won't let me give 0 stars but that's what we give!",
   "A Bismarck tradition.  Same good burgers & onion rings as I remember! Can't beat it. ❤"
  ]
 },
 {
  "name": "Yim Siam Thai Cuisine",
  "address": "313 N 1st St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/87bd8514-932e-11ea-8a26-14b31f159f22.png",
  "tags": [
   "food",
   "parks",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18101670316783807897",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped by on my way through town. It's carry out only, so I ate in the car. It was very good. I'm a huge fan of Thai food, and always try to sample the local variants whenever I travel. Thanks for the great lunch!",
   "Wonderful small take out place with picnic tables out back. The flavor of all the dishes were wonderful. So happy to have found this on our way to the parks. ",
   "I have only had masaman curry and fried rolls.  The curry had good flavor and aromatic seasoning.  Usually order ahead and it's done in 20 minutes or less.  Family owned.",
   "The medium spicy Beef fried rice was amazingggg!! I also really liked the mangos & coconut rice. Mmmmmm \n\nDef a Thai food fan now.",
   "I have had a lot of Thai food from a few different places in the country . These guys are the real deal! Authentic and my favorite."
  ]
 },
 {
  "name": "Broadway Grill & Tavern",
  "address": "100 W Broadway Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8802ccee-932e-11ea-9618-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7004291325250218101",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice place. We tried the firecrackers and buffalo meatballs for starters and they were both amazing appetizers. Then I ordered the filet with a sweet corn something for a side. They really know how to cook a steak, and the side was really good. The only reason I am not giving them 5 stars is because they know how to charge. This is not a place to go if you are on a tight budget.",
   "we held an amazing birthday part for my mother. They were so helpful and the food was fantastic.",
   "What a Great Experience‼️ We we’re Running about 20 Minutes Behind on Valentines Day Due to an Issue with Our Lyft Ride so Our Reservation was given away at One of Broadway’s Competitors .... Which We Understand That They had Other Customers to Serve. So I Googled Broadway Grill and Dalton  Answered the phone we told him about the situation we were in and asked if there’s any available tables he said he could get us in at 8PM which is only 35 minutes away.... So we Walked to the Broadway when we arrived we sat at the bar waiting for our table and we noticed a Table in the bar was open so we asked Dalton if he could be our server and we would just sit in the bar! All the Food and Drinks Were on Point..... Dalton Gave My Girlfriend and Myself an Awesome Valentines Dinning Experience‼️",
   "3 of us had lunch here Mon Jan 27th. We waited an hour for our food and found our salads to b of poor quality and  not worth $6-chopped head lettuce, one tomato, and shredded cheese. Fish sandwiches were good but had to ask for the sauce. I dont know what happened to this place, it used to be very good quality food. Sure hope it improves!",
   "LOVE LOVE LOVE the broadway! Great staff AMAZING FOOD! Highly recommend the fire crackers, guacamole and any salad! I love the broadways bloody Mary’s and house merlot. ❤️"
  ]
 },
 {
  "name": "Big Boy Restaurant",
  "address": "2511 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/88455528-932e-11ea-83b7-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "drink",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=5382815998611975405",
  "source": "GoogleMaps",
  "reviews": [
   "Just get in line! Wondering what to try? Get the Big Boy Original, flying style Pizza Burger or any of the chicken. If you're looking for something with a kick, get the boom boom sauce on the Big Chic and you'll be in for a treat. Don't forget the Frozen Coke or brown cow! The poppers are a nice addition to share with the family or friends.",
   "Order is incorrect every single time. Line is usually backed up 2 miles down the street so no chance you’re going back through to get your missing $10 worth of food. Food is great. Order accuracy needs work. The consistency of mistakes is embarrassing and seems like something a business would work on. Apparently not. 1-2 stars.",
   "Always wanted to try it and did today. Wife and I both agree a little to much bun and to thin of patty on the cheese burgers. Very courteous staff, and no complaints on fries or drink. The line was long when we pulled in but went pretty fast. Will most likely stop again and try something else from the menu, they have several options that look pretty good.",
   "Can only be flying style!! \"Amazing.\"  The chicken, and fries with gravy are delicious also.",
   "Cool place! It's a Big Boy Restaurant strictly as drive through. We got the Pappy Parker's Fried Chicken and was not disappointed. They have a picnic area behind if you want to eat there. Will definitely go back"
  ]
 },
 {
  "name": "Charras",
  "address": "4503 Skyline Crossings, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/88878fa4-932e-11ea-a3a8-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6525080158578374667",
  "source": "GoogleMaps",
  "reviews": [
   "I truly enjoyed the restaurant, the service and the food.  Very authentic and lots of flavor.  The server was very attentive and helpful.  Our order was perfect and came out right away, in all everything was perfect.  The prices are reasonable considering that you are getting the real deal.  I will definitely recommend this restaurant to anyone who wants to enjoy real mexican food.  I'll be back again soon.  Thank you.",
   "Great everything.  Say yes to the groc!!!!  Yesterday, onions were overpowering so you may want to leave out onions, just in case.  Didn't keep us from finishing bowl... One serving enough for at least four.  Good-Very Good Salsa.  Chips excellent.  Service perfect.  Entrees Very Good.  Tacos most delicious.  Enchiladas two thumbs up.  On a scale of 1-10, with 10 being Authentic Mexican this is a solid 8.5, just missing a 9.",
   "Love the atmosphere! The food is the best. Love the fresh guacamole made table side. The food is served sizzling hot! Don’t touch the plate! The margaritas were so good!",
   "You can judge a Mexican restaurant by their home-made salsa. They have a very tasty salsa. So I had no doubt that the rest of the meal was going to be great. Guacamole made right at the table. Mexican food with great flavor and taste. Great house Margherita too!  Go, right away!",
   "Excellent food, excellent margarita, freshly made guacamole at your table. Chips a little too salty. Very friendly and fast service. Great atmosphere."
  ]
 },
 {
  "name": "EAT Thai Cafe",
  "address": "409 Riverwood Dr, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/88cc88fa-932e-11ea-aa82-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5301018944992392139",
  "source": "GoogleMaps",
  "reviews": [
   "Consistent excellent quality food and portions. Visit once and try a Curry - you'll be hooked on this restaurant.\nOrdering online is a breeze and gives you an expected order will be ready wait time. (Usually around 30-45 minutes at dinner time). Add those Spring rolls to your dinner 👌",
   "Yummy! The egg noodles so good!  Loved the satay! Everything was so fresh! It is located in a transformed home, plenty of parking behind the business, wheel chair ramp, outdoor seating. Sit down dining to accommodate about 24 people.",
   "This place is awesome. Super good customer service, always friendly, and the food is bitchin. My wife loves the pad Thai, and if you h want tried their wings yet, so yourself a favor, get on that website, order up some spicy Thai wings, and watch out for that level 4 spice, ‘cause it’ll get you. Excellent restaurant. We have been 3 times, and have been incredibly satisfied. During the COVID19 pandemic, they’ve been super accommodating and flexible, making curbside super duper easy. 6/5, would recommend.",
   "This was our first time dining at Eat Thai. The service was phenomenal. The Thai teas had an amazing flavor. We ordered the Pad Thai with homemade peanut sauce, the Thai Pork and the spring rolls. Portion size was giant enough to bring home lunch for the next day. Delicious !",
   "I usually eat authentic thai food in my home town Jakarta Indonesia, and several asia country including Bangkok Thailand. The food here amazingly taste pretty close to the authentic one. I try the Pad Thai and Drunken Noodle. I will come back again to taste the other menu, and give u guys better review."
  ]
 },
 {
  "name": "Jack's Steakhouse & Seafood",
  "address": "1201 S 12th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8918d5a2-932e-11ea-9b52-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14707875684267643752",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Everything I've ever gotten has been fantastic. It's clear they  take pride in making every thing as good as possible. Down to the condiments and the minor things like fries.",
   "Ordered the Steak and Lobster.  The lobster was cooked perfect but the steak was a very poor cut and over cooked.  Only received 1 of my 2 side items.  Waitress was very courteous though and discounted the steak from the bill and packaged my 2nd side item up to go!!  I'll return again and give Jack's another shot!!",
   "Pretty good food. For the price should have gotten a little more food than what you get. The wait staff was ok but felt aloof. All and all it wasn't bad.",
   "I had a great experience at Jacks a couple weeks ago on a business trip. First I was late getting in and they were wrapping up. I ordered a medium rare prime rib and it was pretty over cooked. When the manager stopped by to ask how I was I asked what she thought and she completely agreed and was quite gracious but of course that late in the day didn’t have any more MR prime rib. She offered me a medium rare ribeye to replace it, was super apologetic and very gracious as was my server. Bottom line, you don’t have to be perfect if you make it right. I was exhausted and getting my first really good meal in a while. They made it good when it could’ve been bad. Five stars for making it right! Good food and excellent service!",
   "Jack's steakhouse is known for their special shrimp sauce and baked shrimp and of course they're settling 1241 Wednesdays two-for-one burgers on Thursdays"
  ]
 },
 {
  "name": "Space Aliens Grill & Bar",
  "address": "1304 E Century Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/896597a2-932e-11ea-8ddd-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "music",
   "kids",
   "free",
   "unique",
   "kids",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2684387408982738927",
  "source": "GoogleMaps",
  "reviews": [
   "This is my first time traveling to Bismarck for business and someone at my hotel mentioned the Space Aliens Grill. I figured I would give it a try and I'm glad I did! This was a fun experience that I wish I could have shared with my family. The menu alone was entertaining to read through. The decor was great. One of the best themed restaurants I've ever been to!",
   "Molly, our server was outstanding. The Outerspace blooming onion was delicious, crispy and not greasy. The wings had a good tangy sauce, made your nose tingle even. Had the Taco burger, wasn't too bad I suppose. Both side salad options were very good. The atmosphere of course was what always sells the place. The music this time was pretty good too, a nice mix, some prog rock classics like Rush and Yes and more modern.",
   "The BBQ can be quite good here. That said the quality can be very hit or miss.Sometimes the ribs are right on; sometimes dry and clearly sitting around too long. They have good pizza and offer good Gluten free pizza. The staff usually have noticably good attitudes. The game room for kids is just way too overpriced its gotten kind of bonkers over the years. Being a BBQ place you'd think they would have paper towels in the bathroom but they don't -- it's hand dryers only. Always made me feel like they're cutting corners.",
   "I loved this place!  This is something I would expect to find in New Mexico or Nevada; but Bismarck, North Dakota?  Nevertheless, I was so glad to have stumbled across it during our one night stay in Bismarck.  Apparently, there are currently 3 locations across North Dakota and Minnesota.  The entire atmosphere inside is very unique with really cool decor and memorabilia.  The food was fantastic with many dishes having alien themed names.  There is also an arcade in back with a pretty nice selection of games.  Overall, this place is awesome for kids and fun-loving adults alike!",
   "I was very disappointed. I went in and was seated, the only one there. The server came over and got my drink order, it was delivered, then got my meal order, she brought the salad and almost immediately  brought my meal. I hadn't even gotten a chance to start eating my salad. Of course then my meal was cold. I felt very rushed. The food was fairly good. I also noticed the server never did smile. Things like that are important to me."
  ]
 },
 {
  "name": "Bistro 1100",
  "address": "1103 E Front Ave, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/89b16ee2-932e-11ea-847f-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "drink",
   "brewery",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15194669223089534074",
  "source": "GoogleMaps",
  "reviews": [
   "Had big group, probably 30 people. Service was good and portions were very large. Great overall experience.",
   "Came with my special lady... ordered a beer and her a foo foo drink. Manager was bartender at this time. This was due to my timing, arriving between lunch and dinner. Still great service, just enough, and the food was delicious. Had the lobster bisque and lobster and 4 cheese ravioli, was very good and creamy. Just like it should be... 😉 good job guys, keep it up, and I’ll be back!",
   "Recommended by a friend. Suggested a tasty drink from Laughing Sun Brewery next door, followed by lunch at Bistro 1100. Did not disappoint. My waitress suggested the bruschetta burger lunch special - 10oz of beef smothered in aioli with thick-cut bacon on a toasted bun (I forget what kind). Most burger patties taste similar, but this one was flavorful and smooth as BUTTER - not grainy like some. Awesome service and a great atmosphere.",
   "Best place to eat in town. It's been my from the time I moved here 6 years ago and it's still my favorite.",
   "Hamburger was great! Had a waitress in training that did an excellent job at making sure we were taken care of. Definitely will return!"
  ]
 },
 {
  "name": "Shogun Japanese Steakhouse, Sushi & Thai",
  "address": "2700 State Street #H1, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/89f3ff62-932e-11ea-bdd2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12842011351288783875",
  "source": "GoogleMaps",
  "reviews": [
   "Great stop as we were traveling through. Great happy hour sushi rolls. Lucky for us we walked in just before 4pm and snagged several of those.  Also delightful large bowls of noodle soup (which will be awesome to stop for again in winter road trip months!)",
   "This is our favorite place for hibachi. The chefs do such a great job at being entertaining while making amazing food. I finally tried them for lunch because I love pad Thai and it did not disappoint. My husband also loved his bento box. I definitely recommend this place if you want to make a big deal out of your birthday. You don't get much for freebies but you definitely get a show!",
   "Our food is always delicious and they offer a wide variety of dishes. My husband and I have visited for hibachi several times as well as traditional lunch/dinner dishes and we've never been disappointed. Definitely the best sushi in Bismarck!",
   "The sushi and hibachi are always delicious! Always clean with great customer service.",
   "my all time favorite place to eat! great food with many options and friendly staff."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "1505 Burnt Boat Rd, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a3624b6-932e-11ea-80d4-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12810587509889616528",
  "source": "GoogleMaps",
  "reviews": [
   "Their streaks were fantastic. The service was excellent, out waiter had our drinks and food out so fast. He was so attentive to anything we needed. We will definitely be going back. This was overall a better experience that what we had at Peacock Alley (a way more expensive restaurant with not a good of steaks)",
   "Excellent steaks and service. Order is quick and arrives as ordered. Nice specials. Excellent rolls.",
   "The waitress was wonderful. I had the sirloin strip 8 oz. which was cooked perfectly at medium rare. However my wife who had the same steak sirloin had to have it cooked twice. First it was over cooked at well done. (She wanted medium well) then secondly it was nearly still rare!!! I guess third time is a charm huh?",
   "Friendly staff, very attentive. Steak was done medium, just the way I requested. Shrimp was great. Hot buns with cinnamon butter, yum. The blooming onion, sorry, can't remember what it was called on menu, just right. Sauce for onion was excellent. What else can I say, GREAT place.",
   "Excellent service. Delicious food. 👍🏻 I’ll be back for sure. Love the free bread&tons of peanuts. 😂"
  ]
 },
 {
  "name": "Los Lunas A Taste of New Mexico",
  "address": "108 N Mandan St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a733bec-932e-11ea-b381-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10329994651870853084",
  "source": "GoogleMaps",
  "reviews": [
   "Good chili relleno; battered just right and the pepper was prominent over the batter. Place is attractive but echo-y due to high industrial ceilings. Our server was very good especially as it seems she was the only one on the dining floor.",
   "Good food , tasty. The server was friendly. Good experience.",
   "I can’t say enough good things about this excellent restaurant! This is REAL authentic New Mexican food!! In addition to delicious food, the service was great and very friendly! We can’t wait to go back when we are in Bismarck!",
   "Pretty good atmosphere and the food is pretty tasty nothing fancy but simple things that are perfect don’t need to be",
   "Chimi was good, staff was nice. Recommends by locals.  Co-worker and myself both enjoyed out meals."
  ]
 },
 {
  "name": "Anima Cucina",
  "address": "101 N 5th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8abae5b4-932e-11ea-9aa9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2137544318844384382",
  "source": "GoogleMaps",
  "reviews": [
   "I got a caramel roll, which had a nice surprise of icing on it. I thought it was smooth and creamy as a dish. My wife had a molasses scone and she thought it’s a bit heavy on the ginger, but the texture was fantastic. Keeping in mind yeast breads  are difficult to master, and for the most part they did a good job.\n\nWe both had americanos and they both were very very good. Not a lot of acidity which I appreciate.\n\nI love the atmosphere. Great vibe to the place. My wife says retro rustic.\n\nOverall a good experience and we will be back to try more of the fare.",
   "I love to stop at Anima Cucina and enjoy a latte or glass of wine while also taking in some much needed sunlight! It is a very relaxing atmosphere, and always smells of the freshly baked bakery items. Highly recommend!",
   "Great selection of wines and cheeses, not at all something that I expected to find in downtown Bismarck, North Dakota. Their menu is somewhat pricey of you're going for a meal, but is perfect if you're wanting to sample a wide array of meats or cheeses. They do also offer a selection of vegan meats and cheeses, which was appreciated by one of the people in our group.",
   "Such an enjoyable lunch! The food was delicious and I love the self serve aspect. I ordered the muffalata and the veggies in case the sandwich wasn't enough.  The sandwich was so much bigger than I expected! I can't wait to go back to try some of the wine on their extensive list!",
   "Delicious fresh-baked breads that's all made by hand, meat and cheese boards, coffee, hot plates and sandwiches. A little pricy but excellent. And the tiramisu is excellent. Oh, and it's Italian and French."
  ]
 },
 {
  "name": "Blarney Stone Pub- Bismarck",
  "address": "408 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b05ad5c-932e-11ea-8c93-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12438967933411004529",
  "source": "GoogleMaps",
  "reviews": [
   "We stayed in Bismarck one night and found this pub with zero regrets. The service at one of the bars with Andy was exceptional, beer choices galore and food  to die for. Genuinely the best fish n chips I’ve ever had! My husband thoroughly enjoyed his Corn beef and creamed cabbage. We will definitely be back next time we’re in Bismarck, this pub is a must!",
   "Highly recommended from frequent visitor. Food quality is one of the best in Bismarck. Bangers & Mash (pictured) is my favorite meal here. Best brunch in town if you want a drink to go with it. Eggs Benedict are wonderful and I love the build-your-own Bloody Mary bar. Wish they had more burger options and would bring back their eating challenge. I've enjoyed almost every food item I've ever ordered here including Boneless Wings, Sandwiches, Shepherd's Pie, sweet potato fries, etc. Their Blarney dip is out of this world. Atmosphere is overall wonderful, although sometimes feels a little too dark. Love coming here to watch sports. Service is very attentive, sometimes almost too attentive. Great team of employees there - they do a great job making you feel welcome. Surprised that more people don't go here.",
   "This shop itself is really beautiful! This place is amazing! They took me in last minute with no hesitation and accommodated to my indecisive self. All the employees are so friendly. Extremely clean and great! This is definitely going to be my GO TO spot!",
   "Kilkenny Cod with lemon-garlic sauce on top of wild rice is a great alternative to fish and chips!  Very nice.",
   "One of my favorite places to eat at in Bismarck. Good, hot food, great service. The place does get very noisy."
  ]
 },
 {
  "name": "La Enchilada",
  "address": "6631, 1101 S 12th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b57ede8-932e-11ea-bcb4-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food",
   "food",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=8654196217503258517",
  "source": "GoogleMaps",
  "reviews": [
   "As a Texan, this is the best Mexican restaurant I've had up North. Great food and service.",
   "The food was unique. Not your cookie cutter Mexican food with plenty of flavor.  Definately a return visit.",
   "Best service and food!! We are always treated well and the food is always fresh! Thank you so much to all the staff for the great hospitality! We plan to keep coming back!!",
   "Great Authentic food! This is our new favorite place to go eat when we are in Bismarck. The guacamole and chips are to die for!! (I wish I could have the recipe, lol) Also, awesome service and great atmosphere.",
   "I called to find out what time it stayed open. I was told 9pm. I arrive at 7:45pm and it was closed by the time arrive at 8pm. The Friday that I tried to eat at your restaurant. The doors where locked and the lights where off. Next time I'll take photos and post with comment if I ever go back."
  ]
 },
 {
  "name": "Ground Round Grill & Bar",
  "address": "526 S 3rd St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ba663f0-932e-11ea-8a30-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18093607414145280238",
  "source": "GoogleMaps",
  "reviews": [
   "Mini sliders are great. Fast service with accurate orders. Love their Chicken Alfredo pasta. Stir fry was good too",
   "First time ordering for delivery. Ordering was very  easy.The driver was here within minutes of stated delivery time. Food was warm and delicious. I'll do this again.",
   "Service was great food was hot and delicious! Manager stopped at multiple tables to chat. Great place to eat",
   "Thanks for the great carry out meal! We were so surprised with the popcorn and the message, your right we will get through this! ❤️❤️❤️",
   "Food is really good. Big portions! But prices were a little high. Service was great."
  ]
 },
 {
  "name": "Nardello's Pizza",
  "address": "1001 W Interstate Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8bf45ed0-932e-11ea-8852-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12249834233536038841",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome. New York style slices and the $5.50 two slice and a drink combo is a stellar bargain. If you've never eaten here definitely try it.",
   "Hands down best pizza joint in Bismarck",
   "Great food and very friendly service! Very authentic New York style pizza! Highly recommended!",
   "Good food. Friendly staff. Clean. Well priced. Will return",
   "Delicious pizza, solid Italian hoagie sandwiches and the best (only?) street-style Philly cheese steak sandwich in town."
  ]
 },
 {
  "name": "China Star",
  "address": "1065 Interstate Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8c3fc14c-932e-11ea-90c5-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food",
   "food",
   "drink",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1785100705191512331",
  "source": "GoogleMaps",
  "reviews": [
   "I had a pleasant experience at this restaurant.  The food was fine,  similarl to most Chinese buffets.  The restuarant was inviting and clean.  I like the arrangement.  The server was okay.  I tried to have a conversation with her, but she was unable to communicate in English.  We enjoyed the sushi bar.",
   "Food was great! Service was great! Yes, I got Salmon Nigiri each time, even with dessert! Short walk from hotel. I'll definitely come back next time I'm in Bismarck!",
   "SO GOOD! Snow shrimp is the BEST I have ever had in the country...well, I have never eaten or seen snow shrimp anywhere else. But MM MM MMMMMMMMMMMM. Its not low fat but it tastes amazing. Great customer service all the times I went. Sushi bar also. Lots of food choices to choose from.",
   "I rarely ever leave written reviews, but if I can prevent some poor soul from wasting their money on this over-priced place, I will.  The only reason I give this place one star is because the people were nice.  But that is the only positive thought I can give.  The food was horrible.  The sushi tasted like it had been made the day before and was left out until I put it on my plate.  Dry rice, warm fish sashimi isn't supposed to be warm).  I thought I would fare better with the standard Chinese food they have on offer. But even that was subpar, and greasy even by Chinese food standards.  The staff, while nice people, we're not very good at their jobs. The couple in front of me came to their table and saw that I had not been wiped down and when they requested to have it cleaned, the lady leading them to their table pulled a few napkins out of the napkin box and wiped it off. At the end of the day, they double charged me.  They corrected it, The refund will take three to five business days to take effect. It's not going to break my bank, but it is irritating that I'd have to do that for a simple Chinese meal. For $16.50 for a drink and meal, I feel like I was cheated just a little bit. I don't mind paying that much for a Chinese buffet, but it has to be better than what I encountered last night at this restaurant. hopefully the owners of this restaurant will read this, and make the corrections necessary to make this place better..",
   "We LOVE this place! The food selection is always good and ive never been unsatisfied.  The whole family like it. I always recommended it to friends."
  ]
 },
 {
  "name": "Luckys 13 Pub",
  "address": "915 S 3rd St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8c9a8ede-932e-11ea-b38d-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "delicious",
   "food",
   "free",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15390345259688092185",
  "source": "GoogleMaps",
  "reviews": [
   "Great food with a good atmosphere. The turkey melt and burgers are very tasty. Our service was great and staff were helpful. They have a separate room to book for special events as well. Tuesday night they had bingo at 7 pm.",
   "Great spot, the bar tender bought me a drink when I was down and out... And the rest of the team took great care of me. Drinks may be a little more, but the service goes above and beyond. Location is fantastic by the mall, and right accros from the hotel I was staying at for a few weeks. Maybe not the place to have 5 drinks, but 1 or 2 seems to be the ticket. The food is great, and that atmosphere is fantastic. Old world look with flame lighting, and cans powered by belts... See photos. Banquet capability, the first night I stopped in, the manager let me have a few left over burgers from an event as well... Abasalutly worth the extra few bucks, as you get what you pay for with almost anything.",
   "The place looks neat on inside, although the A/C is a little too high. The TV placement is a bit odd and makes it difficult to get a great view no matter where you sit. Some of the food there is delicious. The boneless wings here taste awesome and so does the pulled pork flatbread. The nachos come in good portions - I got the quarter size and you can see the size in the picture. Service to take our food order once we were ready seemed slow. The food came out quite fast.",
   "Very cool Irish pub atmosphere and the food is great, plus free popcorn. Only hitch is the price, which may make it an unattractive lunch option as an entree + beer can easily get to $25-30. If you're going with a group for dinner or looking for atmosphere then look no further.",
   "Excellent! Had the Stacked Club, fresh fruit and a side salad for myself. Needless to say I only ate half of my club it was so huge! Gluten free menu is awesome, best menu I have seen in a restaurant lately. Boyfriend felt like he had a real meal for once. He had the Brie & Bacon burger with fries. Burger bun is gluten free and pretty tasty, fries are cooked in exclusive fry only fryer so he was able to have them. Definitely one of our go to places for gluten free options in Bismarck!"
  ]
 },
 {
  "name": "Bruno's Pizza",
  "address": "910 E Front Ave, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ce7d270-932e-11ea-95c9-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "delicious",
   "free",
   "delicious",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1017167493863680400",
  "source": "GoogleMaps",
  "reviews": [
   "Great locally owned pizza place! I enjoy so many creative pizzas on the menu here. Mashed potato pizza, Alfredo deluxe pizza. YUM!!!!\n\nHighly recommend",
   "Really great food. We came for the calzone special and built our own. There were a lot of choices and we created some masterpieces. The service was great. Our server was nice and the food was quick. We came after the lunch rush and it was quiet. Great service and food!",
   "The best gluten free supreme pizza I have had, and delicious grilled chicken salad. Definitely recommend!!!😊😀",
   "During the virus lockdown we recently ordered a large 3 meat pizza and parm bites.  It was delicious as usual!!  Plus, they were super fast and even had free delivery during these crazy times so even better!",
   "Used to be great. But theve cut costs without cutting prices and I can tell. And honestly the food is miserable I got a Delux meatball calzone (spegetti and meatballs with cheese  in a calzone)  \nThe  spegetti has practically no sause,  the cheese was all in one spot, the crust is burnt and the meatballs were still frozen in the middle."
  ]
 },
 {
  "name": "La Tejana Mexican Market & restaurant",
  "address": "1235 S 12th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d2aa1be-932e-11ea-bcb0-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2051350760716649566",
  "source": "GoogleMaps",
  "reviews": [
   "This place is INCREDIBLE!! Their posole is the BEST!  The owners care! I can't find a better Mexican restaurant in NORTH DAKOTA  let alone Bismarck! They can cook for me every night!! Thanks La Tejana!!",
   "Such a unique place. The food was delicious and the service was so friendly and prompt!",
   "Amazing authentic Mexican food!! The owner is so nice!! She is so kind and always makes time to talk to everyone! The food is always fresh and the portions are very generous! I absolutely recommend this place to EVERYONE!!!",
   "HANDS DOWN BEST MEXICAN FOOD IVE HAD SINCE I LEFT SAN DIEGO MOVED OUT HERE TO NORTH DAKOTA ITS NOT OUTRAGEOUSLY  EXPENSIVE STAFF WAS SUPER FRIENDLY I LOVE HOW THE PLACE HAS A HOMELY INVITING FEEL TO IT.  I WILL DEFINITELY BE MAKING THIS SPOT ONE OF MY REGULAR PLACES TO GO TO.",
   "This is a go to place to eat if you are craving great authentic food.  If you are in Bismarck you have to stop here.  You won't be disappointed!"
  ]
 },
 {
  "name": "Ale Works",
  "address": "1100 Canada Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d7567c0-932e-11ea-a96e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "drink",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2454592281644074662",
  "source": "GoogleMaps",
  "reviews": [
   "The food is good and the in-house beers are excellent! The service was a bit lacking, but not terrible. I had their bacon cheese burger on my most recent visit, and it was very good. I highly recommend it. For a side dish I ordered the horseradish coleslaw. I liked the flavor, but it was a bit dry for me. I like my slaw a bit creamier, but it was still good.",
   "Very very good. We came here for Sunday brunch (our second time). First time was excellent, and the second time didn’t fail to impress for the most part.\n\nI had chicken (which was home battered and fried, not frozen) and bacon waffles with a brunch syrup. The waffle was dry towards the end due to its density.\n\nMy picky eater devoured her pecan waffles and said, “I want more.”\n\nMy wife and other daughter each had an egg tart (think scramble in a puff pastry shell).  The highlight was the house-made sausage featured in the dish.\nThree of the meals came with a side of “fresh fruit”.  contrary to common thought, frozen or canned fruit with a sour, spicy taste is not fresh.  They would have preferred an orange wedge or 1/2 a banana.\n\nOrange juice was fresh and little pulp. \n\nThe service was slow and spotty. We often waited long periods before our waiter Tyson to check on us, see if we needed anything, or even to take care of our bill. The place was not even close to being packed so I don’t know what the hold ups were.\n\nOverall a nice Sunday brunch place for Bismarck, just disappointed in the wait service.",
   "Excellent food and drink selection. The poutine is delicious! Love the atmosphere and decor. Be prepared to pay for the quality as it isn't an inexpensive meal. 2 entrees, an appetizer, and 2 non alcoholic drinks will cost about $50",
   "Excellent vibe and awesome place for drinks. Above average place for food. Great variety and quality of drinks at reasonable prices. The food is a little pricey. The jaeger schnitzel is highly recommended and delicious. Some of the other food options didn't look or sound as good. The chicken pot pie has a great presentation. Not a fan of pretzels coming as a side on one of the dishes someone got. Wish they had larger water glasses instead of the shot-sized ones.",
   "Clam chowder was delicious! Tried the poutine but prefer a brown gravy instead of their twist on the gravy. But all in all the poutine was good. Ordered the club sandwich and was very tasty! I had ordered the Browned Butter Old Fashioned which was also quite tasty. We went there around 1pm and it was kind of busy and our service was good. Waitress checked in multiple times and even boxed our food up for us. Overall a good experience."
  ]
 },
 {
  "name": "China Garden Restaurant",
  "address": "1929 N Washington St V, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8dc5d31e-932e-11ea-89a3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10903189732589129116",
  "source": "GoogleMaps",
  "reviews": [
   "Out was great. I recommend the broccoli beef, orange chicken, wonton soup, and the egg rolls. Quiet place to sit down enjoy each others company and relax. Food is priced every low the for portions given. I love that part of the restaurant. Plus the FOOD IS AMAZING IN MY BOOK.",
   "Never order before closing. Looked at the reviews and took the plunge. Beige was the color of all. Literally same sauce for garlic beef, Mongolian beef and orange chicken. Upcharge fried rice was bland and lacked any vegetables at all. I understand catering to the American palate, and I understand this is North Dakota.... But this is insulting... Also, battered dipped eggrolls ... My heart cries (as an aside, the staff was polite upon pickup... Offering plates and napkins.",
   "Great place good food, picked up food tonight and this sign was on the door. I will be going back here when this is all over.",
   "Outstanding food and polite, fast service. If you are a fan of hot and sour soup this one is packed with flavor and all the good ingredients. The Hunan chicken is very authentic and absolutely delicious. I highly recommend.",
   "Excellent food and service. Always a pleasure to to take our guests there to eat."
  ]
 },
 {
  "name": "Olive Garden Italian Restaurant",
  "address": "3400 N 14th St, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e0a7e94-932e-11ea-8273-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5947315352970855133",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and great drinks. If you like Italian food, you could try this place and possibly find a new favorite. They also have a wide selection of drinks to enjoy.",
   "I placed order on line and during check out, my order date got changed. I called Bismarck store, a very pleasant voice answered. Long story short. The food was some of the best we have had. A great appreciation for you and your staff. Nicole was the young lady who made it possible. Kudos to the chef, most excellent pasta",
   "Typical chain, and typical of this chain. It’s always clean. The wait staff is ALWAYS professional. Like this place only hires and demands the best - it really is on a level with some of the finer dining I’ve experienced. I’d be shocked if I ever went in there and even had a waitress that was disinterested, let alone rude. Best team in town.\n\nThe food - I mean nothing bad when I say it’s just average American Italian food. That’s fine, it’s why I’m there. It’s not over the top amazing like it was made by a master chef, because it’s not - it’s chain restaurant recipes that work, but don’t wow.",
   "I have been going to olive garden for over 25 years.  The Bismarck location provides the best service of any I have ever been to.  Megan was a fantastic server and worked hard to go above and beyond throughout the meal.\n\nObviously most food is fake vs real like it was 25 years ago regardless of where you go to eat.  Fake food all tastes about the same because it is all high fructose corn syrup.  Real food would make the meals cost 2-3x more than they do.  So it kinda is what it is.  There is no way they can keep the prices the same today as they were 25 years ago and use real food.\n\nSo that aside, the service from everyone was incredible.   From the greeter to the server, manager, dish clearing staff, food delivery...all of them we extremely friendly, happy, upbeat and together provided a very pleasant dining experience.",
   "What a great experience yesterday. I have come. Of. Course multiple times. Yesterday's service was great. The food was on point. And that pumpkin cheesecake."
  ]
 },
 {
  "name": "JL Beers",
  "address": "217 N 3rd St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e556b9a-932e-11ea-9108-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "drink",
   "free",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8281835982475451003",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome every time. All of the staff are so friendly. I don't know any of them personally but they are always nice and want to serve you. I feel welcomed every time I'm there. The food is consistently really good. The beer has always been good. The facility is really clean.\nSHOUT OUT: outstanding job to the men and women of JL Beers",
   "had a great evening, service was on point! Had a couple JL Burgers and Loaded Fries with a few beers! Excellent Experience once again!",
   "Quaint little pub. Ordered the BBQ bacon burger. Excellent. We also ordered the loaded fries. Also excellent. I recommend you take home at least a pound of the fresh peanut butter for later. \nService was fast and friendly.\nPrices are affordable.",
   "Found this restaurant and bar while on vacation and made stops at in numerous States any time we saw it it was a definite definite stop. The food service is always open late and they offer free hot pretzel after a certain hour with drink purchase to ensure that you can sober up and get home safely. I definitely recommend the peanut butter burger it sounds odd but it is amazing.",
   "Food was GREAT.  Craft beer was wonderful. Service was awesome.  Best part? 2 of us had an app, 2 burgers n fries, 2 beers, a lemonade, and it was $52.  Definitely a new favorite stop."
  ]
 },
 {
  "name": "The CraftCade - Pizza, Arcade, & Bar",
  "address": "405 N 4th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e9dc07a-932e-11ea-8b0d-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "food",
   "food",
   "food",
   "music",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6609372457165777872",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely love this place -- they have a retro 80s theme. It brings back great memories from the 80s as well as of good old Snoopers Bump and Tilt from when I was a kid. Lots of good arcades all free-to-play. Their craft beer wall is really neat where you get a card and server yourself. That said, it seems like it always has a little too many fruity drinks for my taste but I can usually find something good. The food is phenomenal I highly recommend their \"Predator\" pizza. That's the meat-lovers. On Sundays they open the place up to kids all games still free! Adults can still get beer from the gated in beer wall as long as you get a bracelet.",
   "Great entertainment, good pizza, and large beer selection. Been here twice so far and will be back. Go at off-peak hours for best experience. Tried to go once when it was packed and don't think it would be as fun. Pizzas are large and loaded with toppings, and they'll do half one way and half another which makes it easier to choose from the list of awesome pizzas. Great selection of games from 80's-90's.\n\nSome patience required. Games take a beating in this environment and both times I've been there have been some games/controllers broken or not working properly. There are plenty of options and it seems like they try to stay on top of maintenance. \n\nThe self serve beer wall is neat and convenient. Only downside is if a tap starts sending foam, which happened to us on a couple taps tonight. Not sure how they meter it but it's charged by the ounce, so disappointing to get a glass full of foam that would usually be the bartender's problem.\n\nBeer and food is maybe slightly more expensive than other places but not by much, and it is well worth any difference for the gaming options.",
   "Absolutely love this place!  Great atmosphere, great food, great music, great beer selection, and last but not least fun games!  It has everything you need for a fun night out with friends!  The takeout is great as well.  They have some of the best pizza in town!",
   "This place is a great addition to Bismarck. A place for 21+ only that has old school arcade games was much needed and this place delivers in this area. The service at the food counter was great too.\n\nNow for the negatives. The music is sometimes way too loud and makes it difficult for people to chat. Just wish it could be larger and allow for more games. Thus, this place is best attended when fewer people like on a weeknight. On a weekend night, it can be difficult to find open games to play. The place is small and thus doesn't have much seating availability for busier nights.  I tried the Chicago style dog, which had a great presentation, but the taste was just ok. Also, not a fan of the pretzel side - I wish there were other sides to choose from. Tried the Roadhouse pizza - the flavor of it tasted great but there was hardly any chicken on it - the bread ratio was too high compared to everything else.",
   "It was a nice flash back to the 80's. I enjoy a teen wolf, a hot dog loaded with chili, Doritos and a lot of yummyness. It was radical!"
  ]
 },
 {
  "name": "Stonehome Brewing Company",
  "address": "1601 N 12th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8eed8f88-932e-11ea-8a0e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "drink",
   "eat",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2116949028427912684",
  "source": "GoogleMaps",
  "reviews": [
   "Atmosphere would get a 5 star. Love the classic 80s/90s music. Beers here are good, but they were out of several. Some of the food is very delicious such as their pork belly tacos, jalapeno popper pizza, and fries. Some of the other food is just so-so and lacks flavor. The food is rather pricey. Great place to watch a game. Wait times to get seated are unusually long despite plenty of empty seats. Hopefully they can get more servers.",
   "Love Stonehome! It’s nice to see friendly and consistent faces when I eat there for lunch and the nighttime atmosphere is hopping too. I don’t drink beer, but they have a great selection of wines and of course mixed drinks. I think the best thing is their rotating pizzas of the week. I don’t like to deviate and try things new, but this is an easy way for me to branch out. Who would have known I’d like artichokes on pizza?!",
   "Great spot.  Looks really fancy has a good tap list.  Right next to a bank for some reason.  Like you gotta enter though the bank.",
   "Amazing atmosphere,  wait staff on point and food is phenomenal, beer is just an extra. Found a new Bismark must!  Thank you for an awesome family dinner",
   "Good food. Loved the pretzel and candied bacon (delicious)! The Rusty Tractor pizza had tasty toppings and an even better crust. Fish and chips were near perfect! The fish was light and flakey with flavorful batter and was not overly greasy. Loved the house made tartar sauce! Only reason I didn't give it 5 stars- service was a little slow but not terrible. Overall, worth the time and money."
  ]
 },
 {
  "name": "Five Guys",
  "address": "1001 W Interstate Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f38a3b0-932e-11ea-9294-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13120017661973691225",
  "source": "GoogleMaps",
  "reviews": [
   "Good food. Prices are a bit high but it seems that's happening everywhere. I like the fries when they're crispy. Have gotten them a little undercooked before. Burgers are good 95% of the time. Nice place for a greasy craving",
   "Just tried it for the first time. It was a little high priced, but so worth it!",
   "Best fast food burger in Bismarck but you pay for it. My family purchased 4 burgers, 1 large fry and 4 cups of water for $37. We were all full and happy though",
   "Had frys... good frys. Staff need better work mentality.  Dirty floors, full trash cans and dirty tables",
   "Great food, awesome service. Food is always fresh and great tasting. Best burgers around. Cost is a little more but you get what you pay for. A small burger is almost an inch thick patty. A regular burger is 2 beef patties together. Melts in your mouth. Any stopping you can think of and made fresh right in front of you. By far the best burgers I've ate in Bismarck, ND."
  ]
 },
 {
  "name": "Applebee's Grill + Bar",
  "address": "3200 N 14th St, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f7d27f6-932e-11ea-9f09-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18417474466086528433",
  "source": "GoogleMaps",
  "reviews": [
   "Service was terrible.  First of all,  it was New Years eve.  I get it!   Had to wait to be seated, only to look at many open tables, stacked a foot high with dirty dishes, throughout restaurant and bar area.  Finally got seated and order was taken. It took forever to get order only to have  food ice cold. There was 2 of us, both ordered the all you can eat special.  Both reordered more shrimp,wings and same old story, cold food. How can you make customers wait that long only to serve cold food?  I cannot rate this visit very high and it will take a while before I return to Applebee's North Bismarck ND",
   "The servers here were so polite and caring, they even took my order 5 minutes before closing time. We will certainly come back again when we are in the area. Thank you again!",
   "Used to have sketchy employees but seems much better now. Food was good. Need to get some craft beers!",
   "Just went last night for the school fundraiser night. We had to pre-register for the event and then ordered and paid online and gave name and vehicle description 1 hour before we planned to pick up. We arrived on time and checked in using their texting system. We waited 1 hour before anyone even came to our car to ask our name.  After 2 hours we went to find out what was taking so long. 30 minutes later the manager told us that our food had been given to someone else. We were offered a refund or to wait for our food to be made. We chose the refund as we didn't want to spend more time waiting.",
   "Great food, service, staff, location and price."
  ]
 },
 {
  "name": "Rock'n 50's Cafe",
  "address": "2700 State St, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8fc8ff7e-932e-11ea-8233-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=2536593275888859716",
  "source": "GoogleMaps",
  "reviews": [
   "I always get great service here. Great food options and I'm only at the tip of the iceberg. Also, great drinks to go with your meal.",
   "The diner itself was very cute. Nice staff. Just wish the food was a little better.",
   "They have the best fries and the best shakes! Their knoephla soup is great too",
   "The 50s and 60s music along with the decor from the time frame made this a perfect trip thru time. I had a james dean burger which was done perfectly and the waitress was great",
   "My wife enjoyed the old time culture"
  ]
 },
 {
  "name": "Taco Del Mar",
  "address": "1024 S 12th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/900eb9ec-932e-11ea-b908-14b31f159f22.png",
  "tags": [
   "food",
   "active",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3413349576353129847",
  "source": "GoogleMaps",
  "reviews": [
   "Food and service was great.",
   "Create food and service.  Also are very active supporting the community",
   "Yummy fish tacos every friday, thats my personal favorite but they have something for everyone! Super friendly service in store as well as on the phone! Definitely recommend this place to others!",
   "Excellent food. Fast friendly service. Clean tables and floor. Great time, will go again.",
   "Used to eat here all the time when I lived in town so I make a point to stop by when I have a chance. Huge portions and great ingredients!"
  ]
 },
 {
  "name": "Johnny Carino's",
  "address": "1601 W Century Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/905ba2dc-932e-11ea-b45c-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2549847633470928957",
  "source": "GoogleMaps",
  "reviews": [
   "Service was fast. Food was hot when we got it.",
   "Just a brief and sincere thanks to the staff at Carino's in Bismarck. Stopped in for a glass of wine and pasta meal. Ordered fettuccine with marinara and shrimp. Absolutely fantastic! Only to be surpassed by their service. Thanks Autumn along with all the service and management staff for paying attention to me during a \"very trying day.\" I shall return!! Thanks again.",
   "Just saw a post on social media on how your restaurant will be open while adhering to 'guidelines' during this pandemic. How absolutely unprofessional and profit driven. I feel so terrible for your employees, which I assume you won't be supporting.",
   "Stopped in for dinner 01/18/20. Ordered the seafood fettuccine. Half the mussels were served unopened, and the calamari was overcooked. Flavors were good though and service was fine.",
   "This is the place to dine on Monday night.  Exceptional value, family platters half price, a family can dine for less than $20!!! We had the spicy chicken romano,  it is tantalizing! Artichokes, mushrooms, sundried tomatoes, chicken with bow tie pasta.  Autumn was a fantastic server, very attentive she even had a table of ten, very impressive! Great food, great service at a unheard of price!  The patio is awesome. Jennee T has added some water fountains which is so serene.  The Italian nachos are a favorite of ours. Yummy!"
  ]
 },
 {
  "name": "Kroll's Diner",
  "address": "2505 State St, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90aae5a4-932e-11ea-9eeb-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2649163196564227966",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered the meatloaf. It was horrible. Tasted like it was mostly filler with a funny texture. It was also cold. The mashed potatoes were cold. I had to pick through the salad. Our server was nice, but the food quality is very poor. Both of our meals were not good.",
   "Knoephla soup was very good and fleischkuechle was pretty good too, but not five star.  I would repeat and try some of the other German specialty options.  Coffee was solid.  Waitress was nice.  Love the old time atmosphere also.  Wish I could give 4.5.",
   "Not from around here so stopped in when staying and was very impressed!! Their menu selection is great. Their food is amazing. And had good service too!! If you’re looking for a quick, efficient, delicious, and comfortable feeling place to eat, go here!!!",
   "Food 5/5 stars\nService 5/5 stars\n5.99 daily special breakdown\nI order 2 of the 5.99 daily specials with 2 ice waters, and the host explains to me that, the only way to get the \"advertised 5.99 daily special, is that they need to add a $2.39 drink (ordered ice water) to each special. I feel like maybe they should add that info to the front sign. 2  of the 5.99 daily lunch specials and we will only add $4.78 plus tax to your meal. Should be advertised as the $8.38 + tax lunch deal.",
   "I just stopped in for dessert but the service was great. Nice and  clean and fast. The banana split was good and even though I know its work to make it, the server was very nice."
  ]
 },
 {
  "name": "QDOBA Mexican Eats",
  "address": "312 S 3rd St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90fa638c-932e-11ea-b73c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2478691059387787739",
  "source": "GoogleMaps",
  "reviews": [
   "It’s QDOBA, nothing much to write home about, except we were here on a very cold January day here in Bismarck, ND and it was like they were against turning up the heat. The dining room was cold temperature wise.",
   "Staff was great! I was THAT customer that came in like 10 minutes before closing and the food was still out ready to go and hot.\nPortion sizes were on the small side compared to Chipotle though.",
   "It's nice to order food just the way you like it.",
   "Their system went offline today for about 20 min at the beginning of the lunch rush. The staff handled the situation very well and kept their good attitudes. \nOh and my Chicken Naked Nachos were awesome!! I wish we'd have gotten a free drink or a small discount for the inconvenience. But, I do realize that decision wasn't theirs to make.",
   "Great food and they offer a college student discount. A couple employees aren't very good to work with. But otherwise a good place to eat."
  ]
 },
 {
  "name": "White House Cafeteria",
  "address": "117 N 5th St A, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/913bb370-932e-11ea-8e80-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "free",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16564184075062280186",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent bagels! You can by them to take home (4 in a batch) or get them toasted with cream cheese to eat right there! Very pleasant ladies running this place. Scones were tender and moist, but I cannot rave enough about the bagels! I will be back for more!",
   "One of those places you can drive by a hundred times and never know it's there!\n\nOnce you're in the White Drug Pharmacy, 117 N 5th, east side of the road just north of Main, head way to the back. Yeah, there's really a place to eat in here! Go on, past the counters, look for the big sign on the back wall- The White House- yeah right there, no really! Go back there, door on your right.\n\nTake a peek at the Specials Board. Today, Wednesday, Sloppy Joe's was on the menu. So I had to order it, since I am really fond of, and I mean not in a brotherly way, FOND of Joe's. I was leaning towards the burger, which was a buck off today, but I'm really fond of Sloppy Joe's!\n\nGot two on my plate, with some chips and pickle. The sauce was not tomato-y, but light, slightly sweet, and tangy. That's some good sauce, oh yeah. Served in a fluffy, soft, yeasty, home made bun. I didn't add anything to it, and it didn't need anything. Just naked and unafraid.\n\nI was thinking of ordering two more, but I'll just back a few more times, now that I know there's really a cafeteria in that pharmacy!\n\nReasonably priced, daily specials, hot, fresh, and tasty! Go there, Missy will take care of you!",
   "Tastes like home cooking. Wonderful service!",
   "Homemade food the tater tot hot dish was good I was hungry and could of used a bigger portion but I eat alot. There is also baked goods made by Mark. Homemade goods there great also. I have no complaints about this place. One more thing you can sign up for texts and when you do sign up u get a free meal just for signing up. Now you can't beat that!!! So get on over to White house Cafeteria u can't go wrong.",
   "Reminds me of the old KB's that was in Kirkwood mall years ago.\nTHEY USE REAL Potatoes, CHEESE BUTTONS ON FRIDAYS. Very Good. Clean Kitchen compared to many others in Bis-Man"
  ]
 },
 {
  "name": "Stadium Sports Bar",
  "address": "1247 W Divide Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/918da5a6-932e-11ea-9247-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7512762362225311049",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, friendly atmosphere. Service is good, drinks are good. It's wasy to walk around, play pool, or just hang out. I think I prefer this place to many others in town. It's very relaxed.",
   "Ate on The Lodge side of the place. Staff was extremely friendly, attentive and considerate. Food was great. Cool place. Will return!",
   "Love having lunch there. Friendly staff and quick service.",
   "My Favorite Sports Bar. They're always kind and courteous.  Fast service and great food!",
   "Super awesome experience bartender even experimented on a shot and give it to me for free and it was great. Ask for the liquid marijuana shot. Its great"
  ]
 },
 {
  "name": "Pancheros Mexican Grill",
  "address": "1225 W Century Ave, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/91defb48-932e-11ea-942c-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3395931703087589573",
  "source": "GoogleMaps",
  "reviews": [
   "The first time we tried Pancheros the food was cold, I thought we would try it a second time. The coke was out so we thought we would let them know and the lady said it'll take about 20 minutes.... We went to go sit down to eat but couldn't find a clean table so we sat at a dirty one while I watched my husband eat his lunch,, it was cold again so again I didn't eat it. I do not recommend this place and customer service is terrible.",
   "I was just passing thru town and stopped here, the guys working behind  the counter were super friendly and helpful. The food was fresh and flavorful and would eat here again.",
   "food was good. service was kinda pushy tables were all dirty. and they had some of the warmers open when I was in line. absolutely disgusting. Does anyone in that place clean? only gave it a 2 star because the food was good.  \nI wont be going back if that's the way the front is cleaned how bad is it in the back?\n\nJust wanted to add that Pancheros Reached out to me and I am very happy about how they handled themselves. I will go there again. Knowing they took care of the issue.",
   "Best burritos in town. Absolutely delicioso.",
   "Just not as good as I remember. This used to be my favorite place!\nIt truely is lacking flavor. Everything was very blahh..NO bite striked me as \"Mhmm this is good\".\nGuac is mushy because it has far too many tomatoes in it and completely ruins the consistency and taste.\nThe vegetables are over cooked and not seasoned/marinated like advertised.\nI had to look into this but there is $1.10 difference in the meal I ordered vs. Qdoba and the difference is so worth it for so many reasons."
  ]
 },
 {
  "name": "Denny's",
  "address": "405 S 7th St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/922eca86-932e-11ea-9945-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15919595341300597107",
  "source": "GoogleMaps",
  "reviews": [
   "Hamburgers are amazing, the Slamwich Sandwich is mouth watering!  Love the food here!",
   "I had steak (t bone) eggs pancakes and hashbrown, it's was all tasty but my steak was dry, really thin, chewy. I complained and made me a new one and it was nice and juicy, second time around much better, thanks for fixing it. over all really good service.",
   "Seen it on diner's drive ins n dives\nSo we try it n it was dam awesome",
   "I love going into restaurants with my family and enjoy their company. Service has been good here. When you want to do pick up orders or to go orders it seems there is no appreciation for the customer. I have sent my Sons down to get me a simple order to enjoy in the convenience of my own home and fine dining and nothing was right or it seemed like the server putting it together didn’t care. I am very disappointed, the take out especially if the customer is picking up it should be just as good as the dine in experience as well as enjoying it else where. Get it together Denny’s!",
   "The food at Denny's is always incredible. I ordered a very custom grand slam breakfast. I got exactly what I asked for perfectly cooked and everything tasted fantastic. I will most definitely be stopping here again."
  ]
 },
 {
  "name": "Applebee's Grill + Bar",
  "address": "434 S 3rd St, Bismarck, ND 58504, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/92a6ab06-932e-11ea-80af-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6569421489554092022",
  "source": "GoogleMaps",
  "reviews": [
   "Chips were overcooked, or cooked in fry oil that needed to be changed. If I was the chef/cook or waiter I would not have served those chips. Chips are not meant to be a deep brown.",
   "Food wasn't the greatest. But I have eaten at worst places. But one thing I can say is we had the best waiter EVER. I wish I could've remembered his name. He was a young man, about 21- no older then 25. Anyway we were there about 5. He went way out of his way to please us. I can honestly say the best I have had in a long while.",
   "Horrible \nOrdered a taco salad. The meat was like cement and cold. Suppose to have beans on there were a couple. The lettuce was huge chunks.\nPick up was at 6:26 it was ten minutes late\nCould of just as well went to taco johns or Taco Bell. Absolutely awful salad.",
   "Good service, good food, was quite quiet at lunch time on a Tuesday. my husband was bothered by the cleaning supplies we were sat next to.",
   "Food was great. Not so much the service. She should of worried about all her tables not just the two big tops she had"
  ]
 },
 {
  "name": "Burger Time",
  "address": "1320 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93049840-932e-11ea-99d9-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11406397954517256461",
  "source": "GoogleMaps",
  "reviews": [
   "Mostly Because Their Is A Gentleman by the Name of Jim that Works So Very Hard to Please Us Customers. He works in the \"Produce\" Dept. & We Are ALWAYS greeted with a Smiling Face & Even if we have ?s about Another Area He Will Go Out of His Way to Find Someone to Help Us. Fabulous Worker & the Most Customer Friendly Worker in your Entire Store. TY for Hiring this Man. He's the Reason I Come Back.",
   "I went through the  drive-up and ordered my food. A bacon cheeseburger and fries. They were very fast in getting my order ready. I traveled 5 minutes back to work to eat my lunch and it was already “warm” at best. The burger was dry and over cooked. The bun was a bit soggy and the fries were very bland. I may give this place one more chance but not likely. I think I can get a better burger elsewhere.",
   "5 stars for what it is - a drive through burger joint. Best fast food burger in town by far.  I don’t eat there often because I like somewhere I can go in and sit down instead of always eating on the run, but man are they good!",
   "rude service, refused walk ups to the window, and was told to use drive thru, while i dont have a car.  The drive thru and window are the same issue when it comes to ordering, handing money and getting food from the employees.  I brought my attention to other business who have let me use the drive thru in town to order food, and they even said Burger Time is being hypocritical on the issue.  I contacted the business on facebook, and was blocked afterwards.  I just sent a complaint to the Better Business Bureau regarding the issue, along with how they handle customer service.",
   "Could have just spit in my food, since you obviously have no passion for the industry. My chili cheese dog needs an IV for dehydration."
  ]
 },
 {
  "name": "Buffalo Wings & Rings",
  "address": "4424 N 15th St, Bismarck, ND 58503, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/937b8e34-932e-11ea-98a7-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1242164134493306787",
  "source": "GoogleMaps",
  "reviews": [
   "Night out with, just us ladies. Our lady server was great! The food was good! The coconut drink was good. The place seemed clean. It was nice to see it wasn't too busy and the place didn't lack culture. If you like my review please give me a thumbs up",
   "If you go into this restaurant thinking it's like competition to Buffalo Wild Wings you'd be right. Here is the thing it has better wings like good meat in them. I had the boneless and it was like the breast meat now the worst meat in the bird like most places. I think it is better than Buffalo wild wings and less busy with a good amount of TVs to watch whatever you're into.",
   "Fresh crispy large pieces of chicken. We like to get the 20 piece boneless with 4 different sauces",
   "Was excellent when it first opened, but now is no where near. I used to think the wings were the best in town. Now they taste a bit chewy and dry. My burger was pretty bland as well.",
   "I tried this place instead of going to Buffalo Wild Wings and I really do think the food was way better.  The staff were so nice and I was just all around pleased.  I will go back!"
  ]
 },
 {
  "name": "Kroll's Diner",
  "address": "1915 E Main Ave, Bismarck, ND 58501, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93e35252-932e-11ea-a91f-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12824241459825122788",
  "source": "GoogleMaps",
  "reviews": [
   "Great, simple breakfast food at a reasonable price. Service can be a bit slow at times.",
   "I haven't been there in 15 years. Nothing inside appears to have changed much. The food quality has improved from what I remember. I we there for breakfast we ordered 3 different meals all delicious. \nGood job.",
   "They call themselves Chermans??? The flieschkeukla was substandard to those west of the Missouri river and don't get me started on the weird lumpy yellow soup, that was not knephla!!",
   "Good food, \nMediocre cleanliness\nPoor service.",
   "Great breakfast selection."
  ]
 }
]