[
 {
  "name": "Idaho Botanical Garden",
  "address": "2355 N Old Penitentiary Rd, Boise, ID 83712, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/942ebd0a-932e-11ea-a0db-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "family",
   "music",
   "kids",
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=1029028211255606636",
  "source": "GoogleMaps",
  "reviews": [
   "In spring the flowers are in bloom everywhere.  Definitely a place to go for a simple date to walk and talk.  If photography is your thing there are many different types of flowers you can take pictures of.  My favorite though is winter when everything is lit up with millions of Christmas lights.  The people are friendly the line to get in is reasonable and it just looks amazing.",
   "Good family fun! I always get my entire family together for our traditional walk through the Winter Garden Aglow. What a treat to find some talented young people spinning fire set to music, with a yuletide theme! That was our favorite part this year. We love the musicians who played carols down below, as well.",
   "The Gardens light displays were absolutely beautiful.  They do a fantastic job using all of the space to create an amazing family friendly place to take in the beauty of the Christmas season.  Traffic gets pretty crazy so I highly recommend going earlier than later.  They also do a great job of having drinks for both little kids and big kids.",
   "No matter what season you come it's always beautiful.  On this particular occasion it was during the winter and I went to the Winter Garden aglow event.  The lights were absolutely impressive and it was just staggering to me the sheer amount of work that must have got into making this event as amazing as it was.  I give definite kudos to all the volunteers who were willing to stand out in the cold to make a real difference to the people who came.  Thanks!",
   "I always love the Idaho Botanical Gardens! Whether it's Winter Garden Aglow, music in the gardens, or a good friend's wedding, the Botanical Gardens are the perfect spot to hang out. Beautiful. Calming. Refreshing. Worth checking out."
  ]
 },
 {
  "name": "Old Idaho Penitentiary Site",
  "address": "2445 Old Penitentiary Rd, Boise, ID 83712, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9496cfcc-932e-11ea-9630-14b31f159f22.png",
  "tags": [
   "kids",
   "tour",
   "history",
   "historic",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15700490519395068761",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very informative and interesting museum. I found it very sad, but it is pretty cool to see how differently prisoners were treated, and how much our current prisons have improved. It is a great place to take people of all ages, if a place is for older people, they will advise you against bring kids there. The staff is very responsible. My over all favorite part of this was seeing Dennis the Cat's grave. It is so sweet that there was a cat for people to love! I would definitely go here again!",
   "My Wife and I did the guided tour here and it was Awesome! So much history for Boise and so many stories we got to hear. The architecture within the walls was amazing and to hear the back story made the tour all come together. If you are looking for a fun and informative activity go check out The Old State Pen.",
   "This was a surprisingly awesome stop in Boise. We have been to Alcatraz and other places like this, but really appreciated the openness of our experience, as well as an amazing arms museum donated by J Curtis Earl. This happens to be one of the nation’s largest collections of historic arms and military memorabilia, so WELL worth the visit!!\n\nPlan to spend 2hrs for a quick visit.. but we would recommend planning for a four (4) hour stop here. Plenty to see!!",
   "Neat to see a piece of history. Traveling exhibit of weapons when we went was really neat to see all in one place. Would have received more stars if more access to buildings was available. But what was open to the public was fun to see!",
   "Loved this self guided tour. Walked around for three hours.  Thinking wondering what 10 years would feel like in such a place.  The sad life there day after day. Crazy sad.  Put live in a different perspective for a few hours. \n\nThe arms museum was awesome.  Worth the moony even if your not interested in the prison.  And stories."
  ]
 },
 {
  "name": "Kathryn Albertson Park",
  "address": "1001 N Americana Blvd, Boise, ID 83706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/94f4cf5a-932e-11ea-ab9b-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "walking",
   "walking",
   "walking",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4939554207077957769",
  "source": "GoogleMaps",
  "reviews": [
   "Free parking, right in the city and beautiful park. Lots of families come here to take photos so the park is most enjoyable on week days when less people are here. You will get to see some pretty off trails and wildlife walking around here.",
   "Directly across the street from Ann Morrison park, Kathryn Albertson park is full of wildlife if you take the time to quietly enjoy it. Multiple walking paths make each trip a slightly different experience if you pick alternate routes. On this trip we found a deer just off the trail.",
   "I love taking my children here for seasonal pictures. I also enjoy walking my dog here. Been coming here for 10+ yrs. We cannot wait for the upgrade! 😁",
   "Perfect park to take photos. So many beautiful trees and bridges that make wonderful backdrops. The path is perfect for walking or just looking for the turtles.",
   "Beautiful park! The people who come here are rude. No one stops and waits for you if you are taking pictures and just geta in the way or ruins the shot. \nGreat walking and nature enjoying views."
  ]
 },
 {
  "name": "Julia Davis Park",
  "address": "700 S Capitol Blvd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9555b5ba-932e-11ea-80aa-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "history",
   "free",
   "art",
   "history",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12421192880509925035",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great park. Lots of old trees, big open grassy areas, large rose garden, picnic tables, pond with paddle boats in the warmer months, pavilions, tennis courts, the zoo where you can get a free peek at the giraffes, nice restrooms and the greenbelt along the river. Art museum and history museums all right there also!",
   "Julia Davis Park is a local WONDER to BEHOLD. Stop by the main entrance where her sign is and look at your compass. What do the DEGREES EAST tell you? There is MORE there than meets the eyes. A lot of thought has gone into this natural inter city OASIS. CAN YOU DIVINE WHAT IT IS? It's right there STARING you in the face!",
   "We tried twice today, Feb 1, 2030 for the visit the the Boise zoo free event. Unfortunately, both times we circled the parking lot and found no spots to park.  Hope it was fun for all who made it in🐢",
   "The clean up crew were friendly and welcoming. They helped point us in right direction. The garden was very pretty and offered so many diff roses :) the garden is in the midst of a lot of surroundint attractions. A art museum a zoo and a black history museum. There was no fee to attend the rose garden.",
   "Great park for walking and enjoying the trees. The park is huge and has a little something for everyone. The paddle boats in the spry and summer are a fun treat for kids."
  ]
 },
 {
  "name": "Zoo Boise",
  "address": "355 Julia Davis Dr, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/95b4040c-932e-11ea-842d-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15057950043396794915",
  "source": "GoogleMaps",
  "reviews": [
   "Coming from Dallas & having memberships to both the Dallas and Ft. Worth zoos was a bit of a shock, but now that it's our zoo, we love Zoo Boise. The expansion with the African exhibit is fantastic. I wish they would've sprung for non-reflective glass, but otherwise very well done. My kids love the zoo and we go a few times a month. We especially like when the keepers or student volunteers are out and give us a little extra information. My kids also love feeding the giraffes and the Sloth Bear. Can't wait to see the continued improvements.",
   "My family had an absolutely fantastic time at the zoo. It's so big and the enclosures are all so so so nice. There are inside and outside ones when it's cold and the prices are AWESOME!!! They have season passes that my family will definitely be getting. There's also an area that's fantastic for kids with a little play area and what not. Great for adults and kids",
   "An INCREDIBLE PLACE TO BE. NATURE NEVER LOOKED SO AWESOME! Stare into the snow leopards eyes if you dare! You'll FEEL the wild side and KNOW you WILL NEVER compete. Her tail the longest of ANY big cat and the FOX WOLF, really can read your mind. If you are starving, the Pretzels with cheese by the merry-go-round ROCK!",
   "This zoo has some really cool features but I'm pretty disgusted at the size of some of their exhibits. Instead of working on additions, they ought to be working on giving more space to some of their prisoners.  Sorry, not sorry. Do better, Zoo Boise. Compassion over profits, please. Some of your souls look so sad. Please give them more room and enrichment.",
   "Me and my wife had a good time at the zoo. I think the price is reasonable for how many animals and exhibits they have. It would be nice if some of the exhibits were a little more presentable but not that big of a deal."
  ]
 },
 {
  "name": "Ann Morrison Park",
  "address": "Ann Morrison Park, 1000 S Americana Blvd, Boise, ID 83706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/96107d92-932e-11ea-8bb2-14b31f159f22.png",
  "tags": [
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=3747706204548593311",
  "source": "GoogleMaps",
  "reviews": [
   "Love this park, it's beautiful! Very spacious, which is great because a lot of people enjoy it. Great playground for kids, and then green belt is right there. And will take you anywhere. Also has a great spot for your dogs to play. Everyone should visit this park!",
   "Dog Island is one of the best dog parks I’ve ever been to. If you have an issue with a dog or person, there’s enough space on the island to go to a separate part. It’s great for throwing balls, too, since there is so much space! It’s really a great addition to the park.",
   "It's a huge park where many different activities can be done at the same time and people can still have some private space for picnics or reading a book. Dog Island is a freaking awesome dog park!! Best one in Boise hands down!! 😊",
   "OMGOSH! I went in the RAIN and it was fabulous! You HAVE to see this. Sculptures that are so detailed. Just amazing. I didn't see much of anything because they were working on some house that is usually open to visitors and moved another. But the roses, just gorgeous and great photo ops.",
   "Dog park was pretty good. Aside from nowhere to get water besides poopie water in the ponds. So bring your own clean water for your dog(s). Only super negative was the homeless drinking a case of beer outside the dog park area and the drug deal I witnessed but hey welcome to Boise"
  ]
 },
 {
  "name": "Freak Alley Gallery",
  "address": "210 N 9th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9681e48a-932e-11ea-a555-14b31f159f22.png",
  "tags": [
   "creative",
   "art",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7252264425752713824",
  "source": "GoogleMaps",
  "reviews": [
   "The art changes once every month or so. Some has symbolic meaning, others are creative expression. It's so amazing to see the different types of creations people have to offer.",
   "I couldn't help but smile and gawp at the wonderful and poignant artworks sprawled all over this excellent alleyway. Rain or shine, take the time to swing by and check it out. Watch out for cars (it's still a road, albeit not busy) and check out the Instagram tags of the creators of your favorite pieces.",
   "I love Freak Alley! Such an awesome collection of amazing artwork mixed in with old, rustic buildings, emergency fire escapes and cracking red brick.",
   "Gotta love that artists have a place to express themselves anywhere. Boise does a great job of providing a lot of space for artists to do just that. Keep doing what you do. Favorite is the MLK piece. It's a clean walk and very accessible.",
   "Super neat place. It is just an alleyway, but man is there some absolute talent showcased. Its located super conveniently and is also a pretty neat place to snag pictures, unfortunately while we were strolling through, a freak hailstorm with light started and our visit was cut short."
  ]
 },
 {
  "name": "Camel's Back Park",
  "address": "1200 Heron St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/96c6c56c-932e-11ea-a1f8-14b31f159f22.png",
  "tags": [
   "family",
   "walk",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11658336266490453078",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to spend with friends and family. Tennis courts, sand volleyball, park for the little ones, body-weight outdoor gym, and a huge green space to play in the grass. There’s also a really steep hill (that looks like a camel’s back) that a lot of people run up and down. There’s also some trails tucked behind that is fun to do if you’re looking for a nice stroll in the hills.",
   "A great place to take a walk or a hike. The work that they have done on the hillside to keep the main trail is amazing. So great that they were able to preserve this for future generations. The Hyde Park Street Fair in September is s huge hit. Best event of the kind in Boise!",
   "Really nice park to go to. Great for hiking my boyfriend and I love to bring our dog up the hill and let her run around. Beautiful view of the city up there.",
   "Boise is the City of Trees, but you don't really notice it unless you climb up into the foothills and look out over the city. It's there that you realize, \"Oh, I guess we really do live in a forest.\" Camel's Back is a wonderful place to do that. Don't be daunted by the sheer straight face climb. There's also a much easier route to the top around the side. The park itself is also beautiful, idyllic.",
   "A nice destination in a fun part of Boise. We went up the steep side of the hill first and then along the ridge, finally finding our way back to the main part of the park along a less steep route. After exploring the park itself, we went around the base of the hill to the other side to walk into Hull's Gulch. A short walk that day, but we'll be back!"
  ]
 },
 {
  "name": "Aquarium Of Boise",
  "address": "64 N Cole Rd, Boise, ID 83704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9750584a-932e-11ea-8499-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9237695942392734918",
  "source": "GoogleMaps",
  "reviews": [
   "This is such a small and cute interactive aquarium! The staff is so friendly and really engages with the customers no matter the age. Plenty of hands on activities in the tide pools available. I enjoyed being able to touch the rays and feed them. The staff is very knowledgeable and is happy to answer questions. Though small, this aquarium is perfect for a small adventure.",
   "Giving three stars because my daughter had a great time, but the staff didn't tell us a few things that they should have. They didn't  tell us that we had to buy the food at the front desk so we were walking around for a while wondering where to but it. Would have been nice if they just told us that if we wanted to feed them to just buy it then instead of going back to the front. Apparently paying with cash is cheaper, we only know this after coming back to buy the food and someone was paying to get in with cash and they said, \"since you're paying with cash you saved..\" Its quite small and not a lot to see but it was decent.",
   "This is such a great place to take kids. They have a very safe setup where even little kids can see and (where allowed) touch fish and rays. Very interactive and entertaining.",
   "This is the best aquarium I have been to and that's saying quite a bit. I loved how many interactive touch tanks there were and feeding the birds was so much fun. Definitely worth the visit!",
   "Absolutely worth every penny! So many things to see! We spent easily two hours and it flew by. Can't wait to go back!"
  ]
 },
 {
  "name": "Discovery Center of Idaho",
  "address": "131 W Myrtle St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/979ece82-932e-11ea-acd5-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11142373702015055983",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed Adult Night at the Discovery Center of Idaho.  We met three other couples to enjoy a night of learning while sipping on drinks.  Lost Grove and the T-Rex Drinks were awesome!  Overall we had a great time and we hope to attend another event soon.  I highly recommend it for your next date night in Boise!",
   "Cool place for kids to learn about science, technology, engineering and math.  Not quite as cool as I recall from when I was a kid, but my children 4-5 always have a blast when visiting.  New exhibits with legos and new tech are fun and interactive.  Birthday party setup is nice and allows for private access to the facilities for an hour or so.  Liquid nitrogen ice cream is pretty good as well!",
   "Where your two-year-old can roar like a T-Rex! So much fun just amazing place. There is no reason not to come to the Discovery center of Idaho! Make sure you get the family pass it is well worth the money.",
   "I originally put 4 stars by mistake! I absolutely love the Discovery Center. I have been coming here since high school (over 10 years!). I am a massage therapist, and most recently I came here with some other massage therapists for the Bodies Exhibit. So fascinating and a really good way to see all the muscles I work on every day!",
   "We had our organization's winter celebration at the Discovery Center for about 100 people, and it went great! Not only did all of the guests have a great time, Cynthia (the event coordinator), went above and beyond to make sure our event was a success. She helped coordinate with the many vendors that we had at the event, as well as met with me several times leading up to the event to make sure we had everything we needed. We plan on using the Discovery Center for future gatherings. 10/10 recommend for large company events, and it's a great place to visit overall!"
  ]
 },
 {
  "name": "Idaho Anne Frank Human Rights Memorial",
  "address": "777 S 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9803de1c-932e-11ea-b984-14b31f159f22.png",
  "tags": [
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13191617797240413742",
  "source": "GoogleMaps",
  "reviews": [
   "This place was a quaint comfy park like atmosphere. Students were there studying and writing papers. Birds were chirping. The statues available and water falls they have installed were clean. Info on some of the statues. For all ages! Def worth stopping by and taking a looksie :)",
   "What an experience, so much to look at & read about Ann Frank, very well done! Definitely a place not to miss, especially the spring & summer.",
   "My family visited from Toronto. My sister and her son just made a fuss about how great this place is. Her husband is Jewish, so human rights is really close to home. They read all the plaques and came away with a deeper understanding of people who have contributed to human kind from many ages and counties.",
   "A really nicely laid out outdoor memorial with beautiful stone work and paths, located right next to the Boise River and near downtown Boise. The memorial has many quotes from various civil rights leaders that sort of jump out at you as you walk through the memorial. Also includes a central statue of Anne Frank, imagery of other civil rights leaders and icons, and a memorial for historical genocides. However, it was unfortunate that all of the various civil rights leaders and movements were represented, EXCEPT any mention of the LGBTQ civil rights struggle or any mention of Stonewall or Harvey Milk. It seems this needs to be added, as it was conspicuously left out. It didn't seem complete to me.",
   "If you really want to think about the impact of your life and the difference you can make this is a great place to be. You come to appreciate your rights and privileges and gain an understanding of what others have gone through. Definitely a must see if you're in Boise"
  ]
 },
 {
  "name": "Julius M. Kleiner Memorial Park",
  "address": "1900 N Records Ave, Meridian, ID 83642, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/987d2edc-932e-11ea-ab9b-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2582903697834749180",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice park any time of the year. Small and short disc golf course but great for teaching the sport! Pond is always full of ducks, and the playground has an activity for all age groups! Definitely our favorite in the treasure valley",
   "In the summer we do workouts here with Fit4Mom. The park is always well maintained and looks so pretty. It is never too crowded which is nice and they put on a lot of events. Walking around even when we are not working out is so nice and relaxing. The park for the kids is nice and updated with lots for the kids to do and even though the splash pad is pretty simple it’s still fun. I like how it’s close to the village too so we can walk over and have coffee there if we wanted too.",
   "A magnificent park. If you ever need to shoot a film set in the future (in Idaho, of all places) this is the place to do it. Weird/fantastic modern art everywhere, beautiful paths, lots of food nearby, fantastic through-and-through.",
   "Park was great, but it was more fun to see people driving 40+ and revving their engines loud so that others can run out of the way. If you need an area to get the blood flowing faster, then this is one of them. And because I have never noticed any officials there, I'm assuming that some have permissions to go higher than the signs states. \nOtherwise, it's pretty decent",
   "The park was very nice.  My wife was super impressed with how many bathrooms there are and how clean they were."
  ]
 },
 {
  "name": "Settlers Park",
  "address": "3245 N Meridian Rd, Meridian, ID 83646, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/98de3c58-932e-11ea-bbab-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "kids",
   "family",
   "music",
   "kids",
   "kids",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=8799049508952512017",
  "source": "GoogleMaps",
  "reviews": [
   "Love this park! Lot's of space for everyone! We come here often to run/walk our dog. We enjoy attending public events and also hosting our own family events here. Great atmosphere here ☺",
   "This park is always so full of life. They have a wonderful splash , climbing, swings and more for the kids. What seems like miles of grass to play with your dogs, fly a kite or just run!",
   "Loving this park. There is so much to do: fishing, tennis court, climbing rock for kids and two playgrounds for different ages,  splash park in summer and little music station for kids. This is our family favorite park in Meridian",
   "This is the coolest person ever. Take your kids in the summer because they have water play. Dog-friendly as long as you're on a leash",
   "10 years ago Settlers park was the best park, with a huge variety. But over the years with the hot summer sun, everything now just looks faded. The large play area for some reason has a back entrance to it, so if you are standing on the ground while your child is on the play equipment, and they suddenly run towards the back entrance, you have to go ALL the way around the equipment to get them. Just seems poorly designed. \n\nIt's also almost always super crowded. To the point of annoyance. I understand public parks are popular, and never expect the park to myself. But it just always seems like there's a lack of parking and too many kids playing to keep a good eye on my multiple kids."
  ]
 },
 {
  "name": "Puzzle Effect - Boise",
  "address": "8249 W Overland Rd #140, Boise, ID 83709, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/99d3d8b8-932e-11ea-bf8d-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=637883492980511149",
  "source": "GoogleMaps",
  "reviews": [
   "Such a fun experience. The staff is super welcoming and helpful and you can tell they like their job. The themes are well thought out. Great for team-building with your co-workers or a fun family game night.",
   "My first time to experience an Escape Room was great at Puzzle Effect in Boise. Thankfully we had some frequent escapers to guide us and help us find what we should be looking for. I can’t wait to do another one!  \n\nThe staff member at Puzzle Effect was so helpful in explaining ahead of time what we should expect and was so supportive in knowing most of us were first-timers. He also was so enthusiastic about us finishing in close to record time. We ROCKED!!!",
   "Absolutely fantastic experience from the moment I called with questions to the moment we left,  great staff. Very fun time in our escape room and I’ve done escape rooms before. I will definitely be going back!! Our daughter had her birthday here as well and had a great time with her friends.",
   "The puzzles were extremely challenging and lots of fun. It was worth flying across the country just to play the game.  Finishing with 4 minutes left made us all feel proud!\nGreat facility- very nice “guide.”",
   "This was my first experience with an escape room and it was so different from what I had expected! I was thinking it would be some low budget not so scary spook alley with a couple puzzles. But it was very tastefully done with super thought provoking puzzles all relating to a central theme which in our case was ancient Chinese mysticism. And high quality, high tech props. Katelyn was really great and made sure to keep an eye on us through cameras, and if we got stuck she put up helpful hints on the TV screen in the room. It cost $25 per person and you have one hour to complete all the puzzles relating to one large puzzle. It was a lot of fun and I would recommend it to anyone!"
  ]
 },
 {
  "name": "Idaho State Museum",
  "address": "610 Julia Davis Dr, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9a2ce386-932e-11ea-b42c-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "kids",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16579558024250529817",
  "source": "GoogleMaps",
  "reviews": [
   "A great example of a state prison.  A very informative tour laid out with videos and interpretive signs. You can walk all around this prison from the general population halls, Siberia, the isolation cells to the hanging room. It is very sobering as you peak into the past. There are some beautifully tended gardens on the grounds as well as a  building that is just weaponry from the past. There are interactive features of your tour to enjoy as well.",
   "The remodeled museum is an absolute masterpiece! It is highly interactive and built in rooms that make it easy to manage groups of children. I went with a group of 4th graders and they were entertained for 2 hours. I felt proudly that it greatly represents our amazing state. It will easily impress visitors and locals. A must see!",
   "High quality museum and staff! I was greeted by Alyson (with a Y, she said), she was super welcoming and kind, she stood up to greet us. She engaged with my kids making sure they felt important. As a leader in customer service for over 15 years, I recognize good service. Alyson has it. \nThis museum is excellent! My kids loved the interaction aspect of the place. TownBoom was so fun! My kids loved the dynamics of the train.  Will visit again.",
   "It was a fun place for our whole family. There was a decent amount to see and do and our young kids were fairly well entertained the whole time. There were kids educational play areas which worked well for us and still deeper content for adults. There is a good mix of digital presentations and traditional displays.",
   "So much information, I suggest going for a good 5 hours to appreciate everything they have there 💚 I missed out on 1 large room and I was there a good 3.5 hours trying to read as much as possible. They include a lot of different topics and one room changes periodically. There are MANY hands on interactive things to do for children or people like me who love touching things 🤣"
  ]
 },
 {
  "name": "Basque Museum and Cultural Center",
  "address": "611 W Grove St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9a8f0270-932e-11ea-ab7b-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=3153655920565222176",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting place. Go.amd learn something interesting",
   "If you are enjoying Boise's downtown bath district, please make sure and check out this museum for regional and local historical information.",
   "Beautiful place. Didn't take the official tour but will soon!!!",
   "Great way to learn about the Basque in Boise. I wished there would have been a video to show the dances performed at the annual festival for those of us not fortunate to attend in person.",
   "Great space! Very welcoming. Would recommend."
  ]
 },
 {
  "name": "MK Nature Center - Idaho Fish and Game",
  "address": "600 S Walnut St, Boise, ID 83712, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9af3ca58-932e-11ea-85b2-14b31f159f22.png",
  "tags": [
   "free",
   "nature",
   "kids",
   "art",
   "walking",
   "walk",
   "family",
   "nature",
   "field",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=16340910901016683434",
  "source": "GoogleMaps",
  "reviews": [
   "Wow, this is definitely worth a visit! Well designed and maintained nature area loaded with streams, ponds, viewing areas and informative signs. I loved the sturgeon pond! It was a little tough to see with the reflection on the water, but thankfully the sturgeon were hanging out at the contrasting white sand bottom, they were maybe between 4-6 feet long. Quite impressive! Thanks for creating such a great space, and its is free to visit!",
   "It's been several years since I'd been here. (No longer have little kids.) My husband and I had decided to go here in order to get a little walking in. They've really cleaned it up. They spruced up all the viewing areas. There's local art and several fun little kid activities. People of all ages were enjoying the spring day. I want to go back when it is really spring so that I can see what it's like with the butterflies and hummingbirds.",
   "Just for everyone's info, the nature center building is closed for remodeling for the next couple of weeks. You can still take the walk on the nature trail, which I recommend. It is amazing. Also you should plan a trip to the nature center after the reopening. Your whole family will enjoy your time spent together.",
   "I absolutely love taking my boys here! It's so much fun and so very beautiful. lots of flora and fauna! 🌱🌲🦌🦝🦊",
   "I took my children here on a \"field trip\" and they had SO much fun. I loved how natural it all felt, that we could roam freely and learn along the way. The staff is incredibly sweet and helpful. We will be returning next year for sure!"
  ]
 },
 {
  "name": "Barber Park",
  "address": "4049 S Eckert Rd, Boise, ID 83716, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9b44ab18-932e-11ea-aa95-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15322154669579698979",
  "source": "GoogleMaps",
  "reviews": [
   "We love Barber. It's our starting point for all our advetures! Walks, bike rides, floating, playing at the park, and just exploring and enjoying nature!",
   "Very nice park! Wife and I visiting our daughter and son in law. We have NOTHING like this in Arkansas. We have trails and mountains in the north western part of the state but nothing like this! And it’s just a 5 min drive from their home in Harris Ranch 😃 beautiful park, beautiful city, beautiful state!!!!",
   "We love this park! :-) such a wonderful place to take our dogs :-)",
   "I was able to find nooks along the river that were private and secluded, despite the park being packed with folks. Lots of beautifully mature trees, diving ducks, and fisherman on the east side provided a wonderful backdrop for the day. Very clear water that you can wade across, but there is a swift current here. Great just for a picnic. Lots of dogs. A great mix of sun and shade, so that you can cool down a bit when necessary.",
   "If you are FLOATING THE BOISE RIVER this is the spot to launch your rafts. There are air hoses conveniently located by the launch spot and there is an outfitter with raft/tube rentals available as well. A snack shack with drinks, shaved ice and food is usually open during daylight ours as well. There is also a series of trails, both paved (bicycles, strollers) and dirt for exploring the park. I found a beautiful dock to view the river and watch the floaters coming down. I will be bringing family and friends to this spot and floating the river as well!"
  ]
 },
 {
  "name": "Idaho Military History Museum",
  "address": "4692 W Harvard St, Boise, ID 83705, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9b9e8c6c-932e-11ea-ac54-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "free",
   "kids",
   "learn",
   "knowledgeable",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=84669292700648252",
  "source": "GoogleMaps",
  "reviews": [
   "The Idaho military museum was awesome. It is small but has really great potential especially if people keep up the donations.  They have display cases from different wars through out time and it was really cool being able to see and read about our history. Both in Idaho and around the world.  If you have not been I would highly recommend it.  Admission is also free so bring a couple a dollars to donate!",
   "I really enjoyed looking at the pictures and models of the naval ships. I also really liked being able to get up close and personal with a MIG29 and a F4 Phantom. So cool! Love to see my tax dollars put to good use :)",
   "It's nice for a small museum. However don't go expecting a lot of exhibits and the gift shop is lackluster at best. But it's free admission and for free it's worth it.",
   "I personally love machinery and mechanical weaponry. There's something enjoyable about the power and steel of these machines. This is a great time if you like tanks/airplanes. Some little kids don't find it interesting so keep it mind this isn't for everyone.",
   "I loved it. There is so much to see at your own pace. So much to learn and it is great for kids. Friendly knowledgeable staff too!!! Great place to spend a few hours learning."
  ]
 },
 {
  "name": "Hyde Park",
  "address": "1413-1620 N 13th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9bfe1350-932e-11ea-a355-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "unique",
   "food",
   "historic",
   "walking",
   "walk",
   "walking",
   "historic",
   "wander"
  ],
  "link": "https://maps.google.com/?cid=11348820294090839129",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful Park nestled against the Boise foothills just a mile or so behind the state capitol. Play set for the kids, an outdoor Gym, Mature trees, open space to play, tennis courts, hiking, BBQ area and more! A most visit when in Boise or the Hyde Park area!",
   "This area known as Hyde Park is a historic, old shopping area which is been renovated into restaurants. There are a few very nice little stores which typically sell more unique items. There are various shops like:  ice cream shop, pizza places, bars, Mexican food, gas station which sells groulers, breakfast places, and several good restaurants. It is very walking friendly and dog friendly.  Several places to park with one area with pay parking.  It is a short walk to Camel's back park.  It is located in the historic north end of Boise.",
   "Nice to look at the houses, but the rumours are not true. THEY DO NOT GIVE OUT FULL SIZE CANDY BARS! It is ALOT of walking, LONG lines to wait in at EVERY house, and definitely a one and done kind of experience.  Been there, done that, dont need to do it again. Plus there are TONS of people, it is hard to walk on the sidewalk, if you have a stroller you are walking in the street which means whoever is pushing the stroller cannot be with the kiddos. Thankfully the street is closed to vehicles.",
   "It's a fun, cute little historic neighborhood place to go for dinner, or to wander around, and then over to the park.",
   "Pretty cool park. I enjoyed going up to table top. Hyde Park Streetfair was also there. It was very crowded and very granola hippie."
  ]
 },
 {
  "name": "Re-POP Gifts",
  "address": "210 N 10th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9c6191f4-932e-11ea-b47c-14b31f159f22.png",
  "tags": [
   "unique",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=4695241515282587658",
  "source": "GoogleMaps",
  "reviews": [
   "The owner is so sweet and nice! Her and her husband make their own props and help you take pictures with them. It's a needs paradise! It seriously feels like a mini-Comic Con inside.",
   "Unique store! Millie was so kind to box and wrap the t-shirt we were giving as a gift. No extra charge for it either. I'm definitely going to have to POP back in from time to time!",
   "The staff here is very nice and knowledgeable. They have a lot of prints by local artists. Definitely one of the most fun shopping experiences I have had. Get ready to nerd out!",
   "This place is so awesome! There is truly something for everyone, whether you’re into books, video games, movies, TV, anything pop culture related, they have it! They also have a lot of artwork and jewelry and patches from local artists. Prices didn’t seem outrageous in my opinion and the person behind the counter was polite and helpful.",
   "Super fun and cute store packed with all sorts of nerdy/pop-culture gifts. There's also a nice selection of local Idaho-souvenir type items. Places like this are what make downtown fun!"
  ]
 },
 {
  "name": "Quinn's Pond",
  "address": "3150 W Pleasanton Ave, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9cc892d8-932e-11ea-80ab-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14213959113429566158",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park gets crowded during the day. Early mornings and late evenings are the best times to go. Wheelchair-accessible bathrooms nice River area nice ponds. Idaho river sports is right next to it if you want to rent some water gear.",
   "Awesome place for summer fun! You can paddle board, kayak or float around. There's a great kids area that even offers life jackets to borrow.",
   "Needs more shade but otherwise great for puttering around on kayaks and paddle boards. Snack bar close by, restrooms, Sandy beaches and a few grassy areas. I was surprised at how many people were there and parking was somewhat of a problem as the day progressed. Enjoyable all the same...we will go again.",
   "I'm still in awe of how beautifully the whole huge area was put together. The many array of things to do there or simply relax is impressive. Amazingly beautiful & welcomeing. Thank all of those that made it happen. Thank you so very much.",
   "Great time with friends, paddle boarding and sitting on the beach. Lots of fun!"
  ]
 },
 {
  "name": "Hyatt Hidden Lakes Reserve",
  "address": "5301 N Maple Grove Rd, Boise, ID 83704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9d311a8a-932e-11ea-ba05-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "nature",
   "walking",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14808063315276040333",
  "source": "GoogleMaps",
  "reviews": [
   "My kids and I walk here as least once a week during sunny days. Spring is in the air and we're excited to be visiting this place again soon! Down falls: There's no dogs allowed and often towards the end of Autumn the path gets over grown.",
   "Awesome little nook!! It's a great place to take a walk around some peaceful wilderness. There's trails around the whole area and a nice little bridge with some nature info that, when water is high, it's surrounded by water. There's usually some ducks or geese year round so watch out for them.",
   "Amazing little place right in Boise. Great walking trails. Beautiful views.",
   "This trail was so beautiful! It really is a hidden gem, I totally didn’t expect it to be as big as it was. There are informative signs all throughout the trail telling you tidbits about the area. It was really cool. Definitely going to go back here! It’s also a very easy hike, suitable for all skill levels in my opinion.",
   "A nice and quiet hidden spot. Good for going for a walk and feeling like youre far removed from the city when you're actually right in the middle of it"
  ]
 },
 {
  "name": "Idaho Black History Museum",
  "address": "508 Julia Davis Dr, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9dd68546-932e-11ea-b0af-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13101060499441637240",
  "source": "GoogleMaps",
  "reviews": [
   "Look forward to some multimedia additions. Amazing location and friendly patrons.",
   "Excellent local museum host whose mother is an Idaho State representative. Great information and friendly.",
   "A sobering reminder of the overwhelming struggles for part of our population.  Interesting stories and information on a variety of subject areas.",
   "The Museum director Phillip is great about answering questions. And also good about doing tours for school programs.",
   "A definite must see when coming to Boise, I am of the belief that all people from any walk of life or ethnic backgrounds should visit such an important and Vidal part of the American  historical experience."
  ]
 },
 {
  "name": "Boise Depot",
  "address": "2603 W Eastover Terrace, Boise, ID 83706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9e4bde7a-932e-11ea-b8e9-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "history",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7556088796670183468",
  "source": "GoogleMaps",
  "reviews": [
   "The Boise Train Depot is a classic spot for a family outing or photography sessions! I’ve photographed a few different sessions here, from weddings to seniors. The Depot is beautiful year round, especially with the view of downtown Boise! It’s particularly pretty if you go in Spring or Fall with all of the flowers and plants around. If you’re looking for an intimate, classy wedding venue, I’d definitely recommend the Depot! I’ve photographed multiple weddings here and each one is able to transform the space into something unique. The staff always seems on top of things and there’s a cute bridal suite for the people to get ready in! Plus, they usually allow you to go up in the bell tower!",
   "Beautiful train, depot, and clock tower. The steam train is beautiful and big and great for pictures. The inside of the depot has nice original benches and lights, and original bells (4 of them) in the clock tower. Good place for photo ops",
   "Great place to go for a piece of Boise history. Beautiful park to get pictures of or views of downtown. The depot hosts different interesting events during the year that are cool to check out. If that's not enough and Pokemon Go is your jam there are a lot of stops and a gym.",
   "One of the most beautiful places I like to visit! Great for pictures and just to relax. Inside the depot is absolutely magical and there is nothing about this amazing place that I don't love! 😊",
   "Boise Depot is beautifully restored and has historic displays from the era of early train travel.  My great grandfather was a conductor with Union Pacific based out of Boise Depot.  It is wonderful to share that history with my children, his great, great grandchildren.\nRide the elevator to the top of the Bell tower for a panoramic view of Boise."
  ]
 },
 {
  "name": "Table Rock",
  "address": "3199 E Table Rock Rd, Boise, ID 83712, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9ec05680-932e-11ea-8ecd-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "hike",
   "family",
   "kids",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=686496803154581816",
  "source": "GoogleMaps",
  "reviews": [
   "Go God.\n\nFolks, it's a cross that's been there forever. It isn't hurting anyone. Table Rock is a lovely hike from any direction. There's a great view of a beautiful city. What else do you need?",
   "Table Rock is a great place to go for a view of the valley. It’s peaceful and relaxing. Park at the bottom and hike all the way up or drive up and park near the summit and take a short walk. Great for the whole family.",
   "One of the best easily accessible hikes in Boise! I HIGHLY recommend a sunset bike for this one or you can drive all the way to the top (almost any car is capable), pull out a picnic, and watch the sun drop below the horizon. The back side trail the golf course is perfect for mountain bikers or hikers who want steeper grades. The main front side trails are great for kids and families or those looking for a less strenuous incline. At the top, the view of the city, foothills, and landscape is hard to beat; if you haven’t been- go now!",
   "They recently limited parking, closed the small lot at the bottom of the hill, and have signs up threatening to charge you with trespassing. They also threaten to have your car towed. Used to be the best place in boise for an afternoon hike, now it is the last place to go.",
   "I WAS BORN AT ST. LUKES HOSPITAL DOWNTOWN AND I HAVE LIVED IN IDAHO FOR 36 YEARS... IN 36 YEARS, I HAVE NEVER BEEN TO TABLE ROCK AND UNTIL THIS MONTH I HAVE NEVER TRULY BEEN ABLE TO SAY FROM MY HEART THAT I BELIEVE IN JESUS BUT THANK YOU LORD THAT THIS DAY I CAN!!! I LOVED IT AND I LOVE MY HOMETOWN!!! GOD BLESS EVERYONE WHO LIVES HERE AND STRIVES TO DO GOOD FOR OTHERS!!! MOST IMPORTANTLY GOD PLEASE BLESS EVERYONE WHO IS LOST, FOUND, OR TRYING TO FULLY SURRENDER!!! WE ARE ALL YOUR CHILDREN AND JESUS IS THE ONE TRUE KING OF ALL!!! THANK YOU GOD FOR YOUR ONE AND ONLY SON JESUS CHRIST!!! THANK YOU JESUS FOR YOUR ULTIMATE SACRIFICE TO SAVE ALL OUR BROKEN LIVES HERE ON EARTH!!! I AND ALL OTHER BELIEVERS PATIENTLY WAIT TO BE WITH YOU ETERNALLY IN HEAVEN!!! PLEASE GIVE US THE GIFTS AND THE KNOW HOW TO USE THEM SO THAT WE MAY STAND RIGHTEOUS THROUGH JESUS AND MAY HE USE HIS HOLY SPIRIT IN US TO HELP ALL OTHERS IN NEED OF HELP AND SALVATION!!! I PRAY THESE WORDS IN YOUR NAME JESUS CHRIST, THANK YOU,  AND AMEN!!!!!!!"
  ]
 },
 {
  "name": "Veterans Memorial Park",
  "address": "930 Veterans Memorial Pkwy, Boise, ID 83703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9f1f166e-932e-11ea-9f7a-14b31f159f22.png",
  "tags": [
   "family",
   "nature",
   "walking",
   "kids",
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3244429974405030294",
  "source": "GoogleMaps",
  "reviews": [
   "Veterans Memorial Park is a lovely park that has something for the whole family! I photographed an engagement session there this Fall and the nature you can find was perfect. There are walking paths around the park which you can follow back into a more secluded area of the park. There were surrounding trees, plants, and a creek, all of which were fun to see while walking around. Everything was clean and there were multiple places to just sit and enjoy the view!",
   "Huge park. I love the mix of manicured lawns and natural environment. The playground is great for the kids. The trail to the greenbelt is finally open and I love it!",
   "Have always loved this place. Beautiful photo opportunities",
   "My husband and I had our wedding reception here. Very clean park and we all had a great time. My kids and I come often to just wonder around and enjoy how beautiful it is.",
   "There are some excellent pieces of equipment for children to play on, conveniently close to the restrooms, so no long walk to get kids to from the play area to the potty."
  ]
 },
 {
  "name": "Bogus Basin Recreation Area",
  "address": "2600 N Bogus Basin Rd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/9fd0995a-932e-11ea-a71e-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=8605497701605160866",
  "source": "GoogleMaps",
  "reviews": [
   "We had a blast participating in summer activities here! There is something for literally everyone in the family. We took a group of six and some of the adults went hiking in the trails. The kids loved all the activities offered, but the highlight was the mountain coaster (and even the adults loved it!). Other activities included gem mining, rock climbing, tubing, and the trampoline. It’s a windy haul to get up there, but definitely worth it!",
   "Bogus Basin is a ski resort residing near Boise, Idaho and has a good variety of tracks for all snow-based recreational activities such as skiing and snowboarding. There's tracks ranging from easy beginner tracks to harder professional tracks and makes very clear which is which through an easily decipherable color/shape system. There are also areas for more casual sports such as tubing. In conclusion Bogus Basin is an amazing ski resort for anyone looking to have some fun this winter.",
   "It was great snow this season. Even when it was raining it’s always easy to for get about the daily things in life and just be able to relax in the mountains with your friends. This 2018-2019 season has been great and I’m sad to see it’s over",
   "We always have a blast at Bogus Basin.  Depending on the snow year, the skiing is exceptional.  There are a good variety of ski runs with various difficulty levels.  Coach slope is great for beginners and cheap skiing.  Night ski slopes are well lit and fun.  All of this within a half hour from Boise.  Don't forget to get up there for mountain biking in the summer which is equally amazing!",
   "I love this place. I know people knock it because the road is sketchy at times and it can get crowded. Bring the appropriate vehicle or take the shuttle, and avoid midday on the weekends and you'll be fine.  The Bogus basin staff is always helpful and courteous. They run two of their own snow plows to keep the road clear. They have added many enhancements the last couple of years. It's a pretty great place that's only 16 miles from downtown Boise."
  ]
 },
 {
  "name": "The Peregrine Fund's World Center For Birds of Prey",
  "address": "5668 W Flying Hawk Ln, Boise, ID 83709, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a024d524-932e-11ea-b6b0-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1541505463872647187",
  "source": "GoogleMaps",
  "reviews": [
   "Such a cool place to see magnificent birds! They do showings with the owls so you can see them up close and personal! Not too crowded, and all the staff members were very friendly and welcoming.",
   "This place is amazing! You have to visit it at least once if you are in the area. The number of different birds of pray is incredible. And there are times that you can get up close with many of the birds with the staff.",
   "Just coffee shop is superb! All of the different coffees I've tried have been wonderful! They must have a great vendor for their pastries because two different times I've tried cinnamon rolls and each time I really enjoyed them. They are always pretty quick and very friendly and nice.",
   "Wow! This was Avery be impressive place! If you have ever wanted to have a falcon graze the top of your head (literally) while it blasts past at high speeds, THIS IS YOUR PLACE!  It was so cool being so up close and personal with those birds. Plus their conservation efforts are absolutely amazing, considering we only have several falcon species alive still because of this organization. I will definitely go back some day on another trip to Boise.",
   "Amazing, though you cannot touch birds (for good reasons). They have ones that can't be returned to the wild in a cabin sized \"living space\" (nothing like a cage) with plenty of room for each individual, with fake grass perches, water rocks and wood.\nI saw 1 harpy eagle, some owl s"
  ]
 },
 {
  "name": "Idaho Museum of Mining and Geology",
  "address": "2455 Old Penitentiary Road next to Old Penitentiary Entrance, Boise, ID 83712, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a06e8a46-932e-11ea-89d1-14b31f159f22.png",
  "tags": [
   "learn",
   "history",
   "knowledgeable",
   "history",
   "knowledgeable",
   "historic",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13807348910309348241",
  "source": "GoogleMaps",
  "reviews": [
   "If you love rocks.... Great place to see Idaho rocks and geology maps. Rare specimens on display! Relatively small museum, information concentrated on gems often found in Idaho mountains, gem mining in Idaho history, and Idaho’s geological history. Look for Idaho Picture Jasper and Star Garnet— two beautiful gems. Learn where Star Garnet is found in Idaho... find “pictures” in pieces of Picture Jasper.",
   "What a \"Gem\" of a museum! Very good interactive displays. Very knowledgeable staff. If you are interested in Idaho beauty and history, local geology, and our rich history of mining, meteorites, and a member built seismometer, this place is a must see!",
   "Very cool this place is great for people who love learning about rocks and geology. \n\nThey also have meteorites and information about a cool prehistoric shark.\n\nThe volunteers were very nice and helpful",
   "The gift shop is really nice, and although the museum is very small, it has fun exhibits and a beautiful collection of fossils, meteorites, and minerals.  The staff is very friendly and helpful.",
   "This museum is packed into a building on the grounds of the Old Idaho Penitentiary. Don't let the small size fool you. There's a lot to see. From the scientific to the historic, the geology, mineralogy and mining history of Idaho can be found inside. There are maps showing the terrain types. There are samples of many types of rock and mineral. Many exhibits are hands-on. There are things for both adults and kids. The staff are knowledgeable and very friendly. The day we went, there was no entrance fee, but we left a small donation, the museum is that good. There is a small gift shop. Note for wheelchairs and those with a fall risk: due to the age of the building, the floors are not always even. The ramps and lips and steps are marked."
  ]
 },
 {
  "name": "MING Studios",
  "address": "420 S 6th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a0becf36-932e-11ea-b569-14b31f159f22.png",
  "tags": [
   "art",
   "performance",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=13063189730973285240",
  "source": "GoogleMaps",
  "reviews": [
   "An acquaintance invited me to view his showing.  The showing was very good and he is an awesome host !!",
   "Cool, interesting space. They host art, films, etc. but I was attending a phenomenal ballet/modern art performance. Not a terribly large venue, but well-suited for decent crowd, performers, art installation and booze/snacks.  It seems like a good nonprofit. Support art in Boise!!",
   "MING is such wonderful gallery and space. MING contributes a wonderful gift to the collective arts and culture community in Boise by expanding our options with thoughtfully curated shows.",
   "MING brings the highest caliber international artists to Boise and immerses them in the community for a significant period of time. Much more in store as MING expands its offerings: look for pop ups, weekly events, curated meals and frequent gatherings of Boise's creative community. ",
   "A great gallery space showing international artwork and hosting performances and events. Worth checking out!"
  ]
 },
 {
  "name": "Boise Whitewater Park",
  "address": "3400 W Pleasanton Ave, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a109e0ec-932e-11ea-af93-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=6549273732195198789",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful area. Looking forward to coming back to Boise in July and spend more time here",
   "Sweet Park in a great location.",
   "Very pretty location, fun to watch the kayakers play in the water",
   "The Whitewater Park has restored natural raparian systems along the Boise River and, at the same time, provided an extraordinary recreational amenity for the enjoyment of Treasure Valley residents as well as visitors from afar.",
   "Chillin by the river and a stationary wave who knew!! Great spot to hang by the river!!"
  ]
 },
 {
  "name": "Eagle Island State Park",
  "address": "165 Eagle Island Pkwy, Eagle, ID 83616, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a168fd22-932e-11ea-b565-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walk",
   "kids",
   "family",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=3159080225973719530",
  "source": "GoogleMaps",
  "reviews": [
   "Tubing is fun for all ages! I would definitely recommend it! It's so much fun to do the big group chains. It's also super clean and a cool place to walk around as well. There's a small park behind the tubing area that's actually really decent.",
   "This place is great to take the family short drive and located in town!  The tubing staff is over the top nice which is hard to find these days. The booking process is great insured low wait time and not over crowding. Looking forward to try the other activities there this summer. My hope is this park stays as natural as it currently is. Shows the beautiful Idaho landscape",
   "Tons of fun!! Great for first-time kids that might be a little nervous but still fun for those who like excitement! Great family event I even alone. I live that you don't have to walk up the hill as they have an escalator type way to get up to the top. \nDefinitely recommend",
   "Great disc golf course! Watch for walkers and be respectful always! Walkers please don't stand near metal baskets with chains! People will likely be by soon to throw hard peices of plastic directly where your are standing.",
   "We have enjoyed a number of diverse activities at this park. A quiet picnic meal, large organized sponsored picnics as well as festivals, zip-lining and snow-tubing. The staff does a great hob keeping the place clean and available for all"
  ]
 },
 {
  "name": "Storey Park",
  "address": "205 E Franklin Rd, Meridian, ID 83642, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a1c18de2-932e-11ea-ba1d-14b31f159f22.png",
  "tags": [
   "parks",
   "family",
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8024047195309169309",
  "source": "GoogleMaps",
  "reviews": [
   "What a nice park. I love that so much effort is being taken to construct these parks and make them inviting to come too. My thanks to you",
   "Good music, family fun and fireworks.  Jad a great time as always.",
   "It's a really great park, has a party area, decent jungle gym, it has swings and one of them is and adult and kid combo swing I've never seen one before. There is meridian pool and meridian speedway right next door as well.",
   "Love how this park is very well taken care of. My mother-in-law and I stop here with lunch when we're in town doing business. And the only time my little girl eats all her lunch just so she can play here. LOVE IT HERE!",
   "Fun little area for the kids, multiple slides and plenty of swings. It gets a little bit windy there, so dress a little warmly"
  ]
 },
 {
  "name": "Cassia Park",
  "address": "4600 W Camas St, Boise, ID 83705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a21cb8e8-932e-11ea-848d-14b31f159f22.png",
  "tags": [
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6640651279235066406",
  "source": "GoogleMaps",
  "reviews": [
   "This park has a very nice sidewalk to walk around in the summer. In the winter the sidewalks are dicey and I wish at times the park department would go around and check to see if they can de-ice the walk ways.",
   "Cassia Park is a great place to walk your dog on leash. It has a beautiful, new tennis court and a fun playground for all ages. People in the neighborhood are really friendly.",
   "I went to the park to watch a frisbee football game. We had a very good time. I think this is a good place to go for a good time.",
   "Great little park tucked into a quiet neighborhood. Loads of room for any activity. Only downside would be numerous people have their dogs of leash, and lots of people don't clean up after their dogs. Watch your step!!",
   "Great public park. Easy access for anybody who lives in \"the bench\" neighborhood. Clean tons of open space and awesome tennis courts."
  ]
 },
 {
  "name": "The Military Reserve",
  "address": "750 Mountain Cove Rd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a2786f1a-932e-11ea-84d2-14b31f159f22.png",
  "tags": [
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=5499003718755931652",
  "source": "GoogleMaps",
  "reviews": [
   "There needs to be more trash cans along the trails because the only one I found was deep in to the dog park area. Otherwise GREAT for all adventure lovers. Dogs are off leash so be cautious of course but how could you not want to roam with the animals?!",
   "Very nice, me (and my dog) had fun for hours. The new bike park was very fun with features for those of all skill levels.",
   "This is a great place for a ride or a hike.  Owels roost is a great trail if you are looking for something that's nice and scenic.",
   "Great trails! Easy access to nature.",
   "The Military Reserve is a little gem just outside downtown Boise. It is a great place for hiking and biking. Trails are marked well and we'll maintained. Some trails are dog off leash and others require dog on leash, so make sure to read the signs. During the early summer it may be a bit buggy, especially if there has been a lot of rain, but later in the summer it isn't bad."
  ]
 },
 {
  "name": "Rhodes Skate Park",
  "address": "1555 W Front St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a2d42540-932e-11ea-a875-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=3371751245935629221",
  "source": "GoogleMaps",
  "reviews": [
   "My 15yr old Nephew loves riding his scooter here. He can spend 5 or more hours and never gets board. We visit from California every summer and he makes friends and has never had trouble with the other skaters or scooter riders. I have spend many hours watching him and didn't see any reason to let him stay there alone. I liked the park, clean and lots of stuff 2 do tricks on.",
   "Attended an x games event. Great event. Parking was available for free. Free children's entertainment provided. Vendors were available at event and free water. Truly a place for the community. Thank you",
   "Had a great time.  My boys had fun with the big guys and they were all very helpful and supportive of my little guys.",
   "Best Park around! Lots of cool events, and a great community area in the center of downtown.",
   "Road to xgames just passed thru here not to long ago with some amazing competition."
  ]
 },
 {
  "name": "Lucky Peak State Park",
  "address": "9725 ID-21, Boise, ID 83716, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a323a65e-932e-11ea-8524-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=15086334726673718741",
  "source": "GoogleMaps",
  "reviews": [
   "This lake used to be big enough for Boise and the surrounding area, but it's getting too crowded, unfortunately.  Still extremely beautiful scenery and tons of places to hike and explore, but if you're trying to ski on an average day in the summer, you'll have to go WAY out away from the park areas to get a little piece of your own lake.",
   "Awesome place for a picnic, you can reserve large covered tables with grill or use one under one of the many trees. Handicap bathrooms are available. It's a $5 carload self fee.",
   "A pretty park on the edge of Boise. Big viewing feature seems to be a hydroelectric plant with a dam and cormorants in residence. \n\nThere is also a pond for bathing, restrooms and a trail for bikes and hiking that runs along the river. It's pretty but did not offer the hiking we were looking for. \n\nA state park there is a $5 entry fee.  The guard hit was not manned that day so it was on the honor system. Bring a pen!",
   "Nice park except the dog friendly part is downstream the main swim park so turn in to this one first with a dog.",
   "Great little close to Boise getaway. Also close to the reservoir, and Discovery Park, boating, fishing, trails and a short drive from Hilltop and the marina. Disc golf course and picnic spots."
  ]
 },
 {
  "name": "Ivywild Park",
  "address": "416 W Ivywild St, Boise, ID 83706, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3843e92-932e-11ea-b2f3-14b31f159f22.png",
  "tags": [
   "active",
   "family",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=10880971418073527425",
  "source": "GoogleMaps",
  "reviews": [
   "Reasonable prices, way better than the big water park. Great place for a family day. Great parking. \n\n3 slides, swimming test required, one that 2 people can go at once. \n\nActive lifeguard lessons, even saved a kid who couldn’t swim well while we were there! \n\nFood options available at a very affordable price! \n\nNot many tables, but a lot of grass and shade with the trees. \n\nLocker rooms with bathrooms and showers, men and women separated.",
   "This is a wonderful park to take your children too and there is a water park during the hotter seasons. There are large fields for a verity of sport games. In addition to this there are a few tennis courts and several paths around the park. The best part is the entire area is clean, no trash, no animal poop, no graffiti, etc.. For those that play Pokémon go there are a couple of gyms at this location and a few poke stops.",
   "Very clean and fun park! Tons to do and lots of space! Dog friendly!",
   "Not great, but overall I liked it. They seem a bit stuck up about a few things and the price could be better for what it is. A pool and a slide.",
   "Great swimming area for all ages. Concessions and entry fees are very reasonable. Great place for families on hot days. More tables and chairs would be nice but large grass areas to easily accommodate max capacity. Bring blanket or chairs for seating, if you need shade bring umbrellas because shade is very limited."
  ]
 },
 {
  "name": "Boise Rose Garden",
  "address": "670 Julia Davis Dr, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a3ed3b88-932e-11ea-b65a-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3292294636904883794",
  "source": "GoogleMaps",
  "reviews": [
   "A must stop for quintessential Boise touring. Mid summer is best.",
   "One of my favorite places in Boise. It’s calm and peaceful. Filled with vibrant beautiful colors and the sweetest aroma. The fountains are an added bonus. I brought my mom here when she visited Boise and she loved it just as much as I did. A Boise must see",
   "Better every time I go",
   "Beautiful rose garden located close to downtown. Lot of activities during summer. Liked everything except pathways, which are covered with gooses defection especially in the fall season.",
   "Beautiful flowers, and overall nice setting.  Near several museums and other interesting places in the city.  One note, watch where you step, lots of Canadian Geese around!"
  ]
 },
 {
  "name": "Children’s Museum of Idaho",
  "address": "790 S Progress Ave, Meridian, ID 83642, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a46fdb52-932e-11ea-9c4f-14b31f159f22.png",
  "tags": [
   "family",
   "kids",
   "free",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16180558215013538246",
  "source": "GoogleMaps",
  "reviews": [
   "My almost 4 year old loved this place! If I wasn't pregnant right now I would have signed up for a year membership. If you plan on visiting this children's museum 5+ times a year it is worth getting the membership. At least for a small family. 2 people are included for the membership. I'm sure they have larger options as well.",
   "The grandkids had such a great time! Thanks for entertaining them for 2-3 hours, even though it was raining and we couldn't go to the outdoor area... That was a bit if a disappointment, but we will be back for sure. One suggestion...I think you should allow at lease one adult in for free when you have 2 or more kids you're having to pay for to get in.",
   "Absolutely fantastic place for kids! I have a 2 and 4 year old and they both had a wonderful time. There is a ton of things to play with and it is all educational to boot. Highly recommended. We got a year pass so we can go all we want.",
   "We ended up getting a membership here and come almost once a week.  Our son (3.5) loves it. There is lots to do and see. They change things up a bit so there are new things.  It was a great place to host the 3 year birthday party also.",
   "Wow, what a great place to take the kids! Extremely interactive with a very local feel. Each area and theme is sponsored by one or more Treasure Valley businesses. Displays are always changing too. This is definitely a place I would recommend getting a season pass! You won’t regret it!"
  ]
 },
 {
  "name": "Roaring Springs Water Park",
  "address": "400 W Overland Rd, Meridian, ID 83642, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a50d088a-932e-11ea-9078-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family",
   "food",
   "cheap",
   "kids",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8152653125388609522",
  "source": "GoogleMaps",
  "reviews": [
   "This place was awesome and perfect for littler kids and adults! Something for everyone and we will definitely be back!!!! The lazy river was great and long. 3 ft always so great for our daughter to float and stand any time. The wave pools got crowded but that's normal anywhere. The lines weren't that bad for slides considering it's the middle of summer. Very happy with our visit and the employees were all extremely friendly and very helpful!",
   "So much fun and such a variety of activities for all ages and thrill levels. The Avalanche was the scariest and you can pretty much take the lazy river to the different entrances to all other attractions! And splurging on a cabana, you feel like royalty!",
   "Really enjoy this place with the family,  fun, friendly staff. Pools to play with the kids and slides for adults. Yummy snacks or you can get a stamp at the door and go to the many restaurants nearby. A must place to visit in summer time.",
   "For water park options in the treasure valley this is the place to be. It can be crowded but given it's the only major watermark around it deserves 4 stars in my book. Hopefully they are able to expand the park east where there had been an empty dirt lot for years. The food options are not healthy and the prices can be steep.",
   "Pretty wide open. Get here earlier to save better free seats. Food not cheap but also not astronomical. Kids area wasn't too bad."
  ]
 },
 {
  "name": "Fort Boise Park",
  "address": "155 E Garrison Rd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a561e106-932e-11ea-8857-14b31f159f22.png",
  "tags": [
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4338728827323340433",
  "source": "GoogleMaps",
  "reviews": [
   "There's an awesome new bike park in the back behind the baseball fields. So many settings and courses for various ages and they also provide air, tools for repair, good bathrooms and water",
   "The bike park is awesome.  This is creating a while generation of outdoor enthusiasts.",
   "Love going here the options are endless with everything around for outdoor recreation.",
   "Great family fun lots of pokestops if your family pays it's a nice place to get the family out walking :)",
   "We were at the new bike park on the back side of the park.  If you love biking you got to check this out."
  ]
 },
 {
  "name": "Spencer Air",
  "address": "7239 Cascade Dr, Boise, ID 83704, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a5f04ffe-932e-11ea-8dd2-14b31f159f22.png",
  "tags": [
   "art",
   "knowledgeable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7176763395313341121",
  "source": "GoogleMaps",
  "reviews": [
   "Spencer Air...The Most experienced Veteran pilots in Northwest United States! Scott Spencer is the originator of the best hot-air balloon events in NW. Scott has fun and adventure down to  perfection. Laurie, Scott’s bride, has flown alongside Scott nationwide touring with their major sponsors through the years. Scott creates gorgeous airships and designs delightful special shaped balloons that are state of the art quality and that are handled with care. Safety comes first- the aircrafts are all FAA certified and ready to fly. the crew that works for  Spencer Air have been precisely trained  and make your involvement in your special day flow beautiful and easy. In 42 years of my association with ballooning there has never been anything but a great memory to come from joining Spencer Air for the most exciting morning of your life!! Book your ride with the best!",
   "The most rudest customer service ever! When I called them wondering how things work there, they were very rude and hung up on me. Never planning on going there ever.",
   "You will not find any better adventure on this planet! Scott and Laurie are two of the nicest, knowledgeable, and funny people to be around. They took time to explain almost every aspect of how the balloon works, how they \"drive\" it, and what it takes to pilot one. I instantly felt I was a part of their ballooning family. I would recommend them to anyone looking for a fun adventure. A true world class experience. ",
   "",
   ""
  ]
 },
 {
  "name": "Telaya Wine Co.",
  "address": "240 E 32nd St, Garden City, ID 83714, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a647c054-932e-11ea-9e6a-14b31f159f22.png",
  "tags": [
   "drink",
   "kids",
   "walk",
   "winery",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=9024007157170410150",
  "source": "GoogleMaps",
  "reviews": [
   "I'll be honest with you, I'm not a wine guy, but I love literally everything about this place. (1) Even for a guy who doesn't love wine, their stuff is outstanding. (2) The people who run it are OUTSTANDING. They're a couple of scientists who moved to Idaho after giving up really successful careers to do what they love and give their kids a childhood that included following your pipe dreams and working with your hands. What's not to love about that? (3) Arguably most importantly, having a drink on the back patio in the last lazy hours of a summer day, with the background babble of the river and chatter of people who know how good they have it at that moment, surrounded by good friends and drinking vino even a wine-sceptic can love, there is no better more comfortable environment in Boise. Hats off to the folks at Telaya.",
   "Having been coming here about as long as Telaya has been open here it's absolutely the best place alone the greenbelt for wine and great conversation. The staff has always been the best.",
   "What a wonderful place that made our day on a beautiful fall weekend walk.\nThe welcoming fire and heaters on the cozy yet spacious patio were an irresistible magnet drawing us in for an equally warm welcome by some of the nicest people ever. Loved the wines, hospitality, and the ambiance. A must stop and linger place for those seeking great wine and great service.",
   "Great Wines and friendly people. This winery is so good. The location is amazing as well as their wines. Carrie and Earl, the winemakers, know what they are doing. This winery is located by a few other wineries so it makes a fun wine tasting day.",
   "As if procured from the legendary Icelandic mjólkurvatn springs themselves, this was undoubtedly the best aquatic experience of my trip, and it's only my first day!  Smooth entry to a bold finish that tickled the sinuses, the Telaya wine was a treat, but the water was dessert. 12/10 would hydrate."
  ]
 },
 {
  "name": "Manitou Park",
  "address": "2001 S Manitou Ave, Boise, ID 83706, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a6982bc0-932e-11ea-ac2c-14b31f159f22.png",
  "tags": [
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13188579202419824157",
  "source": "GoogleMaps",
  "reviews": [
   "It's a nice place to play with your dog on a very nice day and the hours of off leash apply.",
   "The park is fully fenced for your dog to run around.   Problem is there is NO water except for what others brought in, and no pop bags or receptacles to put it in unless you go outside the gates area.  The rest of the park is nice where you can walk around it and there were people fishing in the pond.",
   "The people are always well mannered with their dogs. The hours for off leash are a bit too wonky for the winter but overall one of our favorites!",
   "Love this place! They always book a lot of entertainment here for both children and adults and more amazingly ITS FREE! This will always be one of my favorite recreational spots",
   "it's not a off leash dog park..."
  ]
 },
 {
  "name": "Cinder Wines",
  "address": "107 E 44th St, Garden City, ID 83714, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a6f410a8-932e-11ea-ae85-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "delicious",
   "drink",
   "winery",
   "winery",
   "tour",
   "hospitable",
   "tasting",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13607773909395139186",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing wines, terrific customer care. Fun events and Food truck Friday’s where you can dine while enjoying the best wine around! \nLove this place!!",
   "The staff is knowledgeable beyond something akin to a downtown Boise wine spot, has character and is one of the finest ambiances in Boise. Take a night to truly enjoy a hidden Garden City gem.",
   "Delicious traditional wine. GREAT STAFF. A lil bit expensive on bottle prices. But overall a great place to visit. Don't forget to buy a growler on the way out the door so you can come back and drink some of their wines that are on tap. Unfortunately if you have a growler from another Winery they won't fill it because it's not one of theirs.",
   "Took my friends to this winery and the staff were the BEST! Very hospitable and learned so much about wine from this place and they were nice enough to give us a tour of the place. Can’t wait to go back for another session of wine tasting here. The place looks great with chill vibes. We will be back soon! Thank you!",
   "Very relaxing place to wine taste. Open area can fit quite a bit people inside while not feeling close to each other. Wines are also really good. Not a red wine fan but tried a few here and ended up tasting quite good. The sweet wine is also really good."
  ]
 },
 {
  "name": "Sunset Park",
  "address": "2625 N 32nd St, Boise, ID 83703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a76ecbd8-932e-11ea-9b16-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9061484033961225278",
  "source": "GoogleMaps",
  "reviews": [
   "The park is nice but the numbers and letters that are in a concrete circle needs fixed. One of my kids feel on a broken letter and got a bloody knee. Hopefully it will get fixed soon.",
   "Has a decent field tennis courts ,basketball court , play ground, restrooms, and plenty of parking",
   "Great place for the whole family. Get out and enjoy your day..",
   "Great park with lots of mature shade trees, equipment for children, open spaces, tennis courts, and bathrooms, situated in a quiet neighborhood.",
   "We love Sunset Park.  Great play areas for kids and TONS of room!!!"
  ]
 },
 {
  "name": "Phillippi Park",
  "address": "2299 S Phillippi St, Boise, ID 83705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a8179b98-932e-11ea-bc2d-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "parks",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5773039039683531338",
  "source": "GoogleMaps",
  "reviews": [
   "👍👍👍👍👍\nThis little gem of a park has paved walking loops for walking laps and a nice little play area that's appropriate for kids 6-12.\n\n👍👍👍👍👍\nIt's clean and has a nice covered area with tables.",
   "One of Boise's great neighborhood parks. Big with lots of open space.",
   "Great park! Basketball, tennis, volleyball, big playground, covered picnic area. Lots of open grass. I love this park!",
   "A really nice park and the greenbelt is beautiful",
   "This is a great park for little and big kids. It is easy to keep an eye on your kids wherever they are playing. There is also a long path/loop that is perfect for a walk or kids to ride their bikes and scooters. Big sheltered area that's great for events. Best of all, this park is never packed, so it feels quiet and safe."
  ]
 },
 {
  "name": "Catalpa Park",
  "address": "4516 W Catalpa Dr, Boise, ID 83703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a893d2dc-932e-11ea-ad57-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "parks",
   "art",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4899202808499157002",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park to walk the pups.",
   "One of my favorite parks in Boise.  Great playground for kids. Shade for parents. Tennis courts. Sand volleyball.  Open grassy area for whatever. ",
   "There is paved parking, a restroom, Horseshoe pits, a public art installation and a great big toy. The big toy was missing a connective tunnel between two pieces of the toy, it's blocked off by plywood and that makes the flow of play a tad awkward. There is a sweet stand alone firetruck and swings.",
   "Nice neighborhood park.  Our daughter like to play on the equipment",
   "Fun park great playground. Walking path, and tho havent tried guess you can fish the pond their."
  ]
 },
 {
  "name": "Boise Art Museum",
  "address": "670 Julia Davis Dr, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a90bc3fa-932e-11ea-a9db-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "art",
   "walk",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=7195344784222626104",
  "source": "GoogleMaps",
  "reviews": [
   "Very cute museum and a good way to pass the time. The art is more modern so if you're not into that kinda thing you might not like it. There seems to be a lot of activities for younger children.",
   "Amazing workers and beautiful art. However, calling themselves \"wheelchair accessible\" feels like a massive joke. Their ramps are so steep my chair almost tipped over every single time I went up.They had a seperate ramp to reach each exhibit. It seemed silly, because 90% of the gallery was flat, or flat enough- minus one-three single small steps. There's no reason to block off accessibility. Such a small fix. There was a lot of ramps and a lot of \"legally passing\" wheelchair accessibility, but zero *real* accessibility. I'm amazing I didn't tip backwards and crack my head open. I truthfully hope this gets fixed.",
   "Beautiful art. Not exactly my cup of tea but I still enjoyed my visit.",
   "This museum is in an area that includes other attractions, the river, a park, and you can walk from here to some of the downtown restaurants and stores. But the museum itself is very nice. We had to pay less than $10 for two of us and it was a bargain. There was a temporary exhibit of contemporary art and galleries for several other art areas. Local artists as well as nationally known. The staff was exceptionally friendly and helpful. This is not a large museum, but it is very efficient and easy to follow through to the various exhibits.",
   "I especially enjoyed the high school art and the donut exhibit."
  ]
 },
 {
  "name": "Morris Hill Park",
  "address": "10 N Roosevelt St, Boise, ID 83706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a978dfcc-932e-11ea-986f-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=16963773736544229753",
  "source": "GoogleMaps",
  "reviews": [
   "It was nice that the park manager brings in a lot of water and stores it in a small cooler for the dogs in the off season. The park during the winter is a bit messy but the big dogs love it. A covered patio is nice to sit under for cover from the elements. A separate area for the small dogs is useful so they don't get trampled by the big dogs.",
   "close to home and not crowded. Always lots of tennis balls for your dog to fetch.Bring your own water, until the dog watering fountain is turned on in mid April",
   "Lots of great dog owners here and lots of friendly pooches my dog loves this park",
   "Great place for the kiddos. The age group is 2 to 5 years.",
   "Beautiful park! My dog loves to play at the dog park too! They have separate areas for big dogs and little dogs, as well as agility props and fun things to sniff. People have left old tennis balls for the dogs to play with. The only thing I would like to see changed is to have the drinking fountain in the dog park repaired."
  ]
 },
 {
  "name": "Heroes Park",
  "address": "3064 W Malta Dr, Meridian, ID 83646, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/a9e9f312-932e-11ea-9d2a-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=13913102282933729897",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park with lots of parking and covered patio.   Lacrosse tournament held there & plenty of grass area.   Dog friendly & close to stores!",
   "Best park in Caldwell! Love watching our daughter play soccer there!",
   "Velvet grass soccer fields. Very well maintained relative to the intense abuse it takes. Decent play structures and clean restrooms. Has one large covered picnic area. Smooth running/walking trail around the perimeter.",
   "Great park! A nice playground for kids, basketball court, and a track if you are looking to get some cadtio in. Plenty of space if you are looking to take the family out for a birthday or picnic.",
   "Nice park with large grassy areas, two separate playgrounds structures, swings, a ramada, and plenty of benches."
  ]
 },
 {
  "name": "James Castle House",
  "address": "5015 Eugene St, Boise, ID 83703, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aa59a6c2-932e-11ea-8640-14b31f159f22.png",
  "tags": [
   "art",
   "history",
   "learn",
   "unique",
   "historic",
   "art",
   "art",
   "unique",
   "art"
  ],
  "link": "https://maps.google.com/?cid=11350543782351109073",
  "source": "GoogleMaps",
  "reviews": [
   "They had an amazing virtual reality experience there, great curators that explain the history and art, great art.",
   "This house of American artist James Castle is such an amazing gem for Boise! With its ongoing art and artifact exhibitions, a boutique gift shop, and artists living on site, it’s such a unique way to learn about Castle and his artwork. Don’t miss the historic shed where Castle lives and worked for many years!",
   "Fantastic! What a wonderful display of James Castle's art and experience.",
   "Such  a unique story.  Such a unique life",
   "I have visited the house several times and each time is memorable, delightful and fresh. All of the merchandise is impeccably selected. All of the staff is genuine and enthusiastic. My daughter has taken an art class here and enjoyed it very much. I bring all of my friends from out of town. Visit. Over and over. It's always a new experience."
  ]
 },
 {
  "name": "Redwood Park",
  "address": "2675 N Shamrock Ave, Boise, ID 83713, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aad0addc-932e-11ea-915c-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12716793390235616195",
  "source": "GoogleMaps",
  "reviews": [
   "It was great! We went during open leash time, lots of very well-behaved pups and their humans who were all very welcoming. Lots of open space for the dogs to fetch or just run, playground set for the kiddos, and a small pond that the geese and ducks like to relax in.",
   "This is a wonderful public park right in the heart of West Valley. There's a nice paved loop that follows the perimeter of the park, as well as a children's playground. There's this big duck pond in the back corner where there are as many as 50-100 ducks and geese. There's usually enough parking and there's a portapotty in case nature calls while you're in nature. Really nice park, I definitely recommend stopping by here if you're in the area.",
   "The park is nice and open and the pond allows for some up close interaction with the local ducks and geese. The only downfall is that we visited the location with hopes to feed some of the animals but found a no feeding policy in place. With respects to this policy we did some walking around the park and spent some time watching the ducks and geese.",
   "Nice playground, big grass area, pond with ducks, family oriented and good for dogs too",
   "Excellent dog park. Everyone is really nice. Lots of space. Very fun for the dogs."
  ]
 },
 {
  "name": "Tully Park",
  "address": "2500 N Linder Rd, Meridian, ID 83646, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ab65bdde-932e-11ea-972b-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "organized",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8877367809808287045",
  "source": "GoogleMaps",
  "reviews": [
   "Skateboarding, shelters, exercising stations, playground, basketball court, restrooms and open play areas. Great family park. If you like pokemon, it has gyms and stops. Bud Porter pathway runs along the side of the park.",
   "Tully Park is an excellently organized family play place. The parking lot is adequate for even the busiest multi-sport Saturday. At one side is a large covered area with tables, a well designed children's play area, an exercise warm up area and clean restrooms all of which are ADA accessible. Nearby are a basketball court, a well designed multilevel  skateboard area and sufficient playing fields to support simultaneous baseball, football, soccer and lacrosse games. A great place for the entire family.",
   "Great park, very clean and nice. The work out equipment is awesome for busy mom's to utilize while kids play, and many more special things A MUST SEE to enjoy!!",
   "this park is amazing.  go here. do it. lots to explore. great for kids and the elderly. take time out of your day. do it. go to the park.",
   "Nice quiet park with a lot of stuff to do. People are friendly and greet with the smile"
  ]
 },
 {
  "name": "Dona Larsen Park",
  "address": "150 South Broadway, Boise, ID 83712, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/abd571a8-932e-11ea-874a-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17383318263582023778",
  "source": "GoogleMaps",
  "reviews": [
   "A very nice facility, but I have one complaint. I wasn't allowed to take in my soda so I drank it first and then entered. I wasn't allowed to take the empty bottle in so I asked if there was a recycling. I was told there wasn't and I could just throw it away. So, I asked if I could keep the empty bottle to take home and recycle. Again, I was told no, to just throw it away. I thought Boise's recycling program makes it fairly easy to recycle. Come on Dona Larsen I'm trying to do my part to take care of our Earth. Why aren't you?",
   "Should figure out parking for a University track facility.",
   "Very nice stadium once you conquer the lack of parking.",
   "Nice facility. Could use a LOT more parking.",
   "Super grateful for this stadium for our kids.....plan for a walk from the parking lot. Or pay $5 to park close at the local businesses. But DON'T park in the facility's lot during a HS football game...they will tow you away! :D"
  ]
 },
 {
  "name": "Warhawk Air Museum",
  "address": "201 Municipal Dr, Nampa, ID 83687, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ac37dce8-932e-11ea-bf26-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "history",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2373126541790244321",
  "source": "GoogleMaps",
  "reviews": [
   "I came and spent a couple hours here. Lots of information and several beautiful airplanes and a few classic cars.  I really enjoyed talking with Jack which was one of their volunteers. I look forward to coming back!",
   "The history in this museum  is astounding.  You could spend a day here and still not see everything.   A great place for kids as they have a scavenger hunt.  Everyone  could learn a little something  (or a lot) from this museum.",
   "What an amazing place!  Honoring our veterans who have fought for our freedom, they have done an amazing job!  The staff are informative, helpful, friendly.  You won't be disappointed!",
   "Best museum in Nampa, canyon county and maybe the entire treasure valley.  Take your kids, your siblings, your parents or grandparents.  You will get a great education in military aviation and other aspects of the armed services of the United States of America.  They have great special events. They have an army of volunteers, many who are Vets and are willing to make your visit special.",
   "Great Air Museum! Different! A lot of GREAT history you don't generally see elsewhere. Give yourself PLENTY OF TIME there. It's a real education."
  ]
 },
 {
  "name": "Fuller Park",
  "address": "3761 W Park Creek Dr, Meridian, ID 83642, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/acb553cc-932e-11ea-a9b2-14b31f159f22.png",
  "tags": [
   "food",
   "parks",
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1686895302179660791",
  "source": "GoogleMaps",
  "reviews": [
   "We reserved shelter 3 for my son's graduation picnic. Fuller Park is a hidden gem that isn't very well known. The mature trees off we plenty of shade, and the park is well maintained. The shelter had large picnic tables, a BBQ grill and electrical outlets. Our party of 20 had ample space to spread out and serve food. The sand volleyball pit next to the shelter was used by another group and they appeared to be having a great time! This is one of the best parks in Meridian.",
   "Amazing lil'park with a really nice pond! Good place to get some walking in for the day:)",
   "This a place where you can really get a taste of Idaho living. Upgraded playground equipment, spacious grassy areas, picnic shelters, trees that make your kids think of redwoods, a few baseball fields, volleyball, and a pond to fish in !",
   "Clean restrooms and shaded pavilion right next to four amazing play structures! Every mom's dream. One of the structures is even two stories. It wasn't too busy on a weekday and it's away from major roads.",
   "So many fun things to do here! Walking path, duck pond (don't feed the ducks), exercise area, volleyball pit, baseball fields, and a big playground with all age levels included. Plenty of parking, bathrooms, and a snow cone shack in the summer."
  ]
 },
 {
  "name": "Renaissance Park",
  "address": "4155 S Genoard Ave, Meridian, ID 83642, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ad23312c-932e-11ea-9961-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15202050596238220025",
  "source": "GoogleMaps",
  "reviews": [
   "This is in the Tuscany subdivision, where I live.  Nice place to walk and use the playground equipment.",
   "Good place for kids. Permanent restrooms and water fountain. Nice place to have practice.",
   "A great hidden gem in meridian! Not the biggest park, but has a covered patio area, a basketball court, and playground equipment. Plus enough grass to run around and play in and host events.",
   "Nice place for kids, families. So many things to do. Always clean and feels safe!",
   "It has swings, kids play equipment, bathrooms, a covered picnic area and large grassy area. Can get busy in the fall evenings with soccer and flag football practoce"
  ]
 },
 {
  "name": "Barbacoa Grill",
  "address": "276 West Bobwhite Ct, Boise, ID 83706, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ad9102ae-932e-11ea-a298-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "unique",
   "art",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15911501087611253018",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing fine dining. Dined on an evening weeknight and the place was packed. I Avoided the wait for a table by dining at the bar.\n  Served NY Strip rare on hot granite block. The longer you keep it in the block the more cooked it becomes to your desired like. Brilliant.\nGreat food and atmosphere along with friendly and efficient employees made for a pleasing dining experience.",
   "One of the best meals I've had out in Boise.  Service is very good and quick.  The food is fantastic.  Had the Hot Rock Fillet and it was the best steak I've ever had.  I highly recommend this place.  Added bonus: 2 for 1 drinks during happy hour which is 4-6.",
   "This has to be one of the best happy hours in town (Buy One Get One mixed drink menu). While the atmosphere is a little loud, the drinks are expertly crafted. I have sunken into the rut (I never intend to leave) of Old Fashions. They use quality ingredients and (I believe) a rye whiskey. This is the secret to good Old Fashions for the discerning: rye whiskey. Pair off this with guacamole and you have yourself a date!",
   "One of my favorite local restaurants. Truly one of the gems of Boise Idaho. Incredible atmosphere. Wild and unique art. Top notch food. My personal favorite is the hot rock fillet. The cognac cream sauce is just to die for. They have a great private dining space for large groups or business gatherings. Highly recommend. ( Side note: They do a buffet for Thanksgiving dinner that is out of this world.)",
   "What a unique experience. I don't think I've ever seen a place with more unique decor. Very eclectic. And really terrific food as well. Very original presentations. And you have to try the guacamole"
  ]
 },
 {
  "name": "Fork",
  "address": "199 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/adf49aac-932e-11ea-a498-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=167824401678895040",
  "source": "GoogleMaps",
  "reviews": [
   "The food was delicious!  Our server was polite and was very efficient.  We had so much fun.  Each of our dishes came out exactly how we wanted.  I highly recommend the Glazed Brussel Sprouts and the Asparagus Fries.",
   "Excellent food and nice atmosphere. Staff was friendly and took great care of us. Had the tacos for an appetizer and they were amazing! Had a Cuban sandwich as my boyfriend got a burger, both very good. Had to save room for dessert and got the bread pudding and it was one of the best desserts I’ve ever had! Warm bread pudding with ice cream... delicious!",
   "Went downtown for coffee and dessert.  The coffee was the best!!!\nWe had the huckleberry ice cream and the caramel swirl ice cream. The 3rd dessert was enough for 3: a large brownie, 2 or 3 scoops of vanilla ice cream, topped with whipped cream.  The restaurant is in an old building that has been elegantly renovated. The restaurant was busy on Saturday night, but we were seated promptly.  Would definitely return when visiting Boise, ID again!",
   "Absolutely great place. Love each dish. The flavors are real good. This is the best in Boise, Idaho area. We loved how family friendly it was. We have children and they gave coloring pages as well as activity sticks to mend. Our favorite is wine braised beef with mashed potatoes- the best dish and incredible flavor. Awesome place to celebrate a life event. Thank you Fork!",
   "Dining experiences like this are few and far between. We had tempered our expectations due to a local barista telling us that Fork \"wasn't as good as it claims to be\". You walk in to wood and brick tones coupled with decor that immediately gives you the impression that you'll be paying $40 per person, then you open the menu and are pleasantly surprised to find very reasonable prices with the most costly brunch plate being just under $14. I had the Chef's Benny, an amazing take on Eggs Benedict. The poached eggs were perfect spheres and the yolk spilled out in perfect creamy splendor. My best friend gave me a piece of his bacon and I immediately ordered a side of it. Candied cayenne bacon is now the only way I'm going to make bacon. Then there was our server, Erica. Aside from having an amazing smile, she was friendly and just the right amount of attentive to not be overbearing but make sure we weren't neglected. Overall, this five-star experience actually makes me disappointed that I don't live in Boise so I can come back and try everything else on the menu over time. Thank you Erica and Fork for the phenomenal brunch!"
  ]
 },
 {
  "name": "ALAVITA",
  "address": "807 W Idaho St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ae6229de-932e-11ea-8944-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "foodie",
   "free",
   "unique",
   "free",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12114900618636728498",
  "source": "GoogleMaps",
  "reviews": [
   "This place is literally the best place in Boise. The combinations of flavors and quality of food amazes me Everytime. I usually get the entrees rather than the pasta here and I have been impressed each time. My significant other usually gets the pasta and he has given just as much praise. The service here is also so caring and welcoming, it makes me just want to hang out there longer. The drinks are quite delicious too. If your a foodie and love great service, defiantly go here. They show a lot of creativity, care, and quality in their food, service, and atmosphere.",
   "The mussels were outstanding. The gluten free pasta in my seafood dish was not cooked well; however it was loaded with seafood, which made up for it. Nice atmosphere and good service. I would go back.",
   "Consistently great service and food. There are plenty of gluten free options if needed. The portions are normal sized. Wonderful flavors; you want to savor these bites! The decor and ambiance are also unique and attractive. Nice that you can see the whole team of employees working together well.",
   "Fantastic service and excellent food plus a suave, romantic ambiance. Entire staff was very friendly and attentive, clearing plates and filling water quickly, checking to make sure we didn't need anything else.  Food was outstanding, from the winter citrus & arancini appetizers to the fresh-made pasta.  Cocktails also excellent, especially the smoked cocktail that comes in an inverted glass filled with smoke from a scorched piece of wood.",
   "Tonight was an amazing first experience at ALAVITA with my hubby!! The staff was very professional, informative about their menu, and super friendly!! You can taste the passion that goes into their food and the flavors just sing in your mouth!! We will definitely be coming back for sure!!"
  ]
 },
 {
  "name": "Chandlers",
  "address": "981 W Grove St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/aec1af36-932e-11ea-9bf4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8268492485617846802",
  "source": "GoogleMaps",
  "reviews": [
   "The Rona has done nothing to impact the quality of food or service from Chandlers!  Attention to detail is still a priority!!  High quality containers, bread & all the butters, bags packed so the dinners arrive intact & beautifully presented!  PLUS, timing is perfect!   Cold food was still cold, hot food was still hot.  Of course, every morsel was delicious!  Congratulation to everyone for you ability to overcome obstacles & delivery what everyone expects!  The best dining experience in Boise!",
   "What's great here? The music and the service. The food is a bit hit or miss, which can be disappointing as prices are high. Wine list is impressive but hard to actually use. Cocktails are good. List of wines by the glass is only okay. \n\nI like to support live music. I appreciate that they have live bands here.",
   "Fabulous...everything was perfect! From the host to everyone we encountered. Food was made to perfection and the drinks were the best I've ordered from a restaurant. \nAbsolutely recommended",
   "It's beautiful and the music enjoyable. The service was outstanding and the Wagyu/Angus steak was the best steak I've had in my entire life, worth the money, cooked perfectly. Our servers were Wesley and Clayton and they were on top of all our needs all evening, informative, kind, cheerful, and professional. Our server in the lounge before dinner was a lovely young lady with a lot of energy and interest and when they were out of the wine I chose, she returned with an informative second choice suggestion for me. Everything about Chandler's is classy and high quality and delivers an unforgettable experience. Thank you, Chandler's for making our little celebration special!",
   "I don't think a review on this place is necessary but I'll do it anyway. We sat at the bar early ,place packs fast do make reservations or be there at 4. Service was impecable and food was great. Typical great American steak house. No fancy stuff. Great steaks, great crab, great wine and scotch , great service. A must"
  ]
 },
 {
  "name": "Bardenay Restaurant & Distillery - Boise",
  "address": "610 W Grove St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/af279d48-932e-11ea-a297-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "kids",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1315928491459888787",
  "source": "GoogleMaps",
  "reviews": [
   "Local distillery featuring house gin, vodka, and rum - special lemon vodka and ginger rum. (And featuring their own whisky soon!) A menu with bartenders craft cocktails changes monthly. We just ordered the Sage Advice and it’s amazing - well balanced and smooth. There’s 24 bottles of wine on tap. The menu has exceptional variety and we’ll return for dinner the next time we’re here.",
   "Great atmosphere to get drinks after work, weekends, etc. Food is excellent, fresh ingredients and cooked to perfection. Cheese board appetizer is the best! The pairings are spot on and intrigue your mouth. Not very accommodating for business lunch (tables are tiny).  Friendly and knowledgeable staff, Brei was so nice!",
   "Attentive friendly staff. I love their Bruschetta. Their kids meals are full meals. But it's more of a bar setting so having kiddos there feels a little awkward. Other than that it food was tasty and drinks are good.",
   "Bardenay is one of our favorite downtown dining experiences. We like coming down for a drink and food when we can. Happy hour is great, just make sure to get here before 6PM. They have great vegan/vegetarian options. I highly recommend the sweet potato chimichanga. Parking can be tricky at times, it might be best to park in the parking garage above the Egyptian Theater.",
   "My favorite place to go. Thai Fighter and good bacon wrapped filet or grilled shrimp salad. Amazing staff!!!"
  ]
 },
 {
  "name": "Bittercreek Alehouse",
  "address": "246 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/af7a132e-932e-11ea-bf04-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=9185357599149373856",
  "source": "GoogleMaps",
  "reviews": [
   "The quality of the food here is amazing! I’ve never had a sub par meal here. It is a  packed house most of the time and there is a really good reason for that.",
   "Great place for a quick bite or a full meal. Tons of beer choices. Bottles or on tap. Great wings. The salads were fresh and full of ingredients.  The chips and queso were a nice surprise as well. The mac and cheese appetizer was a good sized portion and very cheesy and hot, my son loved it.",
   "The beer is good and the server was friendly. The pretzel is the best I've ever had. However, we waited over 40 minutes for the main courses and didn't see our server again for 20 minutes after he dropped the food. He didn't even check back with us to see how everything came out. Overall, food was great but not sure it was worth the wait.",
   "Good food. Great location. Nothing better than sitting on 8th street and eating a high quality burger with a cold beverage. Atmosphere of the restaurant is amazing too",
   "This place smelled delicious as we walked in for dinner. Super friendly service! We had Randezvous Red wine, poutine, salad and a burger. Delicious meal!!!!"
  ]
 },
 {
  "name": "Luciano's Italian Restaurant",
  "address": "11 N Orchard St, Boise, ID 83706, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b00367c0-932e-11ea-aa04-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "knowledgeable",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1618160200480493129",
  "source": "GoogleMaps",
  "reviews": [
   "We have eaten here several times and the food is always wonderful.   Our server was friendly and made excellent suggestions.   I had the special which was amazing.   Shrimp, chicken and sausage in a spicy cream sauce over four cheese ravioli,  I would recommend it but be aware it is a bit spicy.   We were with a fairly large group and everyone had a fantastic time.  Though it is not cheap it is worth it!!!",
   "Finally had the chance to go here for my birthday back in February. This place lives up to their reputation! Food was phenomenal,  service was 5 star! Wish I could remember my servers name bc she was great. Hope to come back soon and try some other dishes!",
   "Luciano's in easily one of the best Italian restaurants in Boise. Everything I have had here is good and the service is excellent. The only thing that drives me crazy is the wait time to get your food. These guys are slow! But their food is really good and the price is decent as well. They also have really good bread for you to snack on during the eternity it takes to get your food.",
   "This place is very very friendly for couples having a romantic atmosphere and being very very friendly for couples over 21. They have a wine bar in the waiting area, so while the wait may be long you can still enjoy yourself during the wait.  The chef specials are always delicious, which isn't a surprise as I've never been disappointed with any meals I've ever had here. There are some items on the menu that may be 1.5-2x as expensive as another Italian restaurant but with the food being 3x as good it is well WELL worth it. If you've never been somewhere like this before no worries the staff will be able to give you a laundry list of fantastic recommendations.  There is not one item on the menu that will disappoint and that is something yo uh can bet on. Given the price point the and the atmosphere I would not so much recommend this as a place to take children but not many places in the area can compete as a venue to celebrate an anniversary or other momentous occasion.  It's not a big chain, which for fine dining is very important as it ensures quality is consistent every single time you visit.",
   "Call ahead, or make reservations. We ended up waiting an hour to be seated, but it was worth it! The atmosphere is cozy and charming. It's a popular place, but on the smaller side, so there is usually a wait if you walk in. The staff was friendly and knowledgeable.  Our waitress was Cassandra, and she was amazing. Our glasses were always full, she was friendly and accommodating, and she was a rather good salesperson. I usually don't get appetizers or dessert, but she convinced us to get both. The food was delicious and even though it was packed, they brought the food out in a timely manner. I can understand why they have many awards for Boise's best Italian. Picture perfect dining experience. We're definitely going back!"
  ]
 },
 {
  "name": "Eureka!",
  "address": "800 W Idaho St Suite 120, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b0546e0a-932e-11ea-be17-14b31f159f22.png",
  "tags": [
   "creative",
   "drink",
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15391061922038237017",
  "source": "GoogleMaps",
  "reviews": [
   "Eureka! is one of the more consistent spots for service and food on 8th street in downtown Boise! They have a very creative seasonal drink menu and the food is seriously legit! They have a wide variety of menu items and everything that I have tried has been delicious. I totally recommend these guys, especially for happy hour!",
   "Generally pretty busy in the evening. Like all other restaurants in the area, parking is a task of it's own. Loved the burger and drinks selection.",
   "Friendly and fast service.  The food was fantastic and they had lots of options.  I was very impressed by their beer menu, with an awesome selection of beers from some of the best craft brewers all over the country.  Will definitely be coming back the next time I am in town.  Prices were reasonable as well.",
   "First time at Eureka. Excellent service by Kate. I tried the Lollipop Corndogs, and the Truffle Cheese Fries - both were well-prepared and tasted delicious. My wife thought the Hemp Bowl was absolutely wonderful - both because of the great taste and the emotional joy from eating healthy. Definitely try this place out.",
   "Eureka is one of my favorite places to go downtown. The appetizers are really unique and I haven't had one that I didn't like yet. The deviled eggs with horseradish are to die for and the firecracker sauce on the hot wings is out of this world. When you bring children they bring their food out first to make sure they aren't waiting too long. I have had a little trouble when ordering drinks that they seem to sit at the bar and the waitstaff forgets to bring it to your table for a long time so it just sits there - on more than one occasion,  however their drinks are to die for and are ALWAYS worth the wait. I have tried about half of the items on the menu and all of the appetizers and have only had one thing I didn't care for. The hemp bowl is my favorite entree, and my husband loves the jalapeno egg burger. It is worth going to try their food just because of all the different options they have that are exciting and so different than other restaurants.  Eureka is really something special."
  ]
 },
 {
  "name": "The Basque Market",
  "address": "608 W Grove St #5926, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b0bfc134-932e-11ea-b84d-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "learn",
   "delicious",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3928090228303726776",
  "source": "GoogleMaps",
  "reviews": [
   "Very Satisfying experience from the minute I walked in, to the last moment trying to force the final morsel down my throat.  Very attentive and knowledgeable server!  Not knowing the culture or the type of foods to order, the waiter was a plus as he knew exactly what we should order and what we would find enjoyable. The experience was great.  \n\nAppetizers we had the Olive dip, the cheese dip and then this really good bacon sweet paradise dip that they made especially for that day, I think it contained goat cheese. Oh my goodness with the baguette it was wonderful.  For the main course. Braised pork loin you can see the picture it was topped with a great balsamic vinegar and it was delicious.  Bread was freshly baked.\n\nYou are missing out if you do not pop in here. I highly recommend this place.  Price is super reasonable",
   "The Basque Market is a great place to learn about the rich Basque culture of this area. We tried some Basque cuisine; the cheese croquettes were great! Back in 2009, The Basque Market held a function for our convention where they use a gigantic paella pan and cooked for hundreds of people! Apparently they do this at least once a week during the warmer seasons. This last time I was at the market I bought a Basque cookbook. I can't wait to try some recipes.",
   "Great place. Must visit. The meatballs were out of this world. Get two serves, trust me. The paella pockets were not great - a bit oily and claggy, but still tasty. The wine selection is very f good with a lot of interesting Basque and Spanish wines.",
   "Highly recommend this place. Coming to the basque market before flying out Boise, thus, we didn’t know what to expect. Walked passed by this place to take a gamble and glad we did it as the food is delicious, and very reasonably priced too!",
   "This is a must stop on any visit to Boise. I usually come for the fresh made paella, currently served Wednesday and Friday at noon. You can watch it be prepared right outside the market. I would recommend coming at least a half hour in advance. Try their wine slushy sangria, topped with red wine, beware of brain freeze. If you come the last weekend in July there is a Basque festival. Live music, food and drinks. The market is small inside but there is seating outside."
  ]
 },
 {
  "name": "Goodwood Barbecue Company",
  "address": "7849 W Spectrum St, Boise, ID 83709, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b132a7c0-932e-11ea-b587-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "cheap",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6555479250851148805",
  "source": "GoogleMaps",
  "reviews": [
   "I have never been to this place, but wow is it just the best place to eat. It has a nice semi romantic atmosphere and the service is fast and very respectful. The food was well worth the price and the proportion size beats any other place to date for the value. I would recommend it to anyone",
   "I usually order the Prime Rib, but they were out, so this steak had to fit the bill.  It was cooked to perfection (medium), and the loaded baked potato was absolutely wonderful.  I prefer Goodwood to Texas Roadhouse.  One of the best if not the best steaks in Boise!",
   "I always mean to try something new, but after I tried the brisket salad, I've never changed to something else. Absolutely delicious!  They used to have a small or large portion, now it's just one size and seems to be just about right. Great service!",
   "Beef ribs and loaded mashed potatoes!! The food is always excellent and the prices aren't too high. It isn't a cheap place to eat but it is worth the money. They have some pretty great chicken fried steak too.",
   "Service was excellent and food was delicious. Restaurant was clean and the aromas of barbecue were intoxicating. The food was hot which is a big deal for me since alot of place serve lukewarm dishes. Our server was Jake and he took good care of us. Refilled our drinks before we even had to ask and brought our food out in a good amount of time. We will definitely visit again when here in Idaho."
  ]
 },
 {
  "name": "CasaBlanca Cuban Grill",
  "address": "5506 W Overland Rd, Boise, ID 83705, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b183272c-932e-11ea-ae20-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5208083479406934457",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome authentic Cuban food! I love this place, great for birthdays or for groups. We go there as often as we can. I can't always understand what I am ordering (Spanish dishes) and yet I have never been disappointed.",
   "I really wanted to like this place.  The Chirizo Croquettes were a pleasant start, but the pork dish was dry, even with the sautéed onions to help out.\nService was friendly, and maybe I just picked an off day.",
   "If you've driven past this place for years, curious but never stopping by like I did, stop! The meat was hot and tender and flavorful, the atmosphere was cozy, and the service friendly. I was really pleasantly surprised when I tried some new tastes I've never tried before, like the black bean soup and coconut flan. Very yummy!",
   "We stopped at the restaurant after leaving the Boise Airport. The staff was friendly and efficient.  We enjoyed our lunches as they were tasty and reminded us of our trip to Cuba.",
   "Casa Blanca is my favorite restaurant! My friends and I go their about once a month. The severs remember us! The food and the atmosphere are fantastic!"
  ]
 },
 {
  "name": "Willowcreek Grill",
  "address": "2273 S Vista Ave #150, Boise, ID 83705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b1def012-932e-11ea-acde-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6330531479774562031",
  "source": "GoogleMaps",
  "reviews": [
   "If I could give them more stars I totally would!! Willowcreek is awesome! Their regular menu is tasty and feels home cooked! Their sushi is the best in town! I have never ever had bad service here! Such wonderful people and awesome food! I highly recommend!",
   "Ample parking. Really good burger. Good service. Surprisingly fresh playlist of 80s pop and dance hits. Based on what I tasted,  I wouldn't come here for the sushi. But the waitress made me a really good grenadine and coke. Altogether 3 thumbs up.",
   "My girl likes sushi and I don't so much. Found this place on google and loved it! Great non sea food options and my girlfriend loved the sushi. They have an awards card too. Friendly staff and and environment. Great music playing at an appropriate volume as well. Excellent place for when some in your party want sushi and others might not.",
   "Great lunch option in Boise. You can offer American fare, or try something off the Raw sushi menu. Business-casual atmosphere.",
   "Received a lovely letter from the manager after a negative experience we had at Willowcreek Grill, and I was very impressed.  It was obvious that she listened to and responded to my concerns and was going to address them with her staff.  I am very understanding of the fact that our experience was probably not the typical.  Thank you to management for taking the extra and personal time to address my concerns.  We will certainly be back."
  ]
 },
 {
  "name": "Capitol Cellars",
  "address": "110 S 5th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b24222fe-932e-11ea-bf17-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "tasting",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12474703175639867099",
  "source": "GoogleMaps",
  "reviews": [
   "Here is a hidden gem in Boise. A political themed menu in the basement of a downtown building. Great staff and excellent food.  I was quite pleased with my entire dining experience.  I will go back and looking forward to bringing friends for a lively debate over some delicious Idaho based food",
   "The food is mediocre. $24 for a sea bass, some bland rice and 8 green beans. My waitress was ok. I order a soup and salad for me, I said I will have a soup and salad, and she took off and didn't take my wife's appetizer order. When she came back I had to say that was just for me, my wife needs to order. She left and brought out our salad and didn't ask what we had wanted to order for our main course. When she brought our soup that's when I said can we order our main course.  The soup, French onion, was very watered down. I've had some very nice French onion soup and this was not very good at all. We won't be going back",
   "The food was really good! We sampled food from all areas of the menu and it was all delicious! Service was very helpful and friendly. Great birthday dinner! We'll be back 😊",
   "Valentine's Day/Retirement special occasion dinner....Sat down right @ 5:00 reservation time. Seeing later tables being served, had to ask for a server @ 5:15 to get cocktails which were good. Got red balloon glasses for a chard. Server poured away, no tasting that $100 bottle. I ordered lamb chops, got the pork. Food presentation poor and food very salty. Second bad experience here, we're out.",
   "Such a nice place! Very delicious food, good service. Good for fancy romantic dates, has that nice atmosphere. 😊"
  ]
 },
 {
  "name": "Tucanos Brazilian Grill",
  "address": "1388 S Entertainment Ave, Boise, ID 83709, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b2a83808-932e-11ea-bed3-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16804601506302600197",
  "source": "GoogleMaps",
  "reviews": [
   "If you’ve never experienced Tucanos before, it’s time. I’ve been to eat at a Tucanos dozens of times and I don’t even live within 3 hours of one. The food is great. The service is great. Atmosphere is fun. It’s all you can eat for a flat price. It’s worth the trip.",
   "We were brought here by a company we do business with and I have to say the entire experience was amazing. Start off w the salad bar and let the servers bring you all sorts of meats. Simply delicious. Great service. Recipe for success.",
   "By far the better option between the different Brazilian grills in the Treasure Valley. Excellent variety on the salad bar including soups, pasta, and salads all of it very fresh! As for the meat selection, it is solid in variety and excellent in flavor! They do not have any lamb options which some may be disappointed to hear. Only reason for a star being knocked off is the last few times I've been in I've noticed that the size of the meat, fish, and vegatable served to me by each server is quite small which would be fine but the frequency at which the servers come by your table has also dropped...not enough that I won't be going back, yet.",
   "Angela was helpful on our first time there. She was very cautious and sweet and checking on us regularly. I super loved the energy from Levi the meat guy he was sweet and bubbly and looked as though he enjoyed his job. The manger of the store came by and checked on us. Super happy place.  Fully recommend also all there food was made fresh.  There variety of things to eat were incredible seriously all type of things",
   "It had been about 2 years since my wife and I had been to Tucanos. We decided to go on New Years Eve. When we checked in at the  front counter for our reservation, they informed me that the dinner pruce was $31.95 that night, not the regular $24.95. We were seated right away. And throughout the meal the service was very good. \n\nThe food was less than average though. Salad bar was nothing special at all - but the Lobster Bisque was pretty good. The wide variety of meat delivered on skewers was for the most part dry and kinda tasteless, some samples tough and chewy.  The meal that night did come with a piece of cheesecake which was OK. And, a nice touch, there were party favors on the tables to help celebrate the New Year. \n\nThis was not the way I remember the food. I loved the food before, not now."
  ]
 },
 {
  "name": "Cucina Di Paolo",
  "address": "1504 S Vista Ave, Boise, ID 83705, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b3032968-932e-11ea-bc62-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4192575544516933804",
  "source": "GoogleMaps",
  "reviews": [
   "Republic Services bought all the front line employees a lasagna from here. I would have never found this place if not for that and oh, man was I missing out. Fresh ingredients, amazing sauces. Easy at home heating instructions. Pick one up and take it home! They have a new customer for life!",
   "LOVE the food and service! Saw their story online and the reviews raving about their delicious creations. That brought our family when visiting Boise for a short period of time. \n\nDefinitely give their pasta dishes, sandwiches, salads, and homemade desserts a try! Such a homey feeling and the hospitality was wonderful.",
   "Fun Italian place to try with friends. I had not been to a similar place before. Very friendly service and good food. Very limited seating but good selection of food. We will definitely try their made to order take out lasagna sometime in the future. You don't want to miss trying this one!",
   "Loved the beef ravioli and the New England clam chowder. Great little restaurant, most welcoming with excellent, personalized service. They have lasagna...and so much more. It'll take many more visits to try everything, and we will.",
   "From the outside you won't be convinced this is the place.  When you walk in,  you're still wondering why your friend has brought you here.   After your first bites, you realize why this is on the go- to places for those looking for good foods in Boise.  Consistently good, crafted with character, and always much better than processed box store food! Soups with fabulous flavor, hearty pasta, perfect salads and sandwiches.  Thank you cucina di Paolo for being that place!"
  ]
 },
 {
  "name": "Txikiteo",
  "address": "175 N 14th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b382ba14-932e-11ea-9f04-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "free",
   "food",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2534187168424178985",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome! The staff are really friendly and helpful. The food is amazing. Bold flavors and unique styles. Highly recommend for date nights or group gatherings.",
   "A place that is open sort of late at the edge of downtown.  Good service and a relaxed vibe. The mixed board was very well priced and you get a lot to try and the other tapas are very reasonably priced. Didn't do drinks this time but it looked interesting.  Free wifi and nice outdoor area. Great addition to the Boise food scene.",
   "Very quaint, but so friendly! The staff did an excellent job of helping decide on wines to start off the meal. Food was well prepared and taste profiles were spot on. Would definitely visit again.",
   "we arrived to Txikiteo late one evening, and were shown AMAZING hospitality. it was so cold outside and there were no open tables inside. One of the waiters there was able to turn on some heaters and gave us blankets while he rearranged some tables inside for us so we could squeeze in. we were outside no more than 5 min, and were seated quickly, where it was warm! Great hospitality and even better drinks and food. totally recommend this spot!",
   "Very hip and inviting environment with counter service. Food was great with several different appetizers and dishes to choose from. Wine and coffee from around the world. Service was great with friendly knowledgeable staff. Well behaved kid friendly environment with a downtown location. Prices very reasonable. I will return anytime I'm in Boise."
  ]
 },
 {
  "name": "Red Feather Lounge",
  "address": "246 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b3da0108-932e-11ea-ad0f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5313745868942549131",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed a great brunch today! First time at Red Feather and glad I finally made a point to try it. Service was friendly and fast and the restaurant has a cozy vibe even though it is two stories and quite roomy. I had eggs Benedict and a waffle both of which were tasty. Lots of great and yummy choices on the menu. My husband had one of the skillet scrambles and our friend had chicken and biscuits which also tasted great.",
   "Delicious food and great craft cocktails. Must make a reservation on weekends for sure or you won’t get a table. Some portion sizes can be a bit small, so order a few things and share. Love this place and will be back!",
   "BEST drinks in Boise. Go sit at the bar, order some drinks, people watch, talk to the bartenders, watch the weird things on the TV, order some food. This place has the best vibe in Boise. Upscale, but not arrogant. The bartenders make a fabulous drink selection of things you've never tried before--which seem  to be changed out seasonally. Each one is perfect, and beautiful, in it's own way. If you want something more intimate, head upstairs. If you're planning on dinner, make a reservation! (Don't forget to try the fries...Seriously! And stay for the dessert.) Plan to pay for the quality, it's worth it. (Shout out to Daniel and Chris--so nice, and made us feel like we belonged.)",
   "Always a lovely experience. I feel classy and special thanks to the waiters and cooks. The quality of food is phenomenal, and I'm always excited to try their new items",
   "Came for brunch, and our reservation was ready on time. I think we either hit an off or busy morning though, because even though we got seated, we weren't served right away, and several times found ourselves waiting for someone to come back and check up and/or take our order.  The food was amazing though, and I highly recommend the cheddar potato side (far superior to the crispy). There were also an impressive number of options for our vegetarian members. However, we ordered bingets, and then didn't get them until after the meal, when we reminded the waiter. But, they were on the house as an apology. Would definitely come back!"
  ]
 },
 {
  "name": "Boise Fry Company",
  "address": "204 N Capitol Blvd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b44a4f1c-932e-11ea-bb64-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "drink",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11967967299041706629",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed the Boise Fry Co. We ordered the Bison burger with the purple fries.  The food was very tasty and the fries were very good. I've never had purple fries and found them  to be really good. The crowd was kind of trendy when were in. It feels like the  type of place students would congregate to grab a bite and discuss assignments. It was quite expensive for what we are. Three burgers, fries, and a drink for three was $55 for three with a tip. We would visit again.",
   "*100+ years from now on a planet far far away*\nHuman in the future 1: \"Is there anything we know about the city Boise from planet earth?\"\nHuman in the future 2: \"yes, Boise fry company and their delicious fries are what we have saved in our records\".\n\nOkay...maybe not. But this is how I imagine it. \n\nI wish I lived in Boise, ID just so I could go here whenever I'm craving burgers and fries. Don't get me wrong, the menu extends beyond that, but the assortment of potato types (gold, russet, red, purple, etc) and cuts (home style, waffle, thin) make fries the bread and butter of this establishment. \n\nDid I mention the variety of dipping sauces? Do I need to? So good! I tried the blueberry aioli with purple fries and was blown away. The trays are designed to comfortably set three sauces onto them, something I appreciated. \n\nI was also a fan of the fountain drink selection. The machines had local lemonade and \"healthier\" soda options.",
   "The overall experience was great, the staff was friendly and helpful when we ordered. We order the red potatoes and beef classic hamburger. The French fries were definitely the highlight of the meal, they have different sauce and salt station that you can try.  The hamburger was below par.",
   "Lots of selection for fries, and they are all delicious too. Lots of sauce choices as well.   Food is fresh.  The burgers were good but not the best I have had, however the restaurant is definitely worth trying!",
   "Really good burgers and even better fries. The staff is friendly and the wait time isn't too long. Would highly recommend."
  ]
 },
 {
  "name": "Big Jud's",
  "address": "1289 S Protest Rd, Boise, ID 83706, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b4c54be6-932e-11ea-8d2d-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3062223277505302815",
  "source": "GoogleMaps",
  "reviews": [
   "Great burger. I knew I couldn't handle the monster burgers, so I ordered a \"simple\" double. It was enormous... and delicious. I can recommend the Scotch and Soda too (think vanilla Sprite). Our table also enjoyed the fish and chips, and the sweet potato waffle fries. Well done, big Jud!",
   "Great nostalgic burger joint. The French fries a very different, giant Idaho potato fries with soft potato centers. Burgers are delicious and made fresh. Dessert ice cream is very good! Nice table service, staff are friendly. Restaurant is very clean and well kept. Price is reasonable. We will definitely be visiting again.",
   "A Boise classic. Quality, mostly locally-sourced diner fare with very upbeat, friendly staff. Home of the famous 1lb cheeseburger (up to 4 lb if you think you can handle it). Both quality AND quantity.",
   "My first time here and I will definitely be a repeat customer.  I had a bacon cheeseburger and it was wonderful. I ordered a to-go meal and it took more than twice as long than what they quoted me to get my food to me. That is the only reason I gave four stars instead of five",
   "Ate here yesterday (9-7-19) and got the $38 burger and fries/tots... super yummy and the service was excellent.  The burger fed 3 people and half went home for leftovers.... restaurant was clean and waitress super nice. Will definitely eat here again If in the area"
  ]
 },
 {
  "name": "Riverside Grill",
  "address": "2900 W Chinden Blvd, Boise, ID 83714, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b53cc62e-932e-11ea-8174-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "tasting",
   "food",
   "affordable",
   "drink",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16701557866932940297",
  "source": "GoogleMaps",
  "reviews": [
   "Service was not very attentive to our table. You have to ask for water to be filled. Food was good and the ambiance was also good. I'll come back.",
   "Nice staff, good music on a Tuesday.  He greeted everyone on his break.  Class act.",
   "31st person to review Riverside Grill, Boise, Idaho, located inside the Riverside Hotel. Open to the public, not just hotel guests. \nThis is my 380th review on Yelp. \n\nI've eaten here twice now. I come here often for work when representing my company on Job Fairs through the Idaho Business League. \n\nBoth times I've eaten here, the food has been ample, very well presented, great quality, and most importantly a great taste. \n\nI had a salad on my first visit and my most recent I got the spaghetti squash spaghetti which was super yummy and very affordable ($7), completely vegan (I'm not). The noodles were perfectly cooked and somewhat fries which gave it the best tasting crunch.",
   "We stopped in for a drink in the lounge at the Riverside Grill before going to the sandbar for dinner. It was a quiet relaxing place to talk and enjoy a drink while waiting for our table and I was grateful for the space. I also enjoyed the live music that was in the background but not too loud.",
   "Nicole was our server and she was awesome! We came for Sunday brunch and had bottomless mimosas. The music was fantastic. Highly recommend! Thanks Nicole"
  ]
 },
 {
  "name": "The Wylder",
  "address": "501 W Broad St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b5c60f9e-932e-11ea-8044-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9099260943574608927",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely fantastic!  Service is exemplary; food is exquisite (make sure you try the mushroom toast- even if you don't like mushrooms! It's to die for!) and atmosphere is fresh and comfortable.  One of my absolute favorites!  Lunch or dinner- YUM!!!",
   "Love the Honey Badger pizza. I picked up one on my way out of town to bring home. Home is Idaho Falls it is that good. Highly recommend it. Great customer service also.",
   "Me and my wife absolutely loved this little place. First off, the atmosphere inside is really comfortable and inviting. It's very clean and the staff is really friendly, the waitress paid a lot of attention to us despite the place being busy. We ordered the Margherita pizza and it was delicious. The crust is thin but not too crunchy and the flavor was just amazing. The drinks we had were also great and we both definitely will be coming back here.",
   "Love this place. clean,  and great service,  love the food.  Me and my husband do our dates here. Really fun place to go. I tell people about this place all the time",
   "Healthy well prepared meals. However, the savory foods did have sweet sauces added, which should knock off 1/2 star."
  ]
 },
 {
  "name": "The Brickyard",
  "address": "601 W Main St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b61f7a52-932e-11ea-8273-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "creative",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14961251569874180053",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing. Please do try any of their steaks and you will thank me. Service was second to none. They offer table side salad and have great selection of wines. If you are thinking about a good place to eat I decided for you.",
   "We dined on a Friday night. The gentleman playing the piano was wonderful and added to our experience. Andrea, our waitress was fantastic and gracious with our questions. The french onion soup, salad with huckleberry vinaigrette, salmon, filet minion, and huckleberry cobbler were all amazing! We will definitely be going back!",
   "I can't say thank you enough for the more than accomodating service and exceptional food we got tonight!  So very thankful I came across this restaurant on our quick overnight in Boise.  We were desperate for a meal, and several other restaurants turned us down, because it was too close to 8pm.  The Brickyard was MORE than happy to help us, and we had outstanding food in record time.  This restaurant definitely knows the secret to survival during these very difficult business times.  I look forward to dining in, someday in the (hopefully near) future.  The grilled cheese salad will definitely stick in my culinary memory bank!!",
   "Was able to go to the Brickyard for Valentines Day 2020 and it was a really wonderful experience. The special, while rather expensive, was a creative and interesting meal that was truly fantastic.\nThe staff was friendly, welcoming, and really added to the overall experience. The live music was the perfect volume and created a ambiance and atmosphere that made the evening very special.",
   "Loved it! The food was so tasty, melt in my mouth flavor. Semi formal atmosphere and dueling pianos! We will be back."
  ]
 },
 {
  "name": "Trillium Restaurant",
  "address": "245 S Capitol Blvd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b68b82da-932e-11ea-9fb7-14b31f159f22.png",
  "tags": [
   "delicious",
   "creative",
   "free",
   "eat",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=2570710717294515118",
  "source": "GoogleMaps",
  "reviews": [
   "Stayed at the hotel for work and had lunch. The Cajun shrimp mac n cheese is delicious. It's creamy and spicy, so be warned. I had 5 pretty good size pieces of shrimp, there are cheese curds in there. I think there were onions and some mushrooms and some other things. You can see the big burnt cheese Texas toast. It was awesome. Recommend!",
   "Trillium ⭐️⭐️⭐️⭐️\nLocated inside the grove hotel in downtown Boise, Trillium is the newest incarnation of the hotel's restaurant. Three friends and I made a dinner out of appetizers on 7/15/19.  I appreciated the creative menu  and look forward to returning to try an entrée.  The service was excellent!  If you eat inside the restaurant and do valet parking, you can park free of charge for three hours.",
   "We stayed at the Grove for our anniversary and chose to return to Trillium because of the brussel sprouts! We've been once before and they are my favorite! The apricot glaze makes them so very good. I've had pizza and it's good. Saturday I ate fish and chips and the portions are big! The bartender made my drink perfectly! We will be back!",
   "Exceeded my expectations. I've been to a few similar (priced) restaurants in Boise and this is one of my favorites. I got an excellent Cobb salad, and I was told the smoked chicken salad was better. The Mac and cheese was pretty good. The sandwiches our friends got we're large and good. The brussel sprouts starter was excellent.",
   "I guess this restaurant deserves four stars, maybe. With a reservation, we awkwardly walked into an empty restaurant at 8:30 on a Thursday night. There was no way I was eating in an empty, cavernous room.  The maitre d' allowed us to grab some menus and sit at the lobby bar. The people at the bar were all there on business, forlornly sitting by themselves. The service behind the bar seemed college young and was pleasant enough, but there was a concrete lack of sophistication.\n\nPortions were huge, fit for a nose guard.  The short ribs and bison meat loaf were both monstrously good, as was the wedge salad.  I was just expecting high end, and a level of class that was not evident in the Grove Hotel.  I could have been in a sports bar in Fort Wayne, Indiana. With my expectations dashed, but my stomach full, we hurried back to the Inn at 500 Central on this bone chilling night."
  ]
 },
 {
  "name": "Wild Root Café",
  "address": "276 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b6fac29e-932e-11ea-bb48-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16980890859913191398",
  "source": "GoogleMaps",
  "reviews": [
   "If you are hankering for a fantastic brunch and have anyone with allergies this place is fantastic.  The Tofu scramble is something to leave you wanting more and with many alternatives to milks and cheeses it is a vegan delight to visit here.  And to Those who are carnivorous the steak and eggs was absolutely adored by my partner.",
   "Loved the taste. Tried items both breakfast and lunch menu. Prices are around $12 average. Always leave feeling full and satisfied.  (Try the stuff you don't think you'll like and surprise yourself)",
   "Clean restaurant and great service. The food presentation is beautiful and tastes just as good. I had the bruschetta and was very happy with it. My husband enjoyed the Roast beef sandwich. We also had the Nourish Bowl, which I felt could have used a little more of the vinaigrette. I also really enjoyed their coffee.",
   "I was in Boise for a conference. This restaurant was  found on a morning stroll. Wonderful breakfast🔥. Migas was absolutely delightful. Staff was was quite nice and the food came out fast. Great location",
   "Great food and options to turn each menu item into vegan! Friendly staff and in a great central downtown location with lots of public parking available."
  ]
 },
 {
  "name": "Richard's",
  "address": "500 S Capitol Blvd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b75b326e-932e-11ea-abbf-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8964303475728096669",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful flavor combinations. The wait staff was very knowledgeable.  Our waiter described every dish in detail. Definitely coming back.",
   "First time at Richard's. Breakfast was very good, the service and ambiance great for a Sunday morning. My new favorite breakfast restaurant in Boise!",
   "My husband and I just had a lovely Valentines Day here tonight! All the food and service was top notch, especially for this affordable price range. There was a desert special that was particularly good! Thank you Richards for an awesome experience. We will be back!",
   "Richard's is a top-notch Italian restaurant in Boise. For several years it was in a different location, and now it is attached to the new Inn at 500 hotel.\n\nWe tried some of their signature entrees, including cannelloni and chicken with forty cloves of garlic. The cannelloni was some of the best I have ever ordered in a restaurant. The garlicky chicken was moist and extremely flavorful! The service was great; our server Shana did an amazing job! \n\nThe ambiance and atmosphere was classy and upbeat with a full house during dinner time.\n\nI plan to definitely go back to Richard's any time I return to the Boise area.",
   "Great atmosphere and food. Had great service and they took exceptional care of us for even the smallest on inconveniences. I was really impressed for my first visit and we will be back. Thank you ❤️."
  ]
 },
 {
  "name": "Cottonwood Grille",
  "address": "913 W River St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b7bbd002-932e-11ea-bf9c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14749472405063822010",
  "source": "GoogleMaps",
  "reviews": [
   "My now fiance proposed to me here on New Years Eve this year and they were just so amazing. The food was delicious but they went above and beyond to help make it special and a secret from me. My sister and brother in law dressed up in ridiculous outfits to get pictures and after we had drinks near the bar. I was truly in awe of everything, the people here were so nice. We are highschool sweethearts and after 11 years this was just the perfect place for him to propose 😭🥰❤",
   "Brought my parents here for their 50th Anniversary. The food was amazing, Sea bass, Steak. Chicken all of it. Loved the French onion soup and the creme brule..\n  The appetizers were good, but the crackers seemed pretty generic. It could have used more meat and cheeses. Besides that it was great.  Loved the atmosphere.",
   "To be fair,  we only ordered dessert.   The staff was attentive and friendly.   The bread pudding was ok.   It seemed a little dry on top.   The bottom was delicious and moist.   The berry cobbler was good but more cobbler crust was desired.",
   "My husband had the elk for dinner. Amazingly good! Very flavorful but not \"gamey\"; tender and juicy. We also ordered the Morel Mushrooms from McCall. The morels were plentiful and tender, however, the brown sauce was too overpowering for my preference. I had the Pappardelle with Pesto and added sauteed shrimp. Absolutely fabulous. It had ribbons of zucchini and arugula which made it less heavy than a full pasta dinner. I had plenty left over. Lovely setting - cool and quiet inside at 5:00 pm.",
   "The restaurant is beautiful and romantic. I love the huge stone fire place! We were there Valentine's weekend and saw a proposal. As for the food, I wasn't impressed. This was our first time there and I did not enjoy my meal. I had the halibut and it was very greasy and I couldn't even finish it. My husband tasted it and said it was awful too. He, on the other hand, had the lamb shank and loved it. I'd be willing to try the restaurant again but I would definitely order something different."
  ]
 },
 {
  "name": "Saint Lawrence Gridiron",
  "address": "705 W Bannock St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b807ab88-932e-11ea-8abb-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "delicious",
   "food",
   "delicious",
   "food",
   "foodie",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16139653203039222044",
  "source": "GoogleMaps",
  "reviews": [
   "We happen to come across this place when looking for a place to eat lunch on our last day in Boise back in February. We had just gotten hipster t-shirts with the image of the state of Idaho, with a long beard coming out of the bottom. This place seemed like the perfect place to go next. The beef brisket sandwich with blue cheese was good. Bob also enjoyed the burger he ordered. They have a good selection of craft beer as well.",
   "We had a slab of ribs, collard greens and cornbread. Really fantastic barbecue here. They had unbelievable smoky flavor and they were cooked to perfection. The top edges were a bit crispy and my friend wasn’t sure about that aspect but I thought it was delicious.",
   "Came in on a Monday for lunch at 12:10pm, wasn’t super crowded (4 tables of two), server was on top of it and we ordered quickly, food was slower (out at 12:40). \nPulled Pork Sandwich was hot and juicy. Almost too wet for the ciabatta bread. The BBQ sauce overpowers the taste of the meat, I would ask for it on the side and apply as needed. It’s delicious and pairs well. Slaw was mild and the crunch the sandwich needed! \nFry sauce has a kick to it! My husband loved it I didn’t, but the fries are good plain. \nOverall a good BBQ restaurant with a constantly changing menu.",
   "Food is delicious and the staff is super friendly! Love the fact that this restaurant was one of the first downtown to offer curbside to-go orders and likely the very first to offer any discount on all to-go orders several days before the Mayor of Boise shut down dine-in option for Boise restaurant. A true gem!",
   "IMO, The best food in Boise.  If you are a foodie, you must try the brisket and the drinks are amazing."
  ]
 },
 {
  "name": "Lucky Fins Seafood Grill | Boise",
  "address": "801 W Main St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b859805c-932e-11ea-9ce7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15536793456804719409",
  "source": "GoogleMaps",
  "reviews": [
   "A great deal on Sundays for sushi rolls.  Buy one get one half off all day!   Nice ambience and the new bartender was very friendly and attentive.  The sushi and service has definitely improved since we first started dining here.  Beers are a bit pricey but that’s just Boise in general these days.  Nice place for a quiet date night.",
   "Looking for seafood or sushi in Boise? This is it. This place is fantastic. I have been here twice, and disappointment is the furthest thing from my mind. My last visit was a date night with my wife, and while there was a wait, it was worth it. This was by far one of the more enjoyable sit down meals I've had in awhile. Service, food, atmosphere was spot on. I will be visiting this business again.",
   "Absolutely incredible food firstly...\nHowever the environment is really what makes the experience amazing.\nI snapped a few photos my last visit the other day just for it's sheer beauty and size!\nIt's big enough to hold a conference in the back!\nThe original looking deck makes it feel like you are on a ship.\nAbsolutely awesome place and one of my favorites!\n10/10 (rare)",
   "Very tasty variety of food to eat! A bit noise near large groups but settled down when food arrived. Nice atmosphere and good staff. Had seared Ahi and Scallops and was very satisfied.",
   "Arrived for our 6:00pm dinner reservation and the hostess tried to seat us in the bar.  I looked in the dining area and there were two. vacant tables. I had to be insistent but got us seated in the dining area after a 20 minute wait. \n\nIf you're looking for a quiet place to eat with your family, this place isn't it. We wont be back because this isn't the first time we've  had issues with this place."
  ]
 },
 {
  "name": "Thinking Tacos?",
  "address": "517 W Main St, Boise, ID 83702, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b8bc0bd4-932e-11ea-af81-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=6719191564478649817",
  "source": "GoogleMaps",
  "reviews": [
   "These are the best tacos you will ever try!! Every time they are at Cactus I always make sure to go! Delicious, cheap, great customer service! What more can you ask for?!",
   "Best authentic Tacos in Boise. Awesome customer service experience, real and humble people. You can't go wrong with any of the choices they have and you must have a quesotaco!!",
   "Since last year I have loved thinking tacos! I got a photo taken with them and gave them great advice on expanding and will forever be a customer and love they have expanded to different locations like going to the Nampa bar and also staying down town. Can’t wait to see where they go in the future. Hopefully everyone will enjoy them just as much as I have and do! Great people!",
   "Sooo good, always satisfied 🙃 definitely will always be my number one 🌮 joint 🤤🤤",
   "If I could 20+ plus stars I would. They make the most authentic tacos in the valley (I’ve tried and tested all the others) they rock and deserve the most credit to be honest!"
  ]
 },
 {
  "name": "Kibrom's Ethiopean & Eritrean Food",
  "address": "3506 W State St, Boise, ID 83703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b909463e-932e-11ea-8a15-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7997841176116883194",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing! The food is wonderful and the staff is always friendly and kind. My two-year-old routinely eats far more of my food than I really want to share - I can't say enough good things about this place!",
   "We shared six dishes, everything was delicious. Service friendly. Inexpensive. Decor minimal. Go for the food.",
   "Great service & food. I loved everything my group ordered & the wine selection wasn't half bad either!",
   "The waiter was very patient with me as it was my first experience with Ethiopean cuisine. He walked me through the menu and taught me the proper way to eat with injera and general Ethiopean etiquette. The food was amazing and left me satisfied but not feeling heavy. If you haven't tried it make it a point to stop by Kibrom's. My only regret is that I visited while travelling and am not close by to visit again.",
   "It was great. It reminded me of my time in Ethiopia. I enjoyed speaking Amharic to our server."
  ]
 },
 {
  "name": "Sakana Japanese Sushi Bar & Grill (S Vista Ave) 925 S Vista Ave Boise, ID 83705",
  "address": "925 S Vista Ave, Boise, ID 83705, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b95f12f4-932e-11ea-89b9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7079905825070729694",
  "source": "GoogleMaps",
  "reviews": [
   "Monday and Tuesday are $1 sushi rolls. There are 12 options to choose from. You get 1 bite sized roll for your dollar so order several of the same type to make your own mini roll. The food was great for a dollar and worth going back for regular price.",
   "Monica is the best!! She always remembers my order, every little detail. She’s always so kind! The food always comes out so speedy! 12/10!",
   "After moving from Seattle this has been my go to spot for good sushi and fun environment. I recommend you do a sake bomb while there.",
   "I enjoyed this place and it was my first time. The Rolls were very decorative and had great flavor. I also got the vegetable udon and was impressed about the amount of vegetables but not three amount of noodles. The broth had little flavor as well until I added soy. The service was a 5 and the food was probably a strong 4.",
   "I enjoy the variety of the menu.  Each time I've eaten there, the food and service have been excellent.  Don't let the outside fool you, the inside is beautiful.  This place is one of the Bench's little upscale secrets."
  ]
 },
 {
  "name": "Owyhee Tavern - Steak and Seafood Restaurant",
  "address": "1109 Main St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/b9ae25a8-932e-11ea-835f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "affordable",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=13775958113217082320",
  "source": "GoogleMaps",
  "reviews": [
   "JERRI girl we are total food connoisseurs. And we have ate at some of the top rated restaurants from the east coast to west. And we never had service like this!! We didn't have to ask for anything. You listened, you offered your opinion, and girl you hit it on the head!! 10* PERFECT service!! We are extremely picky and normally wish we would have stayed home and cooked ourselves. The Tomahawk was so tender, beautifully cooked and seasoned, never had we eaten lobster with such flavor, the crab legs were also perfect,  then you finished us off with that sweet and gooey bread pudding!! Our Valentine dinner (a day late) was better than we could have dreamed!! To the Chef, Miss Jerri and management THANK YOU!!",
   "Went here for a work party and the food lived up to the price. I absolutely loved the tuna steaks! My wife enjoyed their Salmon burger.",
   "Let's just say this place is awesome!  For lunch I had  the club, simply the best.  My girlfriend had the BLT.  No one left hungry, unsatisfied, but we did leave with leftovers!  The servings are generous, not a complaint at all!  They still have the best charcuterie board in Boise, and it's not on the lunch menu but they will make it on request!  Thank you for being awesome!",
   "Great happy hour! \n\nThe halibut is a must! Phenomenal. The plating looks kinda orange but it is the best thing I’ve tried at the Owyhee yet. \n\nLunch menu is very affordable and service is speedy. If you go to dinner during happy hour the service is rather slow. Not sure if they’re understaffed or maybe someone didn’t show, but the servers worked hard.",
   "Great staff. The happy hour is a great time to come and sit and enjoy your friends. Corner location for great people watching opportunities. Calamari was great. Drink special even better."
  ]
 },
 {
  "name": "Bonefish Grill",
  "address": "855 W Broad St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ba0b072e-932e-11ea-b100-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14526046274734833705",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place with delicious food. Great atmosphere and service too. We had Crab cakes- with no red pepper- my favorite! And I ordered the Bang Bang Shrimp and it was so tasty. Rich and filling. Can't wait to return and try other items!",
   "This place was awesome. Great services. Atmosphere was good. Services was great. I went there for breakfast. Food was tasty. Dessert was delicious.",
   "Good for lunch. Warm bread to start. Bang bang shrimp tacos never disappoint! The Asian Chicken salad was also tasty.",
   "Amazing food and great atmosphere! My group (a party of 12) and I made reservations here. They had a table all ready for us and even when some of our party was late they understood we wanted to wait a bit and they got us drinks and amazing bread! Once we all ordered they brought all of the food out at once so that everyone was eating together. They food was amazing and everyone was pleased with their order! I will definitely go here again!",
   "One word AMAZING!! From the ambience to the food.  We had the Lily's Chicken and the Thermidor Gnocchi. Very clean nice music. We will becoming back for sure. Thank you Ace for being a wonderful server and making our first time wonderful."
  ]
 },
 {
  "name": "Elmer's Restaurant (Boise, ID)",
  "address": "1385 S Capitol Blvd, Boise, ID 83706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ba6c136e-932e-11ea-95c2-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8909639679356556541",
  "source": "GoogleMaps",
  "reviews": [
   "This place is great!  A moderate line to be seated always means good things are in store.  Surprised the wait was only a few short moments.  \n\nThe service was second to none and the portions were exceptional!  I tried the German pancake and tossed on a side of Works hash browns.  Get both of these and you will be very happy.",
   "Great menu, had a hard time making a decision. Food was great.  Portions are abundant and service was nothing short of top notch. Kitchen was fast too.  Two thumbs up!",
   "Great family place to have breakfast.  My visit was on Sunday morning.  Had to wait 45 min. to be seated, but food was great.  I had the Belgian waffle with maple syrup.  I bet weekends are their busiest.",
   "Decent food for the price. Pretty much what you would expect for a chain type diner restaurant. Food doesn't taste homemade but tastes good enough. Comfort food breakfast. Servers are very friendly!",
   "Such a great menu and service, very friendly.  I had a large and tasty Cobb salad. My colleagues all had delicious looking food as well.  The chocolate cake was super rich and moist.  Best of all only $4, what a deal.\n\n#travelformortals"
  ]
 },
 {
  "name": "Juniper",
  "address": "211 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bac490ae-932e-11ea-b00a-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18108203959860049841",
  "source": "GoogleMaps",
  "reviews": [
   "March 13, 2020 MY BIRTHDAY DINNER❣I had 8 ladies at juniper for my birthday dinner. The round table upstairs was perfect, our waitress made amazing suggestions for all of us. We had the rosemary fries and brussell sprouts apps, I recommend the HONEY BUNNY COCKTAIL(its magic made from fairies), We had the shrimp and grits, the trout dinner, the chicken risotto, etc.  I LOVE the location and the prices❣ Ill be back to try the MOLLY RINGWALD COCKTAIL❣ Thank you guys for making my birthday dinner amazing❣",
   "Delicious! Yummy drinks, happy hour 2 for 1 wooohooo! \nAshley is a wonderful server! We had a great 1st time :)",
   "We had a great brunch at Juniper! \nThe food was delicious, well prepared with quality ingredients. The fresh squeezed oj and the coffee were hits as well. Good service. Wonderful meal in a warm setting in downtown Boise!",
   "Great place to have a cocktail.  Salad Gold martini is never a letdown!  Love going here.",
   "Good happy hour, they recently changed it and I actually liked their old menu more, which is why the 4 stars instead of 5. Overall I like the atmosphere and selection of food and drink. Looking forward to the next visit"
  ]
 },
 {
  "name": "Ruth's Chris Steak House",
  "address": "800 W Main St #110, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bb31a988-932e-11ea-88ff-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5055876683731406204",
  "source": "GoogleMaps",
  "reviews": [
   "Nobody does a dining experience better than Ruth Chris. Every summer I make this my last stop for my vacation. Expect a dinner experience to run about $70 per person on average. The service is top notch and if you make your reservations online you can tell them if you are coming for a special occasion. They put flowers on the tables for anniversaries, decorate desserts with messages and your waiter will know your names and why you are out on a date. There is a bar area and a section for large groups. I'll be back next year!",
   "This restaurant is a class act! We arrived early, then decided to go on a walkabout. Once we returned, we were seated and catered to until the moment we left! Staff was supreme! Food was excellent! Even the dessert was good, but I did tell our waiter I think I like my peanut butter ice cream pie better! 🤭 To that, I will be taking two pieces down to them, maybe this weekend...it's what I do!\nThanks, Ruth's Chris Steak House ❤️",
   "I've always really liked them but have lost all respect for the Organization. Even though they are returning the money, they never should have received it. I will stick to more deserving places.",
   "A very nice atmosphere, quiet and relaxing, for my first time here. Food was not only delicious, but good sized portions. My steak was a perfect medium rare. The staff were all friendly and prompt, especially our waiter. They made sure my parents enjoyed their anniversary.",
   "Always a nice and fun experience. Tried the blue crab tower app and it's like having sushi! So yummy and refreshing; you literally feel so healthy eating it."
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "200 N 6th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bb81c93a-932e-11ea-bcd2-14b31f159f22.png",
  "tags": [
   "free",
   "eat",
   "food",
   "drink",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5694924960309623412",
  "source": "GoogleMaps",
  "reviews": [
   "The melting pot is a wonderful place for a night out. On the pricier end of Boise dining, it's well worth it for a special night out. Sign up for their fondue club and get coupons for free chocolate dipped strawberries and heads up about special events and dining opportunities. The choices are diverse, you'll definitely fine something you like; or just go for dessert! The staff are fun and engaging and can make suggestions if you gets stuck in all the choices.",
   "Everything was superb from the service of the kind wait staff to the food and the experience. Was the meal I just had worth almost $300 for two people? Not quite. Well the selection of dippable options is almost unending, The quality left something to be desired. For the same price there are steakhouses downtown that I would rather eat at.",
   "Wow, this place is the worst value for the money I have ever experienced. The portions are small, so be prepared to have a burger on the way home. The 30 bucks worth of meat you get arrives as 6 little cubes of 3 kinds of whatever you pick. But if you pick any of the flavored cooking methods, it all tastes the same. They even give you dipping sauces for the meat, which is a clear sign that it's a low cut of meat. It was an experience that I'm glad I don't have to repeat.",
   "We went the day after Valentine's Day, we were so excited to try this place. There were 4 of us so we had a table with two burners. We were not greeted by or sever for about 10 minutes after being seated, she then came by and took our drink order, it took about 15-20 minutes to get our drinks. Once we ordered and they brought the cheese out the server has to make each at the table, the first cheese took forever, then the second pot of cheese wasn't melting, we checked the burner and it wasn't on. She said it was unplugged, which is below the table on the wall by the floor, she had us, the guests, go below the table and plug it back in. The cheese chose took over 30 minutes before we could even eat it due to the slow cooking and slow server,i even offered top help stir the cheese pits for her as she was so slow ans we were tired of having the server stand at or table making small talk. We ordered another drink, the salads came, our drinks were still empty. Finally i found another server and asked for our drinks, the manager came over and apologized for the wait, said she is assigning  us a new server and that this round of drinks would be on them. We appreciated this. The new server was very nice and seemed much better than the first. We had now been there 2.5 hours when he brought out the pots for dinner. The food was great once we got it. It then seemed like we never saw our waiter again. He took our dessert order but by this time we had been there 3 hours and we had to get home to relieve the baby sitter. I asked to speak to the manager as we never saw the server again, he apologized for the wait and i said we just want to close out and get the dessert to go. He got us the dessert tip go and gave us $20 gift cards for our next time in. We will never be back after that. We arrived at 7:15pm and left at 1030pm.",
   "So delicious! It's a great place for a fancy dinner date. Plenty of time to talk."
  ]
 },
 {
  "name": "Certified Kitchen and Bakery",
  "address": "1521 N 13th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bbd874f6-932e-11ea-9ad8-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=418261775123583441",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best coffee/ bakery/ breakfast/ lunches places in town. They have an excellent selection of baked goods as well as great coffee- not always easy to find. In addition, they have breakfast and lunch options. And the location is a great place just to explore and hang out.",
   "There are so many great cafes in Boise now, but this is my first choice every time I’m looking for a coffee, bakes good, or breakfast sandwich - if I’d ordered more, I’m sure those things would also be my new fav 😁 I think I’ve ordered every coffee on the menu and honestly I can’t pick a favorite!",
   "Best breakfast sandwich in town. No contest. The scratch made english muffins are perfect. Buttery, crispy, fluffy and airy all at the same time. I almost didn't write a review because I don't want to have to wait in a long line there.",
   "Had an amazing sandwich here with my grandpa for the first time a few days ago. More importantly they had one of the best slices of apple pie I have ever had!",
   "If you only have breakfast in one place in Boise, make sure it’s here!! While the seating area inside was quite small and tight, the wait and crowds are soooo worth it! \n\nWe got to try several dishes while there and only have one serious regret: not buying. Dozen sourdough English Muffins to take home with us. \n\nTheir special “egg/arugula” muffin was something from a dream!!"
  ]
 },
 {
  "name": "Reef",
  "address": "105 S 6th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bc6ffa6e-932e-11ea-b79b-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food",
   "food",
   "music",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12446263295514123439",
  "source": "GoogleMaps",
  "reviews": [
   "The vibe is great. I actually came here for a live show. It was great. Drinks are good. Great prices. Second time here was with my girlfriends for my bday food was so good. I also had the fish bowl drink and it was big and perfect for my bday.",
   "Food was great.  Had the nachos as an appetizer. They were amazing.  Nice cozy atmosphere. Voodoo fries are described as spicy.  Give them a try. They are super mild.  The steak tacos on the other hand do have a little spice",
   "Best place to see reggae bands in Boise.  Lots of high quality national bands roll through this place including some in the past who now headline Red Rocks (Stick Figure).  The food is great, staff is friendly, and the mojitos are amazing.  Plus a sweet rooftop tiki torch bar.",
   "Super fun atmosphere, amazing food. Forbidden nachos that are to die for! Our server, Nikki, was super attentive and helpful! Love the vibe and the live music! Would definitely recommend checking this place out.",
   "What a fun atmosphere filled with delicious food and drinks. The happy hour there is off the hook. We ordered the mondo pupu platter and were presently surprised at how much food we got.  We will definitely be back!!"
  ]
 },
 {
  "name": "Lock Stock & Barrel",
  "address": "1100 W Jefferson St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bcbce24c-932e-11ea-81a2-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12793378419798922561",
  "source": "GoogleMaps",
  "reviews": [
   "I LOVE this place!!! Incredible service, the food was freaking fantastic, the drinks... are still kinda with me...\nI traveled over 1600 miles to eat here & it was worth every step of the way!! 💜💜",
   "I have diet restrictions as does my mother. We ordered simple pieces of grilled chicken (which I will add that they were tremendous); but to charge $25 dollars for a little piece? Not to mention say that they could’ve fixed the problem AFTER they took my payment. Restaurant was fine and all, but not worth $25 to get a small piece of chicken again...sorry too overpriced guys.",
   "The food was good, the service very good...but...My wife ordered her steak well done.  I know chef's hate to prepare beef this way, but they are not the one who will eat nor pay for it.  Do what the customer requests.  Her steak was closer to what I'd call medium...still slightly red in the center.  Well done means brown throughout...no pink at all.",
   "Perfected classics with depth of flavor. Great salad bar and sourdough rolls too! The sirloin steak was juicy and highly recommended!",
   "This was my first time eating here and I had the 14 oz ribeye and the salad bar. I did like the chicken soup from the salad bar it was very good. The steak was very moist but lacked flavor. I had to put a lot of salt on it to enhance the steak. The lunch price for a 14 oz steak was $28 and dinner prices are a lot more. I felt for the price the flavor should have been a lot better for the steak. Also for the price there was really only one side. I paid $2.50 extra to have the salad bar. Otherwise my steak would have only come with either a salad or fries or soup. I think salad and a potato should be a standard side dish for these with no extra charge. $28 is more than enough to include those sides. A baked potato was an upcharge. I will try this place again and hopefully it's better next time.\n\nUPDATE: I went back and had the prime rib dinner and I really enjoyed it. It was so much better and had great flavor. It seems to be very popular. But they did a great job with the flavor. I will come back to have this meal again."
  ]
 },
 {
  "name": "Andrade's Restaurante Mexicano",
  "address": "4903 W Overland Rd #4903, Boise, ID 83705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd16df00-932e-11ea-97de-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "affordable",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2065617145268649234",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! I have heard that the food here is really good so we decided to have dinner at this restaurant. We were not disappointed. The menu had a wide variety of scrumptious looking foods. It was difficult to narrow down the choices, everything sounded wonderful. Our server was great, she was friendly and accommodating. When the food arrived it looked and tasted fantastic, huge portions too. I find myself thinking about the good food and I plan to get back there soon. You should try it too.",
   "Andrade's ⭐️⭐️⭐️⭐️⭐️\nThis Boise Mexican restaurant near the corner of Overland and Orchard has a far more complex menu than most. Despite a few glitches, KM and I enjoyed our meals so much on 7/21/19 that we may have to re-think our bias re: the best Mexican food is in Canyon County. Andrade's is planning to move to a new location on Overland Rd. that will double their floor space to over 6,300 sq. ft., hopefully in Dec. 2019. Both of our dishes came with seasoned potatoes that were so delicious, we each ordered two additional sides of potatoes to take home with us. The rice was an add-on. The salsa was excellent. Highly Recommended!!!",
   "They happily had my food ready faster than expected. Fast, friendly service at a very affordable price! The food was delicious! I will be going back again 😊",
   "A great Mexican restaurant in the heart of Boise.  I had an enchilada combo that was perfection. 3 different types of enchiladas and a flauta. The chips and salsa was recognizably homemade and delicious.  The desserts were sweet and delicious.  Many choices of beers and wines as well.",
   "This was my first time dining at this restaurant. The atmosphere was very inviting, friendly staff and employees would come check on us regularly to make sure we were ok with the drinks and as well when we got our food. Everything was delicious and the portions were plentiful. I would recommend this place and I will be returning to try some different stuff. The only thing that was a little frustrating was the time it took to get one of our drinks,  for mine was about 10 min and for my friend was a good 15 or so. Really didnt have time to enjoy them before the food came. All in all a very nice restaurant"
  ]
 },
 {
  "name": "BACON",
  "address": "121 N 9th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bd77a2e8-932e-11ea-9bea-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "walk",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17743007547733443463",
  "source": "GoogleMaps",
  "reviews": [
   "Oh man if you love brunch and bacon this place is so good.  I got the BLT with salt and pepper fries, YUM! Also got the bacon sampler, it was definitely worth it.  Got a couple of mixed drinks that were great with brunch.  You really can't go wrong here.  The staff was super nice and helpful.  Can't say enough good things.  Just go eat here!",
   "This was our first visit here, on a Saturday around 10, we came in to try the Bloody Mary. Delicious!!! The mix was perfect, didn't taste overly tomatoey.  The food was excellent, large portions, three of us split our meals. Service was excellent, so you walk in, order in the back, they shout out whenever someone orders a Bloody Mary, you grab your water and silverware and find a table, they do have outdoor seating that is heated, indoor the tables are farm style and super cool. They will bring your food out to you.  Service is fast, prices are responsible for downtown Boise. They have cards on the table with questions and trivia to pass the time. Great crowd as well.  The staff is friendly and always moving. Great place to grab a bite, they do close at 3:00 on Saturday. We enjoyed the bacon sampler. We will be back!",
   "The spicy bacon Bloody Mary is a must here! Everything our table had was fantastic. I don’t know what they put in their gravy but it’s to die for.",
   "Bacon is awesome. This place has great breakfast. I had their special for the day waffles with bacon and eggs, it was delicious. Had the Chai tea too and it was yummy can’t wait to go back. The environment is very relaxing as well.",
   "Food was really good and came out faster than our wait in line. We went on a Saturday for brunch and it was quite bumping. Flavor profiles were fairly balanced for the Bacon Lasagna and Arkansas entrees we had. The Lavender Fizzy Gin (or something akin, I can't fully remember the name) was light but you could still taste the Gin come through. Thoroughly enjoyed!"
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "7997 Franklin Rd, Boise, ID 83709, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bdd392f8-932e-11ea-8df2-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "affordable",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=759109000635860019",
  "source": "GoogleMaps",
  "reviews": [
   "Guys, I know it’s a (fake) quarantine, but tonight’s to go experience was just unacceptable. I was quoted 15 minutes of wait, it ended up being 35 minutes. Okay fine. We ordered our steaks medium rare: one ended up medium well, and the other was beyond well done. I ordered a large Caesar salad, and we got a side Caesar. There were multiple things you were out of. Again some grace is allotted here but overall this is not what I drove 40 minutes one-way to deal with. This was very disappointing and we probably should have just picked up locally instead.",
   "Great food and ambiance!  Service could be a little better.  They never cleared our app plates & had to ask for bread twice.  Drinks were timely and servers are very friendly.  This was during weekend lunch.  I will definitely be back!",
   "My husband and I came here for a date night for the first time last night, and we were extremely impressed! We don't go out for steak often as is so expensive, but they have some delicious affordable options. We got two entrees, some beer, and desert for 50$.\n\nNot to mention we had a great time. Setting wasn't too dark, and it was loud but not loud enough that we weren't able to hear each other. The food was amazing, I didn't even have a single complaint! This was the first time in my life I had a restaurant who cooked the steak PROPERLY, makes all the difference.\n\nI highly recommend this restaurant if you haven't been. Our Waitress as well (Ainsley G.) was very sweet and accommodating. 100% would go here again!!!",
   "This is a great steak house with all the steak house things you might expect. The one thing that makes them stand out is the amount of seasoning on there food. It really jumps out at you in a great way. I would advise you to ask for lightly seasoned French fries if you get them. They can be a bit overpowering. Service has been incredible on both of my visits.",
   "The steak here is delicious the first time I came this place barely had opened the steak was way too salty for my taste and overcooked for what I had ordered. I gave it a while before I gave it another chance or was set in my review and oh my goodness I’m def coming back! The steak was perfect and juicy this time no wonder it’s so hard to get seating. The customer service also was good it could have been better but it was swamped so it’s understandable. All in all def recommend and def coming back!"
  ]
 },
 {
  "name": "Kyoto Japanese Steakhouse",
  "address": "6002 W Fairview Ave, Boise, ID 83704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be27ef8a-932e-11ea-aa6f-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "family",
   "food",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14748242221731517911",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to eat.  A bit on the pricey side for dinner but fun and enjoyable to have your meal cooked in front of you.  Very good chefs who have a sense of humor and keep the table entertained and engaged.  They’ll build an onion volcano for you on your birthday.   Yum yum!",
   "This is an amazing place the cooks are funny and excellent at what that do. Awesome place to take the family. You get what you pay for. Delicious food and wonderful entertainment.",
   "Great food and service. I really like the options of sushi or the table side presentation I am the only one in family who will eat sushi so we can get food here that pleases everybody. I have been with a group as large as 30 and as few as 2 of us. No matter the size of the group service was awesom",
   "By far the best sushi in Boise. Have been coming here for 15+ years, and their service and food quality has not declined at all!",
   "Went here for Valentine's Day and it was perfect! We were put at a table with 2 other couples and everyone was so great. Staff was so funny and friendly. This is one of my top picks in Boise."
  ]
 },
 {
  "name": "Chapala Mexican Restaurant",
  "address": "1201 S Vista Ave, Boise, ID 83705, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/be7cec48-932e-11ea-aab4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "tasting",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4781092501593573286",
  "source": "GoogleMaps",
  "reviews": [
   "Didn’t get to take a picture before I ate my burrito, it was just too darn good!!!! This is hands down one of the best Mexican restaurants I’ve ever been to. The staff made sure our tostadas were warm, and my burrito was delicious and was made to perfection. We received our food FAST and I’ve never received service so fast and so great like here. Highly recommend!!!",
   "We had a great lunch today. Enchaladas, chicken of course, beans, rice and extra chips and salsa with guacamole were delicious. Glad we could have our favorites to go today. Thank you for being open for us!",
   "Excellent restaurant with great tasting Mexican classics! The service was friendly, fast, and accurate. The people that work here are exceptional and really care about your experience. They treated me very well. The food was fresh and tasty! I got the chicken fajitas and I loved it. The menu is very big - if you've got a large group, I'm sure everyone will find something appetizing from all the options. I definitely recommend checking out Chapala if you're in the area and you're craving Mexican food!!",
   "If you love dry, flavorless food covered with cheese, lettuce and tomato to mask the lack of authenticity, then come eat here. The food was sub-par. The chicken was dry and flavorless, it came in a generic hard shell loaded with lettuce cheese and tomato. Always be aware that if you want authentic Mexican food and you see Lettuce, Cheese and tomato, it’s not authentic. The beans were very good and the rice so-so. Price $11.99\n\nMy GF ordered chicken tacos (generic hard shell) and an enchilada. She asked for Mole sauce -add$1. I tried it, it was horrible, tasteless and undercooked and the sauce was out of a can. Cost $12.\n\nTake the time to read the 1 star reviews. I’m not going to bash this place but the food wasn’t good at all. You’re better off with Taco Bell or Del Taco.",
   "Love the service and the food AMAZING... by far my favorite Mexican Restaurant in town.\nThanks Maria and Moises you guys are AWESOME!"
  ]
 },
 {
  "name": "Bar Gernika",
  "address": "202 S Capitol Blvd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bf0102d8-932e-11ea-b97b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "drink",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5662359684270334748",
  "source": "GoogleMaps",
  "reviews": [
   "Very tasty food at reasonable prices. Expect to wait for seating,  but it is worth it! I had the lamb stew - very tasty.  Don't miss the  croquetas. Great draft beer options",
   "Fantastic place! Found this little gem on Diners, Drive-ins & Dives site = so happy! Delicious Basque food - had spicy lamb grinder with homemade croquetas + a fairly local IPA. Attentive prompt service + jam packed by 6pm by locals in the know.",
   "A must see while you are in Boise.  The heart of the Basque block, Bar Gernika has a delicious menu, good tap selection, a fun space and great service.  Everything on the menu is delicious but the apple and cheese plate with some Basque beer is a great way to warm up to the evening or finish it off.",
   "This was good! Chill atmosphere and laid back food. The croquettes were to die for! Sandwiches are large and flavorful. Try the brown spicy sauce!",
   "Quintessential Boise, a must visit at least once but we have been here many times. Always fun, good service, good food, good drink choices. Historic setting in the heart of downtown. Try everything on the menu !"
  ]
 },
 {
  "name": "Diablo & Sons Saloon",
  "address": "246 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bf64f4de-932e-11ea-b79a-14b31f159f22.png",
  "tags": [
   "unique",
   "drink",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18338924529177971141",
  "source": "GoogleMaps",
  "reviews": [
   "Service was slow- feed the meter at least 2 hours for dinner. Great pork chop! Interesting unique decor we ate in the Rabbit room. I will be back to try the tacos my son had!",
   "Stopped in for a drink with a friend, but ended up staying for dinner. The service was excellent, and our waiter went out of his way to make sure what I was ordering could in fact be made vegan before taking my order! \nThe taco menu offers many vegetarian options that can all be made vegan by removing the dairy items. I started with the crispy Brussels sprouts, which came with a caramel sauce. Even with the sauce they were vegan - and so, so good! I did 3 of the vegetarian tacos with no cheese or dairy sauces, and all of them were fantastic! The potato taco was my favorite. Top it off with great drinks and a fun atmosphere, this place is a gem and I will be back!",
   "Great atmosphere! We really enjoyed coming down and hanging out at the bar. The bar service was quick to serve our beverages whenever we wanted something. The food was a little slow coming out but well worth the wait. I'm pretty sure they forgot about my tacos since they didn't come out until after our other dish was gone. The staff were awesome though and comped the tacos since they took so long. Make sure to try the Diablo Saloon hot sauce, good stuff. We will definitely be back.",
   "Great tacos and apps in a old western inspired setting. Really unique setting on restaurant row in downtown Boise. Food was cooked on an fire grill behind the bar. Huge beer, wine, and cocktail menu. And awesome service! Overall, really impressed with this place!",
   "I'm from South Texas, so I was already a tad skeptical about the quality of the tortilla that would be served to me. I was wonderfully surprised! Perfect tortillas wrapped around perfectly prepared catfish! Order any appetizer, it won't disappoint. I ordered a Lemonade cocktail, that I sent back...it just wasn't for me, but they gave me no trouble about it! Great place!"
  ]
 },
 {
  "name": "Mai Thai Restaurant",
  "address": "750 W Idaho St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/bfb9b5ae-932e-11ea-a662-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11952781751527968706",
  "source": "GoogleMaps",
  "reviews": [
   "If you are in Boise and looking for good food and cocktails, this is an outstanding choice. Separate vegan menu? Yes, and it's on the front page. Great tiki cocktails? Yes, they have that also. Plus warm, friendly service and when the menu says spicy they mean it. Added bonus: they serve food until 10 PM on weeknights.",
   "The roasted duck and pork belly was a guilty pleasure but worth it. This restaurant offers up lots of great cocktails and food. The decor and atmosphere makes you come back for more.",
   "This place is absolutely amazing! They have one of the most diverse vegan menus in Boise, and the food does not disappoint! I had the yellow curry and the Tsing-a-song roll! Both of which were scrumptious and bursting with flavor. We also ordered the mango sticky rice, expecting a scoop of over-sweet glop in a bowl, but it was AMAZING. It comes in a banana leaf and it's warm, sweet, and comes with fresh mango and some sort of blue sauce (seriously, what is in this stuff- it's so good, I would bathe in it)! I will definitely be back!",
   "Mai Thai restaurant is a favorite of ours.  The food is terrific and service courteous and prompt.  \n\nA long-time resident of Boise and having lived and worked in Thailand for ten plus years, I would rate Boise's Mai Thai food as good as, or better than, most of the Thai restaurants we frequented while living in Thailand.  \n\nNot a brag, just cold hard facts.  \n\nThe only Thai restaurants in Thailand as good as Boise's Mai Thai would be those in Thailand serving fresh caught seafood and those would be hard to beat just about anywhere.  \n\nRay Toronjo",
   "Ordered through DoorDash, was so excited to try the half duck! The taste was good however the ”half” duck was more like 1/4 of duck. It was like there were missing pieces"
  ]
 },
 {
  "name": "Taj Mahal of Idaho",
  "address": "150 N 8th St #222, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c07c103a-932e-11ea-8dde-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "family",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10767113719701553668",
  "source": "GoogleMaps",
  "reviews": [
   "WOW! ⭐ Taj Mahal of Idaho easily has the best food and dining experience I've seen in Boise. What was intended to just be a nice dinner for my girlfriend and I ended up being a romantic evening full of smiles. We were charmed by the owner who took the time to explain what  the exotic foods on the menu were and answer all of our questions. Even being our first time trying Indian Cuisine they still made us feel at home and part of the culture. If you're looking for a fine dining experience without the overpriced menu, give Taj Mahal a shot!",
   "All I can say is you gotta witness this for yourself. Great family owned restaurant in the valley. Feels like they bring unique flavors straight from the Indian Subcontinent. They do not use any artificial flavors or colors in their food. The family is very nice. Service is excellent. It can get a little busy so definitely would recommend making a reservation.",
   "I recently tried Indian food for the first time in Dallas, TX. I can not get enough of the spices and flavor. Taj Mahal in Boise is by far the best I have experienced. I can’t wait to go back for more and more. We were lucky to meet the family who own and run this fine establishment tonight. We are so honored to have them in our town.",
   "Staff and especially the owner are very friendly and lively. It's always a pleasure to go here and chat with them. Their food is the best Indian food I've had in the treasure valley. I've tried many Indian cuisines and restaurants alike in the area and they just aren't as good as Taj Mahal. These guys are amazing and their food matches it every bit.",
   "Excellent food, generous portions. We ordered two entrees and got much more food than two people have business eating. We tried goat for the first time and enjoyed it. The paneer was done perfectly, soft, but with just a little bit of crispiness on the outside, and good flavor. The service was friendly and attentive, and the atmosphere nice."
  ]
 },
 {
  "name": "The Matador",
  "address": "215 N 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c0fa9ec2-932e-11ea-82e4-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16907618105124165031",
  "source": "GoogleMaps",
  "reviews": [
   "Went out with the extended family. They got 8 of us seated really quickly and the service was good. It was a little warm in there, making the ice melt in the glasses. We also ordered the guacamole and it was really good. We'd definitely go back.",
   "The grilled jalapenos here will bring me back everytime! They are so amazing, add that to everything else I've tried on the menu and this place is a solid choice. Lunch or dinner you will not be disappointed!",
   "I love Matador's free chips and salsa, as well as their food and drinks menu. I really wish this location would get blenders so they can make the frozen margaritas like the Meridian location. Other than that, I love this location.\n\nI highly recommend trying one each of the street tacos. Also, try to come during happy hour for the best deals.",
   "Many tables available on a Saturday night at 6:45 pm but there was a 45-minute wait... Surprisingly we got sat in 20 min. The waitress was great, food was absolutely delicious. I got the chicken Verde burrito and my husband ordered the NY Strip fajitas. Yummy",
   "Yummy Mexican food, nachos are massive! A wide variety of cocktails. Seating inside and out, the downtown area can get busy so there might be a little bit of a wait. Service can be slow but they don't rush you."
  ]
 },
 {
  "name": "Meraki Greek Street Food",
  "address": "345 S 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c193a75a-932e-11ea-901b-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "food",
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2745476625867701266",
  "source": "GoogleMaps",
  "reviews": [
   "We ordered for pick up and it was SO delicious that I had to fight the kids to get a bite. Seriously try the feta fries!!!  My husband had the lamb gyro and said it was super tasty.  I had the Souvlaki plate with chicken that was super flavorful and loved that the chicken wasn't dried out.  Their pita is super soft and the sauces very taste.",
   "Quick service, good food and lots of choices. The fries were seasoned really well. The chicken gyro was tasty and well made. Nice presentation and ambience, good staff too.",
   "Food was alright. Received wrong order the first time but was fixed right away.  Everything just seemed way too salty. I probably won't eat here again. I think Gyro Shack is much better and even Arby\"s has better gyros. Fries were good.",
   "This place is awesome. A girl helped me. She was super nice. Not sure what her name was. She had red hair. She was great. Definitely made the experience worth it. Will be coming back. Also the food was awesome.",
   "Absolutely delicious! We went in with our 3 little boys and everyone was beyond satisfied. The food was fresh and super tasty! I love good Greek food and this place nailed it."
  ]
 },
 {
  "name": "Front Door",
  "address": "105 S 6th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c1f38318-932e-11ea-a7b8-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "delicious",
   "food",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3437199614902389661",
  "source": "GoogleMaps",
  "reviews": [
   "We have always loved this place! Our last visit (3-6-20) was the worst we had. First of all we ordered an appetizer which came after we got our main meal. The server made us feel that we had to take it, since we ordered it. Anyway, it appears the quality of food has gone down hill along with the service. My wife's cocktail  was wrong on the bill, so we do not know if it was the correct price.  I would have expected them to remove the cost of the appetizer or offer a free beer or something.... There was no apology or anything. Do not know what has happened there, but we will be spending our money at other places. All we were doing was looking to have a nice meal, which did not happen.",
   "The Front Door is a hidden gem in downtown Boise. The ambiance and vibe of this little pizza place is the perfect spot to enjoy some great food and friendly service. The food is very consistent and always delicious. Their beer selection is very diverse and rotates regularly so you can always find something new to try. They also have a full bar! I'm never disappointed when I grab a bite at Front Door!",
   "Went there for a special birthday lunch with friends.  The food was amazing.  I had the coconut curry special and it was perfectly seasoned.  The wait staff was quick and courteous and met all our needs. This place is a downtown favorite of mine because of the food, the staff, and the ambiance.",
   "Low key the best pizza in Boise. Plus, a nice selection of beers and sours. If you're willing to wait, they'll start slinging slices after 9pm. Couple slices and a beer and there's your Saturday night.",
   "I was in Boise on business and just happened to walk by this place. My first impression was not one of a pizza place. I saw just another bar slinging microbrews and passing off bar food as restaurant cuisine. At the end of my meal, I found nothing to convince me otherwise.  If you can put yourself in this mindset Front Door does offer slightly above average pub grub and reasonable prices. I had a cobb salad. This is my go-to meal when on the road and in a new place. The service was quick and the meal enjoyable. Overall I found Front Door a nice enough place for either a quick meal or a place to hang out and have a few drinks."
  ]
 },
 {
  "name": "Waffle Me Up",
  "address": "204 N Capitol Blvd, Boise, ID 83702, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c24b454c-932e-11ea-bbaf-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "unique",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16946440236331321873",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed our breakfast here in a Sunday morning. Our children loved the waffles, which were dough instead of batter (like real Belgian waffles). The waffles had a delicious flavor, and every bite was gobbled up. The eggs and bacon were good, and my husband enjoyed the coffee. It was on the bitter side for me. The children have asked to eat here the next time we visit Boise. Great service, easy to talk to downtown and fast.",
   "Great unique breakfast food! Linked inside to Boise Fry Company. I had the Bobocado Deluxe. I wasn’t sure how all those foods would taste together, but with my first bit I thought I was on another planet. It was incredible. If you like avocado and bacon, you have to give it a try.",
   "Enjoyed my experience here. I wasn't sure what to expect but was pleasantly surprised. I just ordered the original waffle, but it was there best waffle I have ever had. It was a nice atmosphere and the workers were nice. I would definitely go back again.",
   "Blue plate is Bob Deluxe\nRed plate Bobacado Deluxe\n\nReally good waffle with the right amount of syrup and generous portions of bacon. \n\nGluten free options with no up charge. \n\nAtmosphere connect to Boise Fry which makes its a fun and upbeat.",
   "I really enjoyed the service, and something about it being a small restaurant brings joy. The food was amazing and I've never had anything like it before anywhere else. Highly recommend checking it out :)"
  ]
 },
 {
  "name": "il Sugo Restaurant",
  "address": "904.5 W Main St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c2acce70-932e-11ea-8a98-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "tasting",
   "food",
   "delicious",
   "food",
   "delicious",
   "delicious",
   "walking",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9826535300192292085",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I ate here. We wanted to try a new restaurant. As we walked in to the completely empty restaurant they asked if we had a reservation. I told them no and they acted like they were doing me a favor by seating me in their empty restaurant. There were only a few menu choices. For 4 of us it cost around $65 this was without ordering any extra items and only drinking water. The salad was an extra $6. But at $18 a plate you would think this would at least include a salad. Which looking at someone else next to us who got a salad it was mostly just a pile of lettuce. But I felt like there should have been a side item included with our one entree. The food quality was mediocre. It was definitely not worth the price. All 4 of us ordered something different and we didn't like any of it. It looked like it was going to be good but was not. One item we ordered was the disassembled lasagna and really it was only just meat sauce and noodle with a small dollop of ricotta cheese and the flavor I thought was gross. I ordered a vegetable plate that had asparagus, rice and squash mixed in for $13 and I added meatballs which cost me an extra $5 for 2 meat balls that were still pink inside. The vegetable plate was okay out of the 4 meals it was the best and it wasn't anything special for $18. Another plate we ordered was the Italian sausage fettuccine and no one even ate it. We all tried it but no one liked it. It was a waste of money. The last item we got was the shrimp scampi and that barely had any shrimp and the flavor wasn't great. They are way overpriced and for that cost the meal and flavor should have been way better tasting. I absolutely think this was a complete waste of money and I will not be back. Save your time and money and just go to olive garden. You at least get soup or salad with your meal and more menu choices. Response to owner: the only thing that I agree with about you response is that I would not be back for even a free meal if it was offered. Your meals are WAY overpriced.",
   "We tried this place out this evening and were pleasantly surprised. It’s a nice, quaint little place.\n\nThe food was really good. The sauce was loaded, it was all sauce (see picture). The butter was delicious. Service wasn’t lacking either. \n\nWe will be coming back for sure.",
   "We were a party of eight\nand ordered several different pastas and sauces.  Everything was delicious. \nHandmade, local pasta and from scratch sauces made at the restaurant. \nI can honestly say the best I have ever eaten. \nThe service was great and the\natmosphere was wonderful,\nquiet and cozy. We were able to enjoy\neach other and our conversations.\nI highly recommend il Sugo and will definitely come here again.",
   "I could not have been more delighted with my first dining experience at iL Sugo!!  As I walked into the restaurant, Grant and Athena greeted me as if I was walking into their home!  Everything had just the right touch-the service was gracious and efficient but not intrusive.  The decor was cozy and inviting.  I love the menu concept-fresh home made pastas with a variety of sauces to choose from.  Salads, appetizers, wine and coffee-enough choices but not overwhelming.  We were celebrating a birthday and they brought out a fabulous dessert-complimentary!\n\nI highly recommend il Sugo-the owner and staff are sincere in their intention to provide an authentic, delicious and memorable dining experience!",
   "Really, really enjoyed the food, service and atmosphere at IlSugo. The Tartufo pasta dish was amazing, and the deconstructed lasagna was very good. Grant knows how to create good that tastes amazing! We had this food at a catered event and had to come into the restaurant, but it was booked! We persisted, and it was worth it!"
  ]
 },
 {
  "name": "Bombay Grill",
  "address": "928 W Main St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c3292aca-932e-11ea-bc4b-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4397582186527692756",
  "source": "GoogleMaps",
  "reviews": [
   "This restaurant and it's owners and employees have always treated us like family. Their buffet is the best I have ever eaten. I have severe gluten intolerance and have never had a problem eating here. Their chai tea is the absolute best! My personal opinion is this gem will be very very missed once they sale. No one can compare with quality of food, service and the variety of amazing authentic Indian cuisine. Please enjoy their food and beverage before they sell and are gone forever. My humble opinion. Love them so much.",
   "Went for the lunch buffet and it was phenomenal. First time really trying Indian food and I was blown away (along with everyone else in my group). $11.65 for high quality buffet food. Will definitely be back!!",
   "The food at Bombay Grill is always dependably wonderful! In particular, I don't think I've ever had better butter chicken. The owners are gracious lovely people. Give it a try. You may find a new favorite restaurant!",
   "Great buffet! Tastes delicious. I would rather say 4.5 stars..Though We had to ask for bread, go to fill water by ourselves..but later when I went for tea, they happily offered me tea as per my taste .. small things, but add value! Good luck!",
   "Out of town, wandering downtown Boise. Enjoy Indian food, so I stopped for a lunch buffet to go. Good selection and reasonable price. Very helpful staff and generously gave me an extra container for yogurt sauce, plus a container of mukwas!  Food was yummy!"
  ]
 },
 {
  "name": "Bangkok Thai Restaurant",
  "address": "477 N Milwaukee St, Boise, ID 83704, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c3782cb6-932e-11ea-8bc9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3783968197563954253",
  "source": "GoogleMaps",
  "reviews": [
   "The food is consistently delicious and they are always happy to take my custom (vegan) order.  Love the waitstaff.  Awesome food and customer service.  Did I mention that I love this place?",
   "This is my favorite Thai place from Boise to Los Angeles! The staff is very friendly and helpful when selecting items and spice levels. The decor is simple and nice, pretty quiet dining area even with a full house. BUT the FOOD IS THE BEST!!! Everything thing I have had here has impressed and blown me away from presentation to flavor. Today I got a chicken pad Thai and beef salad. It has become a must have at least once a week for my wife and I. Keep up the great work and see you again soon.",
   "This place is infinitely better than Pad Thai House on Overland and Fivemile. I have absolutely no idea why Pad Thai House has as many reviews as they do. Their food sucks. Bangkok Thai Restaurant on Milwaukee is the place to be.",
   "My frequent comfort food while working in Boise. Staff always delighted to see me! That's how frequent I ate there. If you like spicy, ask for \"thai spicy.\"",
   "I called in an order for curbside takout tonight. They got a little slammed tonight with take orders (times are different now with only take out and no dine-in), so our order was not ready on time. However, the customer service was great, very apologetic for not being ready on time and they were really doing their best. Food was yummy and just hoping some of these dining estabishments can survive this hit to their business right now."
  ]
 },
 {
  "name": "Romio's Pizza & Pasta",
  "address": "8125 W Fairview Ave, Boise, ID 83704, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c3d6cc18-932e-11ea-821c-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "hospitable",
   "food",
   "food",
   "music",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7512170577612621208",
  "source": "GoogleMaps",
  "reviews": [
   "They never disappoint!! We ordered dinner tonight and splurged a little, no kids!! Ordered pasta, pizza, wings and garlic bread and all of it was amazing!! Support local businesses!! They are worth it.  Staff is friendly and food is amazing!!",
   "Just randomly decided to pop in and my wife and I were so pleased! The food was so tasty! We both tried Italian food this time and we will for sure be coming back for some of their Greek dishes! Riley was our server and we was very kind and hospitable, great dining experience:)",
   "We love to go out. Yesterday we  found this excellent restaurant which we didn’t know before. We enjoyed a delightful time there with high-qulity meal and an efficient crew and a distinguished  cuisine. We put this restaurant in our phone list  and we shall surely return very soon. We highly recommend.",
   "Gus always has excellent food and service is superb!\nSummer evenings on the patio are a marvelous way to share a meal with friends, and the background music 🎶 is great!!! Highly recommend this place!",
   "Had pizza and a salad delivered. Absolutely delicious. Service was great and the delivery was quick. Definitely coming back, again and again."
  ]
 },
 {
  "name": "Cracker Barrel Old Country Store",
  "address": "1733 S Cole Rd, Boise, ID 83709, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c42d3bb4-932e-11ea-98f7-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=296844220379202484",
  "source": "GoogleMaps",
  "reviews": [
   "Once I got past the cool store with lots of things I wanted, the food was great comfort food.",
   "National chain that still manages a home style feel. The portions are huge for the price and the fried chicken is worth the trip.\n\nThe store (where you enter through and have to pay your bill at) is well stocked with souvenirs that have a nostalgic and rural feel.\n\nThe service staff are very friendly and treat you like an old friend.\n\nWhen they are busy (usually) you can wait on the front porch in the rocking chairs. Check with Google turn the best times to go, but my wait times have never been that bad.",
   "Great food, great service....great everything!  What can I say? :)\n\nI had a newbie service me.  He was so funny and nice.  Sometimes it's just nice to talk to people.  You should definitely give this place a try, if you haven't yet!  Loved it♡",
   "Charming and nostalgic restaurant, Cracker Barrel is unique and tasty. I am a big fan of fried chicken which I have tried twice there and almost tried again. Both times it was over cooked and the breading was very hard. Didn't want to chance it again so I had chicken tenders which were very good. Excellent atmosphere and staff. Always enjoy the side dishes.",
   "Delicious !!! Great service AND very good prices thank You"
  ]
 },
 {
  "name": "Flatbread Neapolitan Pizzeria",
  "address": "800 W Main St STE 230, Boise, ID 83702, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c4814f5e-932e-11ea-a538-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15954202674365692812",
  "source": "GoogleMaps",
  "reviews": [
   "We went there on Saturday night. The location is great. They have seats by the open wide windows facing 8th street which we enjoyed a lot. The environment was casual and friendly and there was an authentic pizza oven at the center. Pretty cool to me plus you couldn't smell any burning oil or smoke in there which is an issue for me at indoor busy restaurants.\nOur server was shaved head long bearded gentleman who gave us an extraordinary service. \nWe ordered roasted tomatoes with goat cheese for appetizer which was one of the best appetizers I had so far! It is spicy hot as it should be!\nThe pizza was authentic and taste delicious!the ingredients were fresh!\n\nDo not expect anything like your usual Domino's pizza. This is different!\nIf you feel like eating greasy salty pizza, don't go here this time! But if you feel like eating Italian pizza this is the place!",
   "Went here for the very first time. The staff were WONDERFUL! Stopped in with no reservation before the lunch rush and since it was our first time they took us to a great view! Because we were first timers our waiter gave us the detailed low-down on what everything is in a professional friendly manner. My mother has sight problems and he was so very patient with her which I very much appreciated. My brother has social anxiety and speaks low when near many people, our waiter simply got closer and spoke to him, almost kinder I would like to say. I wish I remembered our hostess and waiters name!! Their selection of items was incredibly inclusive to those who are vegan, food allergies and of course our meat eaters! Food preparation was beautiful (not sure authentic because I'm not Italian nor know what the authentic dishes look like...) we definitely thought we didnt order enough food until we started eating! It was more than enough with left overs to take on the road! Keep up the amazing service and foods we will sure to be back!",
   "We absolutely loved the vibe of this place! Our waiter was very friendly and quick. We ordered the Alfredo chicken pizza and it was truly delicious!! I'd say my only minor complaint was that it was super loud but it was also a Friday night and again I don't think it's meant to be a quiet sit down necessarily. Would go again!",
   "We’ve being going to your restaurant before you moved into the Zion building and have never had a bad experience. When friends come into town, it’s the first place we think of when dining out for dinner. There are many good choices in downtown Boise and have always considered you as one of them...until last night. I’m not sure if there is new management or maybe a new cook, but when all three of our meals are not close to being the standard of what we have come to expect from Flatbread, then something is wrong. \nI had the Rosemary Chicken sandwich which is normally an extremely tasty sandwich that I always order. Last night it was very dry and unpleasantly tasteless. I did eat half of it because I was hungry. My sister-in-law had the Alfredo the Grate. It was cold and dry and had no bacon and only two pieces of artichoke. My wife had the Chicken Parmigiana which was overcooked and very greasy. \nThe one bright spot was the Wood-Roasted Cauliflower appetizer. \nOverall, it was a bad experience that makes choosing Flatbread the next time we dine-out not one of our options.",
   "Sadly my favorite pizza, the white truffle mushroom, has been removed from the menu, and I have yet to find a pizza that compares to it. I have been a regular at this place for years, for good reason. Their service is always perfect. The appetizers, drinks, and pizzas are perfect, and the location has perfect views of downtown Boise. Everything about this place is perfect. (except the empty spot on the menu where there used to be a truffle pizza)"
  ]
 },
 {
  "name": "P.F. Chang's",
  "address": "391 S 8th St, Boise, ID 83702, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c4e6b348-932e-11ea-acd9-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5225416059012450785",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoyed basically all the food. I went with a group so I/we sampled a lot of platters. Their signature salad wrap was awesome, not what I was expecting but very tasty. I enjoyed the dragon roll, better than a lot of places I've had them at. My favorite would have been the dumplings. No complaints all the way around. Great service. I thought the kids menu was a little lacking but with that being said, the kiddos were happy with their order as well.",
   "Prices have gone up, however the food is good. I loved the fried green bean appetizer dish.",
   "The table was sticky, either from a lack of cleanliness or the finish coming off.  Food was mediocre.  Asian Pear Mojito tasted like pure syrup.  Our sushi roll came out after we were done eating.  Bathroom is disgusting.\nThe place is definitely not the quality it was originally.\nOnly redeeming quality was our kind server and he took off the charge for the sushi roll.",
   "It was all amazing and wonderful. It's no surprise that they are known for their lettuce wraps. They we a great starter. We had a Korean steak, and a sea bass, shared so we both got some of each. I don't usually order my steak as rare as this was (medium rare), but it was so nicely seared and marinated and had such a great sauce that I didn't mind that it wasn't quite my usual medium. The sea bass was seared just long enough to cook cook it through and the sear on ours was perfect. I'm not usually a fan of dark chocolate, but I recommend the great wall of chocolate.",
   "The food was good, but the service was horrid. Our particular server had just come back from \"vacation\" and stated he wasn't familiar with 2 out of the 3 items we had questions about.  This was the special menu. He also forgot to put in an order and our appetizers came out with entrees.  \nLet me be clear, it was NOT busy. He also never smiled. In my opinion a tip is similar to a commission. You have to work for it. If you are not happy with the wages, then you either work for tips to compensate with a smile, friendly service,  and menu knowledge or you get a different job. This man was not welcoming nor looking for any compensation. \n\nIt was discouraging because the host was very welcoming, the atmosphere was calming,  and the food was good. If I go back, it will be an order to go."
  ]
 }
]