[
{
 "name": "Brookline Recreation Department",
 "address": "133 Eliot St, Chestnut Hill, MA 02467, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "5 stars for the playground there. ",
  "My Kids like this park",
  "fun for different ages",
  "Great after school program & amazing teachers!",
  "For children, they are happy"
 ]
},{
 "name": "Little Field Park",
 "address": "60 Eliot St, Chestnut Hill, MA 02467, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Nice place to unwind from the go, go, go. Of the world.",
  "Great for quick jaunts with the pups.",
  "Good Park to go walk around with your kids and your dog",
  "Small but friendly",
  "Bueno para ir a Adesaburince"
 ]
},{
 "name": "Daniel J. Warren Playground",
 "address": "133 Eliot St, Brookline, MA 02445, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "",
  "",
  "",
  "",
  ""
 ]
},{
 "name": "Fisher Hill Reservoir Park",
 "address": "78-144 Fisher Ave, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "walk",
  "free"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Opened in 2016. Multi use field with some playground equipment. There are plenty of benches to have a picnic. The park should be quite good for sledding during winter. ",
  "Full of nature and joy also really good for dogs and kids",
  "Quiet..peaceful..well kept!",
  "Fabulous walk. Keep the free space up.",
  "Well kept..peaceful"
 ]
},{
 "name": "bclee",
 "address": "35 Fisher Ave, Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Inky Fingers Graphics",
 "address": "697 Boylston St, Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Brookline Reservoir Park",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "free",
  "walk",
  "jog",
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Beautiful serene place to take a stroll.  There is no biking or skating,  so you are not rushed.  The pond is surrounded by a wonderful diversity of trees and shrubs.  There are benches placed around the entire reservoir.  There is free parking around the reservoir.   I would advise anyone visiting,  to remember that there are private homes surrounding the reservoir.  Please be respectful.",
  "The reservoir is flanked all around by beautiful cherry blossom trees! Great place to fish, jog, walk and enjoy the blossoms in early to mid May! Went on Mothers Day and weather was beautiful! parking can be challenging.",
  "It's a beautiful park espeially when cherry flowers blossom",
  "One of my favorite places for walking around Brookline and one of the few where you can be sure of getting any Sunshine there is to be had. We always stop and linger against the old stone walls of the pump house which get warmed by the Sun and whose Stone arches provide protection from the wind so you can really soak in the rays. A great winter walking spot.",
  "Used to be nice for a short walk now is under construction"
 ]
},{
 "name": "Chiharu Sushi & Noodle",
 "address": "370 Boylston St, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "First time visit. Not bad. I had a beef noodle soup that was excellent. Also we had some sushi that was pretty good. The location is right to route 9 what is not great.",
  "We met with friends at this spot for dinner. This spot was recommended to us by a friend.  Well, it was a winning. we were warmly welcomed by the staff members  and we felt good. The meal was tasty. We loved this spot very much and we shall definitely come back again. Warmly recommended.",
  "Very highly impressed with this sushi and noodle spot. Quick clean and tasty with warm atmosphere. Affordable for location, I approve this spot!",
  "Chiharu has fresh and delicious sushi rolls and entrees! It is our favorite sushi place. We make frequent special trips from the city for lunch and dinner. I highly recommend trying this restaurant as the quality of food is wonderful and the service is great! Everyone is very friendly and polite. Headed home to eat out takeout now!",
  "We absolutely love this place! The ramen is SO fantastic, and the house rolls are to die for. When we move up to Malden we're going to have to make special drives back down here."
 ]
},{
 "name": "Zaaki Food Truck",
 "address": "374 Boylston St, Brookline, MA 02445, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "free",
  "food",
  "food",
  "delicious",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This is one of the best food I ever had in my life. I work for a medical company in Lexington MA and I travel there once a month where Zaaki food truck offers best quality food for the company’s employees. I didn’t have any cash with me but the debit card and the debit card machine wasn’t working. The gentlemen who was taking food orders told me not to worry about the money. He requested to just enjoy the food and pay money to a needy people instead whenever I can. He offered me free food because his debit card machine wasn’t working and I didn’t have any cash. I asked him to give me his address so I can send a check when I go back to Nashville TN but he said it’s ok and not to worry about it. I now believe that there still kind people live in this world. \nI just want to say thank you for the food it was absolutely delicious. Thank you!",
  "Delicious food . I recommend everyone one to try it. \nBest falafel in town.",
  "Just got from their pop up at Joslin in Boston... WOW it's sooo delicious. I love middle eastern food and this was beyond fresh, delicious AND they let me practice my Arabic. Awesome guys!!",
  "I have been impressed by the flavor and texture of their Koshari and rich toppings and sauces. However, their newly introduced Falafel is nothing like what I eaten before. The fragrance is rich, the greenish ingredients look so healthy and and taste is so delicious.",
  "Delicious food and a warm welcoming team. Loved the fiery kushari chicken. Will definitely be back for more."
 ]
},{
 "name": "Morehouse Gallery Fine Arts",
 "address": "3 Regent Cir, Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Little Free Library #26534",
 "address": "78 Brington Rd, Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Friedman Park",
 "address": "387-413 Walnut St, Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "New Lincoln School Field",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Clark Rd/Mbta Land",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "BESS'S CAFE",
 "address": "224 Cypress St, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "family",
  "delicious",
  "free",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I have eaten in and ordered delivery many times. Food is always fresh, flavorful, and delicious. Service is quick and friendly, and they’ve always gotten my order correct. The crispy chicken and beef buns are the best item on the menu. I will order from Bess’s again and highly recommend them to friends.",
  "Little Chinese restaurant that seems to be family owned (not sure). We ordered the pork belly buns ($8), the beef scallion pancake/wrap ($8), and a spicy noodle soup ($12).  Was really excited for the deep fried buns but they happened to be out when we went.\n\nFood came out quickly, and the beef scallion pancake was great! However, in the future, I will steer clear of the pork belly buns. The pork belly was fatty but far more chewy/rubbery than melt-in-your-mouth as I expected. They have other filling options like chicken, etc., which may be better (haven't tried). My friend had the noodle soup, which was nice and he enjoyed.\n\nMight come back for the deep fried buns but not sure! Felt a bit overpriced for the quality, but maybe I would feel differently about a different selection.",
  "I had an extraordinary  in this place. We liked the excellent environment and the menu. The waiters are super welcoming. I am happy we ultimately decided to visit this restaurant.",
  "Fantastic spot to eat something when in a hurry. The service is efficient, prices are reasonable, excellent vibes. I highly recommend this place",
  "After I saw all the good review. Me and my friend decided come to Bess ‘s Cafe today. The location was so easy to find. Parking free. ( you can park on the street ) \nThe restaurant is small but clean. Especially the bathroom... is spotless!! The food was absolutely delicious!!!\nWe try the Dan Dan Noodles ( the best I ever had ) Beef Wrap & Pork Belly Bun ( full of the favor )  and the best is the DUMPLING !!! She cooked really well and fresh. \nI highly recommend it. Me and my friend will coming here again. \nThanks for the good food!!!"
 ]
},{
 "name": "Pizza Stop",
 "address": "226 Cypress St, Brookline, MA 02445, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great neighborhood pizza spot. The staff, including the owner, are so nice. They actually have an awesome canned soda selection (in my opinion). Good pizza with a crunchy crust. Solid steak and cheese sub. Highly recommend for a quick, casual bite to-go!",
  "Hidden gem in Brookline. Very cozy and attentive staff. Wings were crunchy and juicy and pizza was delish! Can’t wait to try something new from the menu!",
  "Great food, fast service, fair pricing, cool staff, everything you would want for your local fast food Italian/Greek cuisine. Best pizza, subs and salads in town hands down!! A+++ all around!",
  "Great locally owned spot with great pizza, subs and terrific salads!",
  "Decent pepperoni pizza slice. Lots of pepperoni pieces."
 ]
},{
 "name": "Drive-By Pies",
 "address": "248A Cypress St, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Why wait for Thanksgiving to indulge in some pies, (and salads, and dessert bars and sweet deliciousness? Get to Drive-By Pies start giving thanks early!",
  "Great service, amazing, delicious high quality products\nand my favorite dessert the very tasty raspberry tart.",
  "At the Wakefield Farmers Market today , we bought a small blueberry pie and a small Apple Cranberry pie, they were delish! Just excellent ! \nCrust was crisp and chewy , fruit was perfect !",
  "I never had a cherry pie so packed with cherries and little else. The tartness of the cherries came through beautifully. Great way to celebrate my 60th birthday!",
  "The Finest Pies Locally!  Pre-order to be sure to get your choice!  I bring all my Real Estate Clients Here!"
 ]
},{
 "name": "Rifrullo Cafe",
 "address": "147 Cypress St, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I LOVE the food and ambience here. I had the best cortado coffee ever. They also have a very healthy mix of vegetarian and non vegetarian food 💕",
  "Small Green cafe with good food and friendly service",
  "Honestly the staff is so sweet, went this morning and the vibe is sweet of the place but their coffee is so horrible and their scone that had fruit literally was awful. Crumbled in my mouth into what felt like dust. Definitely won’t come back.",
  "Had the pork sandwich, very good! Small place can gets busy at lunch (two women actually ate their lunch while sitting at the dirty dish drop-off station). They recycle everything, and good for them! A very \"crunchy\" vibe. Would recommend.",
  "Wonderful little hidden gem."
 ]
},{
 "name": "Clark Playground",
 "address": "195 Cypress St, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "kids",
  "family"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The playground is awesome for the kids 🧒🏻.",
  "Park with playground equipment south of route 9. Most of the playground equipment is new. The playground equipment is somewhat different but kids get quickly bored with it. Kids seem to like the water fountain. There is a basketball court. The park is fenced in from three sides. ",
  "This park is relaxing, and great for children. There is a water park here.  So if you have children this is  the park for  you and family. \nThe children can have fun and you can watch the children with no worries.",
  "Slash and swing, children love that.",
  "Great park, with water fountains for summer fun."
 ]
},{
 "name": "Oakland Point Garden",
 "address": "39-43 Oakland Rd, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Beautiful, sustainable, sidewalk vegetable and flower garden utilizing pots and sidewalk strips. Lovingly cared for by longtime Brookline resident.",
  ""
 ]
},{
 "name": "Cypress Street Playground",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Plenty of everything. This park has a huge soccer field, basketball court, 2 play structures, swing sets with bucket seats and a splash pad for the summer. They have plenty of street parking available and it's walking distance to the Brookline Hills T Stop.",
  "Town soccer field. Well maintained given the weather. Squeezed between highway and T- rail.",
  "Small friendly clean sprinkler playground. My kids always make new friends here",
  "Would walk again",
  "Very nice well taken care of enjoyable"
 ]
},{
 "name": "Boylston Street Playground",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "La Morra",
 "address": "48 Boylston St, Brookline, MA 02445, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "On Boston mags for the 50 best restaurants for many years, we finally got there tonight!\n\nCozy, and warm and friendly service accentuated the solid Italian fare. The $40 prix fixe for this quality is hard to beat anywhere.",
  "This place was amazing. Order the prix fixe, you won't be sorry.",
  "Definitely not worth the price.  Food is good but not amazing.  It was over-salted, too.  I did think our mixed drinks were phenomenal though.  Warning: Christmas Eve is a prix fixe menu, though we weren't told this when we made our reservation.",
  "Easily overlooked restaurant in Brookline. Good quality food, layered flavors. We had one incident before leaving where I would have expected a little bit more courtesy from the staff. Other than that, you can expect a good dining experience.",
  "Food was very good. Cute, more traditional Italian place. It is missing a certain kind of charm, like it’s grown stale. But worth the visit overall. [Instagram @sipsavorslay]"
 ]
},{
 "name": "Little Free Library #45251",
 "address": "4 Hart St, Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Davis Path",
 "address": "Davis Ave, Brookline, MA 02445, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "A nice place to just go and relax for a little bit"
 ]
},{
 "name": "Emerson Garden",
 "address": "82 Davis Ave, Brookline, MA 02445, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "peaceful",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "One of the best parks in all of Boston. Perfect place to take kids practicing biking and scooting as the path is a large circle, totally visible and enclosed within the park. Safe and peaceful!",
  "Lovely addition to the area. Small (i.e., manageable) splash area with Adirondack chairs. About 60x40m green open space for soccer balls and picnics. Very nice quality play equipment (swings, roller slide, climbing structure, regular tall slide, etc.) in the shade. Could use one more trash/recycling bin combo by play area.",
  "Recently re-done and the city did an amazing job! Now has a kid's water feature, cool new play structures, and the water fountain even has a spigot for my dog! Totally love this park.",
  "Nice, clean place. Great neighborhood. Different activities to enjoy.",
  "Very nice park and also a good dog park"
 ]
},{
 "name": "Philbrick Square",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Juniper Street Playground",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Margaret E Robinson Playground",
 "address": "Brookline, MA 02445, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Omori Izakaya",
 "address": "195 Washington St, Brookline, MA 02445, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "delicious",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Staff is friendly and helpful. Food is fresh and well-prepared. Fried items are cooked in \"clean\" oil - no reused or old taste! Wine and sake selection is very reasonable. Excellent place for lunch or dinner or late evening eating!",
  "I love this place. I have been coming every Thursday since I found out they had finally opened. It's got the Japanese equivalent of pub food and makes it well. The options are all refreshingly authentic (to an American with limited knowledge, mind you) and delicious. The sushi options are wonderful and they have everything you could want to tailor to your tastes. They do one with a braised tuna and olive oil that is to die for, but that may be the Italian bias in me. The only thing that falls flat is their ramen, which is only redeemed by the fact that there are so many other tasty things to eat instead. I even made a friend while sitting at the large table with a stranger. The wait staff is also wonderful and kind, they work very hard and it shows. They even remember me when I come in now. The food is quick, but it helps that I go at an off-time. Please show this business some love, they deserve it",
  "If you've never tried Yakitori, you're in for a treat. Think of the most delectable kabobs you've ever had and multiply it by 50. I recommend the bacon-wrapped scallops for newcomers. Grab a pitcher of Sapporo with your mates and settle in for a great night!",
  "We’ve heard of this restaurant from many our friends and finally we came on a Sunday night. I am glad we tried it out and did not disappointed. This place is cozy and relax. We had some apps to started with, both beef with enoki and grilled squid are tasty and good. The sushi was amazingly fresh and delicious. \nThe service was excellent. Our waitress was super nice and friendly. Overall this is a great restaurant to hang out with friends. We will come back to try out their Omakase and yakitori selections!",
  "I had the ramen noodle and it was so good. We also had the spicy tuna and it was so delicious I wanted another whole roll of it. My boyfriend had the shrimp with rice and said it was very good. Will definitely be coming back."
 ]
},{
 "name": "Olmsted Park",
 "address": "217 Jamaicaway, Boston, MA 02130, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "history",
  "experience",
  "peaceful",
  "walk",
  "peaceful",
  "peaceful"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Greatest place in American history. Olmstead's culmination of experience, resolve, and craftsmanship at its finest here. I love and miss this place so much!",
  "Spent most of my evenings just walking around this park. Had so much fun here. This is a peaceful walk next to Leveret pond. Would definitely not recommend to walk at night because they don’t have any lights. Walk and but further and you may reach Jamaica pond. It’s a nice view from there.",
  "This is such a peaceful park. It's great for walks or just to sit by the pond and reflect. I really enjoy this place in the morning after working the night shift. It truly helps me to unwind before going home.",
  "It's jamacian pond...olmstead is small part of beautiful Boston man made pond.1.75 miles? Around ..something like that..not ice frozen enough to skate..dont attempt",
  "Such a beautiful peaceful place. Wonderful in all seasons. Designed around 1890 by Frederick Law Olmstead, a master landscape architect, and beautifully maintained by a devoted crew of landscapers! You can see turtles, fish, ducks, geese, cormorants, and even herons right in Boston!"
 ]
},{
 "name": "Allerton Overlook",
 "address": "203 Pond Ave, Brookline, MA 02445, USA",
 "avg_visitor_review": 2.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "",
  "",
  ""
 ]
},{
 "name": "Willow Pond Meadow",
 "address": "Boston, MA 02130, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Subway",
 "address": "2 S Huntington Ave, Boston, MA 02130, USA",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The Veggies Look Fresh Everytime I Go There,I Guess This Store Means It When They Say \"Eat Fresh\".💣💣💣",
  "Medeocre sandwiches. Service is guick.",
  "The best subway I’ve been to!",
  "Go there hungry leave hungry and disappointed nice fresh bread but they don't put anything on it like having salad on a sub roll",
  "Customer service horrible ! Soda was gross was watery and the sandwiches the advertised on the window they didnt have the bread and would compinsate! I bought a sanxwhich anyway it was good but I paid 7 dollars for half a sandwich and a drink that was gross"
 ]
},{
 "name": "Joseph's Sub Shop & Pizza",
 "address": "8 S Huntington Ave, Jamaica Plain, MA 02130, USA",
 "avg_visitor_review": 2.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The woman working behind the counter had an attitude issue for years. I had to put up with it, but last two times were awful. One time I tried to order but she ignored me eating her food, putting headphones on, she looked at me then she looked back at her phone like I was not there, I had to leave. The last time and it will be my last time at this shop, since I walked through the door she asked me what I wanted. I told her I still have not decided yet. Then she acted so rude, so angry with me. Even though I did have the food I was too worried to eat it, all what I thought what if she spit in it. I have no trust in her anymore. Too bad because the guys are nice but they do not work there often mostly her",
  "Food was delicious and stays open late",
  "food bad service aweful waman rude as hell!never again rather  eat dog food.",
  "If you’re looking for anything sweet this place has the best Churros in town! A little on the expensive side but what isn’t now in days lol",
  "Service was really good (Take out). Though, the food was alright. While ordering pizza, mozzarella sticks, cheesy garlic bread, the best part was the mozzarella sticks."
 ]
},{
 "name": "Healthy Wok MA",
 "address": "23 S Huntington Ave, Jamaica Plain, MA 02130, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "free",
  "cheap",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great food and service. Lots of authentic dishes and variety.  Can order custom and they are open late. Love Nathan one of the owners!",
  "Friendly staff and fine takeout. It’s not amazing food, but the wonton soup is cheap and tasty! They gave me some free spring rolls tonight for waiting which was nice.",
  "I come here for bubble teas, which, while not amazing, hit the spot.  \n\nThe staff is generally polite.\n\nI've never had the actual food, but I can say that it smells great and you can see them cooking it clearly from the cash register.  It's of the Americanized Chinese food variety. \n\nThis place also sells some packaged Chinese snacks (like shrimp crackers).  \n\n",
  "Ordered  from them at 8pm last night amd never got my food, they did however charge my card $52 and now I I can't seem to get a hold of anyonw there now. Called 14 times last night",
  "I love the Singapore noodles, other stuff are really good"
 ]
},{
 "name": "Dunkin'",
 "address": "37 S Huntington Ave Unit #2, Boston, MA 02130, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "First time coming here. I used the app and ordered a sausage, egg, and cheese breakfast sandwich and it was ready by the time I got there (I got there ~8 minutes after I placed my order). Here they toasted the croissant, which I appreciate. Some other locations don't do this and it makes the sandwich feel soggy. Overall, the service is good and the inside is clean.",
  "Great location! Wish it were something other than Dunkin Donuts. I did buy a donut and chatted with the friendly staff; the fact that they dropped the word 'donuts' from their name should have been a warning to me. Still, I hope this store does well; this corner could really use a boost.\nPS, the storefront could use some more street appeal; so easy to walk right by the place.",
  "employees are incredibly kind and friendly. my order is always made quickly and accurately. a conversation with one of the lady cashiers made my day and brightened my spirits. great customer service!",
  "Love this place. Friendly and Sweet staff!",
  "This Dunkin Donuts will be a welcome addition to the neighbourhood of Jamaica Plain!"
 ]
},{
 "name": "Jefferson Playground",
 "address": "Boston, MA 02130, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "BNAF Parcel",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Iroquois Street Woods",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Hayden Street Stairway",
 "address": "Boston, MA 02130, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  ""
 ]
},{
 "name": "Lawn Street Garden",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Butterfly Garden",
 "address": "Bucknam St, Mission Hill, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Hennigan Schoolyard",
 "address": "Boston, MA 02130, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Chacho's Pizza & Subs",
 "address": "Tremont St, Roxbury Crossing, MA 02120, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "affordable",
  "delicious",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Very clean and convenient restaurant. They serve big meals and for fair prices. We loved the meals very much and the waiters were super affable and explanatory. Will definitely recommend this place.",
  "Again, a place where you can drop all pretence, open your heart and get some delicious food at unbelievably affordable price. Snobs putting strong emphasis on scale/class/professionalism might want to avoid. I always rate those criteria critically where they apply. Here, it's a different spirit altogether. So with humility have the joy of trying the fabulous empanadas, the grilled half chicken...and many others. I insist that you try those traditional stuff first rather than the pizzas and burgers only.",
  "This place provides great service and enjoyable menu. My favourite place in the city. The food came out fast and the prices were fair. I recommend this place.",
  "Best fast food! Their chicken empanadas very good",
  "Great Pizza"
 ]
},{
 "name": "Milkweed",
 "address": "1508 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "family",
  "delicious",
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Such delicious food, kind staff and great prices. Thank you so much! Will definitely be back!",
  "Went here for breakfast on out trip in Boston.  The family and me were very pleased with service.  Staff was very friendly!  Food was well priced and tasted great  When I visit the area again Milkweed will definitely be a place I will have breakfast again!",
  "I went here for Saturday brunch with my friend. There were already people waiting at about 11 am as we reached. After waiting for almost 20 mins, we got high-chair seating. The place has a good vibe, servers were friendly and quick. I ordered the morning madness. It comes with a choice of eggs, sausages (awesome!), house fries and toast. It was a good sized portion and did very well as a brunch. My friend got blueberry pancakes, which were delicious as well. Overall it was a good experience. I would recommend either going a little early in the morning to beat the crowd or having ample of time cushion.",
  "This place is a hidden gem. It is toward the pricey side but I liked the interiors and the ambiance of the place. I ordered Power Bowl and it was just the right thing after a workout. Good chicken and all the veggies. Will go back here.",
  "Not a wait, but it was 8:30am on a Sunday. Seated immediately. Attended to immediately. Food out within 5 minutes. Freshly made. Hot. Very good. Would highly recommend."
 ]
},{
 "name": "Crispy Dough Pizzeria",
 "address": "1514 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "food",
  "affordable"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The best thin crust pizza I had till now. It’s crispy but the only thing I felt a bit left out is the toppings and sauce on the pizza. More number of toppings will be not good on the thin crust but the one I ordered had way too less on them. If you like thin crust and not a big fan of a lot of toppings this is the place to go to.",
  "Came here for a quick bite before class, the pizza was amazing with a perfect amount of cheese and sauce! To make it even better, I got a slice and a lemonade for 5 bucks! Definitely worth the walk to check this place out!",
  "Their pizza is really good... but every time i go it seems like i have to make do whatever they have. I show up their at 3 or 4pm and they only have certain type available as if they were about to close in the next couple hours and they cutting back on production",
  "One of the best pizza places in the neighborhood. Loved the variety of slice pizza and desserts are really good too. \nThis place has never disappointed me when it comes to late night food runs. Staff is really helpful and it is usually open post midnight.",
  "good pizza, and affordable pasta dinners! 2-3 min. drive from Longwood Medical train station."
 ]
},{
 "name": "Lillys Gourmet Pasta Express",
 "address": "1528 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I am not a big pasta fan until I ate at Lily Gourmet Pasta Express. I've worked in the area for about 9 months and this was my first time eating here. My son and husband had their hearts set on eating here. From the minute I walked in Tyler was great from helping us figure out how to order.....to giving us tips on what to add. EVERYTHING....EVERYTHING was delicious!!! The staff is so friendly and the spot is so freaking cute!!! If you want a great plate of pasta from really great staff.....order from Lily!  You will be very pleased!!!!",
  "The restaurant is a tiny, clean place for very good pasta. It tastes delicious and very fresh! I loved the view over the street and the old church! Also the music played in the restaurant is pretty good! Keep up the good work!",
  "This is one of the best pasta places in Boston! If you're looking for North end of better definitely try them out. I've had almost everything on the menu and it's all great!",
  "My Friend and I went to Lillys Gourmet Pasta Express after evening movie expecting a traditional Italian setting. The atmosphere was light, bright, fresh and Hawaiian feel. Great pasta, tasty sauce with side salad for very reasonable price. Good service and fun place.",
  "Delicious food,tasty,great flavors,creamy pastas. You can build  your own pasta. Not expensive,small window seating area. First time here and will be back,my recommendation."
 ]
},{
 "name": "Ugi's Pizza",
 "address": "69 Heath St, Jamaica Plain, MA 02130, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "delicious",
  "cheap"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I visit this place a lot since I work nearby. I got to say their customer service is always good and they keep the place well kept constantly. Rates are reasonable and they serve generous portions.",
  "They make the best pizza the best steak and cheese I'll give it from 1 to 5. A 5 that is great they make everything fresh it's like ordering at the restaurant the best food in Boston",
  "The pizzas are delicious and everything is freshly cooked (which can increase wait times). The only problem is that it has weird timings. Call ahead!!",
  "Pizza sauce not the greatest.",
  "Good and cheap. One of the better greasy spoon pizza places around. It's take out only, cheese slices for two bucks."
 ]
},{
 "name": "Bucktown Chicken & Fish",
 "address": "1522 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Fried fish sandwiches, waffle fries, chicken and waffles, hushpuppies...Welcome to Boston!"
 ]
},{
 "name": "Chilacates Mission Hill",
 "address": "1482 A Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food",
  "unique",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great Mexican with a great selection of ingredients and well put together meals. I had a burrito with the verde pork and it was flavorful and delicious. They also have some great chips though I was a bit disappointed in the flavor of the salsa - it didn't have much spice to it. One thing I was extremely happy to see were the tamales on the menu and enjoyed the chicken tamale immensely - that is something that can be hard to find up north. Seating is limited but it is a great location for take out. Well worth your time and money to stop by.",
  "This is the best place for a quick, high quality meal. Here's why:\n1.) As reasonably priced as you'll find \n2.) Fantastic portion sizes \n3.) High quality food \n4.) Great menu options (last time I went was with two picky eaters. They both loved it!!)",
  "Very comparable to the tacos I enjoyed in Phoenix, AZ. I suppose reasonable prices for the Boston area. Paid a little over $6 for two tacos. Tried the mild salsa, it was good. Grilled chicken and pastor tacos = would do again.",
  "The food is amazing but don't expect to choose most of your ingredients.",
  "Great place, they take food very seriously and they won't ever lower their quality. They use not so common ingredients for their food that make the flavor unique and totally worth the prices. Given the fact that they just raised the prices recently after 5 YEARS, because they care more about the experience of having GREAT, HEALTHY AND ALL NATURAL FOOD, than the revenue. Keep in mind, that for you to have the best, they have pay premium too and it gets to a point where you refuse to bring down your quality just to save a few cents. \n\nAlso, reading the comments about the menu not being clear or prices not being listed...THEY ARE! They don't like their business to be misunderstood and they explain in all the menus the prices for \"upgrade\" meats, how much it will be extra for each dish you might get those meats with. There is nothing wrong with asking questions when in doubt, it is way better than assuming!😊"
 ]
},{
 "name": "Mike's Donuts",
 "address": "1524 Tremont St A, CROSSING, MA 02120, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "cheap"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Mike's is awesome locally owned donuts made on site.  Great New England Coffee.  Don't get bagels they don't bake those.  Get the donuts croissants pastries etc.!!!",
  "Super yummy. The Breakfast sandwiches are the best. I really recommend this place!",
  "Love Mikes. Good coffee and best donuts around. The shop is a bit dated which adds to the charm I suppose. Staff is always friendly.",
  "Great homemade donuts. Great breakfast sandwiches for cheap. Open early. Everyone says they have great coffee but I don't drink it. Super friendly staff, all around great local business.",
  "Super friendly staff. Great coffee and nice to sit outside and look at the beautiful church across the street!"
 ]
},{
 "name": "Boba Me",
 "address": "1520 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "drink",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I recently followed a -grammer who said this place is better than Kung Fu and just a notch shy of Gong Cha. That was enough to pique my interest, so on a spectacularly warm March day, we decided to walk to Boba Me in Mission Hill. The space is open and well-lit, and there are nice games like Jenga, etc. on the tables for you to play while sipping your boba. We got the black sugar boba, 25% and it was really tasty. The boba were a bit on the smaller side, and less gelatinous and more chewy, and just a tad sweet -- all in all, very yummy. The tea itself was also quite good, although light on the tea flavor and heavy on the molasses. I actually loved the smokey, spicy bite of the molasses but I could see it being a little bit much for people who are more used to traditional milk tea.\n\nWe also couldn't resist the flaming hot Cheetos crinkle cut fries. While I'm pretty sure they're just microwavable fries topped with crushed flaming hot Cheetos dust and sour cream and cheese, it was AMAZING. Slightly spicy, crunchy, greasy, and yummy; good portion size too.\n\nAll in all, we paid $10 for the two items and enjoyed ourselves a lovely game of Jenga. I'll be back!",
  "Nice staff, clean place but all the drinks are made with powders. I expected fresh fruit for the mango smoothie but it's all powder!!!!",
  "I’d be happy with any new boba tea place in the neighborhood but this is an excellent one. Friendly service, cute environment and amazing tea. Will be back!",
  "Not a lot of food but there's a wide variety of flavors of tea. Additional toppings such as boba, jelly, popping pearls, etc. add an additional 50 cents. They added Vietnamese (iced and hot) coffee, a Vietnamese type of sandwich, and flaming hot fries. They're soon adding ice cream (flavors(3): Vanilla, Ube, ???(Maybe chocolate or strawberry)). I love the black rose tea drink with additional lychee jelly. It's sweet and the lychee jelly has a very nice chew. Also, you can ask for a cup of any topping for 50 cents! It's only about 1/4 of the cup, though. Nice decorations and they have table games you can play with friends. Modern café-like aura.",
  "Great Mango and Black sugar milk tea. Limited flavour but great taste."
 ]
},{
 "name": "Forests & Parks Rg 2 Mss Division",
 "address": "38 New Heath St, Boston, MA 02130, USA",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  ""
 ]
},{
 "name": "Kevin W. Fitzgerald Park",
 "address": "145-157 St Alphonsus St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "educational"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The view is very enjoyable on the side of figuratively Mount Sinai.",
  "One of the few city dog parks is here. Although it's small, it's a nice place with shade you can take your pup.",
  "Great views from the top of the park. They have yoga, Tai chi and concerts in the summer. It's right above the Stop and Shop in Brigham Circle.",
  "Lovely little ark with educational signs.",
  "Great place to enjoy urban nature"
 ]
},{
 "name": "Mission Hill Community Garden",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Gibbons Playground",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Heath Square",
 "address": "Boston, MA 02130, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Mission Hill Playground",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Domino's Pizza",
 "address": "1400 Tremont St Space D, Boston, MA 02120, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "run",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This store is really well run for the huge amount of business is gets. Dominos pizza finality has also really improved and their app is excellent!",
  "They are good. If u like chicken",
  "Called at 9:02 and still haven’t gotten anything when the guy On the phone said 30-45 mins... I’m all set with this place! I don’t know how they still in business and THEY LEFT ME GOING TO BED HUNGRYYY!!!",
  "Ordered food online to cancel wait in store. Arrived ontime for pick up and still have to wait. They Gave my food to someone else. This Individual holding food while engaging in convo...... after sometime realised that wasnt his order. Then Gave it back. Dominoes then tried to serve it to me.  I'm good !",
  "Fast taste good. Always order the Handemade better then the toss! Great coupons and good food."
 ]
},{
 "name": "AK's Takeout & Delivery",
 "address": "1427 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The cheese is good, delicious in fact expert use of parmesan. Good price for size of pizza. Need better ordering system because I feel like big dum dum when I say what I ordered to the person behind the counter instead of saying a number or \"pick up for jake\".",
  "Great pizza... Fast service... Great prices! Best of all worlds",
  "Really good pizza. Moderate prizes only problem is there is no dine in option so take out or delivery is only available. Wings are average.",
  "I placed an order online on 3/29/20...ordered was processed on my credit card and was told my order would be ready between 12 and 12:15...When I went to pick up my food the place was closed, but on their site stated they were up...So my card charged, no food and no money back....if your not open for business then you say so on your website. If I could give a zero rating I would.",
  "Omg. I thought i was going to get shot! Bad neighborhood. Enter with caution and protection. Great food tho. My suggestion, delivery."
 ]
},{
 "name": "Ashur Restaurant",
 "address": "291 Roxbury St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The first time we visited the place was great. The food was amazing and the portions were huge. The service was great and welcoming. Will visit again for sure.",
  "Not sure whether the picture is good at showing how big the plate is, but it's really huuuuuuge! It's tasty, just don't forget to add salt and pepper to the meat. There's limited table service, you make your order at their counter and pay at the end at the counter as well, but they do bring the food to your table, which is totally fine for me.",
  "Great neighborhood spot to grab some authentic Somali food. I’ve been here a couple of times and always have friendly interactions with the staff. They also show soccer games which makes a fun atmosphere on weekends",
  "It was the most beautiful restaurants I've been too. It got everything i wanted and added with even more. Abdullah was the guy who even helped me a lot more. There is no roaches at all those reviews were all lies. This is worth 5 star easily.",
  "Delicious food, healthy portions, and really friendly staff."
 ]
},{
 "name": "Dunkin'",
 "address": "1443 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Their service is so quick and they are very respectful",
  "My coffee is perfectly made. Enjoy the crew.",
  "Clean and recently updated, nothing negative to say about this location. Very convenient to the Orange Line at Roxbury Crossing.",
  "Awesome staff, great service, delicious food. Couldn't ask for a better local spot. Very convenient and quick.",
  "The worst customer service ever. They had an attitude for asking a question and for a manager."
 ]
},{
 "name": "Dahabshiil",
 "address": "1420 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Ascia Kitchen + Cafe",
 "address": "100 Malcolm X Blvd, Roxbury, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Common Word Cafe",
 "address": "100 Malcolm X Blvd, Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Nachlo Mexican & Pakistani Cuisine",
 "address": "1443 Tremont St, Roxbury, MA 02120, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "delicious",
  "creative",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Update: the quality has deteriorated over the time and it’s no more the place I described previously as below but still it’s worth try there once.\nBest and reasonable North Indian food in nearby area. The taste is good and they prepare many food fresh like bread and Kababs infront of you. Since many food is prepared fresh, there would be some waiting time. I vote like second best Indian/Pakistan cuisine at Boston. The proprietor 8s very friendly and they take your feedback too. Very reasonable price and nicely located near by public transport. If you want to try Indian/Pakistani food at Boston, today's date this is the best according to their location, quality, quantity and price.",
  "Excellent authentic Pakistani food in a very casual setting. Mostly take out, although there's some limited seating. The biryani was great and the keema burrito was good as well, will be back to try more options.",
  "This is the best quesadilla I've had in my life. I got the lamb",
  "I can’t get enough Nachlo! The food is amazingly delicious and the employees are some of the most kind and caring people I’ve ever met. Walking in, you immediately feel like you’re at home. Everyone is incredibly kind and welcoming and then you get to eat the tastiest food on top of that! Everything on the menu is amazing! Chicken seekh kabobs, biriyani, chicken tikka are all must haves!Always be sure to ask if they have anything off menu for the day (they usually have at least one secret item!) and don’t forget to get creative by blending Mexican and Pakistani foods! Butter chicken burrito, burrito wrapped in naan, seekh kabob naan wraps, etc... the options are deliciously endless!!!",
  "I have been looking forward to trying this place since I walked by and saw the concept before they opened - and now that I have tried it I can say for sure that it was worth the wait! The inside is inviting and has a few different spots to sit (with more seating downstairs). The food was what I really appreciated though, it felt like everyone working there put their own flair and heart into the food. At first glance, the food doesn't appear to be \"fusion\" so much as either Pakistani or Mexican (with the different cuisines having their own respective sides of the menu), but what really brought them both together were the homemade sauces. I tried the Chile de Arbol (their spiciest sauce offering) on both the quesadilla and the Chapli Kabab and it was delicious with everything they offered. I also got the Chicken Curry which was well spiced and expertly prepared. Those three plates were definitely more than enough for two people, but I'm glad I was able to try them all.\nOverall, the staff was inviting and the food delicious, leaving me excited to come back as soon as I can! Can't wait to recommend this new restaurant to my friends in the area as well!"
 ]
},{
 "name": "Butterfly Falafel",
 "address": "1420 Tremont St, Boston, MA 02120, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I walk past this place every day on my way to work.  The sign out front says \"coffee\" in big bold letters, but the one time I went in to get a coffee they told me they were out of coffee.\n\nFor the last 3 months it has been closed.  The sign out front says \"closed for renovations\", but there is no sign that any renovations are taking place. Since they are a coffee place that doesn't have coffee, and they are closed for renovations that aren't happening, I suspect that the business is a front for something else.",
  "Food is good has a restroom, but no Air conditioning in the dining area.",
  "Price are very reasonable and very clean. Reminds me of other coffee shop but only better.",
  "this place is awesome. the falafel is light and crispy, the chicken is well seasoned, and the staff are friendly. my favorites are the sweet mint and ginger teas they make.  you wouldn't expect a place like this to be so good, being attached to the T station, but don't sleep on it!",
  "Great lamb and rice plate at a good price. The chef who makes all the food can cook!"
 ]
},{
 "name": "Centre Place Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Linwood Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "John Eliot Square Urban Wild",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Highland Park 400 Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Cedar Street Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Allan Crite Community Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Kittredge Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Highland Avenue Community Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "King Street Play Area",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Margaret Wright Memorial Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Alvah Kittredge Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Jeep Jones Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Highland Park",
 "address": "Roxbury, Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "St Monica's Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Dunkin'",
 "address": "2493 Washington St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "It's a Dunkin, so expect the typical Dunkin products. Very clean and comfortable with indoor and outdoor seating, parking and bike racks as well as power outlets.\n\nStaff are friendly and helpful and it's not usually too busy.",
  "Whats not to love about this place? It has seating available, outlets to charge your phone or any device and they play great music. I go here often for writing.",
  "Very slow, more conversation with teammates.  Waited to give my order for about 2 minutes with no one ahead of me.   Only go there because of location",
  "I love this place. Great workers, clean and never get my order wrong. 5 *",
  "I enjoyed the experience of this Dunkin Donuts. Service was fast, the staff was amazing. I will be going back to this Dunkin Donuts."
 ]
},{
 "name": "Justice Edward O. Gourdin Veterans Memorial Park",
 "address": "2405 Washington St, Boston, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  ""
 ]
},{
 "name": "Roxbury Heritage State Park",
 "address": "183 Roxbury St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "jog",
  "family"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "What a wonderful Museum of Black Art and History.  This is a must see place.",
  "Nice area...Historical value",
  "Beautiful place to walk and relax. Great place for a relaxing jog. If you like the outdoorsy atmosphere then you'll love this place because it has so many trees and a nice path. It's also a nice place to possibly catch a glance of wild life. They have restrooms along the path, and they are pretty well kept. Only bad thing is that the creek is drying up, but still a pretty place.",
  "Went there for a family gathering and i had received a nice tour of the house informational",
  "Pretty dilapidated."
 ]
},{
 "name": "John Eliot Square",
 "address": "42 Centre St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "peaceful",
  "historic",
  "peaceful",
  "history"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Rosies place went for cook out they also have other worth while events during the year and help people",
  "My grandson party was great so we're tyke people who rented the hall",
  "A peaceful place to sit right in front of one of the most historic churches in the country, which was recently renovated.",
  "Absolutely love this beautiful area peaceful neighborhood .....quiet street and close to Beautiful Mosque, and Reggie Lewis center,  MBTA Transit,  It's truly a historical area The 1st White Church of Roxbury is located in this area, also A church with a rich history it's said The 1st Church  the slaves attended here in Massachusetts... also in this area is the historical Dudley Station....You can actually see a mural of Roxbury's Greats Marcus Garvey, Malcolm X  and Other greats whom have history in this area .The mural is  located on the side of the a famous Roxbury restaurant The Golden Slipper.  Great area Great History.",
  "Marshall's Hair Salon Been going there for years."
 ]
},{
 "name": "First Church In Roxbury",
 "address": "10 Putnam St, Boston, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "history"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Such an amazing organization doing great things for the many communities of Boston",
  "One of the oldest religious institutions in the country. Outstanding history of  the  Church and it’s individual members contributions to the history and success of the nation. Ensure that you visit this site  and  it’s history through Puritanism to  Revolution to Unitarianism to Unitarian Universalism to the mission of the Unitarian Universalist Urban Ministry.",
  "Cultural landmark which is a nexus of community and civic/moral engagement",
  "Very nice church",
  ""
 ]
},{
 "name": "Lambert Avenue Playground",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Rockledge Street Urban Wild",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Madison Park Village CG",
 "address": "Boston, MA 02120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Peking House",
 "address": "160 Dudley St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Enjoyable food & service, great for those \"leaving work & I don't feel like cooking when I get home\" days. Healthy portions & service with a smile.",
  "Peter's place is the spot for take out Chinese food. Fast, friendly and consistently good. He always gives back to the community where he has served so let's   keep the support flowing.",
  "The food is very good, the veggies are fresh and crisp. The establishment and staff is always fast, clean and polite. They only take cash and the menu selection is stream lined so it's not as large as other Chinese menus mainly the favorites, just so you know.",
  "I've enjoyed great food from here for years. Say hello to Peter if you're at the Peking House.",
  "The fact that Peking House is located near Dudley Station, doesn't take away from the taste of the food. I'm all about my basics like boneless ribs, chicken fingers, crab rangoon, fried rice and I've not been disappointed. Of course, the rest of the menu won't be lacking. The owner Peter never fails to have a smile and a hi ready."
 ]
},{
 "name": "Simon's Seafood Market & Take-Out",
 "address": "154 Dudley St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I am so glad that Simon's seafood is still in the neighborhood! His wife cooks the food and very good. Portions are more than enough and the fish is fresh.",
  "Love them,yumm yumm and the fried lobster even better!!!love the jumbo shrimp...",
  "I’ve been going to Simmons, since I, was a kid ..when they was on Washington st..lol they are more, black then us...after more than 35yrs I, love them...💋❤️💋❤️💋❤️",
  "The food is always fresh.  I recommend this place to everyone.  I love it here!!! 🍤🍣",
  "fresh fish, clean grease, great taste."
 ]
},{
 "name": "Yummy Yummy",
 "address": "2360 Washington St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "family",
  "food",
  "run",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This was the worst food me and my family experienced they charged us almost 50 dollars for bad food. We had to order from somewhere else.Please don't order from them. This happened days ago.!!!!!",
  "Great Food, Great price, in the heart of Dudley always busy ..",
  "Food and service is good",
  "I don't like the food nor the decor of this place. This place serves food that the employees don't eat! This is a place you go to if you're hungry and only have $4 in your pocket. Otherwise run far away from this place immediately.",
  "Great meals, great price, service not bad."
 ]
},{
 "name": "Bintimani Restaurant",
 "address": "1127 Harrison Ave, Boston, MA 02119, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "experience",
  "food",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "delicious and fantastically prepared food. Great, friendly service, and quality experience! i'll definitely be coming back",
  "I had cassava leaves over there that I ate with chikwangue I had at home. But the next day I still had leftovers so eventually eat it with rice, really good, really spicy too though! It’s close to the Congolese way, there’s peanut butter in it.",
  "This place was unlike any place I’ve ever been. Go for the experience. The food, I didn’t love, but then I have zero experience with west African eating. \nThe ‘plaza’ it is in is an experience in itself. It reminded me of some very out-of-the-way places I’ve been to in the Caribbean. Then the ‘restaurant’ ... it’s a cluttered room no more than 10x10 with this guy lounging in an easy chair and talking on the phone. He was very chill and polite. He showed me into the kitchen which was ... I don’t know. There were four metal cafeteria serving trays. Cassava leaf, cray cray, and two rice. He gave me some of each. They both have chunks of chicken full of bits of bone, so eat carefully. He asked if I wanted to eat here. I didn’t see any place to do that, so I paid (do I need to say bring cash?), and went on my way. \nIt was worth going for the experience. I can’t really say if the food was good, having nothing to compare it to.  I’m glad I went, but I won’t go again-especially because I don’t live in Boston.",
  "I’ve never been anywhere like this! Smells horrible and it’s very dirty.",
  "Sabbe talk krio? cam to Portland, Maine. I go be de best customer. I stayed at Hotel Bintimani on Lumley Beach.  I called. No answer. Disconnected. I would like foo-foo shipped frozen to me every day or week."
 ]
},{
 "name": "Suya Joint Restaurant",
 "address": "185 Dudley St, Boston, MA 02119, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food",
  "walk",
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Went in here for the first time and it looked a really nice place.  The staff was friendly but the service was a bit slow.  It was a busy night. However, the food came at a reasonable time.  The food was really good. Portion sizes are reasonable.  \nHowever when paying, there is already a 15% service charge already included in your total.  And then the option to tip comes up too.  So you're basically tipping twice.  So check with your server before paying to be sure.",
  "I walked in and there was no waiter readily available. I waited 2 minutes before being waited on. The manager saw me and didn't even acknowledge my presence. I ordered moi moi and plantain ($7 menu item), which totaled to $8.54 after a hefty 15% service tax. The food was not good. The moi moi tasted like rubber. The waiter, nor manager did not even offer me water until I was done with my meal and requested the check. They offered other patrons water as soon as they were seated. The food is mainly Nigerian, so SUYA isn't about \"African cuisine\".\n\nOverall, poor service, poor quality food, expensive food, and poor/little variety. It's a major major no go!",
  "Ordered food online at close to 7pm... they close at 8pm... 4 DoorDash drivers went there in separate occasions to pick my food up and the food was not... Never got it and the restaurant eventually cancelled the order after I waited for over an hour. Their services is probably the worst in Massachusetts but good food though.",
  "So its after 9 PM on a Thursday.  My friend and I are hungry and  places are starting to close. We walk in and their dining room is closed but they offer to do a togo order. After we explain that our hotel is far away and we have no place to eat they let us sit at the bar and order. \n\nThe food was delicious. I have never had any of these stew dishes before. The peanut stew was a little sweet. It reminded me of peanut butter cookies. Very tasty. The vegetable stew was a little spicy and had a strong seafood flavor. Again very good. \n\nI don't know of I will get to go back. We are not local. But if you need an inviting welcoming place to get a tasty meal definitely check out Suya.",
  "Love this West African (mostly Nigerian) restaurant. Food is great, and their meat patties make for a nice snack. Friendly staff, who are eager to please, and good conversationalists to boot. If you love African food and are in the Roxbury area, definitely check them out."
 ]
},{
 "name": "Dudley Square Grille",
 "address": "150 Dudley St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 2.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Food was  Decent N walking distance to my house and bus station but they closed the doors one night in November 2019 and never opened bk up🤔Wtf.. I loved their pizza.. No warning or Explanation",
  "I ordered chicken. I was absolutely disgusting.  It was freezer burn and it stunk soooo bad. I will never order again. When i called all they offered was a discount. Horrible customer service.",
  "The way I was treated when I went there, it was the best! Good food too!",
  "The food is decent. The man taking food orders is very rude and his English is horrible. Language barriers usually don’t bother me BUT in this case it does. The man gets upset because you can’t understand him when he talking entirely too fast smh. Where are the black owned fast food restaurants?",
  "Delivery was quick but oh my God this chicken ziti alfredo tastes so disgusting I can't even eat it I had ordered this from them three years ago and it was so good never again would I order that meal in particular"
 ]
},{
 "name": "Joe's Famous Steak Subs",
 "address": "140 Dudley St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great Steak and Cheese Subs. Famous Boston Roxbury Steak and Cheese Subs! All there Subs all delicious. If YOU haven't been. TRY EM' OUT!",
  "Best steak and cheese in Boston! Clean environment and friendly staff! Its been around since i was a little girl. Am now 42..",
  "Awesome steak and cheese.  The food is always good. Friendly staff.",
  "The subs were unbelievably delicious, wow. They were very hot and fresh and pretty big also, enough that I took my leftover half home. On top of it all the staff is very friendly and courteous. The only down side is the location with people loitering outside of the establishment.",
  "You will never get a better steak bomb than Joe's........"
 ]
},{
 "name": "Arizona BBQ",
 "address": "2360 Washington St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great food. Good customer service.",
  "Good food.  Super steak bomb was awesome.  Place was remodeled.  Looking clean.",
  "The food is fantastic and thay have good service",
  "They know what they are doing. Great service as well and I appreciated the conversations I had with everyone that worked there. Definitely stop by if you are ever in this Town.",
  "I an a new customer. My experiences have been good. I only order pizza & the kids love the chicken fingers."
 ]
},{
 "name": "Silver Slipper Restaurant",
 "address": "2387 Washington St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food",
  "food",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "It was my 1st time there in I loved the experience. Very friendly staff and the food was good. I will be going back multiple times.../",
  "Just got scrambled eggs and bacon 🥓... Decent! Left satisfied....\nThe service fell short on several levels but I wasn't expecting Four Seasons brunch either.",
  "Wonderful old style restaurant. Great food and so much nostalgia.  The only thing missing was the old overhead orange line that used to go through Dudley Square!",
  "I wish i had an option to give some additional stars\nFantastic service and food to die for. A great dining experience, Highly recommended.\nGreat friendly service. I travel a long way to come here every couple of months.",
  "I don't know the brand of hot sausage they use 🤔 but it's for be hooked. I be feining for it!!!"
 ]
},{
 "name": "Fasika Cafe",
 "address": "51 Roxbury St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food",
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Absolutely lovely. \n\nI don't normally like Anjeero, but I loved theirs. I got the cafe special the first time, and it made me want to try everything else on the menu. \n\nFriendly, warm environment . . . A bit of East African cuisine and hospitality just around the corner.\n\nAbsolutely recommend.",
  "The food is delicious. They also can adjust the dish based on food allergies. Great service and the bread is made on site. The tea they serve is a great compliment to the meal.",
  "Delicious Ethiopian food..! They take a while to serve the food, but, you really won’t mind the delay as the food is cooked to order, just could be a little cleaner atmosphere",
  "If you’re ever around Dudley Square, miserable, stuck all day in a confined room with strangers for Jury Duty, then escape to this heavenly restaurant, Fasika. They have delicious coffee, espresso shots, macchiato, and most importantly, vegetarian meal options. It’s a clean, nicely decorative restaurant with friendly staff. It was my first time ever trying Ethiopian food and I have no regrets. Highly recommend it!!",
  "Delicious food. The got the dinner special and it was amazing! Just the right amount of kick 🎉🎉"
 ]
},{
 "name": "ROYAL FRIED CHICKEN (rfcri.com)",
 "address": "2360 Washington St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Just wish they would give me brown lettuce on my burgers. Other then that we good",
  "Good fried chicken & fish at a great price.",
  "Very accommodating, food is good",
  "The chicken is good",
  "Nice staff"
 ]
},{
 "name": "Golden Krust Caribbean Restaurant",
 "address": "41 Warren St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "family",
  "food",
  "walk",
  "drink",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Stopped in here in November when they first opened and haven't stopped coming..the food is soo delicious and fresh..everyone working in there is soo nice and pleasant and welcoming..they make you feel like family, always greeting you with a smile when you come in..I'm so glad they came to Dudley station, WELCOME.. and I continue to pray for Golden Krust to thrive and prosper..also check out my photos that I posted of their fabulous delicious, mouth watering food",
  "Yesterday was our first time we came to that good restaurant. But It is definitely not the last. We had great time with the good service, with the finest  cuisine and booze and with the modest cost. We will definitely come back again.",
  "I do not come to this area often but when i do i always stop in, hungry or not. First, the food is great, the oxtails are tender and juicy and meat portions are better than most other places. Second,  unlike all other Caribbean restaurants in the area where the customer service is nonexistent, the actually have some. They say hello when you walk in the door, don't seemed annoyed because they are at work. Very friendly to say the least. And don't leave with out a pack of patties. They have like a few different kinds but I like the jerk chicken and the shrimp. I would like to take half a star away because of the limited drink selection. 4 and half stars.",
  "I usually come in this restaurant during breakfast time and the customer service is exceptional. But yesterday I decided to come during lunch and it was the best only because there was a young man (employer)arguing with a young lady. I think that is very unprofessional. You have workers coming from the back to grab food and eating on the line. Using profanity while on the line in front of customers. I truely believe that this can be a spectacular place with the right people....maybe it time to make a change with the employees to get more customers.",
  "Excellent as always!"
 ]
},{
 "name": "Mario's Sub & Salads",
 "address": "28 Warren St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "cheap",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I was looking for a salad I found this place, I had a delicious salad. I ordered a grilled chicken salad and it was the best grilled chicken salad that I ever ate. It was cheap and very flavored and good size, definitely becoming my fav place around.",
  "Best in the biz ",
  "ABSOLUTELY THEE BEST SALAD, CHICKEN FINGER PLATE I HAVE EVER HAD!! BEST IN THE CITY!!",
  "Best breakfast in the morning just right amount of food",
  "cheaper and better than Joe's,  you get the feeling the appreciate your biz"
 ]
},{
 "name": "Khadija's Express cafe",
 "address": "1127 Harrison Ave, Roxbury, MA 02119, USA",
 "avg_visitor_review": 3.6666666666666665,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great restaurant with authentic taste and vibes. This is the spot the local Somalis go to eat GOOD FOOD first and foremost. This is the epitome of mom and pop shop. All food is made to order fresh. Oh and did I mention that they have the best Halwa (Somali dessert treat) rivaling the infamous Halwa Kismayo from Minnesota.",
  "Very bad food, bad customer service and not clean",
  ""
 ]
},{
 "name": "Dudley Cafe",
 "address": "15 Warren St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "peaceful",
  "experience",
  "food",
  "run",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This cafe has my very favorite iced coffee and it's just as good late in the day as it is in the morning. Also, they sell an incredible bean pie in the cooler. It's a sweet pie and it's delicious. Good for sharing with a couple of friends, great with coffee.",
  "Friendly vibe, excellent macchiato.  Good place for an afternoon break. Spacious and bright.",
  "Excellent food and service.   Soothing music pleasant place to bring your laptop and relax.  Surprisingly peaceful experience!",
  "Unprofessional. They don't answer the phone during business hours, don't update their web pages when business hours change, and don't take customer feedback. Idiots run this place.",
  "This is such a cool place! I love the vibe. Plus I got a chai tea with almond milk and a Dudley's favorite sandwich- both were delicious and fresh! I can't wait to come back"
 ]
},{
 "name": "Express Cafe",
 "address": "1127 Harrison Ave, Boston, MA 02119, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "cheap",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I had a late lunch today and it was fantastic. They offer a plate dubbed \"The Federation\". I won't spoil it but it is my favorite. The spiced tea is one that would bring the Maharajah to tears. Grab a cup anytime, it will bring life to you.",
  "The go to place for authentic Somali food. If you like lots of flavor and local, ethnic restaurants, go to Deria. ",
  "The most authentic Somali food I have ever had...and their Halwa is the best...even better than Halwa Khismayo",
  "The food is ok--not great, but good enough and its cheap. My issue with this place is the lack of basic professionalism. The staff are cold, slow, and prone to ignoring customers. Their posted business hours are incorrect. As others have noted, there's also issues with how well the place is maintained. The options for Somali food in Boston are limited so this place has a captive customer base to an extent, but I personally will not be going back. I don't need to spend my money at a place where they feel totally comfortable ignoring you when you're waiting at the counter to pay.",
  "ONE OF THE BEST PLACES TO GET GREAT FOOD AROUND ROXBURY MA 02119"
 ]
},{
 "name": "JazzUrbane Cafe",
 "address": "2300 Washington St, Roxbury, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Madison Park High",
 "address": "2 Madison Park Ct, Boston, MA 02120, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "family",
  "academic"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Ive lived in this area foe most of my life. Went to school at Boston Tech when we moved inside this building. Great memories for me. Great friends that are considered family. Go Tigers",
  "Only Vocational High School in Boston. Great place to get both career and academic support.",
  "There was a lot of different places where students can excel in what they chose to study in.",
  "Huge turf field, With football/Soccer field and running track up top, a baseball and softball diamond on the bottom level. Street parking only and that limited",
  "I love this"
 ]
},{
 "name": "Dudley Square Plaza",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Boys Club Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "St. James Street Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Boston Evening Academy Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Alpine Street Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "P & R Restaurant",
 "address": "208 Dudley St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I like to go with friends to this restaurant with my warmest recommendations. I  go to this restaurant often. I get very good feedback from my friends. The the cooking is appetizing and the stuff is welcoming and cooperative. Every time  we eat in this place we pass a delightful time.  I recommend this place with pleasure.",
  "So P&R in mattapan is great.... but the one on Dudley street need to fire there cook they got over there. I order large curry goat and rice and peas. The rice is nasty the got is rubbery the cabbage is plain. No seasoning on the food only thing good there is ice cream.",
  "This restaurant is my favorite. I eat in plenty of restaurants but here I keep coming back again and again. The team is very helpful and the food they place on your table is so flavorful. I never decline to have a good dinner in this place. I highly recommend this place.",
  "I meet friends in this nice place from time to time! This is my favorite restaurant to dine.  I visit this spot at least once a month. The cooking is excellent, the workers are courteous and the prices are fair. I like going in this place over a tasty supper.",
  "Food is amazing! I love the curry goat yellow rice mac and cheese cabbage and sweet plantain. So good!"
 ]
},{
 "name": "Maxine's On Saint James",
 "address": "304 Dudley St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  ".fried boneless pork chops,  collard greens,  and red beans and rice. first time going here,  the pork chops were pretty good,  small side portions. I rate 3 stars for the portions and the price.  portions did not match the price.  cold and nutmegged flavored sweet potatoes macaroni and cheese edible. 3 stars from my girl. I give 4 stars for portions. I will be returning for another meal. although I did appreciate the love given. good attitudes,  nice people. I felt the \"soul\" attitudes and environment. I'll be back.",
  "Great food and service. I got the smothered chicken wings with mac and cheese, and smashed potatoes. I am very picky about my mac and cheese and I really like it. The chicken wings with gravy were delicious. I would definitely come back and recommend it to anyone in the area.",
  "I tried this place once with a friend and I am obsessed ever since. I liked the excellent ambience and yummy dishes and beverages. They never disappoint.",
  "I had a fried haddock dinner with collard greens and two sides of baked macaroni. The best hands down, I love them. They are very friendly",
  "Yo' let me tell you about my favorite Soul Food Restaurant , above and beyond the best ,Love everything the service is outstanding very caring about getting your order right ,I live way in Sharon and I have no problem with traveling to Maxines to get the best Soul Food around  . Thanks so much for keeping the Soul Food Alive. \"Amen"
 ]
},{
 "name": "Stop & Taste Pizza",
 "address": "239 Dudley St #2503, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I ordered delivery in advance because I had a large order. They called 1 hour before my delivery time to confirm and the food arrived 10 minutes early.  Great service! Everything was delicious and everyone at my office loved it. We recommend the BBQ chicken, spinach pie, and Greek pizzas. My only complaint is they forgot plates and napkins, but everything else was perfect.",
  "Good food fast",
  "The pizza was very good. Good service. It is suitable for children. Will come back soon.",
  "Ordered food from here first time yesterday omg was it Delicious,yes it was omg the buffalo chicken pizza was so good that I even ate a piece and I never do,the Alfredo fries bomb just wish they had put the sauce over them with extra cheese and the burgers was on point the sausage and pepperoni pizza was so good my favorite and the bacon chicken ranch pizza was good also I don’t taste that one lol a few items missing like blue cheese and napkins and plates but everything Else on point I will recommend I will be ordering from them again soon thank you. Be safe we appreciate you God bless xo🙏🏽💜🙏🏽💛",
  "The food is great.today 8/18/2017 i buy more food everything was hot and taste great only cheese cake was to small for the price."
 ]
},{
 "name": "El Mondonguito",
 "address": "221 Dudley St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "delicious",
  "food",
  "family",
  "food",
  "delicious",
  "family",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I've come here plenty times and love it. The food is authentic & delicious. The atmosphere is very nice. You can either sit, drink a beer & relax or listen to music & dance. The place is a bit small but it doesn't bother me. The only downside is sometimes certain foods weren't available. There was one time, I wanted morcilla. There was none available. I had drove from Roxbury to Boston just for it. The guy felt bad & didn't want to disappoint so he quickly made us some. Either way, there's moriclla (as I've previously mentioned) chicharrones, platanos fritos, arroz con gandules, yucca, pernil, etc. It's a lovely place & the decorations are nice as well.",
  "I arrive at this superb place once a month  as I enjoy the good air that is outline this restaurant. The team is awfuly attentive and professional. The service is exceptionally quick. Also, the food they prepare is outstanding. I visited often and I was always happy. The payment is modest. I highly suggest this place to my friends and family.",
  "I'm from Springfield, Massachusetts & this is my 1st time being at \"El Mondonguito\" & the service was great, food was delicious, place absolutely clean, very professional & very polite owners & customers...atmosphere here is exactly like being with family, I will definitely come back again. Thankyou very much, can't wait 2 come back with my family & friends...worth the trip!",
  "Great place  and food. If you like Latinos song this is the place. Small but comfortable. Make you feel like home!",
  "It's ok. Just go for drinks and old music. These guy dont update there music the music for old timers nothing any female can dance good to"
 ]
},{
 "name": "Vasquez Pizza And Spanish Food",
 "address": "258 Dudley St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "cheap",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I celebrated my nomination yesterday in this great restaurant. happy to tell that we enjoyed a pleasant evening and the restaurant was absolutely one of the reasons for the strong celebration. The team  contributed in a gorgeous style, the cuisine was tasty and my guests were so  cheerful. We shall definitely visit again for more celebrations. Thank you very much.",
  "Genuine Latino food for a very cheap price also note Pizza is not sold there the name just stuck with the location",
  "Very good I go there every chance I can",
  "Delicious, generous portions & good prices!",
  "Excellent food! Everything I have tried is delicious!"
 ]
},{
 "name": "Haley House Bakery Café",
 "address": "12 Dade St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "They are coming back stronger! I give them 5 stars because there is no place in the community like this. A new delicious menu with the same old love. Try the Melnea Cass. Thank me later",
  "I was here a month ago and it was great experience being there. Love the vibe of Sweetness here. Pancakes are the best. Fantastic Food with Delicious Drinks. Lovely staff and awesome service.",
  "Love it use to go after school (I went to City on a Hill) and the cookies are bomb. The BBQ Chicken quesadilla is amazing",
  "Fell in love with this place! They give big portions of food for the price and the food is really great. Plus, they operate on an honorable mission to help rehabilitate formerly incarcerated people in the Boston area. Great place, can't wait to visit in the warmer months when the garden is up and running. \n\nThe jerk chicken is superb and the french toast is super yummy for brunch.",
  "Simplified menu,  but same great service and quality"
 ]
},{
 "name": "Phyllis Wheatley/Warren Place Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Mount Pleasant Play Area",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Orchard Park",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Winthrop Street Community Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Melnea Cass Boulevard",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Orchard Park Maintenance",
 "address": "20 Prescott St, Roxbury, MA 02119, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Treat them how they treat you",
  "",
  "",
  "",
  ""
 ]
},{
 "name": "Dudley Town Common",
 "address": "383 Dudley St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Nice place to chill for a bit, visit with a friend while having a coffee, or hang out and read or play on your portable device.",
  "Needed maintaining",
  "That's where I met the love of my life❤",
  "Convenience and price",
  "Joe's famous steak and cheese thumbs up"
 ]
},{
 "name": "Highland Park",
 "address": "980 Harrison Ave, Boston, MA 02119, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "This is a nice well kept park with what looked like newly renovated walkways and benches when i visited. The tower's cool and you can see the Pru and stuff in the background.",
  "Google sent me to an area without anything like a park. It has probably been demolished and building were built instead?",
  "Very hilly grass area with a small glimpse of the Boston skyline.  It's mostly a dog park in the evenings but poorly lit after dark. I wouldn't recommend being in the park after 10pm. ",
  "I love this park, it reminds me of my childhood.  Back then it was called fort hill park.",
  "Great park with a beutiful view in a nice neighborhood"
 ]
},{
 "name": "Eustis Street Playground",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Jardin De La Amistad Community Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "The Hen House Wings 'n Waffles",
 "address": "1033 Massachusetts Ave, Boston, MA 02118, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "free",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "It was a good hole in the wall chicken spot. We should have gotten the chicken and waffles. The chicken was really good but you could tell it would be so great with syrup. Next time. Also the popcorn shrimp seemed to have turned for the worse. Lastly on our to go chicken the sauce was on the side. We were hoping it would be pre tossed as it was described on the website. All in all it was good and I will go back for the chicken and waffles that they are known for.",
  "This was my second time here. It's just what you need for a cheat day or rainy day.\nI got two of the Chicken and waffles. One with banana waffles and wings. The other buttermilk with crispy chicken tenders. They also have sides, and other meals. As well as combos. I will be going back. They stay open late, so tip if you can. Here is a menu:",
  "I love this place! Today is their last day! Get your free plate before 11!",
  "So delicious. The chicken tender were as juicy as they said and both the buttermilk and corn waffles were on point!",
  "Food always great got banana waffles and chicken tenders and maple syrup. My only discrepancy is if they could make 2 waffles instead of just the one. They deliver but management don't come to my area. Definitely recommend go for waffles and chicken been great the whole time they been in business."
 ]
},{
 "name": "Boston Salads & Prepared Foods",
 "address": "26-32 Chesterton St, Boston, MA 02119, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Best Deli Salads and prepared foods available.",
  "Very friendly and quick service very small place right turned for a semi getting here and then blindside back into a small lot .no over night parking a lot of homeless running around  not safe ......",
  "Nice very fast",
  "Their fruit ambrosia is amazing..!!\nI literally wait for the store to get more..",
  "Boston salads is good,good food"
 ]
},{
 "name": "McDonald's",
 "address": "870 Massachusetts Ave, Boston, MA 02118, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Good MacDonald's at a busy crossroads. You CAN park in the spaces near Southampton St. by the grass & stone wall. Nice staff who are very patient. Bilingual Kiosks (FYI Custom all-day breakfast: Hotcakes and BACON!🥞🥓) and table delivery.",
  "Always fresh and they give you your money's worth even if it is a little high.Quaint little spot with fantastic food. I’m a big spicy person, and this place won’t let you down. Great for people who like it mild as well. Would definitely recommend",
  "This is a rough place. I wouldn't recommend going with children. I wondered why they had a security guard in there. Then a fight broke out and I had my answer. The food and employees were great.",
  "After a number of mess ups my order was right the store looks great all the time it could use my cleaning expertise over night, I have applied to no avail I'm hoping it's not because of my opinions on here that would be unlawful. Honestly it's the time you go there to get the great customer service and if you do have an allergy they will make it right. Added to a nice little alcove where I always see children's TV shows on.\nAll and all it has its kinks but it's still my home store hope your experience is always wonder full 😉",
  "Ordered Double quarter pounder and it was rare and cold, how can you advertise fresh beef to me and serve it undercooked and cold? Worst. McDonald’s. Ever!"
 ]
},{
 "name": "New Market Pizza",
 "address": "850 Massachusetts Ave #2604, Boston, MA 02118, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "run",
  "food",
  "delicious",
  "food",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Solid crust: lightly crispy outside with soft, chewy inside. Delivery included plates and napkins without even asking. Reasonably priced. And it tasted great! Would definitely return.",
  "Stared at this place all week from my hotel. Really craved local pie. Was NOT disappointed. Little lady that ran it was sweet and slices HUGE!! So much I didn’t finish. Great little place despite the homeless walking around. Go!! Eat!!! Enjoy!!",
  "Good pizzas and subs for a good price. Well located. Only down side is that the place is in between two shelters you must expect people to ask you for money or food. Unfortunately you might run into people using drugs too.",
  "Staff and owners were amazing and so accommodating. So cool and easy to talk to and reminded me of being back home. The food is super delicious and can’t go wrong with their Isle Di Capri pizza!!!",
  "Huge, delicious, thin slices. All you need is one slice, I promise.....it's sooo good!"
 ]
},{
 "name": "Liberty Diner",
 "address": "1003 Massachusetts Ave, Boston, MA 02118, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "free",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This diner was great. The sign outside is so small-if you blink, you'll miss it. Once you get inside you're free to sit where you please and the menus are above the bar area. The menu is short and simple and to the point has all the basics. Our server was was okay but she got our order in and out. The food was great, we especially enjoyed the chicken strips. The ambiance is very cozy and \"mom and pop\"ish. Overall, really enjoyed.",
  "Absolutely the atmosphere I was looking for. Very local, multicultural feel. The menu was exactly what you would expect from a local dinner, and the food was excellent. I went simple and got a cheeseburger and fries, but the burger was delicious, and the fries weren't greasy. The cost for my entire meal and tip was $12. I'd absolutely recommend this place for a comfortable, quick, familiar bite to eat.",
  "Great place to get lunch and a nice cold beer, been going there for many many years.",
  "Old fashioned trailer style Diner. Sit at the bar or grab a table. Opens early and closes late. Plenty of breakfast options served all day. Must try the Haddock plate.",
  "I've been going to the Liberty Diner for a long time Bobby and his mom are great people"
 ]
},{
 "name": "The Spaht Food Truck",
 "address": "155 Southampton St, Boston, MA 02118, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "delicious",
  "food",
  "affordable",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I was so happy when I was told about this food truck! \n\nThis is like the perfect food after a night out. \n\nThe food is amazingly delicious! That sandwich with the special sauce it’s to die for! Definitely need to try it. They also have other types of fast food good for after you drink and their prices are very reasonable. I wish this tru k came to Boston, MA Financial District during lunch time.\n\nThe service is amazing; the girl is so friendly! \nThey accept credit cards. Don’t go on a hurry though, there may be a huge line... worth the wait though.\n\nCan’t wait to go back!",
  "This place is good if you need a quickie regarding food. The food tastes awesome and is affordable.",
  "Awesome food available late! Worth the time to get there.",
  "Great chimi!!",
  "Excellent"
 ]
},{
 "name": "CAFE 1010",
 "address": "1010 Massachusetts Ave, Boston, MA 02118, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "delicious",
  "food",
  "food",
  "cheap",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Modest home-style cafe serving breakfast & hot lunch. Great prices & great service!",
  "Great service, greeted as soon as I walk in. Great delicious food. Great prices",
  "The new management is evident that this place has taken a complete 180. The food is tons better, the place is cleaner, and customer service is personal. Will definitely come again!!!",
  "I just want to get a soda but they say no change for $20 dollar bill. The food sucks in there. The owner was trying to ripe me off charging me $2.00 for 10 pieces chicken nuggets, but he charging others people only $2.00 for 20 pieces chicken nuggets. I confronted the owner and he pretend he did not know the prices. The owner is cheap and trying to rip people off. PLEASE DO NOT GO THERE!!",
  "Fresh food prepared daily....great quality and selection. A bit pricey...but still reasonable."
 ]
},{
 "name": "Casablanc",
 "address": "169 Norfolk Ave, Boston, MA 02119, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Amazing first time there and had a great time supporting local artist",
  "Great time",
  "Great place",
  "Nicr",
  "Kool"
 ]
},{
 "name": "Clifford Playground",
 "address": "171 Norfolk Ave, Boston, MA 02119, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The park is ok. There's actually 2 playgrounds. Just watch for needles.",
  "Nice sized field good place to fly your drone we don't have many good spots in the city for that.",
  "Having a great time with my grandchildren preparing 4 football",
  "Parking is tough but team games are fun at this park. MUST monitor children at the playground... not safe enough to leave kids alone.",
  "Very good"
 ]
},{
 "name": "Mason Schoolyard",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Magazine Street Community Garden",
 "address": "Boston, MA 02119, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Victoria's Diner",
 "address": "1024 Massachusetts Ave, Boston, MA 02118, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This was our first visit to Victoria’s and was amazing. The staff was extremely friendly and efficient. The menu is large, unlike their prices and the food is really good. I highly recommend the chili!!! The chicken fingers and fries awesome. The fries are made with good quality potatoes and are thick and slightly salted.",
  "It's a long-standing diner that's been around since 1949. Great variety of food offerings from breakfast and burgers to sandwiches and steaks. Service is usually very prompt and it's opened  24 hours so you can get breakfast or desserts anytime. Parking is available either in their lot or on surrounding streets. Decor is typical for a diner, casual and quite spacious with a dining area in back. Prices are reasonable.",
  "I usually come here for omelets. Their portions are big and their home fries are bomb! This time I had the plant-based Impossible Burger and it was pretty good!  I had a carnivor try it and he gave it a seal of approval.\n\nService is always consistently good here. Food as well",
  "Great service and professional personnel who takes care of you all the time. I was there on few breakfasts and did not regret it at all. Food is tasty and always fresh and the coffee cup is always filled with tasty coffee. Place is big enough to fit loads of of people too.",
  "We got there around 3 am. We were in a group of 6 people. Because we arrived in two groups the manager didn't allowed us to sit all together. They even told us that if we had arrived all at the same time they would.be able to place us in the same table. In addition, the place wasn't even full, it had less then 30% of its capacity. We were very polite with them and nothing changed."
 ]
},{
 "name": "Dunkin'",
 "address": "1100 Massachusetts Ave, Dorchester, MA 02125, USA",
 "avg_visitor_review": 2.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "How can u work at dunks and can’t make special drinks she worked there long time. Then look at menu it said Apple Cider.she says no more please do something it happened at 7:25. She was the only one there so not hard to find out who it is",
  "I went there today in the snow to get a hot chocolate before I went to my appointment, and they didn't have hot chocolate!!! shaking my head... disappointment to the 1st degree.....",
  "It always gets super busy at this location, I go food shopping every Wednesday and specially there are these two young ladies who are always on point. One is dark skinned with glasses the other is light skinned with glasses, they make a great team together. Keep up the good work ladies!",
  "The world's best coffee",
  "The employees here are so disconnected from the social construct of customer service. Every experience at this Dunkin Donuts has been subpar. I will take my hard earned money elsewhere and so will my union members."
 ]
},{
 "name": "Max Ultimate Food",
 "address": "10 Newmarket Square, Boston, MA 02118, USA",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "It's ok."
 ]
},{
 "name": "Pizza Hut Express",
 "address": "7 Allstate Rd, Dorchester, MA 02125, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "We enjoy to go out. Yesterday we arrived in this superb place which friends recommended to us. We had a lovely evening there with high-qulity dishes and a well-trained crew and  a professional  chef. We put this restaurant in our phone list  and we shall certainly come back soon.  Highly recommended.",
  "There’s no Pizza Hut",
  "Your typical in store (at Target) personal pizza hut. They have personal pepperoni and cheese, bread sticks, and hot dog/simple sandwich style fare. Just what you would expect inside a Target. Food is as good as any other personal pan pizza - Pizza Hut, just like at a sports venue. Was pretty good for a ready made personal pan store!",
  "This place is disgusting. The food is garbage. Staff is terrible!!!",
  "I like pizza and I live in a hut"
 ]
},{
 "name": "Olive Garden Italian Restaurant",
 "address": "11 Allstate Rd B, Dorchester, MA 02125, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "experience",
  "food",
  "family",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Been here tonight for dinner and the first thing that comes to mind is how huge this place is. It doesn’t seem like a large place till you get in. The decor and lighting are perfect. There are some new $5 cocktails and drinks on the menu. They forgot to put mint in my mojito which I had to politely remind. My friend ordered a strawberry margarita which was splendid. \n\nBeing a vegetarian, I was short of options for food but whatever we ordered did taste real good. The molten chocolate cake is the best out of all the desserts here. We also ordered a tiramisu which came in frozen and it actually took effort to break it. We returned it back. Quite odd for a chain that specializes in Italian cuisine to mess up with an iconic dessert. Apart from that I found the prices to be reasonable but they could do a bit more portion wise. I would definitely recommend a visit.",
  "Super busy on Saturday but the wait wasn't too bad. About a half hour. The waitress came right over and took our order. Got drinks, salad and bread sticks quick! Food was really good. The reason I didn't give 5 stars was because it took a good 15 minutes to have the waitress give us our check. Other than that a nice dinner and experience",
  "Unfortunately this review is for this location as it is been largely a mixed bag there. I've been approximately 10 times in the last 4 years. We have had a few bad experiences that almost turned me/us off. Ultimately the food is good for the price and I enjoy the soup and bread sticks, always gets me.",
  "Great meal, way better than I expected. The meal was amazing the wait staff was phenomenal. And the price was excellent. I took my whole family there and we all came out happy and full. I will definitely visit Olive Garden again next time I am in Dorchester.",
  "Yes I would go again!! Tiara the waitress made a world of difference... The food was so good and reasonably priced"
 ]
},{
 "name": "Cafe Polonia",
 "address": "611 Dorchester Ave, Boston, MA 02127, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Very small but quaint. Reservations are a must. Staff were very friendly and service was good. Food was really good too. We started with Salmon and Caviar which was to die for. Our dinners were great. The kielbasa was my favorite. My husband loved it all! Sadly, we were too full for dessert.",
  "Food is amazing. It was just like a home cooked meal someone spent all day cooking. \n\nService was polite. Restaurant is very small. The neighborhood was not very nice however. They would attract more customers being in a better spot in the city.",
  "We went with some friends and had a great time! Reservations are a must as it is a small restaurant. The servers are friendly but do fall behind a bit on drink refills sometimes, still nothing major and we will definitely come again sometime.",
  "Love, love love, this little shop. I'm from NJ where our Polish food is Legendary, however i saw this place on Diners Drive-In's and Dives so I thought I'd check it out. If you love Polish \"soul food\" then make sure you stop by and tell them Martha from NJ sent you!",
  "I ordered the Polish plate, and was not disappointed. Comes with stuffed cabbage, Hunter's stew, pierogi, and kielbasa. Food was amazing."
 ]
},{
 "name": "Potato Tomato",
 "address": "7 Ellery St Ste. B, Boston, MA 02127, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Panera Bread",
 "address": "8 Allstate Rd Suite 3, Dorchester, MA 02125, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "experience",
  "food",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "First time went there . The place is really big. Staff are very nice. The food wasn't too bad.",
  "I have been coming here since the day it opened. The staff has pleased my guests and myself continuously. The food has been superb, love most everything there from soups to nuts (in the pecan braid), smile. Good food, neat place! They’re the best!",
  "It's your standard Panera experience here: good, fresh food at a reasonable price. \n\nThe people here are friendly, but when I was here, towards closing time, it was pretty dirty and cluttered.\n\nPanera doesn't serve Coke, which is why I almost never come here. It's too bad.\n\nThere is plenty of parking right outside.",
  "Their salads and breads are always fresh and tasty. Bought tomato soup from there, but wasn't as satisfied as I expected,may be not the best place for soups. Place is lovely and staff is always helpful. Everything clean and tidy. No complaints.",
  "Considering this was the only bakery 2 steps away from our hotel, we got curious & gave it a shot: and I guess we were in luck - service was ok both days we had breakfast there. On the first day it really took a while till we got the bagels (we were told they had some trouble in the kitchen), but on the second day we just ordered \"to go\" and they stepped on it - & the sandwiches were fine - maybe a bit too small (according to my husband). \nWhat I particularly liked: the delicious muffins!"
 ]
},{
 "name": "The Bistro – Eat. Drink. Connect.®",
 "address": "63 Boston St, Boston, MA 02125, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This place obviously knows how to treat their clients. Consistently with a very friendly mindset. The food is affordably priced, always delicious and clean.",
  "Since Courtyard is quite far away from the commercial area, The Bistro provides a very convenient quick bite service. The service are great, I found waitress here are very welcoming. The booth seats are interesting with some 60s’ style, which each unit has a TV. The food served with big portion but somehow overpriced. My salad is $12.95, it was very tasty but feel pricey.",
  "Bomb foood",
  "Yummie",
  "This isn't a real restaurant.  It's a hotel breakfast bar. Also, the hours listed are inaccurate."
 ]
},{
 "name": "Dunkin'",
 "address": "510 Southampton St, Boston, MA 02127, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "This dunkin donuts is always on point. They're friendly and fast. I'm always in and out in a matter of about one to two minutes. 😊",
  "Enjoy my ice coffees. The crew know how I like my coffee.",
  "Love dds best around. I was mad going in their today. Don't know if he didn't inderstand my English or because he was on he cell phone the whole time i was at the counter. But he messed up my order. This use to be my favorite location beause its on my way to work. Not no more.",
  "So nice. I am watching all of my calories but had a sweet tooth, I asked for two of the munchkins and they gave me four. Very sweet",
  "Love this store because wonderful customer service ❤️❤️❤️💙💙💙"
 ]
},{
 "name": "Boston 13F",
 "address": "8 Allstate Rd, Dorchester, MA 02125, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "",
  "",
  ""
 ]
},{
 "name": "Red Line Pizza",
 "address": "582 Dorchester Ave, Boston, MA 02127, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "family",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "love this place. it's family owned, which, really does make a difference. They are personable to the community, offer a wide selection of food items that which are cooked well. Always sanitary and prompt. I suggest going in to visit just to meet the owner he's a great guy.",
  "The buffalo chicken pizza is delicious",
  "This restaurant is definitely one of the most pleasant place in the area. Every time I visit this place I am profoundly glad. They keep their very high  standard service and the highest level of food  they serve. You can never go wrong with this restaurant. Very  recommended.",
  "Best buffalo chicken pizza in town 🐔",
  "I've only eaten here once but the pizza I ordered was very undercooked. Besides that the workers were VERY friendly. I felt really comfortable there"
 ]
},{
 "name": "Andrew Square House of Pizza",
 "address": "395 Dorchester St #2740, Boston, MA 02127, USA",
 "avg_visitor_review": 3.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "I placed an order online used a coupon got charged an extra $2 for adding an extra toppin then got a call from Andrews saying they will charge me another $10 and they will not honor the coupon. It's a shame that during this time when I was trying to support my local business they would try to overcharging me when I was already spending $50 not include the tip. I have done it before in person and never had a problem I don't understand why they would have a problem now specially when I am a good customer.\nI will never order from them again.",
  "Love it.",
  "I got a pepperoni pizza and it was so greedy and soggy that my husband and I threw it out. The curly fries were oddly chewy and no flavor. We wanted an easy night for vday but I really want to enjoy a good pizza. This was not it.",
  "My favorite pizza spot. Have to visit type of place. Parking lot in back. Food at it's best.",
  "Goood pizza n more"
 ]
},{
 "name": "Molly's Farmhouse Coffee",
 "address": "16 Preble St, Boston, MA 02127, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Very nice small cosy spot to grab a cup of wonderful coffee. They have different flavors, but it’s not an artificial syrup, which make it very tasteful and delicious 👍 \nThey also have some sandwiches and wraps chose, and they cook after the order, so it’s freshly made from real stuff. I always get a falafel wrap and it’s good. This time I tried their new Molly’s cold wrap, with mozzarella, tomatoes and basil - I think I found my new favorite breakfast wrap!",
  "I never cared for iced coffee until I went to Molly's Farmhouse. Their frappuccino is to die for.\nThe shop was clean, the breakfast wrap was fresh and It's a nice atmosphere to get a quick breakfast.\nI really liked the cafe style outdoor seating.\nThe service was good and the owner and his wife we're very nice.\nIf you're an avid coffee drinker, this is the place to go.",
  "I been here once it's good",
  "Best coffee I've had in Boston so far. Their cold brew is mellow and smooth, so they don't use their old beans. They know what's up when it comes to brewing true.",
  "Love their flavored frappuccinos"
 ]
},{
 "name": "Wine & Spirits",
 "address": "295 Old Colony Ave, Boston, MA 02127, USA",
 "avg_visitor_review": 3.3333333333333335,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Right next door to rotary convenience shared parking lot grab a new ohone play the lottery get a sandwich pay bill or get money order like 1 stop shop.",
  "Staff are rude",
  "Buenos precios para  el lugar que está ubicado."
 ]
},{
 "name": "Supreme House of Pizza",
 "address": "313 Old Colony Ave, Boston, MA 02127, USA",
 "avg_visitor_review": 3.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Amazing pizza and subs for a great price! Very nice workers and they sell a variety of different foods! Would recommend.",
  "Manager is completely rude. I called because my order was wrong and instead of listening he was speaking over me and yelling at me. Mind you I order from there all time. For some reason when the manger himself takes order it is never correct. Hes unprofessional and rude. I would never give them my money again.",
  "The place is very out dated and need some serious remodeling and has the most nastiest dirtiest bathroom I've ever seen at any restaurants. The health department needs to pay them a visit one day!!!",
  "You guys know you're my favorite pizza in Boston for your large thin crust 'Santorini White Pizza'.\n\nLet me give you just a little corrective criticism.\n\nWhenever I order the 'Santorini White Pizza' it's always great, but its cooked a little different depending on who made it. \n\nSometimes it's cooked with big, thick chunks of caramelized onions and not much garlic or other seasonings which makes it a little gross.\n\nThen there's someone over that makes it absolutely perfect, the onions are very thin cut and its popping with flavor with a good amount of seasoning. \n\nI got a perfect version of the pizza tonight, its 8/5/19 at 8:00pm\n\nSo if you can figure out whoever cooked my pizza and make all of them come out like that, you guys would be perfezionare!",
  "I WILL NEVER HATE THIS PLACE,I LOVE ♥️ THIS PLACE AND ALL THE STAFF THE OWNERS ,BEAUTIFUL AND KIND HUMAN PEOPLE"
 ]
},{
 "name": "ROTARY VARIETY",
 "address": "309 Old Colony Ave, South Boston, MA 02127, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I live across the street for almost 2 years now. This place has THE BEST coffee I’ve ever had hands down! I used to be a DD’s adicta but never waste money on Dunkin’ anymore. For a  convenience store, they have really good prices on everything. They have a cellphone store and check cashiers in the back. They are super friendly and really make you feel part of the community.",
  "There coffee is the best n Jay n his wife always makes it the way u want it n it's reasonable priced",
  "The rotary has the best coffee in boston it taste better then any other cofee I've tasted, they have lots of different flavors and their prices are great! The rotary also has great sandwiches as well anytime your in the southie district try them",
  "They have most everything u could need at a local convenient store, fruit, candy, food, loytery, keno, cell phone store, check cashiers, coffee counter wuth breakfast sandwiches freshly made. ",
  "Believe or not this store have best coffee and best price too."
 ]
},{
 "name": "Low Art Tile",
 "address": "488 Dorchester Ave, Boston, MA 02127, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Veterans Park",
 "address": "Boston, MA 02127, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "drink",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Is fun there is comp there",
  "Lots of drunks sitting on the benches drinking right in open...even smoking crack...sonetimes cant even stop to rest cuz a bunch of drunk homeless men staring at u like they never seen a woman before...needs to be cleaned up",
  "Nice basketball court. That is until the kids rip the hoops off and your left with just rim. Also had a nice tennis court, the only time I use that is when I'm walking my dog. Hopefully no one got any doggie surprises. Sometimes drunks go to the seats and drink and do drugs. Come early in the morning to early afternoon to prevent this.",
  "Quite nice",
  "Oh the memories hanging out there, throwing the basketball around, kids playing hockey in the courts. They are tennis courts that when nobody is playing tennis they use it for hockey."
 ]
},{
 "name": "Sterling Square",
 "address": "Boston, MA 02127, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Telegraph Hill",
 "address": "289 Dorchester St, Boston, MA 02127, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great local bar/restaurant... great choice of microbrews... great place to watch the Sox or Bruins",
  "Great food.. wine glasses not that clean.",
  "I very much enjoyed my stay. Great food.Great service.",
  "The Hill burger is huge but pretty good. It was just me and the bartender for about 3 hours on a Wednesday afternoon.",
  "Nice little bar. Onion rings were fantastic. Turkey club great, burger was great, cobb salad was very fresh. Server was very helpful and pleasant"
 ]
}]
