[
 {
  "name": "Boston Public Garden",
  "address": "4 Charles St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c53b897e-932e-11ea-a568-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "food",
   "walk",
   "eat",
   "walking",
   "nature",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=14688348396492089089",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place amidst crowded commercial zone. Have been there a couple of times, it’s a huge park! People footfall is high throughout the day. At times small musical events, food stalls are setup to make the park more attractive. The ducks 🦆 , large squirrels 🐿 and pond are perfect for photography! Good place to have a walk chatting with friends and family.",
   "The Garden is a beautiful place to walk around.  If you bring some fruit or nuts along, you can put it down for the squirrels to eat as they are adorable. There are always new fresh flowers in the spring and summer. In the fall, the foliage is pretty.",
   "What a cool place to visit! If you’re visiting Boston this park is a must see. It is home to the iconic statue of George Washington, well lit walking paths and a pond that freezes in the winter. I really enjoyed my time here at this park.",
   "If you're in Boston, you have to see it's Central Park! Is it better than NYC's Central Park? Maybe not. However, it's smaller, tighter and in some ways more complete. An absolute treat to be in, the place is riddled with monuments and sculptures. There's a great couple of ponds in the middle with an iconic iron bridge over them. Nearby are some fabulous stone fountains - each with their own sets of sculptures. To a nature and architecture lover, this place is a delight. \n\nEnjoy your picnic lunch here or just stroll about. Hardly will you find cause to be disappointed.",
   "This park is by far one of the nicest spots in the whole city! It's perfect for a leisurely stroll around the lake and through the gardens. There are plenty of beautiful flowers and trees, and it is a breath of fresh air in the heart of Boston. You can follow the path around the lake, or sit on the grass or a bench and people watch. There are usually people playing instruments and it is a real pleasure to relax and enjoy the music. But be careful! The park is home to a literal horde of fluffy squirrels with no fear of people at all! If you take your eyes off your food you may find that you accidentally donated your snack to the squirrels of the park!"
  ]
 },
 {
  "name": "Faneuil Hall Marketplace",
  "address": "4 S Market St, Boston, MA 02109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c587d4e2-932e-11ea-bc0b-14b31f159f22.png",
  "tags": [
   "history",
   "parks",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=54879560290141189",
  "source": "GoogleMaps",
  "reviews": [
   "Nice cherry marketplace with ample stalls with everything from hand-made goods to various foods. Interesting for discovering new trends such as healthy products, good also for gifts. Tends to be rather expensive for the chain stores and chain restaurants but at least for those then you can feel that they'll have a good standard of service and products/services. I found that the people working here were friendly and respectful, not pushy, which I appreciated.",
   "This is a pretty neat historical marketplace and meeting place. The national parks people love talking about the history and the building and they are all super nice. I loved being in a place where our founding fathers were. The meeting place upstairs is large and there are some really awesome paintings to help you feel the historical significance of the place. And you should definitely talk with the parks people because they know everything about the place and the famous things that happened there.",
   "This place is BEAUTIFUL. What a wonderful experience for a tourist. The lighting is gorgeous, the outdoor area extremely well maintained, and it has a nice variety of shops. Definitely a must-see for any visitor new to the area. If I had one complaint, it would be the prices are a bit steep, but it's to be expected given the location.",
   "What I had: I would recommend the Indian place, their curry chicken is not dry and very tender. The curry itself was very savoury and did not have overpowering spices. You can taste before ordering. The portions were good as well.\n\nLocation Review\nPros:\n-Lots of food selection (ranging from Indian, Chinese, seafood, ice cream, baked goods, etc)\n-Well insulated and ventilated (not overly hot or cold)\n-Food is decently priced \n-Lots of samples to try before you make your decision\n-Surprisingly clean, staff constantly cleaning after patrons\n-Garbage cans everywhere\n\nCons:\n-Seating could use some improvements, there's limited seating and it's very packed (hard to find seating, but people eat quick; chairs are a bit uncomfortable no backing)\n-The market itself feels cramped because there's always a lot of people",
   "Historical. Enjoy the street performers (don't forget to tip them, they are worth it). Oodles of food options. If you are looking for authentic Boston cuisine try elsewhere like the North End, which is right across the street. Otherwise you can find plenty to eat here.  \n\nShopping options include everything from Crocs to comic books to clothing. Be prepared for crowds.\n\n Make sure to check out the Christmas light show during the holidays."
  ]
 },
 {
  "name": "Boston Common",
  "address": "139 Tremont St, Boston, MA 02111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c5d45334-932e-11ea-8da9-14b31f159f22.png",
  "tags": [
   "walking",
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4577491191698378500",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, open area in the middle of the city with varying terrain. Many vendors line the commons. You can sit on the benches or on the grass. There's a wading pool in the summer that converts to a skating rink in the winter. Nice view of Beacon Hill and the state capital building. All right next to the Park Square transit station.",
   "It's a wonderful place. We walked down Joy Street from Beacon House and sat for a while on a bench in the sun. Lots of people out on a beautiful spring day, but enough room to easily maintain social distance. We headed west over to the Public Garden. Also great but a very different sort of space.",
   "Great place to  visit.. I live near Boston and enjoy walking the park. Plenty to see if you love to people watch. If you're from out of town and look for place  from all the city traffic come here to decompress.",
   "Stunning! We visited in May and the gardens were amazing! We loved strolling through the pathways and seeing all the statues. All the history and sights were amazing. The sidewalks are very wide an accommodate a lot of people. There were lots of places to stop, sit and relax.",
   "One of my favorite things to do. Grab a coffee, walk through the common, find a bench and sit and read or people watch. It's much cleaner than it was. It's obviously not as much fun to sit and read in winter, but on a warm spring day it's great to dip your feet into the frog pond and act like a kid again."
  ]
 },
 {
  "name": "Museum of Fine Arts, Boston",
  "address": "465 Huntington Ave, Boston, MA 02115, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c6134986-932e-11ea-a717-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "art",
   "history",
   "art",
   "learn",
   "history",
   "walking",
   "art"
  ],
  "link": "https://maps.google.com/?cid=3387621536366450020",
  "source": "GoogleMaps",
  "reviews": [
   "So many beautiful pieces and exhibits. Definitely too much to fully take in during one visit (if you walk slowly and stop to stare at almost everything, like I do). I'd probably skip the cafe and save my appetite and wallet for the good restaurants well within walking distance of the museum.",
   "Great job on the Nubian Exhibit!  I love the different \"voices\" that appear in the written materials.  I was surprised and impressed at the discussion about the white-washing of Egypt b/the entire East African region shares the same art, culture, science and history (recently traveled to Ethiopia).  I think trials that the MFA is experiencing regarding race reflects your ongoing willingness to change and stick your neck out.  It's hard, but as an African American whose been visiting the museum since childhood, I really appreciate the change.  Thank you and nice job!",
   "Classic art from the European and American masters and historical exhibits plus modern art. Modern art doesn't interest me but the more traditional art took my breath away multiple times. My husband and I will be going back again as there was so much to see that we didn't get to it all. It was truly a pleasure to see art from masters like Botticelli.",
   "This museum is not for the light of heart. With arts from around the globe, this museum will take a full day if you stop and admire/read every placard. 3 floors span the massive location with a lunch restaurant located close to the middle. Bring your walking shoes, a 60gb SD card and be ready to learn and be inspired by the massive collection of fine arts and history.",
   "I am a member of the MFA it is through the park behind my apartment..It is ever changing offers studio and degree classes.. The art is amazing, the restaurants are all wonderful.. The outside garden is peaceful...We are so lucky to have an amazing museum right in our backyard!"
  ]
 },
 {
  "name": "Fenway Park",
  "address": "4 Jersey St, Boston, MA 02215, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c6590576-932e-11ea-86d0-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "history",
   "food",
   "tour",
   "historic",
   "parks",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11709374198378550532",
  "source": "GoogleMaps",
  "reviews": [
   "Loved Fenway Park! My girlfriend and I were coming in to the U.S through New Hampshire and decided to make a quick stop through Boston to see if we could do some quick sight seeing. It was like 1:45 in the morning so there was no one there. We ran around the entire perimeter of the park taking pictures with all the statues and signs. There was an open House of Blues right outside it and a guy offered to take pictures of us. Over all it was a fantastic time. Would go again. But not during a game, God I hate baseball.",
   "What can you say about Fenway? It was amazing! We had the tour before the game and found out so many cool things about it's history and who have played there. Our seats were pretty good! Although, the game went into extra innings, and we were there until just past midnight, the staff was okay with letting us move in as close as we wanted! So much to see about the history as well.",
   "Take me out to the ball game.  Can’t wait for the 2020 season to begin.  I drive from 4.5 hours away to come to games at this stadium.   The history here is like no other and you’re always guaranteed fun and action when you come to a ballgame at Fenway Park.  The food is tasty and available at each and every turn you make.  The prices are reasonable but the thing that sticks out the most is the superior service from all the staff.  Excellent job to everyone and a special thanks to the management for running such a well oiled machine.",
   "One of the last old school ball parks left. I recommend everyone take in a game or at least a tour of the park. It’s truly a historic site everyone should experience at least once.",
   "You guys even looking at this?\n\nIts Fenway...\nNot much is needed to be said.\n\nRestaurants outside the park are awesome.\n\nInside you'll find ample seating and accommodating food sales. You know you want to come try out Boston's famous, home of the Red Sox."
  ]
 },
 {
  "name": "Museum of Science",
  "address": "1 Museum Of Science Driveway, Boston, MA 02114, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c6a0e774-932e-11ea-a141-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "walk",
   "learn",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6321583363365811909",
  "source": "GoogleMaps",
  "reviews": [
   "This place is an absolute gem for children in order to spark their minds as scientists. Not only does it include exhibits but there are many interactive activities to do within. I felt like this would be a wonderful opportunity to bring kids to learn and captivate interest in science. Being a college student, I still found some of these shows/exhibits rather entertaining and I'm still learning from it. Although on the smaller side, I think this museum was an incredible experience. I highly recommend the electricity show. Parking was >$20 for about 5 hours but was attached to the building. The museum was easy to find and the overall experience was a bunch of fun",
   "There was an amazing amount of interactive stuff to do at the museum. We also went to see a live animal show which was really fun. We were a group of adults and it was nice that everything was aimed at people of all ages. We were lucky enough to be there at the same time as the Dog exhibit, which is where we ended up spending most of our time. \n\nThe view of the river when you first walk in is stunning as well. We were visiting from out of town so it was amazing to see the river and learn about the waves at the same time.",
   "Still my favorite New England museum and worth the hefty price of admission and extras. I bring lunch for the family in order to save time and money. The exhibits are ever-changing so our visits stay fresh and informative, appealing to all ages. It is always super clean and the staff is very helpful. They have lockers and rest rooms, including a family private restroom in the green wing on the second floor. And the famous Boston Duck Tours begin and end out front if you want to add another fun adventure to your day!",
   "This amazing treasure, that brought me so much joy as a kid, is constantly being updated. Took two middle-school boys today and they really enjoyed it. Best of all, they could walk around by themselves and explore at their own pace. A younger boy and I spent the afternoon together and I was amazed how focused he was. We all need to go back and see the other 2/3's of the Museum. Can't wait!",
   "You definitely get your money's worth here, this place is huge! We didn't even attend any of the planetarium shows (we wanted to, just ran out of time) and we were at the museum for several hours. There are many interactive exhibits that are both fun and educational. Would definitely recommend going, it's a perfect trip for families/children as well. We will be returning during one of our next Boston trips to check out the planetarium!"
  ]
 },
 {
  "name": "New England Aquarium",
  "address": "1 Central Wharf, Boston, MA 02110, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c6e56ac8-932e-11ea-a78e-14b31f159f22.png",
  "tags": [
   "active",
   "family",
   "walk",
   "unique",
   "unique",
   "family",
   "walk",
   "unique",
   "family",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15971520795022556489",
  "source": "GoogleMaps",
  "reviews": [
   "What a beautiful aquarium! This place is laid out vertically, so stairs and ramps are a must to get around. The open air penguin exhibit is extraordinary, and the electric eel tank is absolutely mesmerizing. Almost all the animals appear to be well taken care of, with the sole exception of the outdoor harbor seal exhibit, which seems very small and a bit unkempt given the size of the animals. Overall it was a lovely and educational experience. Will definitely return.",
   "I love this aquarium! They have penguins in the front area, and you can watch them during their feeding time which is super fun and exciting! The building has this really cool spiral-like design where you can walk up the levels and see all kinds of different aquatic creatures. I learned about so many cool creatures, and made some really special memories with my family! They also have a seal exhibit and a sea lion exhibit, and both are so fun to watch! They're so cute and playful, and they have so much personality! I totally want to come here again! One of my favorite memories is of the garden eels on the top floor, they're so cute and peaceful! The photo is from the sea lion exhibit, they were really active and talkative during our visit!",
   "This place was so much fun! Petting sharks and rays was the FIRST stop - amazing! The displays host unique, beautiful, interesting varieties of marine life, with friendly staff to answer questions. Live shows and feeding times enhance the experience. Very family-friendly. So much to see!",
   "New England Aquarium is a giant fish bowl teeming with sea creatures of all sizes, shapes and colours, and is the centrepiece of downtown Boston. There are over 800 different marine animals, including seals, sea dragons, stingrays, sharks and penguins. The main attraction is a unique central tank with small sharks, many varieties of fish and a huge sea turtle. There are daily presentations, behind-the-scenes tours, family programs and other special events year-round. This is a true aquatic experience!",
   "The New England Aquarium is a gem.  It's not the biggest, most spectacular aquarium around, however, it has a tremendous collection and a very unique story.  It's a perfect place to bring the kids, good friends, and family for a very reasonable price.  The member benefits are quite nice as well, if you're considering supporting the aquarium as a local.  It's in a terrific location within a short walk of all sorts of great food and additional attractions.  You can make a very full day of it at NEAQ.  The staff is awesome, mostly all volunteer, and every one of them has great knowledge of the sea life they tend to .  It's a great day trip, or if you want to split things up, you can take a wale watch cruise right of the adjacent dock.  Highly recommend!"
  ]
 },
 {
  "name": "Boston Tea Party Ships & Museum",
  "address": "306 Congress St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c72d2282-932e-11ea-b544-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "learn",
   "tour",
   "historic",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15127163986368509107",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic experience with interactive and historically accurate hosts. From the hall of where is started to the replica ships that started the birth of America. You're able to throw replica tea into the harbor with ropes attached. Participation is critical only if you want to feel highly involved with the actual history portion. You are led into the basement history museum which you get to see and actual, and only surviving tea crate. Great place and would highly recommend it!",
   "Absolutely worth the time and money. The information is presented in a way that is interactive and keeps you interested. The staff is also very well informed and will answer any and all questions. The gift shop is one of the best priced I have ever seen. We highly recommend going and learning about our nation's history. This place keeps you hooked the whole way through.",
   "Another great historical place to visit. All the people there wear, talk, and act like the 16 and 17 hundreds. The ships are really kool. The tour they offer is way worth it and you learn a lot about the Tea Party. The have and you can taste the 5 teas they threw in the water. The scones and muffins were really good. To me, a must see if your ever in Boston.",
   "Nice place! Nice people! Very interesting program! You will be surprised by it - this is not regular boring historic museum! This is cool and funny.\n\nAround $60 for two persons, parking was $34. \n\nEnjoy!",
   "You need to do the tour to do the museum and are led around be reenactors. It is fun and you get to \"throw tea\" into the Boston harbor. The cafe and tea shop also had reasonably priced tea and baked goods. I recommend getting your tickets online in advance because on busy days the tour times fill up fast. We had to wait over an hour after we arrived for the next available tour."
  ]
 },
 {
  "name": "Skywalk Observatory",
  "address": "50, 800 Boylston St, Boston, MA 02199, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c77c9024-932e-11ea-90b9-14b31f159f22.png",
  "tags": [
   "free",
   "history",
   "free",
   "history",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7804100523784764859",
  "source": "GoogleMaps",
  "reviews": [
   "Such a wonderful 360 view of Boston! We had a blast watching the sun go down, picking out the places we visited, watching the city light up after dark. It wasn't terribly busy, and there was lots of space to grab a seat and watch the sun go down. There's history and fun facts about Boston, including interactive exhibits. Plus, military members get in for free!",
   "Such a wonderful 360 view of Boston! We had a blast watching the sun go down, picking out the places we visited, watching the city light up after dark. It wasn't terribly busy, and there was lots of space to grab a seat and watch the sun go down. There's history and fun facts about Boston, including interactive exhibits. Plus, military members get in for free! Such a wonderful 360 view of Boston! We had a blast watching the sun go down, picking out the places we visited, watching the city light up after dark. It wasn't terribly busy, and there was lots of space to grab a seat and watch the sun go down. There's history and fun facts about Boston, including interactive exhibits. Plus, military members get in for free! Students has some discounts",
   "A good place to visit in Boston. Spectacular views from the top. I would suggest visiting on a clear day for best viewing. It was a little expensive though. Nevertheless, it is a nice view. Can see many other attractions and landmarks in Boston. It really makes you look at the area differently.",
   "Great views!! We didn't wait in the line too much and admission fee covered the audio explanation of the buildings visible from the observatory. You can even see the Boston airport from Skywalk. I recommend going there early in the morning.",
   "Must visit place in Boston! You simply cannot miss being awestruck by the amazing views that the Skywalk Observatory offers! It also shares the history of Boston in some nice documentary short movies. You can spend a good hour just walking there, soaking in the breathtaking views and reading all about Boston history. Loved every minute being there!"
  ]
 },
 {
  "name": "Arnold Arboretum of Harvard University",
  "address": "125 Arborway, Boston, MA 02130, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c7bf8d06-932e-11ea-825f-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17601739879968150728",
  "source": "GoogleMaps",
  "reviews": [
   "So this place is quite nice for a stroll in the park. It is quite large the selection of trees is very abundant there are many dandelions in the whole ambience of the park is quite nice. This park is maintained by Harvard which is kind of cool. But is located in a weird part of Boston so take that as you wish.",
   "It's beautiful and you don't feel like you are in the city. However if you go to Peter's Hill you can see the city skyline and have a nice sunset. You can even see the 4th of July fireworks from Peter's Hill! Go get lost and maybe find a tree you have never seen before, like the Dawn Redwoods 😉",
   "This is a beautiful arboretum, owner and operated by Harvard University. We went there on a cool and sunny summer day and had a fantastic time wandering the winding the paths. Many of the trees are labeled, allowing you to brush up on your botany skills! I’d highly recommend coming here when you get the chance. Be aware that there wasn’t any food or drink at the visitor center, so bring your own. There are bathrooms though.",
   "The Arnold Arboretum is a beautiful, little hidden treasure in Boston! When you walk through the park it almost feels like you're no longer in the city, but roaming around a mystical forest in some far-away land. The trees, in the Spring, are always so vibrant and colorful. Definitely a great place to visit to relax and reflect!",
   "Very clean and walkable park.  Not much to see in the winter though.  Ponds are frozen so fun to skip rocks across."
  ]
 },
 {
  "name": "Boston Children's Museum",
  "address": "308 Congress St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c81e0bb4-932e-11ea-b7af-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "active",
   "kids",
   "food",
   "art",
   "music",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=17863338720095849923",
  "source": "GoogleMaps",
  "reviews": [
   "Very good place for kids between the age 3 and 10. Kids above 10 might enjoy as well, but will have limited engagements. The museum has 3 floors with some water related play areas that kids seem to like the most. Overall experience was good. Don't forget to pack your food if you plan to go there. They have a separate dining area with about 30-40 seating, but do not have a food court as such. There were a couple of snack vending machines which I think will not be enough to spend a full day at the museum.",
   "Good museum for children under 12 (my opinion).  Many hands on activities for the kids.  Sufficient bathrooms and \"rest\" places for parents.  Decent food option.  You can practically spend a whole day here.  Lots of activities to keep active kids busy.",
   "I am absolutely floored by the experience. The 2nd floor has a 0-3 only play area WITH a crawling-only section. Hands on stuff everywhere; STEAM Lab, Art Lab, Construction Area, and tons of installations ready for climbing. Eating areas with open spaces, microwaves, sinks, changing areas... Like, $18 for a whole day of energy-burning fun? Do it.\n\nThe staff is phenomenal. They have music nights and other events... If you got little runts, they will love it.\n\nI just wish they had a good napping area.",
   "Wonderful museum for kids, but not good value for the very young (~1yo). My wife and I took our daughter to check it out, and they have a play space that was great for our little girl, but we had to pay 3 full admissions to get there, on top of expensive parking -- there are play spaces around the city that charge only for the child and are a fraction of the cost per ticket while providing similar or better experiences.",
   "This place is amazing, my 9 year old has been coming here since he was a baby and still loves it there! There is so much for kids to do, there are rooms with passive activities, and rooms with very exciting activities. There is  something for everyone to do, regardless of a child's personality/style. I highly recommend it."
  ]
 },
 {
  "name": "Isabella Stewart Gardner Museum",
  "address": "25 Evans Way, Boston, MA 02115, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c867bf8c-932e-11ea-8d21-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "tour",
   "art",
   "tour",
   "history",
   "music",
   "art",
   "tour",
   "free",
   "art",
   "library"
  ],
  "link": "https://maps.google.com/?cid=15764182873262996157",
  "source": "GoogleMaps",
  "reviews": [
   "Imagine that you are going inside someone's 'home' that is huge, classic, unpredictable, full of memorable expensive personal collections from around the world, blended with the beauty of a tropical garden as the center that connected all rooms on three floors. That's at least how I feel. All rooms at every level is differently designed and colored by the owner for different purposes. One can be grander because of its wood elements, while others are grand with its metal or fabric elements. You can see paintings, jewellery, clothes, books, tapestry, stained glass, pottery, furniture, sculpture, letters, and many more. Enjoy the freshness of the garden's fresh view and fresh air after leaving or while seeing each room. You will feel more inspired and peaceful. I always thought that that's the garden is for. Sometimes there will be activities for children to paint, a small concert to enjoy in the garden, a free tour to follow, or talks to attend. Check the brochure and ask someone with 'ASK ME' pin. Check out the gift shop and the restaurant. Oh, one more, try to search about the story when the paintings were stolen in the '90s, and the frames were left hanging empty until today. It adds to your excitement of its mystery when you found them inside!",
   "There are many great things about this fabulous collection of art works but there is a relatively new one which you may not know about . . . the AUDIO TOUR the museum makes available through your own cell phone or other  mobile device. \n\nThere are two outstanding features to this great functionality, well, actually three, outstanding benefits:  1) no standing in line to pick up or drop off the museum's headset; 2) no need to wear the museum's headset which could potentially bring with it illness-inducing germs; and 3) the ability to listen to the complete tour of the museum without  actually being there.  You can listen to the audio tour prior to arriving at the museum from anyplace you have an internet connection.  This is a big plus because when you are actually at the museum you already know so much about where you are and what you are looking at.  It allows you to pick and choose where to spend your time without feeling like you are maybe missing something you will later really wished you had been able to take the time to hear/see.",
   "Beautiful museum that does a wonderful job of seamlessly integrating the collection with the building and architecture. Be sure to get a tour to understand the history and intention of the museum, it goes a long way to fully appreciating the space and its history. There's a nice wine bar to help set the atmosphere, and on Thursdays, there's live music in the evenings. Great date night idea!",
   "Really beautiful museum with an interesting art collection. Different area of the museum's are theme based on time period and/or region of the world. In center of the property is a large courtyard and beautiful garden. I honestly could have sat next to the garden for hours. It's hard to really absorb everything in one visit so I will definitely be returning!",
   "***Free entry for people named Isabella!!!*** This is truly one of the coolest museums I've ever visited anywhere in the world. There is something for everyone, whether you like architecture, gardens, paintings, the renaissance era, drawings, sculptures, furniture, antique decorations or artifacts. There is even intrigue about the theft several decades ago, would definitely recommend a walling or audio tour! Museum staff is very warm and helpful and their new wing also has amazing and rotating displays. It's not a huge space but it would definitely take days to really see every nook and cranny (considering they're all filled to the brim!) In addition to the mansion filled with art and centuries-old items of interest, there is a library, a cafe, a gift shop and other amenities. Couldn't recommend more!"
  ]
 },
 {
  "name": "USS Constitution Museum",
  "address": "Building 22, Charlestown Navy Yard, Charlestown, MA 02129, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c8adc31a-932e-11ea-b7f0-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "history",
   "kids",
   "history",
   "walk",
   "knowledgeable",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11944115141496736933",
  "source": "GoogleMaps",
  "reviews": [
   "As a US Navy veteran this place is as close as it gets to the root of it all. Just thrilling to walk in so much history. You feel it. It's utterly palpable. The knowledgeable sailors aboard this legend must be so proud to be able to walk in the footsteps of the proud past and share with the people today. I feel refreshed for having been able to partake of this incredible proud lady. I felt the sway of the ship that LIVES the history of our beloved nation. Just WOW.❤🇺🇸⚓",
   "**If you are an adult, you need a government-issued ID to get on the ship itself.** Extremely thorough and highly interactive museum. Lots of things to read for the adults and simulations, examples, and activities for kids to touch and interact with. \"Old Iron Sides\" - the USS Constitution itself - is really neat. You can visit three decks of the ship, and there are Navy personnel present to give explanations and answer questions.",
   "This was a nice place with useful information but it’s not for adults.  In the context of a museum for children it does a really great job with its interactive exhibits.  I was interested in learning about the history of the USS Constitution, how it’s changed over the centuries, and it’s cultural significance over time, but as an adult with no children I got nothing out of this.",
   "One of my favorite museums as a kid. This place was great. You can actually go on the ship and walk around. The staff is super knowledgeable and polite. It is a really cool experience I feel like a lot of people don’t know about. I would rather bring someone here than the old north church, it is much more engaging. Plus the view from right there is really hard to beat!",
   "Today's visit was quite unexpected and fantastic! During school vacation week they are offering a Lego build with all kinds of bricks and a contest throughout the week. It also coincides with the Miniature Master models. Amazing!!! We had lots of fun and plan to go again when we have more time to walk through the regular museum displays. Today we just focused on the special exhibits. Also hope to go aboard the ship next time. Gift shop reasonably priced and lots of variety.  *Admission by donation! ♡ it!!!"
  ]
 },
 {
  "name": "Boston National Historical Park",
  "address": "Building 5, Charlestown Navy Yard, Boston, MA 02109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c8fbb7f4-932e-11ea-9fe1-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "history",
   "walking",
   "learn",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4841923291394523149",
  "source": "GoogleMaps",
  "reviews": [
   "Prime early American history. It's a great park, and a nice walk to finish off the freedom trail. Do not climb the stairs, you'll regret it.",
   "A great place to visit. Stop by and pick up a little bit of our nations past. Beautiful architecture and foliage.",
   "Another great park in this tourist-friendly Boston city. You really don't have to be a history buff to enjoy this park. Contrary to what you'd read, the size of this park allows for many outdoor activities abd only if you feel like it, you can pay attention to the war memorabilia.",
   "Great historical information! Lots to see and do. If the weather is nice, it's worth walking around. Traffic can be hectic, but we went right in peak tourist season. Otherwise everything was great.",
   "Great historic spot to learn about Boston colonial times and the revolution. The building is well preserved and the staff is very friendly. This place is on the heart of the downtown Boston."
  ]
 },
 {
  "name": "Charles River Esplanade",
  "address": "Charles River Esplanade, Boston, MA 02116, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c9440bba-932e-11ea-bd39-14b31f159f22.png",
  "tags": [
   "free",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=17302290882398965626",
  "source": "GoogleMaps",
  "reviews": [
   "Stunning views. Great walkways. You really lose yourself in the cityscape. Beautiful sky views at night.  Unobstructed shorelines. A must visit when I come to the city.",
   "Central Park it is not. It’s really just a longish trail along the river. It’s pretty, though. And it’s free. \n\nLet’s face it. It’s expensive to live in Boston. I don’t even live in Boston and it’s expensive to just live near Boston. And on a slushy day in February you might have to ask yourself “why am I living here?”  Florida is a lot cheaper and does t get nearly as much snow. \n\nWell the Esplanade is one of the places you can visit to remind yourself why you live here. It’s a long park on the Charles River  it has excellent views of the city and of the Charles. It has willows (my wife’s favorite tree) and geese and on a good day it might have a heron or two. \n\nIn the morning people bike and run around, either on their way somewhere or just exercising. In the evening people do the same, or just take a leisurely stroll with the one they love.\n\nAnd I’m sure they have places like that in Florida, but if it’s spring summer or fall the weather can’t be beat, and it’s right next to a big city.",
   "Is gorgeous there, many outdoor activities you can do during the springtime. From kayaking, fishing walking around, boat sailing classes, going around with your bicycle or running. It's a nice blossom and near the river area for you to enjoy.",
   "Nothing feels as calm and peaceful than witnessing the sunset against the skyline of Boston. Beautiful view and I would consider this to be a tourist attractions or its spectacular view from the waterfront.",
   "Is gorgeous there, many outdoor activities you can do during the summer time. From kayaking, fishing walking around, boat sailing classes, going around with your bicycle or running.  It's a nice green and near the river area for you to enjoy."
  ]
 },
 {
  "name": "The Paul Revere House",
  "address": "19 N Square, Boston, MA 02113, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c99a9086-932e-11ea-a13a-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "learn",
   "history",
   "knowledgeable",
   "history",
   "kids",
   "cheap",
   "tour",
   "tour",
   "family",
   "tour",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8088411089118899148",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great stop on the Freedom Trail. The cost was acceptable, and the rooms and storytelling were interesting. No pictures were allowed inside, but the outside and the visitor's center allowed photos. I recommend this as an important site for American history. Not to mention, I never knew how much Paul Revere had done after his ride. Very interesting man.",
   "When we travel, we like to visit historical sites and learn about he places as are staying. We learned about Paul Revere in school in the Midwest, but as an adult, I think much more about what his life was like and why he chose to take his stand. It was neat to be able to walk through a home he lived with and see some of the furniture he owned, to learn more about his wives, children, and career. It's only 5.00 to enter, bit do bring cash. It is operated by a non profit that depends on donations. If you are Interested in history, don't hesitate to go!",
   "Fun little place that has a lot of history behind it. Cheap to get into and quick to see everything in it. The tour guides are knowledgeable and friendly. Seems like it would be a nice place for kids.",
   "Interesting look at how people lived in Paul Revere's time period. Also provides some good facts about Paul Revere and his life and family. It is very short and the house only has a few rooms. The whole self guided tour took about 10 minutes. The top level is not open for viewing (third floor). The people working inside were wonderful. Tons of knowledge and happy to answer any questions and provide information. I was amazed at how much they knew. If you go check this out (it's only $5) make sure to chat with the people there, they really are want makes it worth it.",
   "The place that has a lot of history behind it. You get into and quick to see everything in it, But photos aren't allowed. the price of tickets starts from 5$. The tour guides are very friendly. it is a kids friendly also.The home was built about 1680 on the site of the former parsonage of the Second Church of Boston."
  ]
 },
 {
  "name": "Franklin Park Zoo",
  "address": "1 Franklin Park Rd, Boston, MA 02121, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/c9dc5b62-932e-11ea-a038-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "kids",
   "food",
   "kids",
   "free",
   "food",
   "kids",
   "library"
  ],
  "link": "https://maps.google.com/?cid=2136567361722772625",
  "source": "GoogleMaps",
  "reviews": [
   "What isn't too love about this zoo? My partner and I spent HOURS here over the summer getting lost in all of the beautiful attractions and looking at the critters. The bird cage was one of my favorite places, especially with the bird seed lollipops they give you to feed the little guys. The zoo was WAY bigger than we thought, because the zoo map made it look pretty small. Parking was super easy and convenient, and we arrived just after opening, so we made it inside in less than five minutes of arriving at the gate. The animals looked healthy and well taken care of, and all of the enclosures were well kept and clean. The goats were a bit tired due to the 80 degree heat, but the ice cream booths and AC in the shops made it a nice experience for the two of us. The gift shop was quaint, and not as expensive as you'd expect for a Boston attraction. We left with some cute souvenirs, and the lunch there was excellent and had very large portions. Enough for two people to share one meal and still have too much food. The only downside was that we arrived too late in the season to see the butterfly enclosure, but the rest of the views made it all worth it.",
   "Great for kids. Easy to walk the whole zoo in a day. It may be a small zoo but it has many animals. There are also small attractions for young children. It could use better food options and parking. Prices are to be expected for the area.",
   "Great place for families. Lots to do. The animals looked healthy and well cared for. We were there for a birthday party. Perfect setting for that.",
   "Great zoo for young kids. You can see all the exhibits in one day. There is also a nice playground. My biggest complaint is the lack of food options, but you can definitely pack your own lunch. Parking is free but can get pretty full on busy days.",
   "It’s good for kids. I brought tickets using library card ... it’s worth to enjoy with kids.. it is having pay area also, animals are few but covered most important ones"
  ]
 },
 {
  "name": "Old North Church",
  "address": "193 Salem St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ca4e5494-932e-11ea-83f0-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "tour",
   "history",
   "history",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13582545941987900841",
  "source": "GoogleMaps",
  "reviews": [
   "I highly recommend touring the old church if visiting Boston.  I also recommend paying the small amount for the “behind the scenes” tour which will take you up to where the bells are rung and through the crypt below.  It is exhilarating and humbling to stand in a place where so much history and well known people have been present. The church itself is beautiful.  Our tour guide was knowledgeable, articulate and exuded a pure passion for the past.  Don’t forget to tour the chocolate shop next door for some colonial chocolate!",
   "It's a really small church. It isn't particularly beautiful inside. The historians inside are cool and will talk to you as long as you want but not even they can save this place from being in actuality rather irrelevant. \n\nSave your money. Take a photo on the outside. Look up the Longfellow poem on your phone and call it good.",
   "Beautiful church with great passive info opportunities, but I was VERY disappointed with the tour. The guide seemed rude and apathetic and more interested in making snarky remarks than encouraging a love of history in our group. I was not impressed with him or the girl who ended our tour by speed-reading through a well-written account of the Church's history. She also seemed disinterested and apathetic. I hope they can improve their interpreter team for the better.",
   "Amazing piece of history. If you are visiting Boston on holiday or for any reason at all stop by for a second to take in the history and the beautiful surroundings. The building itself dates back hundreds of years.",
   "Very cool to be in a place where so much history happened! The workers are all very knowledgeable and I enjoyed every minute"
  ]
 },
 {
  "name": "John F. Kennedy Presidential Library and Museum",
  "address": "Columbia Point, Boston, MA 02125, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ca982f00-932e-11ea-ae64-14b31f159f22.png",
  "tags": [
   "walk",
   "library",
   "history",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10455966398929133092",
  "source": "GoogleMaps",
  "reviews": [
   "Thoroughly enjoyable experience here! This is a wonderful museum and library. They do a fantastic job of depicting JFK's life and work. The architecture and landscaping are also really nice. If you walk out the back, you can walk around Boston harbour with great views of the city. The really enjoyed learning more about this great president.",
   "Wonderful museum! Just went here yesterday with my Leadership club from my school. I love the exhibits and everything about JFK! It was my first time being here. I would definitely want to go again! The staff was super nice!",
   "This museum was inspiring.  It reminded us of how things were, how happy and proud we were to be Americans.   This museum made us sad.  It reminded us of how things were,  how happy and proud,  not Like now.  Thank you for the upbeat,  factual reminders of a great man and our great nation.  We can only help history will repeat itself.",
   "I went into this place with 0 expectations. I hadn’t heard anything about it and no one had recommended it to me - I simply wanted to learn more about Kennedy as I feel like I was fairly uneducated about his life and accomplishments. \n\nThis was both an immersive and informative experience that I would recommend to anyone visiting Boston. The video exhibits were really well produced and engaging and the walk-through exhibits were brilliant. \n\nMy personal favourite section was the real life audio recordings from the Cuban missile crisis debate - you can honestly feel the tension and anxiety of the whole situation through listening to the tapes.\n\nThe design of the building was unlike anything I’ve been to - the large yet minimalistic style made it seem really futuristic which was a really nice contrast to the exhibit itself.",
   "Really great looking monument and informative history details inside. Best show is the Cuban missle crisis. Worth going, takes about an hour to browse through, but easily you can spend half a day if you are an enthusiast!"
  ]
 },
 {
  "name": "Bunker Hill Monument",
  "address": "Monument Sq, Charlestown, MA 02129, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cadb79b0-932e-11ea-8133-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "walk",
   "free",
   "history",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12443189800891843224",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice park to walk around at any time, with informational markers to describe the important battle that took place there. The climb to the top of the monument can be pretty sweaty during the summer, especially if it's crowded - there are a lot of stairs and the passage is narrow. But it's a fun experience to get to the top and look around. I'm a bit of a history buff, and I highly recommend the store/museum across the street to get a greater appreciation of the battle",
   "Walk out of downtown Boston and take a little walk through historical part of town and up this 296 stair monument.  You’ll be greeted by lovely views of the city, Cambridge and the waters.  Loads of history in this little park including a free museum (across the street from the monument) and during different parts of the year there will be people dressed in colonial wear so that you can get a feel what that was like.  All of this is free, educational and very entertaining.",
   "We decided to go explore the city and ended up climbing this monument, after 290 steps up (which sounds alot easier then it was) we got to see the whole city from a really cool monument. The signs out front say it's going to be hard to climb and it definitely was harder then we thought. This is definitely a place to go and visit if you are around.",
   "This monument has 294 stairs.  The top is amazing. The entire experience is free of charge and managed by the U.S. Park service. Everyone was very nice.  The process requires  a person to comfortably walk upstairs with little opportunity or options for breaks.  Enjoy!",
   "The only way to commemorate skirmishes of the past with good taste is to leave a mark that is nice looking or has a sentimental value to the lost ones. This monument has both and also grandeur. Climbing the steps gives you a great view of the neighborhoods of Boston."
  ]
 },
 {
  "name": "Boston Harbor Islands National and State Park",
  "address": "191w Atlantic Ave, Boston, MA 02109, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cb221740-932e-11ea-8365-14b31f159f22.png",
  "tags": [
   "hike",
   "history",
   "food",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=18293904353317457953",
  "source": "GoogleMaps",
  "reviews": [
   "Fort-showcasing island that will captivate your attention for a while. It doesn't get too busy so you'll have a nice view for awesome pictures of the harbor and historical buildings. This has to be one of the most clean touristy island I've been to.",
   "Beautiful and informative. Perfect day in the harbor with great views of the city from the sea. The connections between the islands are very convenient and easy to use if you want to do island hopping.",
   "Spectacle was a good day trip for picnicking, going for a light hike and dip in the harbor. Be careful with how much you bring, as the park is carry on, carry off. And do not swim on the boat side of the dock. Otherwise it’s a  nice escape from the city. Hard to believe that people lived here year round!",
   "We visited George's Island. They have Fort Warren there. It was very interesting. They have a few runs during the day, as well as guided tours. You can also amble around on your own if you want. There is a visitors center where you can see information on the history of the fort, and a brief video. There are restrooms there as well. There is a rule that whatever you bring to the island, you take when you leave. There are no garbage barrels there. You also should bring food and beverages, as there are none on the island. You may purchase beverages and snacks on the boat going there. Definitely worth going. There are a bunch of islands but you would have to start early to see more than one. Check them out!",
   "I went to Spectacle and Georges during this visit on a hot July Saturday. The ferry from Long Wharf to Spectacle took about 15 minutes. Spectacle has great walking trails and a guarded beach along with changing rooms. The visitor center houses some information on the island’s varied history along with a sea glass mural, made with items found on the beach. Photos can be taken of the sea glass and pottery but must not be removed from island. The vistas of the Boston Harbor waterfront area are great from the hiking trails as well as the beach and dock."
  ]
 },
 {
  "name": "Franklin Park",
  "address": "1 Franklin Park Rd, Boston, MA 02121, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cb72a876-932e-11ea-b78f-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16511650392130326230",
  "source": "GoogleMaps",
  "reviews": [
   "They have added more life to the place. It looks nicer ! Before it was looking sad but really happy it's made a change for the best. I've had my kids coming since they were little. This is a big  part of Dorchester and happy they didn't let it go down. Love the animals!",
   "Tranquility, generally safe at Jamaica Plain location. Met my husband over there and got married. Now working for a facility located just in, or at least very nearby.",
   "I have been to Franklin Park Zoo many times starting when I was a kid. I recently attended a breakfast at the zoo, specifically with the sloths the experience was very cool and engaging. The breakfast options though were lacking. I suggest getting breakfast after. There was the option to walk around the zoo after which was very cool because you could be there before everyone else and all of the zookeepers were telling quite interesting facts about the animals that you wouldn't normally hear when the zoo is crowded.",
   "The Tropical Rainforest was Amazing! \"Little Joe\" and friends were mesmerizing! We could have stayed all day observing them. Zoo Keeper, Celia (?) was sooooo informative and it was a pleasure meeting her and learning so much about the Franklin Park Zoo's gorillas!",
   "The kids always love a trip to the Franklin Park Zoo. It's spread out over really nicely maintained grounds.  It's a little small, but still had a nice variety of exhibits and animals to learn about with great descriptions at every exhibit.  There are a few great areas for younger children to play and rest from all of the, you know Zoo stuff."
  ]
 },
 {
  "name": "Trapology Boston",
  "address": "177 Tremont St 2nd floor, Boston, MA 02111, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cbcdc0f8-932e-11ea-8b89-14b31f159f22.png",
  "tags": [
   "unique",
   "knowledgeable",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=15500450762875957133",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome. The quality of the puzzles and props is much better than what we experienced at other places. The puzzles logically led the way to the escape. We did two on the same day and were lucky to have Rachel as our Game Master for both. She made it really fun and helped us just the right amount. Keep up the good work.",
   "Their rooms are so well done and thought out! They have now 5 rooms and they design in-house so you know a lot of care is put into their build outs. The rooms are definitely challenging, but their puzzles make sense and are on theme. The staff is super friendly and helpful. To top it off, they're in a great location with amazing views of the Common. If you're looking to do an escape room in Boston, make sure to check them out!",
   "My friends and I did a room on Sunday and it was extremely fun and stimulating. I was with a pretty big group and we all agreed we would love to go back and try the other rooms. The place is unique compared to other escape rooms I’ve been to and the staff was accommodating. Our game keeper, Kevin, was helpful and funny. He made us feel so much better about not completing the challenge and was very knowledgeable. Can’t wait to go back!",
   "We did the steam punk train room and had a blast! Karen was a super host and was able to really help us move along… Even though we were such experts that we needed very little. ha ha...",
   "Trapology is a fantastic escape room venue in downtown Boston. The puzzles are pretty darn good - most can be solved without unreasonable leaps of logic, and the rooms are thematic and well designed. A few rooms that I've done (no spoilers ahead) involving a separated team as well as handcuffing team members was unique, though not necessarily beneficial to the experience. Regardless, these design choices worked with the theme and gave us some good laughs.\n\nWill gladly continue to try rooms here."
  ]
 },
 {
  "name": "Rose Kennedy Greenway",
  "address": "Atlantic Ave, Boston, MA 02110, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc0b8d6e-932e-11ea-a72b-14b31f159f22.png",
  "tags": [
   "unique",
   "art",
   "walk",
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7468833838059221018",
  "source": "GoogleMaps",
  "reviews": [
   "A wonderful oasis of trees, flowers, mini gardens and outdoor art works in downtown Boston right next to South Station. This is a beautiful respite for the weary bus and train travelers with a stop-over in Boston, visitors to the Boston Harbor area and all the hard-working people in the downtown district. The Greenway Park meanders from South Station to the Aquarium and the North End. It is intricately designed so that many mini gardens open up within the park. Outdoor sculptures and murals add an exciting touch to the many unique areas marked by blocks of granite, stone steps or mini plazas. Truly a gem and a beautiful addition to the Boston Harbor neighborhood.",
   "Beautiful green and public space for residents! Little ones can enjoy the fountains or just have a nice lay on the grass with a stunning view of the city skyline. Or take a swing on their swing chairs.",
   "In the former shadow of the elevated highway now grows this modern classic tradition of public green space. Take a swing, pull up a chair, walk along the paths, a true gem.",
   "I love going to this Greenway. \n\nIt’s centrally located for a good time:\nTo one side is the North End (Little Italy) and to the other side Boston Public Market and Union Oyster House. You’re also less than a half-mile from the Wharf and Aquarium.\n\nThis greenway is great for:\nkids, families, friends, couples and if you’re doing a meetup group. They have splash zones for the kids, and you’ll see students and picnickers everyday. \n\nThe Views: \nThe trees and flowers are well kept and beautiful. It has a nice view of the old historical parts of Boston as well as the skyline. \n\nThe park is safe from 7am till 9pm. I haven’t visited outside those hours so I can’t make any claims. But generally speaking it’s well-lit and there are plenty of people including park maintenance and police/rangers.",
   "Nice park to walk through with some water features for the kids."
  ]
 },
 {
  "name": "The Mary Baker Eddy Library",
  "address": "200 Massachusetts Ave, Boston, MA 02115, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cc5f7a0a-932e-11ea-919a-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "unique",
   "tour",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7651720631138111723",
  "source": "GoogleMaps",
  "reviews": [
   "Showed up after reading about this hidden gem on a Wednesday morning, tickets were $6 and there were 10 people (7 adults) in the 10:40am tour group.  Our guide was WONDERFUL, very knowledgeable and outgoing, and made the tour experience better.  \n\nIf you’ve never been, 100% urge you to visit!  A very interesting way to spend 20 minutes, the building is beautiful and the tour is fun for anyone.",
   "We took this quick tour of the Mapparium. If you have time to fit it in your schedule, I highly recommend. It doesn't take long and is $6 per person. Unfortunately you can't take photos inside. It's pretty cool though once inside. It's really just like standing inside the middle of a globe. Pretty cool!",
   "The Mapparium is an incredible place. The lady who gave our tour was well spoken and friendly. I love maps and the experience of seeing a globe in this unique way really puts the whole world into perspective. If you are thinking of going here, just do it. It’s a fun activity!",
   "We enjoyed the Mapparium! At $6 per person, it is good value for money as you get to stand inside the middle of the globe and are given a quick tour by a guide. You can't take photos inside the globe which wasn’t a major problem as it allowed everyone to take it all in. The acoustics inside the globe were fascinating! I’d recommend this place to anyone visiting Boston!",
   "Wow. Had some time. This was quick. We got meter parking directly across the street.\nOur kids enjoyed the display and the weird acoustics. I found a storyboard and contributed one."
  ]
 },
 {
  "name": "Boston Public Market",
  "address": "100 Hanover St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ccafbd22-932e-11ea-9fa8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "tasting",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15650615817702684376",
  "source": "GoogleMaps",
  "reviews": [
   "Tried the smoked salmon on a bagel and it was absolutely delicious! Must go to Red's Best and try their food! Me and my husband got: clam chowder, lobster bisque, salmon burger and oysters. The oysters are SO FRESH! Just squeeze a little bit lemon on it and that is all you need! Enjoy the true taste itself from those fresh oysters!",
   "Love the Boston public market! There is a something for everyone here. You got seafood, meat, alcohol, coffee and a number of different food stands. Personally, loved the bagel spot (fresh bagels every morning) that can be served with butter or fancy it up into a full sandwich. If you are visiting Boston, consider checking this place out for a quick bite or even a souvenir to take home",
   "The Market is awesome. It deserves 5 stars because it has a ton of variety and the people who work there are so friendly.\n\nBut, I couldn't give it 5 stars because of the guy who was loitering near the bathrooms. He appeared to have likely just shot up heroin and just lent a funky vibe to the place because he was sitting there rocking back and forth, talking to himself, and frequently scratching his hands and arms.\n\nAside from that, its a great place",
   "Overly prices local goods (or locally made) you may consider treating yourself to once in a blue moon. \nTasted some great chocolate, but at $10 a bar, could not do more than the tasting.\nLarge meet and fish stalls, wine and beer cellar, some non edible items as well as a fresh fruit and veggie stand. Selection of to go food and Dr pasta. \nDonuts, ice cream, macaroon, fudge and much more to please your sweet tooth.",
   "Lots of local food shops inside. Or you can grab some groceries outside. I enjoyed the hot apple cider the past two trips here. Definitely will go back for more drinks and pastries."
  ]
 },
 {
  "name": "Make Way for Ducklings",
  "address": "4 Charles St S, Boston, MA 02116, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd115fe8-932e-11ea-8b1d-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=8824080850318793537",
  "source": "GoogleMaps",
  "reviews": [
   "If this is a landmark that has generated your interest then you have been through the majestic and beyond amazing Boston Commons to find this creation. It’s Adored by kids and my friend had to wait to get her shots. It’s fun to try angles to get all the ducklings in a row. There are real ducks nearby in the pond as well. Beware the chipmunks, they had a grudge against my friend for some reason.",
   "As you can see, our Frenchie, Kenny G had a fascination with the ducks when we use to live in Boston. During different seasons, holidays, and when the local sports teams were playing for a championship, someone use to dress the ducks up. Always great for a photo op.",
   "Beloved sculpture from the book, \"Make Way For Ducklings.\" I love that they ducks are seasonally dressed. Seek them out.",
   "I love these ducklings. Such a joyful and fun and very-Boston statue.",
   "I couldn't resist stopping by these adorable ducklings while on my Freedom Trail journey. You don't need to be a kid to enjoy the sheer workmanship put into each duckling and mom."
  ]
 },
 {
  "name": "Bunker Hill",
  "address": "Freedom Trail, Boston, MA 02129, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cd90d174-932e-11ea-a3d1-14b31f159f22.png",
  "tags": [
   "history",
   "parks",
   "walk",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13320476307502236265",
  "source": "GoogleMaps",
  "reviews": [
   "It's located in a gorgeous area in Boston. But a whole lot immediately around it as far as restaurants but the neighborhood is top notch. Great history there and a few stories around the area but would recommend buying a guidebook at one of the parks like Boston Common to get full details. Such a rich historical area is not to be missed.",
   "It was a wonderful experience, i walked the entire freedom trail and it led me here at the end. It was nice after a long walk to relax on the lawn of bunker hill and just enjoy the nice cool air after a long walk through the city, and after you visit the monument you can cross the street to see the museum.",
   "Nice relaxing place with grassy hills to take a nap after a good day's hike.",
   "I enjoyed the 200+ steps to the top of the monument even though the view from the top was less than spectacular with the small windows and crowded room.  \n\nFor those of you not sure whether you are up for the climb, there is a railing but  the steps are fairly narrow, there is traffic coming both ways and there are no benches.\n\nYou need to get a time slotted ticket from the Bunker Hill Museum (43 Monument Sq) in order to be allowed to climb.",
   "Fun to walk up to from the Charlestown landing"
  ]
 },
 {
  "name": "Hatch Memorial Shell",
  "address": "47 David G Mugar Way, Boston, MA 02108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cdefbaa8-932e-11ea-b121-14b31f159f22.png",
  "tags": [
   "performance",
   "music",
   "walk",
   "cheap",
   "free",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11267090502930439786",
  "source": "GoogleMaps",
  "reviews": [
   "This was the first time we drove up to see the Fourth of July celebration and it  is worth the long drive.  The last time was Williams lady performance back in the 60s and last week was no exception.  Listening to the Boston Pops on a beautiful evening was enchanting.\n\nThe area  in front  of the amphitheater is a nice grassy area to spread out your blankets and enjoy the evening.  As you would assume the music was excellent and the opportunity to talk to people from all over is a plus.  I met a couple from England who wanted to experience a traditional  fourth and they were so very pleased. Where we say we also could see the fireworks which were fun to watch.  When the canon went off it was LOUD and so many people jumped.  I think we forget how noisy those are.\n I must admit the audience and the people of Boston were especially kind.  My husband  is in a wheelchair and the people couldn't have been nicer and thoughtful.  So many people have support and assistance when needed.  They asked first to make sure to respect him.  Thank you Boston",
   "I've been to a few events at the Hatch Memorial Shell.\n\nGoing on July 3rd to see the Pops dress rehearsal here is one of my favorite Boston traditions. \n\nGoing to the Water Lantern Festival hosted here was cool - but not as streamlined as the more established events (like the Pops concert).\n\nThere are also cool statues and great views of the city - Boston and Cambridge - making it a nice stopping point any time.\n\nIt's in a lovely location along the river. By bike or foot it is easy to access - there are foot bridges across Storrow Drive making it safe to access. There is not a train stop super close though so plan ahead for that!",
   "I was expecting it to be a lot larger than it turned out to be. Didn’t go for anything in particular just saw it on the map and wanted to check it out in person. It is located by a really nice trail that goes around the water. Would recommend a 5 minute walk past.",
   "An awesome place to watching a show. Many free or cheap events throughout the year including Movies,  and concerts. The biggest event being the Boston Pops fourth of July Spectacular. Overall its a great spot along the banks of the Charles River.",
   "Beautiful place to chill. You can have fun picnic with your family when there is no ticketed event. Enjoy the Charles River on the edge. Have fun walking, jogging, or biking"
  ]
 },
 {
  "name": "The Institute of Contemporary Art",
  "address": "25 Harbor Shore Dr, Boston, MA 02210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce3c83d8-932e-11ea-b02e-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8840853673009337146",
  "source": "GoogleMaps",
  "reviews": [
   "I rode my bike there from my South End home and loved the exhibits. However, I'd have a very different opinion if I had planned this  with friends and had to pay for parking because there were only a few rooms with artwork open since the museum had closed off some important rooms while they installed new exhibits. Admission was free because of this but I would have been very disappointed if I wasn't a local. There's really nothing else in the area to see, unlike the Avenue of the Arts in the Fenway where you have many choices of museums within an easy walk of one another.  I must add that the view from the glassed-in deck is one of the best in town of the waterfront and harbor.",
   "The ICA Boston is one of the most serene museum experiences that I’ve had. Located on the water there’s an incredible viewing deck that looks out onto the water on the fourth floor. The exhibitions are relevant and very contemporary, usually featuring a diverse roster of artists and themes.",
   "Love it here, the artists that they procure are amazing. They are always finding someone who designs and creates that makes one think and reflect not only about themselves but what is going on in the world. I go almost monthly because the vibe there is thrilling.",
   "My wife an I went to the love is calling exhibit. It was cool, but only got to spend 2 minutes in there which was not enough time at all to take in everything and take pictures. There also isn't much to see in the gallery.",
   "Nice museum, I always come here on the free Thursday evenings. Decent size, you don’t get tired walking around since only a few floors have exhibits. Have some interesting exhibits. Parking seems a little expense in the lot right outside the museum. Love the gift shop, haha."
  ]
 },
 {
  "name": "Boston Light",
  "address": "Little Brewster Island, Boston, MA, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ce7bd706-932e-11ea-b726-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=18419056799095758538",
  "source": "GoogleMaps",
  "reviews": [
   "To clear up some history: the current lighthouse at Boston Light is NOT America's first lighthouse, it is America's second lighthouse. The original Boston light, which was the first in the country, was torched by those pesky redcoats during the American Revolution. Then New Jersey pulled up and built a lighthouse before Boston Light could be rebuilt. TLDR, the current Boston Light is the second-oldest. Still dope tho.",
   "Boston light is America's first LIGHTHOUSE",
   "I do Boston harbor tours and we always include Boston light.",
   "",
   ""
  ]
 },
 {
  "name": "The Lawn On D",
  "address": "420 D St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cebd31c8-932e-11ea-9439-14b31f159f22.png",
  "tags": [
   "family",
   "music"
  ],
  "link": "https://maps.google.com/?cid=6158667416260886342",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place to hang out and bring friends and family. Swings are SUPER FUN, they have lots of games and even music sometimes, but also drinks and snacks. It is even romantic enough for a fun date location after dark. Sometimes there are freebies given out for partnered events with other companies. They do close for the winter tho because nobody wants to be outside in freezing Boston temperatures. I do recommend everyone visit here to see how fun it can be!",
   "Sterile space with fake grass made for compulsory corporate-sponsored fun. No charm. Gentrification has sucked the air out of the whole vicinity.",
   "It seems like a lot of fun and different; place is closed for the season (website didn't inform about this).",
   "Great place to spend an afternoon in sunshine. Swing on the swings. Enjoy live entertainment in the tent or enjoy a rousing game of cornhole.",
   "Nice place,clean,few games around to play ,security is around. People do hog the swings though which is not good since its the main attraction going there and everyone is hoping to get a turn. I Think having a timer on them would be a good idea,just a thought"
  ]
 },
 {
  "name": "Christopher Columbus Waterfront Park",
  "address": "Atlantic Ave, Boston, MA 02110, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf07f698-932e-11ea-ac0a-14b31f159f22.png",
  "tags": [
   "walk",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3609661517394149532",
  "source": "GoogleMaps",
  "reviews": [
   "This is a popular place for picnics, wedding pics and just hanging around. Plenty of greenspace facing Boston Harbor for everyone. The space is very clean and well maintained. The arch way is always decorated during the Holidays adding a festive glow.",
   "Took pictures of my friend here for her announcement of which dental school she was going to. Great park to view the water, the city, and just enjoy time outside at! Would reccomend!",
   "Gorgeous little park! You have the water a glance away, the Rose Kennedy Greenway across the street, and plenty of daytime events in the warmer months. In the colder months, closer to the holidays, they light up the archway and it's just an amazing spot for a walk after dark.",
   "It’s so beautiful! Amazing! Serene and calm and just beautiful. So many people are just chilling and relaxing. It’s a family hangout and a couple hangout. You can easily just sit and spend time here letting time fly. Completely recommend visiting this place.",
   "Took this shot on Christmas night! My favorite time to go to Boston its literally like a ghost town! Enjoy🎅❤💚"
  ]
 },
 {
  "name": "MIT Museum",
  "address": "265 Massachusetts Ave Building N51, Cambridge, MA 02139, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf5860ae-932e-11ea-8783-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "family",
   "walk",
   "art",
   "history",
   "kids",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14675026944979006317",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! Very cool museum. My two boys 12 and 8 absolutely loved it. It’s relatively small so I would plan about 2 hours to see everything. My kids loved  all the robots and technology. The presentation on the slide ruler was fascinating. It’s a great place to take the family.",
   "If you love science, particularly physics, you will enjoy this museum. I found it kind of interesting. Most of it was dedicated to the science of movement and part of it to image and video. It is actually pretty small, and you can easily get through it in about an hour. There is an extensive part of the museum that feature boat construction. I expected something totally different going there (like cutting edge tech, robotics etc.), but I still enjoyed it.",
   "My family had a fantastic visit today at the museum. From the minute we walked in Beth greeted us and was the best ambassador!  Lots of cool exhibits from robotics to the Polaroid experience and nautical science made this a great place to visit at MIT!!",
   "From the great conceptual motorized sculptures to current innovations to the history of technology... And even art... This is a fun and stimulating small museum, a short walk from the MIT main campus, and a little further from Harvard.",
   "This museum is a great place for kids and adults. It is a fascinating blend of a science museum and an art museum. \n\nThe kinetic sculpture exhibit is incredible. Other major exhibits cover ship building and the history of Polaroid camera.\n\nParking is not provided, so you'll need to use a nearby garage or the street meters."
  ]
 },
 {
  "name": "Old State House",
  "address": "206 Washington St, Boston, MA 02109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cf9bab90-932e-11ea-b266-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "kids",
   "history",
   "historic",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17902771637382909399",
  "source": "GoogleMaps",
  "reviews": [
   "Our docent was pretty incredible and made for a high quality experience. She did a great job explaining the history of the location, and connecting it with current events. She even tactfully managed some of the more \"uninformed\" adults in our group very well. It was a shorter tour than most, but very engaging. I would recommend visiting.",
   "The building was built in 1798 and was designed by the famous eighteenth-century architect Charles Bullfinch. In addition, he designed the United States Capitol in Washington, DC. The interior of the building is magnificent, and the flag hall is located under the dome to collect the flags of the civil war period. Frescoes about Revere's Flying Riding News and the \"Boston Tea Party Case\" decorate the Senate staircase. A famous wooden fish, Massachusetts' \"sacred cod\", hangs in the lobby of the House, demonstrating the importance of fishing here since 1784. Underground archives and museums contain precious historical documents such as the Mayflower Peace Treaty.",
   "I wasn’t able to go inside as I had a stroller and two kids and it’s not wheelchair accessible but this is definitely a place to see if you have the chance. The massacre site is just behind it and we saw that. It helps to know the history of what actually happened. When you know what happened you can picture what those involved saw at the time and how their surroundings might have affected the outcome of the massacre.",
   "This historic building has been dwarfed by skyscrapers, so you come upon it almost as a surprise. It's on a little triangle between busy thoroughfares. Yet, it retains its 18th century elegance and sense of history. This is where the Boston Massacre happened - the guides will tell you. Here's to the guides - They do a fantastic job. I've taken two separate tours with two separate guides. They're all fantastic!",
   "It small and fun to explore, but maybe not worth the cost of admission. It's quite cramped since you have to fight with an ocean of tourists to move around in tiny hallways and rooms, but everything is beautifully preserved. Maybe try to go here at an off time, as peak hours are going to be a little miserable."
  ]
 },
 {
  "name": "Harvard Square",
  "address": "18 Brattle St Suite 352, Cambridge, MA 02138, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/cfe5acf4-932e-11ea-a663-14b31f159f22.png",
  "tags": [
   "music",
   "art",
   "walking",
   "walk",
   "walking",
   "tour",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6470010419957611382",
  "source": "GoogleMaps",
  "reviews": [
   "Harvard Square is awesome. There are lots to do especially in the summer you will hear musicians outside. There is a man in front of the main train station that paints & sells his art. Lots of shops & a variety of restaurants here. Also, on 42 Brattle St. there is the Cambridge Center for Adult Education, which has a variety of classes including cooking, dance, music, business etc. Also, Central Square & Porter Square are within walking distance with tons of eateries. Harvard Square also has access to trains & buses to get you where you need to go! Must visit!",
   "Nice area to walk around without loads of crowds. The campus and buildings are beautiful. Very safe area at night! \nLots of great restaurants and things to do in walking distance. \nIf you are looking for shopping there aren’t as many options as there used to be. The shops that are here are great though! I wish there were more boutiques but otherwise I enjoy the area!",
   "Harvard University is definitely worth your time. If you get to it, begin your Harvard tour here. Firstly, it's a main thoroughfare with great historical buildings nearby. Next, many stores, gift shops, a bike stand (recommended) and a bus stop are on here. Finally, it provides access to the main Harvard square where most of the historic buildings are clustered. Tour guides available.",
   "There's nothing extraordinary about this Square, but it's the heartbeat of the university and it feels cool to be standing there at this world famous university. \n\nThe main attraction here is the statue of  John Harvard, the man who founded the university. It's also known as the \"statue of three lies\". I'll leave that for you to find out why.\n\nIf you intend to visit Harvard, you cannot miss this. It's a must-visit. At the very least, you can admire the architecture of the buildings around you.",
   "Food for every palate. Fun shops. Harvard Bookstore is right across the street from the Red Line T station. Definitely check out Otto's Pizza. Better to visit during warm weather months."
  ]
 },
 {
  "name": "Harvard Yard",
  "address": "2 Kirkland St, Cambridge, MA 02138, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d02f9cd8-932e-11ea-9a1f-14b31f159f22.png",
  "tags": [
   "history",
   "free",
   "walking",
   "tour",
   "art",
   "free",
   "history",
   "walking",
   "knowledgeable",
   "tour",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13414499258891102352",
  "source": "GoogleMaps",
  "reviews": [
   "Good look at history. It's kind of amazing to imagine how for almost 300 hundred years scholars have been walking the same paths as you if you were to visit the yard. Some go the buildings here are 250-300 yrs old. And the guided tour (which is free and can be found near the Harvard sq. T station) is full of quirky history. Don't forget to rub fake John Harvard's shoes if you want to get into Harvard. \n\nNote to the Traveller: the Harvard campus is way bigger and than the yard and the art museum and museum of natural history are wonderful places to visit. You might also consider buying cheaper H paraphernalia at shops around the yard instead of at the Co-op store.",
   "It's Harvard, an iconic American Ivy league university. Honestly, I had no desire to visit but my wife, being from another country, had the curiosity and the last say. What can I say, it's a pretty campus with a rich history. If you really would like inside information o would advise one of the many free walking tours. Honestly, besides the history and it's stature, it's just a college campus. However, if you have a thing for campuses and or Harvard, by all means enjoy...",
   "Did not expect it to be that cold, this late in March. But freezing nose and fingers aside, we were quite happy with our guide on the prospective students tour. Quite knowledgeable about the campus geography and history (This is Harvard so that's quite a lot of history) and done on time too Did not expect it to be that cold, this late in March. But freezing nose and fingers aside, we were quite happy with our guide on the prospective students tour. Quite knowledgeable about the campus geography and history (This is Harvard so that's quite a lot of history) and done on time too",
   "Worth seeing if you are visiting Boston. Their guided tours are free, but fill up very fast.  Make sure you call early and sign up.",
   "The park isn’t really that interesting other than being near Harvard. It gets incredibly crowded during the summers with tourists from all around. This park should not be your “go-to” if you are traveling to Boston. Boston Common is much prettier and well maintenance than Harvard Yard."
  ]
 },
 {
  "name": "Boston Harbor Cruises",
  "address": "1 Long Wharf, Boston, MA 02110, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d087986e-932e-11ea-8a3c-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8549897264969697282",
  "source": "GoogleMaps",
  "reviews": [
   "Great fun !! Cruise experience was really good. Superb Boston downtown and Boston skyline views. Loved to take many photos and videos of the cruise. The harbor ride was exciting and the boat was really cool. The guides were giving all the information. The cruise went really well. Highly recommended.",
   "Had so much fun! Definitely a relaxing way to see all of Boston harbor and we learned some interesting historical facts to go along with the view. Highly recommend!",
   "Great way to see the city. They will give you the history of a lot of what you are looking at. Top decks on starboard side is where you will get the best views. Very enjoyable experience.",
   "Very informative and friendly staff.  Reasonable prices.  Easy way to go to Salem.  If the weather is great, get out of Boston for a bit.  See history in Salem!",
   "Port cities grow up around their harbors, so getting out on the water is the best way to get a feel for them.  The harbor tour didn't disappoint.  Very good guide, talked enough (boat was big enough to get away from her completely it you wanted though - smart), but not continuously and was great about answering questions in person when she wasn't talking."
  ]
 },
 {
  "name": "Haymarket",
  "address": "100 Hanover St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d0cedade-932e-11ea-a9ab-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "cheap",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=8861289241526484208",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to get your produce cheap for the week. Lots of options for great prices, I go every weekend and get a week's worth of veggies and fish. Last week I was able to get 2 pounds of fresh haddock, two things of raspberries, blackberries, a pound of potato's, broccoli and some really good cheeses for all under $20. Such a great way to start the week. The market happens every Friday and Saturday from around noon to four I believe. I'd recommend you to bring bags unless they will be giving you plastic bags which you may want to avoid.\n\nMy diets protein is based off fish so I love the money I save here. I've gotten fresh salmon for as low as $4 a lb, if you get a few lbs you can haggle down your price. Best is the fresh tuna stakes you can get for around $3 a pound! And swordfish for the same! Such variety in the food I can afford now. When I go to the grocery store I just end up buying bags of frozen fish that cost much more then the fresh fish I'm getting here. I will tend to buy it then freeze it into portions for the week or for a few weeks. Saves me a lot sense the more you get the cheaper you can get it for.",
   "The best place to get fresh produce. Fridays and Saturday morning are the best times to go. After that you are probably going to have to search for the good stuff but it's not impossible. They have everything from fresh herbs to several types of fish, oysters and clams. You will save half your money going here compared to the supermarket. Shop here you won't be sorry at all",
   "The vendors are rude. But there are a few vendors I go back to because they're more personable. The produce is cheap and you do in most occasions get what you pay for.  But every now and then, it's a good deal.",
   "Shop it and get great, to good, to OK produce all at very good prices. Wonderful admixture of ethnicities and people both buying and selling. I really dig my jaunts here.",
   "Would give 10 stars if possible. So fun. So cheap. So good. So green. What's not to love? Bring your own bag for extra credit."
  ]
 },
 {
  "name": "Commonwealth Avenue Mall",
  "address": "484 Commonwealth Avenue, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d11ab10c-932e-11ea-8948-14b31f159f22.png",
  "tags": [
   "unique",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=11209137415704793194",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful stretch of Comm Ave. Houses reminded me of Paris.",
   "Master architecture, greenways and happy dogs make for a great stroll.",
   "This is a very beautiful area! I love the buildings and the way this area was built. There's tons of unique restaurants and shops around to see also.",
   "Commonwealth Avenue Mall is a lovely place to sit under the canopy of the trees, relax and enjoy nature, to observe people stroll along the mall, children running around and playing, and to see all manner of activity along Commonwealth Avenue.",
   "Love this park. It's one of my favorite spots in Boston, and I've visited this park on most of my trips to the city in the last few years. I'm sure I'll be back on any future trips to Boston."
  ]
 },
 {
  "name": "Cocktails & Cannoli",
  "address": "191 Hanover St, Boston, MA 02113, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d172e368-932e-11ea-8d5d-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "walking",
   "food",
   "learn",
   "history",
   "walking",
   "drink",
   "tour",
   "unique",
   "delicious",
   "organized",
   "walking",
   "tour",
   "drink",
   "tour",
   "eat",
   "history",
   "knowledgeable",
   "tour",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=15369163228044623900",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! This walking tour was amazing. A bit of history, lots of recommendations. The treats and cocktails were great. Elisabeth was super personable and a great guide. Would recommend for anyone coming to Boston.",
   "Pat was the best host you can imagine for a walking tour. The dessert / drink stops were spaced well and had the perfect combinations! You get to see landmarks like Old North Church, and also learn about the history of the area in a way that leaves you feeling like a local. There were tons of interesting fun facts as well as water and great food and drinks (it was such a bonus to skip the lines for everything!) It was also great that all the shop owners were super friendly with our guide and quick to serve us.\n\nThe best part of the tour was that you get to try one cannoli of each of the two best shops in the North End. Instead of waiting for 30 minutes at one of the two, you get to do a blind test to compare and see the different styles that each shop has. Choose your favorite. It was an amazing way to spend the afternoon and super fun! Highly recommend!",
   "My boyfriend and I had a fabulous time on this unique tour. It was incredibly well organized - whenever we showed up to a place, the cocktail or dessert sample was already ready to go. Everything was delicious! Pat, the owner and primary guide, is a resident of the North End so our walking tour was peppered with historical facts and sites as well as a local's perspective. He was very personable and engaging. I highly recommend this tour and will happily return in the future!",
   "GREAT EXPERIENCE! Pat (our tour guide) was so accommodating with everything from booking the tour, communicating throughout the process, and overall making the tour such an amazing part of our Boston trip. We went as a group of 12 girls and hands down this was one of our favorite parts! Not only did we get to eat and drink our way through Boston, we also learned a lot of fun facts and history. I would without a doubt highly recommend this tour!!!",
   "Great tour! very well organized, lots of information (Pat is very knowledgeable) and very good cocktails and desserts. I particularly loved the visit to the chocolate place and the Old North church, which had its own guide explanation."
  ]
 },
 {
  "name": "Old Town Trolley Tours of Boston",
  "address": "200 Atlantic Ave, Boston, MA 02110, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d1eb481a-932e-11ea-a770-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9413905807766064131",
  "source": "GoogleMaps",
  "reviews": [
   "Tours are very informative and entertaining. You're able to hop on and off at 15 stops around the city. When it's cold the windows do limit the ability to take photos but over all a definite recommendation for anyone visiting",
   "The key ingredient to all of these tours is the tour guide. Some are too much, some are not enough. Some too many personal notes, and some too many dry facts.  But... they get you around to all the key spots on your own schedule because they are hop on, hop off. I love them!",
   "Excellent way to tour Boston.  The tour guides are very knowledgeable and buses every 30 minutes st each stop was very convenient.",
   "We found a trolley stop  but no prices were listed. We went to ask a driver about how it worked and he said just hop on and we'll take care of you at another stop. We were surprised about an hour & many stops later to find out it was $46 a person. We thought that seemed a little bit expensive. He dropped us off at the end to pay. At that point we were given an out-of-date map. I mean the stops were the same but it said the deals that you would have got in 2018. It mentioned that we should have gotten about $50 worth of coupons so that we could have gotten off at stops and gone to museums at a discount or for free. We did not get any coupon books and we did not find out that it was an option until we already finished the day and paid and left and were looking at the map. I would do this again but I would strongly recommend starting at a stop where you can pay and getting all of the information up front. If you got on in the morning and got off at each stop and visited things you could spend an entire day doing this! It is a great deal of fun but a little more communication up front would have been helpful and actually getting what we were supposed to would have been terrific too.",
   "Great drivers, great time.  Love being able to get off and on....if you really want to use this trolley as a way to easily see a lot of Boston, buy the 2 day pass...1 day was not long enough !"
  ]
 },
 {
  "name": "Chinatown Gate",
  "address": "John F Fitzgerald Surface Rd, Boston, MA 02111, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d237e1d0-932e-11ea-b05e-14b31f159f22.png",
  "tags": [
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11593699815127774668",
  "source": "GoogleMaps",
  "reviews": [
   "People take pictures here but nothing special. Lots of elderly hang out there. You will find some people playing Chinese chess",
   "Beautiful place and definitely worth visiting. It will probably be a little crowded, and maybe a little dirty too. But, it's a nice place and I like how it looks a lot more than Chinatown in New York City. Go, enjoy it, and take beautiful pictures!",
   "Chinatown is a great place and has a few blocks in Boston of what feels somewhat like the American understanding of China.\n\nOne of few places in the city where you can find shops, stores and restaurants open on Christmas.",
   "The gate was definitely cool to see. Fun area! Always interesting to see how Chinatowns in different cities carry such unique and authentic feels in their own way.",
   "I wouldn't make a trip just to see the gate itself, but if you go through it into Chinatown, there are many great shops to get food and unique/culturally specific items"
  ]
 },
 {
  "name": "Harvard Art Museums",
  "address": "32 Quincy St, Cambridge, MA 02138, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2893646-932e-11ea-a147-14b31f159f22.png",
  "tags": [
   "art",
   "organized",
   "free",
   "free",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=16375726853001377607",
  "source": "GoogleMaps",
  "reviews": [
   "The museum is very clean and organized. The selection of art (my wife is interested in art, me...sort of) was varied and interesting, with a large selection of beautiful paintings, sculpture and historical pieces. The security team there is very friendly and helpful....front desk staff not so much but it was one person acting that way and I'm sure there are many other helpful employees here. Still 5 stars as my wife had  a wonderful time!",
   "Really friendly and young staff who enjoys being there! I got in for free with my international student ID which is fantastic. Only thing I would have appreciated more is a clear starting and ending point or a chronologically laid out itinerary",
   "Fantastic art museum... Comparable to the Museum of Fine Arts. Some outstanding pieces including Monet and stuff. Came here with my Brazilian friend and she loves it too. We had free entrance cause we are students. 5/5 stars would def recommend...",
   "Great place.  If you are in the area worth to stop by and explore the art exhibits. There is an entrance fee of $20 for the general public. Not sure of there is a student or senior discount. They also have lockers to store your items. Museum is a good size but u can get thru in couple of hours depending on how much of an art fan u are !",
   "Great collection. The coinage exhibit is worth your time. Spent a relaxed 2 1/2 hours there. I'll go back."
  ]
 },
 {
  "name": "LEGOLAND Discovery Center Boston",
  "address": "598 Assembly Row, Somerville, MA 02145, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d2ef7254-932e-11ea-8f3f-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14280015946936412102",
  "source": "GoogleMaps",
  "reviews": [
   "It's a great day trip with the kiddo. We have so much fun creating!! It's busiest in the middle of the day. Lines were nothing later on after dinner! And a ton of the little bag Lego have a coupon on the back so your kid gets in for free with one full price adult ticket! It's worth it! Plus you get more Lego!!! TIP toronto is bigger than here",
   "It's a great day trip with the kiddo. We have so much fun creating!! It's busiest in the middle of the day. Lines were nothing later on after dinner! And a ton of the little bag Lego have a coupon on the back so your kid gets in for free with one full price adult ticket! It's worth it! Plus you get more Lego!!!",
   "Good place to entertain kids on an afternoon or a morning. It is not really big but can keep kids entertained 2-3 hours. The 4D cinema experience is fun. The rides also appeals to all kids. The staff is friendly and helpful. The place is surprisingly clean and well ventilated even though it can be rather crowded in the weekends. The Boston Lego display is very cool and gives you ideas. The regular entry fee is expensive, look for coupons or sales. The annual pass is a better option if you live in the area.",
   "Great place to go to on a cold or rainy day. Plenty of stuff to keep kids occupied. We spent almost 5 hours bouncing around from one thing to another. The extra $5 for the activity pack keeps them even more entertained. More than reasonable priced to get in too.",
   "Very cool LEGO display of Boston. Fun place for a snowy evening with the kids. Small although each area keeps the kids attention for at least an hour...or more. As a parent time can creep slowly as it’s small and limited things to do. And no windows. All in all we had fun!"
  ]
 },
 {
  "name": "Boston Massacre Site",
  "address": "Corner of State and, Congress St, Boston, MA 02109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3581f90-932e-11ea-9684-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "history",
   "walking",
   "historic",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11121560680085549931",
  "source": "GoogleMaps",
  "reviews": [
   "Walked the freedom trail and the walk may not be for people who are not used to walking a few miles. The historical sites are fascinating to visit and there is so much History in the Boston area. I would definitely recommend a visit for the family. Summer can be a bit humid, so make sure you have enough water when walking through the city.",
   "The place marks the beginning of American Revolution. The trail walks you through most of the historic places in Boston and places which led to American Revolution. It's a must visit location and especially for people who are enthusiastic about history.\nBest time to visit - summer/fall!",
   "You must book a tour that includes this historical event to really appreciate it. If you do not then you be standing in front of a marker that represent an 18th century event without its context.\nIn such a case, pay a visit to the buildings in the area that have a lot of history to tell also.",
   "250 years ago this spot marks the beginning of the American revolution. Actors are volunteers.  Important stop on the freedom trail.",
   "One of the coolest places to see on the Freedom Trail. We exited the near by subway on our first day in Boston and we're standing on the spot of the massacre and didn't realize it because we were trying to figure out where we were. Not important, but I thought it was funny."
  ]
 },
 {
  "name": "Symphony Hall",
  "address": "301 Massachusetts Ave, Boston, MA 02115, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3ab48ba-932e-11ea-a2f0-14b31f159f22.png",
  "tags": [
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=788099498541801360",
  "source": "GoogleMaps",
  "reviews": [
   "Boston Symphony is a very old and nice place to just visit. The architecture is adorable. I felt like I am in a museum with these amazing statues all around the salon. The waiting salons have old pictures of the pianists, which are very nostalgic. It is nice to see while drinking the wine. I really enjoyed listening Tchaikovsky violin concerto in this fascinating salon.",
   "There are a variety of wonderful performances here. The staff are friendly and helpful. It's no small feat to create a formal atmosphere but to remain inviting. The hall has fantastic acoustics and gorgeous architecture. I love this place!",
   "This concert hall has amazing acoustics. Also nicely set up so it doesn't feel too crowded either in the corridors, or in the seating. More toilet facilities would be nice, however!",
   "Great old concert hall in Boston. The acoustics are amazing and there is not a bad seat in the house. I have been to a few shows here and always enjoyed the atmosphere. Everybody is friendly and the concerts are always amazing! Highly recommend!",
   "Seating for Pops concerts is VERY crowded, but show was SPECTACULAR!  They definitely have fun and put you in the Christmas spirit.  Their version of The 12 Days of Christmas is both funny and amazing.  Great for a family event. Food served at tables is of generous portions."
  ]
 },
 {
  "name": "St. Leonard of Port Maurice Parish",
  "address": "320 Hanover St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d3fac87a-932e-11ea-ad97-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "art",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9230584440266936691",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful Church,and what an outstanding praying ground's walk through and enjoy such beautiful religious art work, statues, nice place to sit down relax and enjoy, pray 🙏 to Lord, for just about anything, forgiveness, prayers for friends and family etc. I could on. Go there and enjoy.when your at Mike's Pastry on Hanover St North end of Boston. Corner of prince and Hanover. Enjoy.watch the kids play b-ball on the side of the church.🙏",
   "Beautiful church, open gates to welcome all to come pray. Candles to light, and mass is delivered in English and Italian. \nWhere my grandparents exchanged vows to begin what became 72, beautiful and bonded years of love and devotion until they were separated by death to reunite in heaven. \nTourists or a local, come to say a prayer, or honor a loved one. Or just see the beauty!",
   "St. Leonard's is a beautiful church. There are plenty of saints to pray to. It is open during the week to light candles and pray. The Sunday mass at 12 is great for locals and tourists.",
   "I love St. Leonard's Church. The service on Sunday is wonderful for local families and tourists. The saints are there to pray to. It is also a great place to go on any day to light a candle for a loved one. I highly recommend.",
   "This church is really beautiful. Very ornate and well lit. It can seem unassuming from the outside but once you walk inside you will be amazed. The gardens outside are always meticulously kept. Worth a stop in."
  ]
 },
 {
  "name": "Samuel Adams Statue",
  "address": "Boston, MA 02109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4493f7e-932e-11ea-9f97-14b31f159f22.png",
  "tags": [
   "independent",
   "unique",
   "food",
   "history",
   "free",
   "eat",
   "performance"
  ],
  "link": "https://maps.google.com/?cid=5848591357533705519",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty interesting spot. It's right next to some indoor markets / food courts so it's a great spot to check out for lunch. \n\nThe food court is not mall style with popular brands. It's all independent vendors with some super unique offerings.",
   "I loved all the old buildings and sense of history here. Wish I would have had more time to explore. I especially would have loved to have had a beer in one of the taverns that have been around since revolutionary times!",
   "Great landmark but no free beer.",
   "Great location for statue. Right next to Faneuil Hall and incidentally the Sam Adams Tap Room!",
   "Great place to hang out, can watch some wonderful people showcasing their talent,  wide variety of interesting things to see,  eat and buy! Especially enjoyed the performance of a young boy who sang and played the guitar. Watch out for the video..Soul stirring!"
  ]
 },
 {
  "name": "Old South Meeting House",
  "address": "310 Washington St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d4bebdf8-932e-11ea-bbeb-14b31f159f22.png",
  "tags": [
   "family",
   "active",
   "learn",
   "free",
   "history",
   "knowledgeable",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10942027656038740366",
  "source": "GoogleMaps",
  "reviews": [
   "Historically beautiful interesting for adults , lame for children . Admission fee is reasonable . Pick one of the churches and visit our of the three. We visited all three and they all were the same . Look from outside at the other two. But the old north , church , Kings chapel , and old south meeting place interiors are pretty much the same. Yes each place has a different significants but inside they are alike. For a family on a budget one of the three is good enough for the interior.",
   "Since 1877, The Old South Association in Boston has preserved the 1729 Old South Meeting House as a busy museum, treasured landmark, and an active center for civic dialogue and free expression. A must for a visit to Boston. Learn the valuable part it played in the formation of the nation.",
   "A historical and beautiful building. It's actually a cool place for a wedding. Did you know that this was where the original Boston Tea Party plot started and the British retaliated by turning it into a riding school?",
   "Well worth visiting whilst you’re doing the freedom trail. This building, much like Boston itself, is steeped in history!",
   "Great exhibits and knowledgeable information, and it was in the perfect location when walking through town. I loved the exhibits, the staff, and restorations and the preservation at this museum. They close at 4pm, so we didn't have a lot of time there, but it was worth it for the time we were there"
  ]
 },
 {
  "name": "Castle Island",
  "address": "2010 William J Day Blvd, Boston, MA 02127, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5053d0c-932e-11ea-849c-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "walking",
   "walking",
   "walk",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6269172579819288866",
  "source": "GoogleMaps",
  "reviews": [
   "Great views!\nGreat ‘getaway’ from normal daily stress.\nGreat for ‘people watching’, checking planes coming and going from airport across the bay.\nYou must get something at Sullivan’s; great prices and selection of food.\nBeach if you want.",
   "My first visit to Castle Island was on a cloudy wet afternoon. While the weather was typically poor, as you might expect on a January day, I could still see this was a gem of a location. I plan to come back in the spring. \n\nThere are beautiful walking path, some nice beach areas, and a lovely view of Boston Harbor. there's also a good prospect of Logan airport, you can watch the planes take off and land.\n\nThere is a small children's playground, bathrooms that are open in the summer season, and a snack bar as well. An ideal place to spend a beautiful day. Even in the midst of drizzle and mist I greatly enjoyed walking along the paths and appreciating the sea breeze.\n\nThe Boston Korean War Memorial is also located here. It's a wonderful little Monument right on the shores of Boston Harbor. To get there you take a short walk from the parking area around the outskirts of Fort Independence, to the east side right along the water's edge.",
   "What a great way to spend time to get some rest and relaxation. This is the best way to get some walking in. The view is breathe taking. The walking path is great and you can meet the locals.",
   "Love it here.  Beautiful place to go for a walk/run. Bring your dogs for a walk. You can watch the planes come in.",
   "There's no better place to go outside in the summer! Get some grub at Sullys, walk around enjoying the constant (almost) breeze....playground for the kids AND a small beach so THEY love it.... It wouldn't be summer without Castle Island!"
  ]
 },
 {
  "name": "Trinity Church",
  "address": "206 Clarendon St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5589936-932e-11ea-b678-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "historic",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=439829100512357228",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best architecture for a church. The church gets lit in the evening. The architecture looks very ancient yet astonishingly beautiful. Best time to visit the church is before sunset. Although we did not get a chance to see the inside, I can only imagine how good could it be.",
   "Omg. No words! I was in awe the whole time there.  The audio tour is great...not boring, but fascinating! I'd love to go to a service. The alter and the dome around it is stunning and so much history! It's beautiful on the outside at night, a must see and photo opportunity.  The stained glass of Jesus at the front of the church is a must see. It tranquilized me. I prayed for a bit. So moving.",
   "Very Beautiful architecture. When we visited the organ player was practicing and it was so cool. We only had a very quick visit but it’s well worth a look. \nComing off the busy streets to a beautiful serene environment is wonderful.",
   "We went here for Christmas Eve service and really enjoyed it. There were predictions of long lines to get in but we only waited about 10 minutes. The church is lovely; quaint and historic. We sang old-school hymns from the hymnal and the priest's message was spot-on. Really enjoyed the whole experience.",
   "I walked by this church so many times before going in and realizing what great historical value it has (starting with the foundation). I was really impressed with all the details on the inside and how much more colorful it was than I was expecting it to be. It is cheap admission and we'll kept, so I would recommend it as a quick trip to anyone that is in the area and has not seen it yet."
  ]
 },
 {
  "name": "Warren Anatomical Museum",
  "address": "Francis A. Countway Library of Medicine, 10 Shattuck St, Boston, MA 02115, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5b7d05e-932e-11ea-ad04-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "walk",
   "library"
  ],
  "link": "https://maps.google.com/?cid=10481349219107688115",
  "source": "GoogleMaps",
  "reviews": [
   "Loved all the amazing exhibits and information about the medical history of Harvard Medical School.",
   "Much smaller than expected. Amazing, no doubt.. just wish there was more.",
   "A random part of history on display. The eagle skeleton is top notch.",
   "this is really only five displays around the fifth floor elevator. if you're Ajay there it's definitely worth checking out, DON'T walk ½ mile in the rain to see it though",
   "just one floor in a stuffy Harvard library full of squares. no real decaying arm. i am tragically disappointed and you Will be hearing fron me soon."
  ]
 },
 {
  "name": "The Greenway Carousel",
  "address": "Rose Kennedy Greenway, Boston, MA 02114, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d5ff12ca-932e-11ea-a72e-14b31f159f22.png",
  "tags": [
   "music",
   "cheap",
   "kids",
   "music",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10118266402750166611",
  "source": "GoogleMaps",
  "reviews": [
   "My daughter and I absolutely love the Greenway Carousel. Children love to ride on it and adults seem to like the music that plays. It is definitely busy on weekends when there is nice weather. Still there is barely a wait. It costs $4 per ride and 10 for $30. It is a fun activity for sure.",
   "Cheap, fun entertainment just around the corner from Fanuiel Hall Marketplace. It has beautiful views of the surrounding Green Space that was the former home of the less pleasant looking Central Artery. Encourage people to take time out of their visit to Boston to use this time to chill and enjoy the time to reflect on what's around you.",
   "We hit up the ‘ol carousel almost every day we were in town (long weekend visit) and had a blast. Definitely buy the 10 pack of tickets and save a few bucks if your kids like to go 3-4 times a day like mine! The music and the nostalgia the spinning gives you is totally worth it. Also, it’s not nauseatingly fast spinning. It’s on the mellow side of things while maintaining the fun factor. Recommend!",
   "Beautiful carousel for $3 a ride and parents can go with the kids.\n\nGood to see different varieties of animals to ride on along with some great choice of music.\n\nOne request to the organizers if they can add belts on the rides for safety purposes.",
   "I asked my 8 yo what her favorite thing was about visiting Boston and it was this Carousel! I've never seen a carousel with butterflies and hawks but its very nice and has a lot of character. Each ride is $4 or you can get 10 tickets for $30, so bring a few friends or buy a few rides."
  ]
 },
 {
  "name": "Fort Warren",
  "address": "Georges Island, Boston, MA, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d652df1e-932e-11ea-905a-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "free",
   "kids",
   "tour",
   "history",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=11740347815729364008",
  "source": "GoogleMaps",
  "reviews": [
   "Loved this place.  Boat cruise cost $20 round trip and we had plenty of time to walk around the island.  They had free guided tours.  3 options for guided tours which took you to different parts.  Staff there are very friendly. Unique items at the gift shop and visitor center.  Fort Warren is built uniquely and has a lot of unique views.",
   "Very cool fort with lots of plaques of information and many areas to explore within the fort. Don't forget to bring a flashlight!",
   "This place is SUCH a good price for a great experience. Round trip ferry ride gives you great views of Boston and the harbor. Then, the fort itself is wonderful to explore, even with kids. There are places to picnic and bathrooms as well. I went two weekends in a row!",
   "Great place to explore a piece of Boston history.  It is worth taking a tour with a guide.  Stairs to the ramparts do not have hand rails. That part not recommended for small children",
   "Nice outdoor space. It is a short ferry ride to George's Island. Bring a flash light in order to fully explore the fort. Be sure to catch one of the many tours of the island provided by the National Park Service Guides. You'll learn a lot of interesting facts, they do a great job."
  ]
 },
 {
  "name": "Black Heritage Trail",
  "address": "14 Beacon St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d694f15c-932e-11ea-8f08-14b31f159f22.png",
  "tags": [
   "walk",
   "historic",
   "tour",
   "walk",
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7593566689389413087",
  "source": "GoogleMaps",
  "reviews": [
   "Great little walk through, but hard to spot at first. The scenery is beautiful and much needed historic gem for our city. As well for our country too!",
   "Took the guided tour with Amelia and it was fantastic! Great guide, full of interesting information and incredibly friendly/helpful to everyone on the tour, couldn't fault it/her!",
   "Difficult to do bcause there are no signs for navigation.  You do not know where to go and there is not much documentation abour the trail .  The scenery is very nice and it`s a nice place to walk.",
   "I love the idea, but there are few historic plaques/markers and nearly all the buildings are private. There is very little tour literature. With a little bit of improvement, this could be a really good learning experience.",
   "Very nice, a little hard to find, but worth the trip"
  ]
 },
 {
  "name": "Leonard P. Zakim Bunker Hill Memorial Bridge",
  "address": "I-93, Boston, MA 02114, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d6e58acc-932e-11ea-b611-14b31f159f22.png",
  "tags": [
   "parks",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3430605461715638001",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful Bridge To Cross. A True Boston Landmark And An Icon Of Boston. Beautifully Made And At Night Depending On The Day / Holiday The Bridge Glows In Color. Traffic Jams Up But Its Normal Since It Is Boston. Nothing To Do About It. A True Sheen Of Beauty And Well Worth Whatever Toll Is To Be Paid. Make Sure Your Cross This Bridge Wherever You May Go. Its A Sight To Awe About And Enjoy And Depending On Your Location In Boston It Is Fairly Visible. An Enjoyment To Behold",
   "The Leonard P. Zakim Bunker Hill Memorial Bridge is one of the widest cable-stayed bridges in the world. The Bridge serves as the northern entrance to and exit from Boston. The Bridge is named after civil rights activist Lenny Zakim and the American colonists who fought the British in the Battle of Bunker Hill. \nThere are several parks on every side of the river, and a nice walking overpass that allows you going under the bridge and crossing from one side to the other.",
   "This is a beautiful bridge, very well constructed. The veiw at night time is amazing. There is also a small skate park located under the bridge in case you would be interested in skating with a veiw. The traffic is not too bad and is pretty regulated. I definitely recommend taking this route",
   "The Zakimin Boston,MA.\n I always love driving over this beautiful land mark.An absolutely must see day and night. Guaranteed to feel like a true Bostonian after experiencing the wondrous sites from this historical bridge.",
   "We only got a chance to view the bridge during the day and it's a pretty spectacular bridge.  I had no idea who Leonard P. Zakim was without a Google search. I've seen the night photos and can't wait to go back and view the bridge with the lights on.  Kudos on a great bridge Boston!"
  ]
 },
 {
  "name": "Fort Independence",
  "address": "2010 William J Day Blvd, Boston, MA 02127, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d749aec2-932e-11ea-8f20-14b31f159f22.png",
  "tags": [
   "kids",
   "tour",
   "eat",
   "walking",
   "walk",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3319815633533809305",
  "source": "GoogleMaps",
  "reviews": [
   "This is a place I’ll definitely come back to, mostly because I missed the tour. Was so upset about that. It’s a beautiful place, surrounded by the Boston Harbor with crisp, clean air and a place to eat, as well as several monuments, a walking trail, and a park for kids to play. If you’re in Boston, it’s a must see.",
   "A great place to walk and, think clearly. Watch the airplanes. A wonderful place to watch the sunrise and, 🙌marvel at God's Creation for us. Thanks to all the people who work so hard overseeing and maintaining the beach and, grounds and bathrooms, keeping them flawless and clean. Thanks to Sullivan's for a marvelous summer. Blessings to you🙏 we appreciate you all.",
   "The tour was fun, free and short. Made it through the top of the fort and saw the cannons and back out, in just a half hour. The scenery from the top is gorgeous. The tours run on weekends at the top of every hour from 12-3pm.",
   "Right now (march 2020) it is closed. It opens in may. It is a historical site but not much to see.",
   "Basically,\nThis guy came up to me and asked for help for a settlement. I did it and then came back. He said it again and I helped once again. It came to where I was repeating this. He then told me to kill all the crabs in the fort and the take it for the \"Minutemen\". He also called those crabs Mirelurks. Anyway when I completed his last mission he sent me to help the same settlement I already helped. So I shot him and now all the \"Minutemen\" are \"Permanently My Enemy\". I liked the Artillery though."
  ]
 },
 {
  "name": "Boston Fire Museum",
  "address": "344 Congress St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d78e9224-932e-11ea-896e-14b31f159f22.png",
  "tags": [
   "unique",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14364113524094553631",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice museum with 2 fire engines, one of which you can sit on, lots of old firemens helmets, the possibly unique to Boston, fire  alarms, which can be viewed internally, and other artifacts pertaining to the Service. Staffed by retired firemen who are very happy to to answer questions.",
   "You just have to love a fire station museum. You can feel the bravery of the men and women who worked here saving life's and putting out fires. Not open every day but a must see in Boston. And I bought the t-shirt. Thanks to the ex fire fighter volunteers who look after this place and are happy to talk about the exhibits.",
   "I never knew this place existed until I went to my son's classmate birthday party. It's a pretty small and cozy place. The staffs seemed pretty nice. I definitely recommend it.",
   "Free admission. Lots of cool history and memorabilia. Donations accepted.",
   "The fire museum is an awesome place to visit. There are tons of displays inside and the guys that work there are very knowledgable and willing to help."
  ]
 },
 {
  "name": "Old South Church",
  "address": "645 Boylston St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d7d43aba-932e-11ea-b8b6-14b31f159f22.png",
  "tags": [
   "music",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3260245738457191044",
  "source": "GoogleMaps",
  "reviews": [
   "UCC Old South has progressive Theology, great hospitality, excellent music, and choir, beautiful building. After visited over ten churches, I finally have found Old South as the most recommended Church in Boston.",
   "Such an amazing place.\nThe History and Architecture of the Building. Simply Stunning 😍",
   "I go to my AA recovery meeting twice a week. It helps keep me loving life.!",
   "Such a beautiful church with such rich history. If you're in Boston for the marathon, visit for the \"blessing of the athletes\" services. A MUST see.",
   "This is my home church.  I really like the fact that this is a church with open doors and open hearts.  Anyone, whether he or she believes in God or not, is welcome here."
  ]
 },
 {
  "name": "Saltie Girl",
  "address": "281 Dartmouth St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d8236cd4-932e-11ea-82c0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=1850195991803436904",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing vibe but gets packed really fast. Nice staff and fast and attentive service. The food is pricey and it's easy to get caught up ordering more but it's worth it. \nFood is delicious as well.",
   "Small but great restaurant. The Boston salad is lightly dressed but great flavor. The warm lobster roll is amazing! Nicely buttered. Would definitely return. Other menu items looked great such as the torched salmon belly, snow crab bread, etc.",
   "The warm Lobster Roll 🦞 was delicious! Had to have one while visiting Boston; glad I chose Saltie Girl. Enjoyed a lovely dinner with my daughter. Would definitely return/recommend.",
   "Literally one of my favorite restaurants for a lobster roll. I've never had a bad meal here. They can be really busy, but the customer service here is great, even when dining solo. Love this place! Gotta visit again soon!",
   "Ended up here on the recommendation of a retail worker down the street and was not disappointed. We got the grand seafood tower and everything was amazing. My boyfriend asked for something non-alcoholic and got a delicious guava drink. We also opted for the truffle cauliflower and were not disappointed. Definitely recommend!"
  ]
 },
 {
  "name": "Mistral",
  "address": "223 Columbus Ave, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d86d4736-932e-11ea-a700-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17456404050038248716",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food, amazing service... had a great time!\n\nOrdered mussels for apps, the broth was superb.\nThe French onion soup was great, not too cheesy, just right.\nOrdered the sole fish, very good flavor.\n...and for desserts, had the warm chocolate cake... everything was great.",
   "Really great place.  Very lively atmosphere.  If you are looking for a quiet romantic dinner, this may not be the best choice as it can be quite noisy & seating is tight.  You will likely be seated quite close to others. We have dined here 3 times now and every meal has been top notch. It's not inexpensive, so be prepared, but you get what you pay for.",
   "I just went there with my 3 girls for a birthday celebration and this place was unbelievably good. very elegant and food was delicious. it was exactly the type of atmosphere we were looking for very formal classy. Love it and will def go back.",
   "Beautiful, warm ambience. The presentation was gorgeous. Everything was delicious starting with the warm Semolina bread followed by a strange but delicious Lamb's lettuce salad with goat cheese, and finally the amazing Grilled tenderloin with whipped horseradish potatoes. Sadly no room for dessert so perhaps we will start with it next time 😉",
   "Pricy but excellent food & service! Tenderloin steak is really great. Garlic spinach is exceptional great; it replaces my potato. Enjoy every moment of it!"
  ]
 },
 {
  "name": "Sorellina",
  "address": "1 Huntington Ave, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d8bf8652-932e-11ea-82d3-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "food",
   "walk",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1581522712547932755",
  "source": "GoogleMaps",
  "reviews": [
   "This is a lovely, intimate restaurant tucked among the hotels surrounding Copley Square. Service is attentive and warm, tables are spaced well, and noise level is just right for fine dining. The food is excellent, some of the best I've had in Boston. Pastas are hand made and delicious, meats are well sourced and prepared beautifully. Desserts are innovative. Spirits selection is well curated, and drinks are well balanced. Only down mark would be the bar staff attitude. We started our evening with a cocktail at the bar, and most staff seemed distant and arrogant, and didn't match the warm welcoming attitude of the front and wait staff. While the restaurant was full during our meal, the bar seats were empty, and this was not surprising. Take note, Sorellina.",
   "The gnocchi is to die for. It’s a lumps of lobster meat or a light buttery sauce. The arugula salad is good as well. Bartenders are extremely friendly. Ambiance is nice as well. Good place to sit at the bar if you’re alone. The limo be dessert is so delicious. I’m typically not as fan of fruity desserts but this one is amazing.",
   "The food, the atmosphere, the staff, wine selection, everything is great! Delicious! The place was packed on Saturday night but you still get fast service and attention from the personnel. Great food, great place to have a delicious and filling dinner. Highly recommended.",
   "Sorellina's is finally off my bucket list of restaurants to try! Reservations is definitely required but I lucked out as a walk in due to a cancellation. Service was very attentive from the Bus Boy to the Waiter. Wine menu is more intensive than the food menu but don't be fool. Overall it met the expectations both in my head and hear say.",
   "The complementary bread was warm and came with a light flavored soft butter. In addition, the free starter, razor clam, was cooked perfectly. I don't ordered razor clam dishes in western style food restaurants since the shells and sand are very hard to clean. However, the razor clam here only came with the mellow meat part and the sour taste increased my appetite."
  ]
 },
 {
  "name": "The Capital Grille - Curbside Takeout & Delivery",
  "address": "900 Boylston St, Boston, MA 02115, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d91ade7e-932e-11ea-aa14-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15636602627960421612",
  "source": "GoogleMaps",
  "reviews": [
   "The service was impeccable and the food was great! Filet mignon was also yummy and the lobster Mac and cheese was also delicious. Will defiantly go back!!! Best service and food thus far.",
   "Pricey, but delicious. “In fashioned” cocktail was   one of the best we’ve had in awhile.  Steaks were perfectly cooked, tender, and flavorful. Waitstaff Molly was fantastic, perfect level of friendly and attention - give her a raise!",
   "If you want the best of the best, you go here. They had a nice romantic spot for my girlfriend and I. Celebrating her birthday. The drinks were great and the food was worth the price. They actually accidentally clear the table before we were done eating. So they apologized and remade both of our entire meals to go. Excellent service.",
   "Have been here maybe around 10 times or so over the years, especially around Dine Out Boston times. It's always been fantastic - the vibe, the quality of food, and the services.\n\nThis year's experience was slightly underwhelming, but they definitely took care of it in the end. Just wanted to share this input for the restaurant more than anything, and anyone who may doubt this place.\n\nThis visit, the mains were pretty underwhelming. Fresh peppers were super spicy for some reason, never like before. One of our steaks was seared on the outside, and raw in the middle (not rare or medium rare, but raw as in uncooked, tough). All of the steaks were very underseasoned. I imagine it was due to handling an abnormal volume of steaks this time around. They tried to cook the uncooked beef a little more, but burned the steak on the outside this time in doing so. We didn't said anything and just let it go at that point, knowing the situation. But, they certainly took care of us afterwards - asked if we desired anything additional meanwhile, providing us additional warm sides, and not charging for that steak in the end. Gave the tip based on the original price for all of the food ordered regardless because that was fantastic service. Thank you!",
   "4.5 - 4.75 stars ~ Great selection of breads. Service is great. Steak is well prepared and taste great. Much better than the other steakhouse close by."
  ]
 },
 {
  "name": "Atlantic Fish Co",
  "address": "761 Boylston St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d98168ae-932e-11ea-bee9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7117694564751100155",
  "source": "GoogleMaps",
  "reviews": [
   "Very pleasant waitress. Rafaela was helpful and answered any questions we had. Very nice. Service was quick. Food was excellent!  Wife and I had the lobster that was seasoned perfectly in a great sauce. Would go back again without a doubt!",
   "We rushed in at the last minute without a reservation and was immediately seated for lunch. We explained to Karla, our waitress, that we were in huge rush and needed to dine quickly; with the rush, our lunch was still delicious. The calamari was wonderfully prepared and was the best we have tasted. The lemonade was both refreshingly tarty and sweet.",
   "Starting with the bread to the main course everything was great. The bread was so soft and it also was served with a blueberry muffin which was also very good. The steamed mussels were super tasty. We also had the New England Clam Chowder in the bread bowl (a must). Texture, flavor and consistency was perfect. The lobster roll was good too.",
   "We had lunch on  Saturday with a large group,15! They accommodated us at a table of 11 and a table of 4 right next to them. It was a busy day so we were happy to seated immediately. The menu is great. Great soups salads and sandwiches for a mid-day meal. The lobster bisque was amazing with huge chunks of lobster in a wonderful creamy broth. A must have. The other 2 bests were their lobster roll, stuffed with huge chunks of lobster and their crab sandwich similarly filled with crab..As good as the food was the service was even better. Nicholas our server was a fun and attentive server. he made the dining experience complete. Go here you will not be disappointed!",
   "Fresh and delicious seafood! Great upscale restaurant that was family friendly. Their infused ice tea was phenomenal! Great ambiance and very busy. My kids loved the kids menu. Lots to choose from."
  ]
 },
 {
  "name": "Davio's Northern Italian Steakhouse",
  "address": "75 Arlington St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/d9fb3378-932e-11ea-b499-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "family",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4874139440855075541",
  "source": "GoogleMaps",
  "reviews": [
   "We ate at Davio's before at different location and we didn't think it was good. This time we go there because we have a gift card so we give a try again. All dishes were good. I have the sea scallops with risotto. It was delicious with good portion. I will go again.",
   "Lunch and dinners here are top notch. They do a great job on sides and main dishes alike. Good atmosphere for couples, small groups, and family event dining. Love their steaks, and their portions are spot on. In other Davio's locations, I have seen their desert carts, and all of their pastries and fruit and cream based dishes were fabulous, even worthy of the being sampled at the best of the North End bakeries.\n\nI have been to their Chestnut Hill location as well, and their main fare is fabulous at both locations. Parking is doable at the meters and at the surrounding garages. It's also easily accessible from Back Bay, the Theater District, and Chinatown.\n\nIf you love Italian, and also want a change of pace, with their Northern Italian menu, check them out. It's really a 4.5 star place.",
   "Family came here for a nice dinner.  The food was spectacular and our server Joe was excellent.  We ordered Kobi meatballs, braised octopus, raw clams, gnocchi, pan seared lobster, lobster risotto and goat cheese tortellini, and all were superb👍",
   "I was in for my birthday and it was really good. The service was amazing and the food as well. Although the waiting line could be long sometimes, and the lack of enough seat for those waiting can be make experience challenging. But overall it is a very good restaurant with a bar and private spaces located at the heart of Boston.",
   "Truly amazing food! I cannot speak highly enough of the staff, service, food quality, food quantity and ambiance. By far my favorite visit to a restaurant in months (and I travel every week for business, and eat out often at this caliper restaurant)."
  ]
 },
 {
  "name": "Ostra",
  "address": "1 Charles St S, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da570f82-932e-11ea-8e22-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=4355678635826831015",
  "source": "GoogleMaps",
  "reviews": [
   "This was a truly special experience.  Everything we had vastly exceeded expectations.  All of the seafood was the freshest I've ever had, and the combinations of flavors were very meticulously and artfully executed.  If you don't mind spending a pretty penny, I would highly recommend trying this place.",
   "Food was really good. Room was nice but pretty stark. Staff is GREAT! You have to give them a try! A little pricey but well worth it!",
   "Easily one of the best meals i have had in ages.  The caviar an accompaniments were superb.  The oysters were remarkable, even given being in Boston. The cooked dishes were finished to perfection.  Presentation was excellent.  Staff was attentive though not intruding.  Overall a perfect fine dining experience.  I will return.",
   "I really enjoy Ostra.  A nice place for special occasions.  Good service, nice menu, good bar.\n\nDefinitely consider Ostra for a special occasion.\n\nHighly recommended.",
   "I ordered D'Boom Smoothie, which was one of their most popular smoothie. It was quite tasty, nice sweetness from all the fruits, very filling and satisfying. I felt great, and amazing for your body and soul! It was a quite chilly day, so I also ordered one of their homemade soups. I ordered Creamy Tomato Basil Soup as a side order."
  ]
 },
 {
  "name": "SRV",
  "address": "569 Columbus Ave, Boston, MA 02118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/da983738-932e-11ea-a9ae-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "eat",
   "food",
   "food",
   "walk",
   "knowledgeable",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7621820859707903826",
  "source": "GoogleMaps",
  "reviews": [
   "Everything was AMAZING, the food the place and the service!!\nI liked everything we ordered except the pastas it was not as good as I thought it is going to be,  maybe it just needed more salt, other than that every thing else was so delicious!! \nDefinitely will come back!",
   "It's a good place to eat with family. The food came out quicker than I expected, and it tasted divine. Good stuff all around. All in all, very tasty.",
   "The food is amazing!! Service was great - friendly and quick. The sparking red wine they have is a must. Would definitely go back here when in Boston.",
   "SRV is a great dining experience in the South End. From start to finish you will enjoy yourselves, from the food to the atmosphere it is all great. \n\nReservations are usually necessary on Friday and Saturday, but you might get lucky if you walk in early enough. In the summer they typically have their back patio open, as well as some outdoor street seating, which will open up more tables to choose from. \n\nThe food always impresses, and they update their menus often so you’ll always be able to try something new. Their pasta is absolutely incredible, and they’re very knowledgeable in the melding of seafood into these dishes. Their wine list is also rather extensive, which adds to the experience. The atmosphere is great, modern accents with exposed brick makes for a great combination that is new and inviting. This is a great staple in the South End and I look forward to dining again.",
   "Nice Italian restaurant. The beef raviolis were excellent besides the portion size was a bit small. Highly recommend the tiramisu - it was huge and delicious!"
  ]
 },
 {
  "name": "O Ya",
  "address": "9 East St, Boston, MA 02111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dae8598a-932e-11ea-b15e-14b31f159f22.png",
  "tags": [
   "unique",
   "tasting",
   "food",
   "food",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=2070050931615360062",
  "source": "GoogleMaps",
  "reviews": [
   "The greatest sushi I have ever had. It was a little hard finding the entrance, but once I was inside I loved the vibe. Our waitress was incredibly personable and kind, hostess was sweet, and the food was out-of-this-world. Expensive yes, but undeniably unique. Every small piece of sushi has a crazy number of different flavors, I don't know how they do it. I'd highly recommend doing the beverage pairing along with the chefs tasting.",
   "This restaurant is my first choice site.  Of all restaurants I know I prefere it most. I never miss an opportunity to go to that place. when  I want to go to a fair lunch, this is the place that comes immediately to my mind. best and   food and a rich menu.trained crew, and good mood. And very important, the pay is modest. I praise this spot with no doubt.",
   "This place is certainly one of the coolest restaurants in the area. Anytime I visit this place I am absolutely glad. They preserve their very high  standard service and the highest level of food  they offer. You always win with this place. Highly  recommended.",
   "Amazing experience everytime we go. It is rare that you can dine at a restaurant and find every bite different and exceptional. We have had the grand omakase dinner (~20 courses) eight times now and can truly say that we have had 160 fabulous courses that were handcrafted right before our eyes. Splurge and enjoy!",
   "Came here with my man for his birthday- He did the Grand Omakase and I did the Vegetarian Omakase. Beautiful, delicious. Impeccably plated. The vegetarian options were definitely not a throw away and were how I want to eat vegetables every day. Worth it for a special occasion."
  ]
 },
 {
  "name": "Toro Boston",
  "address": "1704 Washington St, Boston, MA 02118, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db36c7da-932e-11ea-bf22-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=12221852768954856409",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best restaurants in Boston.  Excellent Spanish tapas restaurant with an excellent bar and outdoor seating.  It does not take reservations, so be prepared to wait.  It’s worth the wait.  Really love the bone marrow and gambas.  However, everything is excellent.",
   "I have been going to Toro since it opened over 10 years ago and love the place. Great place to share tapas and It’s like being in Spain. They do a great job there and have an excellent staff. Best to go for lunch during the week as there is no wait.",
   "This place is incredible. If you are lucky enough to get a reservation for lunch or dinner take it! You could eat here alone or dine with a small group of friends. The atmosphere is slow paced and quiet which is perfect for the food. Completely antitypical American size portions, food, ingredients, etc.\n\nCome here if you're ready to embrace spanish-style, thoughtfully prepared tapas. We came hungry and excited for interesting plates and wines and we left wanting to come back for dinner. Put this on your Boston bucket list if you are visiting or if you need to get out of a rut and live your best life.",
   "Hands down the best Tapas restaurant in Boston. We have been coming to Toro for years and are never disappointed. They do not take reservations, so come with the intention of buying a drink (or two) at the bar while you wait for a table. \n\nThe menu varies slightly by season, and in the summer there is more of a fresh seafood focus. In the winter the dishes are more substantial and focused on the meats. Toro has excellent drinks and very inventive cocktails which are a must try. One of their most popular dishes is the corn, which comes lathered in butter and cheese. (You can order it 'off the cob' if you are not a fan of eating corn on the cob). \n\nNever disappointed, always leave happy and full. Must try.",
   "Peppers with goat cheese - perfect. Churros - perfect. Lamb ribs - perfect. Paella - great but just a bit too saucy for my liking. Potatoes - also great. Ambience - lovely with a kind staff."
  ]
 },
 {
  "name": "Mamma Maria",
  "address": "3 N Square, Boston, MA 02113, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/db833a6c-932e-11ea-aec7-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "drink",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7697529779696341621",
  "source": "GoogleMaps",
  "reviews": [
   "Had an amazing dinner here! We had a reservation, but the place was packed so we still had to wait a little bit. Very cute, cozy atmosphere. We had the burrata to start, and I had the scallops with risotto for my meal. Everything had delicious flavor. Friendly, professional service. Definitely recommend for a nice dinner!",
   "Amazing place with very friendly staff! The mushroom pasta was delicious! Cozy ambience.. perfect for a meal with friends/family!",
   "Food is good and the restaurant is located in a nice old building. The restaurant is very crowded and we didn't reserve in advance so we were sitting at the bar counter. Rabbit stew is surprisingly good. My advice is to call in advance to reserve a proper seat for dinner. Better experience that way.",
   "Second time at the restaurant. First time I went I was in awe of how great the customer service was. The food was amazing and I was so excited to Return. However this time around my expectations were high, as I’ve already had a great experience. Unfortunately I left disappointed. Our waiters personality was very dry, he barley spoke to us and at times I would have to physically call out to him so he would notice my drink was empty. I did feel as if he looked down at us, like we did not have enough $ to be there. After reading some of these reviews I know I wasn’t the only one who felt that. \n\nAlthough the food was great, i will not be returning because of that.",
   "We were fortunate enough to rent out the main part of the restaurant for our rehearsal dinner. The food is SO delicious, you quite literally cannot go wrong with anything you order on the menu. You can tell the food is fresh and made to order - the meats, ravioli, salads, everything! So delectable and flavorful, unlike any other Italian dining experience I've had. The service itself was unbelievable; waitstaff were accommodating to the children who wanted to order outside of the preset menu, and were attentive to and interactive with all of our guests. Thank you so much for such an incredible evening. We will definitely be returning for another exquisite dining experience!"
  ]
 },
 {
  "name": "Yvonne's",
  "address": "2 Winter Pl, Boston, MA 02108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc0732d4-932e-11ea-89b0-14b31f159f22.png",
  "tags": [
   "unique",
   "historic",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14225169544974856412",
  "source": "GoogleMaps",
  "reviews": [
   "First time at Yvonne's last night and I loved everything a out this restaurant. The decor, the service, the food (oh the food) and the cocktails were great. This is a unique place to go for that really special occasion that you want to create a very memorable experience. It's funky elegant atmosphere, great take on tapas style dining and historic flavor make this a place you just can't go wrong. It's now at the top of our list for Boston dining... Loved it.",
   "What a GREAT place. One of my top 10 ever place I’ve been... Don’t get fool by the poor food pictures you see on Google...The food was Marvelous... Ask for Fiona... She was definitely part of our great experience... Next time I’m in Boston I’ll go back for sure...",
   "The atmosphere was really amazing, it did feel like some sort of 20s speakeasy. The drinks were decent...once we got them. Our waitress forgot about us twice, when we were at a standing table right across from the bar. There were staff members constantly passing us by and none of them seemed to think it was weird the we were standing in a bar without drinks. Sure it was a little busy. But being, from what I hear, one of the most 'you gotta check this place out' bars in the area, they should be able to manage to not completely ignore patrons. I'll give it two stars, one for atmosphere and one for hope that I have a better experience when I try it again",
   "This was a speakeasy style restaurant. The food was very good. Most dishes were sharing style. Only gave 4 stars as we waited for 15 min before waving down a server. He was very apologetic and was very attentive after. I strongly recommend this restaurant. I would suggest reservations in advance",
   "Cute place. Love speakeasies. The cost of the beverages were bull considering they were not made strong what so ever. Have no idea about the food. It looks very good, presentation was beautiful from what I saw."
  ]
 },
 {
  "name": "Barcelona Wine Bar",
  "address": "525 Tremont St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dc5f3e36-932e-11ea-bd34-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "drink",
   "affordable",
   "unique",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12764803064039312429",
  "source": "GoogleMaps",
  "reviews": [
   "Went out with friends last night and we all loved our tapas! Very delicious. Someone at our table ordered a sangria pitcher and that was also very good. Camille, our waitress, was amazing. She is a sweetheart and very knowledgeable. What a wonderful night! We will definitely come back.",
   "Great selection of wines.  Nice cocktails.  Great place for a single person because they will box up half for you to take home.  My new favorite in Boston!  Loved the 3 oz glasses of wine.  I could try two!",
   "I like coming here because it’s really affordable for what you get. You can make reservations here which is great for when you have visitors. They’re generally good with seating you on time, except this one Saturday evening when we had to wait an hour past our reservation time to get seated. It’s so packed in there on Saturdays that it’s tricky to order a drink. But any other night, I love it.",
   "A symphony of individuals working together and communicating effectively to ensure impeccable service, Dre and their staff went above and beyond providing us with an unforgettable experience. \n\nTapas were amazing and reminded me of my mom’s home cooking and my travels to Spain. Brought back great memories. \n\nAsk about their unique Georgian white wine selection! Pairs eloquently with the salted cod brandada! \nDre and their staff gave us an experience we will never forget. They set the bar real high for what good quality food and what good customer service looks like.",
   "This place is amazing!! It’s a little high end but nothing too crazy. I LOVED the atmosphere. All the servers were super friendly. It was our first time and it blew me away. You won’t regret eating here. The portions are small so you need to get like 3-4 things per person to be full. Really enjoyed it. Also the walk around the neighborhood was pretty great too. Very nice neighborhood. Awesome ambiance all together"
  ]
 },
 {
  "name": "Ma Maison",
  "address": "272 Cambridge St, Boston, MA 02114, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dcb59c54-932e-11ea-b7b7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15910852480106326874",
  "source": "GoogleMaps",
  "reviews": [
   "Everyone's favorite French restaurant around the town. Amazing escargot, patê, duck, calf's liver, and basically everything. Service is perfect -- Waitress is very nice yet not too overbearing like some American restaurants. They know their wines -- definitely ask for recommendations on wine that pairs. Very busy everyday dinner time, make sure to reserve.",
   "We were there last evening to celebrate our birthdays. The wonderful woman at the front helped us find a place to park (the garage on their website was full) and let me sit at our table while I waited. We began with complimentary champagne for our birthdays. I had delicious  (one of the very best) onion soup and then the duck magret. The duck was a bit underdone for me but was quickly redone. That lovely lady from the front even came over to make sure I was happy. My husband had a delicious salad and since it was a Wednesday, he was delighted with the sweetbreads.\nFeeling overfed, my husband just ordered coffee. To our utter delight, a chocolate mousse arrived with a candle. We managed to devour it.\nThe restaurant reminded us of being in Paris. A neighborhood bistro. If only we lived in this neighborhood..",
   "We went here to celebrate a birthday. It's a small restaurant mostly with tables for two, but also a couple of tables for big groups. Nice and elegant atmosphere. However the staff is very nice, friendly and absolutely not snobbish, especially the French guy that served us. Food was really good. We tried different dishes. Salmon, escargot, fried frogs, duck. Everything good. Only the frogs weren't crispy enough and I was expecting better",
   "Very, very good establishment! Service was top notch, food was delicious. Parking is available down the street.. great for romantic dinners. I would highly recommend!",
   "Slow service. Delicious food. Decent wine selection"
  ]
 },
 {
  "name": "Row 34",
  "address": "383 Congress St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dcff211c-932e-11ea-82f0-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=13328531444327232542",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I have been eating at this restaurant for several years—less so frequently because of location, but nonetheless we make it a point to come here at least twice a year now especially in the summer. The lobster rolls are always delicious and FRESH, as is all their seafood, and you won’t find better oysters. And lastly, their customer service is second to none, I was already in love with Row 34 but they truly have a customer for life now, special thanks to Shore for wonderful customer service.",
   "The raw bar was great! I probably ordered too much much from it. The best oysters I have had and the tuna was delicious. The clam chowder was delicious and the base was not as heavy as you get in lesser quality chowder. The lobster in the lobster roll was so fresh and delicious.\nThe service at the bar was very nice. \nI look forward to returning.",
   "I ate here on the first night of my Boston trip, and it made the rest of the food I ate that week pale in comparison. I wish I remembered the name of the server because they were amazing and had great recommendations for both food and beer. We had some oysters and a lobster roll, and they were both so good. Restaurant was clean, had a great playlist going, and was well worth the wait.",
   "2 words...Lobster tacos!!!  Lunch is here is fast...a bit pricey, but of great quality.  Robust raw bar.  Good for the casual and business crowds alike.  One of the best, and probably the most unique, clam chowder in town.  @Row34...do you finish the chowder with vermouth??",
   "While it's not the place to go if you're looking for inexpensive dining, Row 34 offers some of the best prepared seafood in the city. They're known for their oysters, and they definitely deliver. Around a dozen oyster choices, almost all of them from Massachusetts, Maine, and New Hampshire. All wildly fresh. The steamed mussels were delicate and the broth had a burst of citrus to it. The crab cake was light and delicate, but I do wish the portion on it was more generous. Same with the lobster roll - beautifully prepared with a hot toasted and buttered roll but would have liked a slightly larger portion. The beer list is always being updated, and it's a doozy. Deep selections from impressive breweries, and the prices are in line with what you should expect from the expensive Seaport area. Dinner for 4 came to around $320 including tip, and that was with a few rounds of drinks, plentiful oysters, and apps and split entrees."
  ]
 },
 {
  "name": "The Q",
  "address": "660 Washington St, Boston, MA 02111, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dd6ab4a2-932e-11ea-89cc-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9127039794404730462",
  "source": "GoogleMaps",
  "reviews": [
   "No easy parking, but don't make that a deal breaker.\nMe and my party went there during the restaurant week event/ time of the year.\n\nThe crab rangoon was very good and I will recommend that as well the sea weed salad was also good.",
   "My friends took me to the Q for my birthday dinner. It was amazing! The food was delicious and we just couldn't stop eating :) . Everything survived in a very interesting manner. I loved it. Deserts were amazing. Drinks are really good quality too.",
   "First time having hot pot. The broth was done extremely well, tried the Mala broth. Very flavorful with a good kick to it. The beef combo was a great lunch deal and it had a great amount of beef and noodles. A big bowl of lettuce,, with a tomato, piece of broccoli and mushroom accompanied the order, which was a little odd, in my opinion. But the beef, noodles and broth were delicious.",
   "Good food! Great experience! Hot plate idea is really cool! For people who haven't been here you can order the type of broth you would like then the sides. When the broth comes to the table it is out on a hot plate then shortly after the sides come out. You put the sides in the broth and let them cook. Different yet fun and exciting! Great service!! Even let us keep some food there while we went to a concert. Enjoy!!",
   "This was my first spot for hot pot and it really was incredible. We have returned probably three times since. There are other hot spot places in Chinatown but this one is a bit upscale with private seating and a full bar. The broth choices are all awesome and that’s the most important component. Service has always been great  They don’t offer reservations but if you get there before 6 it’s not usually a problem - but there is a good wait by 7 pm usually."
  ]
 },
 {
  "name": "Theo's Cozy Corner Restaurant",
  "address": "162 Salem St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ddb7271c-932e-11ea-8243-14b31f159f22.png",
  "tags": [
   "delicious",
   "kids",
   "food",
   "walk",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18267622392674549414",
  "source": "GoogleMaps",
  "reviews": [
   "If you’re looking for a cozy corner, Theo’s is it. It’s a small local owned restaurant with good food. It doesn’t seat many people, so it gets crowded quick. It took an hour to be seated. I went with two hungry kids, so this was kind of a bummer.  I ordered the eggs Florentine and it was delicious. My husband ordered steak and eggs and the steak was a little over cooked. The staff was very friendly and catered to us. I know that kind of service is hard to find.",
   "Very expensive but the breakfast I have ever had.  \n\nI don't mind spending money on good food.  Portions are big, food is all fresh cooked to order.  I sat at the bar and watched the cook and he takes pride in his work.  He takes his time and does it right.\n\nEggs and omelettes are cooked on low temps and come out perfect.  French toast was absolutely amazing!  \n\nTheir hospitality is the best I have ever seen.  Everyone is so friendly and willing to accommodate you no matter how inconvenient it may be.\n\nThe only draw back is how small the diner is and how long you may have to wait to eat.\n\nAlthough there is no bathroom I did see a few girls allowed to walk through the kitchen to go.\n\nI would definitely go back.  It was worth the money.  Thanks for a great visit.",
   "Best French toast I’ve had in along time. Friendly atmosphere and delicious my husband was full when we left. The owner and waitresses were friendly and attentive. We also were greeted by the owner. A MUST VISIT PLACE. Cozy is absolutely right and compliments to the cook.",
   "You get to taste both the clam chowder and the lobster roll. Everyone kept telling me I needed to try these two meals when I visited Boston. So it was a special, and it was pretty dang good. The clam chowder had so much flavor, but the lobster roll was amazing. Spend the $25 for both, take it outside and people watch like I did.",
   "Came here for breakfast after a night on the town. It had good food. Made very quickly. Good coffee. Very friendly staff."
  ]
 },
 {
  "name": "Carmelina's",
  "address": "307 Hanover St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de1043f8-932e-11ea-b128-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4097816954914834789",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best Italian food! Make sure you make reservations or call to see if they have something available. We sat at the bar which was cool because we saw both chefs spitting out amazing food!! We got the meatballs, exploding clams, a bottle of red wine, the seafood pasta and the sundays dinner. The exploding clams were the star of the night. It had a great spice and so fresh. The seafood pasta was delicious! So fresh and tasty, I ate everything. The Sunday dinner was every mans dream come true. It came with meatballs, a short rib and sausage. So good. Everything was super good. Highly recommend!",
   "The best place for having valuable time with good friends :) Their food is always excellent. So does their service and the vibe. I definitely recommend to make a reservation before the visit! The place is quite cozy (and small).",
   "Couldn't get reservations but got lucky as there was a cancellation and we were seated within 10 minutes.  Tuna appetizer-order it! We had the rollati and crazy Alfredo... Both were top notch!  Excellent service, great location!",
   "A great twist on classic Italian. The menu has a lot of passion behind it and a great family feel. I had the crazy Alfredo and was very pleased with it. The staff was very friendly and helpful. It's difficult to get a reservation here but if you can get one it's worth the wait.",
   "Wow let’s me be honest. Hands down best pasta I ever had in my life. I’m not a fan of pasta but this was  spectacular to the fresh bread.  I order the crazy  Alfredo that was amazing. The noodles are so soft and feel homemade not from a box that you get at the supermarket. Would recommend to anyone. I came with my friend all the way from  Connecticut  to try this place out."
  ]
 },
 {
  "name": "Regina Pizzeria",
  "address": "11 1/2 Thacher St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/de575f0c-932e-11ea-a67b-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10405584724220069020",
  "source": "GoogleMaps",
  "reviews": [
   "Pizza was very good. Very good. Great? I can't say great. I like well done but ours was a little too well it ended up dry in certain spots. I'd obviously tell anyone I know to go because it's worth the experience. If I went again if ask for the pie to be pulled a little bit sooner from the oven. The staff was great. Really great. Awesome east coast attitude and swag with the customers all in good fun.",
   "This is by far the best pizza I have ever had in my life and it is killing me that I don't travel there for work anymore. The crust is thin but sturdy and has the best texture- soft, chewy, fluffy, thin all at the same time somehow. I always got the pepperoni and it was so good that I am unable to properly express to you how delicious this pizza was. If you are in the area at all, you must get yourself there to enjoy some fantastic pizza.",
   "Been going for 30+ years. My mom would take me and now I take my boy's. I've NEVER had a bad experience there no matter how long the line would be to get in. It always moves quick and it just gives us more family talk time. The pizza and staff have always been amazing. Even with covid  the pizza was delicious and staff was on point with orders, social distance and making sure the customers only touch stuff once. Pre package bag's with plates and napkins along with a pencil for signing credit card slips. You keep the pencil. No line though in and out quickly. It's a must stop by if your ever in the area",
   "Visiting from Toronto and being an Italian-Canadian absolutely loved this place!!! Expecting this to be a high end pizza place, perfect for a date? No chance lol. This place is a dive (in the perfect sense) and probably hasn't changed since it was opened but I wouldn't change a thing. This is no frills pizza at its finest. If you are visiting Boston and you want the true Italian pizza experience, this is a must see! I would recommend the personal size pizza, which you can certainly finish if you are hungry",
   "The wait wasn't too long. \nPizza was very good and almost the size of the table! Yes, we had some to take home.\nService was fast and efficient. Busy, busy little place! \nFinding a parking space was extremely challenging."
  ]
 },
 {
  "name": "North Street Grille",
  "address": "229 North St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/dec61580-932e-11ea-8696-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14199239473340731338",
  "source": "GoogleMaps",
  "reviews": [
   "This. Is. A. Must. The hospitality is lively and unique to the neighborhood, like a reconnecting to a long lost relative. I feel like I probably had the best french toast (apple cinnamon), and the lobster omelet was beyond compare. Go. Wait for however long; best to go in the morning. It's worth the wait.",
   "The best breakfast I have ever had.  I will most likely never go anywhere else when visiting boston for breakfast again.  Espresso martini, fluffy pancakes, eggs Benedict to order.  And grandmas secret banana bread recipe is better than ... well let’s just say that I want to go back tomorrow!",
   "Good was delicious. Service fantastic. Place was jammed, but they got us in and served quickly. Great stop.",
   "We had a fantastic experience here. Great service from the hostess, who kept checking in on us throughout. Exceptional service from the waitstaff and kitchen. We have two kids with food allergies and they were extremely vigilant about making sure everything was safe and there was no risk of cross contamination. You don't find that often in places with small kitchens that have a great business. The food was fantastic as well. Overall, highly recommend.",
   "Incredible food.  This restaurant came recommended from our hotel front desk and it did not disappoint.  It's a small place across from Paul Reveres house so it took a few minutes to get a seat at the breakfast bar.  We had some mimosas to start and got the crab cakes Benedict and the fried chicken and waffles sliders.  The service was excellent and the food was even better.  I wish the waffle would have been a touch more crispy on the sliders, but other than that, it was superb."
  ]
 },
 {
  "name": "Galleria Umberto",
  "address": "289 Hanover St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df32d6dc-932e-11ea-b063-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10804733369253165952",
  "source": "GoogleMaps",
  "reviews": [
   "Always excellent, fresh food.  The pizza is the best I've ever had. Just can't duplicate that taste. My other favorite is the panzerotti, melts in your mouth. However, everything else is just as delectable!",
   "Pizza is delicious, employees are always kind, & patient, relaxed atmosphere, love it here just reminds me of growing up Italian, tables & chairs, street parking, was very clean, smells amazing, reasonably priced & portions are filling. The pizza & calzones were so hot it steamed the windows in the car on the way home. If ur ever in the area or craving Italian food definitely check it out. If any1 was used in a photo without permission let me know I'll take it down. Go show them some love.",
   "Consistent high quality authentic Italian slices and Arancini. Can be very busy on weekends, so recommend getting there early in the day, as they can sell out! You order at the counter, but plenty of seating to sit and enjoy your meal. Family run, with great service. In my opinion this is the best pizza outside of Italy, and always worth the wait!",
   "This is not only the best deal in the US for a slice of pizza ($1.90), but it's also possibly the best pizza you could even try. Don't get hung up on only having \"cheese\" to choose from with no toppings. You don't need more than that here. Superb.",
   "The pizza was tasty. I was a fan of the sauce. The arancini were also very authentic and delicious."
  ]
 },
 {
  "name": "Mario's Restaurant",
  "address": "347 Chelsea St, Boston, MA 02128, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/df9b8422-932e-11ea-a413-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14866438630184023860",
  "source": "GoogleMaps",
  "reviews": [
   "Authentic home cooked Italian food, small and quaint and an excellent vibe.  Staff is family and the service was excellent as was the food.",
   "Family atmosphere. Super friendly staff. Great food.",
   "I celebrated my PhD this evening in this delicious restaurant. Well we passed a outstanding evening and the place was absolutely the reason for that happy gathering. The team  cooperated in a gorgeous manner, the food was tasty and my guests were extremely  cheerful. We shall absolutely come back again for more events. Thank you very much.",
   "We needed a place for a quick dinner close to the airport, reasonably priced and easy to get back on the highway. This fit the bill perfectly. We started with excellent bread to pair with your choice of butter or Olive oil. Then our meals all included salad which was perfect portion.  My pollo Alla Lisa was excellent. Everyone enjoyed their food. Cozy place. Will go back if we need to go to Logan.",
   "It's all available for here or to go. While I was waiting to place and order, a fresh pizza came out of the oven and went on display behind the glass. I changed for that. It was still super hot! Sliced gyro meat, lumps of ricotta cheese and pesto, it was delicious and filling. One slice was enough."
  ]
 },
 {
  "name": "Rino's Place",
  "address": "258 Saratoga St, Boston, MA 02128, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e0157262-932e-11ea-9a36-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1342001964866560555",
  "source": "GoogleMaps",
  "reviews": [
   "This place is soooooo good!! Italian food just like in the North End. The lobster ravioli is the best we’ve had in Boston (and we have had a lot of different places’ lobster ravioli!). Generally a line to get in so plan accordingly...or get take out! YUM!!!!",
   "Amazing Italian. Definitely my top favorite Italian restaurant in Boston. It's quite difficult to get a table on Saturdays but it is certainly worth the wait. Super friendly staff. Nice hospitality. Menu is not super huge but everything sounds and tastes delicious. Their handmade pasta is wonderful and is highly recommended. Ordering food food take it is also a good option. Generous portion. Parking is very difficult with lots of resident parking.",
   "Very friendly staff and server gave great recommendation as this was our first time visiting. But won't be our last. There are a ton of good options for meat and seafood lovers. Most pastas are homemade. Very cute place that's not too big but they can accompany large parties. Good spot to catch up with friends or bring a first date.\nTip: they do half portions/orders for appetizers, so if there are only 2 of you and you plan to try more than 1 appetizer and plan to each get an entree then you may want to opt for half sizes. The calamari pictured is a half size",
   "A hidden gem recommended by local. Cute and cozy. Like a ma and pa restaurant in fine cuisine level. Only had their lobster ravioli which was so remarkable that we went back for the second time for it! Note: rather than dining in this time, we ordered it to go and eat at the park down the street because of the corona crisis",
   "A lot of people recommended places in the north end. While I’m sure those places are good, Rino’s was amazing! Huge portions at a great price! Can’t recommend this place enough. Not on the beaten path, but well worth the short trip to east Boston!"
  ]
 },
 {
  "name": "Dino's Cafe",
  "address": "141 Salem St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e06d569c-932e-11ea-8512-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3191622763021988063",
  "source": "GoogleMaps",
  "reviews": [
   "Good customer service from Mr. Dino. Very friendly and welcoming. My oven baked chicken fettuccine was great!! And my husband had a steak n cheese sub which he loved. Excellent food and can't wait to go back there again.",
   "I take my family to this great restaurant  a lot! This is the best place to dine.  I visit this spot routinely. The food is fantastic, the workers are friendly and the prices are good. I enjoy meeting in this spot to have a rich supper.",
   "Reasonable price especially for North End, great value and super quick service. We came in as a party of 7, and in 7 minutes we were already eating. Rare occasion but a definite 5 out of 5. Just look at the size of that thing",
   "Great little sub and sandwich shop in Boston. Made with fresh ingredients by hand right in front of you, the quality and taste is incredible. Prices or decent as well, $12 for a foot long that is definitely more than 12\".",
   "Came for dinner for my friend's birthday. We had a great time and our server Emer was fantastic and delightful! We were sat next to a couple who complained that their food took too long to arrive even though it came at a perfectly standard time. I believe their complaints were completely uncalled for because everything here is done so well and was done perfectly that night."
  ]
 },
 {
  "name": "Italian Express Pizzeria",
  "address": "336 Sumner St, East Boston, MA 02128, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e0c5f8c2-932e-11ea-8787-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=614347788616551795",
  "source": "GoogleMaps",
  "reviews": [
   "the champagne comes out in an extravagant champagne cooler with ice, plus you get a cute little tray with peach, grapefruit, and orange juice. My only comment there is that they could provide more juice. The breakfast skillet was delicious. Fluffy eggs? Check. Irresistibly crunchy potatoes and bacon? Also check.",
   "Best Calamari I've ever had! The ricotta in the eggplant rolls was spot on and the ravioli & homemade meatballs OMG! Service was great and a nice clean atmosphere.",
   "Awesome pizza shop. We order a 4 slices of pizza for 2 people.  Let me just say, 1 each is enough.  The portions are HUGE.  With that being said, everything is delicious.  The guys working are very friendly.  Lots of locals stop by all the time.  I highly recorded this place if you are in the area.",
   "The wife and I Love visiting different food establishments, came across this one on the food network about 6 months ago ... On our next trip to Boston we HAD to go ... and boy are we glad we did ... Food was amazing in taste with massive portions ... reasonable prices  nice atmosphere and even met the owner Jim. who took time to sit down by us to ask how everything was ... Will make it a must stop every trip into Boston",
   "I loved the pizza. Aside from getting great service, I got a delicious free pasta. I would definitely go back to this new spot."
  ]
 },
 {
  "name": "Arya Trattoria",
  "address": "253 Hanover St #2, Boston, MA 02113, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e10c29ac-932e-11ea-ba01-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3718241135506523731",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing!!!! The service was fantastic and the food was absolutely delicious! Homemade pasta and super fresh seafood. They even split a plate for us making one spicy and the other not. Perfect meal.\n\nUpdate: we returned! More delicious food 🤤",
   "This small restaurant is very charming. The staff is extremely helpful and friendly. It can get loud. The meatballs are really some of the best I’ve had. Wine selection was good. The pasta was good, not my favorite but still good.",
   "Picked up a 1/2 platter of the sausage and broccoli cavatelli. It was slightly cheesy but not too garlicky. Would’ve wanted larger pieces of broccoli though. The sausage was similar to broken up pieces of meatballs. Nice sear. The meatballs were amazing ($18 for 4). Tender with a wonderful herby flavor. The tomato sauce punches through the salt.",
   "Amazing food and wine!  The best thing about this is that the people that work there make visitors from out of town feel like regulars. Practically like family that has been eating there for years.",
   "Excellent! Excellent! Excellent! Wonderful service! Exceptional food! Cozy and comfortable atmosphere! Lovely!  But pricey, but oh, so worth it!"
  ]
 },
 {
  "name": "Fox & The Knife",
  "address": "28 W Broadway, Boston, MA 02127, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e14d53b0-932e-11ea-bbb7-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12842270850918315287",
  "source": "GoogleMaps",
  "reviews": [
   "Fabulous food, really. Just so savory, multi layered and interesting. Amazing service (we ate at the bar). Superb presentation.\nI don't know that anything could be improved upon.\nMy food allergies were definitely paid attention to, which I am ALWAYS thankful for!",
   "Takeout during quarantine, so maybe that affected their food. It’s a limited menu so they’re probably cooking in bulk. All of it was pretty bland. When you consider the cost, there’s no chance I’d give them a second chance. \n\nPresumably the food is better in person based on these other reviews. Also worth noting the extremely small portions (not a problem this time, since I didn’t want to eat what I received).",
   "After weeks of waiting, we were finally able to secure a coveted reservation at Fox & The Knife! We were very well versed in the acclaim they were getting, and were excited to see what the fuss was about. \n\nWe were seated promptly and were greeted by a very informative waitress. She knew the answer to all of our questions and we were really impressed by her. The meal only got better from here, they have an extensive wine and cocktail list, which added a great component to our meal. The pasta was extremely fresh and very fun to share with others in our party. All of the dishes were great and tasted extremely fresh. The meal did not disappoint, and we are already looking forward to our next visit.",
   "Some of the best pasta we've had so far. The foccacia is to DIE for: perfectly cheesy and warm and light. They have a wide vegetarian selection as well which is great. The staff are super friendly and attentive as well. Cannot wait to go back already!",
   "What can I say that hasn't been said before? We came in and had an amazing experience start to finish. Great food, great drinks, great staff - really an absolute gem of a restaurant"
  ]
 },
 {
  "name": "Bar Mezzana",
  "address": "360 Harrison Ave, Boston, MA 02118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e193dc3a-932e-11ea-baef-14b31f159f22.png",
  "tags": [
   "food",
   "art",
   "family",
   "tasting",
   "food",
   "delicious",
   "unique",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4328696491229219639",
  "source": "GoogleMaps",
  "reviews": [
   "Service was wonderful and cocktails and wine list amazing!! Unfortunately the pasta was just ok. It was very under seasoned, had to add salt, pepper, and red pepper flakes & I don’t like salty food. I got the black truffle fettuccine and the black truffle did not have any flavor at all. Could have just been any old mushroom shaved on top. A bit disappointed for the price and expectation.",
   "I have been to Bar Mezzana many times and I am always impressed by their cuisine and staff. Their restaurant is state of the art and is located in the Ink Block on Harrison Avenue. I have too many favorites to list.",
   "One of the best meals I’ve had all year, I would HIGHLY recommend their tasting menu (called something like family menu). Excellent service, high quality food and well thought out dishes. Couldn’t ask for a better dinner in Boston! Would definitely come back.",
   "DELICIOUS! Stopped in for a quick dinner on the patio and appreciated the quick, attentive service. Their wine list is almost all Italian but a very unique selection that I enjoyed. For starters, I got the beef tartare and it was phenomenal. I could have eaten just that because the portion was so generous! I got pasta for my main and was only able to eat half but loved every single bite. Highly recommend this spot for a casual but delicious night out!!",
   "Really nice ambiance.. I like the vibe and the food. Definitely a place that I want to go back to"
  ]
 },
 {
  "name": "La Summa",
  "address": "30 Fleet St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e1daa978-932e-11ea-969a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "music",
   "family",
   "food",
   "food",
   "food",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=5379026583469868899",
  "source": "GoogleMaps",
  "reviews": [
   "High quality Italian food in a charming setting. Jazzy music, warm romantic vibe - would be a nice place for a date. The menu is not too expensive, so I came here with a group of 7 work friends and we all left happy, even with wine, appetizers and dessert. The food was delicious with lots of options.",
   "This place is one of the best hidden gems of the North end! The staff was so friendly, the wine amazing, and the homemade pasta was out of this world! It's a perfect atmosphere for a nice family dinner, important date, or just trying to enjoy some authentic Italian food! I can't wait till my next visit.",
   "The food is phenomenal. Everything we order was great. My only issue is parking. Would definitely go back.",
   "Great find. Like having dinner with an old friend and this was our first time there. Barbara came over to our table make sure everything was to our liking. It was even better than that. One of the best values in town. Wonderful experience,  great restaurant and great food.",
   "The staff here moves as fast as they can but the one thing if there was any to complain about is the slow service with the cocktails. Not sure if it was because these were some serious creative cocktails or what but the time from one to the next was long, almost too long. Dessert was forgetful and needed work, could do without the Greek donuts and chocolate Twinkie"
  ]
 },
 {
  "name": "Cafe Polonia",
  "address": "611 Dorchester Ave, Boston, MA 02127, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e21f05a8-932e-11ea-9adc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9259065678258246144",
  "source": "GoogleMaps",
  "reviews": [
   "Very small but quaint. Reservations are a must. Staff were very friendly and service was good. Food was really good too. We started with Salmon and Caviar which was to die for. Our dinners were great. The kielbasa was my favorite. My husband loved it all! Sadly, we were too full for dessert.",
   "Food is amazing. It was just like a home cooked meal someone spent all day cooking. \n\nService was polite. Restaurant is very small. The neighborhood was not very nice however. They would attract more customers being in a better spot in the city.",
   "We went with some friends and had a great time! Reservations are a must as it is a small restaurant. The servers are friendly but do fall behind a bit on drink refills sometimes, still nothing major and we will definitely come again sometime.",
   "Love, love love, this little shop. I'm from NJ where our Polish food is Legendary, however i saw this place on Diners Drive-In's and Dives so I thought I'd check it out. If you love Polish \"soul food\" then make sure you stop by and tell them Martha from NJ sent you!",
   "Cafe Polonia offers a truly authentic atmosphere, with nice wooden tables and much traditional decor. As a central European, I was surprised how much it reminded me of home. The Polish beer and food tasted great, and the warm chocolate cake was a pure delight. They even got the whipped cream right!"
  ]
 },
 {
  "name": "Boston Sail Loft",
  "address": "80 Atlantic Ave, Boston, MA 02110, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e25cf928-932e-11ea-8f10-14b31f159f22.png",
  "tags": [
   "family",
   "hospitable",
   "food",
   "food",
   "food",
   "affordable",
   "organized",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2951276788102859512",
  "source": "GoogleMaps",
  "reviews": [
   "Went on a weeknight when I was in town on business.  Best chowder I’ve had in Boston, others feel the same way. Bowl serving size is good for a whole meal, and it’s a large cup! The atmosphere had character, as did Steve (I think) who was the bartender, who provided great service, and you could tell this was a family owned restaurant - welcoming, hospitable, and professional.  Great company as well in there, nice vibe, right on the water.  It’s a great place all around.  The size of the restaurant is probably not perfect for huge groups without calling ahead, but I think great for the restaurant itself because it is conducive to conversation with others.  Try them out!",
   "Amazing food and friendly staff.  I've been here several times over the years and it's never disappointed.  The seafood is very fresh and the quality is great.  Probably the best clam chowder I've ever had; so much so that I get it every time I come.  Other good dishes are the scrod (so fresh) and the various stir frys.  You also can't pass up the homemade onion rings.  Prices are about average for the area.  I highly recommend it!",
   "Tried seafood for the first and was pleased with the food. Had the lobster Mac n cheese, fish and chips and calm chowder. Very rich but very creamy and filling.",
   "This site is my number one restaurant.  Of all restaurants I know I favor it most. I always suggests to my friends to go to this restaurant. everytime  I I need a good lunch, this restaurant comes instantly to my mind. excellent and all kinds of  food and a large list of dishes.well mannered staff, and agreeable spirit. Also, the bill is affordable. I tell about this place with pleasure.",
   "One of the best chowders I’ve ever had! Place was packed solid when we got there but always a good sign for fresh food. Great quality overall but found the prices comparative to the area which all seemed inflated due to the high tourism. Service was really friendly and seemed very organized especially with the volume of guests coming in. As I said one of the best chowders with this incredible fresh dill that played well off the other ingredients. Certainly worth a visit."
  ]
 },
 {
  "name": "Scampo",
  "address": "215 Charles St, Boston, MA 02114, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e2ab406e-932e-11ea-8402-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "history",
   "food",
   "creative",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13921675401219385244",
  "source": "GoogleMaps",
  "reviews": [
   "Really terrific food served by a wait staff that was so professional and warm they felt like family. Only, super minor gripe, is that the restaurant seems more casual online than it really is. The prices were modest and the food superb, but I was expecting a more casual environment and instead was in a very upscale restaurant. Not that anyone made us feel out of place. It was a wonderful experience.\n\nAlso, the history of the restaurant, being an old jail house, was extraordinary!! Really unique experience for my family I can't wait to repeat!!",
   "Dine Out Boston lunch. Lemon sole did not disappoint. Beautiful plating and nice contrast in flavors made it a pleasure to devour. Tiramisu was just okay. I like more moisture in the sponge from the espresso. Beautiful space with a colorful past. Too bad no dinner menu for Dine out, but will have to try anyway.",
   "Great spot for a classy date night, celebration, or girls night out. Delicious food at reasonable portion sizes and great service. Creative menu with classics as well to hit all moods.",
   "Great jailhouse setting and stylish decor, varied menu with a bit of a seafood focus. Pizza and spaghetti dominate their specialty items, although you can find other cultural nods to Indian and other cuisines.",
   "Service was terrific, food was average, price was to high for what you get. I have eaten at many similarly priced restaurants and would happily go to others before returning. Mind you I only had select dishes but these were ones recommend for the wait staff. As noted the service is great here."
  ]
 },
 {
  "name": "Union Oyster House",
  "address": "41 Union St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e2f7b31c-932e-11ea-8c2b-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "walking",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6319045547406381352",
  "source": "GoogleMaps",
  "reviews": [
   "The Union Oyster House is the oldest continually-operating restaurant and oyster bar in the United States. This coupled with its convenient central location was enough to convince me of visiting. The food was great with generous portions. The range of seafood options on the menu was also great. Perfect as a treat and open till late, which is a bonus. This historical landmark also has its own gift shop where you purchase merchandise imprinted with the Union Oyster House logo.",
   "We were visiting Boston from Toronto and this was our first restaurant stop. With the rave reviews we were not disappointed! First off, oldest restaurant in Boston, just adds to the overall experience here. Walking into the place is like stepping back in time. Second, our server here was excellent. He was knowledgeable on the menu and provided his recommendations based on our preferences. We ended going for the clam chowder, lobster, and steamers. With the clam chowder being our first experience in Boston, we were certainly not disappointed. It was creamy, thick and had ample potatoes and clams!! It is a must try at the Union Oyster House. Fun fact that the server shared with us; on your way out of the restaurant you can check in at the main desk (beside the gift shop) and requests the recipes for both the clam chowder and the cornbread! Nice little added bonus to top-off your visit here",
   "This place was very good! Visited for Restaurant Week. Started with Fried Calamari, excellent. Entree, I went with lightly fried oysters which came with french fries... Yummy! Finished it off with apple cobbler.  Good stuff.  Worth coming back. Next time I would like to sit at the oyster bar.",
   "This place was great!  Our service both times we came was superb.  I can’t figure out which was my favorite, the Boston key lime pie or the chowder.  Who am I kidding, I loved both!  This place was recommended to us and it lived up to the hype.  Highly recommend!",
   "Recently dined at the UOH. We ordered the clam chowder... which was very good. Followed by the fried seafood platter, broiled seafood platter and baked beans. I think the beans were the best part of the meal. The rest was quite bland. I was expecting more. Our server was awesome, though, and the space is quite steeped in history. Glad we went but would not return. Also, the bathrooms are impossibly small."
  ]
 },
 {
  "name": "MIDA",
  "address": "782 Tremont St, Boston, MA 02118, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e33b2f54-932e-11ea-bf02-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "free",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13970542484529551853",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to have dinner with friends or a date night. Everything I had was yummy! The polenta, garlic butter bread, lobster scampi entre, mussels, salad and citrus cake (pound cake). Love the decor.  I will definitely be back!",
   "First come first served at the bar. We were able to find seats at the upstairs bar right away. The waitstaff was super quick and personable. Drinks were fast. Food was all super tasty and arrived quickly. Pancakes were very fluffy and the frittata was huge.  Live music downstairs was fun, though it you wanted a quieter space you should go upstairs.",
   "Wow was this good. Starting with the antipasto, then chicken, gnocchi, scallops, and spaghetti with crab. All dishes were excellent. Flavors were well balanced. Service was friendly and efficient. One of the best dinners it we've had in a long time. Oh and the alcohol free drinks were fabulous.",
   "This place is consistently great. Very good food. Very tasty! Great music selection. The wait staff was amazing. I'd definitely recommend.",
   "this place has it all. ridiculous food. solid cocktails. great staff. intimate neighborhood  feel. chef should be in james beard conversations right now. go before you can't get in the door for the line."
  ]
 },
 {
  "name": "Asta",
  "address": "47 Massachusetts Ave, Boston, MA 02115, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e38fb840-932e-11ea-ad3b-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "food",
   "creative",
   "tasting",
   "food",
   "delicious",
   "tasting",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=5578535171060764560",
  "source": "GoogleMaps",
  "reviews": [
   "The place is very nice and the service exquisite. Every dish was nicely presented. For me it wasn't a 5 star because everything was really good but none of the dishes blew my mind. The menu changes often so I'm sure they have amazing dishes. Out of everything we had the scallops with capers was probably my favorite.",
   "Pretty awesome dining experience, but like a lot of others have said we were served a lot of root vegetables, which bothers me from a value perspective. We got the 5 dish tasting and dishes were delicious and wine pairings were great! We got the foie Gras add on and split one order for two, which was plenty. Food was plentiful too! \n\nI would consider visiting again to try a different menu, the server mentioned the menu rotates about every 6 weeks so maybe in the spring we'll try again.",
   "Great restaurant with wonderful people. Fun, energetic, and casual yet serving creative, delicious food in a tasting menu format.",
   "We come infrequently but are always impressed with the improvement and experimentation. The asta team delights us, sometimes surprises us, and always makes us happy. Unlike most places with tasting menus, they allow and elegantly handle if people in the party want to have different sets.",
   "Very friendly.  Vegetable focused tasting menu place.  Called a hidden gem by one of the locals"
  ]
 },
 {
  "name": "Grotto",
  "address": "37 Bowdoin St, Boston, MA 02114, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e3cf0b5c-932e-11ea-bcc6-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11973863530715633315",
  "source": "GoogleMaps",
  "reviews": [
   "I come to this excellent place many times because I like the special air that is characterizes this place. The team is highly cordial and experienced. The service is pretty fast. Most important, the food you get is perfect. I have been there more than once and I was never disappointed. The expense is decent. I recommend this restaurant to my friends and family.",
   "Their food was absolutely excellent! The portions were perfect. The service was great. The lunch prices are reasonable. Will definitely be stopping by again!",
   "This restaurant is mine and my boyfriend's favorite restaurant in Boston! It is incredibly romantic and one of our first dates. The food is some of the best Italian food I have ever had! I recommend The Grotto to everyone I can.",
   "Dinner was pretty fantastic.  Nice space, dimly lit (in a good way).  Servers were friendly and attentive....just right.  The duck confit was excellent.  Slightly crispy skin, moist, nice portion.  They accommodated me by switching from a bed of brussel  sprouts to wild mushroom.  (Definitely better...seriously.)  The butter poached lobster linguine with a tomato sauce was also very good.  Nice chunks of lobster, didn't skimp.  Ended with the molten chocolate cake w/vanilla ice cream.\n\nGo.  Follow my lead.  I think you'll be happy.",
   "The best kept secret! All their food is amazing. The staff is fun and friendly. So great and quaint. Wonderful spot!"
  ]
 },
 {
  "name": "Deuxave",
  "address": "371 Commonwealth Avenue, Boston, MA 02115, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e418db0a-932e-11ea-8aa6-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=821716812107878549",
  "source": "GoogleMaps",
  "reviews": [
   "Artfully presented in a soothing atmosphere accented by exceptional service.\n\nIs there room for improvement? Always. Particularly in regard to the potatoes in the steak dish. Having them in the same cut but double fried in duck fat would elevate the dish.",
   "Nice fine dining restaurant in the Back Bay. I had the tasting and enjoyed most of my entrees immensely, with a couple of standouts (the Crispy Duck Confit and the Pan Seared Atlantic Halibut). Nice wine pairings. Felt like I got a meal commensurate with the price tag.",
   "The food and ambiance was outstanding. We were there for my husband's birthday. I requested for a customized  table with few surprise elements and they were on point with what I asked for.",
   "Upmarket dining with very well executed dishes. Delicious. 4.5 stars.",
   "Excellent service. Celebrated our one year anniversary  here and will come back again. Exquisite cuisine, intimate environment and warm staff that made us feel special.  Highly recommend for fancy dining."
  ]
 },
 {
  "name": "No.9 Park",
  "address": "9 Park St Pl, Boston, MA 02108, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e4604706-932e-11ea-998d-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "affordable",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=16110571487541170902",
  "source": "GoogleMaps",
  "reviews": [
   "Superb ambience and super personal service. The menu was crisp and enchanting. Will absolutely recommend this spot to friends and family. Convenient prices and generous portions. Great work.",
   "Flawless service in a relaxed atmosphere...no attitude here. The food was equally flawless in execution, and a relatively good value. I would definitely return, especially to just drop in at the bar.",
   "We had a fabulous time here. The food is delicious and plentiful, we had a variety on our table. Staff are incredibly helpful and can't do enough for you. As we had a slight.",
   "Very neat and convenient spot. They provide big meals and for affordable prices. We loved the menu a lot and the staff were very affable and informative. Will definitely recommend this restaurant.",
   "I eat in this lovely spot  a lot! This is my favorite place to to have a good dinner.  I go to this spot frequently. The cooking is just great, the staff members are polite and the price is decent. I like eating in this restaurant over a rich lunch."
  ]
 },
 {
  "name": "Chickadee",
  "address": "21 Drydock Ave, Boston, MA 02210, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e4abf7d8-932e-11ea-89ac-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2235193771864516633",
  "source": "GoogleMaps",
  "reviews": [
   "Food and drinks were good and had creative use of interesting ingredients.  But while generally good, every dish we ordered was just a little off in its own way to keep this restaurant from ascending to the peer group in which it hopes to be mentioned.  I am hopeful with a little refinement, they can make the necessary changes to menu and/or preparation that will improve things because it has the potential.",
   "Quick, friendly service, great atmosphere, great drinks. Food, amazing. Absolutely delicious, will go back very soon. We had the Duck with duck sausages, it was perfectly cooked and paired amazingly with the salad. The rabbit pasta was delicious and balanced to a \"T\". The almond cake was delicious and light with the silky ricotta sorbet. Go to this restaurant.",
   "Went for brunch and had an amazing experience. From the service, to the banana bread, and the amazing pancakes. A truly great meal. Highly recommended.",
   "Really blown away by this place\nWould def like to come back \nGood service and also able to facilitate a dairy restriction \n\nPlease note that due to the dairy restriction they deconstructed some dishes and they might look different from how they are normally served",
   "Such a lovely evening at Chickadee over the holidays. We were blown away by the Hen of the Woods and roasted carrots dishes. There's a lot to be said about restaurant that can brag about it's small plates. The interior is modern, but cozy, and the service was an example of true hospitality."
  ]
 },
 {
  "name": "Grill 23 & Bar",
  "address": "161 Berkeley St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e4ee88f4-932e-11ea-bc25-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4980109478314823036",
  "source": "GoogleMaps",
  "reviews": [
   "Omg!!!\nI had an amazing experience at grill 23. The staff is very friendly and well informed on the product they are offering. The steak was cooked to perfection and very rich with flavors. The lobster tails were succulent. The fried calamari wasn't the greatest, it was a bit to dry for me. Excellent wine collection....I will definitely go back",
   "A crown jewel among all restaurants we’ve been so far. Well worth every penny we spent. Definitely recommend their steaks and sides (esp Brussels sprouts and mushrooms). Loved their attention to detail and their attentive service. Be back again for another special occasion 👍🏼",
   "Came here as part of a large group from a conference I was attending. The restaurant itself was just amazing. The food was top notch. The steak that I ordered was cooked to perfection. Everything about the meal was fantastic. The staff never missed a beat and was on top of everyone in the large group, making sure we had everything we needed. Highly recommend this spot when visiting Boston!",
   "I love this place! It's upscale, but it doesn't feel stuffy. The food is top notch, and the portion sizes are HUGE! An excellent restaurant for any special occasion. Pro Tip: I know this restaurant doesn't seem like the kind of place to get tater tots, but Grill 23's are incredible.",
   "Oh my God! This restaurant is so nice... That for someone like me (from Portugal) I could only see it in movies... And finally being in it... It's mind blowing. I totally recommend it to anyone that is in Boston. Best restaurant ever!"
  ]
 },
 {
  "name": "Neptune Oyster",
  "address": "63 Salem St # 1, Boston, MA 02113, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e53f68d2-932e-11ea-9bf6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4320043846255745255",
  "source": "GoogleMaps",
  "reviews": [
   "Got in line at around 11:15am on a Friday morning. There were a few people a head of us. We were allowed in at about 11:35. Since it’s not too big of a restaurant and was only 2 of us, we shared a table with 2 others. Servers were great, explained all of our options and the food was fantastic! We ordered the crab bisque, which was amazing, along with the hot lobster roll and a few oysters. The food was fresh, tasty and was served pretty quickly. Definitely get there early in order to be seated first.",
   "Very cozy oyster bar. Oysters were fresh and good quality- a lot to choose from too. I love the lobster roll but you can probably find equally good ones elsewhere for cheaper. The other dishes we tried, primarily seafood, were also delicious. Be prepared for the queue though especially in winter- there is limited room for waiting inside...",
   "All of the food is delicious. And the atmosphere is my favorite - cozy, great lighting, lively but not too loud. I went alone and was seated immediately at the bar... Twice, which was great. Prepare to wait if you come with 2+ people though.",
   "Simply the best Oysters I’ve eaten anywhere! In addition, their other dishes are great too, especially the lobster rolls. \n\nLove the atmosphere, service is great and it’s always buzzing inside. I like that it’s small inside but just means you have to arrive early otherwise be prepared to wait. \n\nAlways at the top of my list when visiting Boston - highly recommended!",
   "If you want oysters, this is the only spot you should go in Boston. But be ready for a long wait, as this place is always popular. Even for lunch for one on a weekday, expect an hour wait. On the weekends, a table for two can take several hours — there are many great bars and sights to see in the area so the wait goes by quickly. The hostess that usually takes names is a no nonsense woman, she’s cold and has to deal with tourists and those who aren’t willing to deal with the long lines. Don’t take it personally! \n\nOnce inside, you’ll be able to enjoy the cozy atmosphere and see all of the fresh seafood Neptune has to offer. Enjoy the wide selection of oysters and fresh pastas, it’s well worth your time."
  ]
 },
 {
  "name": "RUKA",
  "address": "505 Washington St, Boston, MA 02111, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e58570a6-932e-11ea-9ab5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2944136416025546424",
  "source": "GoogleMaps",
  "reviews": [
   "Cocktails have been amazing with a fine selection of rare additions. Really well curated experience. Sushi sounds super healthy and quinoa based, but amazingly buttery salmon and quality tuna. Definitely worth a few stops to see the offerings. A little on the pricey side, so save a few dollars and save this place for a special date.",
   "We went for our honeymoon and the food was spectacular! The oysters were out of this world as was the chicken fried rice. Great portions for tapas. Ryan was our server and he was absolutely amazing. Our water was refilled the second it got low and he was the quickest waiter I’ve ever experienced. If you go, I would recommend to ask for a table with him. Best waiter in Boston!",
   "Great cocktails - LOVED the snap pea one. Matcha one was good too. Really cool interior design w lots of carved stone, metal and woke accents, and sick murals on the walls. Food was amazeballs - sushi on point. Noodles? Crazy. Would be great for a date night or to bring a fancy colleague. Get it.",
   "If you want a culinary adventure go to Ruka.  Small plates so you can sample everything\nThe wait staff is friendly and well versed in the menu and happily explain everything.  Drinks are large and excellent.  The atmosphere is more than cool.  Best calamari I have ever had.  The octopus my favorite.  Try it, you will love it.",
   "This was a great surprise! We loved it. It you have kids make sure to get the calamari. The pink pieces (picture included) move. Very freaky and our 10 year old loved it. \nSome of the best sushi I’ve ever had."
  ]
 },
 {
  "name": "Bistro du Midi",
  "address": "272 Boylston St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e5ca95fa-932e-11ea-8a75-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "delicious",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=14747769333194849535",
  "source": "GoogleMaps",
  "reviews": [
   "The black truffle cauliflower soup was lovely, it was flavorful with a nice texture.  The Hake had  perfectly crisp skin, was cooked perfectly and tasted wonderful.  The Frangipane tasted wonderful.  The mango ice cream was the best ice cream, smooth texture and nice mango flavor.  The meal was lovely.  Our waiter Richard, was knowledgeable, helpful and friendly, he explained every dish clearly, with the appropriate amount of detail.",
   "My friend and I sat upstairs for a late lunch and it was quiet and lovely. Staff was polite and attentive. I can't wait to come back for dinner. I highly recommend.",
   "Friendly waitstaff, ambiance nice but not stuffy, and delicious food -- Bistro du Midi was great! The chicken main dish and the side of mushrooms with anchovies were amazing, and the chocolate souffle to die for! We loved having dinner here.",
   "The second time I have gone there for a tasting  and I can't recommend it enough! Every dish is better than the last. One of Boston's finest restaurants. The staff, service and ambiance were exceptional.",
   "I celebrated my graduation this evening in this great place. I am glad to say that it was a great evening and the restaurant was definitely the reason for that outstanding meeting. The crew  collaborated in a graceful way, the cooking was yummy and my buddies were very  glad. We shall absolutely come back again for more events. thanks very much."
  ]
 },
 {
  "name": "Eastern Standard",
  "address": "528 Commonwealth Avenue, Boston, MA 02215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e60f674c-932e-11ea-b3f3-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "historic",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2903064501732029609",
  "source": "GoogleMaps",
  "reviews": [
   "A friend and I stopped in Before the Before the Celts game.  It was International women's day and they had drinks for that which was nice. Drinks were exquisite. Bartender was very pleasant",
   "Everything was perfect about this experience. The staff were beyond accommodating and the ambience was impeccable. Neurobiology could probably explain the bonding chemicals I felt eating this food. If you want to fall in love, eat here.",
   "The place is huge, tons of seating (including the bar area). The service was very quick. We received our drinks within in minutes and the meal shortly after. We both ordered the scrambled eggs plate ($13) - one with bacon the other with sausage. The potatoes were well seasoned and very filling. The plate comes with 3 eggs, which is nice since most places serve just 2. The sausage was two links but the bacon was only two thin strips- so I feel like that was kind of skimpy. Other than that, no complaints! Overall the food and drinks were fairly priced, service was quick, everyone was friendly and the food was delicious with large portions. Great brunch spot!",
   "The food is very good, although the prices a little high. A beer costs between 8 and 14 dollars. A hamburger costs about 15 dollars. The waitress (I think she was Colombian) gave us excellent service. The place is highly recommended if you want to spend about 30-40 dollars per guest. The building is historic and also looks very beautiful.",
   "It was very easy to find and there was service right as we stepped in. After we ordered the food came in about 10-20 minutes and the food was amazing! Barring a piece of string in our lobster roll the food was super good. We went for brunch  and they had good sandwiches and potatoes. The best were the mussels with super good flavor."
  ]
 },
 {
  "name": "The Oceanaire Seafood Room",
  "address": "40 Court St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e668ab10-932e-11ea-92d6-14b31f159f22.png",
  "tags": [
   "drink",
   "delicious",
   "food",
   "food",
   "free",
   "organized",
   "affordable",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16021313810345493103",
  "source": "GoogleMaps",
  "reviews": [
   "Had the best time celebrating my boyfriend birthday.... they had custom menus waiting for us....been craving the lobster mac &cheese since I left and my rib eye steak had so much flavor...so much to choose from on the drink menu....the manager Lucas is so genuine sweet and caring... can't wait to go back",
   "Very delicious food, great atmosphere and an amazing experience in all. I definitely recommend the scallops and my sister got the halibut. Without a doubt the best food I had in years.",
   "Okay, this is going to be lengthy, but here goes. We had our wedding reception here about a week ago and I truly cannot say enough good things about the staff at The Oceanaire, namely the event coordinator, Bailey, with whom we worked very closely with over the last year of planning our big day. \n\nMy now husband and I searched tirelessly for months for a wedding venue, but could not find anything in the downtown Boston area that was affordable for two twenty-somethings who were going to be footing the majority of the bill. The Oceanaire had been our go to dinner spot for NYE for the past several years and became a tradition; while sitting at the bar on NYE 2018, talking about plans to elope, I thought \"I wonder if this place does weddings...\" The bartender gave me Bailey's business card, so I sent an email the next day; she responded almost immediately, with several attachments for dining options, bar menus, etc. which, to my surprise, were more affordable than ALL of the downtown Boston hotel quotes I had gotten. We both are huge foodies, so we were immediately hooked on the idea of a downtown winter wedding, complete with an exquisite dining experience in a gorgeous, historical building.\n\nOver the course of the year, we came here every few months for tastings, drink selections, timeline meetings, etc. and Bailey was always there, punctual with our file in hand and a waiter ready to take our order. Our email thread is probably over 200 messages long, mostly of me changing my mind about certain things - I don't think I ever waited more than 48 hours for a response from her on anything. No matter what it was, Bailey accommodated us on EVERYTHING, even if it meant having to do things herself. She made our table cards and menus, organized the candles/centerpiece set up, set up the props for our photobooth, contacted all of our vendors to create a day of timeline...I mean, I quite literally could NOT have done this without her, as I did not have a wedding planner or day-of coordinator.\n\nThe day before the wedding, I had so much anxiety over the small things that people don't even notice, naturally. My husband just kept saying, \"Bailey is really good, she has got it. There is nothing to worry about.\" He was so right. When we got to our reception, I almost burst into tears with how perfect everything looked, better than I had even imagined in my own, non-creative head. She stayed the entire night, checking in with us to ensure everything ran smoothly and on schedule, as best as possible. \n\nSeveral of our guests said that this was the best wedding they had ever been to; I was so surprised and flattered, but how could I be when Bailey was behind it all? From the AMAZING raw bar and passed apps to the mouth watering entrees, many guests also said this was the first time they weren't starving at the end of the night at a reception! People were raving about the food, which is the one thing we cared about...GOOD FOOD. Boy did the Oceanaire deliver! One quote from my great-uncle: \"This was the best key lime pie I'd had in decades.\" The service from the waitstaff and overall flow of the evening was just perfect; everyone had an outstanding experience, especially my husband and me.\n\nOKAY. So, to summarize, we quite literally could not recommend this place more to have a wedding. It was so stress free and easy! Bailey, is one of the best in the business, and you would be lucky to have her coordinate your wedding or big dinner gala. The food was AMAZING and the service was second to none. Thank you so much, Bailey, and The Oceanaire Seafood Room for making our wedding day so incredibly perfect. We will definitely be returning every year for our anniversary!",
   "The food has always been outstanding. The service was so accommodating for our sweet 16 dinner, I would not have wanted to have dined at any other restaurant. From the door, the hostess was helpful and warm, as was our waiter (I can't recall their names). They asked all the right questions/volunteered info when it came to the details of how the night could/should go. This was a 1st for me. To top the night off in the WORST way ever, I had issues with my bank (paying 4 a # of birthday things, they put a fraud alert hold). The manager, Lucas, was BEYOND understanding which allowed me to focus on hosting vs having a panic attack! In the end, the bank remedied...I could host...guest laughed and the birthday girl has a memory worth having. Thank you Oceanaire and staff! 😍😍😍 I highly recommend!",
   "Outstanding overall experience! Beautiful ambiance,  exceptional food made to perfection, and superior service. Occasion: Date night on New Year's Eve. We ordered filet mignon with mashed potatoes and rack of lamb. Convenient valet parking as well."
  ]
 },
 {
  "name": "Fogo de Chão Brazilian Steakhouse",
  "address": "200 Dartmouth St, Boston, MA 02116, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e6b91540-932e-11ea-9339-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14217582044482360805",
  "source": "GoogleMaps",
  "reviews": [
   "Had dinner with a group of friends for a birthday dinner. Large selection of meat, a buffet type space where you choose your own entrees. Great cocktails and drinks. Like the idea of the servers bringing you fresh cooked meat at your table whenever you request it. Innovative and efficient. However dinner was pricey. It's great for people with good appetite",
   "Best Brazilian steakhouse ever! This place is amazing. You will leave full and satisfied. The meats are supreme cuts and cooked to perfection. Well worth the money. Forgot to take pics I was so focused on eating. I'll be back here soon. Photos to come",
   "Last week, I took a group of ten coworkers here for dinner. Drinks were delicious and the food didn't stop coming. While I didn't personally try the sausage, many said it was fantastic. I tried everything else and really enjoyed it. The waitstaff was able to get us in and the place was clean.\n\nThe entrance could be a bit clearer, as we entered a shopping mall with broken escalators first, only to go back down and find the correct entrance.",
   "What an AMAZING culinary experience!\nVery energetic top notch BEAUTIFUL restaurant. You can find here your favorite meats, rich salad bar, and a very yummy salmon! \nI LOVED my complimentary birthday cake!\nTHANK YOU Fogo de Chão for an amazing night! 💕",
   "Vegans beware! This wholesome, all-you-can-eat meat eatery is the best around. Pay for a significant other, but any other type of other and you're definitely splitting the check. Let yourself starve before you come here, I do every time and never regret it. It may take 45 minutes after you're full before someone asks if you want to pay. Do not worry, you will have plenty of time to talk with your table about how good the food was; this is Portuguese custom (I think)."
  ]
 },
 {
  "name": "Venezia Restaurant Boston",
  "address": "20 Ericsson St, Boston, MA 02122, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e700d502-932e-11ea-8a07-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "eat",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5558406169195926387",
  "source": "GoogleMaps",
  "reviews": [
   "This place has great burgers. The service was awesome and nice. The whole table enjoyed there food. Great place to hang out.Had lunch here yesterday and the food was excellent. I got the Scallop roll with fries special and it was the best! Large plump scallops on a large roll. Fries were tasty. Good portions and great beer selection on draft.",
   "I went to an elegant, beautiful wedding there in October. Big function hall with all differ rooms and places to congregate . Like front room when you walk in had bar along with imported aged cheeses and crackers before heading to main function hall to eat. Off hall is an oversized patio with seating overlooking water . They even have second floor with bridal room and for photography before wedding party is introduced to the guests. Thorough, dressed up staff to go along with sofisticated interior. Easily enough room for the over 200 guests . What a memory for Bride . Fit enough for a princess ! Food was AMAZING",
   "Very romantic restaurant.  Delicious food and service second to none.  We made a late afternoon reservation so we could enjoy the beautiful view of the river and downtown Boston before and as the sun set.  I highly recommend this place.  We plan on going back again.",
   "Nice dining room. Excellent service and the food was outstanding. Girls night out and we had a wonderful time at Venezia and we will be back.",
   "Although I didn't cater this event (so I can't rate them from that perspective) we had a very nice experience here. Food was great, service was great. We ate on the restaurant side, they also have a banquet hall. We had about 30 people at a busy time on a Saturday and the service, while a little slow at times, was still as prompt as you could expect. We'll be back."
  ]
 },
 {
  "name": "Committee",
  "address": "50 Northern Ave, Boston, MA 02210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e770484c-932e-11ea-886c-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "music",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9371186847501812367",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome! Everything was so so so good. Had to make ourselves leave to not order everything. \n\nAmazing date spot and the drinks were next level.\n\nCould come here every week!",
   "Classy place that kind of has the vibe of a club but also the type of place you take your parents when they’re visiting town—at least that’s what we did, haha. The lights are low. Candles are lit. Music is bumping. We were fans!\n\nService is great. Food is amazing. It’s all tapas, so go wild on that menu. Drink menu is also fantastic. \n\nI would definitely recommend this place to anyone in the Seaport area!",
   "Good food with amazing service and friendly staff! \nWent their twice, once for dinner and the other time was for brunch. I would say I liked their brunch more. The dinner is tapas style but i would say it is a bit a lot of food.",
   "This place never disappoints. Service is always amazing and the food is exquisite, but it is a small plates kind of place so be prepared to share lots of yummy things. The cocktails are the best and always new options available.",
   "We were very excited to try Committee for the first time, as the reviews were all great and our expectations were high. We secured a table on Friday evening for 19:00 and were hoping for the best. \n\nWe showed up at 18:55 and were told that our table would be ready momentarily. We were seated 15 minutes later, a minor inconvenience as the place was packed. We ordered tapas style, as many of the dishes are meant to be shared with others, and eagerly awaited the first dish. However, instead of a few dishes coming out at once, every single dish we ordered was delivered to us within 5 minutes of each other. The table was crowded, and many of the dishes were hot, but by the time we got to them they were cold. In addition to this annoyance, the bar was extremely crowded, and people were getting rather rowdy for 20:00 on a Friday. The noise level was insane and we barely could hear each other speak. This was further compounded by the loud music also playing. It seems that many come for the bar, rather than the restaurant, which makes it difficult to enjoy your own meal. \n\nThe food was enjoyable and prepared well, but the atmosphere and the bombardment of our dishes ruined it for us. Perhaps we shall try again on a weeknight, and ask for our dishes to be spaced out."
  ]
 },
 {
  "name": "Myers+Chang",
  "address": "1145 Washington St, Boston, MA 02118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e7c3b540-932e-11ea-987c-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "creative",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3004071926339764128",
  "source": "GoogleMaps",
  "reviews": [
   "This place did not disappoint! Excited to see Joanne Chang behind the bar when we walked in. The balance of flavor in all the dishes we had was outstanding. I wish this was in my hometown so I could try more of the dishes because everything we tried was delicious.",
   "As a person who's dined at Myers and Chang a handful of times I wanted to write about the takeout experience.\n\nThe staff who picked up the phone was courteous and was thorough with going through with the order. As I was driving over to pick up my order, I received a friendly reminder that the food was almost ready (which is great to hear). \n\nUpon picking up the food, I got asked by the staff whether I needed chopsticks and napkins which is also shows great customer service. Finally I must say that the food was delicious even for takeout. It was still warm when I arrived (and I live in Brighton). Also, thank you for the complementary chocolate mousse and the shrimp chips with the order.\n\nGreat take out experience and will order in the future.",
   "Great place to visit with a small group and try a lot of different dishes. Mostly lived up to expectations. Some creative and tasty takes on Asian fusion. The crispy salmon rolls were the standout, we called the waitress back for a second order. Tuna poke bowl was nicely spiced and fresh. Cocktails were creative and refreshing on a warm day.",
   "This place is my number one restaurant.  Of all restaurants I know I favor it most. I never miss an opportunity to go to that place. Whenever  I want to go to a proper dinner, this place comes first to my mind. excellent and many types of  food and a rich cuisine.generous staff members, and good vibes. In addition to that, the pay is honest. I suggest this restaurant with no hesitation.",
   "If I could rate 6/5, I would. It's an amazing experience, great service and fantastic food. I sat at the bar and had great conversation with one of the chefs. I ordered half orders of the eggplant, longevity noodles, and scallion pancake, and I couldn't be happier. I took home about half of the food and I'm excited for the leftovers. Highly recommend"
  ]
 },
 {
  "name": "Marliave",
  "address": "10 Bosworth St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e81778d0-932e-11ea-91ba-14b31f159f22.png",
  "tags": [
   "food",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=1056534624632597939",
  "source": "GoogleMaps",
  "reviews": [
   "Went for a birthday dinner for restaurant week in March. Therefore, we were on a fixed menu. Service was a bit low despite the restaurant being a bit empty but our server was great and energetic once he got to us. \nThe appetizers with the escargot and the beef were to die for. They appear to have gone for the cheaper items for the main menu. The duck dish was tasteless but the silver lining is the how accommodating the restaurant was. Upon mentioning the duck dish, they quickly offered to switch it out for another main course item of my preference. the salmon they brought in was very good. flavourful and crispy on one side. The Sunday gravy was quite good as well.\nI made the mistake of ordering a cheese board with a chocolate truffle for dessert. Tasty, filling but a bit pricey",
   "Fantastic downtown location, good food and nice cocktails. Technically the founder may have been french in the late 1880s, but the menu is not strongly French. Listing it as a French restaurant seems a bit of a stretch, although we enjoyed everything we ordered.",
   "An incredible restaurant with one of the best cocktail menus in the city. I've been several times and I've never been let down. The staff is always very friendly as well.",
   "At the moment  you step in that restaurant  team give you an excellent feeling. Very congenial stuff, it is a happy place to go out with buddies or with your date. yummy  meals, creative  chief cook and stuff, comfortable  price and attentive  service. Highly recommended.",
   "Everything was amazing. The drinks weren't too strong but enjoyable. Will go back if in the area."
  ]
 },
 {
  "name": "Coppa Enoteca",
  "address": "253 Shawmut Ave, Boston, MA 02118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e862b2da-932e-11ea-93d5-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "delicious",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=270586052304520461",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best restaurants in Boston. The atmosphere is good. And the food is awesome. They do really nice cocktails as well. I just want to give them more stars!",
   "Excellent small Italian restaurant in Boston.  The pizza is excellent but you have to get to get the celery Cesar salad.  The swordfish is also excellent.  All of the pasta dishes are very good.  It has a small bar and outdoor seating as well.  Reservations are recommended.",
   "The food, the drink, the space, the people: All excellent. Coppa continues to be pretty close to a perfect restaurant and one of my favorite places in the city.\n\nWhile a table on the patio is heaven in the South End, my favorite way to enjoy Coppa is sliding up to the bar, grabbing a house Negroni, and enjoying a few smaller dishes, finishing with a pasta.",
   "I've been coming to Coppa for years. Definitely my favorite restaurant in the South End. Delicious food in a cozy atmosphere. The pasta is just sooo good. On second thought...everything is good!! Friendly, accommodating staff. I've recommended this place to countless people. My tip to you: make a reservation!!",
   "Small place, but they do make the most of their room. The charcuterie is pricey but unique options make it worth splurging; duck prosciutto, tongue, beef heart pastrami.. Pizza was very good, but didn't blow my mind. Pasta dish was very good with an interesting mix of ingredients. Try the gelatto with espresso to pour over, fantastic. Pricey, but not outside what is typical for a city location offering an inventive quality menu."
  ]
 },
 {
  "name": "Ocean Prime",
  "address": "140 Seaport Blvd, Boston, MA 02210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e8b00fbe-932e-11ea-9556-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "music",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10826618074696776435",
  "source": "GoogleMaps",
  "reviews": [
   "Listen!!! I don’t leave reviews but this restaurant has moved its way to my favorite restaurant. It was packed but worth the wait. If you are looking to dress up, and dine in fine style this is where you need to go. The food is simply perfect! My wife doesn’t eat shrimp and she ordered Shrimp Sauté for appetizer and she couldn’t find words to express her love for the dish. She had the two lobster tail to top it off.",
   "Food is a little pricey for what it is - nothing truly amazing or groundbreaking. The ambience is also having an identity crisis - it doesn't know whether it wants to be trendy and hip or classy and modern. It's just a little weird to have to weave through a sea of drunk coeds dancing to live music in order to enjoy some 60+ dollar steak.",
   "I was overall happy with the restaurant. The server was naturally a little rigid.\nFood was good, but not top, especially for a luxury place and for they charge.\nI ordered Kansas city strip steak. It was cooked to my liking and the first bite tasted great. But then something didn't feel right in subsequent bites. It didn't have enough flavor and the marbling distribution was not good as some bites were tender and others were more chewy.\nDouble baked potato quickly turned to rubbery texture on the exterior. The interior tasted good though.\nSeating was comfortable and there were plenty of seating options to choose from on a weekday around 4pm. \n\nI would go there again if I'm invited, but I will certainly spend the money in a different steakhouse if I have the option.",
   "Is it a good place? Yes. \n\nIs it the best ever? No, and far from it. \n\nThe surf & turf was truly excellent. Top 3 in New England. The appetizers and desserts were disappointing and bordering pathetic. Visited on a Saturday for dinner service, so you know the A-team was in the kitchen. \n\nComing here was like getting slapped in the face, then given heavenly bliss, followed by another slap in the face. Then paying and saying thank you for the slaps in the face. \n\nWorth returning exclusively for a main course, skip the rest",
   "I take my kids there regularly, and they all love it. They have a good selection of kids menus, with several different kinds of meats available. They also will bring unlimited dippers for the cheese, so when my youngest wants only bread and carrots, he can enjoy those while the rest of us have the fondue."
  ]
 },
 {
  "name": "Sportello",
  "address": "348 Congress St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e9055c12-932e-11ea-a05b-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9310400108178793882",
  "source": "GoogleMaps",
  "reviews": [
   "Very elegant and accessible spot. They offer big portions and for fair rates. I loved the menu a lot and the waiters were very welcoming and explanatory. Recommended.",
   "Really really wonderful pasta.  I had their tagliatelle, and it was superb.  The style of the restaurant is also really neat, with a fully exposed kitchen.  Highly recommended.",
   "Really good! The gnocchi was a little heavy but that was our bad for not expecting it (especially for lunch, whoops). Very very good food.",
   "Came during lunch time and only had to wait around 15 minutes or so. You get to pick your own seats and your order is brought to you. The ambiance inside is really nice! I ordered the breakfast sandwich. The brioche bun was really tasty.",
   "Neighborhood upscale Italian. All pasta made in house. A nice place to drop by, or even eat alone."
  ]
 },
 {
  "name": "Teatro",
  "address": "177 Tremont St, Boston, MA 02111, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e948ed30-932e-11ea-9396-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16117182688895747838",
  "source": "GoogleMaps",
  "reviews": [
   "I have dined here three times.All excellent experiences. The veal entree was awesome the first two times.\nThis visit I ordered the chicken parmigiana .It was was without a doubt the best I ever had.",
   "My favorite restaurant!! If I could eat there every day I would. There hasn't been a dish that I haven't loved. I love their calamari, and the muscles are my ultimate favorite. The homemade sorbetto is absolutely delicious!!!",
   "I prefer this restaurant a lot. theres a special air. The cuisine is marvelous. the service is effective and the stuff is well trained. The price is honest. I highly recommend.",
   "Decent food. Decent value. Lobster pasta dish was great. 3.5.",
   "Friendly, courteous and attentive staff. Fun, lively, modern decor. Fresh, bright, well composed flavors. Great experience and we were unrushed as three of us lingered over desserts and another glass of wine."
  ]
 },
 {
  "name": "The Barking Crab",
  "address": "88 Sleeper St, Boston, MA 02210, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e98ce586-932e-11ea-95e2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2939844587404906291",
  "source": "GoogleMaps",
  "reviews": [
   "It's a good summer spot to have a bucket of light beers if you're a tourist or after work. The water taxi has a pick up spot at the dock in front of it. So it's a great place to start before taking the boat to another bar. Fun time.",
   "Excellent Market Crab and Lobster.  Fresh oysters were great. You can tell the seafood is fresh here. Great choice if your looking for a local place that isnt a chain. Food receives 5 star. Service was acceptable but lacking. I strongly suggest a cell phone policy for their servers!",
   "Hands-down one of the best restaurants in town for seafood. The ambience is great. The view is beautiful. Super crowded during weekends but the service is on point. A must-try if you are in the area and looking for some seafood. \nRecommendations: Fire-grilled Lobster and Grilled Salmon",
   "Nice cozy place with wood stove in the winter. Excellent fried clam bellies and calamari.  Fast, quick food service. The staff and our server, Jess,  were definitely helpful and friendly. Monetary cost for two persons: 1 app, 2x Entres, 2x Sodas: ",
   "First Visit to Boston and this was on my wish list. I was not disappointed. There was a wait but i was able to walk around a bit. The food was delicious and the service was great. I would come again on my next visit. @raulvsfood"
  ]
 },
 {
  "name": "Maggiano's Little Italy",
  "address": "4 Columbus Ave, Boston, MA 02116, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/e9d70e1a-932e-11ea-b9b0-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "walk",
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6234145124348043405",
  "source": "GoogleMaps",
  "reviews": [
   "This place is incredible I've been here 2 times!! Best Italian food I've had at a restaurant. I wish I remember the 2 waiters names I had both were awesome at their job's. Hopefully when I go there next time I will see them and remember their names. Highly recommend",
   "Food was delicious! Service was great!\n\nDefinitely gets busy on a Saturday night. Also they only take walk ins after 8pm so make sure to have a reservation all setup! \n\nI'd advise trying something new and not going with the good old Fettuccine Alfredo lol",
   "I like to go with friends to this place with my warmest recommendations. I visit this restaurant often. I get very good feedback from my friends. The the cooking is appetizing and the team is generous and cooperative. Whenever we eat in this place we enjoy a delightful evening.  highly recommended.",
   "I made valentines day reservation 2 weeks prior. We were seated promptly. Our server was awesome! Food was outstanding. The desert was DELICIOUS. This is my FAVORITE restaurant. Nobody beats the service, food, atmosphere here. I'll be coming here forever.",
   "Why did this not meet up to expectations?\n- The restaurant was half empty yet we had to wait for a table. Why?\n- The scampi were not that great. You can find much better in Boston!\n- The Bolognese had too much cream in the sauce. It's tomato right? Don't make an Italian cry!\n- Pasta options for dinner were limited. You can find them in first courses all over Italy. \n- The Bread was so-so. Okay, this is just a side to fill you up. \nNext, pineapple in pizza? This is just getting a very Americanized here."
  ]
 },
 {
  "name": "Lincoln Tavern & Restaurant",
  "address": "425 W Broadway, South Boston, MA 02127, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ea212800-932e-11ea-9fd7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "creative",
   "music",
   "delicious",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=9928386449538999543",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! This place pretty much had it all: delicious food and drinks, friendly service, and a great atmosphere. Our table got Lincoln burgers and they were very well seasoned and cooked exactly as requested. The baked fig and goat cheese was SO good that we were talking about it hours later. Our server was very efficient and friendly, and she made us feel welcome the entire time. Overall I would recommend this tavern to anyone in the South Boston area!!",
   "Great weekday brunch until 3pm! Although the brunch menu is small, it’s exquisite! I highly recommend the breakfast pizza. I also got the shrimp salad and it was definitely big enough to split (so is the pizza). Will definitely be back for the creative drinks and live music in the future!",
   "What an Amazing brunch place! I loved every single bite of it. That is our second time and this time we decided to try the test kitchen (on Friday lunch time) and everything was delicious. I would recommend the breakfast pizza and poutine! If you’re not the test kitchen, I would recommend the California brunch which is a healthy brunch option that is delicious and well made with guacamole and spinach.",
   "If you’re in need of some comfort food, this is the place to be. The food here is absolutely out of this world. By far one of the most amazing food places I’ve been to in Boston. I definitely will be going here a lot more often!",
   "Lincoln’s is a cool, hip tavern with a great brunch. They have unique breakfast options and some classics with a twist. Like their fruity pebbles pancakes! Service seems like it could be nice but our waitress felt a little short."
  ]
 },
 {
  "name": "Boston Chops South End",
  "address": "1375 Washington St, Boston, MA 02118, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/ea6586ae-932e-11ea-aa16-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "cheap",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2303927069091448132",
  "source": "GoogleMaps",
  "reviews": [
   "I have frequented chops over the last few years and always enjoy their menu.  Ms. Sinclair, a manager at Chops, helped make the evening wonderful for my girlfriend and I as we celebrated and had an evening out.  Everything was amazing and the food was fantastic.  Highly recommend starting off with a seafood tower and moving to one of their prime cuts.  The desserts cannot be skipped over either!\n\nWe cannot wait until their brunch specials are back this summer!",
   "I am a huge fan of Chef Chris Combs! He's a local favorite and has four restaurants in total. Two Boston Chops location, Deuxave, and. dbar; which I have tried all and really love the effort he and his team puts in to the whole experience. I highly recommend visiting!",
   "This site is my number one place.  Of all restaurants I know I love it most. I never miss an opportunity to go to that place. everytime  I feel like having a decent lunch, this restaurant comes right away to my head. good and varied  food and a large list of dishes.great team, and great ambience. And very important, the pay is modest. I suggest this place with great pleasure.",
   "I have been to Boston Shop, South End for many times.  It’s one of my favorite restaurants in Boston. The service is good and the food is great, but it’s not a cheap restaurant. Get your wallet ready if you decide to eat there, it could cost up to $100-300 just for two people to get the decent dinner meal.  However the food is really delicious. Worth the cost anyway. Try their deserts as well. Really delicious! They’re always busy, Make a reservation if it’s needed.",
   "Steak lovers rejoice! This place is amazing. The servers here go above and beyond to make sure your experience is nothing less than exceptional. Also can’t go wrong with their bottomless fries as a side with your meal."
  ]
 },
 {
  "name": "Mooo....",
  "address": "15 Beacon St, Boston, MA 02108, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eaadded0-932e-11ea-8718-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1056010191334569853",
  "source": "GoogleMaps",
  "reviews": [
   "I came here to celebrate my dear friend's birthday given he really loves good quality steak. One of my coworkers only eat Kosher steak so we needed to find a place that serves it. Thankfully Moooo... had it. \n\nI was touched by the fact that they prepared a paper menu with my friend's name and saying \"happy birthday\". It was very thoughtful of them to have it prepared.\n\nI got the rib eye steak, which was beautifully cooked (medium rare). We also got the wild mushroom and creamed spinach for our sides, which were very tasty. We finished our meal with a great rich chocolate cake, which was very memorable. \n\nOverall, it is a very nice place to have a great steak meal to celebrate a special occasion. I will highly recommend this place.",
   "Food was very good as was service. The wine list was one of the best I have ever seen. However, it was one of the most overpriced wine lists I have ever seen. If you want a good bottle with your meal try elsewhere unless sticker shock is okay.",
   "Nice food, great service, could be better\n\nFor $200+ per person, one expects an amazing meal and we got something close but not quite there....\n\nWe got the attention: service was amazing, table size quite generous, sound proofing great, nice plates, nice linen, very prompt seating, great acknowledgement of birthday (it was on the personalized menu!)\n\nFood was good but not perfect: oysters were great, brioche bread was warm, bone marrow generous, steak was \"fine\" but I've had better at other fancy steak houses, sides were meh- on par with Boston market, dumplings with beef were same as any good Chinese restaurant (but 5x price), dessert was cute but the banana foster we make at home is better. Drinks were ok- we don't drink wine so their amazing wine list was lost in us.....\n\nIf I shell out that kind of money for a diiner- I want to remember it for a LONG time and it is already fading......",
   "Pros: Quiet. Great oysters. Bone marrow is excellent. I had the dry aged rib eye, and it was meltingly good. House steak sauce is nice and vinegary. Bread rolls are rich and fluffy, bordering on brioche but more like Parker House. Portions are generous, so come hungry.  \n\nCons: Oyster mushroom side was low on seasoning. Check came before we asked for it. Chocolate covered marshmallow that came with the bill was a disappointing final note to the meal. Entree was placed in front of the wrong guest. Bananas in the bananas Foster were firm (although they had a nice crisp caramelized layer). Not usually a big deal, but at this price point my standards are high.",
   "Definitely not for the faintest of wallets but atmosphere and service excellent. Steaks we ordered were cooked to perfection. Pleasant staff and wide selection of wine, spirits and other drinks."
  ]
 },
 {
  "name": "The Daily Catch",
  "address": "323 Hanover St, Boston, MA 02113, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/eaf3e7d8-932e-11ea-b20a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "family",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11935355669967721300",
  "source": "GoogleMaps",
  "reviews": [
   "I've seen so many places like this on shows and movies. This is a true quaint little spot with amazing seafood. Loved the menu. The wait staff was great. The dishes were the right size and packed with flavor. I also enjoyed that they have appetizer portions for their pasta dishes.",
   "The restaurant is very small but cozy. It is first come first serve and you can't save seats, so make sure to have everyone in your party there on time to be seated. We had calamari for appertizer. The calamari was great, just right amount of breading. Nice flavor. Very light. I had The shrimp linguine. And it was amazing! The linguine was cooked perfectly. The sauce was great. The people that were seating next to me ordered the lobster pasta, and it smelled so good. Service was fast. Small menu but seems like they nail everything. Cash only.",
   "Great food in a cozy atmosphere.  Kitchen is right next to dining area.  Highly recommend but there is a wait line.  Go during off hours between lunch and dinner to avoid the wait.",
   "DO NOT WORRY ABOUT THE WAIT TIME!!! We waited for 45 minutes in line and it was worth it. If it wasn't for people spending their time taking pictures inside we would have been in quicker. Once you're inside, it's small and cozy and it smells fantastic. The staff were very friendly. Service was quick. The food was fantastic!! Everything was fresh and the black ink pasta is delicious. It is cash only! Highly recommend!.",
   "Worth the wait...great North End Italian experience.\n\nI came here with my cousins who had been here before and insisted it was worth the wait. I'm not a huge pasta person and I had my reservations waiting for a place that has only maybe 20 seats and doesn't take reservations. I was pleasantly surprised.\n\nFood: some of the best pasta I've had in my life. Must get the homemade squid ink pasta with ground squid, garlic and olive oil. Then had linguine in white wine sauce with mussels. Add a side of broccoli and that was enough for the 3 of us. Extra authentic points for them serving the pasta in the pans they are cooked in.\n\nAmbiance: tight and busy. This place is tiny and the kitchen is right there in the dining room so you can see everything. This is a true gritty experience.\n\nOur waiter was part of the family that owns the restaurant and it was great hearing about their history and plans for the future. This place is the real deal. Can't wait to go back for the squid ink pasta"
  ]
 }
]