[
 {
  "name": "Nevada State Museum",
  "address": "600 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb4688fa-932e-11ea-996c-14b31f159f22.png",
  "tags": [
   "history",
   "historic",
   "history",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=17384117226917804446",
  "source": "GoogleMaps",
  "reviews": [
   "What an impressive museum!!  We spent much longer there than we initially intended. Lots of interesting information, and the mine area was so very impressive!!  You really get a taste of what it was like to work underground in a mine!! They are working on a new natural history area that should be quite spectacular too!! Don't pass it up!",
   "I've been to lots of museums.  This by far has the greatest diversity of interesting & informative high quality displays.  From diverse geological, zoological, historic, numismatic, mining history, Mammoth skeleton, and so much more.  Allow 3 hours to breeze through.  This museum is a must see!",
   "Fantastic collections.  They've restored one of the original coin mint machines and it is fascinating.  The weapons collection is extensive and really interesting.  Lots of old-west artifacts.  They have a top-notch curator.",
   "If you’re anywhere near Reno go ride the steam locomotives! The ride there was nice also. The Wild mustangs we saw on the way back were worth the trip. Also close by is Virginia city. Cool stuff!",
   "I stop here everytime I am in town as its quite cheap and very interesting place to spend a few hours! The guy up front is probably one of the nicest people you will meet, wish I got his name but I hope he knows how great he is!\n\nI decided to get an annual pass this time around and I'm already counting down the days till I go back!\n\nIf you get a chance to stop by I highly recommend it!"
  ]
 },
 {
  "name": "Nevada State Railroad Museum",
  "address": "2180 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eb964518-932e-11ea-b919-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "family",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17881573345829414043",
  "source": "GoogleMaps",
  "reviews": [
   "We went right before Christmas and took our 3-year old & our 10-month old. I believe the train that gave rides is one of only 2 or 3The trains are decorated for Christmas. Santa and his helper boarded and rode the train, which thrilled the children. Santa & helper gave candy canes to passengers. Inside the museum are refinished beautiful old steam engines. We will go again.",
   "Not a huge place, but great display of probably the most historic moment in rails... The Golden Spike ceremony. Worth the trip if you like history.",
   "Went for the Christmas Train Ride!  My whole family has a fantastic time especially our four grandkids!  The museum was amazing,  the train conductors told us wonderful stories about the old but beautiful trains,  and we had a lot of fun in the gift shop!  We had great time!  😄🚂💙",
   "One of my favorites! I go back again and again. There's always somebody, a volunteer, who seems to know everything about everything. This time, we got a ride on an old-time hand car.",
   "Excellent exhibits of railroad history and stock. Very friendly and knowledgeable staff. Thoroughly enjoyed this museum!!🙂"
  ]
 },
 {
  "name": "Kings Canyon Waterfalls",
  "address": "Kings Canyon Rd, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ebd8b8d0-932e-11ea-a5cc-14b31f159f22.png",
  "tags": [
   "hike",
   "free",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=7758203391237869366",
  "source": "GoogleMaps",
  "reviews": [
   "Great waterfalls for the short hike! .3 of a mile to the lower falls gives you a great reward. It is uphill on you way to the falls, with switchbacks.",
   "So close to town. Easy trail to the waterfall. Local trail enthusiasts and forest service collaborated to create an additional loop trail (waterfall trail is short spur off this loop trail). It takes hikers up one ridge, back down to creek above waterfall, then up along the opposite ridge and back down the the parking area. Really well laid out trail never gets too steep. About 1.8 miles total. Great views of Carson City and Westside hills. A must-do. Just follow King St west to the parking area.",
   "Love coming up here late evening/dark when everyone else is gone, the waterfall under the moonlight is amazing.",
   "When you get to the waterfall the free AC is nice",
   "Very beautiful hike depending on the time of year. Definitely be aware if you’re taking the longer or shorter trail to the waterfall. The aroma of some of the plants is amazing. Quite an enjoyable, and at times, breathtaking (literally!) hike."
  ]
 },
 {
  "name": "Nevada Governor Mansion",
  "address": "606 Mountain St, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec2ca590-932e-11ea-b58b-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18271453404371412379",
  "source": "GoogleMaps",
  "reviews": [
   "We took a stroll in this beautiful, peaceful neighborhood and enjoyed the distinctive architectural details of this remarkable Mansion. The Governor personally hands out treats on Halloween. Also, the Nevada Room is available for use by nonprofit organizations, charitable community groups and schools.",
   "Drove the block its on. Wow, flash back into the past.",
   "The Governor's Mansion is absolutely stunning. It is open to the public only one day out of the year and that's on Nevada Day!  The tour is free and is given by people dressed in period clothing. You get to see all the rooms and learn about the history. I loved the silver place settings with the Nevada shaped napkins. The silverware even had little \"N\"s on them! They also do an amazing job of decorating the outside of the mansion during the holidays.",
   "Love the Halloween spirit and goodies plus the added Highway Patrol, crash test dummies and others who support this annual event!",
   "Dude!"
  ]
 },
 {
  "name": "Children's Museum of Northern Nevada",
  "address": "813 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ec74f536-932e-11ea-b2bf-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "cheap",
   "kids",
   "kids",
   "organized",
   "history",
   "music",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15576008433480605265",
  "source": "GoogleMaps",
  "reviews": [
   "I took the my daycare kids to see the museum I haven't been for a long time and they loved it. However, I wish it was a little bit more interactive. You can keep the history part of the whole museum but add more in depth learning to it for all ages. Infants to teens will honestly want to know more and I feel like if there is more to do for the kids than more and more kids will want to come. \n\nWe did have fun though! And the front desk ladies were super sweet!",
   "This is a amazing placing for children under 10 years old.  The museum is got so much hands on AND it is parent friendly.  Very little bending over, lots of things that parent and child do together.\n\nThe price is near perfect and the activities and numerous.  \n\nPlan to spend a couple of hours for sure. Also don't miss out on a chance to be an engineer driving a train.",
   "My kids loved it. There was a ton of stuff to do. It seemed very clean and fairly cheap. Kids are 5 and 1-1/2",
   "I don't know what I was expecting when I brought my daughter, but this wasn't it (i think i was expecting organized museum flow - like one display/exhibit flowing smoothly into another). But this was - - - Kids running everywhere, rickety building (that has it's own charm to be sure), a huge room with chaos and 'exhibits' seemingly everywhere... But once i was committed (10$?? 15$?) - it's actually pretty dang cool.  There's a little bit of something for everyone and it's very much a place for kids to explore new things.  There's music stations, nutrition stations, Nevada history stations, plus a whole bunch of other things.  I will definitely go back for a rainy day visit with my kid to explore more. It is also a venue option for kids birthday parties which I would also consider for the future.",
   "Pretty cool spot to take your kids and avoid the summer nevada heat"
  ]
 },
 {
  "name": "Brewery Arts Center",
  "address": "449 W King St, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ecb73b5e-932e-11ea-98f1-14b31f159f22.png",
  "tags": [
   "historic",
   "art",
   "brewery",
   "music",
   "free",
   "art",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=2094597957893720369",
  "source": "GoogleMaps",
  "reviews": [
   "I love the historic building being turned into a place where hundreds of people can enjoy art",
   "Great outside venue in Brewery Arts parking lot.",
   "I attended two of the free outdoor summer music shows in 2019.  This is my only experience here.  While there we visited the buildings that were open and enjoyed the art.  The grounds were clean and nice.  I will now be keeping an eye out for events at the Carson City Brewery Arts Center.",
   "Saw Mike Nash in a solo, unplugged sort of concert at the wonderful BAC venue. Simply fantastic. Mike Nash doesn't know it yet, but this solo format is the one at which he excels. I look forward to more \"intimate evenings with Mike Nash\". I applaud the BAC for helping to bring such wonderful evenings of entertainment to our lovely community.",
   "Great place to see events! Plenty of space and usually great shows planned! This really does help grow the community closer."
  ]
 },
 {
  "name": "Jack C Davis Observatory",
  "address": "2269 Vanpatten Ave, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ecfb164a-932e-11ea-98ae-14b31f159f22.png",
  "tags": [
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9084929703537814055",
  "source": "GoogleMaps",
  "reviews": [
   "They have a great program weekly and several telescopes to view celestial objects. When they have star parties you can bring your own equipment and there are outlets available to plug your equipment into. There is a walking path between the main campus and the observatory that has plaques with planets, and other objects.",
   "If you live in the Carson valley area it's a must to visit \nI really enjoyed it !",
   "Went to \"Joan of Ark\" lecture.  Was very interesting!  Learned a lot.  Great lecture!",
   "Went for their star gazing party and the hosts were very knowledgable and were more than willing to share about what you can see. If you have a someone who wants to study the sky. Bring them, these guys may inspire more than  you think",
   "We had an amazing experience and learned many new things. The volunteers are very patient and enjoy sharing their knowledge. We will definitely be back!"
  ]
 },
 {
  "name": "Fuji Park",
  "address": "601 Old Clear Creek Rd, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ed41ff52-932e-11ea-b8b3-14b31f159f22.png",
  "tags": [
   "structure",
   "field"
  ],
  "link": "https://maps.google.com/?cid=6288191746636798234",
  "source": "GoogleMaps",
  "reviews": [
   "This is a nice park. It has a fun climbing structure and picnic tables in the sun and shade. There's a huge lawn for running around too. The bathrooms are usually pretty clean. My only complaint is that sometimes they're out of soap.",
   "Wonderful park! Great for children. And a big grass field for a nice picnic.",
   "State Fair in the state capitol what more could you say it's a fair fairs are always cool",
   "The people were so helpful and very pleasant to be around",
   "I take the dogs to the park, they have a fenced area for the large and an area for the small dogs which they can be off leash, also the park allows dogs, but on a leash. The park also has a lot of events, fun to check them out. Nice place"
  ]
 },
 {
  "name": "Mills Park",
  "address": "1111 E William St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/edaf6764-932e-11ea-a887-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10397617291083160019",
  "source": "GoogleMaps",
  "reviews": [
   "The train ride here is always a blast for the kids when you can catch it open, and the park is very beautiful. A big creek runs through it with awesome little bridges. I'd mark it 5 stars bit it is very urban.",
   "I love Mills Park during the day for walking. There are homeless people who hang out here ...very few during the day though. It's a nice place to spend your lunch break.",
   "Been going here since a kid and now my kid goes here. I love the park but it could use a clean up crew some time soon!",
   "A great place to visit if you're in the heart of Carson City. Often has public events like the travelling Faire. Volleyball pits and skate park, jungle gym for the kids. Peaceful in the evening for a stroll or tossing horseshoes. Can get a bit dicey after dark because of rampant hordes of local vagrants, so best clear out before dusk.",
   "It's a nice little area to go relax with friends and family. There are picnic tables in both the sun and the shade, and they have enough space in between them that you won't be disturbed by other park-goers. Optimal place to go hang out for a small picnic/lunch (BYOFood. Lol)"
  ]
 },
 {
  "name": "Carson City Nugget",
  "address": "507 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 3.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee021b8c-932e-11ea-8e9a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12122565889365358206",
  "source": "GoogleMaps",
  "reviews": [
   "The staff are going well beyond at taking care of players. The cocktail waitresses are attentive and quite frankly, very beautiful.\n\nThey have a wide variety of slot machines and table games including Keno. They have many promotionalevents throughout the year and every amenity for the card club player.\n\nTheir security is very watchful over the patrons and polite. Parking is plentiful and secure.\n\nThey have restaurants and a wine bar, along with two more bars on the casino floor. On weekends live bands play and no cover charge.",
   "Nice cafe offerings for the price - they've kept the practices of the traditional casinos. Cozy atmosphere.",
   "Angelinas, Food is always wonderful.  Nice quiet atmosphere.  Friendly staff.",
   "Stoped in here on the way to Virginia City from Reno. Didn't expect to find a \"Nugget\" of a place in the middle of nowhere. This place for hanging out, gambling a bit or eating is really special. It might have been a real popular place back in the \"good ole' days\", but now, not many folks visit here.  All of the staff members we interacted with were great. Very pleasant and helpful folks. Casino is large enough to enjoy yourself, but not so big as to \"get lost\". The real special place here is the \"eatery\" located inside of the Nugget. There were six of us on this trip and we ate here multiple times over several days. Encountering different server staff each time, and each staff member made our visit very special. It really seemed like they enjoyed their job. The food was excellent and the prices were astonishingly inexpensive. We all agreed that we would come back here if just for the dinning experiences only. Excellent experiences. Would highly recommend and will certainly return.",
   "Carson City Nugget is a lot of fun. Nice atmosphere. Lotta slots if that's your thing. $5 a hand blackjack on Wednesday nights (not sure about peak hours). Free drinks for players. My favorite in Carson City so far."
  ]
 },
 {
  "name": "Washoe Lake State Park",
  "address": "4855 Eastlake Blvd, New Washoe City, NV 89704, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee4a968c-932e-11ea-b3a3-14b31f159f22.png",
  "tags": [
   "nature",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=16706040367439891732",
  "source": "GoogleMaps",
  "reviews": [
   "There are a few hang gliding launches in the area and we land at the park. Washoe Lake State Park maintains a landing zone at the park which is really nice. Beautiful park and a good place to see wild horses. Great staff.",
   "We had a great time during our visit to see our daughter in our son  In law. It is very pretty but also very cold during the 1st week of January. Can't wait to visit again.",
   "This place is so beautiful! So much nature. I liked it:",
   "Great time hiking out here!  Horse friendly.  Do you self a favor and hike the Deadman’s Overlook Trail.",
   "Well maintained, only $5 to access all areas of the lake. We are bird watchers, and this is an incredible place to find all sorts of fauna."
  ]
 },
 {
  "name": "Secret Cove",
  "address": "NV-28, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ee9df09a-932e-11ea-9268-14b31f159f22.png",
  "tags": [
   "kids",
   "unique",
   "food",
   "nature",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=10089856582712267416",
  "source": "GoogleMaps",
  "reviews": [
   "Super super nice hiding cove I have ever met. Definitely deserves to go back once and once again. I saw people bring paddle board or kayak but it’s very hard to carry heavy stuff since you need to use the hidden trail to get there. I assure you will love here but will feel exhausted to hand carry a lot tools. The water looks unbelievable I think it’s not worse than Hawaii. Again, the only difficulty is the path not so friendly for small kids. I believe that’s why there are not so many people crowded. It’s easy to find this place since you will see a lot of parking aside the road when you drive close. Finding a good parking location is important.",
   "It's so beautiful here! The water is crystal clear with a unique shade of blue. Very gorgeous! Yes, it's a nude beach as well, so don't be surprised. It's not ideal for picnicking; we were swarmed by wasps as soon as we took our food out.",
   "Secret can't stayed secret for long. But steep trails and small parking area are protecting this perfect creation of Mother Nature. Pristine views, magical rock formation and clear sky water!",
   "Amazing place! Another great creation by the mother nature. You need to park up there on the road and then walk down. The water is so clear couldn’t even believe. Please keep that place cleaner than you found it.",
   "Amazon Place unreal betautiful water. We went there in winter shielded from wind no people around. So nice."
  ]
 },
 {
  "name": "Hang Gliding Tahoe",
  "address": "2640 E College Pkwy, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/eef152a8-932e-11ea-8d4a-14b31f159f22.png",
  "tags": [
   "tour"
  ],
  "link": "https://maps.google.com/?cid=16106026701903558144",
  "source": "GoogleMaps",
  "reviews": [
   "Best part of my trip to Lake Tahoe was the powered hang glider flight.  Paul did a great job as both pilot and tour guide.  The flight serves as a intro to flying lesson and he patiently answered all of my questions.   There's no better way to see Lake Tahoe.  I plan to do this again.",
   "Paul is great.  Glad i went. Exhilerating.",
   "Super fun",
   "It was my first time experiencing Hang Gliding and Paul made the entire experience super exciting! I am ready to go again whenever I visit Tahoe! He even allowed us to steer and created moments for us to pause and smile at the camera throughout the flight! I highly recommend Hang Gliding Tahoe for a never forgettable Adventure with a spectacular view!!",
   "Amazing! Paul is an awesome dude and I got everything I wanted and more. Scenic flight, instruction, Tahoe facts and more. Highly recommend."
  ]
 },
 {
  "name": "American Warbirds",
  "address": "2600 E College Pkwy # 33, Carson City, NV 89706, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef57b5d0-932e-11ea-96b1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15510540468580944565",
  "source": "GoogleMaps",
  "reviews": [
   "",
   ""
  ]
 },
 {
  "name": "Sand Harbor",
  "address": "2005 NV-28, Incline Village, NV 89452, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ef9d291c-932e-11ea-8162-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "walk",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15123682057624681031",
  "source": "GoogleMaps",
  "reviews": [
   "Sand Harbor is one of the greatest places at Tahoe. The beach is great in the summer. My kids love exploring and playing on the huge rocks. It's pretty slammed most summer days, so you'll need to get there early to get a parking spot. It's excellent for an all-day outing. It's a good idea to bring some shade (a canopy or umbrella) and food if you plan on being there a while. Even in the winter this is a great place.",
   "Have to get here early in order to park your vehicle within the park.  If not then a shuttle is offered from incline village to the park.  Has a bar and food in the park with plenty of restrooms.  Has lifeguards and a beautiful trail.  Highly recommend this beach.  Awesome place overall and in my opinion, the best beach in Tahoe.",
   "How do you give a review on something that is naturally so beautiful! I had a great time here and enjoyed its beauty. I highly recommend this spot rather you ride, walk, run or are pushed. Have a great time with family and friends or just a walk with that special someone.\nEnjoy!",
   "Sand harbor is absolutely beautiful! It was my firdt time in Lake Tahoe and this was one of the must see places on our list.  My lady and I climbed the bolders, and took a half dip in the freezing cold water all while enjoying the awesome views of the snow capped mountains bleeding into the wide open glass like water. We also found tons of different types of precious stones in the sand by the water. It was a gorgeous day at Sand Harbor and will definitely be back in the summer!",
   "Small beach, yet beautiful. There is paid parking lot. \n\nI went during December and the parking lot is closed (probably for all winter long). The harbor and beach is still accessible. You can either park at the beach parking lot and walk over or park further away and take the trail to get there."
  ]
 },
 {
  "name": "Stewart Indian School Trail",
  "address": "Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/efe9ac06-932e-11ea-b466-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15911614171986822373",
  "source": "GoogleMaps",
  "reviews": [
   "The trail has an interactive map system. You call a number on your cell. Enter the simple code. And voices of actual former students speak of their experiences when the school was in operation. If you have the time. I'd recommend making this trip.",
   "Lots of history here. While this area is also used for law enforcement training, it also holds a piece of what made Nevada's natives.",
   "They seem to be off to a good start. Quite a bit of reference material, fairly decent timeline display. Informative.",
   "There is a rich history behind this place.  Quaint.  We were there to attend a graduating class from the Police Academy.",
   "Oh a very nice day for a pow wow on fathers day had a very nice time watching the dancing and the Indian tacos where fantastic , I highly recommend you take part in if you never had it well touch you"
  ]
 },
 {
  "name": "Chimney Beach",
  "address": "Carson City, NV 89703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f03f6bfa-932e-11ea-8982-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12012922025489221563",
  "source": "GoogleMaps",
  "reviews": [
   "Chimney is seriously one of the best places on Tahoe, although in recent years it's become quite popular. I guess the word's gotten out?  The trailhead is relatively hard to spot so really keep an eye out on the west side of 28 about a mile from the Carson City/Washoe line.  If you see the parking lot to Marlette Lake on the right, just look across the highway to a very faint trail leading into the woods. \n\nThere's a reason why the Nevada shore is SO  much better than California's bawdy, built-up, touristy side. Most of the Nevada shoreline of Lake Tahoe is maintained as a wild, wilderness setting with only hike-in access to the water ... and that's exactly what you get here.  It's about a half-hour walk from the highway through deep woods to the beach so if you're carrying a floaty device it could take a bit.  My advice is to get here mid-week because on summer weekends it is impossible to find a spot on the beach and parking on the highway is spotty. Nevada troopers will leave a ticket on your windshield at certain spota. Five stars ... even with the all the skin on the beach. (Yes it is technically a nude beach.)",
   "This beach is lovely!  It's a bit of a walk down the hill from the parking lot and parking can get really packed so go early or be prepared to find parking on the street.  But it's totally worth it.",
   "Crystal clear waters are great for swimming, diving, and kayaking. Gets very crowded so be there early. There is limited parking and a hike down to the beach so don't carry a lot of things because it will be very exhausting on the way back up. One of the best beaches in Tahoe!",
   "Totally missed the chimney, but I saw everything else! An amazing beachfront that undoubtedly gets busy on the weekends. I went midweek during the summer, and the crowds weren't that bad.",
   "A Hidden Gem don't go to the place its  only for me and my husband..lol I'm just kidding this is a beautiful place if it's worth the half a mile walk down to it in the half-mile back up once you get there at the breathtaking with the cleanest water in the most beautiful rocks to perch on like a mermaid ..🐼🐼🐰🐇"
  ]
 },
 {
  "name": "Jackpot Crossing Casino",
  "address": "1897 N Edmonds Dr, Carson City, NV 89701, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0a84bfa-932e-11ea-a702-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=6223597863481393933",
  "source": "GoogleMaps",
  "reviews": [
   "Small locals casino in Carson City. The staff was very friendly, ready to help when needed. This is a slot games only casino. However, it has a limited variety of games. Fun, comfortable and nice experience overall.",
   "Fun place with friendly staff. Not to crowded",
   "No gueno they don't given nothing",
   "It is small but I have walked away ahead each time I've gone there! Friendly staff, great place I don't think there is a restaurant, drinks are free, no table games but a variety of slot games, of course they only use paper $$, I miss putting my coins in and cashing out and getting coins, those were the good times! Oh well give it s try  and GOOD LUCK!",
   "The employees always remember me right down to the janitor, they say hello and make it a point to do so with all their customers.  You'll get a decent cocktail or you can serve yourself non alcoholic beverages when you get thirsty without waiting an hour for a waitress.  Love it!"
  ]
 },
 {
  "name": "Comstock Casino",
  "address": "3680 Goni Rd # 1, Carson City, NV 89706, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f0e48c74-932e-11ea-8c43-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12810658551618889251",
  "source": "GoogleMaps",
  "reviews": [
   "Great food! Perfect service as well. Food is always hot and accurate to your order. Whenever my coworker and I are in the part of town.  We make sure to take a lunch break just to go to this spot!",
   "Fun place and good food. I appreciate that the fountain machine is self severing or you can have someone get you a drink.",
   "After moving to Carson City back in September, I received a \"Welcome to the Neighborhood\" flyer offering freeplay from Comstock Casino.  So I thought I would check it out, and I'm glad I did. Comstock is a quaint Casino, with an extremely helpful and friendly staff. Also, try the food. Really good.  I will return.",
   "Comstock is local fabn favorite with a well earned reputation of quality gaming",
   "Want, has the most awesome, Mexican restaurant. The fur kids we're sleeping past bed Time. 🐕🐕🐕"
  ]
 },
 {
  "name": "Riverview Park",
  "address": "600 Marsh Rd, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f12d0a2c-932e-11ea-bb2f-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13269597506991870083",
  "source": "GoogleMaps",
  "reviews": [
   "Love the trail system. You can also take the extension toward Silver Saddle Ranch that meanders behind the houses on Carson River Road, roughly parallel to Mexican Ditch. You can then hike all the way to Mexican Dam. I also love the river access and am looking forward to the restoration of the Empire extension of the trail from Riverview Park, which is closed as of this writing. Be aware of the possibility of coyotes. You may also see woodpeckers, ducks, geese, osprey and other raptors and even cows.",
   "Great easy dirt trails barely any inclines. Great views and access to Carson River.",
   "Great walking trails and views.  The trails link in with other trails to give you even more areas to walk.",
   "Beautiful river scenery, peaceful setting..",
   "Love the trail and river access, but the dogs picked up lots of goat heads in their paws."
  ]
 },
 {
  "name": "Memorial Point Scenic Overlook",
  "address": "Tahoe Blvd, New Washoe City, NV 89704, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f17d4566-932e-11ea-9723-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4503440654564397122",
  "source": "GoogleMaps",
  "reviews": [
   "A breath-taking place to be. A must - stop to just sit on these rocks and enjoy the beauty of lake Tahoe. There is a hiking trail that goes a little way up around the lake (it's not that far, but prob a good 20min stroll, relax and enjoy the slow pace life!), sunbake on the huge rocks. A great place for kids to stretch their legs and scramble over mother nature.",
   "Beautiful scenery but very crowded. There are spots along the trial that are just as lovely but peaceful.",
   "Beautiful place to take an easy walk",
   "Extremely scenic and beautiful. There is a trail across which you can walk and enjoy the scenic view. The parking here is valid for 20 mins only.\nDefinitely a must visit.",
   "This is one of the many things about Lake Tahoe that has convinced me that I need to spend more time up there. This overlook is attached to a paved trail on the lake that can be accessed through several overlooks and bus stops."
  ]
 },
 {
  "name": "Korean War Veterans Memorial Park",
  "address": "600 Marsh Rd, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f1d046a6-932e-11ea-aa58-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=6376709480748589074",
  "source": "GoogleMaps",
  "reviews": [
   "Great trail for walking dogs n taking kids. Took our running stroller had no problems. Scenic n goes along river half way thru.",
   "My dog loves it here, everyone is always nice and so are their dogs. Only have to watch for ticks in the summer",
   "It is a wonderful walk.  Today was very windy though",
   "Such a nice walk down to the river. I like to take my four-year-old son down here with his bicycle and sometimes the RC boat. Very nice flat walk great for disabled folks like myself",
   "Great shaded parking, trail head for hiking and biking the area."
  ]
 },
 {
  "name": "Sonoma Park",
  "address": "1003 Sonoma St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f21e5362-932e-11ea-9610-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=7290076282716849421",
  "source": "GoogleMaps",
  "reviews": [
   "My dog loves this place. Buddy loves to play with all the dogs every time we go. Definitely recommend this park to dog owners.",
   "Sonoma Park is a delightful little neighborhood park, with a large, fenced dog park, and a smaller, but fully adequate fenced playground. The children's water fountain doesn't work (as of July 2019), but the dog waterer works great. The benches could use sanding and painting. The restroom is a port-a-potty. Bring your own water and something to sit on. Otherwise this is a wonderful little park to bring children to.",
   "This dog park is nice and my dogs love it. \nIt's more for bigger dog's than smaller dogs. But all dog's are welcome. 💕",
   "Perhaps the biggest dog park in the country?  In addition there's a nice playground and enough not-dog-park to play catch and kick a ball around.  A few nice shade trees and everything there is well-manicured and in good repair.  A great neighborhood park.",
   "Beautiful park.  Huge.  Lots of wide open green grass for running and playing.  Bring your own water, they shut off the fountain until Spring so that the pipes wouldn't freeze.  All fenced in.  Nice people.  Nice dogs."
  ]
 },
 {
  "name": "Spooner Lake - Lake Tahoe Nevada State Park",
  "address": "Carson City, NV 89703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2676a90-932e-11ea-a21b-14b31f159f22.png",
  "tags": [
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=1334825874522648247",
  "source": "GoogleMaps",
  "reviews": [
   "Took the Lake Loop in January. The trail was a great 2.1 mile hike over easy terrain. We had a snowball fight along the way and enjoyed beautiful scenery. This is a must-see place!",
   "Isolated lake is fabulous! Well off the beaten track. Escape for some solitude and earn your views. Gorgeous location and a must see",
   "Perfect place for a winter hike and snowball fight.",
   "Hiked the trail around the lake with snowshoes. Beautiful, peaceful, loved it.",
   "Beautiful starting point for cross country skiing"
  ]
 },
 {
  "name": "Whale Beach",
  "address": "Carson City, NV 89703, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f2c2f83a-932e-11ea-a32f-14b31f159f22.png",
  "tags": [
   "hike",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2783966420737489034",
  "source": "GoogleMaps",
  "reviews": [
   "Great little hike, about 3.5 miles in and out.",
   "Cute beach tucked away and quieter than the other beaches along this side of the lake. It’s a bit harder to get to, but worth it if you’re looking for a more secluded beach.",
   "Great place to see the beauty of lake Tahoe, great spot for swimming too",
   "Hand down the best beach with so much to explore.",
   "Beautiful. I can't wait to bring my family and enjoy the beauty of nature. Water was extremely cold but so worth the experience."
  ]
 },
 {
  "name": "John Mankins Park",
  "address": "Carson City, NV 89703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3247980-932e-11ea-810c-14b31f159f22.png",
  "tags": [
   "kids",
   "field",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12371458064705777448",
  "source": "GoogleMaps",
  "reviews": [
   "Love taking our grandson to this park. It is well maintained, has very nice play equipment and there are ducks, geese and sea gulls to feed. If you go, and have a child, the firefighters at the fire station next door are often caring for their equipment so be sure and go by with your kids....they love showing off their trucks and equipment to kids.",
   "This is a really nice park, good skate park, good playground equipment, baseball, basketball, tennis, huge grass field, long-ish sidewalk path great for teaching my kids to skate.  Very clean, good crowd.  Parking is hit and miss.  It's on a road that must be a popular cut through, because cars fly through there all day",
   "Had a fun time. Equipment is in great shape.",
   "We have a big family and when we want to get together on a nice day or have a party outside, we like to go to this nice little park. We have even enjoyed a movie there in the grass before which was really nice with some of our grandbabies. Some of the things it has is a nice play area with swings and climbing things, a great pavilion which you do not need to make any type of reservation for, basketball court and even a skate park. Lots to do in not a huge area and not as crowded as the larger park in town is.",
   "Great park with open spaces and a great equipment play area."
  ]
 },
 {
  "name": "Carson River Park",
  "address": "5013 Carson River Rd, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3777866-932e-11ea-9edd-14b31f159f22.png",
  "tags": [
   "hike",
   "walk",
   "kids",
   "walk",
   "kids",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5507280267082708571",
  "source": "GoogleMaps",
  "reviews": [
   "Nice open space, not a play park but lots of space and a nice picnic area.  Good place to start a decent hike to Mexican Dam",
   "Great place to have a calm relaxing walk following the river. There are picnic tables and an area that would be good for small gatherings like a wedding ceremony. Take your dogs, kids and a lunch; this is a great day spot.",
   "This park has a good parking area, restroom, picnic table and hiking trails. The walk to the old Mexican Dam is about 45 minutes to 1 hour, one way, on easy trails, with no elevation change.",
   "Love this place perfect for the kids if you look hard enough you'll find a slow-moving part of the river at the beginning of the road off to your right that has a  area for the kids to play in and a Sandy Beach type area perfect for bringing out the ATVs dirt bikes good relax family environment.",
   "Love sitting  by the water. . . Walking the trails and seeing the eagles. .  Beautiful!!"
  ]
 },
 {
  "name": "Eagle Valley Golf Course",
  "address": "3999 Centennial Park Dr, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f3c2001a-932e-11ea-87b5-14b31f159f22.png",
  "tags": [
   "cheap",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=15347978190858993432",
  "source": "GoogleMaps",
  "reviews": [
   "Great, walkable course for the money, with picturesque views of the Sierra Nevada. I've played it a number of times, most recently in October 2019, and the greens and fairways were in great shape, especially for the affordable price. IF the wind isn't blowing, this is one of the easier courses you can play, and one of the only coursed I've finished 18 holes without losing a ball. However, the wind blows nearly every afternoon, which is the course's main defense. But it's worth playing in the afternoon for the cheap rates, the relatively open course, and the magnificent sunsets behind the High Sierra.",
   "Nice course, challenging at times with the brush lining the sides of the fairways.  Still plenty of room for us hackers to find those good shots. So close to getting my first Eagle on one of the par 4's, I did make the Birdie putt. ",
   "With this weather condition, the course is really good condition and the best part of it.. we had fun!",
   "Very nice course with beautiful views.",
   "A wonderful local golf course and club facility. I don't golf, ( but enjoy driving the cart ). We attended a retirement part there and the faculty was great for this and the views were, of course, incredible!"
  ]
 },
 {
  "name": "Bodines Casino",
  "address": "5650 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f40bf15e-932e-11ea-bc92-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15857423070117231275",
  "source": "GoogleMaps",
  "reviews": [
   "Good Food & Value! , Nice Sports Bar & Lots of Tvs",
   "BEST FOOD CAUSE THE COOK AND STAFF ARE THE BEST. You have to go here and eat. Love your food, I eat here as much as I can.  Prim rib is to die for. I'll be back next week, I plan to save room for dessert, make something great please. All your restaurant staff and especially your cooks deserve something special for being so nice making us feel like we're the only people that they have to take care of and cook for.  Thank you and thank them for me.  Know that you hired an awesome staff. Bathrooms are clean the casino is very clean.  Everyone in the casino was having fun and winning.  I would recommend you come here to eat, drink and play slots.  You'll love it",
   "Waited an hour and a half to get our food. Had to ask for coffee 3 different times because they kept forgetting. Waitress told us they were going to comp all of our food and ended up getting half of it off. Happy for the discount, but it absolutely was not worth the experience. In general was really disappointed in the service.",
   "Small friendly place.  Good food, good selection of gaming.  I like to stop here going to or coming from Reno to home",
   "Such a gem. Small. Cozy. Friendly staff, good food. Not a flashy high roller casino."
  ]
 },
 {
  "name": "Virginia & Truckee Railroad Company",
  "address": "166 F St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f4539606-932e-11ea-a8e4-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "kids",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=955784326727008547",
  "source": "GoogleMaps",
  "reviews": [
   "The history was explained by the great conductor with delightful clear diction. He had a wonderful since of humor. It was a little cold but was great fun too. We loved it.",
   "We came here for the day out with Thomas the train event. It was really fun and they had lots for the kids to do. Face paint, mini golf. The train itself was really cool. They also do a Christmas train that looks like fun. The ride was interesting and just the perfect amount of time for the littles to enjoy but not get bored.",
   "The kids loved it. Bring a jacket when it’s cool out. The train cars are open-air.",
   "Everything was perfect. The ride the cars. Views of mines and gold depot station. Tunnels as well. The people of V&T made the trip most of all kind courteous  and the Trip was narrated by a very knowledgeable man. The period dress also made it great. This is a must do. Trip ends in Virginia City. About an hour and a half wish we had more time for poking around there. Trip back down was great as well.",
   "Fun ride and runs past my house all day in summer!"
  ]
 },
 {
  "name": "Bowers Mansion",
  "address": "4005 Bowers Mansion Rd, New Washoe City, NV 89704, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f4cc9ee2-932e-11ea-9646-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "family",
   "history",
   "tour",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11628376563291242506",
  "source": "GoogleMaps",
  "reviews": [
   "This is fun place to bring your family. The tour of Bowers Mansion is fun (there is a cash fee). The guide is quirky and full of knowledge. Not only can you learn about history from the museum, you can absorb it by soaking up the sun, with a bbq on the park, or a swim in the pool (there is a pool fee). -Regina",
   "One of our favorite places to visit in the Reno/Carson City area. They're always adding to the property. Be prepared to have cash on you if you're doing the tour. The headstones for the Bower's are up a steep hill so be prepared to get a good workout if you choose to do so (that part is optional). The tour guide is great. Very beautiful property.",
   "Always a nice, chill day at the mansion.",
   "Great tour guide, loved her. It's a great place to spend a few hours on the weekend.",
   "Very good tour guide but all of the furniture was donated by locals, it is not original to the mansion. Also the mansion is not original as the upper floor was removed. Interesting history and very beautiful location."
  ]
 },
 {
  "name": "Thunderbird Lodge and Yacht Lake Tahoe",
  "address": "5000 NV-28, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f514b0e6-932e-11ea-81ad-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "walk",
   "history",
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=6835626215159423044",
  "source": "GoogleMaps",
  "reviews": [
   "I loved this tour! I came to Tahoe for fun and sun, and the tour of Thunderbird Lodge was a happy unplanned day trip. The history of the region was fantastic and helped me understand the development of the Nevada side of the lake, and I highly recommend this for families or casual visitors of any sort!  Fascinating!",
   "A must see! It’s definitely entertaining to hear about this man’s life story. You won’t believe what he and his pet cat used to do in his car around San Francisco. Go see this place for yourself and experience the beauty around this lodge. A place I’d visit over and over.",
   "We celebrated our 65th birthdays with a group of long time friends. What a fabulous day and experience!!  Great walk through the lodge with an interesting history of why it was built, by whom, and things that occurred there. This was followed by an over the top ride and luncheon on the Thunderbird. Can't express more than it was beyond one of best moments we shared together.",
   "Undiscovered gem. Tour totally worth every penny .",
   "One of the most beautiful historic sites in our nation."
  ]
 },
 {
  "name": "Slot World Casino",
  "address": "3879 US-50 E, Carson City, NV 89701, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f56a997e-932e-11ea-915d-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5068009081096488343",
  "source": "GoogleMaps",
  "reviews": [
   "Environment is nice, one staff member very patriotic dressed, cruising around on his mobile machine, and talked to my Veteran dad like he was a movie star. Much appreciated.  Food is great, we eat there often.",
   "We went to their restaurant for the special. It was average but the service was great.",
   "I love going here. They recognize the people I usually go with and the cocktail servers are always on top of it. This is one of my go to gambling places.",
   "I haven't made a bad choice yet from breakfast to dinner I'm always pleased with my food and service at Betsy's ",
   "I am not an habitual gambler, but I do enjoy the restaurant. Good, tasty food. Good and friendly table service."
  ]
 },
 {
  "name": "Historic Stateline Fire Lookout",
  "address": "Kings Beach, CA 96143, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f5c6bd8a-932e-11ea-b7d0-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "family",
   "walk",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4508940622384422705",
  "source": "GoogleMaps",
  "reviews": [
   "Great views of the whole lake. Easy 1.5 mile trail to hike. The beginning is very steep grade but it levels out on top. Easy parking at the trail head. This was first time there and would come back again for the views. There are picnic spots and benches to take a rest.",
   "Beautiful hike. We did it up and back in about 45 minutes. Amazing views and would be suitable for a family. It gets a little steep, but since it is less than a mile one way it wasn’t a problem for anyone in our group. Went at 7 pm and had the trail to ourselves.",
   "Steep walk if you aren't used to inclines. Beautiful views at the top. Good spots for a picnic. No restrooms. No signs at the trailhead, parked on the side of the road with everyone else and walked up the barricaded road.",
   "Fantastic view and a relatively easy walk to the top. Look it up in advance and the start of the trail isn't signposted from the main road so you will be slightly unsure where you're going without maps.",
   "Nice paved walk upto scenic lookout of Lake Tahoe. Easy walk with good vertical climb to get the heart going."
  ]
 },
 {
  "name": "The Kit Carson Trail (Walking Tour)",
  "address": "Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f60dcede-932e-11ea-9dad-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=2952243188248178469",
  "source": "GoogleMaps",
  "reviews": [
   "Established in 1993, the Kit Carson Trail is designated by a painted BLUE LINE and the “Talking Houses” share their ninety-second narratives that provided insight and tales about the capital city and some of its more colorful personalities. You can  listen to sound effects such as horse-drawn carriages, train whistles, and John Wayne’s voice at the Krebs-Peterson house where he made his last movie, “The Shootist,” in 1976. The route also passed the home of Orion Clemens, where his brother Samuel Clemens aka Mark Twain would stay when he was in town. The tour features 60 landmarks along the trail including the former U.S. Post Office, U.S. Mint, Governor’s Mansion, and the Carson Brewing Company, home of Tahoe Beer for more than 100 Years. For a nostalgic walk down the largest historic district in Nevada make tracks for the vivid BLUE LINE that will guide your way along the 2.5-mile path of Carson City’s legacy to discover the Wild West!",
   "Beautiful!",
   "Unfriendly owner",
   ""
  ]
 },
 {
  "name": "Lake Tahoe Nevada State Park",
  "address": "NV-28, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f65c162e-932e-11ea-9068-14b31f159f22.png",
  "tags": [
   "drink",
   "hike",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3639987926920806451",
  "source": "GoogleMaps",
  "reviews": [
   "First off, let me just say, WOW.. Such an amazing and beautiful body of water. The entire area is so pretty and breathtaking. I was visiting while on a business trip in Carson City and one of the locals i befriended said I HAD to come check out the scenic route around the Lake Tahoe. They were 100% correct, as it was just amazing. The water is so clear, it looks like you could just scoop it up in a cup and drink it. I could easily move out here to enjoy this view and fantastic area every day.",
   "These moments are breathtaking.  The fam bam, the time, and a beautiful place.  The backdrop of Lake Tahoe is magnificent.  The lake is one of a kind.  One of the most beautiful places on earth.",
   "Amazing waterfront location - just come by early to snag parking. Would also recommend checking out their entrance ten min away from the beach. There are picnic tables and walking paths through the woods. A lovely 10mi loop incorporating a section of Tahoe Rim trail and some campgrounds there as well. Hikes includes a hike up a ridge for a magnificent view of entire Tahoe lake.",
   "One of my favorite place to rest and swim",
   "I checked this off my bucket list and let me tell you it was worth it! \nIf you decide to walk the 3 miles trail leading to Sand harbor beach, I can tell you right now, you will not be disappointed. This will be your view during your walk 😊😊. Enjoy it"
  ]
 },
 {
  "name": "Cave Rock - Lake Tahoe Nevada State Park",
  "address": "Hwy 28, Glenbrook, NV 89413, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f6b11d38-932e-11ea-a789-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4050876360329002360",
  "source": "GoogleMaps",
  "reviews": [
   "Scenic overlooks of Lake Tahoe from the Southeast shore. Be careful though! The last part of the hike is for experts only in good physical condition. Lots of big steps AND using your hands for help. If you can make it to the top...your reward is an amazing 360 degree view. Enjoy!",
   "Beautiful 360 degree views once you hike the short trail. There is limited parking near the entrance of the trail, so reach early. There is so much to do around the area, you could easily spend a day on the trails and the nearby beach. If you want to watch a special sunset in the area, this comes highly recommended. Attaching some sunset shots :)",
   "Don't know where to start on this place but to summarize it in the nutshell it is short and very rewarding trail. You don't find trails like this very often it's like a gold nugget of the trail in my experience there's only few in my book trails that offer such reward. To get to the top of the rocks may not be suitable for everybody you will need to climb some rocks so older folks and younger kids might struggle here but you still will enjoy some views even if you don't climb to the top of the rock. My five-year-old daughter had no issues climbing to the top of the rocks obviously supervised. I would not attempt this if the weather is not perfect as the rocks might be slippery especially if it's snowing I would not go there.",
   "Love this place. I come over every time I visit lake Tahoe for some peaceful time by the rocks. Parking fee started recently but it's very reasonable. The scene from here is just amazing 😍",
   "This place is beyond gorgeous! Nature can be so impressive sometimes...\nIt's as enjoyable in winter than in summer!"
  ]
 },
 {
  "name": "Roberts House Museum",
  "address": "1207 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=10195622008029289501",
  "source": "GoogleMaps",
  "reviews": [
   "Small, but what a great history.",
   "Can't really say much about it since it was closed when I went there. What I could see through the windows looked interesting.",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Empire Ranch Golf Course",
  "address": "1875 fairway, Carson City, NV 89701, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f70aaf48-932e-11ea-9458-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1843486188832372927",
  "source": "GoogleMaps",
  "reviews": [
   "Very picturesque with fun wildlife and surrounded by beautiful mountains. Since it is winter season one course was closed due to flooding and disappointingly there are no garbage cans along the course which led to unsightly littering near the bathrooms areas. Inside restrooms were surprisingly neat with space heaters for warmth (much appreciated). Plant life made it almost impossible to find and retrieve balls a foot into traps. Despite all we do look forward to coming back and enjoying the course during peak season.",
   "I love this course,  they are doing a great job revamping it after the flood. Twilight rates for 18 joles with a cart are only 20 bucks per person. Highly recommend",
   "Great course, quick round, reasonable price. Bring some deep woods mosquito repellent there were tons of them we played in the morning. They are making great progress recovering this course still Al long way to go but it looks great. Great job guys keep it up!",
   "Biking / hiking trail between this golf course and the Carson River is a mini-adventure with tall sage, willows and other growth. Saw 9 juvenile vultures and 1 juvenile eagle in a tree together. 2 vulture parents were nearby -- 1 flying and the other watching.",
   "I received an update they are opening a par 3 course. Thank you!"
  ]
 },
 {
  "name": "Ambrose Carson River Natural Area",
  "address": "281-309 N Deer Run Rd, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f74fe43a-932e-11ea-be80-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5790361365308118116",
  "source": "GoogleMaps",
  "reviews": [
   "The waters freezing but it might be fun to fish, saw some deer out on the river.",
   "This is a great place to relax and explore.",
   "I didn't spend much time there so it's hard for me to rate it.",
   "Best Airsoft place ever",
   "Awesome area for photos and or picnic!"
  ]
 },
 {
  "name": "Way It Was Museum",
  "address": "113 C St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7a9cbda-932e-11ea-a171-14b31f159f22.png",
  "tags": [
   "history",
   "kids",
   "history",
   "kids",
   "history",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=17354847788524821963",
  "source": "GoogleMaps",
  "reviews": [
   "This was a nice way to kill a few hours in the afternoon. Most places to see are soliciting you for cocktails while waiting.\n\nVirginia City has tons of history and much is located here.\n\nThere really was a lot of rhyme or reason for sequence of displays. But neat to see stuff that was 100+ years old.\n\nThere seems to be zero public restrooms in all of Virginia City...inclusive of here. Make sure you don't ask and use the restroom prior to admission.\n\nDont take American Express either...",
   "I love Virginia city so much history of the way it was a hard life for people that had gold fever. I think all the kids should come & see true pioneers & the difficult life they had instead of email it was the pony Express.",
   "Lots of interesting exhibits and info. Not great for kids or anyone not really interested in history, but I loved it.",
   "A little run down from it's hey-day. Definitely has great potential but needs an update, much like Virginia City in general. The artifacts are authentic and there is a lot to learn here.",
   "A simple but very intresting museum. Lots of little details to see and ponder over. Historical objects and the stories behind them are plentiful here.  Bonus points for a very talkative and adorable museum cat that sat behind the counter. If I ever get back to Virginia City I will be sure to go again."
  ]
 },
 {
  "name": "Kings Beach State Recreation Area",
  "address": "Bear St, Kings Beach, CA 96143, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f7f24698-932e-11ea-9b55-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=4300431441759070770",
  "source": "GoogleMaps",
  "reviews": [
   "This is sacred land. Home to many good folk. Travelers far and wide can normally find a good spot on this open beach. And in the winter it's a beautiful out look of snow covered sand. It's a must see if you have a bucket list. And a do see if your just passing through.",
   "Great public beach in otherwise very snobby and private north shore. Clean bathrooms, safe and shallow warm water with awesome sand. Costs to park though.",
   "Beautiful place. Clean beach. Sandy. Barely any rubbish around. One toilet out of order.",
   "Perfect place to stop & enjoy a picnic lunch while driving around the lake. We were here the 2nd week of September- the weather was gorgeous with daytime temperatures just hitting 70. The recreational areas are clean, have plenty of parking (especially off season) clean restrooms and the beaches were just lovely.",
   "Beautiful little beach on North Lake Tahoe.  I've never been to Lake Tahoe before, but was surprised to find a Sandy Beach -- I was expecting rocks!  Super clean, nice facilities (parking, bathrooms, playground, basketball court, benches, picnic tables), crystal clear water, gorgeous views and right in the center of a charming town.  Great way to relax after a morning filled with hiking!"
  ]
 },
 {
  "name": "Mackay Mansion Museum",
  "address": "291 S D St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f852d4d4-932e-11ea-bad6-14b31f159f22.png",
  "tags": [
   "tour",
   "knowledgeable",
   "tour",
   "tour",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=196841637836150432",
  "source": "GoogleMaps",
  "reviews": [
   "My sister and I came to Virginia City on a last minute whim and I can’t say enough about our Experience.  Our tour guide Dawn was so gracious and gave us an option to do an after hours paranormal tour.  It definitely did not disappoint!!  The mansion was beautifully preserved and we received a lot of paranormal activity.  The Mackay Mansion is truly haunted and I would highly recommend the tour 😊",
   "Great tour today with Katie!  She was extremely knowledgeable.  My daughter and I enjoy the paranormal and have participated in many tours.  This was the first time we had an experience. She actually heard a voice.  Would love to do a night tour of this very haunted house.",
   "This place is amazing! Had a super fun tour there today. Check it out if you're in town",
   "Loved every moment in this great place. It's spooky and filled with a ton of history. The tour guide was great! He allowed us to do a mini paranormal investigation upstairs. He was very kind and told us everything about the mansion.",
   "The historical aspect of it makes it worth it. But be careful going down the stairs, they are steep. Makes me wonder how women didn't fall to their death with their heels, dresses n corsets on. If you like history I recommend it."
  ]
 },
 {
  "name": "Mt. Rose Ski Tahoe",
  "address": "22222 Mt Rose Hwy, Reno, NV 89511, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8b4e1d8-932e-11ea-875f-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2023929387310150557",
  "source": "GoogleMaps",
  "reviews": [
   "We got there early. Just as they opened. The place is beautiful and well set up. We wanted to sit in the bar to watch the game but the bartender Brian told us they don’t open until 10. Turns out they opened at 9:30 so he lied. Later we were trying to order drinks and I asked for a cherry coke and he told me to go to the cafe. A nicer bartender interjected and offered to pour a coke with grenadine which was perfect but I could tell Brian wasn’t pleased. If you all get rid of this guy you’d have a perfect 10 staff. Everyone (else) was very helpful and so friendly. My son loved the snowboarding and this being our first visit, we had a wonderful time. We’ll be back. Just not looking forward to this Brian guy. Ugh!",
   "It has been a few years since we went here.   They used to be pretty good, they have made huge progress towards great.  Fast/ excellent lifts to fairly advanced terrain, magic carpet for beginners.  Great for all skill levels.  Lift staff is clearly kept in line, polite, helpful.  We had a kid lose a ticket, no problem.  \nA fabulous spot, we need to go back.",
   "A friend told me that this was a family friendly place, perfect for first time kids.  It was perfect!  First, the price can't be beat.   I paid for 1st time lessons for 3 kids. They got a 2 hour lesson plus the snowboard and the boots. The first place I was going to take them was very expensive compared to here. In fact, I would have paid the same amount for one lesson at the other location that I paid for all 3 lessons at Mount Rose. Second,  Even though we ran late because of traffic, the staff was so pleasant, courteous, and professional. They took care of the kids and made sure that everything fit and that they had everything in place before the lesson started. And during lesson they were very patient and positive and supportive. Third, I could sit on the deck, in the sun, taking photos and videos of the kids  As they took their lessons cama road up the Hill for the 1st time, and then came down the Hill. Facilities are older and need TLC.  I would give it 5 stars but the bathrooms were filthy and interior was dark and run down.   The kid's got dressed in the car because there were no facilities for them to change and put away their clothes inside the lodge.  I would definitely recommend Mt. Rose without hesitation, and I know we will be going back.",
   "I've lived in Reno for almost 3 years but hadn't boarded at Mt. Rose yet until today. I had an absolute blast there today! The snow was great and the variety of runs kept things interesting. I felt like their 6 person lifts ran really quickly, enabling more riding time. I will highly consider getting a season pass here next year, as it only takes about 40 min to get there from the north side of town and the parking situation there is excellent, especially if you park at the bottom of the Slide Side.",
   "Haven't been skiing in years & it was my daughter's first time. Matt gave us our lesson. He was awesome (as were most all the employees we encountered). We had a blast, even this late in the season. The weather was beautiful & it was not crowded at all (Thursday). Will go again!!"
  ]
 },
 {
  "name": "Fourth Ward School Museum",
  "address": "537 S C St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f8ff59cc-932e-11ea-b4a4-14b31f159f22.png",
  "tags": [
   "history",
   "unique",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=748710712589555491",
  "source": "GoogleMaps",
  "reviews": [
   "Really cool place I built the Elevator Shaft",
   "My husband and I visited this beautiful historical school this weekend. We were amazed with all the beautiful original antics we saw. Everything is set up nicely with posted history and stories to read along the way. Well worth the visit. We will stop by again next time we are in the area.",
   "It was a great experience. The history behind the school from begin to present is just so unique.  Also had exhibits of interesting parts of the town. Mines, old switchboard, printing press, dress shop...etc. I think my husband and I spent an hour or so here, exploring all the rooms available to even the writing on the walls.",
   "Wonderful history of the school and of the town.  Being from Missouri was also interested in the Mark Twain (Samuel Clemmons) room.  Beautiful school and very nicely restored.",
   "This was an Interesting place with a lot of history in this old school."
  ]
 },
 {
  "name": "Incline Village Crystal Bay Visitors Bureau",
  "address": "969 Tahoe Blvd, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f940d82e-932e-11ea-89f5-14b31f159f22.png",
  "tags": [
   "pets",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=8618845264236819044",
  "source": "GoogleMaps",
  "reviews": [
   "Very informative visitors center and gift shop. Plenty of help with local hikes and things to do as well as locally made items for sale. It happens to be very close to the rec center. After 3pm you're able to play disc golf (holes 3-9) from the parking lot. There is also a small bbq area with benches. Pets are welcome as long as they're leashed.",
   "This place is a nice little stop when touring around Lake Tahoe. It could use a little help with the gift shop as their t-shirts aren't very cute and they could definitely have more of a jewelry selection and more fun stuff overall. Water is available to refill water bottles.",
   "Short visit, obtained visitor literature from a very knowledgeable warm friendly employee. Abundant amount of literature for, what I perceived to be everything to do in this area. Visitor center very helpful with both information and kindness. She even came out to meet the pups.",
   "Very helpful tips shared by the shop lady. She recommended that we take the visitor shuttle into Sand Harbor to a void any delayed parking wait. They have great mugs, postcards, shirts and mugs..pretty much everything you'd find at a visitor center.",
   "Very helpful people work there. We were waiting there for a shuttle for Thunderbird estate and the place is beautiful."
  ]
 },
 {
  "name": "Washoe Club Museum & Saloon",
  "address": "112 S C St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f9aa488c-932e-11ea-9ee5-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "tour",
   "history",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13261538877624876642",
  "source": "GoogleMaps",
  "reviews": [
   "Really heartfelt tour led by people who actively care and work for The Washoe Club. Made it all the more creepy and I even got to have a weird encounter myself. The tour guide had a lot of neat inside stories and photos from past tours and just working there in general. If you only have time for one tour, this is definitely the one you should visit.",
   "Visited here 3 yrs ago and took in the whole little city. Also decided to participate in the ‘Ghost Tour’ that was offered. It was a crazy experience. I used my phone to capture EVPs and had a few experiences that validated others findings. Upstairs, in the room with the long mirror made from Diamond Dust, I was over looking into the mirror, while the rest of the tour group was learning about different things. I remember feeling like someone was behind me and after later going through my audio footage, I caught the sound of faint cowboy boots with spurs clinking, eventually grow louder and stopping next to me. I’ve also caught poker chips clinking, as well as voices interacting. Quite the experience. Loved it. Would definitely recommend and like to go again.",
   "Super cool place to go to in Virginia City. It's jam packed with history! The staff here are great and the tour is very spooky. Obviously famous for being on the show Ghost Adventures, but whether you are here form the haunts or for the history, it is a great place to visit.",
   "We love this place.  I used to live in Virginia city and hang out here. And those ghost stories are real!!! Its ghost adventure heaven.  The back room where the crypt is will raise the hair on the most jaded head. And in the ladies room I swear I heard a lady humming but when I came out I was all on my onesie.  And the tour is off the chain. We heard lots of unexplained foot steps. You never knew what or who the washoe will come alive for",
   "My sister and I came to Virginia City for a spontaneous weekend trip and thoroughly enjoyed our haunted Washoe tour with Halen.  It was very informative, spooky and he added a sense of humor that made it fun as well.  I highly recommend it!!"
  ]
 },
 {
  "name": "Emerald Bay State Park",
  "address": "138 Emerald Bay Rd, South Lake Tahoe, CA 96150, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/f9f60318-932e-11ea-81d9-14b31f159f22.png",
  "tags": [
   "hike",
   "family",
   "walk",
   "hike",
   "wander",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7550396856752516048",
  "source": "GoogleMaps",
  "reviews": [
   "The family really had fun coming here. Picturesque view of the lake from top and a little island in the middle of the lake. Decent parking but I guess its gets full easily. You have to hike down to take a closer look of the lake and the sandy beach below (picture). So, you have some good exercise from hiking and all the natural wonders you get to see. What else can you ask for.",
   "So beautiful. Love the views. You can get down on the island, on the beach, camp there, or just look from above with one of their many looking places. Very relaxing. Come here if you're coming to Tahoe. Defiantly worth the drive!",
   "Wonderful view of Lake Tahoe and Emerald Bay. Great for all kinds of nature photo shoots. Road going there is a little narrow, ... you have to drive slowly around the bends and going up there, but it's well worth the effort. Fresh mountain air all around and it can get busy there even if the weather is colder or not so nice with the usual blue skies and sunshine. Parking was around $10 (for the whole day I think, and it's self-serve at a kiosk) but there's no other fee to hike and wander around the area. Make sure you bring a drinking water bottle and good shoes to walk around the rocks, trails, etc.",
   "Although it is difficult to distinguish, Emerald Bay and its surroundings including Cascade Lake and Falls are the most scenic and popular part of Lake Tahoe preferred for trekking and camping. An unforgettable part of the world which was inscribed to my brain as a global trotter. Would like to go and trek again...",
   "Gorgeous! So glad we went. We spent about an hour plus hours walking here. Very special. We got a tip to go early. That was helpful! We arrived before 9:00 on a Saturday in mid September. We were able to park. When we left, cars were circling"
  ]
 },
 {
  "name": "Diamond Peak Ski Resort",
  "address": "1210 Ski Way, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa46bda8-932e-11ea-89ee-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "family",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=8390416013163737751",
  "source": "GoogleMaps",
  "reviews": [
   "Went here for my first snowboarding lesson with Pete and he was great. Please  ignore the website that says come an 1hr before your class. If it is during peak season and on a weekend you're going to need more like 2hrs, that is if you are getting rentals because the lines where crazy long and they even ran out of rentals by noon. Other than that it was a good time. Staff was friendly and helpful.",
   "If you've ever been to Lake Tahoe and you love skiing this is the place for you. They have a great learning program for kids and adults. Some of the slopes give you a breathtaking view of the high mountains and the enormous lake. Me being one, I really recommend this place for tourists.",
   "The ski school was horrible.  Very unorganized.  The person in charge of ski school was rude.  Booked my daughter for an afternoon lesson, the class started.  They told us to check her in to another class by going back into the building to re-do the check out process after we've already done it.  It's hard to walk back there, slippery and having to carry all her ski equipment that we rented.  The person in charge was not accommodating.  The instructors were pretty nice.  I had Larry for a class next day, he was good.  My daughter had Bobby G for full day class the next day and liked him.  But I would not recommend this place.",
   "Our family used to love Diamond Peak - small, affordable, generally not crowded, and easy to navigate. However, they have ruined everything by making 2 of my family's favorite runs into jumps, so we end up doing the same run over and over again - boring and crowded. Not sure we will come back. Please bring back the runs we all loved so much for some variety. Thank you",
   "My friends and I love this place!! We are all different level skiers, ranging from green to black, so this ski resort was perfect for everyone! The lodge was not too crowded on the day we went, so after we skied, we all hung out in the lounge and had fun by the fire. Coming here again for more winter retreats!"
  ]
 },
 {
  "name": "Lake Tahoe Cruises",
  "address": "760 US-50, Zephyr Cove, NV 89488, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fa961640-932e-11ea-bea6-14b31f159f22.png",
  "tags": [
   "food",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13867142286799579212",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I absolutely loved this cruise. Totally worth the cost and would recommend to others. \nI would go when the weather is nice. It gets really cold there especially if the wind is blowing on you. There are a couple things that could be improved upon. One of the speakers on the deck was really distorted sounding. It should be replaced if it hasn’t been already. The TV/video monitors that were playing a documentary about Lake Tahoe need to be updated. The quality was bad but the documentary was fascinating. \nWe went for the cruise and it didn’t disappoint.\nThe big paddle wheel was super cool too.",
   "Took my daughter on her first miss Dixie cruise. She loved it. Lunch on board was great. Highly recommend",
   "Lots of fun and beautiful cruise itinerary across the lake to Emerald Bay.  We did the 3 hour dinner cruise. The food was okay, beer and wine inexpensive, mixed drinks ten bucks. The band was enjoyable.  A wonderful way to see the lake!",
   "A great cruise that took 2.5 hours. Excellent landscapes. It covers the southern part of the lake and it is worth to try it",
   "Great views. No rocking on the boat which was wonderful! The sunset cruise was great. Food was pretty good. I had a salad, diner rolls, salmon with mixed vegetables, and cheesecake with strawberry drizzle. I’d rate the food a 4/5. I’d do the cruise again as it was comfortable And having the food was an added plus. I wish the speakers outside were a bit louder as it was hard to hear the history of Vikingsholm with all the people on deck. Alcohol is served."
  ]
 },
 {
  "name": "Lake Tahoe - East Shore Forest",
  "address": "Carson City, CA 90745, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fadd58b8-932e-11ea-bde0-14b31f159f22.png",
  "tags": [
   "drink"
  ],
  "link": "https://maps.google.com/?cid=10694247656354800877",
  "source": "GoogleMaps",
  "reviews": [
   "Very breath taking when you get close to the lake",
   "A must visit nd stay atleast for a night",
   "Stunning views of lake Tahoe along a beautiful man-made walkway.",
   "Worse than the first time I saw it in 1960. You could drink water right from the lake then. Every thing was cleaner then, not contaminated and spoiled like it is now. Money ruins all naturally beautiful things.",
   "It's like Tahoe! It doesn't get any better"
  ]
 },
 {
  "name": "Chollar Mine Tour",
  "address": "615 F St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb2aa9c6-932e-11ea-986c-14b31f159f22.png",
  "tags": [
   "unique",
   "tour",
   "knowledgeable",
   "tour",
   "kids",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=3038649544529571491",
  "source": "GoogleMaps",
  "reviews": [
   "Pretty cool place. You can go into the mine for about 500 feet or so, and the guide will talk about how things worked back in the day. Virginia City is a cool place to visit, as it was once the richest town in the world, due to the gold, silver and copper mines there.",
   "Brilliant tour! Slightly out of the way, but worth the visit. Our guide was hugely knowledgeable and clearly interested in the subject as well as keen to answer the many questions I had. The mine itself was authentic, a genuine experience which was fascinating as well as unique. Never been in a 19th century mine before, probably never will be again, but now I can say that I have. You won't be dissapointed.",
   "First off I will say this is a great tour, I've done it 2 times now. Once when my kids were a little younger and just recently and it doesn't disappoint. The guide is very nice and informative. Whenever you are in Virginia city this tour is a must.",
   "A place of history and culture that once thrived on gold & silver take a trip into the past, jump aboard the time machine and create some unique memories",
   "It was a delightful step back in time, John Tyson was exceptional as a guide & a crack up."
  ]
 },
 {
  "name": "Commons Beach",
  "address": "400 N Lake Blvd, Tahoe City, CA 96145, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fb829130-932e-11ea-8705-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "kids",
   "free",
   "kids",
   "family",
   "kids",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=14996776149526475790",
  "source": "GoogleMaps",
  "reviews": [
   "A really great park tucked away on the N shore. Just a quick walk along the boardwalk takes you to a public pier.",
   "The beach is not a far walk from parking (on street or small designated areas). Definitely doable with kids. So many pretty sights.  The playground and restrooms are clean and well maintained.  When we were there they had free concerts going on. We will definitely return when in Lake Tahoe.",
   "We stopped by in between ski trips on a sunny and 50 degree day.  Breathtaking view and a nice playground made for happy kids and parents alike.",
   "Really great place to spend the time with the family. There are playground for children, the beach is so quiet to swimming and to play with surfboards, and a little trail for bikes and pedestrians. Very close there is a small pier where you can swimming as well. Highly recommended when you're travelling to Tahoe!",
   "I don't think so, I liked a place more than this in Tahoe city. It's a beach so it's free and I can spend hours here just laying or walking around it. It offers a great view and one of the most cleanest beach that I have been so far. Kids friendly but I don't remember seeing any dogs though. 2 mins away from the beach, they organize Farmer's market every Thursday, which is an added bonus. Not very crowded, you would only see families and very safe vibe. For instance, I left my stuff unattended and found it exactly where I left."
  ]
 },
 {
  "name": "Silver Terrace Cemetery",
  "address": "381 Cemetery Rd, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fbd8b6a4-932e-11ea-9ba0-14b31f159f22.png",
  "tags": [
   "family",
   "historic",
   "history",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12153734459397492355",
  "source": "GoogleMaps",
  "reviews": [
   "Very clean and well kept cemetery. I was only able to view a small portion of the cemetery before I had to head to the nearby hotel to check in. I am doing my family ancestry and saw some familiar last names that are in my tree on my last visit. I'm excited to continue my research to see if I have family here and to return to view the rest of the cemetery.",
   "One of the best historic cemeteries I've visited. Somme of the graves are a bit beat up, but most are in great condition and date mostly from the mid-late 1800s. A lot of beautiful stonework and some interesting bits of history. They have a little historical pamphlet, it's a bit sparse on details, but over all the visit was well worth it.",
   "It was very exciting to see all the old gravestones and walk through and just filled the history around you. When they close they mean they close. We were run out of their I guess by the caretaker right at 5 o'clock on the nose but all in all it was a good time period",
   "If you visit Virginia City NV and have the time you should visit the cemetery. It is very interesting looking at the old tombstones of the residents from long ago. There generally are will horses roaming in the area also",
   "Cool place to check out . Tombstones from the 1800's.\nMany claim its haunted..\nFind out for yourselves!"
  ]
 },
 {
  "name": "Squaw Valley Resort",
  "address": "1960 Squaw Valley Rd, Olympic Valley, CA 96146, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc21c4cc-932e-11ea-91c9-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3512395326311175951",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best resorts in Tahoe. They do an amazing job with events and the programing in the village. Aaron Tippet the events manager is a top notch human. Love working with him. They have music and fireworks every Saturday. Also Laser tubing. Not to mention the skiing and boarding is world class. Eat at one of the many restaurants in the village, my favorite is the Nectar spot, the wraps are DELICIOUS. Be sure to take a ride in the tram and head up to high camp. While you're there check out the Olympic museum or grab some food.",
   "Great skiing at Squaw valley! Beautiful mountain, lots of parking, tons of shops, restaurants a d bars at the base. Add to that a giant mountain with a wide range of skiing choices from pleasant groomed cruising to crazy steep, through the trees powder skiing. Nice lifts and gondolas. Well maintained and clean. A+ experience!",
   "There wasn't a ton of snow, but Squaw was still a blast. The runs are super fun and well maintained. There's a wide range of accessibility from easy to super challenging. Also, everyone working there was super friendly, from Ski patrol, to information, to the lift operators. I feel like it's a little confusing to find the entrance from the main ski lot, but if you just keep trekking through the village, you'll find the base. Can't wait to come back when there's fresh snow and I can hit the trees!",
   "This is one of my favorite resorts in Tahoe. They have a ton of variety in their runs and it's a big resort so I can come multiple days in a row and not do the same runs over and over. If you haven't tried the cookies it's definitely a must for the end of a long snow day!",
   "Squaw is huge! It's great for all skill levels. I go on blues and there were super long stretches with pretty short lines at the lifts. I also have beginner and advanced level friends who all enjoyed the resort. Squaw village also feels very cozy."
  ]
 },
 {
  "name": "Saint Mary In the Mountains",
  "address": "111 E St, Virginia City, NV 89440, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fc66d36c-932e-11ea-8f6f-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=9842865369722053879",
  "source": "GoogleMaps",
  "reviews": [
   "It was beautiful!! A wonderful museum in the basement. The gentleman was so very kind and informative. Thank you 😊 the inside is breathtaking.",
   "Exquisite design and beautiful architecture. I love this place. It's a must see.",
   "Disclaimer: we did not attend service, only attended the museum and saw the sanctuary.\n\nA pretty building with a wonderful history. The museum is full of artifacts from over the years, including information on Father (Bishop) Manongue— a local celebrity of sorts.\n\nHowever, it could be much more well kept and the people working there could afford to be much nicer. My husband spotted a restroom and used it, but was accosted (at length) by a woman working for the church after doing so. It made a poor impression at the very least.",
   "This is a beautiful Catholic Church up here in Virginia City! :-) it is a must see if you come to Virginia City even if you're not of the Catholic denomination! :-)",
   "So much more than a church. It's special. Every time I come to Nevada I have to stop here and say a prayer and give a blessing. This church in more than just a local church. You have people coming from across this country to stop here and visit. You don't have that in Reno or Carson City. But St. Mary in the Mountains in Virginia City is special."
  ]
 },
 {
  "name": "Incline Village Recreation Center",
  "address": "980 Incline Way, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fcb73d92-932e-11ea-83e8-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10408479064988371780",
  "source": "GoogleMaps",
  "reviews": [
   "Whenever we are in town we stop here for a workout. The locals are somewhat tolerant of our sporadic drop-ins. \n\nMy father has a cabin here so I think we are supposed to get some kind of local discount but it never pans out which is annoying. We usually buy a family pass for the week which is super reasonable.\n\nI love the basketball court and shooting around before I lift weights. \n\nThe warm indoor pool for laps and fooling around with the kids is a great way to get out of a snowbound cabin and get some fun family exercise. \n\nI’m always perplexed at well funded fitness facilities of this size that have a tiny weight area and don’t have barbells. The facility is huge but they cram the hamster wheels and weights into a closet sized area. It’s a 1970’s health club model. The cardio/weight room is the most utilized area but it gets the least space. The entrance lobby is bigger than the gym. It would be nice to get with the times and trends and expand this space to accommodate the demand.",
   "Best of Incline- swim, workout, etc",
   "I visited the rec center for the first time today and I was blown away. Not only is it well laid out with just about anything and everything you could want for exercise it was sparkling clean with nice lounging areas. The staff was amazing. Kathy gladly  answered all my questions and pointed out some helpful literature to take with me. Also got to talk with the childcare people about my 2 grandson's coming possibly in March and I just loved every minute of it. I tell you the people who live in Incline Village that have the IVGID residence pass really have something special.",
   "Nice and clean. During work days they open dive jumping for everybody including little ones.",
   "Great pool"
  ]
 },
 {
  "name": "Genoa Courthouse Museum",
  "address": "2304 Main St, Genoa, NV 89411, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd0cd7dc-932e-11ea-8fab-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=16755914994656764324",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing museum! Our favorite was learning more about Snowshoe Thompson and how he ate beef jerky, crackers and melted snow while delivering mail. Staff was very kind and shared fun facts about George Ferris who invented the ferris wheel and lived in Carson City.",
   "Interesting, clean, and very friendly staff! They have a small  area to purchase a nice selection of books.",
   "Nice museum with friendly staff. Very reasonable admission.",
   "What a great place to explore the history of Genoa, I highly recommend a stop here if you're coming through here.",
   "Especially liked info on first Ferris wheel"
  ]
 },
 {
  "name": "Mormon Station State Park",
  "address": "2295 Main St, Genoa, NV 89411, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fd5ec8a8-932e-11ea-9693-14b31f159f22.png",
  "tags": [
   "walking",
   "eat",
   "food",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14435289287341844252",
  "source": "GoogleMaps",
  "reviews": [
   "My dog loves coming here on the way home. It's quiet, off the street and lots of grass. A public restroom that is clean and a water dish for the dogs.",
   "One of my favorite places to go and spend an afternoon walking and looking at the shops. And walking through this beautiful grassy area",
   "We try to come out here to Genoa every year for the annual Candy Dance. It's a big craft fair where you can see a huge variety of vendors. There are also food vendors and little grassy areas to sit and eat. I love going.",
   "It was interesting. Lots to look at for $1. Picnic tables so you can have a picnic on a nice day",
   "Educational stop with old west items and the history of Nevada. Make sure you check out the Snowshoe Thompson statue and story in front.  Head across the street to learn more about the Candy Dance founder too!"
  ]
 },
 {
  "name": "Bowl Incline",
  "address": "920 Southwood Blvd, Incline Village, NV 89451, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fdb96bfa-932e-11ea-9345-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=2088502815752445482",
  "source": "GoogleMaps",
  "reviews": [
   "I love stepping back in time at the old school bowling alleys. Incline Bowl does it right -- it's clean and fun for the kids and the drinks are poured well for the adults. Nice pool tables and a few arcade games as well. It can get crazy busy here, but the employees work hard and will take care of ya!",
   "Right in the heart of Incline Village, the bowling joint is the perfect getaway for some good fun activity. Prices are reasonable and if you come here late in the evening (except Friday & Saturday) you're sure to get a lane. Location has ample parking.\n\nThey have a small arcade area, a Pro Shop and an over 21 billiard with a bar but no snack shop (unless you count the vending machine with cup of noodles).",
   "Loved it! All the way from Spain I had a great time!",
   "Good, classic fun. Moderately vintage. Great place to unwind with the family,  or your crew.",
   "Neat bowling alley. Cool little arcade. Kids loved it. Bar tender was friendly and the woman running the bowling area was super friendly. Very old school look and feel, but we had a good time playing a game or two!"
  ]
 },
 {
  "name": "Basil",
  "address": "311 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe03bbb4-932e-11ea-84fe-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11445684072996643786",
  "source": "GoogleMaps",
  "reviews": [
   "This was one of the best Thai restaurants I've ever been to! Great service, delicious food, reasonably priced. I would recommend this as a drive for people even living in Reno, it's THAT good!",
   "Absolutely fabulous food. Super fresh, incredible flavors. The restaurant is very clean and well kept. The head chef greeted us and was an excellent hostess. I definitely recommend eating here, it's an authentic Thai experience not to be missed!",
   "This is a gem and nice surprise for Carson city! What truly amazed me is they have authentic Thai decoration with meticulous details throughout the place. The amount of effort they put into the authentic decor is amazing. They even have fresh rose pedals in the water they same way you will fins it in Thailand. But consider their location is in remote Carson city!\n\nFood is in very good quality and fresh within a large collection, unlike other mediocre Thai restaurants.",
   "This place should get 25 star reviews because it is that excellent! The food is the best Thai food I’ve ever had, the service is exceptional and the owners are involved in the restaurant by talking to customers and one of the owners is the cook. This place is a must try if you live her or if you’re just passing through!\n\nThank you for such great food and awesome service you guys are the best!",
   "This place is fantastic! I never expected to find such authentic Thai food in Carson City. Just the exact right balance of sweet and salty and spicy, you can tell the chef really puts love into everything. The duck skin was crispy, the vegetables were fresh, the food was perfectly flavoured and the staff were absolutely lovely with great service. Generous portion sizes, reasonable prices, beautiful atmosphere, I highly recommend this place."
  ]
 },
 {
  "name": "Glen Eagles",
  "address": "3700 N Carson St, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe4d6f08-932e-11ea-a1a5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4220833262378052998",
  "source": "GoogleMaps",
  "reviews": [
   "Absolute beautiful atmosphere with both decor and mood. Beautiful place settings, wonderfully professional, personal, and informative staff. 5 star food and amazing selection of fancy desserts. Even a beautiful piece of cheesecake for my birthday. Absolutely wonderful, special place to celebrate. Thank you.",
   "Service was excellent, and that is the only reason for the 2 stars. I took my wife there last night for her birthday dinner. It was our first visit and we were excited based on the reviews. However, we were left disappointed,  my wife's steak was rare, but ordered as med-well. My steak tasted like it fell on the charcoal and was then dunked in crisco. Neither of us finished our steaks, or anything else on the plate., my rice pilaf was under cooked with crunchy pieces of rice. The baked potato was poor, I have had better baked potatoes from Wendy's.  The onion rings were okay, they would have been great except for the excess oil, way to greasy. We left and went home hungry. At over $100 for 2 dinners and 1 Margarita & 1 soda. I would say save your $....\n\nI just read the \"response from the owner\" Wow, my name is not Darren - not hard to see that in the original post. That helps to show the attention to detail that is lacking here. After talking with several friends I have been informed that this is actually very common, apparently the quality of the food is either off the charts awesome - or off the charts poor. We know what my experience was, I hope others experiences are better.",
   "Great service, great food. Had Chilean sea bass and peppercorn NY steak, both cooked to perfection. Topped off with Italian lemon cream cake and really good coffee. Perfect dinner for our birthday celebration!",
   "My cohort and I were in Carson City for training & stumbled upon this lovely place. We were pleasantly served by Cindy & amused by Bonnie. Both were a delight and the food was wonderful.",
   "Very nice atmosphere. Quality food with a nice menu to choose from. Generous portions, you will not be hungry afterwards.  Our server was very good and was knowledgeable about menus items and the specials. I would recommend reservations for larger parties and on weekends."
  ]
 },
 {
  "name": "Villa Basque Café",
  "address": "730 Basque Way, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/fe9fd51e-932e-11ea-82fc-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9581708644837572223",
  "source": "GoogleMaps",
  "reviews": [
   "My first visit here and it was a great start.  It was busy but service was prompt and our sandwiches came out quickly. \n\nA good number of options on the menu for breakfast or lunch.  The chorizo is the focus and it's amazing. \n\nThis is a great spot.",
   "Had an amazing burrito and mocha here! Had fasted for 24 hours and just one dish hit all the spots and left me full as heck! The service was awesome and the recommendations were on point. Highly recommend!",
   "Wonderful food with a small town feel. You will feel right at home. Portions are large, service is quick and the food is full of flavor. Try the gravy! Highly recommend.. you will not be disappointed.",
   "What an amazing and homey place, wish i could come here more often. The owner is incredible and the food is as well!",
   "Food is great here. The chorizo is a must try. Both dishes we tried has chorizo in them."
  ]
 },
 {
  "name": "Red's Old 395 Grill",
  "address": "1055 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff0a5700-932e-11ea-b847-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17315286746747570815",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, great drinks and great atmosphere - loved all the items hanging on the walls and from the ceilings - we happened to visit on a Saturday night and there was a magician visiting tables doing card tricks - very entertaining . . . Definitely recommend the smoked prime rib (a Saturday night dinner special) and rib eye with the rib rub and teriyaki butter! . . . And if you like beer, 101 to choose from! 🍺",
   "Shepherd is amazing. Loved him. $1 ribs on monday is also pretty cool considering the normal price of a rack. Huge and pretty great selection of beer on tap and TVs to watch games.",
   "Great food, friendly staff. I had the smoked prime rib Saturday special. It was wonderful! Garlic mashed potatoes, yummy. Fresh veggies looked perfectly.",
   "Best place to eat for dinner, hands down. Employees are super nice and well trained, food is good, amazing interior design. I have no problems at all! You must go to this place!",
   "While the food is good, they have a policy trying to force you to sit in the bar. When you come in they will tell you there’s a wait in the restaurant side but your welcome to sit the bar. They did this to us today even though there was only one table full in the restaurant and all the other tables were empty. The staff then said it’s “our policy to keep people from sitting in the restaurant so we don’t get to full” this is HORRIBLE and unacceptable customer service. How about I help you stay empty by leaving this review and keeping my family out of your restaurant. Some people don’t want to be forced to go to a bar!"
  ]
 },
 {
  "name": "The Cracker Box Diner",
  "address": "402 E William St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ff57f27e-932e-11ea-9401-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "eat",
   "delicious",
   "cheap",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4869038296510232806",
  "source": "GoogleMaps",
  "reviews": [
   "The Cracker Box is one of the best breakfast places in the area. Their food is fresh, comes in generous proportions, and they have a wide selection of menu options. They even have fresh squeezed juice. They have great cooks who will cook to order. The wait staff is always friendly, they all help each other out, and everyone is happy to help! CASH ONLY, so be prepared. Their service is always tops. The owner is usually out there helping in the restaurant. It is an authentic diner and a nice place to see familiar faces.",
   "Great old time food! The biscuits and gravy could sustain a platoon for a week. The BLT on Sourdough had plenty of bacon and lots of mayo, delicious. Staff was friendly and there was a welcoming sncse to the whole place. We went out of our way from Mammoth to Reno to stop and enjoy.",
   "This is a very cool little American food joint. The service was good. The food was great and the griddle is right out by the bar so you can watch the boys whip up some of the best eggs and hash browns out there. Would recommend.",
   "Always a must when we visit our Son in Dayton Nevada, we stay in Carson City and it is close to where we stay at, The Craker Box continues to serve great sized meals that are always delicious! I had the patty melt well 1/4 of it and some French fries cooked perfectly but as usual I got full and couldn't eat it all 🤗 I shared! The husband had a chili size with cheese and onions, it was also delicious the chili is very good and the hamburger very tasty you can tell it is fresh hamburger meat! A big plus!! We had ranch on the side for our fries put tapatio in mine like it a little spicy. This place is a must for your visit they do not disappoint❣We go every time and will continue to do so.... Enjoy",
   "A really cute little diner. The wait staff are very friendly. The food is good portions, cheap and delicious. I had the flapjacks with sausage."
  ]
 },
 {
  "name": "Heidi's Family Restaurant",
  "address": "1020 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ffa3a1a8-932e-11ea-b148-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "family",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=12587339717424527735",
  "source": "GoogleMaps",
  "reviews": [
   "Heidi's was a cozy little place to eat. The wait staff was nice. They checked on us, but not so much it was annoying.\nThe food was good, and we did not have a long wait for it. I had the meat lovers omelette. Loads of bacon sausage and ham in it with cheese, I chose to have it with a biscuit and home fries. Omelette was perfect. The biscuit was pretty tasty, not bland and dry like at a lot of places. The home fries were done just right.\nIt seemed like Heidi's was the breakfast place frequented by a lot of retirees. (Nothing wrong with that. They get to try more places being retired) what I liked was that I saw a few couples come in, and noticed that the waitress knew their names.",
   "One of our go to breakfast places in Carson City with a large menu offering from breakfast skillets, benedicts to crepes and most everything you could imagine for breakfast - just take a look at the fantabulous menu.  Located on the corner of Hwy 50 (William Street) and N. Carson Street with a small parking lot.  This cozy little breakfast and lunch establishment is well worth stopping in for a quick bite and great service.\n\nA few of our favorite dishes include the Emerald Bay Skillet with potatoes, mushrooms, bacon, diced avocado, feta cheese and two over medium eggs plus choice of toast or house-made biscuit which we generally lean towards the biscuits and the skillet is deLISH!!  Chicken Egg White Scramble with broccoli, tomatoes, olives, feta cheese and a side of cottage cheese ~ OMTASTY goodness!! How about Four Pancakes and scrambled eggs with ham FOR THE WIN! why not try one of these Traditional Eggs Benedict or the Oscar Benedict both with potatoes and house-made sauce ~ yummilicious goodness!!  Service is always friendly and food is deLISH!  We recommend Heidi's for a tasty breakfasts spot.",
   "The staff at Heidi's Family Restaurant are super nice and accommodating to this out-of-town visitor for the day.  If work beings me out this way of Carson City, Nevada in the future, will be sure to try other items on their menu.  Today's visit for Breakfast, I felt the want of just the basic breakfast and that would be the Pancake Sandwich (2- Fluffy but thick Pancakes, 2 Eggs (Any style) and a choice on 2-Bacons or 2-Sausages.  I ordered a side of Home Fries (just cubed Fried Potatoes) as well.  \n\nMy pancakes were filling and soft and fluffy. The Bacon was crisp and crunchy, not burned... the scrambled Eggs were fluffy and perfectly cooked (unlike some restaurant chains that serve scrambled eggs with a watery look to them).  The side of Home Fries was what I really needed to make the Breakfast complete.   I officially give Heidi's Family Restaurant a 5 Stars rating and highly recommend to visit again and again.....  I can hardly wait!!!!",
   "Vegetarian options available without requiring customization. This is a high-value detail. Being able to order a veggie benedict straight from the menu makes the a big winner for having the conscientiousness and willingness to serve a diversity with delight. Creative pancakes, waffles and carries has my curiosity as return visits are likely.",
   "Small and cozy place. Ate chicken fajitas omlete. Wasn't the best but wasn't bad either. Fruits were fresh. Coffee and service was good"
  ]
 },
 {
  "name": "Carson City Black Bear Diner",
  "address": "900 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ffe9216c-932e-11ea-94d5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17881267423143637989",
  "source": "GoogleMaps",
  "reviews": [
   "The staff was very cheerful, and helpful. We have allergies and gluten intolerance in our crew, and our waitress and cook did excellent keeping us all safe, while making delicious and fun food. Unlike most other casino restaurants in town, no smoky atmosphere either. The prices are a little higher than other casino restaurants, but the food and air quality definitely made it worthwhile. Thanks guys!",
   "Delicious food with lots of flavor the costumer service is excellent i recommend the big bob burger",
   "Tasty & Large Portions for your money",
   "An amazing place for breakfast, lunch and dinner! The food choices are endless and so delicious. My first time here was a while back but I would eat here everyday if I could. The staff were also amazing, really loved this place. 5 stars right of the bat for them (:",
   "We're locals and we pretty much go every weekend, we sure do enjoy the food. They are usually busy and sometimes have a wait, but its worth it. The Staff could be more friendlier and should slow down while they are taking your order or when they are being asked for other things."
  ]
 },
 {
  "name": "Z Bistro",
  "address": "725 Basque Way, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/003768b4-932f-11ea-af0f-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6074632676379800920",
  "source": "GoogleMaps",
  "reviews": [
   "I came in to her restaurant on behalf of a fast food delivery app. The employee was so rude to me. She wouldn't let me speak and kept saying \"uh uh absolutely not\". I am only a driver. I go where I am told. This women treated me with so much disrespect. It is unreal. I hope she doesn't treat her actual customers as rudely as she treated me. Horrible women. Horrible customer service!!!",
   "Our first and best poached pear!",
   "Food is very good, often you get to eat whats in season, a must go place whenever we are in town. Owner Tina very friendly. She remember you by name.",
   "Always incredible!! Service is top notch and the food unbelievably delicious!",
   "High quality food and delicious food. Service was quick and friendly"
  ]
 },
 {
  "name": "Garibaldi's Italian Kitchen",
  "address": "307 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0071d9d8-932f-11ea-a0d7-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "delicious",
   "food",
   "field",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10842833201851590313",
  "source": "GoogleMaps",
  "reviews": [
   "I meet Letty here for dinner. I found the food to be amazing! The wine was great, service was great and make sure you make a reservation. Make your way there as soon as you can. Great place to eat and drink.\nEnjoy!!",
   "It was just a few short weeks ago that I wrote a review for an Italian restaurant in Buffalo New York, giving it 5 stars and stating that it was the best Italian food I had ever eaten anywhere. I'm here to tell you that Garibaldi's blows that place away. I had the traditional spaghetti and meatballs and it was amazing. The sauce was very authentic and I loved the garlic that they used in the sauce. The meatballs were huge and delicious. My wife got a chicken dish, I can't remember the name of it, but it was made with some kind of lemon marinade and baked. That was equally amazing. On top of all that, the service was excellent, quick and friendly. you are missing out if you don't go to Garibaldi's for a great Italian meal.",
   "It was a pleasure to be saw as I human not  like a bum from out in a field that they didn't want to deal with . Very pleasant kind manners . Listening to what I asked for even thought it wasn't on the menu. This is definitely great food.",
   "We had a great dinner at Girabaldi's tonight. I had the snapper special and my partner had the sole Dore. Both fish were cooked perfectly which is no small accomplishment. We had the clams and mussels appetiser for a starter and it was wonderful. Plus our server Julie was the best!",
   "Outstanding food! My scallops were cooked to perfection and the garlic bread was great! I highly recommend Garibaldi's."
  ]
 },
 {
  "name": "Pho Country",
  "address": "2495 N Carson St, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/00d11100-932f-11ea-aa14-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14443336757137000660",
  "source": "GoogleMaps",
  "reviews": [
   "For my first time here, I ordered 50B off the menu. Food came out very quickly. It looked great but had very little flavor. Table service was below average and the employees weren't friendly. Not a positive experience for me.",
   "Holy Pholy this place is good!\n\nThis was the best and most fresh Pho I've eaten in my life, not joking.  I had to personally tell the owner how I felt about my meal when I left.\n\nI had just finished a half marathon in Tahoe and was ravenous.  My body must have been craving a big bowl of warm comfort but since I had carbo-loaded the night before, I omitted the noodles and asked for only veggies, shrimp, and chicken in broth.  We ordered the shrimp spring rolls and pork crispy rolls which were also the best I have had.  I can't reiterate enough how fresh everything was.  \n\nI must mention the vegetables in my Pho were so perfectly cooked and bright in color, the chicken was all white meat and extremely tender, and the shrimp melted in my mouth.  The broth was nowhere near \"too salty\" and only tasted flavorful, I drank every last drop.\n\nAlready looking forward to ordering the same exact thing next time I drive through Carson.",
   "Quick service and fresh food. Nice quaint place; would not recommend going during the busy times.",
   "In this case you’re better off getting microwave Chinese from frozen section at grocer. No sarcasm. Note that other reviews mention absence of flavor. I wouldn’t post this if it wasn’t honest.",
   "Our first visit to Pho Country and it was fantastic in every way possible. \n\nWe were seated quickly in this busy restaurant. We ordered two bowls of bun nuoc (beef flank noodle soup), one bun vermicelli noodle bowl and a calimari appetizer. The appetizer was served immediately: crisp, well seasoned, and our son who hates seafood loved this with the lightly sauteed onions. (I'd have eaten just these onions for dinner!!!).\n\nService was quick and friendly. Prices are extremely reasonable, especially for the very generous portions. We'd have eaten more if our stomachs could have held it. \n\nNext time we visit Carson City, this is a restaurant we'll easily eat at once again!"
  ]
 },
 {
  "name": "Duke's Steakhouse",
  "address": "3800 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/012069d0-932f-11ea-b9d7-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10317060669798361045",
  "source": "GoogleMaps",
  "reviews": [
   "Server Ron best yet excellent food",
   "So my steak was prepared the way I wanted because I made sure it came that way. However my friend and his son's steaks were extremely under cooked. My friends sins steak was blue! Our server was awesome, very apologetic and gave us great service. I would go back but will not order a special ever again. To them a special is a reason to jack up the price a few $$s more for just adding inedible cheese.",
   "Had a great time at Duke’s tonight.  We were here from out of town staying at the hotel next door and happened upon the restaurant.  We ate at the bar and the food and service was excellent.  A big thanks to Dan for a great dining experience!",
   "Staff was great! Filet not so great. Hard as a rock and the sauce was definitely needed. 6 ounce filet looked like 4.",
   "Nice place and nice people. The oysters were the best I've ever had. But the steak was full of fat. Like almost half of it was fat. The veggies didnt seem to be done all the way, they were hard. My wife ordered chicken cordon bleu , it was plain tasted like nothing and was very dry. NOT WORTH THE PRICE"
  ]
 },
 {
  "name": "Scoups Ice Cream & Soup Bar",
  "address": "224 #4 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0164ecfe-932f-11ea-98f7-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17562551591803899700",
  "source": "GoogleMaps",
  "reviews": [
   "Best place for soups in Northern Nevada, hands down. The staff is always super friendly and willing to let you taste before you buy! Thanks for the great soups and scoops!",
   "The vegetarian chili in a sourdough bread bowl was very tasty.  Their pulled pork sliders were also good.   Very nice place for a healthy lunch.   The rating should be 3.5 stars.",
   "Really cool little place across from the Capital. I only had the soup, so I can't speak to the quality of the ice cream, but the soup was really good. The service was fast and friendly. The prices weren't great, but they were at least reasonable. I honestly can't find any fault.",
   "Came in pretty late one night\nWe were treated with exceptional service and offered lots of samples.\nThis place does it right, they want you there and you can feel it, plus everything tastes great!\nIf your around it's worth stopping in",
   "Employees are very friendly,  has a home style feel & ice cream is really good !"
  ]
 },
 {
  "name": "Squeeze In",
  "address": "308 N Curry St Suite 102, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/01a79b8a-932f-11ea-9940-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "eat",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18271081997869032172",
  "source": "GoogleMaps",
  "reviews": [
   "Heidi is wonderful! She really makes us feel like family. The atmosphere is fun and all the staff are friendly and cheerful. My food was prepared exactly as I like it. The team remembers what I like at every visit and offers it to me before I can even request it! Incredible service!!\nI wish there was a gluten free bread option for toast and sandwiches. I have gluten allergy, and not being able to eat a GF bread is the only thing I dislike at Squeeze In!",
   "Squeeze In is delicious and vibrant. A semi-chaotic busy environment warms the space and activates the diner with involvement. The staff is friendly and keeps an attentive awareness to each table supporting one another creating a good service. ⚠️ I did have an issue of not getting the right dish as I ordered a vegetarian benedict and after a wait got a ham of hell dish, it was restored and I got the right dish pretty quickly. \nCoffee was delicious, and I was even offered a fresh cup for the road. 🤩\nLots of vegetarian options!",
   "Very nice place. Great menu options. Our meals were fresh, the portions were just right, and delicious. The service was very friendly and kept us comfortable with water refills or other requests. It was a busy time, yet the feel remained relaxed and comfortable. We joined the club and look forward to returning.",
   "We love Heidi and her crew#!They are always welcoming and ready with smiles.  So glad that Carson City Squeeze In and the crew are able to keep going through this Covid-19 mess.  We are trying to help our local businesses.",
   "Such a great experience at such a crazy time! Picked up a to-go order today and the few staff members that were there were ALL wearing gloves and masks, even the cooks! Food was amazing as usual!"
  ]
 },
 {
  "name": "Flat Earth Pizza",
  "address": "2010 E William St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/01eeda58-932f-11ea-9e24-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "delicious",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8663485230089415760",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome pizza, great service, and really nice place all around. For being such a big pizza, it came faster than expected. Tried new kinds of pizza and the flavors were rich and delicious. Everyone was very friendly and relaxed. We look forward to trying more. Delicious crust!!!",
   "This is a great place to get a good pie. The mushroom one is my favorite and the bbq pork was also fantastic. Salad as you can see was beautiful and very good. Homemade vinaigrette dressing is ah-mazing! Make sure you get extra.",
   "First of all the pizza selection is huge with a plethora of unique toppings to satisfy any pizza connaisseur. The pizza itself is made perfectly, but surprisingly enough I didn't get inspired to write this review because of the pizza. You guys blew me away with those smoked wings. They were smoked perfectly and are from now on going to be my go to whenever I want me some wings. Only criticism make that extra hot just a tad hotter, but that might just be me... Thanks for the great service!",
   "Pizza was delicious and baked perfectly. Smoked wings had a generous amount of sauce of our choosing and also delicious. The Tuscany Salad with smoked chicken added, had amazing homemade salad dressing and was phenomenal! Definitely recommend and will eat there again.",
   "Found this amazing pizza joint as we explored Reno! A must when in the area! Great staff, friendly service, clean facility and the pizza is delicious! \n\nPictured is The Great Bambino (hold the mushrooms and olives).\n\nA must next time we are in town!"
  ]
 },
 {
  "name": "Ming's",
  "address": "2330 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0241193e-932f-11ea-947f-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "eat",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=6270266617255370460",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered sushi, tried a few different rolls but everything tasted the same; minus the exception for the spicy tuna roll that was the only good roll in my opinion. Oh yea while i was paying I over heard a patron order the \"all you can eat sushi\" I immediately ask and was met with smirks and laughter from the staff and told i didn't \"ask\" about the all you can eat so i was charged full price. Can't believe i almost left a tip.",
   "The pork chow mein is ridiculously good. Like, wow, easily the best we have had in Carson. \n\nI already have a favorite Chinese place here in Carson, but I still like to try other restaurants just in case. We typically order pork chow mein and Mongolian beef at each restaurant, and my husband tries something random each time. \n\nI've already mentioned how good the chow mein was, seriously, so good. The Mongolian beef on the other hand was, not great. Not spicy even though there was a chili next to it on the menu, no sweetness, not savory, and had a slight hint of fish flavor (which is my big no no for Mongolian beef). So if Mongolian beef if your thing, like it is mine, this isn't your restaurant. My husband ordered the garlic chicken cause it was supposed to be spicy, also wasn't spicy. \n\nWe ordered these items for take out.",
   "Went there to have lunch to go.  I ordered sweet and sour shrimps. It was an ugly experience when I got home to eat.  The shrimps had been cooked in a heavy red sauce, probably with MSG preservative.  The  shrimps were so hard it was obvious that they were cooked a day or two before today and kept to use them when needed. My lunch ended up in the garbage.  No need to ever return to this place. That’s too bad because Carson City can use a good quality Chinese restaurant.",
   "Awesome selection of sushi. You will not be disappointed especially if you do the all you can eat special.\n\nI love there salmon skin rool and spider roll. Careful if you get a long roll there big.",
   "This review is on the sushi bar inside Ming's Restaurant. The sushi bar has affordable good sushi, We had 5 rolls, plus dessert and all had amazing taste. Vegetarian and Vegan friendly!"
  ]
 },
 {
  "name": "Bamboo Garden",
  "address": "4250 Cochise St, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/029294fe-932f-11ea-82e6-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17629915484955232533",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best Asian food I've had in some time. The BBQ egg foo young was meaty. The vegetable fresh. The gravy flavorful. Never been here before but will definitely make a trip from Reno. Just for this food",
   "Pretty good food. I have had better but it's part for Carson. If you get them on a good day the food is a little above average otherwise it's typical. Not bad but not great either. We eat here often because it's convenient.",
   "Best place to go!! Fantastic food and service ALWAYS!! Have food no one else does and treats you like family",
   "Big menu. Hot and sour soup very tasty. Rice is like all chinese restaurant rice, a bit hard. Bbq ribs were nice and big serving.",
   "We had house fried rice, sesame chicken and when I got to the crispy walnut shrimp....amazing. The Who,e meal was delicious!!"
  ]
 },
 {
  "name": "Rum Jungle Buffet",
  "address": "3800 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/02de6b2e-932f-11ea-9e4b-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9746250594472070372",
  "source": "GoogleMaps",
  "reviews": [
   "Came here to have dinner with my family. Stood in line for 20 minutes and nobody walked up or greeted us. The \"chefs\" at the time just stood there and stared while they looked at each other in confusion. \n\nAs we waited, we can hear the bussers talking and asking here the cashier is to get us seated. Few minutes after, we see a woman walk towards us like nothing happened. No greeting whatsoever and just asked how many people and proceeded to charge us. \n\nWhen we got seated, we rushed to the food only to find old food. Everything I picked and tasted stale and disgusting. We came here only for the AYCE and the reviews. Obviously customers reviewing and giving 3+ stars were either drunk or had no other choice of food options. \n\nI would not recommend this place to anyone!",
   "I had meatloaf, it was bad (the sides were good).  My wife had chicken fried steak, it was good. The service was good.",
   "My wife and I love the Champagne Brunch on Sunday we have made the trip from Reno to Carson City several times and have never had a bad experience.",
   "Let's raise the prices really on cold food!! And bland food Reno Buffett have better for those prices.. come on",
   "Good place to eat if you like to eat at a buffet"
  ]
 },
 {
  "name": "El Charro Avitia",
  "address": "4389 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0327f770-932f-11ea-a3c2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15039953874301744648",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent restraraunt, great food and service, I highly recommend them. They have authentic Mexican Food and are centrally located in Carson City, NV.\n\nTheir atmosphere is certainly a true Mexican style, it reminds me of being in Mexico as a child, visit and enjoy 👍👍👍",
   "Ordered take out due to the covid 19 pandemic. My wife ordered the chicken enchilada and I had the chicken burrito. If you have had Mexican food in California, dont expect to get that here.",
   "I have been going here for over 40 years. The food is consistent, tasty, and service is usually very friendly and good. The house Margarita is tasty, chips are fresh, and if you like hot, ask for the \"kitchen\" salsa.",
   "This place is amazing. Delicious food fresh salsa and homemade chips do die for mmmm. The service is excellent. Clean place too.",
   "We like this place so much and go so often that we call it \"our Mexican place\". We always have a nice time and enjoy the food and drinks. We planned some of our wedding here ❤️ so it will always be a special place. Try the Mexican Tea cocktail, it is my wife's favorite."
  ]
 },
 {
  "name": "Mom & Pop's Diner",
  "address": "224 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/036ffd1e-932f-11ea-9ae5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "affordable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18022899645260327236",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little quirky diner across from the Nevada Capital buildings. Loved the food, but could have received better attention by the service. Though, first person who served is wasn't a regular server.",
   "The owner is a hoot. He has a dry sense of humor. The food is very good. You can order to your liking or off the menu. Outside seating in the summer.",
   "As soon as we walked in we were greeted with a smile and they got our drinks right away. Once I found out they allow dogs on the patio I ran and got my puppy and the workers had no problem switching our table to outside. Great food and a great price",
   "This is a nice place for good breakfast eats any day the week. They of their own version of skillets and omelets and interestin takes on breakfast. The food is pretty affordable in the coffee's always piping hot.",
   "Letty and I had breakfast here. The food was very good. \nEnjoy!"
  ]
 },
 {
  "name": "Peg's",
  "address": "3697 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/03bd8110-932f-11ea-a9df-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15372631759720075626",
  "source": "GoogleMaps",
  "reviews": [
   "Peg's is great, food is excellent, I had the biscuits and gravy...damn good! My server Evelyn was friendly and quick, and has a great smile! In fact, all the servers here are top notch. It gets busy, because it is so dang popular, for good reason! Fantastic value and pleasing service! Thumbs up!",
   "Friendly staff, good portions, tasty food. Not outstanding, but very good. It was our second choice because our first choice was too crowded. We really wanted mimosas but no alcohol served here, which was disappointing.",
   "The food was delicious and the portions were large! Their coffee was bland but as expected from a diner. You'll definitely get your money's worth here. Recommend to anyone who's looking for some good food for a bargain!",
   "I'd recommend this place for anyone looking for a great breakfast spot in this small town. Wide variety of options and great service.",
   "Wow!  Fantastic food and service. I had the Altogether sandwich and can't wait to try a burger or breakfast. Definitely be back soon!"
  ]
 },
 {
  "name": "Kei Sushi",
  "address": "3220 US-50 #4, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04125812-932f-11ea-b772-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2097660364008320043",
  "source": "GoogleMaps",
  "reviews": [
   "This is place to get sushi in Carson City.  Decor is beautiful and you are seated right away.  Tables are close together is the only criticism I can think of for this place.  You can watch the chefs working and request things that they make pretty much immediately and serve you, so you can be in and out of this restaurant very quickly if you wanted to.  I have eaten here many times and always enjoyed their fresh dishes.  It is a nice dining experience overall, so if you like sushi you should check it out.  Prices are not bad either considering.",
   "Its excellent. However this time their fish was cut thinner and more rice was added, so it was difficult to even taste the fish",
   "Amazing service and amazing food! They were busy as expected for Valentine's day but the staff was so efficient and quick to get our orders out we barely even noticed, as always Kei was amazing 😊",
   "Worst service ever! Asked for water 3 times before I got any, we were there for an hour before everyone got served a roll each. My boyfriend asked for a specialty drink and they gave it to him in a sampler glass instead of a full sized glass. We were with 6 other people so  we split the check and they add gratuity which was okay except we didn't even do the all you can eat, we each got one roll each and I am pretty sure the added 18 percent is for the all you can eat menu. My boyfriend and I left first and they told the rest of the party we didn't tip so they added our 18 percent to their bill when they had already added it to ours. It seemed they were so busy and nobody in the restaurant had food on their table and we had to ask for our check 3 time .  Worst sushi experience I have ever had as far as service but the food was pretty good.",
   "i always have eaten here for sushi, the food is amazing and the people here make it even better. absolutely the best sushi in carson city!"
  ]
 },
 {
  "name": "Ti Amo Italian Grille",
  "address": "3800 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04627430-932f-11ea-9cb2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10313789671262339360",
  "source": "GoogleMaps",
  "reviews": [
   "What a great place! The staff is helpful and the food is great!",
   "Fantastic Food ! Great Atmosphere!😊",
   "Good food and service. Eric was great.",
   "The food was delicious! The service was friendly and prompt.  The kitchen was short staffed during my visit so it took them longer to serve our food, especially since we were a group of 8 which included 2 teens and a 9yr old.  However,  I completely forgot about the wait once I tasted the food, it was worth the wait.",
   "Pretty good...nice portions. Nice clean restaurant. Shrimp Diablo was great. I would rate it a 3 n 1/2 but not an option. The scallops were fishy. Didn't feel ripped off but could be better."
  ]
 },
 {
  "name": "Kim Lee's Sushi & Teriyaki",
  "address": "319 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04b5284a-932f-11ea-b8b3-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4301441405978690423",
  "source": "GoogleMaps",
  "reviews": [
   "Sushi here I super fresh and delicious. We have had the same girl make our sushi twice now and it's always great. The reason I only give it 4 stars. The place is always super sticky when we go in there. Also they make their sushi big. Smaller rolls like less rice and pieces you could comfortable fit in your mouth would be nice. Other than that it's awesome.",
   "Tasty and fresh! I find some of the long rolls have a bit of a strange combination... if you're  doing all you can eat order half or short rolls so you don't waist if you end up not liking it...",
   "Steve did an outstanding job preparing my lunch. The food was fresh and the area very clean. Sorry to here that Joe had left.\ngreat Job Steve.",
   "My husband and I have found our new sushi spot, The best sushi we have had by far. Flavorful with every bite, very little rice so no choking it down or drenching in soy sauce. Will definitely be going back for more.",
   "All you can eat appetizers, sushi, & dessert and all was so tasty. Our individual chef Carla was fun to watch as she prepared our sushi. Great atmosphere."
  ]
 },
 {
  "name": "Gather Carson City",
  "address": "402 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/04fd06de-932f-11ea-9200-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9693292019822165797",
  "source": "GoogleMaps",
  "reviews": [
   "I loved this place. Really comfortable atmosphere, unique menu but easy to find something delicious, kind staff, and the best part was the locally sourced items. Meat and vodka sourced locally from Bentley, and it tasted delicious! Would definitely recommend to anyone for any occasion! What was really neat was a kids table of toys in case the little ones need a distraction. Really fun place. Will definitely be going again!",
   "In the Carson City area for the week and my brother  took me there because he said it was good. They did not disappoint. Nice wait staff and quick turnaround on orders. \n\nThe food is good and add in the service I will be back.",
   "Great place for dinner! Stopped by while on a business trip to Carson. The manager was very accommodating ahead of time and the staff did a great job with our large group. The food was great along with the wine selection and IPA beer. I would definitely recommend this hidden gem to anyone.",
   "One our favorite restaurants. Excellent food at very reasonable prices and great service. Menu is not as big as other places but everything I've had is excellent and they help support local producers as a Farm-to-Table establishment. We've introduced a number of friends to Gather and everyone has enjoyed it.",
   "I was in town on a business trip and this restaurant was highly recommended. It met my expectations. Lots of menu choices for a variety of taste palettes. I especially loved the dessert - bread pudding with a fabulous bourbon sauce.  I have a few more nights in Carson City, and seriously thinking of going there again."
  ]
 },
 {
  "name": "La Santaneca",
  "address": "316 E Winnie Ln, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/054819f6-932f-11ea-8b34-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "drink",
   "eat",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15367963410240586208",
  "source": "GoogleMaps",
  "reviews": [
   "This place has a great atmosphere, very friendly owner and staff. The food is super tasty, authentic El Salvadoran dishes, and drinks. This place is worth a try if you want a flavorful meal with the taste of Central America.",
   "This was my first time to La Santaneca Restaurant.  They staff was very friendly and the food was outstanding.  If you ever have a chance to eat here I would highly recommend you give this restaurant a try.",
   "What a CRAZY good little dive! I brought my mother there after reading the positive reviews of there food. I was in town visiting my mom and decided to try Salvadorian food for the first time, I was not disappointed at all. They have this crazy fruit salad drink that my mom and her friends are now addicted to (she’s been there 3 times in 10 days since I left. There poupusa are the only and best ones I’ve ever had. I peeked in the kitchen like I Alyson when eating at a new restaurant and it was SO CLEAN, I would eat off the floor. Can’t wait to visit my mom and go back.",
   "The food was real good.   I had four different Pupusas (Shrimp, Veggie, Pork and House Special)  The service was outstanding.   The gentlemen waiting on us explained the menu and was very patience.  The dessert was tasty. (Empanada)   The whole experience was excellent.   Will definitely go back and try more.",
   "Authentic Salvadorian food tastes like my grandmas and everyone is so nice they treat you like family"
  ]
 },
 {
  "name": "Mangia Tutto Pizzeria e Ristorante",
  "address": "200 N Stewart St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/058aef92-932f-11ea-91ce-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=13082265539507435026",
  "source": "GoogleMaps",
  "reviews": [
   "Update 4/21, Mangia Tutto open for take out.  Give them a call. Just visited Mangia Tutto to pick up a pizza to take home.  It was twilight outside, inside atmosphere was soft lighting and enjoyable colors. They specialize in pizza,  a robust Italian menu with a full bar. A large screen TV was playing sports.  The pizza was a tasty 14 inch combo.  Give them a try.",
   "Watch out Adele’s you have found your match for the best place to enjoy a wonderful dinner in our wonderful capital! Amazing friendly staff and the food is a game changer for dining out in Carson City! I can’t wait for my next visit! Every single person must try it once! And multiple times if you are a local!!!",
   "We used Grub hub for our delivery. The food was still hot. If you have not tried the meatballs, you should. They have really good flavor. The marinara sauce is also very well done.",
   "Very quiet, personable establishment. The deep dish was AMAZING. Don’t cut yourself short, if you want a cheap slice of cardboard, with some cheese and sauce on it, this IS NOT THE PLACE. The Chicago style deep dish will fill you up just looking at it. The taste and aroma is totally fulfilling and worth the price and wait.",
   "Excited to have a new restaurant in town with some original flavors! The Italian wedding soup was amazing. Portions were very filling too. Great staff and the atmosphere was great!"
  ]
 },
 {
  "name": "Westside Pour House",
  "address": "110 W Telegraph St, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/05d13f3a-932f-11ea-a1bb-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8165353500532683704",
  "source": "GoogleMaps",
  "reviews": [
   "Geraoke (geriatric karaoke)  on Wednesdays is the best!  We always have a fabulous time!  It is a blast regardless of age!  The food is good and Katie the bartender is fabulous!",
   "Right in the center of the downtown hot area in the redeveloped area. The pour hose is a long time local favorite. Friendly staff. Enjoy!",
   "Very good out of the way place. The grill offers some great lunch choices. You wont go wrong with the penguin burger. They offer several choices of craft beers.",
   "Always the last stop after wine walk to get some good food.  Pool tables and darts 😁",
   "The Westside pour House is a bar and grill in Carson City. Located right downtown this is a rather large space that used to be a Mexican restaurant. I stop in here for lunch and have only\n had burgers but they have always been delicious."
  ]
 },
 {
  "name": "Bleu Café",
  "address": "240 E Winnie Ln, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0625c814-932f-11ea-a621-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10029380680530306123",
  "source": "GoogleMaps",
  "reviews": [
   "Small cafe with delicious breakfast and friendly staff. Variety of coffee cakes and fresh pastries. The Salmon Benedict was fantastic. The eggs were perfectly poached with runny yoke but fully cooked whites.",
   "Bleu has re-opened for lunch, Monday - Friday.  Roberta has added a few things to the menu and has daily specials.  It's nice to have this little gem back open.",
   "Great food, quiet environment, friendly and courteous staff too\n😎😀😎",
   "Great food made to order. Real gravy made from scratch. Housemade buttermilk biscuits. Great ambience. ",
   "Everything here was great. Only issue was being charged 6% for my credit card without being told there was a fee. I found this pretty unusual since it's a restaurant that also serves alcohol."
  ]
 },
 {
  "name": "Tomo",
  "address": "135 E Clearview Dr #127, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0665b78c-932f-11ea-b93c-14b31f159f22.png",
  "tags": [
   "eat",
   "eat",
   "delicious",
   "eat",
   "creative",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1921740563083760410",
  "source": "GoogleMaps",
  "reviews": [
   "I wish I could just hideout in the bathroom or sleep in the ceiling in between meals and just eat $20 all you can eat sushi forever. Amazing deal. Or at least stuff my pockets with quail eggs and philly hand rolls until I catch a felony FOREVER!!!",
   "It was $25 for all you can eat. For the all you can eat menu, there was a good variety of options to choose from--appetizers, nigiri, hand rolls, and all types of rolls. The wait was around 40 minutes for a party of 2 at 7pm.",
   "In Virginia, we have no all-you-can-eat sushi places.  This was my first time branching out from a California Roll. I'm so glad I did!  We tried many items from the menu, and everything was delicious and fresh!  The servers were friendly and helpful. If you're in the Carson City area, you have to give this place a try!",
   "Best sushi I've had in ages! Fresh and lots of interesting choices. Great all you can eat menu for a good price (think it was $24,99). Most rolls do come in 8 or 10 pieces so take it slow when ordering ;) Quick service and friendly staff!",
   "Really great and friendly service, fresh sushi, and the green tea cheesecake was so creative and delicious. I also appreciated that the mussels appetizer was out of the shell and conveniently on a spoon. Great all-around!"
  ]
 },
 {
  "name": "In-N-Out Burger",
  "address": "957 Topsy Ln, Carson City, NV 89705, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/06a6df5a-932f-11ea-b8c8-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7768820415479810886",
  "source": "GoogleMaps",
  "reviews": [
   "For hiring high school kids, this place is effective.\n\nAbsolutely fantastic fast food. In n out is notorious for fresh burgers and legendary animal fries, but this place is a gem in the rough.\n\nThey are very quick at preparing orders, despite monstrous lines and hoards of people.\n\nThey have never messed up my order in the years I have been going there.\n\nThe food is always the good quality you would expect.\n\nI highly recommend this in n out.",
   "Coming from Seattle, we were finally able to compare Dicks drive in to In n Out.... Don't know about a winner, but this location was great",
   "Always good service and quick. There line was all the way to best buy parking lot and still was out within 10-20 minutes. They are doing a wonderful job. So impressive",
   "Always a great experience with this place. They have never gotten my order wrong and my burger is delicious every single time. If you want quality and great customer service this is the ticket.",
   "Double Double Animal Style with Extra Extra Pickles!  Deliciousness!!"
  ]
 },
 {
  "name": "Sage Cafe",
  "address": "1600 Medical Pkwy, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/06ee7850-932f-11ea-9ac8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4796730821186065511",
  "source": "GoogleMaps",
  "reviews": [
   "This does not taste like * hospital food*. I like the fact there is a daily special as well as a menu. Since this is inside Carson Tahoe Hospital, the employees are extra thoughtful and kind. Many folks are there and worried for a loved one. Not your standard customer. Special skills are needed when folks are hungry and emotional, or exhausted. Basic menu choices but the items are chosen for *comfort food* value. Lots of tasty healthy choices too! Clean and visually appealing dining area. Every condiment known to man in packets!!! We go there just for lunch. Pricing is reasonable too.",
   "Great healthy food, specially where it is needed. Thank you.",
   "best food around! The stir fry is AMAZING 😍",
   "3.5 stars. Fast and friendly service. Food was tasty. I ordered Fish and Chips. Some of my fries were burnt and 2 small pieces of Fish.",
   "Great food & spirts and kid friendly! Beautiful views and I do believe outdoor dinning. Also happy hour from 3 to pm."
  ]
 },
 {
  "name": "China Bistro",
  "address": "1280 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0731227a-932f-11ea-ab52-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8867824304825667285",
  "source": "GoogleMaps",
  "reviews": [
   "Mediocre at best. Unreasonable wait time,  egg in fried rice was burnt, slightly expensive, broccoli chicken had no flavor, and pot stickers definitely came from a frozen bag. They didn't even have the decency to give me a spoon for my wonton soup.",
   "Great Chinese food,atmosphere, and service. The staff were friendly and welcoming.  The dining room was comfortable, and attractive. The menu robust, the prices moderate.  My noodles with chicken tasty.  It was very clean and well kept\n Local family owned andrin. I was pleasantly surprised all around. I recommend this restaurant",
   "The food and service are always excellent. Always extremely fast and the owner always greets you personally and as always extremely pleasant. Absolutely love this place especially with all the new furniture and the remodel",
   "Great food, excellent service, and a good value. Their spring roll is delicious!  I missed a fortune cookie though! They give you almond cookies.",
   "Hands down the best Chinese food I've had in the area. Great portions, great prices, clean food. This is definitely my favorite Chinese place now. The staff is always friendly, it's clean inside and out and also has a drive thru."
  ]
 },
 {
  "name": "L.A. Bakery",
  "address": "1280 N Curry St, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07733552-932f-11ea-bf3f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "affordable",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10505447410053874620",
  "source": "GoogleMaps",
  "reviews": [
   "So i just ordered the 🍄 🍔 with some bacon and 🍟 and i have to say u guys have way better 🍔 and 🍟then any other place I've eaten at thank u so much for your business",
   "I stopped in to have a quick salad the salad was OK except for nothing was bite-size and it was on the smallest plate you can imagine so even trying to cut up the food was challenging. I didn’t feel like the staff  appreciated the business I was giving them nor did I think they were polite. Also I feel it’s extremely overpriced Almost 8 dollars for a slice of carrot cake I don’t think I’ll go back",
   "We always love the variety of food and the healthy choices.  Large portions on salads and yummy sandwiches.  We ordered a chocolate cream pie to go. It was ready right on time and looking super.",
   "The place was very affordable for me and my family. We enjoyed and excellent dinner.",
   "I used to love coming to this location and always referred friends and family here, but a few weeks ago I purchased their \"love salad\" and yes it was probably my favorite salad but I had an allergic reaction to something in it and when I went to talk to the manager about what ingredients were in the salad (not accusing anyone of anything) and was scolded by the manager for doing so. He was 100% positive that something like that would never happen as his restaurant! I was disappointed with how he handled it."
  ]
 },
 {
  "name": "Living the Good Life",
  "address": "1480 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07b4f30a-932f-11ea-a185-14b31f159f22.png",
  "tags": [
   "music",
   "food",
   "music",
   "food",
   "music",
   "drink",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15301966556240030130",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in on our way back from Reno for a quick bite around 7pm on a Thursday night. Warm feel with an entertainer playing some good music. Two of us had the meatloaf and one had the skewers. The meat loaf was great  and just what I needed. The skewers we just ok. Service was excellent, friendly and fast. It's worth a try.",
   "I felt so welcome here.  Live music and yummiest food.  I'm a sutter bug so here are the pictures.  Oh almost forgot you are encouraged to play a instrument or sing.  I had so much fun at Living the Good Life.",
   "Tried some place new. The food was ok, small portions. One pork chop and a scoop of mashed potatoes for a large grown man wasn't a lot. He ended up ordering a half order of chicken livers also. So if you are into that they have them! I felt like we were the youngest people there and we are late 40s. It was VERY loud and noisy though coming from the other patrons so we were sure to leave before the live music started and it got any louder. I am not a boring ol' bitty by any means but, it was just a bit much when you are trying to relax and enjoy your dinner and have a conversation that's all I mean. The owner's father was there, forgive me I have a horrible memory, and he was awesome and so was our waitress. Maybe one day we will make it back in again...",
   "Friendly staff, good selection of food and drink. Entertainment too!",
   "Popular local restaurant and club. 40 plus crowd. The dinner menu is robust. The band were good and knew how to keep the crowd engaged and dancing. They offer live music outside most every night during the summer.  Give them a visit."
  ]
 },
 {
  "name": "The Union",
  "address": "302 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/07f904de-932f-11ea-b7cb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12876097045107841063",
  "source": "GoogleMaps",
  "reviews": [
   "A fun atmosphere in downtown Carson. We had the ahi nachos and the bee sting pizza. The Serrano peppers were HOT but it was a nice complement to the honey on the pizza as well. I would definitely go back.",
   "Ryan who took our order and brought out our food gave exceptional customer service !\n\nDid curbside pick up...brussel sprouts were AMAZING, empanadas were SO good...especially the cilantro sauce! Husband loved the Frank's Wings and the 3 Little Pig pizza was very good. We do date night every week even with the pandemic, and I have to say this was the best food we have had in a LONG time! \n\nWe will be back! Thank you for giving us this option for take out!",
   "The Union in Carson City, Nevada is a great place for a fun, laid back dinner. They serve their own beers plus other popular beers from area breweries. The food is fantastic! The soups are all in house creations using locally sourced ingredients. The burgers are made with locally raised beef. When you are given the choice between soup or fries, GET THE SOUP!",
   "Everything here is freshly made, even down to the sauces. Expect a fresh spin on the classic ranch, ketchup and other classic sauces that you normally associate the flavor. Most of the food items I have tried have had unique and delicious flavor. You wont find flavor like this anywhere else in town. I was really in the mood for fries and their fries were beautifully spiced with a subtle hint of garlic and herbs. \n\nOur waiter, Kelson, was on top of it. He made our experience relaxed and took care of us when necessary. \n\nMy boyfriend liked the beer, but wishes the menu more clearly defined if a beer was amber, blonde etc. The first blonde he ordered was really rather dark. \n\nOverall great beer, great food, great atmosphere. Good casual, laid back place. They also had some games on, which I quite enjoyed. It gave it a classy sports bar type of feel.",
   "Awesome atmosphere and wonderful, locally sourced food. Try the Bee Sting pizza and the Dirty Duck Fries."
  ]
 },
 {
  "name": "El Aguila Real Mexican Restaurant",
  "address": "3220 US-50 #6, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0841834c-932f-11ea-adfa-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=594159790467613626",
  "source": "GoogleMaps",
  "reviews": [
   "In my opinion, some of the best beans I've ever tasted. Service was top notch, attentive and very polite. Authentic, great atmosphere, and huge portions at great prices.  Do yourself a favor...the beans alone are worth it.",
   "Delicious food , fast and friendly service, always a delight.",
   "The service here is so quick!! The servers are really nice and the food is served super hot. Last time I got a chicken and beef enchilada during the lunch. I like that their salsa is spicy too. A lot of other places serve really bland, mild salsa, but this one had some kick!! They also serve a bean dip to go with your chips, which I love. The food is yummy and you aren't left waiting for service. They have good lunch specials!!",
   "Mexican food is our absolute favorite. We've eaten at hundreds of different restaurants throughout the Southwest over the years. El Aguila real has the best refried beans we've ever tasted, and the rest of the fare is just as good. Highly recommended.",
   "Fabulous food, great service and fair prices."
  ]
 },
 {
  "name": "Joanie's Creekside Cafe & Catering",
  "address": "1795 E College Pkwy #100, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/089355b0-932f-11ea-9d35-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5979927583742935646",
  "source": "GoogleMaps",
  "reviews": [
   "3 stars since service was good (thanks Jessica). Had the Mediterranean chicken wrap with homemade potato salad.  Look at the wrap... the sliver of chicken is at the bottom.  This was a lettuce salad with a very small amount of chicken.  The potato salad was really good. Can't speak of other dishes since this was the first time I've been here. Really not impressed with the wrap.",
   "The food was teriffic. My friend  took me for lunch, I had never been. I had the Acorn squash stuffed special and a great salad. I can't wait to go back 😋",
   "What a great little find.  Food was really delicious. Presented well. Coffee was hot and endless.  Wait staff was really nice and welcoming.  We will definitely be back. ",
   "The vegetarian wrap was nice. Their desserts are really excellent. The service is surprisingly quick, as you'll see most clientele on weekdays are state employees, this is much appreciated!",
   "Great food. Great customer service. Definitely i will b back soon."
  ]
 },
 {
  "name": "Firehouse Subs",
  "address": "3120 US-50, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/08f684ae-932f-11ea-ac51-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4429652273410508557",
  "source": "GoogleMaps",
  "reviews": [
   "The first time I had ever been to a Firehouse Sub. I ordered a small engineer sandwich, chicken and noodle soup, and a small drink.\nThe cashier missed my order for the chicken noodle soup, and when my food was brought to me I asked about the soup and they looked at my receipt and even though I did not order it, they were more than happy to correct my lunch. Your line I was also informed that sometime this summer. I really hope so, as my experience in Carson City was awesome. I would recommend this place to anyone, not only because of the food, but they also help support the fire department in different areas.",
   "Drop be through on a busy night, got me through quickly and correctly. Good was great. Good value. Drive thru staff very friendly in high stress environment. Definitely would go back and round up again",
   "Firehouse subs is a wholesome establishment. They support a great cause, with some great sandwiches to back it up. I enjoy Italian sub sandwiches, but they offer a great variety of quick and quality meals. \n\nMy only complaint is that they don't have a buffet style sandwich building line like subway or port of subs. \n\nOh, the salsa is also fantastic.",
   "This was the 2nd time I ate here.The roast beef and cheese sandwiches are delicious.  Great ,fun atmosphere , fast service and friendly service. They heat the sandwiches and that makes the bread soft and the sandwich better than most .",
   "My first Firehouse Subs experience was a huge hit.  Service was fast, food was hot and tasty and the employees were nice.  The restaurant was clean and the TVs were in convenient locations.  Definitely looking to hit up more Firehouse Subs in the future."
  ]
 },
 {
  "name": "Olive Garden Italian Restaurant",
  "address": "4253 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/094eddfe-932f-11ea-9df6-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "free",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5546868768285871643",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for a sumptuous Italian meal. Loved the Shrimp Scampi and Minestrone soup. And the bread, ofcourse, is heavenly.",
   "My partner and I are in town from out of state and decided to stop for dinner. There is not enough words to describe how impressed we were by our server Stacey C. She was funny, sweet, and personable.  She added the perfect ending to a long work day. Olive Garden has an amazing asset in Stacey as any company would be lucky to have her as a server. We felt lucky as guests. Plus the food was great to boot and everyone else was friendly as well. We will be back and hope to have her again. Plus we will toss in a good word to our colleagues who stop to work in the area!",
   "Delicious food, as expected. Their new to go curbside was very efficient and friendly staff as well. Love everything I have tried.",
   "I found out about their take out Service they’re doing during this shut down due to the virus.  So I called and I ordered the two meals.  One of which is hot and one of which is refrigerated for later that day or the next day.   The second meal was free it’s a buy one get one free deal.  My hot meal was so large it actually lasted me for two days plus the free meal. So  I have had three amazing dinners thanks that they’re doing this service.  Amazing!!   Thanks.",
   "Olive Garden is definitely high up on my list. Every meal that I've tried from there is delicious one way or another. The soups are very delicious as well and are unlimited, as are the salads. Service isn't the best, but not the worst either. Definitely recommend this restaurant."
  ]
 },
 {
  "name": "Vino's pizza",
  "address": "3228 N Carson St, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0998b890-932f-11ea-9b91-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=8920417981464460740",
  "source": "GoogleMaps",
  "reviews": [
   "This pizza was so good! Came here on vacation and it was the only place open late. They are generous with ingredients and server was nice and helpful answering questions. Lots of flavor. Tastes good as leftovers the next day too",
   "Food was absolutely amazing! Now the service 🤔 we walked in and it was so nice and cozy and the waitress was not in the conversations mood. My husband kept complimenting the restaurant and the waitress just had this blank stare and I thought maybe it’s the end of the night so it’s fine. A few moments later a couple that is the same race as her sat down and I felt like they got a whole different waitress. I immediately saw the difference as she was standing right by them giving telling them how they run their business (when they didn’t even ask). Anyway she didn’t give us refills or check on us until we asked for the check (tip time) then it was oh anything else I can get you. Well we’re already ready to go so no. It really sucked because we were looking for a good legit high quality place and I guess we didn’t find it. It would have been completely fine if she wouldn’t have given outstanding service to the very next couple after giving us a cold shoulder. I definitely recommend if you are the same race as the waitress but not for anyone else lol. Don’t know what else it could have been 🤷🏻‍♀️",
   "I haven't eaten much pizza since my children have been grown but Vino's has me hooked again. I especially like that ultra hot spicy sauce that they serve. YUM. Everything is always fresh and cooked to perfection. Their service is excellent. I highly recommend them.",
   "This is by far the best pizza you will ever eat. Toppings are generous and well proportioned. Affordable for the quality of food as well. Staff is amazing and friendly. We will definitely be back here again.",
   "So I had posted a review before but then my review was removed from Google for some reason. It won't let me repost from the same Google acct. I was respectful and detailed in my review. But it was removed. Seems like Google doesn't post honest reviews because they aren't highly rated. I've ate here many times. The last 3 times, it's been terrible. Burned, toppings are lacking and pizza has no flavor. Before the last 3 times, it was great. Best in town by far. Everyone has bad days but 3 times in a row!?  I don't know if I'll try it again. The last time, I'd rather have bought pizza from the guy with the orange toga."
  ]
 },
 {
  "name": "Francisco's Mexican Restaurant",
  "address": "1310 S Stewart St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/09e2e124-932f-11ea-b33a-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "food",
   "free",
   "food",
   "delicious",
   "drink",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10881823117953039037",
  "source": "GoogleMaps",
  "reviews": [
   "I eat here approximately 1-2 times a month and they have always been kind and welcoming to me and my family members. The service is outstanding, the food is delicious and I highly recommend the chicken enchiladas which is what I tend to order each time but I have also had other dishes that were also quite good. Try the tacos they are tasty. The food is often served quickly and hot, yet they never rush you out of the restaurant and always check on the table to see if you need anything, which I highly appreciate. If you are looking for good Mexican food with wonderful service, do try Francisco's.",
   "We had great margaritas, entrees and even dessert. We are traveling from Wisconsin and this is one of the best meals I have had. Had mango margarita,    3 enchiladas with different meats and sopapillas.  The free chips were warm and they gave us both salsa and refried beans for dipping. Great prices, wonderful waitress. Highly recommend!",
   "Pick up Order for the carne asada plate and Street Tacos. Awesome food. Very polite staff. Definitely return to try the rest of the menu!",
   "Fast, friendly, and a smile with their customer service",
   "The food was delicious and deserves 5 stars however the service was atrocious and deserves one so I'll split the difference and give them three there was only me and one other family in the whole restaurant and while the food came out ridiculously quickly and hot and fresh it took me 25 minutes to place my order which would still not be too bad but it took an entire meal before they refilled my chips and they never once asked to refill my drink which was empty before my meal even got there and sitting on the end of the table I even flag someone down and ask them to refill it or just bring me a water and they never did"
  ]
 },
 {
  "name": "Pizza Factory",
  "address": "3120 Hwy 50 East, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a2a2b62-932f-11ea-ad9d-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=6543202099899830636",
  "source": "GoogleMaps",
  "reviews": [
   "They gave me the lamest Cesar salad I've ever had. Asked for extra dressing for Cesar specifically and they gave me 2 incorrect dressings. Way over priced for what it was. My Husband liked his lasagna, kind of a small portion, but he said it was \"eh, decent\". \nWe usually go to the one in Dayton & figured we'd give this one a shot. We'll give them another chance since we didn't try their pizza though.",
   "I have been coming to pizza factory for 20+ years and not only have they gotten my order right everytime, they've also been very friendly and accommodating. They haven't changed their recipes so the meat sauce is top notch! Thank you!",
   "They  have many kinds of pizza for choice in the noon buffet.\nCheese and sauce is perfect.\nGood price",
   "Duck coin machine. Plus good salad bar and good greasy pizza. And duck coin machine.",
   "We do like the food and the prices are good, however, no one had a hair net on. The women had long hair and not all pulled Back. The had beards and some with longer hair and no hair nets. I almost didn't order but I can say I won't go back.\n\nand"
  ]
 },
 {
  "name": "Johnny Rockets",
  "address": "4600 Snyder Ave B, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0a7194de-932f-11ea-9506-14b31f159f22.png",
  "tags": [
   "family",
   "delicious",
   "food",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=13651240627742562282",
  "source": "GoogleMaps",
  "reviews": [
   "Tasty hamburgers!! I got the one with jalapeños. The restaurant is cute and 50s retro. The server we had was nice and it had a family environment.",
   "Hamburgers were delicious,  a bit pricey. Frys should be included with the burgers. If they were it would get a 5 star",
   "The spot for my daily milkshake. They have a wide selection of shakes. In fact the shakes have their own menu. They will also custom make any shake you want.",
   "I love this place!! Great atmosphere,  great food and a great staff all make it the nostalgic eatery I crave in every restaurant!! That jukebox is the best!!",
   "The coolest diner atmosphere and best tasting hamburgers and great service. Please don't ever change like your corporate stores as the burgers tase tremendously better here in Carson City, NV. Other Johnny Rockets locations don't come anywhere close to the quality, taste and service here.\n\nGrilled handmade burgers taste better and the deluxe shakes are scrumptious."
  ]
 },
 {
  "name": "Battle Born Social",
  "address": "318 N Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ab99b86-932f-11ea-8414-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "delicious",
   "food",
   "food",
   "creative",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=12073929784819927252",
  "source": "GoogleMaps",
  "reviews": [
   "Amazingly unique drinks and great food really made this place stand out! In the heart of Downtown Carson City, this is a gem of a find. The drinks are different than anywhere I've ever been, and the food is delicious. We stuck to appetizers since we had eaten previously, but they were so incredible, and made fresh! The staff was so friendly and helpful, as their cocktails were so unusual. We will definitely be going back for a girl's night out!",
   "This place is great very low key but good positive energy here i had the bbq beef sliders and they were delicious and very well portioned the waitress was as kind and professional as could be my company loved this place and would and will definitely visit again",
   "Beautiful\nGreat food\nThe best cocktails\nJoe best cocktails  ever\nGreat service\nOur new favorite  it CC\n👍👍👍❤❤👍❤👍",
   "Food is terrible. I ordered the hotdog and they were out of some of the ingredients that were listed on the menu, they brought it to me anyway maybe thinking that I wouldn’t notice? But as I stared down at my dried out, shriveled hot dog, on a dry bun, I was immediately disappointed, and the waitress who saw it on my face just hurried off to see about getting me some condiments, which they were out of. Neither the waitress nor the manager who both knew that I was not happy with the garbage food they served me offered any discount on my $13 hot dog. Weird place, never returning.",
   "What a phenomenal menu! Incredibly creative small plates. Though priced a bit high, it's a great, fun time trying new combinations of dishes. We LOVED the crawfish mac 'n cheese, and they did not skimp on the crawfish! The shrimp po' boy was LOADED. The espresso braised brisket over a bed of risotto was, shockingly, bland; perhaps a stronger taste in the glaze, or more seasoning on the brisket? The staff is incredibly friendly and knowledgeable."
  ]
 },
 {
  "name": "China East",
  "address": "1810 Us Highway 50 E, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b02d5e8-932f-11ea-9e0f-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13511136436564839632",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food and service. The restaurant has A rating from the health inspector.  The food arrived at the table very fast. We enjoyed our meal. We had pot stickers, sweet and sour trio, and egg flower soup. We had lots of leftovers!  If you're in a rush, you can order at the drive up window. We will definitely go here again!",
   "Not bad. Generals or sesame chicken is pretty good and the hot and sour soup is good. Price is reasonable.  Place could use a good cleaning as the tables always feel sticky...the place has gone up and down in quality over the years. I don't know if it is due to a change in staff or what so it is kind of hit and miss. But for the price it isn't bad for lunch or to take the family.",
   "Number one I don’t think my husband got what we ordered. I had chicken chow fun and it’s not anywhere near as good as China East. I ordered six piece shrimp so that we could have it over $25 for delivery and they were cooked to death and hard as a rock and I couldn’t even taste the shrimp. I doubt we will try them out again.",
   "Really enjoyed some great Chinese food! The pork egg fu young was amazing , but you forget to give us forks to eat !! We’ll be back and will double ck on utensils!!",
   "As native Nevadans we've been eating here for years . We've never had any complaints and have always enjoyed our food. We recommend this place to anyone ."
  ]
 },
 {
  "name": "Flavors of India",
  "address": "1105 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b4bc5ec-932f-11ea-8504-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8254368383695454618",
  "source": "GoogleMaps",
  "reviews": [
   "Most authentic Indian food ever.\n\nSeriously come down from South lake Tahoe to experience this food.\n\nThe atmosphere is of classical India\n\nAnd beautiful\n\nFor weddings events parties\n\nI could go on and on why this should be your first stop in Carson!\n\nThe owner is wonderful and this is a complete labor of love\n\nThere should be one of these in every village in America\n\nFlavors of India 2020",
   "The food is great and they vary the selection from day to day.",
   "The service was great. That is so important. The problem was just is they had no dishes except one desert that weren't super spicy and plain rice. I've eaten at Indian restaurants before and always been able to find something to eat that wasn't too spicy. We were there for a birthday celebration so I had no choice but to stay.",
   "Arrived at 1:30 p.m. right before they closed down the buffet. I have been to tons of Indian food buffets but I must admit, all of the food was fresh and delicious. The butter chicken and tandoori dishes were delectable,  \nAs well as the lentil and cabbage dishes.The mango lassie drinks  were superb.",
   "I came here about 5 months ago when I was in town for work. Came back today to try the lunch buffet. Service was just as great as the first time and the food hasn't changed a bit either. I highly recommend this place. Great food wonderful service."
  ]
 },
 {
  "name": "Juan's Mexican Grill",
  "address": "3680 Goni Rd, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0b983898-932f-11ea-870a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9486568312310219543",
  "source": "GoogleMaps",
  "reviews": [
   "Food is good, been eating here for 5+ years, consistency of food taste has improved in the last year.",
   "Best food best host!!!",
   "Amazing food! Went here for the first time and everything was awesome, service, atmosphere and food! Owner is great!",
   "I went here as a visitor from California. The portion sizes were huge, the food was edible but the service was a little slow and uncoordinated.  Over all I'd recommend this place for a heafty meal and would side step it due to service.",
   "The people are so friendly! Food tastes great, and all around an enjoyable atmosphere."
  ]
 },
 {
  "name": "Playa Azul Méxican Restaurant",
  "address": "415 E William St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c074e46-932f-11ea-8b8e-14b31f159f22.png",
  "tags": [
   "delicious",
   "walk",
   "eat",
   "food",
   "food",
   "drink",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16992017095987575908",
  "source": "GoogleMaps",
  "reviews": [
   "I was disappointed. Nothing in the tacos but meat and beans? The al pastor and asada were ok. The pork was pretty dry. Eh.",
   "This little place has absolutely delicious food at a good price as well. I would eat here often when I lived in the area. It was such a good memory eating here again while in town. Thank you Playa Azul for the delicious meal and walk down memory lane. You still got it and are exceeding customers expectations. Keep up the good work and don't ever change.",
   "Fantastic authentic Mexican food! There's a reason why this place has been here so long. The food is good and the service is great. They are fast and perfect for a super quick and tasty bite at lunch. I highly recommend this place for casual eating.",
   "Excellent authentic enchiladas.   Fourstars, because they do need more drink options.   ,",
   "A great place, blue mission style brick building  back when it was a taco bell. We love the hard to find sopes, which, with a cheese enchilada a la carte is filling and delicious. The unknown sauce on the sopes looks like sour cream (crema), but it isn't, I forgot to ask what it is."
  ]
 },
 {
  "name": "Yang's Kitchen",
  "address": "111 E Telegraph St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0c73c25a-932f-11ea-99fb-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6564158329556451583",
  "source": "GoogleMaps",
  "reviews": [
   "One of the better Chinese fare in town.",
   "Best place in town hands down, would most definitely recommend as they have both sushi and Chinese food all in one spot! And the sushi was so fresh I was so happy when we left, our family is definitely choosing here for our family nights out!",
   "We had a really great experience here. The servers were very attentive and kind. We had the dim sum combo and the chicken chow fun and it was plenty of food for two people. So delicious! Our 1.5 year old loved the sesame seed balls. I wish we lived closer to Yang's!",
   "There are  6 to 8 of us that go out to a different restaurant every week. We are not always in agreement of the outcome. Last night there were 6 of us and we all raved about the food, the prices, the generous portions and the friendly service. I already had some of my leftovers today at 11:00 a.m. and have enough left for a meal. Good going Yang's Kitchen!!!!!",
   "This place has the best Chinese food in town. This is Mongolian beef lunch. Came with your choice steamed rice, chow main or fried rice. Also soup and appetizes. I had my Mongolian beef extra spicy #10."
  ]
 },
 {
  "name": "Chili's Grill & Bar",
  "address": "3784 US-395 S, Carson City, NV 89705, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0cdf57b6-932f-11ea-9156-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "eat",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7257800826367901131",
  "source": "GoogleMaps",
  "reviews": [
   "There are many dishes to choose. Great service  The staff are very attentive The price is reasonable. Suitable for families. There are many menus to choose from.  Both Mexican food  American food . Modern shop decoration",
   "I found Chili's Grill & bar to be very nice. I had their cheese sliders with bacon. It was a bit too salty for me. But still I did not have to wait, their employees were kind, and most importantly it was clean. A very nice place, I would go for a party. I rate a 8/10",
   "Delicious! Great place to eat. I ordered the 1975 soft tacos, and they were amazing. A must stop and eat place I must say.",
   "Ordered through door dash today. Hamburger only came with 16 fries and half of them were only half size. I ordered their queso salad, the tortilla was hard and salad was so small, barely covered the bottom of the container. There were more tortilla chips in the salad than lettuce. They also gave me only half of a little sauce cup of dressing. Very disappointing.",
   "This place is an amazing place. I always come here to celebrate birthdays with family. I always get the delicious margaritas and the platter of delicious foods. It has a peaceful and family oriented vibe to the place. I always go here even when we go down to Carson. It's one of my favorite restaurants."
  ]
 },
 {
  "name": "La Salsa Grill",
  "address": "963 Topsy Ln #316, Carson City, NV 89705, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d3b24ae-932f-11ea-b56e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10443643112356658246",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing! The Al Pastor is delicious, I recommend the sopes.",
   "Wow, am I surprised!  Pleasantly so. Very good and authentic Mexican food. Nice relaxing atmosphere. Large portions and very good, friendly service. Don't waste your time going to In N Out burgers next door. Your time and money are better spent here in this mom and pop Mexican restaurant. Trust me, you'll be happy you did.  Oh, and the mango marguerita is fantastic!!",
   "Their customer service is wonderful. The food is great. This is one of my most favorite place for posole.",
   "This makes two days in a row of visiting to eat Camarones Aguachile.  Shrimps in lime juice with jalapeno. Spicy, sour, and excellent. I tend to try and order different things each tinge I visit a restaurant, but this time it was a repeat of the previous night.",
   "Good, small place to take your lady (or family) for a true Mexican meal."
  ]
 },
 {
  "name": "Cucina Lupo",
  "address": "308 N Curry St, Carson City, NV 89703, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0d98447e-932f-11ea-92cd-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2032665823393777457",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful new addition to the Carson City restaurant scene.  The staff, the design and the ambiance were 5 star, our dinner entrees didn't meet chef Mark's usual standard.  But I'll be back, and I imagine these are new opening kinks which would work out.",
   "Service was amazing, everyone is very up beat and happy. Food was absolutely wonderful! It's nice to have more GOOD food restaurants in Carson. I don't mind paying a little extra when the food is good! Highly recommend.",
   "Me and my husband had an amazing Valentine's Day dinner. The 3 course special and desert was to die for. Great staff and service. Thank you James for giving us the VIP treatment and squeezing us in to your sold out night. We will for sure be back again many times",
   "We ate our amazing food so quickly, I didn’t get photos fast enough! Some of the best Italian food I’ve ever tasted anywhere, including Italy 🇮🇹, New York and SF. Pasta is house made and fresh - it is AMAZING! Pasta dishes are large enough for 2-3 people. Delish salads and appetizers. The house red is $7/glass and wonderful with food. I wish this place was in Denver. I’d eat there several times a week.",
   "Went for lunch. Pricey food. The house made meatballs in the sandwich were bland. Not enough sauce either. The soup was “warm” and the beans were hard (undercooked).  The Caesar salad did not have enough dressing. Another guest had Italian dressing on a salad which was wonderful. The reason for 2 stars.  There were 9 of us for lunch and the consensus was just OK but pricey.   I don’t think I will return."
  ]
 },
 {
  "name": "Bella Vita Bistro & Catering",
  "address": "1304 S Stewart St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0df5ce0c-932f-11ea-a087-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "music",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13518630654910335863",
  "source": "GoogleMaps",
  "reviews": [
   "Quick, delicious food and a relaxing atmosphere. The complimentary chips were perfect with the spicey thousand island dip. The black garlic vinaigrette was especially good. I ordered the grilled cheese with the extra bacon and tomato. They mistook my order but immediately fixed it at no extra charge. I'll definitely be back.",
   "Friendly service, GREAT food and drinks for both lunch anddd dinner I am IN!!  Bella Vita Bistro never, I repeat never disappoints when it comes to service with a smile along with delicious food and drinks.  Whether you choose one of their House Specialties or the Special of the Day you will be veryyyy happy!  \n\nWe LOVE the little details of when we come in to eat that you are greeted with a bottle/carafe of water for the table along with house-made potato chips and parmesan garlic aioli dip that are absolutely deLISH!!\n\nSOOO happy that they are open for dinner again with their full regular menu available along with an extended after 4pm menu anddd be sure to look for Daily Specials.  We LOVE the Pasta Specials and the Steamed Clams are TOO DIE FOR!!  Have to mention their Weekly Specials like Ladies and Guys night for different yummilicious Martinis and Smoked Whiskey Cocktails.  The Heirloom Bruschetta was absolutely deLISH with the Hot Truffle Pub Cheddar Cheese Dip with Pretzel bites and Baguette slices just being the OMCheesy goodness that I was craving!!\n\nLunch is ALWAYS quick for a meet-up during the week whether with a co-worker, friend or my hubby to grab my go-to of either the Big Bird Sandwich or Pear Gorgonzola Salad both are yummilicious!!\n\nLook forward to popping in to Bella Vita to check out Friday Night Live Music and to nosh on another OMTASTY meal.",
   "Letty and I had dinner here. The food was okay but the place was pretty empty. By the time we left a few more guest came in. Hopefully, when you go there are a few more guests there.\nEnjoy.",
   "Extremely good and a great way to spice up your lunch rush amazing service and awesome food 10/10 would go back again",
   "Great food and service"
  ]
 },
 {
  "name": "Panda Kitchen",
  "address": "1986 US-50, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e42b5c2-932f-11ea-9ced-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "eat",
   "food",
   "music",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6592123165612757905",
  "source": "GoogleMaps",
  "reviews": [
   "Best Chinese restaurant in Carson City! The service has always been consistent and friendly. They're fast and the portions are HUGE. I'm always so full that I am almost crawling back to the car! They also have the best pot stickers in town. Also, order the lettuce wrapped chicken...you won't be disappointed!",
   "I was honestly very skeptical about trying Chinese food in Carson City, NV. Having lived close to Houston most of my life, I'm no stranger to good Chinese food. \n\nThis place serves pretty good food. \n\nTheir chicken items were perfectly crispy on the outside and juicy on the inside.  Their hot and sour soup was good. \n\nNote: things that are labeled spicy aren't that spicy. I added chili sauce (ask for it), which gave my food some good heat. \n\nI would definitely eat here again.",
   "Very good food, polite workers who let you eat in peace. Very cold temperature wise which left the last bit of my food cold. The will do no eggs in fried rice on request. The ambiance and mood feel relaxed some of the music was to energetic for the setting.",
   "This was a great lunch date! The host/server was exceptional! He recommended the daily special, and it was superb! He was attentive but not overbearing. He asked how we liked the food, to which we said it was great, he then told the cooks in the back who then thanked us for coming in and and were very appreciative for the feedback. We will be returning. They have new new owners so give them a shot if you haven't been to Panda Kitchen in a while.",
   "Pleasantly surprised to get all homemade food here. The soup was amazing!  Dont order more than one type of brown sauce chicken at once, as ours all came out the same. Still dying to try the general chicken! We ordered general and orange, and sweet and sour chicken, and all basically came out as the same dish, but that dish was excellent. Will happily go again and try again haha. Not the best service, but the food more than makes up for that. Server was very nice, just not efficient."
  ]
 },
 {
  "name": "Tito's Restaurant",
  "address": "444 E William St, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0e8f0130-932f-11ea-bf83-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6941540881517333818",
  "source": "GoogleMaps",
  "reviews": [
   "There are a Group of us that often go there and we are treated so well. The food is terrific and the prices are competitive. I love the shredded beef tacos ❤️😋🌮",
   "Great combination of tasty Mexican and seafood. I would highly recommend you visit Tito's.",
   "The BEST food going. Don't be deceived by the name- you can get crab louie, prime rib and so much more. The chips and salsa are authentic and just plain good. If they sold by the jar (salsa) and bag (chips), I'd be all over it. They also make one of the worlds best bacon cheeseburger. No joke. The patty is perfect, the entire thing just compliments itself. I would consume daily if I was a local.",
   "There is no better Mexican food than Tito’s.  Tito’s is the BEST!  Been eating there since 1989 when they opened their doors.  Love it.  You can’t go wrong.",
   "Food came very quickly before margaritas, was good just seemed like the orders were pre-made and heated up or something."
  ]
 },
 {
  "name": "QDOBA Mexican Eats",
  "address": "933 Topsy Ln Suite 420, Carson City, NV 89706, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0ee55a12-932f-11ea-82ed-14b31f159f22.png",
  "tags": [
   "eat",
   "cheap",
   "food",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=599491740494374946",
  "source": "GoogleMaps",
  "reviews": [
   "Foods decent. But everytime I get something hot, like steak or chicken tacos, it's cold by the time I sit down and try to eat it at the restaurant. Not sure how, when I just order meat and cheese on a corn tortilla.. it's saddening. I would expect it to be hot or at least warm enough to melt the cheese.",
   "High rating for commercial fast food. Good cheap decent quality fast food when your on the go.",
   "Good food. Always enjoyed it. A little disappointed that you can't get naked burritos (burrito bowl) as a kids meal anymore. That was a favorite with the littles.",
   "SO DISGUSTING!!! I ordered a veggie burrito for pickup from this place and when I took the first bite I noticed the longest strand of hair inside my food. I tried to pull it out to take a picture but I couldn't because it was wrapped tightly around the contents of the burrito. Not that I would ever want anything from this repulsive place, but when I called several times to complain no one answered. Wish I could give them less than 1 star — disgusting!!",
   "Pretty good food. Fast service, clean place, nice atmosphere. A little on the high price"
  ]
 },
 {
  "name": "RIVAS MEXICAN GRILL #9",
  "address": "557 S Saliman Rd, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f2af938-932f-11ea-92b1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13058930031281780455",
  "source": "GoogleMaps",
  "reviews": [
   "I meet a friend here. This was my first time here. The food was good and the service was good. I would like to go back and try other dishes to give a better review. But for now give it a try, ill be back.\nEnjoy!",
   "Best Mexican food in town!! Really recommend it",
   "Good service friendly staff food made fresh good big platters extremely attentive and I like that they have a drive thru. I'll definitely be ordering again!",
   "Really great Mexico food. I had the steak fries. Portions are big for the price to me.  It is made to order, so don't be in a rush.",
   "The food is really good to my personal taste buds. Was a little disappointed when I called ahead to order for pick up, and they didn't start it until several minutes after I arrived. I will still go back for more!\nBeen back multiple times. This has become a favorite for myself and co-workers!\n\nEdit since original post: call ahead orders have been ready for pick up when I arrive, and the food is still amazing!"
  ]
 },
 {
  "name": "Taqueria La Salsa",
  "address": "1946 E William St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0f8611ba-932f-11ea-8513-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4724893150682157044",
  "source": "GoogleMaps",
  "reviews": [
   "good mexican restaurant with decent prices. \nmost of the food was great. customer service was good. chairs, tables are not so great.",
   "I was very happy with the overall experience eating here.  Great menu selection with good prices.  Their food is light without a bunch of salt.  I'll definitely be returning again...😎",
   "Food was great and authentic.  Service was excellent. Very nice people who run it.",
   "You can tell they actually put effort into their food. The shredded beef is amazing, actually all their food I have had is great. Our go to Mexican restaurant in Carson. Great prices as well.",
   "Absolutely delicious food! Real tacos! Loved the carnitas and al pastor tacos, and the wet burrito. The food looks authentic. The tacos are properly sized and are served on double corn tortillas. And everything tasted great! This is a real mexican food gem!"
  ]
 },
 {
  "name": "The Fox Brewpub",
  "address": "310 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/0fccbd18-932f-11ea-b7d8-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7644541041838815415",
  "source": "GoogleMaps",
  "reviews": [
   "Great eats and the beer selection is amazing! Service is quick and friendly. The potpie is huge! 😂",
   "Ordered out during quarantine and they are amazing.. Thanks guys",
   "Always a good time. Good beer. Good food. Good people. 🍺",
   "Very solid beer selection, they make a competitive IPA and their pills or is actually decent. We had their fried pickles, perfectly cooked. Not greasy not heavy excellent taste. Will definitely be back for more. Person said he’s moving up the ladder. Thank you",
   "Amazing food, great atmosphere and awesome service. My husband and I were getting tired just watching the waitresses zooming back and forth working hard to be sure everyone was taken care of. My husband had the ribeye steak with garlic and rosemary. It was perfect. I had the Santa Fe chicken salad. The chicken was seasoned and juicy and the dressing was great and there was a perfect amount. Ended the meal with the brownie sundae. Yum. We’d definitely come again next time we’re in Carson"
  ]
 },
 {
  "name": "The Red Hut Cafe & Soda Fountain",
  "address": "4385 S Carson St, Carson City, NV 89701, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/101f230c-932f-11ea-9460-14b31f159f22.png",
  "tags": [
   "food",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8205713517137657395",
  "source": "GoogleMaps",
  "reviews": [
   "I'm giving it four stars, since 3.5 is not an option. The atmosphere is the typical diner vibe. They want you in fast and out fast. With it being my first visit, I had a hard time contemplating what to order. Your have a choice of your basic breakfast options, or your basic lunch options. The place is clean and the staff are friendly. -Regina",
   "Slow service but the food more than makes up for it. The waitresses are very nice though.\nGood specials are great very good pricing. Lots of bang for your buck.\nNice place very cozy place\nIce cream specialized coffee that they serve. I went for breakfast but noticed they do these 2 things though.",
   "This place is awesome, love all the pictures and old original art. Food is really good and the portions perfect, not much and not to little. Just right in my book.",
   "Very good breakfast and the coffee was surprisingly rich. Not like the usual brown water served at most diners.\nThe price was a little on the high side for Reno/Carson but worth it.",
   "I love a good diner!"
  ]
 }
]