[
 {
  "name": "Capitol Market",
  "address": "800 Smith St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/106a35dc-932f-11ea-a35d-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "walk",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13693870194996281418",
  "source": "GoogleMaps",
  "reviews": [
   "Welcoming and clean. I always enter on the far end and stroll my way through. They have such a variety of foods. The cheese selection is one of the best in the country and they offer suggestions of pairing with an amazing array of wines from all over the world. The fresh meat and fish are spectacular....and if you want to just sit and have coffee and people watch this is a great spot. SoHo is an amazing restaurant and the frittata is massive and delicious. The wait staff delightful and the manager, William a gem. \n\nEverytime I am in Charleston this place is on my MUST GO places. It should be your also. PS right across the street diagonally is an amazin Bread Store too with gluten free options that rock.",
   "The capitol market is a lovely place to buy locally grown food and other plants. I would definitely recommend visiting! The vendors are lovely and the selection is large. It’s a nice place to walk around even if you don’t plan on purchasing anything. My only complaint is that parking can be an issue depending on the season. Otherwise 10/10 would recommend! :)",
   "Friendly family type atmosphere.  Great food.  You have to try the fish dinners!!!   They have everything.  Lots of West Virginia crafts including books and locally grown produce.  If you go you will love it and will go back.",
   "Love shopping here. All the indoor and outdoor shops and vendors are super friendly and helpful. They will literally take the time to help you find exactly what you are looking for.",
   "I loved this market. It is definitely a diamond in the rough. It is bright,fresh,clean,and busy. I started with getting a salad from the purple onion and I also purchased the best honey crisp apples ever, I then went to Mecca Coffee and Holls chocolate. The people were all so polite and helpful with the exception of the sales employee at Holls. Their chocolates were amazing so it made up for a rude employee. This market also sell wine,fresh,fruits and veggies,houses a restaurant,sells fresh cute meat,seafood,and sushi. I will definitely come back during my monthly business visit.\nEnjoy the photos!"
  ]
 },
 {
  "name": "West Virginia State Museum",
  "address": "1900 Kanawha Blvd E #435, Charleston, WV 25305, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/10bbd892-932f-11ea-8135-14b31f159f22.png",
  "tags": [
   "creative",
   "walk",
   "history",
   "free",
   "history",
   "walking",
   "walk",
   "kids",
   "history",
   "library",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8972947195664183232",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing museum that tells West Virginia's history in a creative and fun way. Following the timeline and seeing the scenery change as you walk through was really fascinating. On top of that, there are areas with artifacts that you can step off the timeline and view. I do wish that the artifact rooms didn't make you jump past parts of the time lines at times and that there was a way to reset the speaking, as sometimes you'd trip the sensor for the next part before you were done with the last one.",
   "Incredible museum showcasing the amazing history of West Virginia. The quality of displays and artifacts is outstanding, especially considering the admission is free! You could spend hours upon hours walking this museum and still not see everything. You can tell they really care about the museum and have put a lot of time and effort into it. Quite an exceptional place.",
   "This museum has a great collection of exhibits with an interactive walk through format. Be sure to make time for the various short films and interactive programs in each exhibit that flesh out the history represented by the objects in the cases. Kids have a chance to get more involved by completing a scavenger hunt!",
   "I visited the Genealogy library at the Cultural Center.  They have an excellent array of vital documents, wills, newspapers, land records. Etc plus reference materials. Watch out for the parking police!",
   "I took my teenaged son to the museum while we were in the area to visit my father over Christmas. We were both overwhelmed by the attention to detail everywhere we looked within multiple VAST displays of West Virginia history! Before arriving, I was seriously expecting a long boring walk highlighting the finer points of the coal industry (no offense). But this place completely blew me away! The museum does feature several displays on the history of coal mining, it's a rich part of the state's heritage, but the presentation goes exceedingly beyond mere coal. Featuring civil war relics, the humble beginnings of the emancipation proclamation, President Lincoln, Daniel Boon, Byrd, Yeager, the state police, crafts, all the way back to geological specimens AND MUCH MORE (including a robot). Stop by if you're curious and in the area, expect to spend a couple hours. My son and I both want to go back so we have more time."
  ]
 },
 {
  "name": "Heritage Towers",
  "address": "612 Virginia St E, Charleston, WV 25301, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=3295630173282979527",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Criel Mound",
  "address": "301 7th Ave, South Charleston, WV 25303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/10fdeaba-932f-11ea-9bfc-14b31f159f22.png",
  "tags": [
   "unique",
   "structure",
   "history"
  ],
  "link": "https://maps.google.com/?cid=11739502472921694414",
  "source": "GoogleMaps",
  "reviews": [
   "Criel Mound in South Charleston WV is a Sacred Burial Site  where the Indians were laid to rest in this mound formation.\nMany people visit this historical site to see this amazing structure and read the provided information about it.\nThere is stairs that go up to the top to get a scenic overlook and a bench to sit on to rest or take pictures.\nThis is a unique place to visit and even have a afternoon 🧺 picnic.",
   "Love discovering ancient earthworks and burial mounds. Should not have brought the child... she spilled a bag of Doritos all over the top of the burial mound, we cleaned it all up but I am now waiting to see if she is haunted.",
   "It is amazing to interact with a pre-historic monument right in the center of South Charleston. I am sad that so much the great ceremonial mound village in Dunbar and South Charleston is now lost to us. Take care and honor the aspects of it that are left.",
   "It certainly is an ancient burial mound. Definitely a cool visit if you're already in the area for the purpose of experiencing history, but its closeness to modern things like Dollar General I find a bit jarring.",
   "Great information explaining about the Criel Mound around the site. My issue is all the litter that was on the grounds. You can visit this site in less than thirty minutes.  I learned a lot about these native Americans and their way of life in this region."
  ]
 },
 {
  "name": "Magic Island Park",
  "address": "Berkeley St, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/114ef11c-932f-11ea-9451-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11799017532729106461",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place for kids to play. Splash park is awesome. They have shade umbrellas. Nice walk by the river. They only had the mens bathroom unlocked but it was very clean.",
   "Nice place to sit and gather your thoughts",
   "Nice place to walk,run,or just relax and let the kids have FUN!! FREEEEE (Because EVERYONE likes FREE)✌️❤️🧘🏃👨‍👩‍👧‍👦 FOR ALL AGES 👏👏",
   "This is our go to place for flying kites! We love flying kites and it's the perfect spot because of the wind and open space. We can also take a break and swing in the swings or use the splash pad.",
   "Me and my love would go there all the time to walk, throw frisky, and hang out. It was such a nice place!!"
  ]
 },
 {
  "name": "Locked and Coded Escape Rooms LLC",
  "address": "222 Kanawha Blvd E, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1196cfc2-932f-11ea-81e4-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=13324922118778964747",
  "source": "GoogleMaps",
  "reviews": [
   "I have meant to do this review for sometime.  We were in town for other business.  Saw there was an escape room.  So we decided to try them out.  We did Hunters Revenge and Wicked Cavern.  I myself have done well over 200 escape rooms all over the world.  These rooms were well thought out.  The immersion was very good.  I highly recommend if your in WV.  Trying them out.  It will be well worth it.  Thank You Locked and Coded for the great time and the Owner was awesome.  I am sorry I can't for the life of me remember your name.  But you were awesome.  We will be back.  When were back in Charleston.",
   "Stressful and fun experience for the whole family. Really appreciate the time we spent there. Super nice and helpful owners.",
   "Rooms are extremely well done and very challenging.  The owner was super nice and gave us a sneak peak at the other rooms when we finished. Highly recommend if you are looking for something new and different to do!",
   "It's been a while since I've been there, but they put a lot of effort into their escape rooms and I would definitely recommend them!",
   "Great place for a group event! Our group of teenage boys had a blast getting out of jail!"
  ]
 },
 {
  "name": "Sky Zone Trampoline Park",
  "address": "500 Southridge Blvd, Charleston, WV 25309, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/11e9f936-932f-11ea-89e6-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "art",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7976067102817589548",
  "source": "GoogleMaps",
  "reviews": [
   "Overall great for kids! Saturdays can be jam packed. I recommend purchasing in advance online and make sure the waiver is current. They have a dedicated line just for that and you get through much quicker.",
   "I've already reviewed this indoor park. A clean, friendly environment for kids to exercise and meet new friends. What's not to love? The price. $16 an hour. A little more expensive than the movies but the exercising is priceless. There's space for toddlers too, so children of all ages (and adults too) can enjoy the art of jump. :)",
   "We brought a group of 55 middle school students from 1.5 hours away and Sky Zone was really phenomenal to work with!  Leading up to the actual trip I gave a best guess on our amount of jumpers so I was trying to update Sky Zone as best I could and they just really rolled with it and helped us so that everyone was able to jump.  The check-in process took a minute but only because there were so many of us, they really were patient and helpful with us.\n\nPlus the variety of options to jump was really great.  They had a rock wall, two obstacle courses, and a toddler area.  In addition to various other jumping options.  Overall I was really impressed and appreciative of Sky Zone taking time to work with us and get us all ready to go!",
   "Took my son and some friends here for the first time and loved it! There were several different areas to explore and was well staffed to accommodate the crowd. The clerk at the front desk was very informative!   Fun for all ages!!! Will definitely be making another trip down.",
   "Good food, lots of exercise.  Staff Is very attentive.  I wish they had some security."
  ]
 },
 {
  "name": "West Virginia Governor's Mansion",
  "address": "1716 Kanawha Blvd E, Charleston, WV 25305, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1257133a-932f-11ea-8e5d-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11813725603398885180",
  "source": "GoogleMaps",
  "reviews": [
   "Located next to the capitol building. Easy access for visitors at posted visiting hours.",
   "A SPLC-designated hate group was allowed to set up in the capitol building during West Virginia Republican Party Day. They put up hate posters. No one stopped them.",
   "Beautiful place",
   "Refresh the mind after visiting this place.",
   "In the historical district around my dad's apartment complex. I used to love the beautiful scenery of the archaic homes. The purple accented one is amazing. I hope to one day have a house as beautiful and eccentric as that."
  ]
 },
 {
  "name": "Coonskin Park",
  "address": "2000 Coonskin Dr, Charleston, WV 25311, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/12a3aca4-932f-11ea-a253-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "walk",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12738950575315418411",
  "source": "GoogleMaps",
  "reviews": [
   "Coonskin is good recreational area for our community. It could be managed better.\nFor example, great trail for biking and walking to downtown Charleston, but the excavation equipment has prohibited our access.\nI have to carry my bike over mud and water to access the trail. Just a 3’ path of boards would open the trail. Sorry I am biking elsewhere.",
   "Beautiful scenery, clean and cozy atmosphere. Love going to just drive around and breathe in the surrounding s. They have a decent golf course, paddle boats that you can rent . The oak room is available for the public for rental fees, for special occasions.  Great people.",
   "Love to walk and picnic here.  Always went as a kid to ride bikes.  Fairly quiet and clean.",
   "A wonderful place to hike around. If you are looking for the exact location of the grotto/waterfall put these coordinates into google maps: 38°23'05.4\"N 81°34'29.9\"W.  It's just off the Mary Knight or Oak trail.  You can enter off Henry C. Shores Dr. and enter the road that states \"Areas 6-20\" (38.383639, -81.580449). You will see benches on the left and can park there (38°23'06.8\"N 81°34'40.5\"W). Walk on the dirt road which curves around the right but don't follow it all the way to the building. Once the you see the building at the same level as you, head towards the first set of coordinates towards the grotto and you'll see some stairs which give access. :-)",
   "Coonskin has changed a lot since I was going there since early 70's. Still a great place. Saw 2 family soldiers off to deployments to middle east. Both are WV Army National Guard. One is seasoned veteran and one is first time deployed. A great place to celebrate their deployment of service with BBQ and family fellowship."
  ]
 },
 {
  "name": "Charleston Convention & Visitors Bureau",
  "address": "800 Smith St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/12e7eaf6-932f-11ea-9d1f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "art"
  ],
  "link": "https://maps.google.com/?cid=14313232807343954915",
  "source": "GoogleMaps",
  "reviews": [
   "It was very enjoyable. Food was excellent and presentation was very eye appealing. Job well done.",
   "Ate at the restaurant SOHO. Excellent food.",
   "Very friendly people working there and not too bad on the prices",
   "A wealth of information.",
   "Product: Charleston, West Virginia is a beautiful city that has a lot of the big city amenities without the big city issues. The CVB is a great organization to help showcase and assist.\nPeople: Knowledgeable,  experienced and helpful.\nPlace: Charleston, WV is a great place to consider for your event (s)\nNew state of the art Civic Center to be completed in 2018."
  ]
 },
 {
  "name": "Clay Center’s Avampato Discovery Museum",
  "address": "1 Clay Square, Charleston, WV 25301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/132b8402-932f-11ea-9be1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=18040377068887084288",
  "source": "GoogleMaps",
  "reviews": [
   "My son had a blast. Will definitely go again.",
   ""
  ]
 },
 {
  "name": "Little Creek Park",
  "address": "1 Little Creek Park Rd, South Charleston, WV 25309, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/137b3094-932f-11ea-bb99-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "hike",
   "nature",
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=4994811836865581320",
  "source": "GoogleMaps",
  "reviews": [
   "A park that offers so much for every age group that\nhave beautiful trails for your family and your dog.\nPicnic shelters for parties or family reunions (i think you have to reserve) \nSoccer and baseball fields are always groomed perfectly.\nThen there is a track for kids to race the go carts supervised and it been there for over 50 years\nThe bathrooms at little creek park are always clean and sanitized which is so important. \nIve probably missed something because they have so much to offer at the scenic family oriented park.",
   "Huge park with something for everyone.  Nicely maintained.  Trails had some beautiful places along them.  Can't wait to explore more next weekend",
   "It was cold (30F), but I enjoyed my nature therapy (hike).",
   "It's a real nice place! They got different shelters that can be rented out and they have bathrooms for each one! There's some pretty cool trails to walk and there's also baseball diamonds. Park seems to be pretty well taken care of. Drove from Ohio to here for a baby shower and it was perfect for what they wanted to do and it accommodated a good amount of people.",
   "Something for everyone! Trails, parks, soccer and baseball, creeks for the dogs... You can't go wrong"
  ]
 },
 {
  "name": "Shoney's Big Boy Museum",
  "address": "1600 Kanawha Blvd W, Charleston, WV 25387, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/13eca588-932f-11ea-a46e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=4146820064542072080",
  "source": "GoogleMaps",
  "reviews": [
   "Was pretty cool.  Some items looked like they'd been stolen.. but wow 1900 locations!",
   "It's a weird pillar with no real access to it. Has some information about Shoney's Big Boy, a coffee carafe and a yo-yo. Worth looking at if you're in the area not worth making a special stop for.",
   "Roadside Attraction if you are really curious about the Big Boy & Shoney's Restrautant Chain.",
   "Barely worth stopping. Two display cases are empty or nearly empty.  There's a \"building,\" a plaque, and one display case with stuff in it.",
   "This used to be a monument to Shoney's / Big Boy. then someone whose last name rhymes with Ways got involved and the thing went sideways .. upkeep stopped, Big Boy filed a lawsuit in 2010 for trademark infringement, now it's 10 years later and it sits their neglected, very sad."
  ]
 },
 {
  "name": "Daniel Boone Park",
  "address": "2901 Kanawha Blvd E, Charleston, WV 25311, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14355062-932f-11ea-ad66-14b31f159f22.png",
  "tags": [
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=3334709275928354188",
  "source": "GoogleMaps",
  "reviews": [
   "Nice clean roadside stop. Saw a boat dock. Also their is a small elevated pier to fish or watch the river roll by.",
   "I've been going here for years! On the weekends my kids love to take bread and feed the ducks. It could use some updates but still a nice to go to!",
   "Not a park. Public Boat launch",
   "Decent place to watch the ducks and I have never had issues putting a boat in there. They try to keep it clean and the law makes a round through now and again. Over all good place.",
   "One of the best places in Charleston to put your boat on the river!!  The dock is perfect, we walk our pontoon right onto the trailer when we are done.  Wish they would unlock the restrooms there more often though."
  ]
 },
 {
  "name": "Sunrise Carriage Trail",
  "address": "746 Myrtle Rd, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14785e38-932f-11ea-8af5-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=11024097310253388908",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely gorgeous trail, with historical ties even, all in the heart of downtown Charleston 💗 very well upkeep and moderate incline but plenty of places to pause and take break along the way. Ill definitely return!",
   "Beautiful little trail hidden across the river from downtown Charleston. The bottom lot entrance is right next to Bridge Rd at the light and can be hard to miss. Well-kept gravel trail is just over a mile round trip and has lots of tree coverage, so it's perfect even on hot, sunny days (can make it a bit dark and creepy when its later in the day though). The hillsides are covered with daffodils in the springtime, and the trail is lined with honeysuckle!",
   "Beautiful place to walk, easy hike. It has a gravel pathway. Overlooks Charleston. Goes all the way up to the old Sunrise Museum (which is now owned by Danny Cline)",
   "Beautiful shaded stroll with lots of interesting natural and historical features.  Great for a quick stroller jaunt...took about 30 minutes down and up at a leisurely pace.",
   "A winding footpath that connects South Hills to the Dickinson Street Bridge, the Sunrise Carriage trail offers a great view of Charleston's downtown at the top and a peaceful, gently sloped hike with benches and stepped cut-throughs. Parking is available both at the top and at the bottom of the trail."
  ]
 },
 {
  "name": "Cato Park",
  "address": "200 Baker Ln, Charleston, WV 25302, USA",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/14da065c-932f-11ea-ab7b-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=722096842538232669",
  "source": "GoogleMaps",
  "reviews": [
   "It's a great little park in the city, archery range, soccer fields, pool, golf course. They've made several improvements the last couple of years! The trails are nice to hike with your puppers too!",
   "Greens are rough but it's 9 dollars for 9 holes and if you want to play 18 it's 13 dollars fairways are in great shape. Great place to play bad golf",
   "Just passed by the golf course. It is well maintained",
   "Always have had a great time there. Life guards have always helped with what ever I needed.",
   "I always go here with my best friend and it’s always great, even when a lot of people are there, you still have so much room to swim"
  ]
 },
 {
  "name": "Joplin Park",
  "address": "Kanawha Turnpike, South Charleston, WV 25303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/152ba59a-932f-11ea-aefd-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "kids",
   "family",
   "kids",
   "family",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7401244708766881604",
  "source": "GoogleMaps",
  "reviews": [
   "I've went to this park since I was a small child. My kids love to take their scooters or bikes here. There's a nice paved walkway around the perimeter for you to walk on with exercise equipment every so many feet. There's a really nice dog park so your furry friends can socialize as well. Our dogs love it! They also have plastic bags to clean up after your dogs so it can be disposed of. There's a nice parking lot, swings, picnic tables, trash cans all around the park, tennis and basketball courts, playground, teeter totters, a huge field and restrooms. Our family loves having picnics and getting into a friendly family game of ball here! I recommend this park to anyone.",
   "The most beautiful Park most relaxing place you ever want to be you can go there anytime any day I highly recommend you take your kids and dogs they have a place for the dogs who played in it's a very good part I'll give it a number one",
   "Fantastic park! Dog area that does not require membership (great if passing through). The path around the park is smoothly paved, and never leaves sight of the play area. It has excersise checkpoints along it. Also, 2 tennis courts and basketball. A great place for the whole family.",
   "This park offers convenient parking.  The facilities include 2 tennis courts, 2 basketball courts, swing sets, a dog park, three covered shelters with picnic tables and several shaded areas to enjoy a summer day.  The park is well maintained and clean, although the bathrooms are what you can expect.  All in all this is a wonderful park to bring your family and children of different age groups will have things to do.",
   "Small playset and swingset with standard swings and a toddler swing. Dog park, tennis courts, basketball courts. Walking trail. Picnic shelters. Large flat area for frisbee or playing catch, etc."
  ]
 },
 {
  "name": "WV Division of Culture and History",
  "address": "Capitol Complex, Building 9, 1900 Kanawha Blvd E, Charleston, WV 25305, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15792d94-932f-11ea-9e8d-14b31f159f22.png",
  "tags": [
   "learn",
   "free",
   "history",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2496361115969632723",
  "source": "GoogleMaps",
  "reviews": [
   "My 7 year old daughter had a blast. It is usually very difficult to gain her attention. If you do get her attention, it's near impossible to keep it for long. From the moment we walked in, we were greeted by Nathan. He was very friendly and made sure that we knew about everything they had to offer. He saw my daughter and told us all about the children's center, a place where she could do crafts and learn about West Virginia history hands on. We were here for nearly 2 hours and honestly could've stayed longer. She had so much fun and loved the exhibits. She wanted to spend all day in the children's center and asked to go back in several times. The entire experience was free and very educational.",
   "Beautiful area to walk around and see history",
   "Loved it!  Great attention to detail and something for everyone.  Highly recommend.",
   "Green eggs and ham yeet",
   "Does a great job telling the story of WV. Great visual scenes, exhibits, and sound effects."
  ]
 },
 {
  "name": "Danner Meadow Park",
  "address": "514 Longwood Rd, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/15c416f0-932f-11ea-b414-14b31f159f22.png",
  "tags": [
   "field",
   "structure",
   "walking",
   "field",
   "kids",
   "walking",
   "field",
   "field",
   "unique",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=11219885543121883633",
  "source": "GoogleMaps",
  "reviews": [
   "Great park! Tons of things to do, lots of room to run, track for walking or riding bikes, hoverboards, etc. Huge, open field. Swings, nice big climbing structure. Shelter. Park is well- maintained.",
   "Really nice park for kids and adults.. the playground has a lot of options for the kids and there's a large field for anyone to run and play and a walking and or running path goes around the entire field.",
   "A nice play area. Tons of slides and climbing obstacles. A little dated and a bit muddy after some rain, but good. A great flat, grassy field and gravel track.  Exercise obstacles on the track, too. Parking above and at park level. Not far from the highway.",
   "Great place for parents and kids. Running track with some exercise equipment for big people, playground for little people. Interesting setting- tucked away on top of a hill in a little sunken field, view of the open sky. Three little stone tables sit under a shelter by the playground. Run around the track or sit in the shade and watch the kids play. Unique park.",
   "This playground is a great place for kids! We found this on a trip from Ohio to north Carolina add a place to stretch... I'd give it 5 stars of there were flushing toilets. The port-a-potties were clean, though. The park seems well maintained."
  ]
 },
 {
  "name": "Wine Cellars Park",
  "address": "Dunbar, WV 25064, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/162bde00-932f-11ea-83f6-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "walk",
   "walk",
   "family",
   "hike",
   "historic",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=904318687492533345",
  "source": "GoogleMaps",
  "reviews": [
   "My first visit to West Virginia and one of the places I sought out was this one. A calm, beautiful portrayal of nature with creeks winding throughout the park. The sound of the running water alone is hypnotic.\n\nAre you a disc golf fan? You can play here inside the park. Challenging hills if you decide to hike up them. An overall gorgeous place to forest bathe. Get outside and enjoy nature in this park.",
   "Beautiful park. It really surprised us how beautiful this park was. We walked by the cellars up a trail and you walk up a hill and there is a beautiful lake. The cellars are historically magical and would tell you so many stories if they could talk. We will be back to explore more of the trails. Also, they have disc golf!",
   "Wine Cellar Park offers beautiful scenic trails, a older playground, a fishing lake and shelter.Its family oriented where you can also walk your dog, have family picnics and hike together.\nThe park has wooden bridges throughout the trail, a historic fort \nwhich contribute to the-rustic look of the park and it’s appeal.\n I enjoy nature very much and finding about this gem of a park was a great find\nI hope you come have some fun at this wonderful place.",
   "Great place for an outdoor family event. We recently held a baby shower there in the pavilion. It was a good afternoon and evening with family and friends.",
   "Nice lake but the landscaping needs work. I expected it to look a lot nicer especially on a holiday weekend."
  ]
 },
 {
  "name": "Mortar Man",
  "address": "108-112 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/16773f78-932f-11ea-b156-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17249959543006694733",
  "source": "GoogleMaps",
  "reviews": [
   "You have to search to find him but once you spot him you have found one of charleston's secrets.",
   "Pretty cool thing to see when there's nothing to do.",
   "Interesting little guy, as seen on Atlas Obscura.",
   "Interesting. Great for city scavenger hunts. Fun to go locate.",
   "If you're in charleston on vacation like i was you know there's not that much to do so if and when you find yourself downtown look for this thing. it's pretty small, but it's worth locating."
  ]
 },
 {
  "name": "Water Ways",
  "address": "628 Waterway Rd, Julian, WV 25529, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/16c45622-932f-11ea-bc73-14b31f159f22.png",
  "tags": [
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=12968374262698662887",
  "source": "GoogleMaps",
  "reviews": [
   "We all had fun they tub ride needs a lil updating, we all have bruises from a week ago. Our backs from it. They need to open the other slides also!!! But a great place to take family!",
   "Great family place but watch the water tub slide , it needs updating. Everyone had bruises on back but was very fun!",
   "Not as bad place to hang out. A little run down though and watch your step. Lots of cracks ok the concrete to stub your toes!",
   "First time at a water park. Was a blast. They even announced to my granddaughter a congratulations on her gymnastics awards. Was great!!",
   "There have ride tube for slide. You have kid pool & adult pool for sperated pool. There have snack. Cash & credit card."
  ]
 },
 {
  "name": "Children's Dentistry: Tracy L Wilkerson, DDS",
  "address": "1400 Kanawha Blvd E, Charleston, WV 25301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/171876b8-932f-11ea-ba6d-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10430278325107721993",
  "source": "GoogleMaps",
  "reviews": [
   "Dr. Wilkerson and her whole staff are amazing! I have never been treated with such kindness and love from any other doctors office. My boys love getting to go to the dentist! Dr. Wilkerson is so gently and amazing during procedures. They are fast and efficient with there work. I recommend them to everyone! As a mom it’s nice to have a staff that loves your kids as much as you do, and this is definitely that staff! It’s a 45 minute drive for us and it’s so worth it!",
   "My boys love going to this office! Everyone in the office is so willing to help, always have a smile on their faces, and do what it takes to get the job done. My oldest has had to have work done and I couldn’t thank Mrs Holly & Dr. Wilkerson enough for the patients they showed him and how fast they work. I wish the office seen adults! I have three children and when I walk in their always asking if I need help. It’s just a all around wonderful establishment!",
   "This office is the bomb dot com. We drive over an hour away for my daughter to see Dr Wilkerson. We love her and the entire staff!! Always so friendly and helpful and VERY VERY patient with my girl who tends to throw a huge fit. By the end of it she’s happy and we’re headed home in a matter of no time. From start to finish of anything she’s ever had done we’ve never been there over an hour and that is a win in my book. I will continue to make the drive to come to this office!!!",
   "We take our four children to Dr. Wilkerson’s office. They LOVE going! And that makes me love taking them. At the last appointment that my two oldest children had, I brought along my two youngest, 3yo twins. My twins were so upset that it wasn’t their appointment and they didn’t get to sit in the chair! The dental assistant that finished first let them sit in the chair and ‘cleaned their’ teeth. It made them feel like they got the experience and it will hold them over until their scheduled appointment.\nAll the ladies in the office go out of their way to make the dentist a fun experience! My kids complain that their appointment isn’t soon enough!",
   "Absolutely love this office, office staff there is so friendly and helpful! Taking my kids to the dentist is never a walk in the park so going there they make it seem so easy and help anytime my kids start throwing a fit! Dr. Wilkerson is the sweetest! Office is super clean and kid friendly! And it makes it much better that they’re quick and get us in there and get the job done! \nI wouldn’t take my kids anywhere else! ❤️"
  ]
 },
 {
  "name": "Saint Albans City Park",
  "address": "71 City Park Rd, St Albans, WV 25177, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/176b2aae-932f-11ea-99ae-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "family",
   "field",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=12093664729267348232",
  "source": "GoogleMaps",
  "reviews": [
   "This is a very clean family oriented park which is beside the kanawha river. You can bring your boat,jet ski or fishing  craft and enjoy a day on the beautiful Kanawha.\nFishing can also be done on the banks mostly catch and release is what i see fisherman doing here.\nThere are two shelters first come first serve where you can have parties or celebrations.\nThe playground has been remodeled with a locked and a padded fence installed and no dogs allowed in that area.\nHowever you can walk your dog on a leash around the park on down the sidewalk path that gives the view of the river and three campsites.\nThe bathrooms are always clean when I’m there \nThey do a wonderful job maintaining and doing upkeep on this Park Come see for yourself if you haven’t been.",
   "This is a quiet place, beautiful & great for a family outing. The main trail has been redone with new bridges, benches & gravel. The only thing I noticed was that the park needed a wheelchair designated trail. That may be in the future plan.",
   "Lots of trails—more than you might realize unless you do some exploring. Saw a good variety of mushrooms on the longer (1.5-mile) trail in June.",
   "Clean, well maintained...bathrooms could use a little attention. We spend most of our time on the baseball field.  However, there are numerous shelters, trails, and playgrounds. The swimming pool is kept very clean, and there is an outdoor stage for concerts and plays. Durinf the summer they have an outdoor movie night. During November and December they have The Festival of Lights. A beautiful display of Christmas lights that you drive thru and at the end, Santa is setting in his rocking chair. The kids can visit with him and enjoy hot chocolate. Oh, important note...the lights are closed on Christmas eve and Christmas day. They reopen December 26.",
   "It's a great park with some awsome softball players!!"
  ]
 },
 {
  "name": "Cathedral Falls",
  "address": "Gauley Bridge, WV 25085, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/17be2ce6-932f-11ea-a4f2-14b31f159f22.png",
  "tags": [
   "family",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11246694150906834453",
  "source": "GoogleMaps",
  "reviews": [
   "Wow, what a breathtaking view! This was an unexpected stop during a cross country drive with my family. We could have stayed for half a day to soak in the beauty. It made for some good photos of my family and a nice rest. Nature always provides for the best views when you least expect it.",
   "Probably one of the nicest, tallest waterfalls you can access by a one minute walk from your car! Most waterfalls require at least a little trek. However, Cathedral Falls is literally within view of the parking lot, which itself is right off U.S. HWY 60. So if you're within a few miles of this place, it would be REALLY dumb if you didn't stop by. I doesn't get any easier for this type of location.",
   "Beautiful falls, neat little area surrounding them. Slipped on the rocks and got my feet wet 😮 but water wasn't freezing 😜. Glad I stopped.",
   "Beautiful little stop. Falls are very pretty, and was a great place for a proposal. Congratulations to a couple of our great friends.",
   "This is a breathtaking area that everyone should stop in and take in the splendor even if it's just for a few minutes. It is easy on and off from the highway."
  ]
 },
 {
  "name": "Ridenour Memorial Park",
  "address": "Nitro, WV 25143, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/18318870-932f-11ea-83de-14b31f159f22.png",
  "tags": [
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16569110099892328151",
  "source": "GoogleMaps",
  "reviews": [
   "I love Ridenour. Such a beautiful gem in Nitro. Great walking trails. Pretty lake and views. Lots of small wildlife. Fun bike trails. A nice dog park. Well maintained shelter and gazebo.",
   "We loved the RC park. Dog park looks very nice too.",
   "I used to go to Ridenire fishing when I was a kid with my dad. Lots of good memories. \nChecked out the bark park today it was muddy & lots of trash.",
   "Beautiful place to just hang out and fish or throw your line in. I have fished here several times and never have even got a bite. Also there a setting for weddings or other formal events. Wear your boots because there is a lot of #2 from all the geese.",
   "Beautiful area! Didn't even know this place existed and I live close by. The place was clean and well-kept. Took my board out on the water for an hour or two and didn't want to leave. Only downside were annoying kids swimming/jumping in the lake when it's clearly no swimming."
  ]
 },
 {
  "name": "Hurricane City Park",
  "address": "3511 WV-34, Hurricane, WV 25526, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1879a5ac-932f-11ea-8fa8-14b31f159f22.png",
  "tags": [
   "learn",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7557656479891349512",
  "source": "GoogleMaps",
  "reviews": [
   "They will open 2 new trails on July 2020 about 2.5 miles and 10 miles across the railway",
   "Best splash park in the area. Shading for the parents, seats for everyone. Food stand. Picnic tables Magic island could learn a thing or two from this amazing splash park",
   "Cute little gem. Had a fun time at this great park. The playground equipment was great and the bathroom was clean.",
   "Great place if it's your 1st time their , I feel like you could get burnt out very quick here and no park employees are anywhere to be found",
   "A great little park..has it all just about everything..a walki g trail by the lake..a fishing lake..water park for the kids..basketball and baseball parks..love the park..."
  ]
 },
 {
  "name": "Kanawha State Forest",
  "address": "7500 Kanawha State Forest Dr, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/18d53354-932f-11ea-ab44-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=4529127880802377050",
  "source": "GoogleMaps",
  "reviews": [
   "I love Kanawha State Forest. Really miss the pool but love the trails. This is the best space I Charleston. Yoga Power loves hiking and doing yoga here",
   "Beautiful area to explore. Hiking is beautiful and can be a great workout. Please be aware of snakes and wear proper gear.  Great place to bring the family. The information booth had no information but you can easily look things up on your phone. Be careful if hiking because there is no service in several areas. It will depend on you carrier. I recommend you screenshot any information to be safe.",
   "Awesome camping spot.. playgrounds, trails.. great place for a campfire and flashlights.. there are no street lights here so it gets completely dark at night.. unless there's moonlight have a powerful flashlight with you.",
   "There is a local hiking club that organizes hikes every weekend.  I recommend attending if you get the chance.",
   "The Kanawha State Forest is spectacular for hiking and picture taking. I've been there three times in the past year alone and I've loved it each time."
  ]
 },
 {
  "name": "Hawks Nest State Park",
  "address": "49 Hawks Nest Rd, Ansted, WV 25812, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19444594-932f-11ea-90b3-14b31f159f22.png",
  "tags": [
   "family",
   "parks",
   "family",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=17017677825185056407",
  "source": "GoogleMaps",
  "reviews": [
   "We enjoyed the tram ride and getting some great pics of the fall colors. The area is not far from Fayetteville, and the New River Gorge Bridge. The road is a little crazy but not bad at all. From soap to coffee!! Great idea!!Can’t wait to go back!! There is a small set of stairs down to the overlook but there are railings. Plenty of waterfalls close by (Mill Creek and Turkey Creek), or you can take a drive West on 60 to see more.  There's a small gift shop and a bathroom on the other side of the road. The landscaping was immaculate!  Everything was just perfect.  I have never seen a state park maintained to such perfection.",
   "This was our first time here and I can say that I am already looking forward to coming back soon.  Everyone at the lodge was so pleasant and welcoming.  What really made our trip magical....the abundance of Hawks and wildlife.  We enjoyed the tram ride   and getting some great pics of the fall colors.  Beautiful memories.",
   "The staff was pleasant and helpful, and the room with a view was excellent!  We stopped here for a couple nights on the way back from visiting family.  I could get the best room for less than rooms at the parks in Canaan Valley (peak in winter months).  The lodge is dated, but the room amenities are nice, and considering that breakfast was included with the room, this was a good deal.  The power went out for about eight hours due to a storm, but the crews got it back on hours before the projected repair time.  The lodge was beautifully decorated, and very homey.  The area is not far from Fayetteville, and the New River Gorge Bridge.  This is definitely on my list--I can't wait to return and stay longer next time!",
   "Great place to go with your family. Or just as a date with your wife. The lodge is nice also. Our family loves to go here.",
   "This is a cool park with a lot to offer and see for families.  We did a short hike to check out the views and we were not disappointed.  Our 5 and 3 year olds enjoyed it"
  ]
 },
 {
  "name": "Canyon Rim Visitor Center",
  "address": "162 Visitor Center Rd, Lansing, WV 25862, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1992bd62-932f-11ea-b125-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4966269824082091144",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic  view of the New River Gorge Bridge.  It is quite a breathtaking sight to see it.  The river is a jaw dropping 876 feet below the bridge deck.  It is quite beautiful.  If you’re headed to West Virgina and your schedule permits, I wouldn’t miss this one.",
   "Well worth the trip although there's not a lot else to see in the area. The views over the river gorge and the magnificent arched bridge are terrific. There's a visitor centre explaining all about the formation of the gorge and the construction of the bridge.",
   "Beautiful view of the gorge. Knowledgeable park rangers. The stairs down to the viewing area are easy; coming up is more tiring! Definitely worth the effort, though.",
   "Very nice! If you don't mind walking a bunch of steps you can get some really nice views outside. Inside views and these from the deck are wonderful!",
   "Our first stop before hitting the trails around New River Gorge, and our favourite place to have a picnic lunch! The short walkway to the bridge views  provides opportunities to see local birds and reptiles!"
  ]
 },
 {
  "name": "New River Gorge Bridge",
  "address": "US-19, Victor, WV 25938, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/19de6c92-932f-11ea-b7cf-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=11174859876440382534",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely beautiful place!! If you’re in the area, it’s a definite must see. Greatly enjoyed all the ways to view the bridge from different perspectives. If you have some time, I’d highly recommend doing the bridge walk. Although I’m scared to death of heights, it was a thrilling experience!!",
   "I love the NRG. Usually go up to kayak the river, but on occasion will hike the trails to the overlooks to look down on the river. It’s such a special place. If you haven’t seen this spectacular bridge, it’s well worth a trip to see it!",
   "Amazing..  be sure to take the road that goes below the bridge amd across the old bridge.  It is a spectacular view from underneath the bridge as well.  From the river you can watch rafters go down the rapids.  There are several trails which all give you unique views.  Dont just drive over it.  Stop and explore.  Well worth the time.",
   "Awesome experience with fantastic views. This is the perfect place to stop for a break. If possible, take the route back down under the bridge as well, there are a few stops along the way and it's simply awesome, especially in the fall with all of the leaves changing.",
   "It's so pretty here . So many trails and you can go rafting . It's a great place to visit ."
  ]
 },
 {
  "name": "Dodson Pest Control",
  "address": "3924 Washington St W, Charleston, WV 25312, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a42109e-932f-11ea-9dd2-14b31f159f22.png",
  "tags": [
   "free"
  ],
  "link": "https://maps.google.com/?cid=4678828379734983550",
  "source": "GoogleMaps",
  "reviews": [
   "I called for a last minute termite inspection and the guy was very nice and patient over the phone. Brandon Rhodes came out, was 10 minutes early and kept me informed on what all he was doing. I would definitely recommend this company and Brandon!",
   "I was taken care of Brandon Rhodes and he was great. He came early and was cooperative. He made sure we were thoroughly informed about what was going on and made sure we had a good experience.",
   "Dodson’s service technicians are very professional and do a great job keeping our business pest free. Highly recommend.",
   "Fixed an ant problem for me in one visit. On time , great price, friendly service. Recommend",
   "They were able to effectively get rid of a roach problem that me and girlfriend had in my apartment. They came on time, handled the problem in one visit and we have yet to see a roach since."
  ]
 },
 {
  "name": "Babcock State Park",
  "address": "486 Babcock Rd, Clifftop, WV 25831, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1a7e2f76-932f-11ea-b737-14b31f159f22.png",
  "tags": [
   "walk",
   "organized",
   "walking",
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=5727809796506917415",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to see! Not hard to find! During off season go use the restroom at a nearby gas station first. Also the island in the sky trail is across from the mill. The walk is about 20 minutes one way and I'm fat and got up there just fine. There are two small mad made ladders on the trail to get up some rocks. Not too scary. Do it and have fun!",
   "Babcock State Park met my expectations of a private forest retreat surrounded by the beauty of fall season. My friend and I stayed in an economy cabin that included a queen size bunk bed, kitchen, two dressers, bathroom, screened in porch, fire pit, picnic table, and grill. I loved building fires and standing outside under the moon, stars, and beautiful fall foliage. The cabin experience could be considered rustic but other than needing a little bathroom dusting, it was clean, organized, and expended at an excellent price. We loved walking around the park between overlooks, the grist mill, and the lake. The roads were in great condition and the park itself looked well maintained. The hospitality was remarkable. Well done staff of Babcock State Park:)",
   "Beautiful park. Stopped by the grist mill, took some great pictures. Enjoyed the sound of the water. Very relaxing. Hiked around the lake. Trail was well maintained. One of my favorite hikes yet. Easy to moderate so nothing too strenuous yet good for the soul.",
   "By far one of the most beautiful places I've ever seen! We took so many pictures and plan on using the for calendars. I highly recommend this place to anyone and everyone!",
   "I really like this place, lots of trails for hiking and biking. Plus the lake is a nice feature. Their is a grist mill that you can walk through which is the parks main attraction but it has very limited hours. There is a gift shop their that's has some nice things. The down sides pretty much are the grist mill isnt open much, theirs no place to get anything more then snacks atleast 10 minutes from the park, and you cant swim in the lake."
  ]
 },
 {
  "name": "Clay Center",
  "address": "1 Clay Square, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ad55ade-932f-11ea-aa75-14b31f159f22.png",
  "tags": [
   "art",
   "kids",
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3216059599858173803",
  "source": "GoogleMaps",
  "reviews": [
   "The children’s museum is AWESOME. Me and my child visit frequently. Only thing I wish is  that they would show different shows in the theater. As for that. We love the place.",
   "Flawless acoustics and comfortable seats enhance the great shows offered at The Clay Center for the Arts and Sciences. The hands-on children's discovery museum and the small but high quality art museum make it fun for all ages and interests. There's also a great planetarium that also shows interesting, educational short films.",
   "Today was a free day! My kids enjoy every visit. There is always something to excite their minds and curiosity. The downstairs mini city is a great training facility - car care center, bank, grocery store, diner, etc. Fun and education makes a great time for children and adults",
   "This concert venue has excellent acoustics. It's always a pleasure to sing here with the WV Symphony.",
   "I love our new clay center if I could I'd work for it. I attend recitals, networks, gala, music artists and the wv symphony. It beautifully done and people show up from everywhere."
  ]
 },
 {
  "name": "Mystery Hole",
  "address": "16724 Midland Trail, Ansted, WV 25812, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b15e662-932f-11ea-9883-14b31f159f22.png",
  "tags": [
   "tour",
   "parks",
   "family",
   "free",
   "tour",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=18088601045006400080",
  "source": "GoogleMaps",
  "reviews": [
   "This place has been here 40 plus years over my years of traveling to it I have made an unspoken friendship with the owners and dont even know others names but when we see one another here we light up with smiles and a warm greeting what makes this place so special is still a MYSTERY you must stop here ESPECIALLY if you have children",
   "A neat little tourist trap using optical illusions and physics to warp your senses. Definitely heed the warnings. On the outside, just a small shack that goes about 3 levels deep but the name alone and the outside aethetics catch your eye to bring you in to a tour guide who is quite a showman himself. An alright stop if you have time to kill or are in the surrounding camp grounds and parks.",
   "Quick fun stop. Great views and pretty good parking. I did feel a difference  in the gravity room, but it did seem like the feeling was magnified by the built angles in the room. It felt like the demonstrator tried to creep out the crowd. They try hard to make the experience last longer than what it really should, which is appreciated... but honestly I felt dizzy and was ready for it to be over. I wouldn't say it was a waste of time because it was a fun experience with my family. We also saw 2 waterfalls along the route to mystery hole, so overall it was a fun family experience!\nNote: the website says no large back packs or purses, so we took small ones and was still told they couldn't be taken in, on a positive note the shop offered free lockers to store our bags",
   "It is the great stop on the hawk nest experience.  Simple little spot.  Friendly staff. And a funny little tour.",
   "Good place to get some WV souvenirs. And fun for the kids to go through the tour"
  ]
 },
 {
  "name": "Davis Park",
  "address": "301 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 3.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1b5c43f8-932f-11ea-b4aa-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4451656087715068867",
  "source": "GoogleMaps",
  "reviews": [
   "Park has had a few upgrades over the recent years and is really nice. If the city could do something to address the homeless in the area I'd spend more time here, as it is the panhandlers can be aggressive. This is why I carry a sailors emergency boat whistle and make, being told to for over $5 buck or else is kinda a turn off.",
   "Great place to hang out for those warm weather concerts.",
   "Great time outside.",
   "Quiet pocket park with comfortable seating. Best used during daylight when  downtown workers are present or during events -- and then, of course, it is not quiet.",
   "Thanks to shortsighted miss management by city administration, the dozens of century old trees have been cut down turning what used to a cool green haven from the city heat into a sunsoaked oven that's unpleasant to even walk thru...sad to see what used to a gem in the city turn into an empty plaza no one uses anymore"
  ]
 },
 {
  "name": "Heritage Farm Museum & Village",
  "address": "3300 Harvey Rd, Huntington, WV 25704, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1bb95864-932f-11ea-ba46-14b31f159f22.png",
  "tags": [
   "family",
   "knowledgeable",
   "tour",
   "kids",
   "family",
   "knowledgeable",
   "tour",
   "organized",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=7538239863004498226",
  "source": "GoogleMaps",
  "reviews": [
   "Heritage Farm offers a kid friendly, historical journey through Appalachia.  So many fun and interesting activities for the kiddos, including an entire building dedicated to arts and crafts \"The Maker Space\", a couple playgrounds,  a transportation museum, a doll museum, animals and so much more.  And Christmas time here is super fun!  Definitely something for the whole family to enjoy!",
   "A wonderful place to visit. People were super friendly and knowledgeable.  Fastanating and interesting collection of antiques.  The way it's set up is well worth the trip no matter what weather the is. Just happen to get a personal tour and the guy had friends in the town I grew up in.  Neat...",
   "This place is truly a local treasure.  A great family friendly place to take kids on the weekend, Heritage Farm has numerous museums, restored log cabins, a \"Maker Space\" where kids can make arts and crafts, and numerous artisans who demonstrate their crafts.  Go during one of Heriage Farms \"Way Back Weekends,\" you wont be disappointed.",
   "Spend the day with grandson and his 1st grade class recently.  The people that work there are really nice and knowledgeable.  The tour is well organized. Had a great day.",
   "Wonderful museum!!  Well worth seeing.\nIt is difficult to describe the extent that these people have gone to create such an all encompassing historical display.  There were many items that we had never seen even in other museums.  We had an exceptional male tour guide."
  ]
 },
 {
  "name": "New River Gorge National River",
  "address": "Glen Jean, WV 25846, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c0079e2-932f-11ea-9b38-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=2079439709633908230",
  "source": "GoogleMaps",
  "reviews": [
   "Easily one of the most beautiful places in the entire country! There are beautiful hiking trails and overlooks, world class whitewater rafting, rock climbing, and ziplining. The New River Gorge has something for everyone and is a bucket list destination that you should not miss! Also, definitely make sure to check out Bridge Day in October for one of the coolest festivals on earth!",
   "I love this place! And always wanted to spend more time exploring. I’m definitely going to add to my bucket list to spend an entire month.",
   "What an awesome view from Turkey Spur and the Main Overlook. The pics are great but hardly shows the beauty and size of this breathtaking park. I am looking forward to finding more spots to see.",
   "Love this place. Try an go on bridge day. Get there early or you have to walk a ways. It worth the trip..",
   "Fantastic place for whitewater rafting on class 4 and 5 rapids. Been here twice and each experience was awesome.  The experience is so much fun and the guides are the best.  They will truly make your experience so much more if you are personable and respectable. Remember to tip your guides, its the right thing to do!"
  ]
 },
 {
  "name": "Beckley Exhibition Coal Mine",
  "address": "513 Ewart Ave, Beckley, WV 25801, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c4c9a88-932f-11ea-bc67-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "history",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6594614437988185626",
  "source": "GoogleMaps",
  "reviews": [
   "WOW........ this is an Awesome place to bring family, friends, school group, Church group or just stop in by yourself. This is a must see and do, not to be missed or dismissed. The overall facility is very well laid out, maintained by a great dedicated group of knowledgeable people. There's even Retired Coal Miners that were there to run the buggy back in the ground to experience the mining industry. They were very friendly and knowledgeable, answering every question regardless of the relatively. We really enjoyed going in the Old Camp Buildings, Houses, and Schools. The HandsOn Caboose was a great big hit with our younger children in the group. The Gift Shop was great as well, and the fudge.... well I wish I would have bought more and more. Thanks for sharing your facility,  teaching us the history of mining and not letting it die.",
   "I really enjoyed it all. It is a small coal mine tour and a small recreation of a coal mine village. But it gives you a complete picture of how this area of the country grew and functioned. For those of us who had relatives in the industry, we get a snap shot of what life was all about.",
   "While this exhibition is naturally a sanitized version of the \"real thing\";  particularly, the height of the main line, there is quite a bit of true and accurate representations of what coal mining was like mainly circa 1950.  The park itself is a little difficult to find, so follow your GPS VERY carefully.  The parking is ample and accommodating for RV's.  The Rahall Coal Country Store is an excellent exhibit itself.",
   "Wonderful place with very nice people. Would definitely recommend this place for the whole family. Lots of history about coal mining and a overall great experience.",
   "Loved it! Real underground coal mine! Guide was great!, friendly,  super informative and funny! All the homes and old items in them was nice to see too. Ladies in the gift shop were so sweet. Speaking of sweet, we loved their fudge!  Easy parking right in front. Glad we went."
  ]
 },
 {
  "name": "Mothman Museum",
  "address": "400 Main St, Point Pleasant, WV 25550, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1c927d24-932f-11ea-8bbd-14b31f159f22.png",
  "tags": [
   "cheap",
   "family"
  ],
  "link": "https://maps.google.com/?cid=29710346464061288",
  "source": "GoogleMaps",
  "reviews": [
   "Me and my fiance went here for my birthday a few weeks ago and had so much fun. And the guy who worked there I think his name was Jeremy and we was very nice and chatted with is for a bit. Overall a great experience and would definitely recommend 😊",
   "A must for any paranormal researcher!   We actually based on summer trip on stopping at this location during our travels and we were NOT disappointed.   The collection of information surrounding the Mothman phenomenon is simply amazing.   Intermission was very reasonable, and the gift show was awesome.   We have a full review of this location on our website and YouTube channel.",
   "So cool to finally get to explore the Mothman Museum today. Very interesting to see the handwritten statements from witnesses, the John Keel collection and all the movie props, too. Fun stop, and definitely grab a Mothman Root beer while you are there. Super tasty!",
   "Very cheap admission and interesting displays, but don't expect to spend a large amount of time here-- the standard Mothman enthusiast will probably spend at most an hour browsing through the two main rooms and watching the short film. The gift shop was fantastic, with a large amount of Mothman knickknacks and souvenirs to show off to family and friends back home. The statue outside the museum is also a great photo opportunity.",
   "Not only did I have a blast, but the facility was clean and the staff very friendly. They also had a great amount of fun nicknacks and cryptic paraphernalia. If you are anywhere near Point Pleasant, do yourself a favor and check this place out."
  ]
 },
 {
  "name": "Carnifex Ferry Battlefield State Park",
  "address": "1194 Carnifex Ferry Crossing, Summersville, WV 26651, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1cd579cc-932f-11ea-b6ed-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "tour",
   "history",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=6138268048717790866",
  "source": "GoogleMaps",
  "reviews": [
   "This is an out-of-the-way gem, beautifully maintained by the WV State Park system. This is the site of one of the earliest Civil War land battles. The original farmhouse that was caught in the crossfire still stands. For more historical context, you may be interested in the historical fiction novel Panther Mountain: Lydia's Story, available on Google Books.",
   "Well maintained and clean.  Shelters are in well located areas.  There is a playground for the children.  The scenic overlooks are beautiful.  Plenty of trails to follow.  There are multiple history markers throughout the grounds and an 1800's home you can tour.  Don't forget to walk across the field to look at the cannon.  Takes you back in time if you can just visualize the journey.",
   "Great little Civil War battlefield state park. Living nearby I have come here many times from childhood 'til now. Very picturesque and tranquil this day-use park offers hiking trails, picnic tables, playground, three pavilions for get togethers, an overlook of the beautiful Gauley River, a Civil War museum, and other features. This park is well kept and family friendly.",
   "Loved this place. Family friendly, beautiful well kept grounds, informative signs marking historical areas.",
   "Very beautiful especially the over look"
  ]
 },
 {
  "name": "Koenig Art Emporium",
  "address": "823 Quarrier St, Charleston, WV 25301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1d56e862-932f-11ea-8210-14b31f159f22.png",
  "tags": [
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=8904842795051161782",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent and helpful staff, great work. Nice gallery with an exhibit of local artists each month or so. Reasonable prices, this is a custom frame shop so don't go expecting your frame work to be done next day!",
   "Great owner and fantastic art work.",
   "This is worth a look if you got the time",
   "THE ART EMPORIUM had such a great selection of art.  I would recommend everyone to stop by for all the Christmas  deals.  Many items to choose from.",
   "Amazing shop run by amazing people"
  ]
 },
 {
  "name": "Mountain State Miniature Golf",
  "address": "1818 Harper Rd, Beckley, WV 25801, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1deeca00-932f-11ea-82c6-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "kids",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=918706473353712038",
  "source": "GoogleMaps",
  "reviews": [
   "As this is the only climbing gym I've ever been to, I honestly can't say how it attacks up, BUT I can say the staff is awesome. They were great with our kids as we had our daughters 9th b day party there. They went out of their way to make sure they all had a great time. Knowledgeable, professional and nice. Couldn't have asked for it to go better.",
   "One of the best mini golf courses I've ever played. Very challenging. The course is in a comfortable wooded area and each hole includes factual information about West Virginia history. They also have a rock climbing wall inside.",
   "A legit history lesson of West Virginia,  while having fun put-put golfing. They even had Mothman! Worth the stop to stretch legs while traveling!",
   "Great place!!! So glad we tried the miniature golf and coffee/drink products. Great, helpful staff, too.",
   "This was one of the coolest mini golf courses that my husband and I have ever played! Each hole had fun facts about specific WV-related people, places and things. They were all also rather difficult holes, not the usual par 2 or 3 for everything. Loved this course!"
  ]
 },
 {
  "name": "Pies & Pints - Charleston, WV",
  "address": "222 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e2c925a-932f-11ea-b5cd-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "knowledgeable",
   "free"
  ],
  "link": "https://maps.google.com/?cid=2426483370592482757",
  "source": "GoogleMaps",
  "reviews": [
   "Pork and pepper nachos are a amazing way to break your vegan or plant based diet. Love the tasty thin crust pies. Half artichoke  special and chicken gouda with bacon. A great selections of brews. Had to drive so only one but 2 more to go. I do recommend",
   "Black bean pie - a taste sensation!!!!\nAlways delicious but the one I picked up 4/18 was AMAZING! Great food and super friendly service much appreciated:)",
   "Pies & Pints is a West Virginia institution. Over the last several years, I've had every single menu item at one point or another. And they were all excellent. You know how some restaurants will have some good some great and some not so good? Well Pies & Pints is always great. Salads: Amazing, Pizzas: Incredible! One of my friends who moved away from the area just texted me. \"Pies & Pints, oh how I miss thee.\"",
   "Pizza Yes. Beer Yes. Go and you will be pleased.\n\nThis place has a as unique approach to pizza. They use gourmet ingredients in cool combinations. I’m sure you can get the standard, routing pizzas like pepperoni, sausage, etc. but why?! These cool flavors are great! I had their version of a Hawaiian pizza. It has feta cheese, bacon, pineapple, and ham. I got the sauce on the side and did some dipping.\n\nThey have a great selection of beer as well. I had Bitbutger on tap yum.\n\nFor your information, those nachos are almost enough to feed a small army.\n\nThe wait was expedient.\nThe people were helpful and knowledgeable.\nThe atmosphere is loud and social.\nThere are multiple seating options.\nParking is typical for a downtown area.\n\nI’ll be back.",
   "Really cool spot in Charleston, street parking was close and free on the weekend. We were able to grab a seat for two relatively fast, it was super crowded but we were not in a hurry. We ordered wings and pizza, the wings weren't anything to write home about but the dip was fantastic, and the pizza was some of the best I've had. Great selection of craft beers, draft and bottle, as well as a wide variety of OH & WV based breweries."
  ]
 },
 {
  "name": "Visionworks Charleston Town Center Mall",
  "address": "1031 Charleston Town Center Mall, Charleston, WV 25389, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1e6d7ac0-932f-11ea-b6d7-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=18200761576546946904",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered 2 pairs just over a week ago using their buy one get one special. They had the best frame selection out of any place I’ve been in Charleston! The manager, Melissa, helped me. She was extremely nice and didn’t try to push me to buy this or that. She told me 14 days for my glasses, but I received them in just over a week! (Although I wouldn’t necessarily expect that kind of speed every single time, as how quickly they’re made obviously depends on your prescription, the delivery service, etc). The lady who dispensed them - I think her name was Tara, was also very nice and helpful. She adjusted my glasses perfectly. I’ll definitely be coming back here for future purchases. Better service, cleaner store, better deals, and better frame selection than ANY place in Charleston. These are my favorite glasses I’ve ever gotten!! If you come here, definitely ask for Melissa or Tara if available. 11/10 recommend this place.",
   "Glasses good.",
   "My daughter got her first pair of glasses yesterday. Donald was extremely helpful, professional and patient. She tried on at least 20 pairs and he was never aggravated with her. He was very knowledgeable on the glasses and proper fit. As well as insurance. I will definitely use Visionworks again and recommend to anyone. Thank you!",
   "Couldnt find the right pair for 2 weeks, each place I would stop at just made me feel as if I was an inconvenience for them. When I came by this location, it was honestly my last try and the service and professionalism given to me by Tara was just out of this world. I've already told many friends and my social media about how great Tara was and to always go to this location. Thank you for given me my sight again Terra!!!",
   "Was able to walk in. We had our eyes checked within 20-30 minutes, had our glasses picked about 40-60 minutes after arriving. I highly recommend. I had quite a few picks I liked couldn't make my mind up, and Tara helped me a lot and kept it real. She's the real mvp. She was extremely nice, and because of everyone being so friendly I will be back. I will be telling people about this."
  ]
 },
 {
  "name": "Blennerhassett Island Historical State Park",
  "address": "137 Juliana St, Parkersburg, WV 26101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1ec49bc0-932f-11ea-87e6-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "affordable",
   "family",
   "history",
   "food",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15731650064154437517",
  "source": "GoogleMaps",
  "reviews": [
   "To start off, this island is beautiful! It's well kept and there are some beautiful, massive Sycamore Trees out here. The ferry ride to get here is fun, and I think $10 is pretty darn reasonable. The history here is awesome! There are many signs and a few volunteers that'll tell you some of the history. And finally, there are some very nice trails too. Overall, an excellent start to my first time being in West Virginia!",
   "This place is AWESOME. My favorite part of a road trip to WV was going here. Oy reachable via ferry ride. The ferry ride was affordable and a LOT of fun with my little girl. It's about a 20 minute boat ride down the beautiful Ohio River. \n\nThe island itself is pristine. A cool gift shop, historical and preserved buildings, a lot of history and good signage. The trails and roads are very well kept and I was pushing my baby girl in a stroller. The island is quite big, heavily shaded, and flat. Beautiful outdoors area!",
   "What a wonderful hidden treasure. Beautiful house and wonderful look at history. Exceptional fun experience for the whole family. The staff was outstanding, the food was great, wagon ride was very informative and the boat ride to and from the island was outstanding. Fun for whole family.",
   "Greeters are informative and engaging regarding the history of the Island during that period of time.  Gift shop and eats on site.  Set aside at least 3 hours and go there!",
   "So much fun was had! We will definitely be going back to revisit. Everyone was so. Ice and there was so much to do."
  ]
 },
 {
  "name": "Taylor Books",
  "address": "226 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f099418-932f-11ea-8d91-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "cheap",
   "art",
   "free",
   "art",
   "music"
  ],
  "link": "https://maps.google.com/?cid=180266294256919713",
  "source": "GoogleMaps",
  "reviews": [
   "This is not only a unique book store its also a well known coffee place that Charlestonians hang out.\nI would say this is the most popular place for people to visit with friends and have a cuppa.\nThe decor is unique,inviting and a great atmosphere for all individuals.\nThere are many items other than books and coffee at Taylors.\nSuch as baked goods, lunch items,greeting cards and fantastic finger puppets.\nIf your in the Charleston area don’t miss out on this Book and Coffee Haven.",
   "I love Bagel, Cream Cheese, Lox for an early breakfast. With a Lemon Square and a CRAZY WHITE GIRL, Or Emerald Isle. Their White Hot Cocoas are delicious.  Also Milky Way Blast(cold with whipped cream)for a summer afternoon pick me up. And Wildberry Smoothies",
   "Cute bookshop with new, used, and super cheap sections.  They have a coffee shop that I haven't tried but smells amazing. But the really neat thing is the art show that changes out often on one side of the store. Friendly staff.",
   "It's a chill small business spot where you can grab some Java,  buy a book, relax in a comfortable chair reading it.  Free wifi and lots of great art and quirky knick knacks",
   "One of my favorite ways to spend a couple hours in Charleston, WV. New and used books, great coffee, local artwork, and oftentimes, live music! Great place to hang out with a friend or have some time to myself."
  ]
 },
 {
  "name": "Winterplace Ski Resort",
  "address": "100 Old, Flat Top Mountain Road, Ghent, WV 25843, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1f5ae8a2-932f-11ea-9550-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7105310073985500714",
  "source": "GoogleMaps",
  "reviews": [
   "Not a bad mountain at all. Good for beginner to intermediate riders. Weather conditions were awesome. Staff was friendly and helpful. They offer a great exchange program. If your board/skis break or you want to try a different size/style of board or ski, you can use your own board/ski as collateral, and they will let you use a rental at no cost. My bindings broke and I got to try out a few different size boards. Pretty cool if your looking to try something different. Again, not a great expert mountain, but really good for beginners and intermediate riders.",
   "This place is awesome. Very friendly staff and very helpful. Had a great time, book an all in one package with the lesson, it was great. Conditions were perfect everything went well. Couldn't be happier with my experience. Make sure you come early and prepare to spend about an hour inside filling out paper work and getting fitted for gear before you hit the slopes.  All in all it was Awesome!",
   "The lessons were not as good as I thought they would be. The slopes needed a bit more snow on them. And it was very difficult to find out which slopes were open or not. On the other hand, it was SKIING so lots of fun there! It was a great experience to go hang out with friends and family, and they had very nice people working which was surprising considering how many people they have to deal with everyday. So I would check it out. I loved it. It was a great weekend.",
   "Visited Winterplace New year's day. Fortunately they had a little bit of natural snow overnight but they did have to produce snow as well. They had a little over half of their runs open. Had a very enjoyable day of skiing. The resort was run efficiently. Staff was excellent. The cafe food was not that great but did the job. If you are looking for an affordable day of skiing you should checkout Winterplace ski resort.",
   "Snow not being made daily so check the cams/weather before you go . If your staying at mountain inn be aware it's all stairs and no elevators so you'll be lugging stuff up with no bell man or bell carts. The bedrooms are also above , loft style so pack light or get ready to carry a lot. Having said that great resort . We had Dwight as a private instructor 3 days in a row and was great with our 4 yr old.\n\nOverall very friendly staff , easy parking, and easy to get around, book lessons, rent gear etc."
  ]
 },
 {
  "name": "Creative Pediatric Dentistry",
  "address": "3520 Teays Valley Road #1, Hurricane, WV 25526, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1fa1b5d8-932f-11ea-8f8d-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13189318368359314689",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely amazing office staff! My daughter has high anxiety about the dentist and the girls there immediately put her at ease, they were so good with her! Dr. Lizzie was so sweet and gentle, she's a great dentist! Highly recommend this dentist office for your little ones!",
   "We love this dental office! Honestly, can’t say one bad thing. They’re kind, patient and knowledgeable. They make our girls feel good about coming to the dentist! Dr. Lizzie is the BEST!",
   "Dr Lizzie and her entire staff are angels! My children always have a positive experience at their office, and look forward to going every 6 months. I truly cannot speak highly enough of Dr Lizzie and her girls!",
   "They are the absolute best. We’ve been five times now, and I’m impressed with how patient, kind and understanding they are to my three year old every time.",
   "Dr.Lizzie and all of her staff are fantastic! I took my son, 1 year old, and they were so amazing and patient. Every person that you encounter has a smile on their face! It was both a great environment and experience!"
  ]
 },
 {
  "name": "Yoga Power, LLC",
  "address": "601 Morris St #302, Charleston, WV 25301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/1fe74a86-932f-11ea-b3dc-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "free",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=2080756864868762451",
  "source": "GoogleMaps",
  "reviews": [
   "Supportive, fun, diverse yoga classes, and open workshops taught by wonderful, experienced, professional instructors! Make this studio your home base for all your fitness needs.  Everyone cares about you and your wellbeing  from the staff that checks you in and greets you as you enter the door to the final namaste in each class.  Since this studio opened I’ve taken over 400 classes.  Trust me, I know!  Love you all.",
   "I love Yoga Power! From the people at the front desk to the teachers to the owner, everyone is kind, welcoming, and - most importantly - knowledgeable. If you want a funky class (Hip Hop Yoga) or a traditional class (Yin), there is a class for you. I've been doing yoga 20 years, and I take my yoga practice seriously. I highly recommend this studio.",
   "I love the clean, warm atmosphere.  The instructors are so wonderful; they have no problem coming around to aid you for repositioning and maintaining proper alignment, which is nice for beginners like me!",
   "Just getting back into Yoga and what a pleasant surprise Yoga Power has been.  Used the free week to take from multiple instructors.  Found each to be very good.   Studio is very pretty and a comfort to be in.   Will soon be getting a membership and its incredibly affordable.   Great instructors, great facility, great prices... great Yoga.   Namaste.",
   "I came to try acrobat yoga for the first time. Nate and Angie led a great class and had a group of beginners flying in no time. \n\nThere is a lot to like about this yoga studio: it’s clean and well decorated; the staff is very friendly; there are many class offerings to fit busy schedules; and there’s even a bar. \n\nGo and check it out!"
  ]
 },
 {
  "name": "Wild blue adventure company",
  "address": "282 Hinkle Rd, Fayetteville, WV 25840, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/202c721c-932f-11ea-b12c-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=6119636172518857358",
  "source": "GoogleMaps",
  "reviews": [
   "I highly recommend visiting if you're in the area.  The hangar and plane are immaculate with a great deal of attention paid to the details of making it look like it came straight out of WW2.  The ride itself was fantastic, the pilot is just a really nice person and talked through everything so there were no surprises and I was able to feel confident trying some aerobatics.  I'm glad I did!  The flight itself is over a gorgeous area and Chris knows a lot about the area, from historical sites to good hiking trails.  This was truly a unique experience and I cannot recommend it enough!",
   "Went to a baby shower here. Very beautiful place",
   "Amazing views from this Stearman Biplane. The Pilot was so nice and very professional. I would recommend taking a flight to see the New River Bridge and Gorge.",
   "Take your breath away! Pump up your adrenaline! Like a zip line times NINE!!",
   "Wouldn't let my boyfriend ride because of his weight I'm chubby and his son was very disappointed ☹️"
  ]
 },
 {
  "name": "Buffalo Mountain Trailhead, Hatfield-McCoy Trails",
  "address": "34 Oakwood Heights Road, Williamson, WV 25661, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/207d515c-932f-11ea-a656-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9692382715823972364",
  "source": "GoogleMaps",
  "reviews": [
   "Don't give these out much, but this place is amazing. To many trails to talk about, but hit the 199 single track trail and you won't regret it. \n#LetsGuide",
   "The trail system is large and super fun. There are plenty of places to eat, get gas, and even get your rig fixed if you were dumb and bought a Polaris. Very friendly people all throughout the area.  Had a great time!",
   "Trail Heaven explains it! They keep trails in great shape and are always taking care of them!",
   "Second time to HFM and this trip was BM. Great trails.. intermediate at most.. little more narrow than Indian and pinnacle, 2 wide SxS head on could be a challenge in spots.\n\nWe stayed at Wildwood Cabins in Gilbert... Highly recommend them to stay at. Direct access to Rock House, 35 minute trailer drive to BM.",
   "It's a awesome trail for your quad or side by side👌"
  ]
 },
 {
  "name": "Lost World Caverns",
  "address": "907 Lost World Rd, Lewisburg, WV 24901, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/20c09be8-932f-11ea-8533-14b31f159f22.png",
  "tags": [
   "drink",
   "affordable",
   "knowledgeable",
   "knowledgeable",
   "family",
   "tour",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5811476246510759523",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great stop in the middle of nowhere. I was tired of driving and this place was like a drink of fresh water. It has a cute little gift shop. The tavern is self guided so no wait! You can go in and read about all of the formations. Highly recommend as a great pit stop.",
   "We enjoyed our visit to the caverns. There's plenty to see without it being overwhelming, and there are lots of signs explaining the different formations. We found a Groupon that made our visit really affordable.",
   "Great experience, especially for the price! Highly recommend and would visit again. The workers in the shop were extremely friendly and knowledgeable.",
   "My family and had a great time. The staff was friendly and knowledgeable. The gift shop was awesome. I would love to do the climbing tour.",
   "Great group of guides.  Very patient and knowledgable with our large church group.  We come every other year, and it is a great experience for the kids."
  ]
 },
 {
  "name": "Mountwood Park",
  "address": "1014 Volcano Rd, Waverly, WV 26184, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/210a4f66-932f-11ea-99f1-14b31f159f22.png",
  "tags": [
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17104805720350261689",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome hiking experience!! It's really beautiful and it's full of wildlife. Make sure you're in good shape if you come here because it is quite hilly, but every step is worth it. You could hike forever out here!",
   "Have been to the lake many times. Lovely place, lots of fun places to walk .\nNice hiking trails. So much wildlife and places with great veiws. Just amazing this time of year.",
   "Great trails! Lovely park on the outskirts of Parkersburg. Looking forward to returning in warmer weather to go kayaking and hiking. If we had horses we'd ride the trails and go to the horse camp.",
   "Been coming to this park sense it began.It is a very nice place for people to come and enjoy the great out doors.There is something  for every one. This time of year trout fishing is the big thing. Hundreds of people line the banks and float the lake for trout. This week it's been a little muddy and cold but a whole lot of people turned out for trout fishing. Even though the weather is cold there is a lot of smiles and some pretty nice catches.",
   "Great park with lots to do and always clean."
  ]
 },
 {
  "name": "Camden Park",
  "address": "5000 Waverly Rd, Huntington, WV 25704, USA",
  "avg_visitor_review": 3.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/21533f74-932f-11ea-9084-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "field"
  ],
  "link": "https://maps.google.com/?cid=7697506332821744077",
  "source": "GoogleMaps",
  "reviews": [
   "This park is over 100 years old, so expectations about quality and aesthetic can't be high going in. It's a fun place to visit with family, especially with kids.  Definitely worth a visit if you have little ones. So many fun rides here!",
   "It's not that I dislike Camden Park but we bought seasonal passes and also parking passes which weren't too bad price wise but I have a 13 and 14 year old and basically once you've gone a couple of times you're kind of set they got bored with it very easily. Years ago it was a fantastic place to go but it's quite dirty now and kind of I really don't know the correct word just didn't feel it he's there.",
   "I loved it when I took my son this year!! I would recommend it to anyone that has kids, ANY AGE!! I love that they have plenty of rides for younger children because, in the past, I have taken my little boy to fairs and carnivals where he wasn't able to ride any of the rides (because he wasn't tall enough)! I would pay for a wristband so he could ride, the kid rides, all day! So, I will definitely be visiting this place in the future!\n The reason it didn't get a five star rating is because a few of the rides could use a little TLC!! They honestly didn't look safe for me to ride...so I would definitely not allow my child to ride! \n Overall though...a great place!!! 💖 👨‍👩‍👦 💖",
   "My son's school went to Camden Park for a Field Trip. It was a great time! We had a blast 😊",
   "Was a great get away with the hubbie.. and we had a blast on all the rides.  Love the No waiting to ride but ensure was HOT.."
  ]
 },
 {
  "name": "Bluestone State Park",
  "address": "78 HC, Hinton, WV 25951, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/21a83d80-932f-11ea-b908-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10320510663859708296",
  "source": "GoogleMaps",
  "reviews": [
   "If you want to get away from it all (but not too far), this is the the place. Cabins are comfortable, have WiFi and AC (reducing the danger to be killed by wife and kids). Towels and linens provided. Kitchen equipment a bit spare, but manageable. Park staff very friendly.",
   "Its absolutely beautiful.. These are just a few of the beautiful pictures of this awesome place..\nMary Plumley",
   "Small great park, lots of fun trails. It is a smaller WV state park but it is maintained well. The  cabins are very nice: comfortable beds, couches and full kitchen. No complaints at all and would love to go back.",
   "Quiet park. Nice big spots.  Roads are NOT big rig friendly though.",
   "Just stopped here to see 3 waterfalls, all can be seen from the boat launch. But this lake is beautiful, nonetheless."
  ]
 },
 {
  "name": "Edwards Roger D DO",
  "address": "419 Brooks St, Charleston, WV 25301, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=11651212131809980540",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Monongahela National Forest",
  "address": "200 Sycamore St, Elkins, WV 26241, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/21f098c2-932f-11ea-86be-14b31f159f22.png",
  "tags": [
   "nature"
  ],
  "link": "https://maps.google.com/?cid=7594348562579699601",
  "source": "GoogleMaps",
  "reviews": [
   "The whole area is beautiful and varied especially in terrain and loop distance. Some trails however do not loop but most of them connect to another trail that you can use to loop back. Have a detailed map and good sturdy shoes. Know and remember where the water sources are. get there really early like at the crack of dawn in order to find parking. This can be a very busy place. Also I don't suggest you drive in at night. It's dangerous going up that mountain with all the deer hanging out by the side of the road. Hard to see them in that pitch black darkness. Beautiful drive out though! Will most definitely return.",
   "So I had to take my Heavy haul truck up through the mountains to get to this location to pick up a piece of equipment and turn around and come right back down the mountain...I wasn't there as a tourist but I'll tell you it's beautiful scenery... and it's pretty challenging on a truck empty let alone loaded... I brought a hundred thirty thousand pounds back down...\nIt was challenging took a long time to go very short distance.. 60 miles in 2 hours...\nYes that's 30 miles per hour...\nLong-haul truckers would be broke if every hour went like that..\nso trying to tell you this is some beautiful West Virginia countryside and I'd recommend to pass through here.. \nAnd by the way the folks I met up there are very helpful and friendly.\nI recommend this area for all folks both commercially and for income.. and to see a very beautiful land.",
   "I spent some time on Spruce Knob mountain over Labor Day weekend. The scenery is absolutely breathtaking. I was attending an astronomy event, and can not wait to go back.",
   "Gorgeous and wild, a gem of nature in West Virginia. Definitely worth a visit to explore all the natural beauty this magical place has to offer in every season of the year.",
   "This is a huge area and is my favorite playground hunting fishing hiking they have it all.  Cass scenic railroad Williams river trout fishing camping in Rock house.  I love this place.  You have to check it out.  Green bank is also nearby for those interested in a radio.observatory"
  ]
 },
 {
  "name": "Henderson Hall",
  "address": "517 River Rd, Williamstown, WV 26187, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/223d3242-932f-11ea-857b-14b31f159f22.png",
  "tags": [
   "history",
   "family",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13491856077536538134",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped by the home while it was closed for the winter. The home is beautiful with early American architecture. The grounds of the property has rich history as well.",
   "It's amazing that everything in the house is original to the house - the family saved everything!",
   "I was allowed to have my son's christening on the site while we had our civil war event",
   "Beautiful and interesting. Highly recommend a visit.",
   "A wonderful day! This was our second cruise and it was just perfect. The food fantastic, the history and local knowledge given during our river cruise, was so interesting. Even though I grew up in Zanesville, I have learned things I didn't know.  \nI can't wait for our next excursion!!!"
  ]
 },
 {
  "name": "Oil & Gas Museum",
  "address": "119 3rd St, Parkersburg, WV 26101, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2285fb4c-932f-11ea-8d83-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=17698597253651096239",
  "source": "GoogleMaps",
  "reviews": [
   "Very old building that could use repair and cleaning. But it was filled with all kinds of historical treasures. If you like history of any kind definitely take the time and check it out.",
   "Great museum. My child and I had so much fun . It is a huge museum with items to explore from top to bottom.",
   "Wonderful walk back into the area's history! Not only a history of oil drilling in the region, but many exhibits on the civil war, WW1, and lovely antiques! Admission is $7 for adults.",
   "I’m so excited to find this gem. Literally sitting on the door steps on this fine dreary October Saturday waiting for it to open like a school girl.",
   "The local history is so fascinating. Just to cool."
  ]
 },
 {
  "name": "Laury's Restaurant",
  "address": "350 MacCorkle Ave SE, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/22d7c526-932f-11ea-aaf8-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7207813498199865419",
  "source": "GoogleMaps",
  "reviews": [
   "Husband took me there last year for our anniversary.  It was amazing!  Cannot wait until they are open back to regular hours and dining in.  Awesome drinks.",
   "Order your souffles first folks, they do take half an hour.\n\nAsparagus and steak was great. Scallops slightly undercooked.",
   "Took my son for his 19th birthday. He enjoyed everything. He starved himself all day in anticipation for the great food I told him about. Laura (our server) I hope I am remembering her name correctly was fantastic. She was attentive without being disruptive always giving us everything we needed to enjoy our meals and each other's company. The only thing I was disappointed in was my dessert 😢 I have to mention it because she had to get someone else to make it. I ordered Bananas Foster. It was so bland. It was just like eating vanilla ice cream with a few bananas on top. There has to be more to it than that. Or there wouldn't have been so many great reviews about it on here. I hope this review just gives room for improvement. Next time I'll just skip it though.  Steaks were PERFECTION!!!",
   "Fine dining. One of me and my Husbands favorite local restaurants. Love the owner. He always makes sure we are well taken care of.",
   "It was a really nice place, amazing food!  Our server was so friendly and did a great job!"
  ]
 },
 {
  "name": "Noah's Restaurant & Lounge",
  "address": "129 Summers St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/23239b50-932f-11ea-8069-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11580916909113534529",
  "source": "GoogleMaps",
  "reviews": [
   "Always a tasteful and well executed meal. On our last visit we had the Valentine Tasting Menu, and it was exquisite. I love that the menu is rotated here and changed based on availability and freshness of ingredients. Will definitely be making reservations again in the near future.",
   "A great time, good food, awesome service",
   "I ate at the bar since I was by myself, friendly service and amazing food.  Very impressed with the flavor and presentation.",
   "Quality.Tasty. Indulgent. If you're looking for  a ton of food regardless of taste, then this is not the place. But if you're looking for decadence in every morsel; attention to detail in service, presentation, and flavor, then Noah's is the place. Loved it!",
   "The food was delicious. Excellent waiting staff, I highly recommend this restaurant"
  ]
 },
 {
  "name": "Bluegrass Kitchen",
  "address": "1600 Washington St E, Charleston, WV 25311, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/236760cc-932f-11ea-a009-14b31f159f22.png",
  "tags": [
   "unique",
   "art",
   "food",
   "music",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11739519481798515298",
  "source": "GoogleMaps",
  "reviews": [
   "Wow. I loved my Vegetarian Burger. The place was soo interesting and informative. Postings for all the concerts in the area. Beautiful decor that fit the theme. I had a gin and tonic that was great and they have a wonderful selection of drinks to choose from. I definitely am putting this one on the must do when in Charleston list . I loved that the whole staff was friendly and helpful but not intrusive.",
   "Very hip joint! Live music. Cool art for sale on the walls and an awesome selection of cocktails! Our server had us laughing and enjoying ourselves while doing her job very well. The food all came out beautifully. A unique menu that changes frequently. Looking forward to another visit",
   "I like this restaurant. The service is always good and the food never disappoints. I had  dinner here with my partner on a recent Friday eve. Jeff had the pork chops with sweet mashed potatoes and asparagus and liked it very much. I had the fish and chips which were served hot and delicious and a very good spinach salad with fresh vegetables, warm bacon and strawberry vinaigrette- yum!",
   "Food and service is always top notch. Definitely one of our favorite restaurants. Love the atmosphere. Wine and beer selection is also very good. Highly recommend.",
   "Beautiful vibe and delicious big portion plates! Bar tender gets 5 stars for the amazing cocktails."
  ]
 },
 {
  "name": "Black Sheep",
  "address": "702 Quarrier St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/23cefc80-932f-11ea-a4f2-14b31f159f22.png",
  "tags": [
   "food",
   "brewery",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14766223068153500023",
  "source": "GoogleMaps",
  "reviews": [
   "The owner personally went up to every table to and checked to make sure everything was great. The drinks were amazing. The waiter was busy but still personable. I had a great meal in a great atmosphere. This was my first time to Charleston, WV and it was great",
   "Decent food. Good atmosphere but seems a little.....reserved. In that, I mean, staff seems more intent on talking among themselves & patrons seemed to keep to themselves.\nBeer was good. But weirdly, their website has NO beers advertised, nothing.\nIt's a brewery. In order to find out what they have available, you have to call. It's VERY odd.",
   "WE GOT FOOD POISONING! My friend and I were passing through Downtown Charleston  and thought this place looked good. we both ordered tacos and spend the whole rest of the night throwing them up. We then had food poisoning for the next 24 hours. If you order tacos here MAKE SURE THEY ARE COOKED CORRECTLY.",
   "Stopped for lunch, this restaurant has adequate seating for a party of 200! A fully stocked bar, bartender included! Wait staff is prompt and friendly. Dining area's appear clean and stocked with appropriate condiments. I ordered the barbacoa beef quesadillas and coke. The portion was plentiful, the barbacoa was extremely mild but flavorful. The choice of  cheese & flour tortilla complements the beef nicely.  On the side was a small portion of black beans mixed with corn an something else, it tastes like their take on pico \"maybe\". It was fresh and flavorful, excellent addition to the quesadilla. I requested a side of their salsa \"no up charge\". The salsa is prepared fresh, mild and packed with the flavor of authentic Mexican salsa! I was mildly impressed ☺. Coke was over iced, definitely ask for light ice. I scored them at 4 stars, solely on the price! My single quesadilla and coke was $13.50 before tip! I rate their price as 20% overvalued. However, I can see why they would need that additional 20%, their location and dining room size is what they are charging for in this instance. This would be a great restaurant to hold banquets, group lunches, celebrations etc. Honestly, Black sheep should market this highlight to bring in additional guests!!! Huge untapped growth potential!!! My opinion is the additional 20% cost is justifiable but unnecessary with further business development. To reiterate, I had a excellent dinning experience and will return in the near future! They do offer local delivery in the downtown area, I forgot to ask about any order minimums!",
   "Enjoyed the beer, an IPA. Chicken burrito was OK, appeared to have little chicken and more beans. Wife's Thai Peanut with tofu was better. Located in downtown area, staff was good, we arrived about an hour before closing and just needed a quick bite. We found street parking fairly easily and just walked to the restaurant"
  ]
 },
 {
  "name": "Dem 2 Brothers And A Grill Bbq",
  "address": "423 Virginia St W, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2427f236-932f-11ea-a5ce-14b31f159f22.png",
  "tags": [
   "eat",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=1033689027233301190",
  "source": "GoogleMaps",
  "reviews": [
   "Hands down, the best brisket I've had! Great smoke flavor, slightly crisp crust, and a fantastic rub...no need for any sauce. The ribs are amazing as well. The baked beans have the perfect amount of brown sugar, not too sweet...just a great flavor. This is a must stop for anyone in, or passing through, Charleston. I'm jealous that I live out of state and can't eat this regularly. I'm in town for another 5 days and will probably eat here 5 more times. As a bonus, BB King was playing the entire time I was eating. 👍",
   "Best BBQ we've had possibly ever. We went on a roadtrip to Charleston and was looking for a good place that wasn't a chain restaurant.  We couldn't have been happier with our choice  great service and the best sauce I've ever had. It could make my shoe taste good  great brisket and chicken. Also the baked beans were a special treat.",
   "The ribs had excellent  smoke flavor. I had asked for sauce to be on the side but instead they were on top. The wings were deep fried extra  crunchy. Sauces were a bit sweeter than I cared for. But the flavor of the meat made up for it",
   "Overall, it was pretty good. We had a late lunch, so I'm a little more forgiving that the brisket was a little dry. The pork was also more shredded than pulled, but that also could've just been what was left at the end of lunch. The sauce was pretty tasty, and the beans were really good - almost too sweet to believe they were beans! The portions are pretty fair for what you pay and service is decent but not great. Lots of TVs, if you're trying to watch some football.",
   "Neat inner city bbq joint. Flavoring was very good. Nice size portions. Great place to enjoy a cheap bbq platter."
  ]
 },
 {
  "name": "Rio De Grill Brazilian Steakhouse",
  "address": "3600 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/24752808-932f-11ea-b39d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=7833204794541507883",
  "source": "GoogleMaps",
  "reviews": [
   "Rio De Grill has a reasonably priced lunch buffet that, if you have tiny children (under 5), is a real deal. The MEATS! Our youngest loves the 'pepper' (what he calls the prime rib). The garlic bread is worth the price of admission.",
   "Great Service and Good Food. Endless meats. The pineapple and garlic bread were great. Looks like they are starting to update the decor. The flashing lights around the bar were alittle distracting along with the ribbon along the ceiling. It wasn't busy at all for a Friday Night. The chafing dishes could be shined up and bar refreshed. Overall a good experience and will definitely go back.",
   "If you love meats then this is the place for you! The variety of steak, chicken, pork, and grilled pineapple are excellent. The cold bar I don't care for, I feel like they could have a better variety of things. Worth the money tho if you are a meat eater.",
   "Great food at decent prices. Although it's a bit expensive, I would not say it's overpriced, especially for the prime rib, which is excellent! I would come here again. If you have a coupon it's even better!",
   "We were there with a group of 10 or 12 for lunch a couple of days after Christmas. The wait staff handled our group with ease. They continually brought out different types of meat, which were all pretty tasty. The garlic bread was awesome. My only complaints are that I wish they had a better variety of foods on the buffet. Also, would be nice to have a better selection of dessert. Over all, it was a great experience, and I would eat there again."
  ]
 },
 {
  "name": "The Block",
  "address": "201 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/24c36bb6-932f-11ea-b1ed-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "knowledgeable",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5718381775638712576",
  "source": "GoogleMaps",
  "reviews": [
   "Very fancy place with a more upscale clientele than the surrounding restaurants. The service was exceptional and very attentive. The prices are high as to be expected in a wine bar. The bartender was extremely knowledgeable about the menu and wine selection. However the Tapas Valencia we ordered was completely lacking in flavor and tasted almost like water. There was absolutely zero spice in the dish at all.",
   "Beautiful restaurant with a great atmosphere. Enjoyed several appetizers (the pulled pork tator tots were way too good to stop for a photo), and was very impressed with the flavor of the lemon caper chicken I had for dinner. Dessert was just... heavenly! The waiters were attentive and knowledgeable, and ensured a good evening as well. I'm looking forward to returning soon!",
   "Delicious food and nice atmosphere.\nI definitely suggest getting the olives if you are an olive fan (they are seeded though so keep that in mind).\nMy wife and I had the salmon and scallops and both were fantastic!",
   "Absolutely amazing restaurant.  A business buddy and I were in Charleston for the nite and this place was recommended by a local.  It is 100% as good as any restaurant in any major city of America.  Great wine list and wine steward and scrumptious food.  Loved the variety of choices and had a very hard time making a selection.\n\nI will absolutely be eating at this restaurant again and again on my returns to Charleston.",
   "Great cheese plate app and great burger. Lamb chops we're cooked perfectly. Not many bourbon house cocktails but it's a full bar with tons of wines and beers"
  ]
 },
 {
  "name": "Tidewater Grill",
  "address": "1060 Charleston Town Center, Charleston, WV 25389, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2543d424-932f-11ea-b427-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "delicious",
   "brewery",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13607321802790127788",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely wonderful! The food was amazing and tasted just as good if not better than it was presented. The staff were very kind and welcomed us with suggestions and kindness. The food we well prepared and the seafood was excellent an fresh!! I would highly recommend giving them a chance to wow you!",
   "This is over 2 trips. It feels little out of place or maybe because I'm not familiar with the area. The attempt to be a fresh seafood place is good. The seafood was actual very fresh but taste wise I think they fall a bit short. I wanted to going 3.5 stars. The servers a warm and welcoming. Thank you Chelsea for great service. It one of the better options available in the area.",
   "Stopped here from out of town. Our waiter was extremely friendly and informative, and they were very accommodating to dietary needs/choices. Management staff was also walking around the restaurant throughout our meal. It was nice to see the hands-on approach.",
   "This time at Tidewater I chose to dine at there elegant bar,however many times prior i have ate in the dining room with the wooden tables and fishery decor giving it a feel of a restaurant along the coast.\nI chose a porter beer bottled from great lakes brewery and it was wonderful.\nThere menu is full of fish entree’s ... catch of the day, juicy steaks ,delicious chicken dishes and many more  items ...plus appetizers, salads and tantalizing deserts.\nSomething for everyones liking but my choice was the fish and chips which went perfect with my porter.\nThe generous crispy melt in your mouth fish, seasoned fries and deliciously crunchy hush puppies was absolutely perfect.\nThe bartender was there making sure i had ever thing i needed and was very attentive.\nIf you want to make a impression on someone ,take a loved one out or just treat yourself  to a exquisite dining experience then go to one of the best Restaurants in Charleston Wv \n Tidewater Grill",
   "Over priced with average service.  I have had better fish at Long John silvers.  Not sure how this place stays open.  Chili's and outback across the hall serve better food with more polite servers.  Not impressed.  My friend ordered a salad with her meal and everything she did not want was on it.  The prices are ridiculous, the atmosphere is loud and bar/grill style not a fine restaurant as they try to advertise.  Would never waste my money or time to return.  At the prices they charge customers should not have to wave down the server."
  ]
 },
 {
  "name": "Tricky Fish",
  "address": "1611 Washington St E, Charleston, WV 25311, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/25b98c58-932f-11ea-bb7a-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3662715612450824329",
  "source": "GoogleMaps",
  "reviews": [
   "Very great tasting food at fantastic prices. The flavor was amazing! Will definitely visit again",
   "I stopped in Charleston overnight looking for a local place with delicious food that didn't cost a fortune.  Tricky Fish filled the bill perfectly!   Friendly folks and delicious food at a reasonable price in a clean, quirky setting.   \n\nHighly recommend the shrimp tacos with jerk seasoning.",
   "Food was excellent, we had fish tacos and a basket of oysters.I had not been there for a long time.  However, in January in Charleston you need to have a little heat on.  It felt like a dirty abandoned house.  I am all for retro and openness but it really needs a good cleaning.",
   "Had the catfish tacos.... very good... friendly staff.... we chose this place because they are pet friendly..... would have been 5 stars if the chairs were more comfortable. Will go back anytime I'm traveling through town again!",
   "Recommended by a friend and now I can recommend to anyone else. Really bright atmosphere with an eclectic vibe that would make anyone comfortable. Not to mention the tacos that I scarfed so fast I didn't even have time to take a photo! You gotta go!"
  ]
 },
 {
  "name": "Main Kwong | Chinese Restaurant",
  "address": "1407 Washington St E, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/260ed52e-932f-11ea-ab45-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6010020779340613342",
  "source": "GoogleMaps",
  "reviews": [
   "Really great food. We stopped here on a road trip. If I lived close by this would be my go to chinese take out joint.",
   "Amazing food! My favorite Chinese place to get take out and I will always recommend! Clean and friendly too.",
   "The food I got there 2night was amazing. It was so good & hot & was so fresh. The eggfu young was awesome. The service was nice & friendly. They was very quick preparing my 2 go order. I will definitely b going back there again. The Best Chinese Food. That I Have Ever Had Period. !!!!!!!😋😋😋😋😋😋😋",
   "I've been a customer for over 15 years. This is your basic Chinese cuisine you'd expect to find anywhere else. Everything is made fresh to order no worries about old food being served. But the quality is not the same anymore. My family used to order takeout every weekend as part of our family weekend tradition. Its just not there for me anymore. Staff is friendly but no wow factor in service. Food has become bland or overly greasy.",
   "I originally come from an area in California that has a lot of Chinese people from mainland China and Taiwan. Outside of New York and California it's really hard to find really good Chinese food, even though even the stuff in California and New York is American Chinese food. I had to give this a five stars because it is the best Chinese food I have had outside of California and New York."
  ]
 },
 {
  "name": "Plaza Maya",
  "address": "3112 Chesterfield Ave B, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/26594bae-932f-11ea-9313-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10877034718943302479",
  "source": "GoogleMaps",
  "reviews": [
   "Very good Mexican food of the many choices in the Charleston area. Everyone in my party was pleased with their entrees. Nice decor.",
   "I wish I could rate this local business higher but I just can't. The two stars they have received are for some of the staff being 'kind' and their ability to accommodate large parties. The remaining stars are missing for several reasons. \n\nFirstly, the food. The food tastes cheap. While some of the dishes sound great on paper the execution is largely let down by the poor ingredients. My family often find ourselves here to give them another chance due to their ability to seat our extended family but they have continued to drop the ball. More often than not we return home and the majority of the family finds themselves sick. \n\nSecondly, the service. While some members of the staff are very helpful and effective waiters/waitresses the majority aren't attentive. They don't watch the tables and act like it's a chore to take care of the guests. When dealing with management it is apparent where this mindset stems from. \n\nI want to see this Kanawha City business find success but currently they aren't on the right path.",
   "Great Mexican food. Fast and friendly service. I've hada quick lunch and a relaxing dinner there and it's good for both. Large portions and good selection. Can seat large groups but also had some cozy spots for just two. A great place in Charleston to grab a bite of Mexican food.",
   "My first visit. The food was very good. It was hot too. Very friendly atmosphere. The restaurant is clean and comfortable seating too.",
   "Loved the place. Unexpectedly good! The servings were big, the price was reasonable, and the food tasted great! The servers are really polite and helpful. Special shout out for the hot sauce! It is close to perfection!"
  ]
 },
 {
  "name": "Lola's Pizza",
  "address": "1038 Bridge Rd, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/26a4379e-932f-11ea-8df6-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "kids",
   "food",
   "walk",
   "eat",
   "food",
   "drink",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1856734693934252091",
  "source": "GoogleMaps",
  "reviews": [
   "It's OK. The food is good. But, I wish they were more generous with the toppings to make the price seem more palatable. \n\nThe place is small, but very clean and pretty. My wife thought their gluten-free crust was the best she's had in this area. I tasted it and I could not tell the difference between that and regular crust.\n\nThey want you to drink alcohol, so the water glasses are tiny (see picture). They put their water to serve on these bottles that are too small. What's wrong with bigger pitchers with ice? Not everyone drinks alcohol or sodas.",
   "Everything we had was delicious! The pizza was excellent. The veggie sandwich was delightful. Considering the freshness of the food, the prices were very reasonable. What I loved most was the \"kids plate\" for my son. Having the option of a healthy fruit, meat, and cheese plate was a welcome surprise compared to the standard kid's fare (mac & cheese, chicken tenders, or hot dogs). We will certainly be back soon!",
   "Delightful designer pizza and other salad type things to eat plus wines and a wonderful white sangria!  We try to get there whenever we are in Charleston.  A bit difficult parking, one can always park up the hill and walk down to the restaurant.  Work off the food!",
   "I've been dreaming of being here on the patio enjoying either a drink or a meal.  It far exceeded my expectations.  I can't wait to be back, and enjoy an evening beer on the patio.  Food was excellent, and very fairly priced.   Worth 6 Stars.",
   "The food was very good and used fresh ingredients.  Part of our order was wrong, but corrected very quickly. Delicious and well plated."
  ]
 },
 {
  "name": "Grazianos Pizza",
  "address": "243 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/26e8bada-932f-11ea-9222-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3668605189777216195",
  "source": "GoogleMaps",
  "reviews": [
   "Been going here since I was a kid. Love the pizza. Always consistent and taste great. Only thing I don’t like is an older woman that runs the register can be kind of rude. Not too welcoming. But she doesn’t bother me. I look past it because I enjoy the food so much",
   "Ok. I had their pizza and wanted to try their lasagna and I finally had a change to go back and all I can say is great food at a great price. I paid about $12 for all of this... I know right!! Well come try it. \nMeat ball at the back.\nHome made bread \nPizza pepperoni \nLasagna.",
   "Listen, I used to live in Charleston and I ate at various family owned restaurants but NOBODY compares to Grazianos. They make their food with love and care. The food has that real Sicilian taste that makes you feel like you're eating in Sicily. Workers are friendly and professional and cares about your experience. They will always have my business.",
   "When I call, the responders are pleasant and efficient. Delivery is prompt, the order is accurate, the food is fresh/hot, the delivery guys friendly and helpful. Graziano's is a solid and appreciated downtown Charleston business. I recommend the Sicilian salad.",
   "Terrific New York-style pizza"
  ]
 },
 {
  "name": "The Chop House Charleston",
  "address": "1003 Charleston Town Center, Charleston, WV 25389, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/27309976-932f-11ea-b1f2-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=14230558514376138973",
  "source": "GoogleMaps",
  "reviews": [
   "Took my mother here for her birthday. Great food (if a little too fussy for my style) and she loved it. The side portions are family style and none of us left hungry. I would take advantage of their weekend deals if going for a date night. I can appreciate the care in ingredient selection and it tells through the food. Overall good experience for my mom's birthday.",
   "Exactly what we wanted and expected by a nice restaurant in the Charleston area. Our waiter was extremely nice, helpful, and a great person overall. Steak was phenomenal as was the cheesecake. Bourbon selection was not bad at all either.",
   "Went for our 15th wedding anniversary. First time going, and will definitely go back. The staff is amazing,  only topped by their amazing menu.",
   "The service was excellent. We ordered the Lobster bites as our appetizer which had decent size chunks of lobster. I ordered the Beef Wellington and was disappointed. The puff pastry was not very crispy and there was an odd sour taste in the layer between the filet and pastry.",
   "I always feel like I’m in downtown NY when I eat here. Love the food,atmosphere and drinks. Me and my Husband go frequently."
  ]
 },
 {
  "name": "Recovery Sports Grill",
  "address": "600 Virginia St E, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/276f779e-932f-11ea-bfe2-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "kids",
   "delicious",
   "drink",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16027083821905896693",
  "source": "GoogleMaps",
  "reviews": [
   "Great sports bar with a HUGE set of TVs, so any game you want will probably be on. Add to that, the personal speakers at each table allow you to select the audio for the game you want. \n\nFor food and drink, there's a great selection of craft beer on tap (Devil Anse IPA FTW!) and tasty bar food. \n\nSeriously, if you don't have a great man cave at home, this is a great option.",
   "I love the Buffalo Chicken Wontons! The chicken tenders are a favorite dish for my wife who reports she has never had a bad meal here. Chicken is moist and the portion is large. 2 or 3 kids could easily share this plate.",
   "Today, several of my co-workers and I had lunch here. It was my first time eating at Recovery. The server was excellent. There were 14 of us....big table! He was wonderful, very courteous and attentive. I had the Sizzling Cheesy Chicken dish. Delicious! I will definitely come back. The place was clean and very busy at the time we were there. Everything was great!",
   "This is a very nice and large sports bar that is well maintained. It wasn't very crowded when we arrived however the service at the bar was still slow. The margarita was nice and refreshing on a hot day. The chicken tacos were so dry they were they hard to eat. Most likely pre-made chicken that was reheated to long? The draft beer I ordered had a layer of soapy ice float to the top which I couldn't drink. Probably the glass wasn't rinsed and dried properly before being frosted?  All places have a off day or period at times so I'll return in the future to give it another go.",
   "Food was fantastic, very filling and came at a decent price too. Fun sports bar atmosphere inside, liked the green carpeted floors that reminded me of putt-putt/mini-golf. Large space inside, perfect for groups or other large parties, staff was pretty quick and attentive to our needs. Happy we chose to eat here while in Charleston!"
  ]
 },
 {
  "name": "Fazio's",
  "address": "1008 Bullitt St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/27b8dce2-932f-11ea-96ad-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "family",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11312319581987105665",
  "source": "GoogleMaps",
  "reviews": [
   "It's not fair to the other places I've been to compare this review to those because tonight SHE was with me again and this is where we first met so I'm already taken with everything about this place. The service was consistently superb but truthfully I wouldn't have known of it was awful because all I could do was look at her and talk to her and pinch myself inside that we were here together again. She is so spectacularly wonderful and infinitely beautiful in every sense of the word both inside and out so you could not remove the joy off my face tonight with a chisel and a hammer. And so you begin to see why I love this place so. The meal was just delicious and the experience outstanding.",
   "Waitress wasn't very attentive but she was nice.  Food priced a little higher than I would have expected, especially considering how old the building is.  Food was good and portion sizes normal.  We asked for oil for the bread and they charged us $1.50 for it without mentioning.  I'd give them a 3.5*. I eat there every other Black Friday dinner (once every 2 years) and this was my 4th time there.",
   "It sure is an institution in Charleston. My family has been coming here my whole life. My mother even says she came here as a youngster. I am a veal lover and they do veal really, really good here.",
   "Excellent as always",
   "Our tennis doubles group went to Fazio's for a family dinner. They were very welcoming and have an extensive menu. We had a great waiter and enjoyed delicious meals while visiting for nearly 3 hours - no rush. Thanks for your hospitality Fazio's!"
  ]
 },
 {
  "name": "Bricks & Barrels",
  "address": "1214 Smith St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/27fa2bee-932f-11ea-a5b8-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "free",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6211211915503853396",
  "source": "GoogleMaps",
  "reviews": [
   "Went for a work dinner and really liked it! The atmosphere is peaceful and intimate, with a beautiful interior design. The cocktails were delicious (slightly strong - but not complaining!) and the food was also great. I got the parmesan encrusted chicken with risotto and asparagus. There was enough for me to take home for lunch for the next day, and it still tasted just as good! The strawberry shortcake I had for dessert was possibly the best I've had! Definitely would recommend.",
   "Great ambience, as well as tasty food. My only complaint was there was no appetizers offered outside of having to buy an appetizer. Thus resulting in being slightly less than completely full at the end of our meals. This could have been easily avoided if something small was offered to guest free of charge, such as bread and butter or chips and a dip for example. I feel as if you buy two 45 dollar steaks, the appetizer should come with it. Otherwise good food and a nice atmosphere. 👍",
   "Had a overall wonderful experience for a New Years Eve dinner with the family.  They were able to accommodate a large group.  Wait staff were attentive and on point, even with the large group.  They offered a special meal with both wine and bourbon pairings which were excellent.  Only criticism would be over the wife's scallops on her surf and turf, they were cold and rubbery.  Will definitely be back.",
   "Experiences have been too mixed and too unreliable to recommend. Calamari is always very nice, but hardly 5 star.  Linguine with seafood was very rich and tasty, scallops were done perfectly and normally I stay away from them. Despite this, we had written off Bricks and Barrels years ago due to consistent and stunning shortcomings for such high prices, like a $45 australian lamb that ended up being four nuggets on ribs, with so much fat they were inedible. That's $11.25 per nugget. They also seem to have a delusional obsession with reservations; we were twice turned away even though the place was mostly open. On one of those occasions we just had appetizers at the bar and the place never even close to filled up. The private barrels are cozy if you can get one, even though they're not taken, as a former restaurant host, that's like burning money. The decor is nice and rustic, but the glass top barrel tables end up being too awkward to sit at for long, and shouldn't lean on them.  So we went one last time more out of reckless abandon even though we reviewed their disappointments on the way. We again could not get any open table, sat at the bar with good beer selection, but and were served pints not even close to filled, did ask for them to be topped off, but our moment of trust was already punished with this \"beertrayal\", so we did not stay for dinner or even another round. This can be a problem with places serving too much head and skimping on the beer, so yes, I have this gauge, but I think this is a record low pour. I really wanted this to work... never again.",
   "We reserved a barrel, which we were assured was confirmed, only to find out we would not be eating in one. The hostess informed us that waiting for one would be a couple of hours (someone was sat in one the first 15 minutes we were there). A couple people wanted burgers, which we were then told that they weren't doing \"handheld items\" this weekend. The service was absolutely horrible. Honestly our waitress acted like she couldn't have cared less. Food took forever, along with anything else we needed. I ordered the seafood alfredo, and the pasta came out cold. It was disgusting. For the price you pay for this food, I expect more, and so should anyone else. And if you reserve a barrel, you should get a barrel. I'm glad I didn't show my disappointment while I was there, because from the sound of these remarks from the owner, they enjoy being sarcastically caring, and don't really care if people are displeased. This establishment will not last. Save your money and go elsewhere."
  ]
 },
 {
  "name": "Quaker Steak & Lube",
  "address": "2931 Mountaineer Blvd, Charleston, WV 25309, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2839f43a-932f-11ea-8f86-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14255364786932757995",
  "source": "GoogleMaps",
  "reviews": [
   "I would not come back here if they paid me. I’ve been to other locations so I know to expect, at best, about 3.5-star food. This location is 1-star operated. Apparently, even with five people at times, they can’t handle the simple task of managing the seating. I went as a party of three.  Twenty minutes later, they took a walk-in party of four ahead of me. During the enlightening wait for a table, I saw someone seated when first walked in had barely received any attention anyway. I saw servers and managers milling about the front desk during their peak time. If you value your time, go elsewhere. There are plenty of options in this area.",
   "Great place to eat for good prices. Tried the new Top Sirloin today; it was amazing, and only $12.99! Fast, courteous service with a smile. Always a favorite of mine for lunch, dinner, or a fun night out!",
   "Fantastic food, fantastic service.   Had a group of 16.   Speedy and everything was right the first time.  Tommy was our server and went above and beyond to make sure we were satisfied.   Definitely be back.",
   "This wing establishment is well known and this location is what you would expect if you have been to any other in PA. The wings are awesome. I don’t usually vary from ordering the wings because this is why you should come. The pic is the Louisiana sauce. Add some Tabasco and beer and that is it for me. This place has been around or a long time so the locals know it. If you are staying next door at the Hampton, stop by.",
   "Last time we went, the waitress wasnt friendly, my dad's order was messed up and it took talking to the manager to get it straightened out and still ended up over paying. Food was okay but some of it seemed old. Or like it was cooked out of order. We probably wont be back for a while which is sad because the one in my hometown is great and I miss the food. But this experience was not worth it."
  ]
 },
 {
  "name": "Mi Cocina de Amor",
  "address": "711 Bigley Ave, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2884b90a-932f-11ea-ac97-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2889130194154272843",
  "source": "GoogleMaps",
  "reviews": [
   "Best Mexican in Charleston. The food never disappoints and the service is great.",
   "Really great Mexican food in an authentic atmosphere. The fish tacos are especially good, and the chips with queso are good. The enchiladas are good, but the cheese seemed wrong - was it cheddar?",
   "Lovely restaurant nestled in Charleston”s west side. You are greeted warmly as you enter and treated like family throughout your dining experience. This restaurant has a beautiful atmosphere, generous portions,, friendly staff, and delicious cuisine.  I give this restaurant my highest recommendation.",
   "Best Tacos I’ve ever had!  Always great food and friendly service. Can’t go wrong.",
   "I don’t know how or why this place has such great reviews. It was nothing but a joke. Do not recommend. Thankfully their other restaurants is phenomenal, Gonzoburger, it seems like they stopped caring for this place"
  ]
 },
 {
  "name": "Suzi's Hamburgers",
  "address": "239 MacCorkle Ave SW, South Charleston, WV 25303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/28cc709c-932f-11ea-affa-14b31f159f22.png",
  "tags": [
   "foodie",
   "affordable",
   "eat",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=8711460274766997253",
  "source": "GoogleMaps",
  "reviews": [
   "Use to love their biscuits with cheese dripping off them. Got one this morning and once again  Its like they put it on and then wipe it off.  I rather pay even more for the biscuit then I already do to add cheese. To be able to taste it and for  it not to be so dry!",
   "Loved this place and wish it was in my home city! No frills simple breakfast with a HUGE biscuit and tasty gravy at a very affordable price. Very busy the entire time I Was there. Would not recommend for folks that like pretentious barn wood/edison light foodie places, but if you want a filling and tasty breakfast you need to go here.",
   "Just driving through, but so very happy we stopped here! Best sweet tea I have had in years! And the cheeseburger and fries were amazing. But, the sweet tea 😍",
   "THE girls working today were wonderful.  Loved the cashier Kaley was very personable.  Great cashier.  The cheeseburger was very tasty.  Like home made.  The beef tasted fresh.  Clean restaurant and fast service.  Ok so down falls only sauce available was ketchup , mustard , mayo and hot sauce.  They had no slaw either.  The frys tated good but was thin cut.  Which is cool if you like that type.  The price was decent as well.  The fried apple pie was not something I personally would do again.   So I give this restaurant a 3 or of 5  all over.  Service alone I could have done a 5 and the burger alone a 4.5 . So if your in the area stop in and try.  I've also been told breakfast is wonderful from other guests....",
   "Great food. You get a lot for your money. Very busy place, they are staffed up and handle the crowds very well.  Within walking distance from Joe Holland Hyundai. We were able eat breakfast while our car was getting worked on."
  ]
 },
 {
  "name": "Chick-fil-A",
  "address": "2509 Mountaineer Blvd, Charleston, WV 25309, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/290d9888-932f-11ea-9d68-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=320105072922692620",
  "source": "GoogleMaps",
  "reviews": [
   "My recent visit to Chick -fil- A was very good. The staff was pleasant and friendly. We got our orders quickly.\nThis is the first time that I have had breakfast at  Chick -fil-A. I ordered a bacon egg and cheese muffin with tater tots. The sandwich was good and I was surprised that the tater tots weren't greasy at all.\nThe restaurant was clean and well maintained.\nI will definitely return when I am in the area.\nI will give them a big thumbs up!",
   "The WORST experience I’ve ever had at a Chick fil a in the 6 years that this Chick Fil A has been here. I got into the drive thru line at 10:18am and waited until 10:31am to get into the line where they take your order. I asked if they were still serving breakfast and the woman said “No they just called it” I then said I’ve been in line since 10:18am and she said “Sorry but they won’t make any more breakfast back there” and I can’t even leave because the line is so long that I can’t reverse out of the drive thru. This wasn’t a problem in years prior to this. I have came to the drive thru at 10:31am before and it was fine. This just ruined my whole morning.",
   "My husband and I had breakfast and it was such a wonderful experience. The food was wonderful but most of all the staff. They are above and beyond. They are so polite. Thank you! You guys are the best. Merry Christmas.🎄",
   "This place is Awesome!  They employee a lot of West Virginians.  You can tell the work environment is great.  Our food was ready before we left the counter even though the place was packed.  I will go back to the South Ridge Chic Fil A",
   "I honestly just come here when someone else wants to. Food is usually ok. But not excellent or perfect. Kids like the play room. They need more space for handicapped seating inside."
  ]
 },
 {
  "name": "Chow Thai",
  "address": "426 1/2 B Shrewsbury St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/294ee794-932f-11ea-8338-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "comforting",
   "eat",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17484160797276368829",
  "source": "GoogleMaps",
  "reviews": [
   "Chow Thai is one of the best restaurants in Charleston, WV. The food is outstanding and the customer service is wonderful. Highly recommend giving them a try whether you have time to sit down or you are on a time crunch and takeout. Also, Charleston 2 Go provides delivery service for them so if you can't make it to their downtown location you can have Chow Thai delivered right to your door at home. We try to eat there at least once a week because it is just that good. You won't be disappointed.",
   "One of the few Thai place in Charleston. Menu is simple but most of the dishes are tasty. Recommend the Thai tea and Panang curry",
   "Great place to eat and very tasty and delicious. Plates came out very clean and food was displayed excellent. Inviting and comforting atmosphere. WARNING:the spice levels are hot, i like decently spicy food but medium was a little hot so try no spice if you cant handle spicy foods.",
   "This place is a little tricky to find, but it's worth the effort. Small dining room with about 10 tables. Friendly and helpful staff. The food is fantastic. The wife gets Pan Kee Mao with chicken, I get Massaman Curry Chicken with fried rice. Both are very good. Food is always very fresh and hot. Anything above \"Little spice\" is quite spicy, but I go up to \"medium spice\" because I like a kick to my food. Price is very reasonable for the quality and service. We eat here a couple times per month.",
   "I arrived just before closing today and mentioned this was my first time there and asked for a curry recommendation.  The young lady recommended their C4, Chiang Mai noodles with chicken.  It was an amazing dish.  The taste is awesome.  I will be back."
  ]
 },
 {
  "name": "Nosh Catering & Carryout",
  "address": "709 Ruffner Ave, Charleston, WV 25311, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/299ba81e-932f-11ea-951c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12878813875828762027",
  "source": "GoogleMaps",
  "reviews": [
   "The place is tiny, but adorable. I know it's a carryout place but if you manage to snag a table I recommend eating in for the servers are lovely and friendly folks! It's a little pricey for two of us it was about 30$. I personally had the philly chicken and fruit water with chocolate cake and it was delicious!",
   "I love the food here!  The BLT Smoked Salmon is the best thing on Earth, until Thursday. Thursday the have Monte Cristo. AAUGH love it!",
   "Everything I've had  at this restaurant has been EXCELLENT",
   "Beautifully decorated, great atmosphere, friendly staff and delicious food. My 9 year old is still talking about how delicious his grilled cheese was. Will definitely be back.",
   "Great food!  Great people!  I had their shrimp tacos. My friends got Chef salad, Poboy and grilled cheese. For desert my friend got the bread pudding which he said was outstanding.  Located on the East End, check them out!"
  ]
 },
 {
  "name": "Swiftwater Café",
  "address": "405 Capitol St #105, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/29e5a9ae-932f-11ea-acb4-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18368454906490221301",
  "source": "GoogleMaps",
  "reviews": [
   "Swiftwater Cafe rocks! Its food is fantastic; owner and staff are good down home folks that run a great little business with way better food than large chains do! We were visiting in from the Northern Panhandle of WV and just stopped in. Will definitely recommend and be back on our way through again! Thank you Swiftwater! :)",
   "Nice little downtown cafe. Fast service and very nice staff. The breakfast was good standard fair of eggs and meats. We enjoyed the fish on the wall too. ",
   "they have the best fried potatoes around. good place for breakfast. fast and reasonable.",
   "Nice place and good food. I have went there many times while working in the area",
   "Tasty burgers on Wednesday and Friday."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "91 RHL Blvd, Charleston, WV 25309, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2a2a63a8-932f-11ea-9de1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1946804061787524688",
  "source": "GoogleMaps",
  "reviews": [
   "My husband and I love to split the Outlaw ribeye. It’s delicious and large enough to easily split. Look for their draft specials and they make a good Old Fashion. Service was incredible the evening we were there.",
   "Food and service was great. Steaks to perfection.  Waitress was extremely courteous and very pleasing to accommodate our wishes ang questions.\nI had as a salad with my steak the strawberry  fruit pecan salad.  Best ever had. We will return.",
   "It is pricey! Aside from that, the food is so-so. Once I ordered a steak which was good (expensive, but good). Another time I ordered the salmon but it was so, SO fishy I ate a couple bites and had to bring the rest home to give to my cats. The atmosphere and wait staff are nice, but you can find better food at a better price elsewhere.",
   "Absolutely my favorite steakhouse chain. The food is always above my expectations and the service is generally spot on. My drinks have very seldom been below half a glass. Also the decor makes for a very Western experience that lacks in competing chains. The price is fair for the quality food and service provided.",
   "I love just wished they didn't leave the check as they set the food down for the main meal. I think this must be a company training policy thing because every location does it to me. I feel like they are going to to forget to come back and give me more drink because I always drink a pitcher of water at each meal. Plus Everytime they do that they knocked themselves out of us getting dessert and a bigger tip."
  ]
 },
 {
  "name": "Nawab Fine Indian Cuisine",
  "address": "200 35th St SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2a6d8752-932f-11ea-ae9d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16338019573591961574",
  "source": "GoogleMaps",
  "reviews": [
   "Staff was attentive but not overbearing, food was very good, prepared well, and typical of Indian restaurants. A good option for Indian cuisine in the area!",
   "The staff is friendly and helpful. Food was so tasty. Large variety on the buffet. Great way to try new things.",
   "Nothing to beat Nawab in Charleston. Have been to other indian restaurants in Charleston and I must say Nawab is light years ahead and I hope it serves the same great taste and quality in the coming years! We had awesome food and hospitality whenever we go there. Kudos and keep up! You are the best in Charleston!",
   "Food was very good.  Excellent value for the price, and good service too.  Every single thing I tried at the bar was delicious.  If there was ANY complaint it would be there were a few older Naan up at the bar that were not fresh, but I was there after lunch hour.  But thats being very picky.  Will be back again and again.",
   "Went for monday buffet. The place, people and food were amazing. Good pitstop in west Virginia."
  ]
 },
 {
  "name": "Brick Salt Bar+Kitchen",
  "address": "200 Lee St E, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2ab00a50-932f-11ea-bd22-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12246343347751154997",
  "source": "GoogleMaps",
  "reviews": [
   "Great restaurant. We came here because we were staying at the Marriott. Drink prices are reasonable.",
   "Was there for breakfast as I was staying there.  Had the buffet  pretty much the same as in every hotel but you had to pay 14.   Really much for what it was",
   "Great Food and Service! This hotel bar and restaurant had the best grilled chicken ceasar salad I have ever had and if you only knew my addiction to this particular dish you would know that is saying something! The room service menu paralleled this menu and that service was outstanding as well.  I highly recommend this bar and restaurant anytime of the day or night for a quick bite or full dinner. The Moscow mule was also top notch!👍🏻",
   "Fantastic food and service.   I fully recommend Paula at the bar.  She’s very attentive and a gorgeous gorgeous smile.  I had the blackened catfish.  I lived a long time in the south and this catfish was terrific.  Really really good.  Highly recommend",
   "Another great dinner at a place that much of Charleston has not yet discovered. The Shrimp and sausage with pasta in a deliciously spicy red sauce was superb. Good service and nice metro ambiance eating in the lounge area"
  ]
 },
 {
  "name": "Sitar of India",
  "address": "702 Lee St E, Charleston, WV 25311, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2af529de-932f-11ea-84be-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17345702070099368469",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to get Indian buffet. The manager and staff were genuinely good people. Recommend it, if you are in Charleston and looking for good Indian food. Good vegetarian options.",
   "Words can’t describe how excellent this was. Even doing takeout, the ensured hospitality was displayed. Not to mention the food was packaged and prepared flawlessly. \n\nI can’t believe it took me this long to discover this place.",
   "The Sitar is a good one and has been around for maybe 20 yrs. I stopped by this evening for takeout and they did it up right. We have an Indian population in town so they don't \"dumb it down\" for the American palate. As said, this is a good one.",
   "First time ordering from here. Outstanding food! I'm just passing through the area but would definitely come back if in the area again.",
   "Great place to eat! I like how they have different options from day to day. Staff is very personable and ready to accommodate."
  ]
 },
 {
  "name": "Cozumel Méxican Restaurant | Corridor G",
  "address": "1120 Fledderjohn Rd, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2b40133a-932f-11ea-a470-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "drink",
   "eat",
   "food",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5072855354174416878",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food! My husband and I went for Valentine's Day dinner. They were pretty busy. However, they were prompt and checked on us frequently. We don't come to Charleston often, but would undoubtedly eat here again the next time we are in town.",
   "Wendy is THE BEST waitress...  NEVER  a bad meal. Always clean. No Mexican restaraunt in the state measures up to It!!! 2 locations can be found..... Ashton place shopping area and St. Albans near old rivers edge restaraunt.  Most authentic Mexican flavors I have ever had. We will ALWAYS go there for mexican°",
   "Cozumel is a fantastic place to eat. If you enjoy good Mexican food this is the place to get it. If you appreciate a friendly attentive waitress eat here.if you enjoy life entertainment while you're having your meal this is the place to go. With the authentic Mexican decor and widescreen TVs I would recommend Cozumel to anyone passing through South Charleston.\nWhen I was ready to leave my waitress made sure I had all the necessary containers to take my leftovers with me. A bag for the chips a cup for the salsa a go-cup for my drink and a handy box for the remainder of my tasty fajita.",
   "Quick to serve, great drinks, fantastic food!! Love the atmosphere and the staff! That cozumel dip just doesn't quit! 😋",
   "This place is actually kind of tasty. But unfortunately I cannot call this a Mexican restaurant as I am from San Diego and I've had real Mexican food. However the atmosphere is great, the people that take care of your orders are always very friendly, the outside serving area is actually nice when it is hot outside, and they are very expedient when it comes to taking drink orders. I came here for a going away party for one of my fellow coworkers and they made sure that everything was taken care of a hundred percent while we were there. No questions asked I would definitely recommend going here."
  ]
 },
 {
  "name": "Smokehouse",
  "address": "1549 W Washington St, Charleston, WV 25387, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2b8ae1fe-932f-11ea-95ad-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2772991330754091742",
  "source": "GoogleMaps",
  "reviews": [
   "They are slow when you go in but they are exceptionally slow when you were picking up. We waited over 50 minutes for 1/2 club sandwich. I checked on it twice in person, and the third time I called because there were people at the crowded front door who were not wearing masks, including a Dunbar police officer. But then they told us it was ready and would bring it right out. We knew there was one car ahead of us but 4 others we're at the front door besides those of us waiting in our cars. \n  After 8 more minutes (total= 56 minutes) after not seeing anyone, we left. If the sandwich really had been ready and sitting there, it as well as the fries, would have been soggy. We would never have left Cross Lanes. Had they told us it was going to be over an hour and still not receive a simple sandwich we would have come back when they were better prepared.",
   "Great food great prices! Comfort food at its best.",
   "Location is not the best area.  Food is amazing tho. Nice, friendly staff. Good community atmosphere",
   "Best wait staff in Charleston!  We often go for breakfast and are never disappointed!  Our one place to eat breakfast in Charleston that never disappoints! A+!",
   "I'm going to go with the overall environment and conversations and food here. The environment is very chill. They have a dinning area, bar,  pool hall and gambling area. The employees are very welcoming and friendly. I ordered the Ruben and fried mushrooms. The Ruben was so fresh and enjoyable but the mushrooms tasted like they had freezer burn and then cooked. I couldn't eat them. I will soon visit again and do an update. 🙂"
  ]
 },
 {
  "name": "Ristorante Abruzzi",
  "address": "601 Morris St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2bcdb768-932f-11ea-8ed1-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9164099763285622198",
  "source": "GoogleMaps",
  "reviews": [
   "The food was excellent, with both moderate prices and more expensive. Half a dozen specialty cocktails (I had the Godfather, whisky and amaretto), a variety of wines and a so-so beer selection. We were celebrating a birthday and staff went out of their way to accommodate us.",
   "Excellent service and food selection. Enjoyed the New Years Eve special of stuffed flounder. Others at the table order pasta dishes which were stated as delicious.",
   "Amazing food and wonderful service.  Tremendous restaurant!",
   "FANTASTIC!!! Everything was fresh and wonderful from the appetizers to the entree’s to the desserts! The new chef has out done himself with great flavors and amazing dishes. The owners and the chef have created that Italian homemade meal experience. Charleston’s next top restaurant!!!",
   "As a former employee of Riatorante Abruzzi I can say that they are a very good resteraunt. The talent in the kitchen is unbelievable, they have some of the finest chefs I've ever met who truly put passion into their food and take pride in what they serve to customers. The wait staff is also very excellent, they have very friendly and well trained servers who will make sure your dining experience is as perfect as it can possibly be. On top of all of that they have very friendly owners who listen to customer feedback and ensure you thoroughly have a good experience.\n\n10/10 if you ever want to take your significant other out for a luxurious night or want to stop by for a well cooked meal this is the place for you."
  ]
 },
 {
  "name": "Ichiban | Pan-Asian Cuisine",
  "address": "103 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2c1bfe88-932f-11ea-b011-14b31f159f22.png",
  "tags": [
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=16571940364882992990",
  "source": "GoogleMaps",
  "reviews": [
   "I really appreciated the cleanliness of this restaurant. Our bartender was very sweet with a great attitude. It is quite pricey for the size of the portions you receive. I'm not much into sushi but I'm always into trying places that are new to me. The smoked salmon had a slight grayish tint to it instead of pink? My date loved hers so I'll go with her opinion since she loves sushi. The service was spot on with a attentive staff.",
   "This is the best Sushi in WV.  The quality for the last 10yrs has been outstandingly consistent.  I love those bearded Sushi Chefs.  The  bartender  makes an amazing Old Fashioned.  We have too many memories here to share in one review.",
   "Matt and Caleb are making the sushi with love!! The sushi is beautifully crafted and don't go in looking for cheap sushi rolls beacuse you won't fond it here! Totally worth it!",
   "This restaurant never fails to deliver! Every bite was on point from the appetizer to the salad to the entree to that lucious chocolate cake. Perfect way to celebrate an anniversary!!",
   "A great restaurant in the heart of downtown Charleston which offers cocktails from the classic Old Fashion and Manhattan to the uniquely asian-inspired green tea martini. The  is phenomenal and prepared by local legend, Chef Evan. From presentation to taste and texture, the sushi and sashimi are the highest quality and presented with culinary flair. Be warned that prices are above average, but understand that the restaurant uses the highest quality ingredients and the size of the restaurant limits the number of daily patrons. Our friends Julie and Keith were thoroughly impressed as well."
  ]
 },
 {
  "name": "Los Amigos Méxican Restaurant",
  "address": "2911 7th Ave, Charleston, WV 25387, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2c616c26-932f-11ea-b7fd-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14095011922663073150",
  "source": "GoogleMaps",
  "reviews": [
   "Food was the best Mexican I have ever had. Price was perfect for the amount of food you receive. The server was amazing. We had a all around great experience and will definitely be making plans to come back!",
   "Food was excellent.  Portions were great.  And the staff was incredibly nice to me.",
   "Friendly staff, love the color and decor, love these two desserts!",
   "Best Mexican food I have had in years.  The chunky guacamole is nice.",
   "Super nice people, great food. Service has always been fast. Lots of parking space, away from busy traffic. Good place to ring friends and have a leisurely time. Order a Margarita. A second Margarita? No! You need to make it back home, remember?"
  ]
 },
 {
  "name": "The Grill",
  "address": "117 W Washington St, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2ca06fc6-932f-11ea-8656-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1659955713359805286",
  "source": "GoogleMaps",
  "reviews": [
   "A West Side institution! The place to get good home cooked meals and friendly familiar hospitality. GREAT burgers, wings, hot dogs, and daily specials like fried chicken with mashed potatoes and green beans.",
   "Local greasy spoon with lots of character and characters. Tried out the cheeseburger and fries and they did not disappoint. Definitely want to go back and try out  more of the menu.",
   "Best fried bologna sammy! Cant go wrong with the hot dogs or burgers either, fantastic hospitality and food.",
   "I ate a delicious garden salad. Everything was fresh. The unsweetened ice tea was very refreshing.",
   "I absolutely love this place! They have the most delicious food and even better people there to take care of you. Their taco dogs are amazing."
  ]
 },
 {
  "name": "Chin's Restaurant",
  "address": "4114 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2cdeba1a-932f-11ea-bab3-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4548979017382481193",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent locally family owned. Serving authentic dishes with large portions. Come hungry!",
   "They are charging a 15% service charge on all orders.  No explanation why other than what’s going on.  Taking advantage of the current situation.  Price gauging at urs finest.  Will never eat here again.",
   "I may have already reviewed Chin's, but since I was asked, I will say it again. This restaurant is a MUST. Everything is fresh. Everything I've tried is wonderful, and I've been all over the menu. Soups, original egg rolls, Rangoon, main dishes; it doesn't matter. You'll find each superior to similar dishes (but not exact) offered at the typical Chinese take out establishment. Unlike the typical, Chin's is unique, with recepies handed down along with a superb dedication to service. Go. Try anything ( and I HIGHLY recommend the Tahitian Chicken). Enjoy.",
   "Egg rolls not cooked, pineapple chicken was awful, a breaded chicken patty sliced  with a few pieces of pineapple and a small container of rice.",
   "Great food made me feel like I was back in California will be back one of the best in Wv"
  ]
 },
 {
  "name": "Outback Steakhouse",
  "address": "1062 Charleston Town Center, Charleston, WV 25389, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2d23164a-932f-11ea-b33b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15148124047050337203",
  "source": "GoogleMaps",
  "reviews": [
   "We ate here late one Saturday night between 8 and 9. It wasn't busy at all. To be honest we thought it might be a sign of things to come. But... We were pleasantly surprised. Steak was cooked just right. Ribs were falling off the bone.  Crisp green leafy salad and a hot blooming onion. Server was exceptionally nice and was deserving of a good tip. Great experience. For a downtown restaurant, they do close early though for a weekend.",
   "Our service was excellent! Courtney was our server and she did an outstanding job. The restaurant was very busy, we had to wait an hour just to get seated, but it was worth the wait. The food tasted amazing!",
   "Outback has gone so downhill.  My steak was overcooked and fatty.   My \"lobster tail\" was the size of a large shrimp and overcooked..  I used to love Outback but it has cut costs and become mediocre at best.  Service was fine though.  Bartender was very nice and helpful.   Not worth the  money at all anymore",
   "In the middle of a Whole30 while traveling.  Waitress was helpful and patient working with me to make sure my meal would be compliant.  Food was great too.",
   "Everything was prepared well as usual. I would not recommend the steak and shrimp version of the Queensland Pasta, as the cut of steak used is very chewy. If you do order it, eat the steak separately, rather than on the same fork as your pasta, otherwise you will end up needing to swallow pasta while still struggling with the chewy steak."
  ]
 },
 {
  "name": "Sam's Uptown Café",
  "address": "28 Capitol St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2d606da8-932f-11ea-8f97-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "creative",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18343769306031931761",
  "source": "GoogleMaps",
  "reviews": [
   "I really do love small local bars with joyful local crowds. The prices here are slightly lower than the bars and restaurants around it. The bartender and staff were awesome and allows you to customize your food order to your liking. The pastrami sandwich was delicious and quite large. The homemade potato chips are a complete game changer that I'm still thinking about! This is a must stop place to visit in Charleston.",
   "This is one of those restaurants where you really want to know how they make their food so you can recreate it at home. It's that good! They never fail to get the order right and the food is delicious. A go to spot for lunch in downtown Charleston with fair prices, great service and delicious food.",
   "Great food in a casual, social environment with a mixed crowd. Gravy is always great, and so are most menu items. A little overpriced for bar food, but you definitely get what you pay for. The location is good if you’re near, and parking is okay if you know what you’re doing. Service is usually good depending on the times. Either way, food comes out hot and delicious. Would recommend.",
   "Went in for the Game of Thrones themed brunch. Very creative. Was the first brunch I've been to there. All of our food was great. I had steak and eggs and my friends went with the Lazy Dragon (alligator). I didn't get any of the alligator but it looked fantastic. Won't be my last trip to Sam's. Was a little slow getting food and service but overall very good. Gravy was excellent.",
   "I wish I could honestly review higher. Maybe my second try will be better. The staff were nice but took 10 minutes to even acknowledge me. The food came out but covered in grease. I would try again but with hesitancy."
  ]
 },
 {
  "name": "Bistro at the Barge",
  "address": "1414 MacCorkle Ave SW, Charleston, WV 25303, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2da298fe-932f-11ea-8a32-14b31f159f22.png",
  "tags": [
   "history",
   "food",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=4850185337381236766",
  "source": "GoogleMaps",
  "reviews": [
   "Order appetizers. They can be large enough for one, and even if one eats two, you can get it for an excellent price. The prices are lower than one would expect for an upscale restaurant like itself. Once again, my best suggestion for keeping prices low is ordering appetizers and eating them as small plates or tapas. On another note, the desserts and cocktails are lovely. Great atmosphere- the tables are MASSIVE, and, you know, looking at a moonlit river is always beautiful.",
   "Absolutely Fantastic! The raw oysters for the appetizer were perfectly prepared with a citrus and shallot topping.  For the entree, I had the sea scallops.  They were super tender, crisp golden brown top and bottom served on a bed of risotto in a light creamy sauce.\n\nThe Bistro at the Barge is a great destination formal dinner.  It is a hidden gem, that you will have to really look closely at the signs to find.  The restaurant was recently reopened, after being closed for four years due to the owner passing away.  You can try to swing in and catch an open table, but reservations are a must for dinner.\n\nDuring the warmer months the lower level of the restaurant, Barge Restaurant Bar & Grill, is open for lunch and dinner, with river front seating right on the water.  \n\nThis is a restaurant with a rich history and some of the best food on the east coast.  Whether you stop in for riverside lunch in the summer or a 5-star worthy formal dinner year-round , you will not be disappointed.",
   "Outrageous prices, mediocre food, decent service. $117 for 6 of us to eat bar food and 3 beers. That's just too much to pay to sit on the river to eat bar food.",
   "I thoroughly enjoyed it. Very relaxing.",
   "The favorite place in Charleston to eat."
  ]
 },
 {
  "name": "Aladdin Restaurant",
  "address": "3024 Chesterfield Ave, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2defa790-932f-11ea-90ef-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12761576195525056621",
  "source": "GoogleMaps",
  "reviews": [
   "Very disappointed.  I ordered a well done strip steak.  It was literally bleeding, not even medium rare.  The cheapest bottled ranch dressing, a dry, overcooked chicken breast on my ceasar salad, mediocre baked potato, spinach dip that tasted like it came out of a can.  Wine that tasted like the cork it was so old.  Waitress not attentive or friendly at all.",
   "Best rack of lamb ever",
   "Great local restaurant. Hearty portions, low prices, for quality food.",
   "I liked the food very tasty  and nice service...I recommend it in this city😋",
   "Superb food. We were a group of 6 and all felt the same about our meals. They were minus several of the wines on their list but after 3 tries,the 4th selection was quite good. So good in fact that we ordered a second bottle. When selecting veggies ask for options. The mushrooms were delicious. Good place to meet friends and talk. We were never rushed. Great dining experience."
  ]
 },
 {
  "name": "Leonoro's Spaghetti House",
  "address": "1507 Washington St E, Charleston, WV 25311, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2e4090fa-932f-11ea-9f5e-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16746575657994870088",
  "source": "GoogleMaps",
  "reviews": [
   "Been to different countries and at least 20 states, and Leonoro's has the best meatballs in the world. I will drive hours just to pick some up. Amazing!",
   "My favorite place to get Italian in town! Wonderful food, and amazing service! Highly recommend!",
   "Their specialty is spaghetti and meatballs.  The best I have eaten.  The favorite restaurant of three generations of my family.",
   "A staple of the community for over a 100 years. The way your momma would make pasta and gravy.",
   "Good home made food at down home prices. Very good service too."
  ]
 },
 {
  "name": "Wheelhouse",
  "address": "1007 Bridge Rd, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2ea76994-932f-11ea-bf77-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13194561873229557291",
  "source": "GoogleMaps",
  "reviews": [
   "If you have not experienced the \"Wheelhouse\",what are you waiting on!!!!  This Lake Erie west shore resident would come back to Charleston's \"Wheelhouse\" for the chicken salad alone!!!!!",
   "My girl friend likes it their..",
   "Great food large portions",
   "ALWAYS SO CLEAN! Amazing fresh food, daily specials, fast and friendly service. I have never been disappointed. Its my new favorite place to grab a bite to eat.",
   "Fantastic food, friendly staff, clean, and great prices."
  ]
 },
 {
  "name": "Super Weenie",
  "address": "805 Quarrier St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2f04f300-932f-11ea-9b7b-14b31f159f22.png",
  "tags": [
   "cheap",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16162468496186085318",
  "source": "GoogleMaps",
  "reviews": [
   "Very cheap hot dogs that taste great and will definitely fill you up. Excellent place for lunch.",
   "Best hot dogs I had in Charleston! Please come and try them out if visiting, you will not be disappointed. Although there are not sitting tables, the food is delicious and fresh",
   "Intriguing menu that I wish I could explore more, but I live out of town. I went with the standard WV Dogs because that's the gold standard in West Virginia, if you can't get those right around here you're doomed! I was impressed. They were well put together and not extremely sloppy. Service was quick and very friendly. The place has a neat vibe and it should be on your list when you're visiting downtown Charleston!",
   "Great, quick, no frills hot dog place. I'm picky about my chili, and I loved theirs. Many delicious selections. I will definitely be coming back!",
   "It is always an excellent experience going to Super Weenie. I am glad they now have a year round store front to stop by. While it does get busy, it is always worth the wait. The team is great at making sure my food is excellent."
  ]
 },
 {
  "name": "Fujiyama Japanese Steakhouse",
  "address": "5780 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2f4c5c86-932f-11ea-b803-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16147255378002457537",
  "source": "GoogleMaps",
  "reviews": [
   "This has been the VERY first place I've ever been to that has made \"Sushi\" they way it's supposed to be made... I'm so pleased! The fish is soooooo fresh and delicious... The seaweed is so crisp, it snaps in your mouth... Also, they don't skimp on the fish either like other restaurants do when making the Sushi... The are the BEST HANDS DO... I have my new favorite place to go! Keep.up the amazing word...",
   "Wait staff is always nice and quick with your food. Best place to eat in Kanawha City.",
   "Very good sushi and entrees. I perfer table service over hibachi, but would recommend against large group table service and suggest hibachi in that situation. Courses often drag with table service for large groups. No one eats at the same time.\n\nEverything else is aces.",
   "Hot green tea and miso soup were just how they should be. \"Rock n roll\" roll was delicious. Eel roll was also very good. Great eel sauce. Waitress was very polite and prompt.",
   "Wonderful food. Will definitely go back!"
  ]
 },
 {
  "name": "Las Trancas Mexican Restaurant",
  "address": "121 Cross Terrace Blvd #9461, Charleston, WV 25309, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2f9106ae-932f-11ea-8310-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5744474270856848783",
  "source": "GoogleMaps",
  "reviews": [
   "Love the food and the people here! Everyone is super friendly. Make sure when you go in to ask for Amy! She is my favorite server & does an outstanding job every time.",
   "Great Mexican food, rest chips and great salsa. Oh and great sweet tea.",
   "If you like unseasoned soggy food, then go ahead. Was very disappointed when this place was recommended to me. Literally no flavor, and covered with lettuce, and a single thin slice of tomato, and watery refried beans. Guess it's the Charleston Palate.",
   "Very good food and large portions for a reasonable price. The unique features and high ceiling make for a notable atmosphere and the staff are friendly and attentive. Been coming here for nearly a decade and admire the consistency of the food. Also, the manager is amazing and does his job very well.",
   "I had trouble finding a menu on internet so I have taken pictures for everyone else having the same trouble.  My visit was a early lunch dinner. \nThe waiter had a little  trouble understanding what I was asking . Which not a big deal at all.  \nPretty empty I must have hit a sweet spot because every other time I have had to wait forever even if it was lunch time. \nGreat service . Friendly staff . Cold drinks.  I would recommend this place for anyone looking for good Mexican food."
  ]
 },
 {
  "name": "Giovanni's Pizza",
  "address": "118 Spring St, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/2fd8e5e4-932f-11ea-a574-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11491823414188553579",
  "source": "GoogleMaps",
  "reviews": [
   "Tried to order delivery. Was informed that they are not taking delivery orders because they are closing in 20 minutes (I thought they closed at 11, which would be an hour and 20 minutes) Anyway she said they had 3 or 4 orders ahead of me and aren't interested in taking more. Ok 👌",
   "At the recommendation of a co-worker, I tried Giovanni's cauliflower crust pizza and it was much better than I expected. I've tried making cauliflower crust pizzas before, but they never turned out anywhere near as good as this. I highly recommend this if you're doing keto or just want to try something new. You won't regret getting the cauliflower crust pizza!",
   "My food is always wonderful! I usually pick up on the way home because delivery times can be long. I think this is much better since they've added GrubHub and a few secondary delivery services.",
   "Service is always good....the provolone cheese makes the pizza special....i recommend the pepperoni pounder...image included",
   "Food was fabulous! The young guy working the register was very polite but could use some more training. He forgot our chips and another customers water."
  ]
 },
 {
  "name": "China Buffet",
  "address": "5707 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/30220ad0-932f-11ea-9c9a-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15183770599941971122",
  "source": "GoogleMaps",
  "reviews": [
   "I love going here with my family. The atmosphere is great. Food was delicious and the staff was so kind. They always have fresh food out. There deserts are amazing. I would recommend going here.",
   "Food was OK. Nothing special for sure. Selection is adequate but the food that I actually got didn’t taste the best and I got a pretty good variety. Food was fresh but egg rolls weren’t very crispy.",
   "I love this place. I have NEVER had a bad experience dinning their. The food is always fresh & good .",
   "Great food great price and the friendliest wait staff and managers around here. Keep up the good work David it's always a great comfortable experience their.",
   "the place is clean  the staff is friendly awesome taste I truly recommend"
  ]
 },
 {
  "name": "Soho's",
  "address": "800 Smith St, Charleston, WV 25301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3067f540-932f-11ea-8721-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14230158276592781794",
  "source": "GoogleMaps",
  "reviews": [
   "The service at Soho's was excellent! The staff is very friendly and the waiter's timing to stop by and check on our table was perfect. \n\nMy food review is based on a soup of the day crab bisque and the meatball sandwich. I personally didn't love the food, but I would return again to try something else.\n\nI grew up in Maryland, so I have a certain palette expectation for crab vegetable soup versus crab bisque. The crab bisque at Soho's was a combination of the two - a very heavy tomato sauce base without much cream or butter and I did not detect Old Bay. So as much as I enjoyed the soup, it felt lacking personally in the creaminess of a bisque.\n\nThe meatball sandwich has a beautiful presentation, but I had to squish the meatballs down to even attempt to eat it as a sandwich. The meatballs really should be smaller with more of them. The meatballs themselves had a texture that was super smooth and I personally prefer a but more mouthfeel to meatballs. The sauce was excellent. The bread was crusty and delicious, but hard to enjoy because of the overly sized meatballs. The cheese was fine, but should have been melted because it did not pull apart easily.\n\nI wish the side was not chips. The chips held too much oil in them though they were crunchy. \n\nAgain, I would return to try something else on the menu because the food was pretty good, but I wouldn't recommend this particular sandwich.",
   "Great service,  great food... the vegetarian lasagna is my favorite... so tasty and unusual!  Great atmosphere too.",
   "Almost heaven :) the food is very good and the atmosphere is also nice. Nevertheless, the prices are a bit more on the upper side and reduce the accessibility to the masses. We loved every bite, bit it was still slightly overpriced",
   "A nice restaurant, a little rustic with a modern twist I would say. I've only had good meals here, their alfredo sauce is amazing. Save room for tremendous desserts.",
   "Excellent food! Nice setting, comfortable seating. The wait staff was friendly and helpful. Menu choices were varied and interesting and priced as expected for the area."
  ]
 },
 {
  "name": "La Carreta",
  "address": "5790 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/30ac7868-932f-11ea-ba2f-14b31f159f22.png",
  "tags": [
   "food",
   "affordable",
   "food",
   "family",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1111913948230858014",
  "source": "GoogleMaps",
  "reviews": [
   "Nice, friendly service. Food comes quick. Very affordable.",
   "I've been here several times and the staff are friendly and the food is amazing. The prices are fair and I usually like everything I order. The service during rush hour can be slow but it is worth the wait 😊",
   "Good food and place to leisurely dine with family and friends. The chips and salsa flow and you're never rushed. The staff has always been friendly and attentive.",
   "Always good food excellent service",
   "Delicious food.. Fast  and friendly service"
  ]
 },
 {
  "name": "Fusion Teriyaki Grille",
  "address": "4002 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/30f14a08-932f-11ea-9825-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2028023339723816460",
  "source": "GoogleMaps",
  "reviews": [
   "This place is amazing. Chicken teriyaki is to die for! Friendly staff! Great management!",
   "Always friendly, always fast. I love the steak bowl, the pork bowl, the Gyoza is pretty awesome too!",
   "Sell bad food got food poisoning from them and they denied everything. It's the only food I ate the entire day....",
   "Fresh high quality food prepared in a healthy manner. Delicious. ",
   "Low quality, burnt food at a high price. Go to chow thai instead."
  ]
 },
 {
  "name": "Cracker Barrel Old Country Store",
  "address": "5720 MacCorkle Ave SE, Charleston, WV 25304, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/31353c2c-932f-11ea-b4dc-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "unique",
   "family",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10915902183890128300",
  "source": "GoogleMaps",
  "reviews": [
   "Piping hot coffee. Great biscuits and gravy! Friendly staff and clean. Had breakfast \"fireside\" by the fireplace, it was a bonus on a chilly morning.",
   "Went for a family meal, I had the country fried chicken and it was fried to perfection. It came with 2 thick, juicy, and so tender that it could be cut with a fork. Wife had roast beef, and was very pleased. Kids had a couple of the chicken tenderloin that was very good. One in our party had the grilled chicken salad, and it was huge, and very fresh.",
   "Great food, beautiful memorabilia from old America",
   "I honestly have never had a bad time here. The wait staff are always great, polite, and help as much as possible. They have giant checkers to play, a big fireplace thats amazing especially in the winter, and is just a comfortable place to eat. Their food is amazing in my opinion. My mother loves their chicken livers and the cheese casserole. Definitely give it a try. Also, the gift shop is amazing and unique. Older/replica antique things, toys, clothes, soaps and lotions, candy and sodas, and a lot of things you dont really see anywhere else. A little expensive in the gift shop, but very nice. I could spend a lot of money there. I wish they had the candy \"Brown Cows\" again. Great place to go and take your family for a nice country meal. I love it and highly recommend. Keep up the great work!",
   "Very good food. Grilled chicken was very delicious and could be cut with a fork. Baked sweet potato was excellent, the skin peeled off very well and did not have any of the sweet potato stuck to the skin. I asked for the brown sugar and butter to be placed on the side, since I was not sure I wanted the butter or brown sugar. Steamed broccoli was good as well. The salad was delicious and fresh. The server was friendly and attentive."
  ]
 },
 {
  "name": "Gonzoburger",
  "address": "207 W Washington St, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/31792324-932f-11ea-a451-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "free",
   "walk",
   "unique",
   "food",
   "delicious",
   "art",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=9811820053415015137",
  "source": "GoogleMaps",
  "reviews": [
   "I've never been there before, until today. Was greeted by a friendly face. The place looks neat. Food was AWESOME but a little pricey, but the quality offsets that in my opinion. Definitely coming back. Would recommend!",
   "Great atmosphere is the first thing that hits you when you walk in. Not sure what it previously was but they have left most of the original look and it's really nice. My server, Sid, was awesome and we talked quite a bit while I was there at the bar. I got the Patty Melt burger and it was delicious. Cooked just right and that marble rye made everything else pop. The menu all looked delicious and I can't wait to go back to try more. Parking was a little sad since it's mainly street parking with meters, unless there's a free lot I didn't see nearby. Overall I would highly recommend it.",
   "Atmosphere is really cool and unique with all of the paintings everywhere. The food was really good! I liked that they decorate the tables with paper and have crayons to doodle while you wait. Fun place! Also impressed that the waitress wyrite her name upside down.",
   "Gonzo burger is a wonderful dining experience: Delicious food, rare beer selection, super clean, the staff are excellent, and the art pieces in the restaurant that you can also buy are beautiful. If you are ever in Charleston, WV I highly recommend you check it out!!!",
   "Second time here. Would have been 5 starts but the service was a little slow but not horribly  slow and my wife’s burger a little undercooked but again not horribly. Great atmosphere, parking is scarce so bring quarters for the meter. Food is really good, they blend their own burger in House we was told and it shows in the taste of the burger. Beer selection is above average and the soda comes in bottles, which I find a little weird but I’m sure they have a reason. Second time visiting and will be back. They sometime have live music which is really nice. Happy hour 4pm-6pm. Prices vary 10-13$ for a burger. Building is a historical building, so if you appreciate the architecture of old buildings and a good burger give it a try!"
  ]
 },
 {
  "name": "Books and Brews",
  "address": "222 W Washington St, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/31c68094-932f-11ea-8bd7-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "historic",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2743195144307610862",
  "source": "GoogleMaps",
  "reviews": [
   "I can't think of anything that I have experienced in coming here that is negative. From the staff to the food to the drink selection everything has been a positive experience. The location is great, the atmosphere inside is exactly what it needs to be and it's perfect, and it's so small but I can always jam out to what's on the radio. 10/10 would recommend",
   "My fiance and I visited B&B when it was in St. Albans, and although I miss the relaxed vibe of a lovely cup of coffee, board games and books, the new location is just as enjoyable in a different way. We felt energized and were greeted warmly from the first step in the door. We felt especially welcomed when a lovely gentleman by the name of Danny covered our tab!  All in all, 10/10 recommend this great place. Oh, and their pepperoni rolls re absolutely divine!!!",
   "Try the pepperoni rolls.   You won't be disappointed.   My husband said the Reuben sandwich was one of the best he's ever had.   The wings and side salad were great too.  We will definitely be back.",
   "Nice vibe! No dessert though. 🙁 Server did recommend going to a little place around the corner. Great Pepperoni Rolls Appetizer. More like a meal. A spin off of a traditional roll. Great Craft Beer selection. Server was nice, friendly. Worth trip to Westside/Elk City.",
   "One of my favorite restaurants in Charleston, West Virginia. An Amazing selection of freshly prepared delicious food. A wonderful selection of freshly brewed coffee’s. On top of that a great selection of American and imported beers and wines. This great restaurant also occupies an amazing space. Come see the incredible restoration of the historic architecture of this beautiful Elk City building. Come enjoy the food and the wonderful ambiance of Books and Brews in Elk City."
  ]
 },
 {
  "name": "Harding's Family Restaurant",
  "address": "2772 Pennsylvania Ave, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/321e8bdc-932f-11ea-982c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17725136093555625322",
  "source": "GoogleMaps",
  "reviews": [
   "Friendly. Clean. I am still getting used to food uo here. Got the side dish dinner, or the vegetable plate as we call it down South. Food comes, looks great. And tasted exactly like veggies with no salt or pepper or butter added while cooking. I admit I added some of each to what was appropriate. Now, the blueberry pie!!! That was wonderful!! I will probably go back when I am here for work. Just have to being some garlic!",
   "They generally don’t allow you to swap a daily special soup and sandwich for non-meat options if it’s not the ‘daily special’.  But the manager allowed the swap after I explained my food restrictions.  (Tomato soup and grilled cheese).  Great service.  Great food.",
   "I will always love stopping here! I highly recommend coming here like I can't recommend it enough! Food and staff are awesome, it's my favorite place to stop at. It was my first meal of 2020!",
   "Worst meal I have had there, had grilled chicken, it looked boiled and there was Absolutely NO SEASONING, the broccoli they don't use a melted creamy cheese they put shredded salad cheese on it and the broccoli was supposed to be steamed but was more raw. Husband got chopped steak and it was dried out and had no seasoning. We are not the only ones complaining that day several other families complained and some left without eating.",
   "Home cooked and tasty food at a very reasonable price, make sure you try the wilted salad and the homemade Graham cracker pie, it was excellent!! Yes I will be back."
  ]
 },
 {
  "name": "The Corner Kitchen wv",
  "address": "1701 Bigley Ave, Charleston, WV 25302, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/3266435c-932f-11ea-a1be-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "affordable",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5291058688430768917",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome food! Fabulous service! A must try if you live in the area or just visiting! The delivery convenient but I recommend going in to sit down for a meal. There is always wonderful people to have a conversation with!! The atmosphere at The Corner Kitchen is something you just can't find anywhere!!",
   "I thought the other reviews were exaggerating. They weren't. It's exactly like I walked into someone's home. The whole family was there. Super friendly and casual vibe. Very affordable, but without cutting the quality. My brother and I both got grilled chicken sandwich at the advice of a staff member and was not disappointed. The brownies and PB fudge were on point, too. Considering this place is a block off the interstate, it is certainly worth the stop if you're even just driving by.",
   "My first visit to the Corner Kitchen and I was very impressed. Friendly, down home restaurant that did not disappoint. Seriously, home cooked meals!! It’s like going to Grandma’s house on Sunday. Haven’t been to a restaurant in years that really has home cooked meals, though others advertise they do. Enjoyed talking with owners & staff. Meal was delicious and prices just could not be better. I dined in but also got a meal to go for tomorrow night. Highly recommend!!!",
   "Great food.   An fast service",
   "Food was great, was out of the kitchen quickly. The Pineapple Upside Down Cake was awesome."
  ]
 },
 {
  "name": "Osaka Japanese Steakhouse",
  "address": "2815 Mountaineer Blvd, Charleston, WV 25309, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/32ae20e2-932f-11ea-a526-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2076972172665099299",
  "source": "GoogleMaps",
  "reviews": [
   "This new Japanese Steakhouse is probably the best place to eat in this area.  I stopped in for dinner by myself on a business trip.  I watched my ribeye cook over a special charcoal grill with wood imported from Japan.  VERY authentic with no expense or effort spared.  This is a top notch place, super clean with a experienced staff.  The menu variety has everything from chops and ribs to sushi and of course...Hibachi!  Can’t wait to go back. Would’ve been nice to have warm sake but they’re so new that they haven’t received their license yet.  Please get it soon!!",
   "A great dining experience. The food was wonderful, very large portions and so tasty. The young lady who served us could not have taken any better care of us.",
   "Phenomenal experience. Wonderful food, very friendly staff, and tremendous atmosphere. I will definitely be back!",
   "The restaurant needed more time before opening. The hibachi area is a bit unfinished with uncomfortable chairs and heavily scratched walls. It took 45 minutes to seat us, 15 to get a server, another 15 for drinks, and then got our chef an hour later. However, the food was delectable, and the staff incredibly friendly. Hopefully they get some issues sorted improve!",
   "The lobster and surf & turf sushi rolls are amazing, but the side of rice and noodles are very bland, maby the hibachi table versions are better. The mochi ice cream was nice as well. Staff seam friendly."
  ]
 },
 {
  "name": "Fuji's | Sushi & Teriyaki",
  "address": "1113 Jefferson Rd, South Charleston, WV 25309, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/32f66f5e-932f-11ea-a798-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1736793005855144174",
  "source": "GoogleMaps",
  "reviews": [
   "Fresh fresh fresh!!!  Authentic sushi and the actual blue crab used. Try Blue Fuji!!!",
   "I love this man, He will make you feel welcome and feed you the best home made Japanese food you have ever tasted ",
   "Very good totally recommend trying",
   "Best sushi in the charleston area",
   "Hidden gem. If your grandpa was Japanese, this is how he would make sushi. Simple, not fancy, but done right. Family owned little shop that serves great food."
  ]
 },
 {
  "name": "Husson's Pizza - Bridge Road",
  "address": "1008 Bridge Rd, Charleston, WV 25314, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/33470bb4-932f-11ea-b9f4-14b31f159f22.png",
  "tags": [
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=16224567989045846411",
  "source": "GoogleMaps",
  "reviews": [
   "John is the best guy there. Props to his awesome skills with making food. Always pleased with my orders.",
   "Sometimes I like a thin crust, Husson's has a good one. If you are very hungry, order a size or 2 larger than you would from a different pizzeria. Meats and vegetables always have good flavors and taste fresh!",
   "We had a birthday party here at The Gathering Place. Very reasonable prices and so convenient to be able to get the pizza too. The space is on the small side but it worked perfectly for us.",
   "The thin crust is a pretty delightful option",
   "Best gluten free pizza in the valley"
  ]
 },
 {
  "name": "China Max",
  "address": "3017 Charleston Town Center, Charleston, WV 25389, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/33a7c95c-932f-11ea-9a33-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2530741274687449690",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely love the food and they give you nice portions. Spicy Chicken & Bourbon Chicken with Fried Rice is my favorite. I recommend this China Max if your ever at the Town Center Mall",
   "Chinese restaurant in the Charleston town center that has the best bourbon chicken I've eaten and more for your money.",
   "They won't answer the phone and obviously hours are wrong",
   "Good food, large portions. Their honey chicken is my favorite! If you get egg rolls get the yumyum sause to dip it in!",
   "Very friendly and courteous. Tasty and large portions for a great price."
  ]
 },
 {
  "name": "Tudor's Biscuit World",
  "address": "1506 Washington St E, Charleston, WV 25305, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/33ed5e38-932f-11ea-8728-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18340979839833127650",
  "source": "GoogleMaps",
  "reviews": [
   "The foods good. And most of the staff are great. I would have gave it 4 stars but they are kinda slow getting the food out even when they aren't busy and tye biscuits are really hard unfortunately",
   "A step up for fast food and less expensive than national chains. The biscuits are home made and the country has is savory sand rich. Skip McDonalds and Burger King. For a taste of down home country fast food, come here instead.",
   "It was a reasonable experience, but overpriced for what it was I thought. Mcdonalds beats biscuit world - also biscuit world is a bit of a strange name for a fast food restaurant, maybe that's just my British understanding not getting it...",
   "wrong.I do like the food and drink but I think one times , mgt. failed to give me Senior discount!",
   "Food was average. Miss the friendly and helpful staff they use to have. It's a shame that the place isn't kept like old times. Clean it up and smile people!"
  ]
 }
]