[
 {
  "name": "Cheyenne Botanic Gardens",
  "address": "710 S Lions Park Dr, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3432f1ac-932f-11ea-97a4-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10207914847595039094",
  "source": "GoogleMaps",
  "reviews": [
   "Such an amazing place for this small town to have! Great place to meet a friend and hang out. The kids loved the fish and birds and seeing all the amazing plants. Truly a must see for Cheyenne.",
   "A perfect respite from the day.  Come and reflect read a book and have a nice cup of tea.  We saw a stained glass exhibit the afternoon we went. Recommend!",
   "Went to a Birthday party today. The party room was spacious are very nice. Everything was clean and bright. The temperature was great. Thank you for a very pleasant experience.",
   "What a wonderful experience.  Such an exceptional selection of exotics in a small, but beautiful facility.  Wyoming can be proud of this garden!  A real banana tree with a bunch of bananas and a Choi pond that is perfect.  The blossom's scent from the citrus tree added a special effect to our experience.  The conversation with the host was great.",
   "One of my favorite places to go when I am visiting family in Cheyenne wyoming. I love all of the different plants and the size of the fish in the ponds! My nephew loves to come here all of the time so its great to enjoy something i love with him. The banana trees had bunches of fruit and the air was very nice. Overall I recommend everyone visit their local botanical gardens. I even got the inspiration to grow a monstresa plant in my house! They have rotating showcases and kids entertainment as well. We saw a bonsai exhibit that was very interesting."
  ]
 },
 {
  "name": "Cheyenne Depot Museum",
  "address": "121 W 15th St #300, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/348f60da-932f-11ea-ae09-14b31f159f22.png",
  "tags": [
   "kids",
   "learn",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7687481468333213278",
  "source": "GoogleMaps",
  "reviews": [
   "New to Cheyenne and took the kids on a cold wintery day.  We all loved it! The loved the model trains upstairs💜",
   "Sadly, the staff was very unfriendly, rude, and demeaning. We tried to go to the museum, but power was out. Rather than being helpful or offering any alternatives, the staff was rude. I understand they had nothing to do with the power being out, but courtesy was far from a strength. At this point, not interested in going back, even at a time that the power is working.",
   "Very cool place.  Learn a little bit about the Wild West here and enjoy lunch & a beer next door.  Nice people.  I'm a fan of Cheyenne.",
   "This is a great, fun, and educational place to come and learn about Wyoming's railroad past. The model railroad upstairs is quite impressive in its scale, and the mini model railroad that you can operate is quite fun for the little ones. I also like going upstairs and looking out the windows out at the railroad tracks and envisioning what the depot must have been like back in its prime with all the trains and passengers. Definitely worth a visit.",
   "We decided to visit this attraction based on overwhelmingly positive Google reviews as well as one of our kids love trains.  For the cost, $8/adult, this is an extremely small museum.  Upstairs they have a really cool model railroad set up, however, upon our arrival, a Saturday, there was no one available to run the trains.  \n\nWe understand the running of the model trains is dependent on volunteers, so would recommend calling ahead of time if you plan to visit to ensure you get to see them.  \n\nWe did like the chairs upstairs so you can watch trains that come through the rail yard.  We were lucky to get to see one come through."
  ]
 },
 {
  "name": "Cheyenne Frontier Days Old West Museum",
  "address": "4610 Carey Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/34d2d050-932f-11ea-955d-14b31f159f22.png",
  "tags": [
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14127920885670247695",
  "source": "GoogleMaps",
  "reviews": [
   "Modern. Clean. Well lighted. Spacious. Artifacts - and they are more than numerous - are nicely restored and very well arranged and displayed. We look forward to visiting again.",
   "Very friendly staff. I felt like I was stepping back in time with the old carriages and artifacts. Great gift shop. We learned a lot about the rodeo culture here and how important Frontier Days is to this town. Great stop while we were visiting Wyoming.",
   "If a good museum is your thing then this one is going to transport you back to days of old. The carriages are a great way to spend time contemplating how the ladies got in out. I personally think that could be the start of the custom of opening the door for a lady.  If you have a hour or four stop in check it out.",
   "So much history packed into a small space.  Well laid out, great information to real along with the display items.  Great way to spend an afternoon and learn about Cheyenne!",
   "Great place to go see a rodeo. Also the sight where Lane Frost was killed. There is a monument of his there to show respect."
  ]
 },
 {
  "name": "Big Boy Steam Engine 4004",
  "address": "1705 Morrie Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35233a9c-932f-11ea-9feb-14b31f159f22.png",
  "tags": [
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7704812800963631605",
  "source": "GoogleMaps",
  "reviews": [
   "Very cool to be able to see one of the eight remaining largest steam engines ever built.  It is stored in a beautiful a park in Cheyenne.  There's not much you can do other than look at the fenced in train and read about the Big Boy on a board, but still definitely worth visiting if you are in the area.",
   "They say only 8 of 25 Big Boys built are still around. Heck, I saw 27 on this trip alone and I wasn’t even looking for them. I have one in my backyard. Not in my area backyard, my actual backyard. I stole it, borrowed it, Engine #4999. Logistics were a little tricky, but I was determined to make it work. Don’t tell Union Pacific, cause I’m not giving it back. Neat train display in a mediocre park. My display is better. \n🚂🚂🚂🚂",
   "Love this park all year long! Personally enjoy quiet time on a snowy winter day.",
   "Easy access in the park, borrow my Dad to give you details on the locomotive design and functionality and including production history.",
   "The steam engine is in a park near the UP Steam shop and the Cheyenne Muesuem for trains as well.  The train is near the tennis courts in side a half height fence, so you can't touch the train.  Its huge as most people know.  This area of Wyoming has been getting lots of rain so the grass is swampy now.  There is an entrance to a parking lot on the south west side.  It is surrounded by busy roads.  Kids had a great time."
  ]
 },
 {
  "name": "Wyoming State Capitol Building",
  "address": "200 W 24th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/357ad0b8-932f-11ea-960b-14b31f159f22.png",
  "tags": [
   "library",
   "history"
  ],
  "link": "https://maps.google.com/?cid=10886539687144673158",
  "source": "GoogleMaps",
  "reviews": [
   "I love the capitol building. Such a beautiful, impressive building in a quaint, quiet part of town. The setting is wonderful. Quite accessible by car and foot. Since it is downtown by the state museum and county library, we often drive by.",
   "When we visited here this Spring there was some construction work going on there. But we could take some pictures and drive around the Capitol building. We also spent sometime in the nearby areas. A great location with so much of historical importance. This is the capitol Building of the equality state Wyoming. It was a good experience !",
   "love the capitol. I didnt know where to go, but a quick phonecall was all it took. the people here are great.",
   "The restoration is simply wonderful. Tell your friends, go see it - you will be surprised and pleased especially if you spent any time there 4+ years ago.",
   "A beautiful piece of architechture and history! I was hoping to find information as to the source of the materials used for architecture and decorating/trim. More information on the history of the state in general would be fun!"
  ]
 },
 {
  "name": "Cheyenne Depot Plaza",
  "address": "1 Depot Square Capitol &, W 15th St, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/35bc6e1a-932f-11ea-9081-14b31f159f22.png",
  "tags": [
   "history",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15760721210368942849",
  "source": "GoogleMaps",
  "reviews": [
   "Truly enjoyed our visit here. Depot museum is worthy of being a reason to visit Cheyenne on its own. Loved the history and be sure to visit the model train area upstairs - incredible recreation of mining lines of Colorado.",
   "Love Friday Nights On The Plaza!!! My 3-yr-old boy loves the concerts and asks to \"go to music\" just about every day. 😁",
   "Really need to ho visit this place when in Cheyenne. The museum is very I interesting.",
   "Very beautiful area, must see small Court yard for tourists like us! It's also a nice place to find some of the big boots!",
   "We had breakfast at A Good Egg. It was very good, loved the ham. Definitely will go back and try lunch."
  ]
 },
 {
  "name": "Paul Smith Children's Village at the Cheyenne Botanic Gardens",
  "address": "616 S Lions Park Dr, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/360fbdee-932f-11ea-b3f6-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10868103943699830263",
  "source": "GoogleMaps",
  "reviews": [
   "What a beautiful garden! A great hands' on experience for my kids. It's huge, though - wish we'd had more time to go through and see everything.",
   "Really neat place! Everything is and interesting for children! Would love to visit again!",
   "Love coming here. Fun and interactive activities. Great staff.",
   "Such a nice little area for the children. It is so well designed and stimulates the creativity.",
   "Excellent place to see not only for children but adults as well."
  ]
 },
 {
  "name": "Cowgirls of the West Museum",
  "address": "205 W 17th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3677d9e6-932f-11ea-b3a8-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6951245746758386260",
  "source": "GoogleMaps",
  "reviews": [
   "If you visit Cheyenne and love the rodeo. You must stop here",
   "Explore the rich history of cowgirls roll in early America. Lots of great photographs and information, beautiful costumes",
   "The people that staff this quaint place are the best! Friendly and knowledgable. The displays are wonderful.",
   "Loved it. Lots of displays to read. Doesn't take long if you just want to poke around. Video about 20 minutes long is entertaining and has great footage.",
   "We randomly found this museum and I'm glad we did.  What a cool hidden gem!  All about the history of women in the west - as homesteaders, mothers, businesswomen, rodeo stars... this was an eyeopening visit and I'm glad I found it with my daughters."
  ]
 },
 {
  "name": "Warren ICBM & Heritage Museum",
  "address": "401 N Champagne Dr #31, Francis E. Warren AFB, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/36bf916c-932f-11ea-b3a3-14b31f159f22.png",
  "tags": [
   "active",
   "knowledgeable",
   "history",
   "tour",
   "history",
   "kids",
   "historic",
   "history",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4677378360446033285",
  "source": "GoogleMaps",
  "reviews": [
   "Nice museum. My husband really enjoyed it. He is active duty Army and my father is retired Air Force. My father enjoyed the pictures. Nice little gift shop. Bigger than it looks from the outside. Very friendly employees who are very knowledgeable. Enjoyed the experience. I was surprised that it wasn't just missile related items. There are also some uniforms and furniture and other related items from different eras in the military. A lot of history about the base. Definitely worth seeing if you're in the Cheyenne area and love military museums",
   "What a wonderful museum to visit at FE Warren Air Force Base Museum. It was an honor for me because my father served at FE Warren Missile Wing . The tour of the museum will teach and show everyone about the history of Former Calvary post To the present day US Air Force base and how the base  contribute To the fence of the United States during the Cold War into the present date. The staff and the tour was excellent.",
   "This place is wonderful. If you have a military ID you can access the base to visit the museum, others need to call the museum first. The museum has both the history of the base from when it was an Army Fort, to now when it is a missile base. There are great exhibits, one room is dedicated to kids, so they can interact with historic items, such as they can sit at an actual console used to launch missiles, and they can launch one too.",
   "So interesting and fun to see everything,  just a little disappointed there was no close captioning.",
   "Love these historic homes."
  ]
 },
 {
  "name": "Nelson Museum of the West",
  "address": "1714 Carey Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/370dcae4-932f-11ea-99aa-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3322439478068829961",
  "source": "GoogleMaps",
  "reviews": [
   "I thought it was pretty cool!  This is a man's personal collection of knick-knacks from the old west! A little bit lacking in information but there is lots to see!",
   "Very interesting and informative. A lot of great displays.",
   "Amazing displays of western artifacts and hunting trophies",
   "Best museum ever! So many actual artifacts!",
   "This was an awesome little museum. Very fun to see the sparkled and metallic saddles"
  ]
 },
 {
  "name": "Mylar Park",
  "address": "5117 Seminoe Rd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/375a164a-932f-11ea-a0ad-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=241084771500168252",
  "source": "GoogleMaps",
  "reviews": [
   "Decent little park.  Small pond with lots of geese and ducks.  Good walking path around the park.  This park also has a Frisbee golf course.",
   "Great little park. It has a nice pond and it isn't crowded. The play area is great for kids. The bathrooms are always pretty clean, which I like. Hidden gem, highly recommend.",
   "Great park for did walking. People are friendly and happy there.",
   "Beautiful, small park with lots of open space, volleyball net, bathrooms, event pavilion, small playground with swing all up against a disc golf course.",
   "I like Mylar park. It is for the most part clean and well maintained. The little pond that is fed by crow creak could benefit from some attention and landscaping. The disc golf course is not to bad. With some careful throws you can even keep the discs out of the less than clean pond. Over all I like the park"
  ]
 },
 {
  "name": "Cheyenne Street Railway Trolley",
  "address": "121 W 15th St #202, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37b703a8-932f-11ea-a9f8-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=14250417662745008604",
  "source": "GoogleMaps",
  "reviews": [
   "Drivers were excited and proud to tell the town's history and stories.  I had a fantastic time",
   "We got a good deal on Groupon for this Trolley tour and it was very informative. However, the trolley really needed a better air conditioner. Beware: the tour guide's humor is a little dark.",
   "This is where you start your Cheyenne adventure",
   "Nice way to get an overview of the town, we used it on our first day to scope out our visit. Dewey was our rooting tooting Trolley driver and tour guide. A very colorful fellow.",
   "Railroad museum is great. Plan on 1 to 1 1/2 hours to work through exhibits"
  ]
 },
 {
  "name": "Epic Escape Game Cheyenne",
  "address": "218 E 25th St, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/37fcbf64-932f-11ea-b50a-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=15576783588256864235",
  "source": "GoogleMaps",
  "reviews": [
   "It was great fun, I really want to see this place thrive because I feel it is a great addition to Cheyenne. The escape room was great fun, the only suggestion I have is more puzzles, but still, it was a ton of fun. Thank you",
   "Really really cool!!!! My friend and I did a Medium level room, the football locker room. It's very challenging for someone that hasn't ever done this before. I highly recommend doing this. It's $28 per person and you have 1 hour in a room. There's a few minutes of explanation and prepping before you enter the room. By the way, my friend is 30, I'm 32, both prior military, we are out doors type of guys and this was still a blast.",
   "First time going to a escape room we had a blast. Great way to spend an hr",
   "This place has one of the harder escape rooms I've been too. The atmosphere wasn't as submersive as others I've seen but the clues are challenging and fun. The lady that runs this place has a great sense of humor and makes the experience good. There are usually about 4 to 5 rooms to choose from so it's easy to get in with just your group and not have to share with strangers. The online registration process is smooth.",
   "The staff was fantastic with our group, definitely a hidden gem in Cheyenne!"
  ]
 },
 {
  "name": "Messenger's Old West Museum",
  "address": "616 Crook Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38405864-932f-11ea-a8f4-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16147413669639554839",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing place to check out if your visiting Cheyenne",
   "This museum has odd and rare collections of History of the great Wild West",
   "It's in a storage facility and the exterior belies the interior.  They have some very interesting displays, something to appeal to virtually everyone.",
   "You have to see it to believe it... Small but packed.",
   "Messengers Old West Museum is a gem full of treasures to discover at every turn.  We were fortunate to have a guided tour, adding history and stories to each display.  It is a tiny jewel among all the big museums we visited.  Don't miss out on this one when you are in Cheyenne.  It's a perfect memory!  Thank you, Mr. Messenger, for sharing your family treasures with us."
  ]
 },
 {
  "name": "Wyoming State Museum",
  "address": "2301 Central Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/38afe478-932f-11ea-bc5c-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "history",
   "kids",
   "walk",
   "kids",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6682336131914299131",
  "source": "GoogleMaps",
  "reviews": [
   "This place is awesome. There is no entry fee and they have many hands on exhibits. There is even a room that allows children to play and touch stuff.\nI recommend you go just for the sandbox. There are hundred of really interesting items on exhibit. Please donate when you enter. Every dollar, quarter, dime, and penny help persevere this wonderful history. They also have dinosaur bones.",
   "What a fabulous museum! A great tour through the rich history of the State of Wyoming, from prehistoric times to present. The kiddos (7, 9, 11 & 13) were fully fascinated and entertained as well. We will definitely be back to see it all again next time we’re in town!\n\nPro tip: be sure to check out the amazing interactive topography display! Such an awesome exhibit!!",
   "It’s not big but it covers pretty much all you need to know about the state of Wyoming. Besides, the environment is children friendly and it’s educational. Recommended for kids and adults alike.",
   "This is a fun museum. I wish we'd had more time to do a thorough walk through. My kids loved the parts we saw.",
   "Fun and educational place to visit. Like the large display bison when you walk in to be greeted. The exhibits are interesting,  and the kids love the interactive room, where you get to see, hear, smell, and touch stuff. That's my kids' favorite part. Worth a visit."
  ]
 },
 {
  "name": "Wyoming Historic Governors' Mansion",
  "address": "300 E 21st St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/391ed1f0-932f-11ea-8f9a-14b31f159f22.png",
  "tags": [
   "tour",
   "structure",
   "learn",
   "history",
   "history",
   "free",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9879406383381849630",
  "source": "GoogleMaps",
  "reviews": [
   "Had been meaning to visit this for years! Surprised at how large the rooms were for such an old structure, beautiful antique furnishings. Not handicap accessible, many stairs. Self guided tour, information spots to text for information throughout home.",
   "Wow! Incredible preservation of history. So much to learn and see here. A must visit in Cheyenne, Wyoming. Absolutely wonderful.",
   "Very beautiful and full of history. That's awesome!",
   "Well-maintained, fascinating, and free. Different rooms are restored to a variety of time periods. The staff know some fascinating trivia and are very fun to talk to. Great for small groups and history enthusiasts.",
   "Excellent site lot of history"
  ]
 },
 {
  "name": "Southeast Wyoming Welcome Center",
  "address": "5611 High Plains Road, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/396725e8-932f-11ea-bb94-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1457020853364444853",
  "source": "GoogleMaps",
  "reviews": [
   "Always clean, always visible even in pretty bad weather, always cool to explore! \n Large, clean bathrooms. Parking has never been an issue. Staff are nice. Pretty area! \n If you need to make a stop, don't pass this one. They are expanding the sidewalk! Can't wait to see how it grows.",
   "Wow! I've never seen such a well planned and interesting welcome center before. Like a small museum. Clean and spacious. There are little picnic shelters because- Watch out for Wyoming wind! The landscaping is attractive. And of course, the place is just off the highway. Perfect.",
   "Nice place. Lady at the counter was very nice and helpful. I took away 1 star for the creepy greasy Mason guy. One of the nicest welcome centers. Clean bathrooms, museum, and beautiful grounds.",
   "The prettiest welcome area we have seem yet. My husband loved all the ram earth walls and all the details that were done in designing the building. The staff member behind the counter was very  chatty and engaging.\nRestrooms were very clean and smelled great.",
   "You have to stop here and go inside while they are open take your kids they will love it! And everyone there are so nice."
  ]
 },
 {
  "name": "Terry Bison Ranch Resort",
  "address": "51 I-25 Frontage Rd, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/39bf583e-932f-11ea-96d5-14b31f159f22.png",
  "tags": [
   "cheap",
   "kids",
   "food",
   "tour",
   "pets",
   "parks",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14486293588778531754",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing ranch with wonderful staff. They have a big gift shops with really interesting things. We left with many souvenirs. The price to stay in a cabin was unbelievably cheap! We also had an amazing horseback ride that went into several states. Gorgeous views! My mom and I look forward to visiting again soon!",
   "Not a lot to it at first glance, but a really cool spot for adults and kids. Definitely not a while day thing, but a couple hours to take the train and roam a bit. Then... grab some food at the restaurant. It was pretty tasty. Also, an awesome 2 piece band was playing when I was there.",
   "Neat place that we stumbled upon driving from CO to WY. We enjoyed seeing and photographing the animals. We appreciated the train ride to feed the buffalo and saw lots of prairie dogs on the way. The train ride was bumpy and cold, but well worth the $15. They were kind enough to do an early (unscheduled) tour just for us. Would definitely recommend.",
   "If you’re here for bison encounter experience, you won’t be disappointed. I won’t expect fancy restaurants or majestic barn, it’s a ranch after all. Bison has a wild side which we better keep a safe distance in places like state parks. But the bisons here are so tamed like pets. Hope that doesn’t misguide the tourists.",
   "Really cool experience! Take the train ride to feed the bison. You won't be disappointed, other than the fields of Buffalo chips, feeding them is really cool for adults and the kids."
  ]
 },
 {
  "name": "Cheyenne - Parks Division",
  "address": "4603 Lions Park Dr, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a036634-932f-11ea-9b96-14b31f159f22.png",
  "tags": [
   "parks",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5370131792943095837",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park with a disc golf course, playground, a few shelters with picnic tables and restroom (porta-potty in winter), horseshoe pits and pond with ducks and geese. Smally park (across the street) has a few baseball hoops.",
   "I love the parks. They are what make Cheyenne a great place to live. I wish they would attempt to enforce the leash law. So tired of dogs approaching my leashed dogs. I've told a couple  of people about the leash law and they've been outrageously nasty back. (Hey, mom chicks with four unleashed dogs. Screaming OH MY GOD at the top of your lungs only makes you look crazy.) I appreciate the qork the Parks Division does to keep the parks beautiful despite all the use they take.",
   "Mylar park always provides a beautiful view and rest stop during bicycle rides.",
   "Great park.  There is a lake, playground equipment, picnic area and the botanic garden.  There is also ample free parking.",
   "Very friendly and helpful staff!"
  ]
 },
 {
  "name": "military memorial museum",
  "address": "1714 Carey Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [],
  "link": "https://maps.google.com/?cid=12224285011434982363",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Wyoming National Guard Museum",
  "address": "624 E Pershing Blvd, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a49edd4-932f-11ea-ad1d-14b31f159f22.png",
  "tags": [
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2959237901058828957",
  "source": "GoogleMaps",
  "reviews": [
   "Had a neat tank and a bunch of other stuff",
   "Small but full of interesting history. Worth a short visit.",
   "This museum is especially close to my heart as my grandfather is buried right behind it on the military side of the cemetery. The Wyo National Guard Museum is the home of alot of cool stuff from wars past and present. I'm sure you'll have a fun and educational time. Unfortunately they are closed for renovations but I think they'll be reopened some time in early 2018 before spring. I can't wait to see it when they reopen..",
   "Great place to see some history",
   "Great history and good guides"
  ]
 },
 {
  "name": "Curt Gowdy State Park",
  "address": "1264 Granite Springs Rd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3a9cf030-932f-11ea-bd43-14b31f159f22.png",
  "tags": [
   "hike",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15634765002080215961",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place to hike. I prefer the trails throughout the trees. Only reason I didn't give it five stars was that the waterfall was very crowded and I did not enjoy that it was so populated.",
   "Killer trail system, one of my favorite bike trips ever.  Camping spots are fantastic and the lakes are beautiful.   Wyoming people are the best, so nice and laid back.  Can't wait to go again.",
   "Ice fishing was great on Crystal. Some open water, but the ice is about 10\" thick. Two of us got 8 rainbows and one brown in a little over 2 hours.",
   "The RV spots are huge and spread apart. We paid $35 for a single night stay. Partial hookups (50amp and water). Spot right next to the water.\n\nThe roads are gravel/dirt but easy to navigate. The site was reasonably level. There's a dumpster and a very basic restroom with a typical camping hole in the ground for a toilet. The restroom was clean but very smelly.\n\nIt was nice being on the lake with the views but we took our kids down to the water to skip rocks and ended up leaving pretty quickly with all the goose poop and feathers everywhere.\n\nWe were hoping to stay closer to Cheyenne for the annual Cheyenne Frontier Days, but we were happy to have a beautiful site to stay instead of a cramped RV campground closer to town.",
   "The lakes are really nice here. The picnic spots and camping areas are well spaced, so although others are there, you are not crowded. It is a short drive from Cheyenne, so it is easy to take a one day break, if you would like. The areas seems to be well kept. Fishing is good, mostly trout."
  ]
 },
 {
  "name": "Aesthetic Dentistry, P.C.",
  "address": "7010 Yellowtail Rd #100, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ae8515c-932f-11ea-80b7-14b31f159f22.png",
  "tags": [
   "comforting"
  ],
  "link": "https://maps.google.com/?cid=13255944213586901751",
  "source": "GoogleMaps",
  "reviews": [
   "I enjoy going to my dentist's office. They take good care of my teeth AND, they are very kind to me!  Many people don't like going to the dentist, I love going to my dentist. I highly recommend Dr. DZIARDZIEL and his staff.",
   "This Dentist office is by far the best one I have ever been to! \nThe staff is so nice and welcoming and the vibe is so comforting.\nThe dentist's are all committed to providing the best care and a positive experience for patients!",
   "I was referred to Aesthetic Dentistry by Katina for a bite issue I’m having and was seen today by Dr D and Lisa  and within 5 min he recognized my bite was off and did some minor adjustments and have never felt so much better.. I recommend this dental practice to everyone looking for a great dental office!",
   "I always have a great experience. Everyone is so nice and make me feel at ease. I recommend you guys to all my friends.",
   "I have been a patient at Aesthetic Dentistry for several years now, and have always been more than pleased with the entire staff. Wait time has always been short, and the work that I‘ve had done has always been exceptional."
  ]
 },
 {
  "name": "Abraham Lincoln Memorial Monument",
  "address": "136 US Frst Service Rd 705 A, Laramie, WY 82070, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3b49f974-932f-11ea-8082-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "structure",
   "history",
   "structure"
  ],
  "link": "https://maps.google.com/?cid=8971779919069291036",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in the dark and was cold. So I didn't walk around to see monument & info booth was closed. Semi parking has to walk far to get to building and parking lot and sidewalks partially iced still. But it was clean inside and decent amount of parking.",
   "Really cool place to make a pit stop when on the road. Really cool to get up close to the structure itself. Great learning experience for the kids.",
   "Always love looking at this monument when passing. The rest area is clean and there's lots of Sherman Hill history inside of it. Check it out!",
   "Really great place and so much information written on various interesting boards. The Visitor Center is also filled with a lot of informative stuff displayed everywhere. They have a well equipped screen section too inside. The Lincoln statue is placed on a huge tall rocks structure. Restrooms are very clean and overall this is a great place to stop for a while or have your packed lunch and then start driving with a fresh mind !",
   "There's not much too it. Nice little rest stop but would benefit from just about anything(heck even a vending machine would improve it) very windy but a good place to meet."
  ]
 },
 {
  "name": "Rocky Mountain Herbarium",
  "address": "1000 E University Ave, Laramie, WY 82071, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3bc06246-932f-11ea-b2cc-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14975165646122810808",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderfully tranquil spot on the University campus where you can relax and enjoy a great collection of botanical specimens.",
   "Time in energy and the work that all the folks that keep this going is impressive. It's a little space but it's beautiful and very educational about some of the local fauna",
   "This garden is magic.  Especially on a very cold day when you can walk out of sub zero weather and into a greenhouse filled with flowering plants.  The staff is nice.  There are a few tables and chairs.  They have a coffee and tea station.",
   "A sample from all over the world. Worth visiting.",
   "I love plants 😭"
  ]
 },
 {
  "name": "Ames Brothers Monument",
  "address": "210 Monument Rd, Buford, WY 82052, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c1475e4-932f-11ea-98cf-14b31f159f22.png",
  "tags": [
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=16734225646292024792",
  "source": "GoogleMaps",
  "reviews": [
   "Not the most exciting attraction. Makes you wonder if this was an afterthought to the Lincoln one down the road or vice versa. Would be far more interesting if there was an accompanying museum, but they probably blew the budget on the rock!",
   "In the middle of nowhere, this thing pops up. Kind of cool. The kids loved the prairie dogs and trying to climb it. Cool piece of history. No bathrooms or water. Worth it if you want to see something out of the ordinary.",
   "Two brothers decide to build a pyramid.  And the good news is, it's still here for us to enjoy.\n\nWe found the pyramid from a list of roadside attractions we came up with for our Houston-to-Vancouver drive.  \n\nThe story and legacy are intersting.  Seeing how civilization (and the train line) moved away from the pyramids gives you a hands-on understanding of how development of the west changed so much.\n\nAn extra benefit to stopping at the pyramids is the desolate surroundings.    When we were there, I could hear the noise of a train miles and miles away (no visible sign of rail tracks on our way to the site).  The surrounding land can only be described as \"plains\".  The land is not being worked, no farms, no ranches, it's just the pains of the west.  \n\nReally enjoyable I would now drive out of my way to visit if I were anywhere close.",
   "This is so cool and it is so much larger than I expected it to be. I expected a small rock pile but this is an enormous! Definitely worth going out to see. The road is a little bumpy but easily traveled by car.",
   "It is on a dirt road but it's well maintained."
  ]
 },
 {
  "name": "Red Mountain Open Space",
  "address": "799 Red Canyon Rd, Wellington, CO 80549, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c59457a-932f-11ea-8d3b-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3877331450464679891",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely beautiful open space but be advised there is virtually no shade. The terrain is very diverse and the trails are on the easy side of moderate. It's fascinating to see the old homesteads.",
   "Get there early. There is no tree cover so it can get a bit warm. Remote place which makes it nice and quiet.",
   "It a great place for hiking and horseback riding.  So much fun!!!!! Only reason it's not 5 starts is that there is no potable water for the average person.  Pack it in or bring a Lifestraw.",
   "Beautiful open space film of rolling hills and small canyons. There's not much trees or other shelters in addition to what's at the trailhead, so pack accordingly. Also, no dogs allowed.",
   "This is an amazing area that features very interesting geographical features such as a ridge with multiple layers of rocks that represent different periods in time. You can see where water has worn down the stone. Very beautiful and I would highly recommend seeing it if you have an opportunity."
  ]
 },
 {
  "name": "University of Wyoming Geological Museum",
  "address": "200 N 9th St, Laramie, WY 82072, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3c9f0310-932f-11ea-97c7-14b31f159f22.png",
  "tags": [
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3108921327874329810",
  "source": "GoogleMaps",
  "reviews": [
   "I was blown away by some of the displays and interactivity of the place. The cards that allow you to see 3D images through the app? I've been to some big name museums and even they don't do anything like that!\n\nI gladly bought a shirt from the museum and cannot wait to tell people where I got it. If you are even a tiny bit interested in this kind of stuff you have to stop by.",
   "Hard to find, small, but pretty neat.  Nice quick stop for a road trip.",
   "Small, but fun museum. Has some interactive things for kids. Really like the AR sandbox that shows how water flows on mountains",
   "Kids had a great time. Main attraction was an augmented reality sand box that allowed them to see how water flowed between different elevations and changes in landscape...",
   "I was amazed at the amount of original fossils they have in their tremendous displays!"
  ]
 },
 {
  "name": "University of Wyoming Art Museum",
  "address": "Centennial Complex, 2111 E Willett Dr, Laramie, WY 82071, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3cee34dc-932f-11ea-af60-14b31f159f22.png",
  "tags": [
   "free",
   "art",
   "kids",
   "educate"
  ],
  "link": "https://maps.google.com/?cid=9463382093342615791",
  "source": "GoogleMaps",
  "reviews": [
   "Exhibits are always interesting, beautiful, and well curated. Plus it is free, so everyone should take advantage of it and stop by! \n\nAs a student I really loved the teaching gallery because I think it is such a cool and innovative thing to incorporate into coursework.",
   "Unlike the other university mueseam it frequently changes exhibits making return trips more worthwhile.  It isn't just student work as well they will bring in displays from all over the place.",
   "Great exhibits,  people were accommodating as our grandsons art was in a lower level not normally open on weekends, but they let us in.",
   "Always amazing work with helpful folks!",
   "My kids who are only four and six were so captivated by this Museum that we ended up going about every other week for 3 months. They have very cool displays that rotate out very cool guest speakers and vest guest performers and artists. The staff that works there is very patient and love to talk and help us out and educate."
  ]
 },
 {
  "name": "Lory State Park",
  "address": "708 N Co Rd 25G, Bellvue, CO 80512, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d39791a-932f-11ea-9eff-14b31f159f22.png",
  "tags": [
   "learn",
   "hike",
   "free",
   "nature",
   "kids",
   "hike",
   "hike",
   "walk",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=2589946570422060664",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful place to go exploring. Whether you're looking for a long day hike or a simple meander through nature, this is your place.\n$9 daily admission fee but other than that, everything is free. The visitor center is a great place to bring kids, where they can learn about the wildlife and Natives of the area. You can also pick up a map of the area with the trails and the friendly employees there can answer any of your questions. A log book is there as well, where people from all over can record their visit.\nYou can choose to hike on the reservoir side or go up the mountain. These pictures were taken in early March.",
   "Very sweet place to get lost in. I had time for a quick hike and was very glad I did. The views were incredible. The staff at the entrance was very helpful. I want to come back and hit the more advanced trails. Definitely worth the trip!!",
   "We went on a wonderful hike Christmas morning to see the sunrise from Arthur's Rock. The trails were well marked but a few parts were slippery from the snow last month. It took us a little longer since it was dark so we only got to the first overlook by sunrise, but it was the perfect spot in the end. We will definitely come back to do more of the trails! The trail had plenty of signs and we're well maintained.",
   "Took a stroll along an easy path however I should have had boots and yaktraks. I slid all over the place on the red clay paths. Great place to sit and enjoy the quiet and the beauty of the red rock cliff walls. I will be visiting in the spring time to walk and see more wildlife.",
   "Lory State Park is one of my favorite destinations in the Fort Collins area, not only because of the scenery, but because of the climbing. Im not going to say that the Rock is my favorite, in fact I really dislike it. It’s very heavy grain granite, and you often pop feet on the slippery crystals which simultaneously puncture your fingers while offering surprisingly low friction. Friction improves in the cold weather, but it’s still not amazing. Despite the crusty rock that can at times be chossy, the South Face and the Overlook offer some very interesting and technical climbs, with the unique Arthur’s Rock style. The bouldering is also quite good, but the rock definitely takes some getting used to. \n\nAll in all, Lory is a great place for some chunky granite climbing."
  ]
 },
 {
  "name": "Pawnee National Grassland",
  "address": "115 North 2nd Ave, Ault, CO 80610, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3d877238-932f-11ea-aabc-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=861350677157313664",
  "source": "GoogleMaps",
  "reviews": [
   "When the weather's nice it's a great. Walk for hours and not see another person. All natural, like before the settlers got here. Great place to sit and pull my thoughts together for the upcoming week. Get rid of work and let some nature come on.",
   "Nice way to enjoy Colorado without dealing with the crowds in the mountains.  Not sure about the summer months, but if you go at dusk in November you may not see any other people.  The spectre of civilization is very apparent in all the industrial operations and private land in the area, but it is still a great way to experience the vastness of Colorado's plains with relative freedom.",
   "It sucks the amount of private property you have to meander around.  But still worth it. A nice place to see the prairie as it used to be. Hunter antelope here also. Was a bit challenging due to the limited public land, but was a great hunting trip.",
   "Drive out to Pawnee every week or so to practice shooting. The only con is people don't pick up their own shells and targets. Come on people pack out what you pack in. Help keep Pawnee clean and accessable for everyone.",
   "I love the Pawnee National Grassland.  Pawnee Buttes, Ghost Towns,... There is a lot to do out there if you look for it.  Beware though that its big and fairly flat without a ton of signs or landmarks.  You can get lost easily.  Fill the car before heading out too.. Gas stations are far and few.  Overall a great place for the whole family."
  ]
 },
 {
  "name": "Rocky Mountain National Park",
  "address": "Colorado, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3dca47f4-932f-11ea-9f6f-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=18025638007915053591",
  "source": "GoogleMaps",
  "reviews": [
   "This was an amazing experience! Perfect for people of all ages. We saw a ton of wild life, and the trails were a ton of fun! The view was spectacular.  I wish we would have came during the summer instead of winter because more things are open and hours back riding is offered during the summer months. But I highly recommend visiting this park, you won't regret it!",
   "We have been to Rocky Mountain NP many times. It is one of our favorite places to go to. We have hiked to many lakes and most of the waterfalls. We have gone to RMNP many times at the end of May when the road opens for the first time. That is a great time to check out the waterfalls because of the snow melt. So the volume and intensity of the falls is probably at its greatest.",
   "This was our second time to visit the park. We have been in the summer but we wanted to see the park in the winter. It did not disappoint. There are still many trails for hiking/snowshoeing as well as wildlife to see. Trail ridge road is partially closed but it did not affect our visit at all. We stayed in Estes Park and the next time we will try out the Grand Lake side.",
   "Always enjoy my time here. Bear lake is a good option for an easy hike. It’s paved, but you still feel like you got into the mountains. If you’re up for more, hike to nymph, dream and then emerald lake. It’s one of my favs. Another good one that is relatively easy with a big payoff is Alberta Falls.",
   "I mean, it’s Rocky Mountain National Park my dudes. What can I say? Nothing. But I can type a bunch of words so that this counts as a detailed review. You feel me? This is probably enough words. ✌🏻✌🏻✌🏻✌🏻✌🏻"
  ]
 },
 {
  "name": "Laramie Railroad Depot",
  "address": "600 S 1st St, Laramie, WY 82072, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e088998-932f-11ea-9eec-14b31f159f22.png",
  "tags": [
   "history",
   "historic",
   "historic",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7242857044188935861",
  "source": "GoogleMaps",
  "reviews": [
   "A key piece of Laramie history, the railroad depot is a gem. Built of locally quarried stone and little changed in more than a century, it is a popular site for weddings, parties, and other celebrations. Unfortunately, it's not in regular passenger service anymore, though vintage locomotives such as the UP 4014 Big Boy make the Laramie Depot an occasional stop.",
   "Awesomely maintained historic building. Great for events. Large bathrooms and kitchen, tables chairs etc. Also has a lot of neat curated historic railroad displays. Many fun local events here",
   "Historic, respo sibley for the founding of Laramie WY.   Small railroad museum and some historic cars. The snowplow train is massive. \n\nOver-track pedestrian bridge makes viewing much easier.",
   "If you are an avid train enthusiast then look no further! The Laramie Railroad Depot has to of great history! There are lots of artifacts from the early days of the Union Pacific Railroad and the Laramie Hahn's Peak and Pacific Railroad. The museum is a great place to rent out for events and parties. I see something new every I stop in. Check it out!",
   "Neat little spot of history tucked into downtown Laramie. It has a nice little play area and a train that you can look at any time of the day. It is also a great location for events and gatherings."
  ]
 },
 {
  "name": "Boardwalk Park",
  "address": "100 N 5th St, Windsor, CO 80550, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e4b3800-932f-11ea-8aff-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "kids",
   "active"
  ],
  "link": "https://maps.google.com/?cid=7830226547439693002",
  "source": "GoogleMaps",
  "reviews": [
   "We've always loved this park.  The kids love being able to rent the paddle boats and canoes. They ate very reasonable too. We've rented a covered shelter a few times and the only thing we're didn't like was there were people already using the space and we had to have them move.  I think it would have been easier to have a sign saying it would be reserved . But overall we really enjoy spending the day here.",
   "Absolutely top tier. It's well maintained, I love the concerts they put on here. The area for swimming is a little small, but it's usually not too overwhelmed of people. They weren't various water crafts, in the sense of paddle boards and those water bicycles.The path around the lake is a very nice walk, and the views in every direction are scenic. Make a point of going here if you want to see something they are showing, because the stage is great.",
   "Good place to take the kids\nHot spot for Pokemon Go fans (lots of stops)\nAnd a beautiful paved path for hikers, joggers and bikers.",
   "Love it here! Peaceful & calm, yet still alive and active. Clean beach, beautiful water, and a great place to be with friends and loved ones",
   "Excellent place for a stroll... Especially early morning! 👍"
  ]
 },
 {
  "name": "Riverbend Ponds Natural Area",
  "address": "E Prospect Rd, Fort Collins, CO 80525, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3e938bd4-932f-11ea-a433-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "kids",
   "walk",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=12963883969434109209",
  "source": "GoogleMaps",
  "reviews": [
   "Riverbend ponds is a great place to escape the city without leaving the city.. the trails are nice and wide although can be somewhat muddy in the winter time.. there are lots of birds that live in the marshy areas and I've even seen bald eagles there which is a wonderful site.. I love getting exercise walking all of the various trails and checking out the wildlife",
   "Nice trails, so many options the parking lot can be full and you can still find some privacy. Good space with lots of ponds and lovely river views. Looks like a great option for in town fishing.",
   "Good wildlife viewing and some ok fishing. Very nice place to walk with kids. It also had good south and east sky line so it's nice for watching sunrises and summer storms out on the plains. \nDownsides are messy fisherman (lots of line hooks and bait containers left about) and people who don't clean up after their dogs.",
   "The best place to walk your doggie!  It is gorgeous winter, spring, summer, fall.  Lots of great bird-watching.",
   "Beautiful place for a walk. In my opinion, one of Fort Collins better natural areas. In the summer you can see geese, ducks, blue heron,  pelicans, egrets and more. Beautiful also in the winter with snow on the ground."
  ]
 },
 {
  "name": "Gateway Natural Area",
  "address": "5216 West Highway 14, Bellvue, CO 80512, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3ee3a802-932f-11ea-a99d-14b31f159f22.png",
  "tags": [
   "hike",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=17222258260423271441",
  "source": "GoogleMaps",
  "reviews": [
   "Very pretty setting just a short drive from Fort Collins. Very nice park, facilities, natural setting. Ideal when \"off peak\" times to avoid weekenders and big buses of rafting companies. Winter and early / late hours are wonderful if you like Solitude, hiking or Fly Fishing the ice shelf. Great year round trout fishing on North Fork below Seaman's Reservoir and up / down the Poudre from Gateway. River can get a lot of pressure in the area, given quick access from town and high season. For more solitude and less people, keep climbing up the canyon (west) and Highway 14. There are plenty of places to go off the grid with short hike in access to some fantastic fly fishing.... camping, hiking, etc.",
   "The fly fishing here is amazing one of the best spots in all of Colorado! If you are a beginner or an advanced fly fisherman and you have the chance definitely give this place a try!",
   "Love this place. Beautiful with good facilities. Only downsides are that you can't camp overnight, and it's $7 for parking, which seems a little bit steep.",
   "It's beautiful,  peaceful but stay on main road.  We took a path to the river for the dog to have a drink and encountered a rattler ready to strike.  I enjoy it more in the winter.  The dam is cool.",
   "Another beautiful and relaxing place to visit."
  ]
 },
 {
  "name": "Glenmere Park",
  "address": "Greeley, CO 80631, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f2fa526-932f-11ea-92aa-14b31f159f22.png",
  "tags": [
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=11615270843163871624",
  "source": "GoogleMaps",
  "reviews": [
   "It is a good park i enjoy walking around. Watch out for the geese. I have attached a picture of a goose. If you get near them they will hiss. They may look serene but they have the soul of the devil inside of them. Cool park though",
   "One of the most beautiful spots in all of Northern Colorado. This park is well maintained and great for an evening walk.",
   "Love this place close to home and great for my run.",
   "Calm, scenic, geese arnt super hostile, and a fishing spot for all ages. Best visited in the evening with plenty of mosquito repellent.",
   "I love this park. One of the best places to take pictures and can have a romantic outing. Great and beautiful place to hang out."
  ]
 },
 {
  "name": "Bittersweet Park",
  "address": "35th Ave & 16th St, Greeley, CO 80634, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3f8825b8-932f-11ea-8fec-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3264489502107972462",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Good parking. And a great paved path around it that makes for about a 1 mile walk. Always nicely cleaned, and a great place to go! If you live in the area and want a good walk, this is the place!",
   "Nice place to take your kids and exercise. Nothing like a day out at the park picnicking",
   "Beautiful Park. The lake is beautiful and relaxing to sit by. The park has great amenities and it has a lot of offer. I love walking the path.",
   "Great place for a nice walk and they are busy doing massive improvements to the park so this summer it will be even better!!",
   "Love this park. Great playground for the kids. And a wonderful paved sidewalk all around the park & lake."
  ]
 },
 {
  "name": "Our Lady of Peace Shrine",
  "address": "185 Equality, Pine Bluffs, WY 82082, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/3fda8b92-932f-11ea-b59c-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=14464852647671057388",
  "source": "GoogleMaps",
  "reviews": [
   "A very peaceful place to visit for meditation, prayer, or to simply be reminded of history. \nA woman chosen to birth a very special child into the world.\n\nA child chosen by the Father to show what true love is, through sacrifice.\n\nA man who preached to all on how to live, how to forgive, how to rebuke, how to love.",
   "Very Beautiful stations of the cross or the way of sorrow Everyone thinks it’s a Catholic thing. But Jesus Christ walked those steps for everyone one of us. Yes the high mass churches hold those stations in their hearts more than most because that’s the suffering Jesus Christ endured to give us salvation. I personally weep when I stop and give my thanks and reflect on the love he has for me. To whoever built this I give you thanks for such a beautiful peaceful place. And bringing the sacrifice and sorrow that Jesus Christ suffered so we may all may be forgiven and have everlasting life.",
   "Not at all peaceful with I-80 just feet away and big rigs whizzing by. It should be named \"Our Lady of All Things Loud Shrine\" Putting trees up may help. Better yet, relocate it somewhere more quiet. 🚚🚛 ⛟ Its like having church in a bowling alley. 🎳🎳 Personally, I enjoyed the \"Welcome To Nebraska\" sign more.  Go Big Red !!!🏈🏈🏈",
   "Wow,  what a place, great place to stop and say a prayer",
   "Such a cool 15-20 minute detour getting there and back from the interstate. There is so much to look at besides Mother Mary, and has seating for Catholics or anyone who wants to comfortably kneel for a while and pray."
  ]
 },
 {
  "name": "Nagle Warren Mansion B&B",
  "address": "222 E 17th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4024ca5c-932f-11ea-b56c-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "history",
   "cheap",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9468408620997955075",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great tour of the mansion with Brandy before she showed us to our beautiful room. We enjoyed a glass of wine in the 3rd floor sitting room before dinner. Had the pleasure of having the owner Jim and his family join us for breakfast and enjoyed some additional history on the home and Cheyenne. We will definitely return!",
   "The mansion is an excellent restoration of a Victorian mansion with many modern updates. It's beautiful inside. The attention to detail in what Jim and his team do is outstanding! I've never stayed at a cleaner accommodation. Nothing has been done 'on the cheap' at NWM. I guess I'll be looking for reasons to go to Cheyenne again so I can stay there.",
   "The Mansion is closing down October 1st, 2019. I am so happy we were able to stay in this beautiful B&B and that we were able to attend the Christmas High Tea that was hosted here. Best wishes on your retirement Mr. Osterfoss and I loved staying at your beautiful home ❤",
   "Such a beautiful Bed & Breakfast. Clean, great location, AMAZING staff. Jim & crew make you feel pampered. I cannot wait to go back!",
   "Jim is a fantastic host. The service, staff and especially the breakfast is better than any five star hotel in a big city.  Worth the trip to Cheyenne all by itself. The mansion and the history is amazing."
  ]
 },
 {
  "name": "Medicine Bow-Routt National Forest",
  "address": "Laramie, WY 82070, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/406817cc-932f-11ea-8111-14b31f159f22.png",
  "tags": [
   "hike",
   "historic",
   "hike",
   "affordable",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=11472911452550940168",
  "source": "GoogleMaps",
  "reviews": [
   "The beauty of this place can't be explained in words.. My first 12k ft hike and it was strenous but the view from the top was completely worth it.. The biggest hurdle is unpredictable weather... I started the hike around 6 am and by 9 am there were clouds and scary ones... Always make sure you are prepared for the extreme swings... The drive to the lakes is also fun.. please try to find the historic crash wreckage if you are there.. :D",
   "Love this National Forest! Lots of things to do and see. We went to Rocky Mountain National Park just after visiting here and agreed that we enjoyed medicine bow more. We visited in early July and though the main road was open and clear, most of the side roads like Mirror Lake were still deep in snow. There are many places to park and hike though. Beautiful alpine lakes!",
   "It's simply one of the most beautiful mountain ranges I've ever seen.  The campgrounds are basic, no power, water or septic.  It keeps it very affordable. The camp host were we stayed was great, really nice and helpful. He even gave us a trail map to keep.",
   "I can't believe the forest service! You've barely got your sleds unloaded and they're there looking for your state trails stickers, then you get up on the trail and its barely ridable, because it has'nt been groomed. Really disappointing!",
   "Drive up here before the sunrise, you won't find a better view of South Eastern Wyoming in the morning! Once the sun is up you can continue further up the mountains shoulders, there are many places to pull over and picnic if you want. Not much else out this way, this is mountain country and mostly big ranch owned. Beautiful scenery though, a good photographer will have many chances at some very unique shots!"
  ]
 },
 {
  "name": "Arapahoe Bend Natural Area",
  "address": "Fort Collins, CO 80528, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40ad5e68-932f-11ea-8022-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "walk",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=15681399662729478337",
  "source": "GoogleMaps",
  "reviews": [
   "I've taken dogs for walks here several times and it's a great easy trail with varying pathways. Horses are welcome here too! Great for someone looking to expose their animals to different traffic including bikes, hikers, runners and of course dogs. If you go all the way around the reservoir it turns into a pretty nice ride taking around an hour and a half at the walk.",
   "There is a paved path and dirt. Port-a-potty in the middle. I usually see bald eagles here when I go. Sometimes they hang out by the cabin. The noise from the freeway can be quite loud and in summer it can be stinky but has a nice view and you can do a loop walk to get some mileage in.",
   "Such a beautiful area.  Nice paved/dirt path around the reservoir.  Terrific view of the front range. \n\nThe area is heavily posted with signs requiring dogs to be leashed and restricting access to the reservoir bank\n\nBe prepared as many people will let their dogs run loose and attacks, bites often result.",
   "Great place to walk dogs or take a short horseback ride! In the warmer months plenty of water fowl can be seen. Easy trails with pretty views despite being right in the city still.",
   "I absolutely love this play. Easy access to several ponds, a beautiful nature trail, and best of all, the poudre river is right there"
  ]
 },
 {
  "name": "Red Rocks Park and Amphitheatre",
  "address": "18300 W Alameda Pkwy, Morrison, CO 80465, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/40fb3082-932f-11ea-84e2-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "music",
   "walk",
   "hike",
   "free",
   "walk",
   "history"
  ],
  "link": "https://maps.google.com/?cid=8972268900862187181",
  "source": "GoogleMaps",
  "reviews": [
   "It was great to finally visit this place and see why it's so popular. The red rock formations are a thing of beauty and makes any trip truly worth it. The geologically carved area that would become the amphitheater sits at a higher elevation so you get breathtaking views of the landscape, especially on a clear day. Downtown Denver's skyline is also visible in the distance, but you need binoculars or an advanced zoom camera to get a closer look. We'll definitely see a concert on our next visit.\n\nWe were here for a total of three hours. We started at the Red Rocks Trading Post at the base. Inside that building, we checked the gift shop and the Music Hall of Fame gallery, which features John Denver and many folk and jazz music greats. There are no admission fees there. We then walked uphill to the amphitheater, which took half an hour, with lots of picture taking stops along the way. We visited in the winter so the icy sections of the walk path also slowed us down. We took the same way going down, although there are other paths. If you don't prefer the hike, you can drive up to the top and park near the amphitheater.",
   "Definitely a must see in Colorado! You can see most by driving through in your car so no excuses! Make sure to drive carefully there are sharp turns all around red rocks park. There are plenty of “little hikes” to take so pull off and park when you see signs for such. I like bringing friends to red rocks when they come to visit.",
   "Absolutely worth a visit if you’re in the area.  Free admission (and parking) on quiet days (no shows scheduled) and there are plenty of trials to hike adjacent to the amphitheater. Visitors are free to roam the grounds — even walk on stage as long as you are mindful to follow the posted rules. I fully recommend a visit if you have time. Great for a quick workout, too! You could easily spend as little as 30 minutes or up to 2 hours here.",
   "Aside from the most incredible concerts, Red Rocks also has hiking trails and incredible photo opportunities. If you are attending a concert for your first time I recommend getting there early to find parking in the lot and also wear comfortable shoes as it can be a climb to get up to the venue if you have to park on the road below. You will have an amazing time here!",
   "This place is absolutely gorgeous. They have a small gift shop and history walk in the building at the top of the staircase. Visiting here not only gives you good exercise with all the stairs, but spectacular views of the mountain range. I would love to come to a concert here some point in the future!"
  ]
 },
 {
  "name": "Denver Botanic Gardens",
  "address": "1007 York St, Denver, CO 80206, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4148183e-932f-11ea-8115-14b31f159f22.png",
  "tags": [
   "music",
   "nature",
   "kids",
   "unique",
   "food",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6704051071303811988",
  "source": "GoogleMaps",
  "reviews": [
   "Whether in town for a couple days or a permanent resident of Denver, this is a MUST visit Denver attraction. The gardens are absolutely beautiful. They are open year round and every season brings something new. Additionally, they have great events ranging from music and concerts in the summer to their spring and fall markets to Blossoms of Light in the Winter. There really is something for everybody. Also, you can't go wrong grabbing a snack at their cafes.\n\nThe gardens offer a breath of fresh in the city. Its just another reason for you to spend more time outside.",
   "This place is beautiful!!! I always get amazing photos! I have never had a bad experience here and I've been going here for as long as I can remember! This place has an amazing landscape. I would recommend if you love flowers! It is so peaceful here! You can just sit with nature and enjoy it all.",
   "This is a very nice place to spend the day. There's so many beautiful plants and pools as well as some cool stuff for kids. I especially like the Japanese garden. It just was so peaceful. The Greenhouse area is also really cool. The plants in there are wild! Five stars!",
   "We visited during the week and it was not crowded at all. We strolled and enjoyed taking our time. I imagine that it probably would be more lively during the spring and summer months, but we still thought most parts were beautiful. The gift shop had a wide selection of unique things, but I wish more items had “Denver Botanic Gardens” on them, so that I could have bought some souvenirs. I loved the painted canvas greeting cards, though. Overall, it was great and definitely worth the visit!",
   "Came here after a work trip and loved it. It's a great place to sit and enjoy being outside to enjoy nature. There are several areas including a huge greenhouse and some water gardens.  The photos of this place do not do the beauty of the gardens justice.  They offer lunch there at the bistro and the food is very good."
  ]
 },
 {
  "name": "Greeley History Museum",
  "address": "714 8th St, Greeley, CO 80631, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41a69512-932f-11ea-9314-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=18430142411466241421",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to stop and get accurate, interesting history about Greeley and the surrounding communities. Their ever-changing exhibits keep things from becoming stale should you choose to return, and their gift shop has some WONDERFUL cookbooks that were derived from recipes local cultures have handed down over generations. Definitely recommend stopping in for a visit the next time you’re in Downtown Greeley.",
   "Small, took about 45 minutes to get through the whole thing. We had time to kill so we walked slow. Inexpensive, it cost me and my three children $25",
   "Very interesting. Very clean. Very informative.",
   "Love the \"Brown Bag\" presentations.",
   "Visited the place where I used to fold papers before delivering them. Memory Lane."
  ]
 },
 {
  "name": "Fort Laramie Visitor Center",
  "address": "965 Grey Rocks Road, Fort Laramie, WY 82212, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/41f29bcc-932f-11ea-af56-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "free",
   "history",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=2183934378481263707",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome experience. My wife and I traveled short distance from Scottsbluff. Beautiful clear November day the young lady at the visitor center was so friendly! All the staff was, and they played the video for us even though no other visitors were there at the time. They made us feel so special like we were honored guests. \nIt was such a special day.",
   "Ranger Joe is great,  funny and knowledgeable  about the fort and it's history. We will definitely be back.",
   "Great historical site with lots of restored buildings and originals as well, free admission and plenty of parking. The video in the visitor center was very helpful, but it would have been nice to get more of the native history as well. Dogs are allowed on the grounds and the trails, but not inside the buildings (which makes sense). It's nice that they are accommodating though, even going as far as having some dog watering stations. Definitely worth a detour if you want to jump into some US History",
   "Ranger Joe is great,funny and very knowledgeable about fort Laramie will definitely go back",
   "Come visit history.  Really cool"
  ]
 },
 {
  "name": "Scotts Bluff National Monument",
  "address": "190276 Old Oregon Trail, Gering, NE 69341, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/423ea89c-932f-11ea-851d-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "knowledgeable",
   "hike",
   "hike",
   "history"
  ],
  "link": "https://maps.google.com/?cid=795971636046548045",
  "source": "GoogleMaps",
  "reviews": [
   "I'm all about nature, so I was thrilled to finally visit. The Ranger station is full of interesting facts about the Bluffs and surrounding area. Our granddaughter, 8 yrs, was enthralled by the vistas and all the trails that she could walk. She even wanted to walk the trail from the top down to the Ranger station.  A great follow on to the Chimney Rock visit.",
   "This National Monument was beautiful! We stopped here on a mini road trip from Colorado to South Dakota. We saw the monument on the map and made it a rest stop / activity mid-way. We were able to hike two trails at the top of the monument and the view was incredible!  The staff was super friendly, knowledgeable, and helpful. The area was undergoing some renovations, but it did not interfere with our experience here at all. We loved it and highly recommend it!",
   "Excellent little stopover with stunning views of the surrounding areas if you drive to the top. Want to stretch your legs? Hike up from the visitor center on the Saddlerock trail for about 3 total miles. It's mostly paved, and you'll get into some views you can't get driving up.\n\nWe're full time RVr's focused on hiking. Blog link in my bio.",
   "This area of the country is beautiful with so much history. The NM is very well maintained and everything is easy to get to. The drive up Mitchell pass is a must as well as the short trek up and down Saddle Rock Trail, just make sure you take plenty of water! The scenes from the top of the bluffs is beautiful and you can see the whole town and valley below. The visitors center was closed when we visited but I'm sure it has a lot of great information.",
   "Such a Beautiful place! My wife and I spent time and hiked with our oldest daughter here on the 2nd of Feb. and it was around 70 and sunny! A great God blessed day here together and so much fun!"
  ]
 },
 {
  "name": "Snowy Range Ski Area",
  "address": "3254 WY-130, Centennial, WY 82055, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42881000-932f-11ea-b4a5-14b31f159f22.png",
  "tags": [
   "affordable",
   "learn",
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6834904200545294660",
  "source": "GoogleMaps",
  "reviews": [
   "Class act all the way! Great for individuals and large groups. I would totally feel safe sending my 12 year old on a group trip here. The owners Aaron and Becky have done an amazing job making cool changes the last few years!! Big enough for a great ski, small enough for a good time. Ski school is affordable and we'll worth it!",
   "Had another fantastic day at Snowy Range! Fresh powder, great runs, friendly staff, short lines, very reasonable prices - it just doesn't get any better than this! Each of the instructors me/my kids have taken lessons with have been top notch - thank you Paul, Steve and Flash! Absolutely worthwhile to take a lesson each day, you learn something each time, try more runs, and meet new people. Great variety of runs and plenty for beginners/intermediate who don't like the steep slopes of Colorado and just want to have fun. This will be my forever skiing \"home\"!",
   "Super cold! And so windy that I was getting blown backwards on a couple of the greens. If the conditions were a little bit better, with a little more fresh snow covering the ice, would have been perfect. Oh and the girl at the counter was friendlier than most resorts I've been through out here.",
   "Snowy Range Ski Area is a hidden gem! Its not too packed, the snow fall is great and the instructors are Top Notch. It just needs a bit better food situation for the lodge and it would be a perfect 5 stars.\n\nIf you have kiddos and need lessons, ask for Jacob H. HE IS AMAZING at instructing the little ones in snowboarding!! We will return quite a bit because of him.",
   "Snowy Range is a pretty small local hill with something for everyone. The lines are generally pretty quick if there are any at all. I hit on an awesome powder day and the entire mountain was open. If you can make it to Corner Mountain, do so. Different terrain and usually not as windy.\nThe bar has some good locally brewed beers and the food is worth a try."
  ]
 },
 {
  "name": "Bee Family Centennial Farm Msm",
  "address": "4320 E Co Rd 58, Fort Collins, CO 80524, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/42c65dc8-932f-11ea-829f-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "family",
   "kids",
   "family",
   "family",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=13485228644888251254",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice farm, the tour gives some insights of the American life from before 100 years ago. Owners are extremely nice and helpful.",
   "I bought a groupon for our family.   We took 5 children ages 4 to 8 and three adults. We went on Saturday afternoon this also happened to be their Pioneer weekend. Leanne was our guide.  The kids wanted to see the animals. Leanne took us to see the cows,  chickens,  turkeys,  a sheep and pig. She was very interactive with the children asking questions and explaining different animal facts. We toured the original home and then the family home from 1942. There also was a woman spinning sheep fleece to make yarn. Mr. Rick took us on a wagon ride called the trolly and explained farming. This is a great family activity.  The Bee Family members were wonderful tour guides.  We will return again next spring to see the new farm animal babies.",
   "We had a blast as a family visiting this farm and checking out all it had to offer!",
   "A lot of history, great place to go with family.",
   "We went today and enjoyed this farm museum SO much!  Rich was so personable and funny, a very warm hearted man.  They have SO much interesting relics and information on the history of farming in Colorado.  We all thought it was well worth the trip, and I believe younger children would REALLY enjoy it, as they have fun activities set up for them.  :)"
  ]
 },
 {
  "name": "Denver Zoo",
  "address": "2300 Steele St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43119a22-932f-11ea-84a4-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "food",
   "drink",
   "food",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6052009770394020905",
  "source": "GoogleMaps",
  "reviews": [
   "Great way to learn and spend a day with family! I love that they are always working to expand and make the exhibits for the animals better. My favorite exhibit is the monkeys. I like that they have real trees to climb and can go inside and out freely. \nThe food is good there as well! I would recommend the Pineapple Dole Whip, it is just like ice cream but much healthier.",
   "The animals are easy to see with the well designed exhibits. Bring an umbrella on a hot day for shade; there are some long stretches of parts without shade. \nThe zoo does a lot of animal encounters and educational shows/activities throughout the day! So fun!\nFood and drink are pricey but you can bring in your own meals.",
   "We just got a membership, and although I’d love to give 5 stars, the limited accessibility of the zoo makes it hard for me to enjoy it fully. There are several bathrooms without automated door buttons and several exhibits I could not enjoy because of my wheelchair. My kids and husband had a wonderful time, and I did too, but I can’t give it a better rating than three stars. The paths are very uneven and it’s incredibly difficult to wheel around. I would have rented a scooter but they charge $30/day!",
   "As an Aurora Native, I have been visiting the Zoo all my life. As far as the dozen or so Zoo's I have visited, it is pretty good. They are always making improvements. My favorite attraction is Tropical Discovery (I could watch the bats all day!). The Zoo is building new attractions currently and I look forward to seeing the new Stingray exhibit. The giraffes, the primates and the pachyderms are also nicely developed. Well informed and very welcoming staff too. 🐠🦅🐧🦘🦇🐘🐫🦓🐅🐒🦏🐾🌲🌳",
   "Great zoo. Not too big but packs a punch delivering plenty of very interesting things to see. Great place to go for an afternoon stroll and ask questions to the volunteer staff. Would absolutely recommend for children and adults alike. They also have free days so keep an eye out for them."
  ]
 },
 {
  "name": "Guernsey Ruts",
  "address": "Guernsey, WY 82214, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/435c3b7a-932f-11ea-a62e-14b31f159f22.png",
  "tags": [
   "historic",
   "walking",
   "history",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=3877212813410454651",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous view and a really nice kept trail! Definitely worth a drive to go see the massive ruts that the wagons made so many years ago.",
   "Very historic and interesting. It sounds boring but it's not. Great walking path. Only wish I'd stopped at name rock.",
   "Well kept. You can feel the history here.",
   "Amazing how wagons could carve ruts this deep into rock. The people traveling the Oregon Trail were definitely tougher than most people today! A must see, and read all the Interpretive signs to learn more about the amazing travels. I also recommend touring Fort Peck and Register Cliffs while you're in the area.",
   "This is a peaceful tranquil place to visit. Located near the North Platte River in Guernsey Wyoming. I recommend doing a little bit of research on the area as there are many historical sites to visit such as Fort Laramie which had a trading post, Telegraph office, it was a pony express stop and a major stop along the way 4 people heading to California in search of gold. It is part of the Mormon trail for people heading to Salt Lake City and it also part of the Oregon Trail 4 people heading up to the northwest. Originally part of Spain and then France held it and eventually sold it as part of the Louisiana Purchase."
  ]
 },
 {
  "name": "Denver Art Museum",
  "address": "100 W 14th Ave Pkwy, Denver, CO 80204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43b011d2-932f-11ea-b812-14b31f159f22.png",
  "tags": [
   "creative",
   "drink",
   "art",
   "creative",
   "unique",
   "art",
   "kids",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4895980547090937649",
  "source": "GoogleMaps",
  "reviews": [
   "Purchased our VIP Hotel package for the Monet exhibit which was amazing!!! We flew in from Idaho on Th and spent all day there Friday, Jan. 31, 2020. We had \"dinner\" at their snack bar, salad, sandwich and drink and stayed for their QUARTERLY Friday night party, with a DJ, art trivia, a glass of wine,  and another exhibit on the third floor featuring light \"Entanglement\".  This was a most creative exhibit.\nThe other building was closed for renovation until 2021, so access to their great restaurant and permanent exhibits were not available. But, we so enjoyed our main focus: the Monet exhibit. I rate it a 10. Even the building is art.  Great work Denver Art Museum staff, organizers, docents, and volunteers!!! Will return again.",
   "This museum was very interesting. The attractions were creative to say the very least. The exhibits were all unique. There is a mirror exhibit that visitors can physically enter and see themselves reflected dozens of times over. A real play on vision. The design of the building itself is breath taking, from the inside of the building, top of the stairs...take a look down, the architecture is a work of art. This is worth the visit.",
   "A great collection of pieces with variety, artfully grouped in themes and sub-themes. Interactive portions were plentiful and engaging. I appreciate the opportunity to come and soak in inspiration, and then be asked to create something for myself. I'm glad we allocated most of our day to our visit, and that the pass is good all day so that we could take a break for lunch and return refreshed.",
   "I LOVE THIS PLACE! I’m actually pretty sure I’m going to do everything in my power to come back in May for the George Orwell installation! Great place to visit with or without kids! \n\nSo many beautiful works of art of every type of medium! I also loved how they really used all of the space available to them for art work. We didn’t get to go to the sculpture garden because it was snowing but I can only imagine. We went during the week and did not have any problem with a crowd - there were even a few school groups there but they were the best behaved I’ve ever seen (good job teachers!) \n\nI can’t wait to become a member here (: there gift shop also has a lot of neat things to offer!",
   "We are so lucky to have such an amazing museum here in Denver! They get some of the best exhibits in the country which people from all over come to see. The permeates collections are great too. I also like that the museum is kid friendly. I’ve been bring my nieces since they were quite young and because of their experiences here have found a love for art. Thanks DAM!!!"
  ]
 },
 {
  "name": "Harmony Park",
  "address": "5015 Corbett Dr, Fort Collins, CO 80528, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/43fb99ee-932f-11ea-88b6-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4180055037201948497",
  "source": "GoogleMaps",
  "reviews": [
   "Clean, quiet park with a solid playground. It also has a plumbed restroom, drinking fountain, and a small covered picnic area. My son loves climbing on the boulders placed around the park.",
   "Lovely little, long, skinny park, nice play area, nice restrooms, nice playing fields, all well maintained",
   "Very pretty park! Not as many things to do, but very peaceful and in a nice neighborhood.",
   "It's a very nice park.",
   "Perfect place to take the kids. Swings, restrooms, slides, rocks to climb, picnic tables, large fields, and a little playhouse unde"
  ]
 },
 {
  "name": "Global Village Museum of Arts",
  "address": "200 W Mountain Ave # C, Fort Collins, CO 80521, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4448f6f6-932f-11ea-b0f7-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=563268740500446446",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to spend the afternoon.   Great displays of different cultures.  You can take your time going through and get up close and personal with the exhibits.  Friendly and informative staff.",
   "Very interesting art but very small for the admission.",
   "Had a wonderful visit here with my son when he had a cultural project to do and they had an exhibit of Russian art!",
   "A terrific gem of a museum.  Fort Collins is lucky to have!",
   "Excellent museum for a great price, $5 adult,  $1 kid. Small and full of interesting exhibits for adults and kids. Right in Old Town. "
  ]
 },
 {
  "name": "Butterfly Pavilion",
  "address": "6252 W 104th Ave, Westminster, CO 80020, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/448ae1fa-932f-11ea-85bb-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "knowledgeable",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=10460704098384178030",
  "source": "GoogleMaps",
  "reviews": [
   "Great learning experience for adults and kids alike. We got a pass connected with the children’s museum for my son. The play area is good but it is difficult to see your child when they are up in the ‘tree house’ part. We enjoyed looking at the marine and bug exhibits as well as walking in the butterfly area.",
   "First time back to the Butterfly Pavilion since 1998 (i was 5 at the time I went, now 26) and I had an absolutely wonderful time!!! My boyfriend and I went just kinda willy nilly and really enjoyed learning things we didn’t know!!! Rosie the tarantula was very cool and really quite sweet! I didn’t think I would ever hold a spider but, Alex made me feel much more comfortable facing my fears! Alex was incredible and very knowledgeable! I enjoyed my time so much and found it very therapeutic, I ended up getting a Membership! Will definitely be going back later this week! A must do if you live in Denver!!!",
   "This place is awesome. I'm a Florida native and I know invertebrates but man oh man the staff there is absolutely nothing short of astonishing with their knowledge and happy to share. I got lots of photos and if you want to see lots of butterflies flying around I reccomend going towards closing time. They all fly around at high speed to find the best sleeping spots! Just watch your step and be gentle if they land on you!",
   "The staff is wonderful! Very knowledgeable and kind. My daughter had tons of questions and they were more than happy to answer all of them.",
   "First time going today. I was really looking forward to it because I had heard it was a nice place. Disappointing. 3 rooms with not much to see for $27. Go to the zoo instead."
  ]
 },
 {
  "name": "Wings Over the Rockies Air & Space Museum",
  "address": "7711 E Academy Blvd, Denver, CO 80230, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/44d29990-932f-11ea-87c0-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18042612551295927622",
  "source": "GoogleMaps",
  "reviews": [
   "What a unique and interesting place to go visit! It's an amazing experience to be so close to the actual planes. Just the amount of history in one building is amazing. They do a great job explaining the types of airplanes and what they were built for. May not hold the interest of smaller children, but they do a good job of keeping things there for all ages.",
   "We had several companies celebrating here. Was wonderful, fun and interesting. Excellent space for such. However would also recommend for family or school outing visit.",
   "As you can see my husband enjoyed himself here. I think anyone who, as a as a child dreamed of flying planes are going into space, would enjoy themselves here. My only complaint would be that they need to do more interactive programs with the aircraft. But definitely a great way to spend a few hours.",
   "This may be a super cool place if you have a love for aviation. I have been spoiled with seeing many museums over the years. If you have visited the Air & Space in DC or the Air and Space Annex in the DC area this will be a huge disappointment.  If you have not experienced any similar ones, then this would be a good first one to see.",
   "I took my son and we spent three wonderful hour here. Very interesting and educational place. Would definitely recommend visiting!"
  ]
 },
 {
  "name": "Boot Barn",
  "address": "1518 Capitol Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4511cf9a-932f-11ea-b020-14b31f159f22.png",
  "tags": [
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=13920951298419049621",
  "source": "GoogleMaps",
  "reviews": [
   "This is the place for all things western. Knowledgeable associates ready to guide you through every item.  We both got great fitting Wrangler jeans.",
   "My son purchased boots for our two year old granddaughter but they were too small. We exchanged them with no hassle. We got great customer service and the boot, hat and Western wear selection is phenomenal here.",
   "Not sure why Google still calls it the Boot Barn as the only signage now is Wrangler.  My lovely lady found a pair of boots she loved so we dropped a little coin here. I found the prices of the 'other' stuff really high so I could not give five stars.  But the boot selection was outstanding and the prices on those seemed reasonable.",
   "Great store. They’ve got everything.",
   "Location location location. The 3 most important words in Real Estate. This place is located in the heart 💖💖 of Cowboy Country off the old Lincoln Highway. What could possibly be better ??? Well, for one, Carrie Underwood taking me on a shopping spree there would be a step in the right direction. Giddy-Up 🤠🤠🤠"
  ]
 },
 {
  "name": "Medicine Bow-Routt National Forests",
  "address": "Steamboat Springs, CO 80487, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45529c28-932f-11ea-924e-14b31f159f22.png",
  "tags": [
   "unique",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=15100505697730499900",
  "source": "GoogleMaps",
  "reviews": [
   "Camped up by Dunckley Pass. The Flat Tops are incredibly scenic! Unique topography of the flat topped alpine mountains with jagged cliffs on the sides. So glad it's a protected wilderness area. Wait until after Aug 1st to visit. There are dozens of lakes, with lots of mosquitos in June and July.",
   "We went there for snow Buddies Dog Sledding it was an outstanding experience that we even got to have time with the dogs and help them set up and drive the sleds. It is a little bit out of the way but I highly recommend it.",
   "This is the Backcountry you need to see on skis or in the summer. Such surreal natural wildlife and settings. Views that can only be compared to true mountain tops.",
   "One of the prettiest parks in all of Colorado. Been coming up here for the last 25 years and still enjoy it like it's the first time.  I highly recommend any part of the park for camping fishing hiking and relaxation!",
   "This national Forest exceeded our expectations!! The views were great. Weather was lovely. And there were very few mosquitoes. Visited in early July and the main road was open but pretty much all side roads were still covered in snow."
  ]
 },
 {
  "name": "Greeley Poudre River Trails",
  "address": "Vern Schafer Blvd, Greeley, CO 80631, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4595dfe2-932f-11ea-8be1-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=8859168262570631073",
  "source": "GoogleMaps",
  "reviews": [
   "Rode my bike the whole trail while overdosed on mucinex and dehydrated to getting some cool pics. The trail is pretty cool a lot of nice boomers on the trail but I love the route",
   "My wife, son, and I took a two mile stroll along this trail on a cool winter day. Even in the winter, there is an abundance of birds: geese, ducks, hawks and small birds. The trail is wide and paved. The river runs adjacent to a gravel pit as you leave the Park's boundry, so expect that, but we enjoyed the river and beautiful views of the Colorado Rockies.",
   "what an amazing trail. This is an easy 21 mile paved and mostly flat trail that goes to/from Greeley to/from Windsor with plenty of stops in between. A portion of this trail is within the city but the majority is out in the country and you are surrounded by beautiful views of mountains, open fields, lakes, trees and farmland and all that you can hear is the wind rustling through the trees and maybe a small critter jumping into the water. I would say the best time to go is in the spring or fall when the air is cool and crisp, or in the early morning hours of the summer.",
   "As I am Indian and I was here first time. This is one of the best trail. I was here on Sunday evening and hardly rush over here. Really nice. Highly recommended.",
   "One of my most favorite trails. Never too busy for biking, rollerblading or running."
  ]
 },
 {
  "name": "Glendo State Park",
  "address": "397 Glendo Park Rd, Glendo, WY 82213, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/45e81eb0-932f-11ea-bbb2-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=2010541564280934064",
  "source": "GoogleMaps",
  "reviews": [
   "Very quiet and pleasant. Very limited electric hookups. Several campgrounds, many sites with view of the reservoir. We dry camped for $25 (non-resident 😢) for 1 night in our motorhome. This fee seems quite steep for dry camping. Great site in Whiskey Gulch campground. We were down near the water. Ridge top sites could be quite windy.",
   "Love being here!",
   "Amazing and great people. They helped my family member when he was hurt along with warning us about the weather, one man seemed off duty but still went around warning people about a tornado that might hit out area and what to do.",
   "Beautiful",
   "Good fishing"
  ]
 },
 {
  "name": "Poor Richard's Restaurant",
  "address": "2233 E Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/463e2e0a-932f-11ea-924a-14b31f159f22.png",
  "tags": [
   "walking",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13486751162668863619",
  "source": "GoogleMaps",
  "reviews": [
   "Been in town plenty times and haven’t tried this place until now. Lots of great reviews especially on the service. It was not a let down at all. The outside doesn’t at all do the inside justice. Lots of pretty woodwork and decor. Walking in there's a decked out vintage looking bar and dim lit tables with cushioned chairs. On the other side there’s rows of intimate tables and booths. Menu is full of plenty of dishes to satisfy any kind of inkling. Service was pleasant and attentive. Large parking lot as well which filled up very fast at lunch time.",
   "Highly recommend. Been there twice now and the food is always amazing. Their cranberry marg is my favorite thing on the menu by far. The service is incredible! We will continue to come back when we're in the mood for some great food.",
   "Prime rib was great! Service was friendly and attentive. Bathrooms were clean. Great place to have dinner.",
   "Okay, so I put T-Joes steak as the best in town, but Poor Richards is right there. A little more expensive, but better tasting in some ways. The quality of the meat I can taste is so much better here! They also have the best steak I have ever had. It's better in it's own ways. I had the top sirloin with brandied mushrooms and it melted in my mouth. I'm full but drooling thinking about it. Haha. The staff was nice, I wouldn't say they were super or went above and beyond by any means, but they were nice. Highly recommend 9/10",
   "Food was mediocre at best and pricess were high.  Update:. I am basing this review off my only visit there which was in October 2019.  Apparently if you leave a bad review here the owner or manager/employee will find you on facebook and send you messages from a fake Facebook account."
  ]
 },
 {
  "name": "Anong's | Thai Cuisine",
  "address": "620 Central Ave, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46806762-932f-11ea-a58b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17355053811827208221",
  "source": "GoogleMaps",
  "reviews": [
   "For Thai food in Wyoming, this is very good. Order extra spicy, 4-5, if you really like spicy. Tofu was a little chewy. Atmosphere was clean and cozy. Very cool decor.",
   "Hidden gem.Loved the ambience and decor. The service was really nice. All the dishes were spot on except the complimentary soup which was bland. Best Thai in Cheyenne.",
   "This place is wonderful!! I am hooked on their Pad Thai with Beef. The flavors are amazing. I highly recommend Anong's if you want the best Thai food in Cheyenne!!!",
   "I'm over 800 miles from home and this little gem in a small town is a wonderful find. Food has been authentic and very very good every time we've came. Would highly recommend the Tomka Soup.",
   "I have never had thai food until now. This place rocks. The food was so good. The soup they give you to start off with is delicious!!!! Also I hope to try it again."
  ]
 },
 {
  "name": "Guadalajara Mexican Restaurant Cheyenne",
  "address": "1745 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/46cab6fa-932f-11ea-ad83-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17654788609177622145",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and atmosphere. Very colorful furniture. The seafood burrito is my go to dish. Had a good amount of sauce. Service is great.",
   "Food was amazing!!! Burrito Loco, so so good.  Very flavorful. My waiter was very nice and always checking on me.  His recommendation of the burrito was spot on.",
   "Ordered at 6 pm through door dash. Called restaurant at 8 pm and they said they never received our order. Funny thing is door dash charged us $80.00 for the order we never got. Thank you Guadalajara for not making our food. Lost a great customer.",
   "Best Mexican food in town! Family has been going here since I was a kid. Food is great, people are great! Love this place",
   "Wow! Excellent, fast service. Perfect food: temp, taste, presentation. My new favorite."
  ]
 },
 {
  "name": "Texas Roadhouse",
  "address": "1931 Blue Grass Cir, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47149192-932f-11ea-95bb-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2090337232436050564",
  "source": "GoogleMaps",
  "reviews": [
   "You can’t go wrong. Only once have I had an over cooked steak here and they replaced it with no questions asked. Even let me take the other one home for my dog",
   "This place has the happiest employees which carries over to how their guests are treated!  The food is always amazing and they have done a great job adapting to social distancing.  I recommend this place for a first date all the way to date night away from the kids. Or bring the kids for family fun (you know, when they open again)",
   "We were ready to wait 35-40 minutes for a table and were surprised when it only took 10 minutes. Our waitress was Cassy and she was pretty good. Kept drinks full and asked a few times if everything was all right. My potato soup was forgotten and I said don't worry about it as my entree was already there. Cassy came a few minutes later with my soup ready to go in take home containers with the condiments in a separate bag on the side. That was great! Food tasted delicious from the peanuts, the fresh dinner rolls, tender steaks and the honey mustard. YUM!",
   "We went there tonight for dinner and Justin was our server! Oh my gosh this guy ROCKS! He was polite, funny, dedicated and friendly! Absolutely the very best experience we have ever had there and we have NEVER had a bad experience! Justin just went way above and beyond! The food was perfection! It was a best night! Thank you so much!!!",
   "Texas Roadhouse, I've been eating at them around the country for many years and I can honestly say, I've never been disappointed!\nNo matter what day, what location they are consistently the absolute best steak and family restaurants around!\nIf you can't get a good steak here then you are way to finicky..\nGive them a try, I guarantee you won't be disappointed!\n\nThe service and atmosphere is fantastic.."
  ]
 },
 {
  "name": "L'Osteria Mondello",
  "address": "1507 Stillwater Ave ste d, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/475e1282-932f-11ea-8cf3-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=11815613248459076438",
  "source": "GoogleMaps",
  "reviews": [
   "Best pizza in Cheyenne. Moved here recently and after touring the city and pizza this is the best. If you love thin crust NY Style pizza. Prices are reasonable. Best thing to order is cheese or pepperoni (and from other places we order supreme) but the simple pizza is the best here. Too many toppings make a soggy crust.",
   "We stopped in for the deluxe pizza it was awesome! Best pizza in town. The service was superb👌 Friendly staff\nWill definitely come back!",
   "i love that this place is family owned by Italians! they’re all hilarious and give great customer service! the pizza rolls are my favorite, stuffed with mozzarella and pepperoni. ugh so delicious!",
   "I’ve been going to mondelo's since I was a little kid. We’ve always had amazing service from joe the owner, and the pizza has always been some of the best pizza in town! I will continue to go here now as an adult!",
   "L'Osteria Mondello, Small World. I used to work here. That was close to 2 years ago. It's hard to describe the sensation of working in a place like this. It's small and busy but genuine. It's like the difference between a good suit and a cheap suit.\nI started out here as a dishwasher. I would work here for reasonable hours and reasonable pay but the thing I will always remember is the people. Joe and Cesare, Chanrda Moore, Ashley- The pizzeria was a bustling plethora of soul. \nI had solved so many problems here and caused some by accident. I have made the pizzas. I have cleaned the freezers. I have seen the heart of L'Osterio Mondello and sometimes the pressure can be a bit too much for folks but there Is  a flaming, beating heart to be found here.\nThe pizza is solid. Definitely a cut above other chain brands. When there is enough staff? The restaurant Sings like the hills of Arcadia. It's vibrant, rich like song. Sure the place has had some water problems and as someone who had to clean out the occasional Wasp Nest, I can speak with certainty that Joe Mondello, \"Iron Joe\" as I used to call him, is going to run his restaurant for the rest of his life or die trying. That's how you know it's authentic.\nI cannot recommend Mondello's enough to casual people. Come in. Experience the truth and all that soft gospel. Only one pizza place exactly like it in Cheyenne for all it's worth.\nUntil I find a better, actual sit down pizza joint, Mondellos will always stand out in my mind as the genuine article."
  ]
 },
 {
  "name": "Bella Fuoco Wood Fired Pizza",
  "address": "2115 Warren Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47a83b14-932f-11ea-91ba-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "creative",
   "free",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8893924908504116352",
  "source": "GoogleMaps",
  "reviews": [
   "The best place to eat in Cheyenne -- no question. Great food, great service, and great people.\n\nI've read a couple other reviews and, yes, it gets crowded, especially in the summer. But it's deserved, and they always deliver friendly service and great pizza.",
   "Amazing.  I enjoyed the friendly staff members.  Fantastic  service and  I loved  my Jalapeno popper pizza with chicken and bacon.  The sweet  chili sauce was  splendid to top it off.  William  our waiter  was fantastic. Will be back  real soon.👍👌",
   "Great food. Sometimes good service. But multiple times now we have been told we had a table reserved only to have another employee refuse to seat us when we got there and given other guests preference over us. It's a popular place, but it seems they do not value having the professionalism to maintain reservations. And they pick and choose who they will give tables to. Tonight isn't the first time we have walked out because of this they \nwill continue to lose valuable customers if they treat people this way.",
   "Great selection of food. Atmosphere was good. Everything was well organised. Staff were nice.",
   "Pretty good pizza.  It has a decent menu with some creative pizza options as well a make your own option.  The crust is the centerpiece here, it is so delicious. Gluten free options are on the list along with a selection of craft beers and a soda fountain and selected bottles sodas."
  ]
 },
 {
  "name": "The Albany",
  "address": "1506 Capitol Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/47f28ac2-932f-11ea-9da0-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6019177316152355508",
  "source": "GoogleMaps",
  "reviews": [
   "The Albany restaurant has always been one of the better, non-chain restaurants in Cheyenne. It has been around for many decades, so that should be a good indication it's high quality food and great atmosphere. I would like to give it another half star, but this system wouldn't let me do that. The majority of the dining area is polished wood booths, with a few tables in the back for groups larger than 4. It fits right in with the downtown area, having vintage pictures up so you can see a glimpse of what Cheyenne used to be like. All-in-all, a very good place to eat!",
   "Hadn't been here in a couple years as we live an hour south. Came here tonite as they closed dine in restaurants in Colorado. The service and food was really great. My prime rib was the best I've had in a long time. My wife's sirloin was excellent too.",
   "Excellent comfort food served in a unassuming but comfortable dining room. This place has been in business a while and I can understand why.",
   "Delicious food in a great atmosphere. The Albany has been here a long time, and it seems to be a great place to taste some of Cheyenne. There's a liquor store ingrained next to it if you're into that. Prices for the restaurant were reasonable and I would not mind stopping here again.",
   "Our food was excellent.  We had quick service from hostess, bartender and waitress. Reasonable prices on all items. Order drinks at their bar while we waited for our table. As soon as we were seated we were greeted by a friendly and courteous waitress.  We ordered water and appetizer of bull nuts.  They were not overcooked and came promptly.   My salad was fresh and the homemade salad dressing was delicious.   Their house favorite, the open prime rib sandwich was delicious and tender.  Their chile Rellenos were also good.   It was the annual Frontier Days so lots of people but still had great service and fresh food."
  ]
 },
 {
  "name": "Sanford's Grub & Pub",
  "address": "115 E 17th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48381fca-932f-11ea-b3f2-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "family",
   "free",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7549693014925940440",
  "source": "GoogleMaps",
  "reviews": [
   "This will likely be the only meal I ever eat in the great state of Wyoming, and it was absolutely worth the drive. The ribs were phenomenal, the fried bread and butter was phenomenal, the beans were delicious, and the beers nice and cold. The menu selections were frankly not what I'd expect for the area, but that's no complaint - the Cajun cuisine plays well everywhere. Service was top notch. Sanford's was the first result when I googled \"best restaurant in Cheyenne\" and while it's also the only restaurant in Cheyenne I will likely ever try, it's clear to this long time traveler that this would be the best restaurant in many cities in the US.",
   "Sanford's is a definite must if you are in the Cheyenne Wyoming area. The food is amazing and their portions are HUGE.\n\nI had the Garlic Mushroom Steak with shrimp Gumbo and parmesan fries. So good and the service was top notch. Josh our bartender made sure that our visit was fun and memorable.",
   "Good food, large portions and all kinds of crazy sandwiches , burgers and salads and more. Endless fries. Huge menu. Reasonably priced. A good place to meet up with friends or family in a relaxed atmosphere. They serve alcohol. Friendly staff. Located in old downtown Cheyenne.  Free street parking. Military discounts!",
   "This place is an outstanding eatery!! Recommended by our hotel, we stopped in for lunch. This was my favorite restaurant on our week long trip. Food and service is top notch. Hope to come back one day when in the area!",
   "Very cool place for a family. Lots of food!  Everything we had was very good. You’ll definitely have leftovers."
  ]
 },
 {
  "name": "Hacienda Guadalajara Cheyenne",
  "address": "317 E Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4883a79c-932f-11ea-8ed1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17365465375518181498",
  "source": "GoogleMaps",
  "reviews": [
   "My daughter took me to supper for my birthday.  I love the bacon wrapped shrimp.  It was so good!  Before we settled in our chairs, we were served fresh chips and salsa and they were really good!  The employees are really kind and attentive and get you anything you need.  Best Mexican food in town!",
   "Great food and great service always. \nThe waiters make you feel special yet they are always busy. \nThe restaurant always has a lot of guests. \nI enjoy the seafood burrito and my husband also has it now too.\nVery tasty.",
   "This is an Americanized Mexican menu. So, I only gave 4 stars. They did tame down the entry level flavors. That was a recommended improvement from 2 years ago. My previous review was 3 stars. Our server was very polite and kind. The server paid adequate attention to our dining needs. Our table area was clean. Prices were reasonable.  Overall, the food was at a good temp. One of our entrees had freezer burned shrimp, so I just could not give 5 stars. All diners at our table enjoyed their meals.",
   "This is one of my favorite places to go eat out. The staff is super nice no matter how busy they are. Food is delicious.",
   "Best Mexican cuisine in town! I love taking my wife here for dinner dates and you get tons of food for the price"
  ]
 },
 {
  "name": "Grandpa's Downtown Pizzeria",
  "address": "1611 Central Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/48cae9ee-932f-11ea-9b53-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "eat",
   "affordable",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8398405776683759573",
  "source": "GoogleMaps",
  "reviews": [
   "The pizza was phenomenal! I was totally surprised by how great the pies were. I admit I \"judged the book by its cover\" when I went in. It just looks like another pizza place. but, you can taste the love they hand toss into the dough and in the selection of unique toppings. A sausage pizza there is not just another sausage pizza!",
   "This place is Amazing for a quick bite to Eat! The pizza is delicious. Very affordable. I Recommend you stop in and say hi to Grandpa.",
   "The pizza was soooo good! Get the special Grandpa's Pizza for sure, but all the pizza were awesome. The garlic Knots are amazing too. Best I've ever had! And while we didn't try any of the other food, some people at the table next to us were raving about the sandwiches as well. I highly recommend it! Great place with great food!",
   "Such a great pizza place. And very delicious",
   "Tried my first pizza from Grandpa's and it was delicious. If you love a New York pie, it is must stop. Will recommend to everyone."
  ]
 },
 {
  "name": "Bejo Sushi and Asian Cuisine",
  "address": "112 W 17th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49167b4a-932f-11ea-bdc9-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8292455468985278443",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome staff. Extremely nice staff.  The best food around by a long shot.",
   "Hello when I went into this place I thought it was really nice, was greeted quickly, sat down quickly. I know there are options of 12 and under menu but I had my mom, a senior.  She doesn't care much for sushi or Asian food and wasn't very hungry, it was late. On their 12 and under menu my mom wanted Fried Chicken,  they wouldn't let her order it. I didn't understand why we were told no. We did have a child with us as well. We tried to order both for \"her\" but still no. Finally, a manager made an exception, all seemed annoyed. I was not impressed with the entree, the sushi was okay. Pricey. I won't be back. I know, rules are rules.",
   "Hot and Sour soup is my favorite! Attentive staff and great food. Every time I'm in town I make it a point to eat here. I've never once been disappointed, I wish they had one near me in Michigan. :)",
   "Fantastic food.  Absolutely delicious massaman curry and prawn teriyaki.  Weirdly disinterested waiters, not keen on communicating.",
   "The sushi rolls were excellent. My wife loved the sweet and sour chicken. Service was fast and great. The general environment was pleasing as well. You get your money's worth here. I'd definitely recommend and come back when I crave sushi."
  ]
 },
 {
  "name": "R&B Breakfast Club",
  "address": "2102 E Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49651092-932f-11ea-947e-14b31f159f22.png",
  "tags": [
   "family",
   "eat",
   "eat",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16007361495511684268",
  "source": "GoogleMaps",
  "reviews": [
   "Though I don't come here often, my family love to come here for breakfast. Their breakfast burrito is excellent, and I always leave filled. My teenage sons love coming when they have the all you can eat breakfast burrito, so they can stuff themselves and see who can eat the most.\nIt is also fun to sit and look at all the Elvis pictures and collectables. The service is good and friendly.",
   "Awesome breakfast burritos small town environment.  A great place to meet up with friends or coworkers.",
   "Amazing breakfast burritos and burgers! Service is awesome.  Thank you Tish and Karna!",
   "One of  the best places  to eat, ,but because they are always  busy  you  will have wait, but is worth  the wait.. remember  you can call for order  to go. But have to eat it at home.",
   "The breakfast burritos are very good. Green chilli tastes great on them. My kids enjoy the Mickey pancake. There is generally always a wait. Phones stay busy with to go orders. I dont like how rushed you feel while here. Small establishment for how busy it gets for breakfast. Small parking lot."
  ]
 },
 {
  "name": "AB BBQ",
  "address": "1503 W College Dr, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49b1ced2-932f-11ea-9a2c-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4210953469623533690",
  "source": "GoogleMaps",
  "reviews": [
   "Just passing through Cheyenne WY. Asked were the best BBQ was and several people said AB BBQ. A small place in AB Campground with a limited season (April-October)  and hours, 4 - 8 pm. \nOrdered 2 of the 1/2 rack baby back rib dinners with a side of pulled pork and brisket.  Some of the best BBQ I have had in a while. If happen to be hungry and the dates and time fit your schedule, you got to try this place out.",
   "My friends and I were heading up to Wyoming to go fishing for the weekend. We were passing through Cheyenne around dinner time and wanted to get some good food but, Cheyenne is not really known for that.  One of my friends found this place online and convinced us to try it out. It was only about a minute or two off of I 25.   The food was tremendous. The ribs were the best thing but I suggest any of it.  Also, the people working there were hilarious and very fun to be around.   They even let us bring our own beers in there .  I highly recommend this place. Way better than any BS chain restaurants",
   "Very delicious! Potato salad was very good, the corn was as well. They need knifes on the tables to spread butter. The bbq sauce was spot on and the meat (I had the brisket) was juicy, and flavorful. I wish they had given me a bun instead of a roll though. I give It a solid 4.",
   "I love local restaurants.  AB BBQ does not disappoint at being a restaurant that has an amazing menu.\n\nWhy only four stars?  I want to give that last star, but the sauce, the sauce just leaves something to be desired.  It's almost too tomato-y?    \n\nWe ended up just getting the meat itself, so a half point of pork and a half pound of brisket.  The meat was amazing, no fat, falling apart on the fork.  The staff was super busy (they were taking care of both the camp ground and the restaurant) but they managed to get us what we wanted fairly fast.  \n\nI plan on going to this BBQ restaurant in the future",
   "Possibly the best barbeque I've had at a great price.  Bring family and friends . Your friends and family will thank you."
  ]
 },
 {
  "name": "Korean House Restaurant",
  "address": "3219 Snyder Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/49f7d508-932f-11ea-b8ca-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "unique",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12424508638517899005",
  "source": "GoogleMaps",
  "reviews": [
   "Always consistently great quality, reasonable prices. Flawless customer service, down to earth and friendly staff. Everything feels very clean and welcoming. This is a small local business I love to support and would recommend to absolutely everyone!!!",
   "Delicious!! Friendly staff and delicious food. Bring cash.",
   "The food was unique and delicious. The people were so sweet! Not much of a wait for the quality of food. I can't wait to go back next time I'm in town.",
   "I had bulgogi at another restaurant in Fort Collins and I had a hankering, so I tried this place to fill the void. It wasn't bad by any means, but it definitely left me wanting for the bulgogi from the other place. The restaurant itself is odd and kind of run down looking. If you eat your food there they serve you on paper plates. They also only take cash which is pretty inconvenient. Maybe it's just me and I'm wrong, but as far as I know, most people these days only use cards for payments. I might be able to be convinced to go back if somebody I'm with wants to go, but otherwise I will head to Fort Collins if I have another bulgogi hankering.",
   "KIM WHIPS IT UP IN DA KITCHEN. Everything be too fuego🔥🔥🔥 it’s always cooked to perfection. It’s pretty small inside but it’s so delicious. The beef bulgogi SLAPS💥 the Korean rice cakes SLAP💥 the kimchi SLAPS 💥 bi bim bop goes HARRRRDDDDD. Love the food here it’s definitely super authentic and fresh there’s NO other place like it in Cheyenne."
  ]
 },
 {
  "name": "2 Doors Down",
  "address": "118 E 17th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a3887c0-932f-11ea-b945-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4058000454389482227",
  "source": "GoogleMaps",
  "reviews": [
   "What a great and unexpected find for lunch while passing through Cheyenne. Unfortunately we couldn't sit down because of COVID but the staff were so nice, welcoming, and accommodating, even bringing out the food to our car. The burgers were excellent, the meat was nicely seasoned, and the veggies were fresh. Thank you so much to the lovely staff of two doors down for making our stop so great. Definitely would recommend to anyone while in Cheyenne, Wyoming.",
   "Food is always very good. Price is right and the service makes you feel as if you just stepped into your own mom's kitchen. During the Covid 19 crisis, 2 doors down delivered. They didn't lay anyone off, and their service was unwavering. 10/10 the best burger shop in Cheyenne. Easily top 3 customer service in Cheyenne. Period.",
   "After staying in Denver for the week I decided to make the two-hour track up to Cheyenne so I could cross another state off of my bucket list. Of course, the drive made me a bit peckish, and this burger place came highly rated on Yelp. I'm glad I stopped in, as the servers were more than friendly and the burger was juicy, fresh, and cooked exactly the way I asked for. Make sure to sample the fries and the many dipping sauces. I don't know if I'll ever find my way back to Wyoming, but if I do, I'll be sure to give this place another visit.",
   "Great food and amazing service! Whether you want to be sat upstairs or downstairs, the waiters and waitresses are always polite to seat you. Very nice place inside. The servers do seem to ask if you want a refill every 2 minutes or so, but i think it’s great that they are always there and ready to help. Would definitely recommend! Also they have the best ranch in town!",
   "Probably the best Burger shop in Cheyenne. Extremely tasty burgers with bottomless fries. Accompany that with the friendly and energetic crew that is always eager to help you or refill your soda. Definitely will be back."
  ]
 },
 {
  "name": "Wasabi",
  "address": "4620 Grandview Ave #205, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4a814280-932f-11ea-a584-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3173579067492527911",
  "source": "GoogleMaps",
  "reviews": [
   "Wasabi is one of my favorite sushi places in Cheyenne, Wyoming. But the service has always varied in star rating. Lately our server has been real good, she serves the bar area. The food doesn't taste like store bought. They have options, and real good food.",
   "I am always hesitant with sushi restaurants, no where near an ocean. The interior  decorations and attention to detail on style convinced me to give them a chance.\nWe were not disappointed.\nThe four of us ate 7 rolls. The flavors all stood out as we ate and offer a nice variety on the palate. My only complaint was one of the rolls was topped with scallop, crab and shrimp, the the scallops tasted raw, zero texture and slimy. Super gross. But it is a personal thing, so make your own decision. Server said it was all cooked. \nWe will definitely be back.",
   "Great food and priced right -- the sushi was really good, the fried chicken is decent, and the tempura ice cream was great.  \n\nThe standard sushi items are under $6-$7, which is less costly that other Japanese restaurants that I've visited.\n\nHopefully they'll serve ramen on weekends.  Their website is not that clear -- update is needed.",
   "Was our first time eating Japanese food. The food was amazing and I was stuffed from a bowl of ramen. My daughter really enjoyed her sushi.",
   "Food tasty. Environment fun. Restaurant clean."
  ]
 },
 {
  "name": "Wyoming's Rib & Chop House, Cheyenne",
  "address": "400 W Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ad0e964-932f-11ea-b659-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "food",
   "drink",
   "tour",
   "kids",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11945955213528842349",
  "source": "GoogleMaps",
  "reviews": [
   "While here in town we heard about Wyoming's Rib & Chop house from many locals and it was everything that they said and more. Our party ordered local micro brew, Buffalo Rib Eye, shrimp and hot wings and it was all very amazing. \n\nThe Buffalo Rib Eye was so juicy, tender and DELICIOUS. It came with 2 sides and it was very filling. \n\nThe succulent food was coupled with Top Notch service from our server Ashley. She was fun and her personality was such a great fit for the environment. We will gladly spread the word about this place. Thank you Ashley and thank you Wyoming's Rib & Chop House",
   "I was impressed by this place.   I heard about it and said let me give it a try. You can call in for reservations or walk in . The decorum really brings this place to life.  The staff friendly  and on point.   Also the wine. If not sure they do offer taste tester to try which i always like that option b4 buying a bottle.   The food was amazing Juicy soft and satisfying.",
   "I was unpleasantly surprised with this restaurant. Based on the appearance, prices, and google reviews, I walked in the door with the expectation to be impressed. \nWe were seated immediately despite how busy it was. The hostess took our drink order where I ordered a double jack and coke and my husband ordered a double jack on the rocks. She asked him if he wanted it tall or short so he clarified that it didn't matter because it's just supposed to be jack and ice. She still looked confused as she walked away. When our actual waitress came, we very politely asked if he could get the correct drink. She was quick to take the drink and walked away to get it fixed. Moments later, another individual came up and told us that it WAS jack on the rocks. We politely explained the situation again, and said there was definitely coke in his. She told us again that it WAS jack on the rocks, but she would fix it anyway. She then went to the hostess to discuss the situation again. Once they figured out where the mistake was made, they felt the need to come back and explain. Finally about 10 minutes later, he had the right drink. It's great that they eventually fixed the mistake, but better customer service would be to simply fix the issue. We weren't upset or rude, we simply wanted it fixed. The constant back and forth and explanation was unnecessary and unprofessional. \n\nLater we ordered our food which came in a somewhat timely manner. Both of my 6 year old kids LOVE popcorn shrimp, so they ordered the popcorn shrimp off of the kids menu. They ate a few bites and kept saying it was spicy, so I finally tried it. I actually truly like spicy food so I enjoyed it, but it was legitimately spicy. This was surprising to me considering the fact that it was on the CHILDREN'S menu. When I mentioned this to the waitress, she apologized and took the price of the food off the bill. \n\nI ordered the 6oz famous filet with truffle butter which lacked any amount of flavor. I also upgraded to a premium side, asparagus. The side came with only 4 pieces of asparagus. \n\nI did the food tour in the summer of 2019 but we only split chicken and waffles, so I didn't get much experience at that time. Based on what I read online and what I saw there that first time around, I had high hopes for our full meal there, however was quite disappointed.",
   "We had went on a weeks long road trip back in February and this place was our favorite out of all the resturants we stop at. We were surprised to see some Louisiana taste all the way in Wyoming. Being from Louisiana our family thoroughly enjoyed all their meals, from the gumbo to the crab crusted chicken, all of it was excellent. I even had a picky kid that wanted breakfast food and she was even satisfied.",
   "4-27-20    a takeout \nOrdered a Ribeye with fries and broccoli on a side.  $36 - kinda pricey but I was hungry and have no time to look for another steakhouse. The best part of my meal was the broccoli, the steak was ruined. It was WAY OVER-SALTED and overcooked."
  ]
 },
 {
  "name": "Good Friends",
  "address": "507 E Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b2216ca-932f-11ea-a3b9-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "walk",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5704849099176762989",
  "source": "GoogleMaps",
  "reviews": [
   "Just ate their food tonight for supper via takeout, and the food was delicious!  Service was awesome!  Staff very friendly!  I'd give them 10 stars if I could!  Thank you Good Friends!  1st time eating your food & I'll definitely be back soon!",
   "Food was made fresh and staff was friendly.  Lots of lunch specials to choose from and priced well.  We got garlic wings, beef on a stick, Mongolian beef and twice cooked pork, and meal came with cup of soup as well.  Food was not spicy, and also I'm used to food being a little bit sweeter so that was a change.  It was a good meal, but I think I prefer sweeter and more spicy flavor.  I would go again and maybe order dishes like orange or sesame chicken for the sweeter taste.",
   "Awful. \n\nOrdered Lo Mien and Beef and Broccoli. New cooks or someone has gone smell blind. The noodles were overcooked and they didn't add vegetables. The Beef and Broccoli tasted exactly like the noodles.  The fried rice was plain brown rice and didn't even have soy sauce. I'm not a cook but I think things should have their own balance and definitely different flavors.\n\nSave your money, walk into Sams Club, and buy whatever they have. Not only will you save money...you won't leave disappointed!",
   "Everything was absolutely exquisite.  We enjoyed the very best Chinese food we've ever had.  The prices were great, too.  It's my new favorite restaurant in Cheyenne.",
   "Ordered the orange chicken and spicy garlic beef the food had great flavor. The egg rolls are more like spring rolls but again good flavor and crisp. That crab cream cheese wantons were great with flavor but I wish their was more filling. Overall I will definitely be back to eat again."
  ]
 },
 {
  "name": "Napoli's",
  "address": "1901 Central Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4b74a3dc-932f-11ea-b422-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "food",
   "delicious",
   "art",
   "food",
   "art"
  ],
  "link": "https://maps.google.com/?cid=15578463621266803389",
  "source": "GoogleMaps",
  "reviews": [
   "The food here is amazing it is truly the fine Italian food that Cheyenne has been missing. It definitely leans a little more to the fine dining aspect instead of the family dining that they advertise. Make sure to try their fresh baked bread, additionally we had the Napoli's Special and the Chicken Fettuccine Alfredo. The sauces are to die for!",
   "Absolutely loved the food and services.  Great place to go. Customer service was excellent.  Great price as well. The chocolate cake was amazing.  Can't wait to go back.",
   "The food is wonderful and never have a problem with the service. Everytime we come in they are professional and the owners are wonderful and very friendly. We have been here over five more times and the food and service has never been disappointing. It just keeps getting better",
   "This is my second time visiting Napoli’s and again it was delicious. We took friends this time and they very much enjoyed their meal as well. I love the Art Deco ambiance and the wait staff are top notch. Doesn’t get much better than wonderful atmosphere, attentive staff and excellent food. We’ll be back.",
   "The calamari was very very much frozen and then microwaved. Tough and chewy.  Reassembled fish sticks from grocery store. I ordered the eggplant parmesan, it was average, neither good nor bad. Atmosphere was nice, very art deco. Service was excellent.  However I probably will not be coming back."
  ]
 },
 {
  "name": "Outback Steakhouse",
  "address": "1626 Fleischli Pkwy, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4bbc5b70-932f-11ea-bbb3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "drink",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15149570344703720096",
  "source": "GoogleMaps",
  "reviews": [
   "Great food and welcoming atmosphere. Wait staff was on his first day and did great! Steak was cooked just the way I ordered add fries were hot when food came to the table. I always enjoy the loaf bread to tide me over until the meal comes.",
   "I went for lunch on a Saturday. Not very many people. Service was 5 star. Prices were a little to much. Food taste ok. I had the 6oz Sirloin with coconut shrimp  and mashed potato. The other plate is Lamb, Mac and cheese, and sweet potato.",
   "First time going there tonight and it was amazing! Amazing food! I ordered what the waitress recommended and it was delicious. The waitress was so great. Was there to check on us and was happy to get us what we needed and everything we needed. Was great on refilling drink! Amazing service.",
   "Super great service,  food was okay. I've eaten there before and its been much better. Our waitress was great though!",
   "The service was great, attentive, and timely. The food was excellent and very well prepared. I would go out of my way to come to this location again if I was near Cheyenne."
  ]
 },
 {
  "name": "Twin Dragon",
  "address": "1809 Carey Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c07cd7e-932f-11ea-8ec5-14b31f159f22.png",
  "tags": [
   "drink",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=240393471275105780",
  "source": "GoogleMaps",
  "reviews": [
   "I loved it. Cute plates for the lil ones! Small place but cozy. We had a large family ❤ great on drink refills. Buffet was good with seafood options. Love the hot and sour soup. Not bad price for what you get at all. Even the dessert area was clean and had many options.",
   "Great Mandarin and Szechuan style asian food, amazing prices and they also offer a buffet during certain hours. Authentic and diverse menu with loads to choose from, and always great service.",
   "Everything was delicious. Will definitely be going back next time were going through cheyenne.",
   "Terrible service. The hostess is very rude and is the manager's daughter. So if you want them to fix your order...good luck. They're going to make you pay. Tried telling me that they gave us orange chicken...but it was clearly pork. She just argued with us and made us pay for more. Then they messed it up again...Same order. They then proceeded to try and make me pay MORE. FOR A THIRD TIME. Very displeased with this place. I'll make sure to go to China Buffet instead.",
   "Terrible Service, the hostess is the managers daughter so good luck getting anything on your order fixed. They are rude and just don’t care. Literally got home and they gave us pork instead of Chicken and then continued to argue with us saying it was chicken. Got there to fix it and when we went to leave our order was wrong AGAIN. They tried getting us to pay 3 times when we already paid twice for the order. Highly disappointed will go somewhere else next time."
  ]
 },
 {
  "name": "Mongolian Grill",
  "address": "1637 Stillwater Ave STE C, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4c6185b4-932f-11ea-a854-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15398865578976796649",
  "source": "GoogleMaps",
  "reviews": [
   "Made a stop here for lunch and was not disappointed. There was an array of vegetables, meats and sauces to choose from. Sizes of bowls were small to large in size. Discovered theres a way to arrange everything to get maximum amount for the $$ according to repeat customers. Veggies, loose leaf veggies and meat, apply sauce, then top with a heaping mound of noodles. I shall try next visit. Even the price was reasonable for what you get so I have no complaints. Rice and a chicken noodle kind of egg drop soup was included. Don't recommend getting water tasted like it was straight from tap. Overall I enjoyed the food an atmosphere. Waitresses were friendly and so was our cook. If you're in Cheyenne be sure to stop in and try this hidden treasure.",
   "The experience is cool!! Watching the guys cook on the big round flat top, go round and round is neat. The cooks are always pleasant and nice. The food seems prepared fresh and generally always fully stocked. 3 sizes are available Sm Med and Lrg. Med bowl runs about $9 for dinner and your almost always guaranteed leftovers. You get too choose what you want in it as far as veggies, meat and sauces. You can get complimentary rice and soup. The girls that help seat and check out customers are on and off and ya never know what you will get. You will leave full and satisfied!! So good.",
   "This place is good. For the money it’s kinda steep when you have to figure out what tastes good with sauces I have never tried. Either way it’s still good just not for me for the price",
   "This is one of my favorite places to eat at. The food is delicious and taste great reheated the next day. The staff has always been very friendly. I hate to see new staff members everytime I go in. The place definitely needs to be updated, but it's still comfortable and welcoming.",
   "Food was good. Service was good. Cooks looked miserable. The ceiling is greasy and dirty. There were small rocks in the hot sauce that my husband and I both chomped down upon and hurt our teeth. They need get their hot sauce from a higher quality source to prevent this from happening again. Don't get hot sauce in your food."
  ]
 },
 {
  "name": "Hathaways Restaurant & Lounge",
  "address": "2800 W Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ca61d42-932f-11ea-966a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "music",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9359457343039556008",
  "source": "GoogleMaps",
  "reviews": [
   "We \"discovered\" Hathaways Restaurant & Lounge on Google Maps, looking for a nice restaurant. This was one of the best restaurants we ever eaten in our (long) travels.",
   "Dining room closes at 10p. Staying in hotel and wanted a late dinner to go. Arrived at 945p. Service was friendly and excellent. Burger and fries were fantastic.",
   "Good food and atmosphere. Would have had another beer if asked before happy hour ended.",
   "Amazing.  This place should have been packed. Amazing food, decor, background music and service.  A MUST stop for an amazing meal.  The gift stop is remarkable.  We will be back to stay for a few days!  So relaxing and amazing!",
   "Not very good had a reservations had to wait 30 Mins. To get our table the person at the door didn't make us feel welcome finally got our table. Went and got i line to eat no salad no salad dressing prime rib was over cooked dry and cold no shrimp no rolls alot of food was empty also the servers doing the food where not wearing gloves 60 bucks a plate is crazy not happy i was told when i called it was 35 per plate not happy won't be back i will say the server was great ."
  ]
 },
 {
  "name": "Luxury Diner",
  "address": "1401 W Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4cf012d8-932f-11ea-848d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "eat",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=5915818539830244045",
  "source": "GoogleMaps",
  "reviews": [
   "The service was impecable. The food was made fresh and tasted delicious. Portions were huge, so much that I was not able to Finnish my meal. Old school hospitality at a great value. Definitely a place to stop by.",
   "Lots of food for a really good price. I always love what I am served and they have phenomenal staff. It does get busy so I recommend. Going on a weekday for breakfast. The pancakes are some of the best I have had in town.",
   "Food and atmosphere are amazing. I love the old time diner this place is. Much recommended.",
   "Excellent place to eat! Loved our breakfast and our waitress did a great job! Friendly and cozy diner! 💗💗",
   "Their curbside service goes above and beyond. Locally unique with a killer green chili breakfast burrito. Breakfast choices include German sausage, chrizzo and gigantic thick sliced bacon. Order eggs any style, french toast and whole grain breads."
  ]
 },
 {
  "name": "China Buffet",
  "address": "1958 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d36b8f4-932f-11ea-b149-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "eat",
   "food",
   "food",
   "eat",
   "food",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=5061306081450217211",
  "source": "GoogleMaps",
  "reviews": [
   "Food was excellent! Buffet was well stocked and kept clean. The only issue we had was our server did not stay on top of things as frequently as he should have (drink refills mostly) or I would have given 5 stars.",
   "This was a good place to eat. My hubby and I stopped here while we were out for dinner. The buffet was stocked full of food and it was good. Some of it was rather cold though. Otherwise, no complaints. I’d recommend you check it out.",
   "Chefs regularly check to see if food server dishes need refilling. They also bring a  cloth to wipe spills. Price is really fair for a great array of food. A host is available for queries at all times. Consistency with dishes. They do not \"skimp\" or hold back on expensive mushrooms and shrimp. A lady host proudly shared that people come from all over to have lunch/dine at China Buffet, Cheyenne *****Best in Colorado..Best in Wyoming..that l have tasted. Servings should be moderate. Digest well and savor.\nIf Asian food not your daily consumption, it is inadvisable not to overindulge; as with spicy, firy hot Indian food. Your gut may not welcome it.",
   "We love coming in to eat. We are always greeted quickly and friendly.  Everyone there is welcoming  and so happy to help. The food is always great. If they are running low on  something they are happy to make more fresh.",
   "We have gone to dinner twice here and each time the restroom is very clean. The food is fresh and yummy. The staff are all helpful and nice. I do wish the desert items were placed together and perhaps a couple more choices. We love the place and will return. Also, very affordable!!"
  ]
 },
 {
  "name": "Capitol Cuisine",
  "address": "1720 Capitol Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4d7ee5c6-932f-11ea-a922-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=7594837936712356152",
  "source": "GoogleMaps",
  "reviews": [
   "Not too bad, but room for improvement as all young businesses have. Staff are friendly and are prepared to assist customers. Soups of the day were pulled pork and potato or cream of broccoli. Both were scrumptious. My Ruben came a little disassembled and the bread was grilled but a little cooler than I would have liked, also felt like there wasn’t enough Ruben invited on the sandwich itself. The lettuce on the salad bar was wilting and the service promptly replaced it at our request. My self assembled salad was alright overall but felt like their weren’t enough fresh toppings. The salad dressings could be labeled. Utensils looked like they could use a good scrub.",
   "Skip the chain restaurants and come to Capital Cuisine. You will not be sorry! The people are awesome, and the food is amazing. Husband had the fish basket with fries, soup and salad, and I had the cheesesteak with onion rings. Oh my! Definitely going to stop in anytime we are in Cheyenne.",
   "The sandwiches here are excellent. The sandwich I had was a BLT with extra bacon, I believe they called it the Koop. The bacon was flavorful abd wasn't that paper thin stuff you get at some places.\n\nIt is a casual dining that is family owned. There menu covers a whole wall, it is a giant chalkboard with the menu written on it. It takes a little while to take it all in the first time.",
   "This was by far one of the best places I have been to that has one of the best tomato soup and the Reuben sandwich was by far one of the best I have had in a long time.",
   "Ate a roast beef panini, salad and soup, probably won't eat again till tomorrow morning."
  ]
 },
 {
  "name": "Olive Garden Italian Restaurant",
  "address": "1536 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4dd14bae-932f-11ea-a5f3-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14684652751381262965",
  "source": "GoogleMaps",
  "reviews": [
   "Nice waitress who only knew basics of her job.  Entrees a little overdone but tasty and adequate.  Pleasant atmosphere with children in holiday mode! Ended with extra effort by waitress with yummy dessert with coffee!   Certainly will go again and hope for our usual 4 star experience.",
   "Honestly, one of the best things about Olive Garden is the consistency. I've been to many different Olive Gardens in multiple States and you can always count on the same quality of food and for the most part service. Their lunch special for all you can eat soup and salad is very well priced and a great option for lunch. Definitely recommend and will continue to frequent",
   "Placed an order for pick up due to the dine in being closed. Horrible experience. Our pasta had no sauce but a lot of butter in the bottom when it was suppose to be fettuccine alfredo, my husband got the seafood and there was hardly any in there, the portions were so small. Also with our salads there was little to no dressing. We go here for almost every holiday, very disappointed!",
   "I had a wonderful experience during my meal at Olive Garden today, typically the service is quite average and the food is tasty, but not today. Our server Mrs. Katie in the Cheyenne branch was phenomenal, she was very sweet and professional. Though she had several tables to take care of no one was forgotten, Mrs. Katie truly took my Olive Garden experience to a whole new level. I wish I would’ve gotten her full name so that I may thank her directly. Give her a raise Olive Garden!! My girlfriend and I will definitely be returning soon and I plan to request her as my server once again. 12/26/2019 - Cheyenne WY",
   "Nice place to have a dinner. The staff were busy but we didn't wait too long. I enjoyed my meal - we shared the salad for 3 and I had chicken with smashed potatoes and sauce with mushrooms. That would be a typical food for a Latvian person. Waitress was very kind and brought some little chocolate bars as we didn't save room for the dessert."
  ]
 },
 {
  "name": "Tortilla Factory Express",
  "address": "1507 Stillwater Ave # G, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e1ef6b6-932f-11ea-97b8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10361965368067872427",
  "source": "GoogleMaps",
  "reviews": [
   "These guys have THE BEST green chili smothered breakfast burritos around. Order the steak and egg, you wont be dissapointed. Their lunch and dinner offerings are great too.... Can't really go wrong here.",
   "In Wyoming looking for tasty Mexican food? ... Here it is. Clean, friendly staff, easy access, plenty of parking. Chips & salsa were good too 😋",
   "Nice little restaurant located right off Dell Range. This branch of TF caters more to take out, so I wish they’d stay open later into the night. Disposable plates and silverware are used when eating in, but that’s no biggie. Great food, and great staff!",
   "The carne asada wasn't very good. The other food we got was pretty ok. Not a horrible place but not the best cheyenne has to offer.",
   "excellent food. probably the best Mexican restaurant here in town by far"
  ]
 },
 {
  "name": "Culver's",
  "address": "1239 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4e67c840-932f-11ea-98a7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5952937257018225109",
  "source": "GoogleMaps",
  "reviews": [
   "Probably the best fast food type place for a burger around here. The bacon butter burger is delicious, especially the one with the pretzel bun. The fries are nothing to write home about, but not bad for crinkle cut fries. The cheese curds are decent, but I personally prefer the ones Bdubs has. Side wise, I'd say to go for the onion rings.  Shakes and malts are top notch. They are a bit pricey compared to other burger places but pretty great overall. Pretty similar to Freddy's but better. I've gotten in the habit of referring to Freddy's as \"Less good Culver's.\"",
   "Culver’s is a special place treat for my family. Driving up it’s located in a nice part of town and grounds are kept up very nicely which makes it very inviting. \n\nThe drive throughs menu is easy to read but I always encourage having an idea of what you want before you because they have some to choose from. \n\nLike the sign says everything is made fresh and everything can be customized to how you want it. We got burgers and custard ice cream .",
   "A few years ago when I first had their frozen custard, very tasty, it took me back decades.  Had to travel 50 miles to Cheyenne to get it.  Now we have a Freddies in Laramie and their frozen custard is much better.",
   "No stars today. Yep, that is right, you read that correctly. They made five, count them five mistakes on our order. They have usually only made one or two mistakes on our orders in the past but this time they made five, count them five mistakes on our order. We went there to get some take out for dinner so I will post there comments about the events.\n\nMistake One... We ordered 2 concrete short marshmallow cookie dough drinks. The person taking our order only rang up one. They did make us another one after we complained.\n\nMistake TWO... We checked our order and found they forgot the chicken tender 2 piece snack pack which was on our receipt. They made us a new one.\n\nMistake THREE... While they made us a  chicken tender 2 piece snack pack and they put it in a bag they forgot the small fries that should have been included. They did make that one for us.\n\nMistake FOUR... After we drove all the way home and opened our order we noticed they forgot our butter burger. I called and was told it would be ready for when I got there. I had to drive over six miles one way to get it. All the way from the south side of town to dell range then all the way to the west end of dell range for the food. Then all of the way back home for the second time today during quitting time!\n\nMistake FIVE... When I got to their business they had not even started my replacement. I still had to wait for my new sandwich. They seemed to be on the short side with a lot of rudeness with me about their mistakes! So I finally got my sandwich and drove home. By the time I got home the fries and onion rings were very cold. The chicken strips were barely warm. We WERE VERY DISAPPOINTED!\n\nI only saw what looked like young people running this greasy fast food joint. All of them looked like their ages were in the late teens to early 20's. You people messed up five times on our! Why do you have foolish employees working there without an adult supervisor? The fools you have as employees probably need a baby sitter. Could it be because your pay for an adult baby sitter is about half of the poverty level? You foolishly allowed ignorant employees to make five mistakes on our order this time. We are not the only customers sick of your ignorant employees constantly making mistakes!\n\nThe only thing I can say positive is that a small percentage of your  employees are pleasant to the customers. That is until you complain about mistakes on our orders. Then your employees are very rude and even bordering on being threatening to us the customers. The employees at some of the other greasy fast foods in Cheyenne are not only rude when you call them on a mistake but many of them border on threatening behavior when you complain about a mistake.\n\nMany Cheyenne residents refuse to ever go to your food place ever again. On another note, just how many cronies do you have posting bogus positive reviews on google? Looks like about half of these posiitve reviews are cronies to most of us in Cheyenne. We will never use you eating place again!",
   "Great food, family environment. The pork tenderloin sandwiches are delicious!"
  ]
 },
 {
  "name": "Perkins Restaurant & Bakery",
  "address": "1730 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4eb12d52-932f-11ea-a8d8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "free",
   "affordable",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=12666627708904944514",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice.  Burger deal was excellent.  $9.99 for a burger, fries and pie.  Service was great.  Meal was hot and served in a timely manner.  Refills on drinks were great. Atmosphere was warm and friendly, not overcrowded. Checkout clerk was friendly.",
   "Food was good but service was slow by server, floors were messy, needed a quick clean, several managers at front but no one really working the floor to ensure smooth service. Would come back again as food is great, but need to expect better delivery of service from ALL staff.",
   "Our server, Lucy, was awesome!  Our food was very good too!  When we went to pay the bill however, the gal who rang us up was very grouchy.  She was upset that we were splitting the bill.  Then we asked to buy some of the bakery items, she acted like she was inconvenienced.   To top it off, she didn't get that order right and acted like it was our fault.   I hope she has a better day.",
   "I can't really complain about this perkins, as there is not another one near by for comparison. I have had several commendable meals here but today's meal struck out. I have complained to to the staff about their dirty syrup containers and nothing has changed. My eggs were not properly cooked, I was given bacon that was partially raw and the pancakes were not properly cooked either. I do not like pancakes that have a doughy taste. I will eventually return and I would preferred to have left a positive review.",
   "We love Perkins! The atmosphere is wonderful. The waiters and waitresses are always attentive and friendly. The menu is varied and the food is always delicious. We especially like buy one get one free on Wednesdays. It makes it very affordable for those of us on a fixed budget to get to eat out once in a while."
  ]
 },
 {
  "name": "Renzios Greek Food",
  "address": "1400 Dell Range Blvd, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4ef3b752-932f-11ea-8e20-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11835031502303006083",
  "source": "GoogleMaps",
  "reviews": [
   "Food is good, better than what you'd expect from a mall restaurant. Staff was very friendly and helpful with questions that didn't pertain to their own store. Would recommend adding a condiment dispenser instead of having a large box of ketchup packets during on a table.",
   "At first glance Renzios seems like your typical fast food joint, but I was pleasantly surprised. Their service is friendly, fast and restaurant is clean. The food was very good and satisfying with large portions for a competitive price!",
   "Renzios is one of my haunts for sure. Great food, diverse staff, and people watching.\nRemember “Bowie” knows best",
   "Love Renzios! One of my favorite places to eat, especially within the mall. The service is great and the food is delicious! 100% would recommend.",
   "Food used to be good. Great service. Then staff changed and some new blond girl always fondling the owner... Yeesh. Creepy and unsanitary conditions all of a sudden. Won't go back."
  ]
 },
 {
  "name": "Epic Egg Restaurants Cheyenne",
  "address": "2300 Carey Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f372f1e-932f-11ea-9dad-14b31f159f22.png",
  "tags": [
   "delicious",
   "organized",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9048593037999651785",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome little spot for a delicious breakfast! Good quality and good portions! Always have amazing customer service every time, my only complaint is that the Va-Va-Vegan dish is NOT all the way vegan. The main dish is but the toast is not, but if you ask for no butter you should be good! I would love if they invested in some vegan butter, but other than that this place is my top spot for a delicious Cheyenne brunch!",
   "Pumpkin waffle was awesome. Bacon was pretty rubbery. Guest  that I was with eggs where a little undercooked. Our server was quick, and professional. Over all a decent breakfast joint.",
   "Place is pretty good. They were out of the 2 things my husband and I wanted to eat. Everyone is super friendly. It's very clean and organized. Green chile is pretty good just has no kick at all :( their country potatoes and French toast are yummy! Just wish it was better priced.",
   "One of the best breakfasts we have ever had in the states. Absolutely egg-cellent. Can’t wait to go back for an ‘I mean business mimosa’!",
   "Amazing rebrand! The food was awesome and the staff was so nice!! They also now offer mimosas which was a super fun treat!! Even during their busy hour our food came out super fast and accurate. Great for people with dietary restrictions and allergies!!!"
  ]
 },
 {
  "name": "Chick-fil-A",
  "address": "4435 Windmill Rd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4f8c9b6e-932f-11ea-8d3a-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13211535940216050558",
  "source": "GoogleMaps",
  "reviews": [
   "Chick-fil-A is in my top 3 favorite restaurants of all time. The food is always fresh and tasty. There is not a single competitor in the fast food business when it comes to customer service. I was so  impressed today when I went to eat here. I went a little after 2 so they had been in a lunch rush for a few hours now. The line of cars using the drive through was so long it almost went out of the parking lot. I found a parking stop and went inside. The line inside almost went out the door. I was a little worried it would take a long time to get my food. I could see that the people working here were not panicking like most fast food employees when its busy. They kept working hard and stayed positive and efficient. In all the craziness they stayed polite and professional. Chick-fil-A sets the standard for all others.",
   "The drive-through was incredibly quick and the staff were very kind and helpful. The location itself is quite far out of my way, however if you're nearby, it's a great place to stop for lunch. I can highly recommend going to this location over the other Cheyenne location because this location is a dedicated location. The other one is in a mall which is far slower and the employees weren't as nice.",
   "Same good normal Chick-fil-A food. Sometimes the staff isn't super great or if you ask for an alternation to the menu item like no pickles, they aren't the best. Also, they can have long wait times. The online pay and order always seems to be not working at this location for me as well.",
   "This place has the fastest drive thru ever. The food is always great, service is super friendly and professional.",
   "Great location, great food and great service!!  Love the new gluten free buns that you can now get with any of the grilled chicken sandwiches, they bring it out with the bun in it's own wrapper and the chicken in a container so you know they haven't been cross contaminated.  Love cfa!!"
  ]
 },
 {
  "name": "QDOBA Mexican Eats",
  "address": "1958 Dell Range Blvd Unit F, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/4fd0d5f6-932f-11ea-88fa-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4181394046786983707",
  "source": "GoogleMaps",
  "reviews": [
   "A great experience that Is bow a horrible experiance. They know you cant see how they make your food now. Let me tell you what to expect. Dry hard rice, Graying guacamole, Cold meat and a torn apart quesadilla. I know chipotle isnt for everyone but they will be taking my money until covid-19 is over and I can see the quality of the food agian.",
   "I am completely shocked with their inability to fulfill an actual catering order. I ordered for a caterer of 10. Requested cilantro rice, what was delivered was some pale Brown half seasoned rice. Also added on fajitas vegetables for 10. What was provided was fajita vegetables for 3. Same with the cheese it literally was enough for about 6 individual tacos and in no way fulfilled an order of 10 individuals. Certainly not my last complaint or issue but a majority of the lettuce was old brown and withered.\nI also understand that there are literally charges for everything. However I was charged an additional $50 for 20 flour tortillas which were dry cold and stale. Overall it was a very unpleasant and very underwhelming. I personally will not be back to this establishment and do not recommend.",
   "Great food and great customer service! The food was fresh as well. 5 stars for me.",
   "The pulled pork bowl was bland. The steak bowl was over spiced. Taking bites back and forth made both taste better. I ordered to go and it seemed to take a long time. I think they were understaffed. I'm not sure I'll go back when there are other comparable options close by.",
   "The food was great, *the portion sizes will do you in! Lol..HUGE burrito* the customer service was excellent, the food tasted fresh and it makes my heart happy they are vegetarian/vegan friendly."
  ]
 },
 {
  "name": "The Metropolitan Downtown",
  "address": "1701 Carey Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/501c2280-932f-11ea-919e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15974956081569701744",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in for lunch. The artichoke dip was amazing! Paired with the hot Italian sandwich, it was a perfect lunch. Very upscale place. Wait staff was on point without being pestering. I give it five stars!",
   "Great experience. Everything we had was delicious, including the burger, Brussels sprouts, and lasagna. Some things on the menu are pretty expensive but there are definitely cheaper options as well. Our bill was pretty reasonable for the quality. Our server was great as well! Will definitely be back.",
   "Was really excited for a brunch place in town.... received my biscuits and gravy and they were completely cold in the center. This made me completely lose my appetite.... and then they still tried to charge me for them. I had to track down a manager to get it off my bill. Poor restaurant decorum.",
   "The service here was phenomenal, and the food was great. The atmosphere is almost retro, and the bathrooms are clean and beautiful. I had the chicken wings and charcuterie, the chicken breast, and we tried all three of the desserts. Everything was perfect.",
   "Stopped in today for lunch. Took an hour to bring 3 salads and a sandwich. To top it off we watched the steak sandwich sit on the warmer for over 15 minutes. The sever did his best and was very nice but for an $80 lunch and $16 glass of wine, I'd expect much more. All we got were several apologies but nothing from upper management as we watched him walk to every table and skip ours. The food was pretty tasty, I will give them that."
  ]
 },
 {
  "name": "Rx Tea Time",
  "address": "1605 Pebrican Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50697db4-932f-11ea-85ef-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "history",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15343339632295880359",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I went to Rx Tea Time for a Sunday day date, and we had an absolutely lovely experience. We had the Afternoon Tea Setting which I would highly recommend. The tea was top shelf, the food was delicious, and the service was great. Wanda and Jim were amazing, so friendly, and have created such a wonderful experience for tea lovers in Cheyenne!! We will be telling our friends about this hidden gem and coming back, hopefully soon!",
   "Beautiful Victorian tea house.  Wonderful service, delicious food, and fun atmosphere.",
   "I came here for the first time over the weekend and had a lovely experience! The tea and pastries were delicious, and the hats were super stylish",
   "Absolutely the BEST tea I've been too.   Wanda was very attentive and shared the history of their tea shop.   The scones were AMAZING! So happy I found her tea shop.",
   "The lady that runs the place is so kind, and I enjoy my experience everytime. The food and teas are absolutely fantastic ! Highly suggest going for the experience."
  ]
 },
 {
  "name": "Hi Sushi",
  "address": "2543 E Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/50bc0dfe-932f-11ea-a721-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5945027577788355819",
  "source": "GoogleMaps",
  "reviews": [
   "I buy donuts next register over. And I had to say their sushi is best! It is delicious!\nPrice point it's good! Being from Vegas \nit's the best price. I would recommend this to anyone. I will definitely come back!  \n\nFriendly staff too!\n\nBest sushi and Donuts around!\n\nthank you!",
   "Came in for the 3 roll lunch special that is from 10:30am - 2pm Monday-Friday  I was not disappointed. Great customer service. Really good sushi.",
   "Better than the big sushi place downtown! Love this place",
   "Amazing food both donuts and sushi/ teriyaki owner is such a great guy one of the best restaurants in town!",
   "BEST SUSHI IN TOWN!! Can not say this enough. Easily the best sushi in town and their donuts are great as well. The people who own the place are always friendly and always there with a smile as you walk in the door. Fantastic service every time."
  ]
 },
 {
  "name": "Rolando's Mexican Grill",
  "address": "1829 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/51093de8-932f-11ea-854d-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=878346414769950845",
  "source": "GoogleMaps",
  "reviews": [
   "Good food but HORRIBLE customer service skills. We went there around 9pm since they’re open 24 hours, and we pulled up to the box to order and sat for 20 minutes. Nobody ever answered. There was a line of cars behind us. Not to mention when I pulled up to the window, they were BLARING their music and were screaming just to hear each other talk. I called the store 3 times and they just let the phone ring ever single time, I could hear it ringing inside from the drive through window and they all ignored it. We honked several times and knocked on the window and they just looked at us. ALL open signs were on. We finally left after 20 minutes at the ordering box and 20 at the window.",
   "Great food and service. The best corn tortillas EVER!! We will be back. #24 Rancho Plate",
   "First time here! Food was amazing!!! Big servings We will go back again and again yummy",
   "I loved this place! I try to pay attention to staff and theirs was amazing; friendly, nice, professional, and welcoming... Very authentic tasting food! I will make sure and stop in here at least once a month. Highly recommend, 10/10!",
   "Best breakfast burrito ever! You have to try this place! ❤️"
  ]
 },
 {
  "name": "Village Inn",
  "address": "411 E 16th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/515143c0-932f-11ea-b79f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12029163887640215561",
  "source": "GoogleMaps",
  "reviews": [
   "Very busy on a Saturday morning.  Which means they have a local following.   We were seated in a timely manner.  Our sever, Natalia was great!  Food was as ordered, and we enjoyed our visit.  Thank you.",
   "The food was good and our server paid the appropriate amount of attention to us. \nI had their new chicken fried steak breakfast burrito. It was large and completely filled me up. It was an initial shock of having white gravy on my burrito, but appropriate for chicken fried steak. For a hot sauce I put Chalula, though I would have preferred Chipotle Tobasco Sauce but they didn't have any. My wife had their Garden Skillet which looked good.",
   "Usually end up ordering make your own breakfast platter. Just can't eat the huge food servings, so I like having smaller options and always get a piece of pie to go for teatime. Great wait staff, friendly management.",
   "The food is good, if its not then it is your fault because you put everything together.\nOur waitress was great and kept checking on us and talking with us.\nWe always do large bowls so we can take the leftovers home for lunch the next day.\nThe decor is not that great, but it is clean and we are there to eat and not to look at the surroundings.",
   "Great Food, Devony is the best!!! Coffee is awesome and served in a unlimited carafe the atmosphere is homie clean and unhurried and free pie on Wednesday Man I luv this place -JJ"
  ]
 },
 {
  "name": "Diamond Horseshoe Cafe",
  "address": "404 Central Ave, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5197c9e2-932f-11ea-a490-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17204179896263428725",
  "source": "GoogleMaps",
  "reviews": [
   "The staff here are always so kind and welcoming. Food is great and at a low price.  I will definitely continue to support them. Great to have them in the community!",
   "My dad recommended this place because it was his go-to for breakfast when he lived in Cheyenne. He told me I HAD to get the German Sausage and Eggs. It didn't disappoint. Will be back if I'm ever back in Cheyenne.",
   "Taste of home with a fantastic breakfast and wonderful customer service! I can't wait to go back.",
   "Just visiting Cheyenne and found this place.  Are we glad we did. The entire staff is externally friendly. They treated us like we have known them since grade school. Haley was our server and she is fantastic. She treated us just like family. The regular customers are friendly.\n\nThe food is very good.  From breakfast to lunch items, everyone in our group loved their meal. \nEating out is a treat, going to a place that values your business, prepares a quality meal at a great value makes it that much easier to decide to spend your money at the Diamond Horseshoe Cafe.",
   "Omg words can not describe how good the food is. Broke down at the freightliner dealership and they where very kind and friendly to deliver me food within 20 minutes if that. I will definitely be getting food from them again."
  ]
 },
 {
  "name": "Down Home Diner",
  "address": "2310 W Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/51dd1064-932f-11ea-a8c3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13286739337917045771",
  "source": "GoogleMaps",
  "reviews": [
   "Chicken fried really good. It was busy, but the few employees  that were there kept everybody   pleased. A+  to the waitresses, waiter,cooks. We really enjoyed are hot breakfast. Will definitely  return.",
   "1st time food and service was awesome Trey our server was very attentive food was hot brewed fresh coffee for hubby. We had set out for another reg spot called Perkins however we forgot about the time changed and they were packed so we went in search of food elsewhere and found the Down Home Diner. Even though it was 9:30 am they said it was no problem ordering typical lunch/dinner food we weren't in the mood for breakfast food that morning. We will be repeat customers. Great job",
   "Their food really hit the spot. Fast and courteous service, clean and quaint appearance, close to lodging. Their meatloaf dinner was excellent. Blueberry pie made the perfect dessert. Highly recommended.",
   "Main dishes were good, staff pleasant, the sides ... not so great.",
   "Food, service & ambience did not meet our expectations. Interestingly, a waitress stood on an adjacent booth seat to close the blinds in our booth rather than simply asking if we wanted them closed in the morning. There was also only one set of silverware for a family of four so we had to ask for more after the food had been served."
  ]
 },
 {
  "name": "Rodolfo's Mexican Grill",
  "address": "801 E Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5227120c-932f-11ea-8d5f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15670742018441845803",
  "source": "GoogleMaps",
  "reviews": [
   "Best late night Mexican food in town. Might even be best during the day too. Amazing tacos and their rice and beans are spot on.",
   "I just moved here from Vegas and was in search of a place that was open late since I work nights. The food was awesome!\n\nI recommend walking in instead of the the drive through, it's a bit narrow.\n\nI will be coming back thank you!",
   "OMG SO FREAKING GOOD!!! Try the Carnitas Burrito and the cheese and guacamole fries. To. Die. For.",
   "Good food but consistently horrible service. The short fat man has forgotten items in our order at the drive through at least four times. The short fat man has also incorrectly overcharged us. This same short fat man looked right at us and saw us at the cash register ready to order, he ignored us to just stand there only to slump over to the counter after ignoring us for literally over a minute. He is constantly short and rude every time we come in, acting as if we are annoyances for simply ordering. It kinda ruins the restaurant for me because the short fat man works a lot. The rest of the staff is great. Save the hassle and just go to Rolando's instead.",
   "Sometimes I wonder about the food, I know some people can be pretty nasty at times. Take that for what it's worth.. I'm jus sayin Other than that, why is it they never have the breakfast borrito when I go there at 5 am ? I'm not sure if the just donn't like me or what."
  ]
 },
 {
  "name": "Chipotle Mexican Grill",
  "address": "1508 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/526c7786-932f-11ea-9b6c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15174856819246187997",
  "source": "GoogleMaps",
  "reviews": [
   "Good food, though it is no true Mexican food. My wife and I had the Chicken Burrito, but customized them to our own tastes. I was glad to see that they had Chipotle Tobasco Sauce, I love it. Thier chips are tasty with a hint of lime.",
   "***Paid through app after ordering our food but did not get our food but was still charged*** I am extremely upset with Chiptole right now.  We ordered food from the app and placed our order and paid through the app.  However, when we went to pick up our food, the store was closed (April 28th).  Our credit card has since been charged for the food we never received.  We have tried just about every avenue to contact Chipotle but are unable to contact them.  I have sent a message through their website and have tried multiple times to call them (both corporate and local) but can not get a hold of anyone to speak to regarding this issue.  We are taking this issue further because this is highly unsettling now, especially given the circumstances with the pandemic.  Very upset and highly disappointed at the lack of response to our problem.",
   "The food and service here are good, but they need to change their attempt at social distancing considering what is happening right now. Every other place I have been to without a drive thru is doing curbside, i.e, bringing orders to your car. Here they make you enter the building area and wait in an enclosed, small foyer region along with everyone else waiting for their orders.  This fosters a situation which is way too crowded and is the exact opposite of what we are supposed to be doing right now regarding six-foot buffers.  People are way too close together.  Until they change this I won't be going back.",
   "Terribly rude and the lady kept shaking all the steak from the half of a scoop she had on there.  The smallest Chipotle burrito I've ever seen....not worth $8.50...maybe worth $4",
   "Love this restaurant, I’m only giving 3 stars because the service could definitely use some help. I come here a lot for the food, but some of these kids could use some re training in customer service. I’ve watched on multiple occasions people on the line asking for help and other people flat out refusing saying “it’s not their job.” I get that everyone has their own spots that they need to maintain, but when there’s a line of people and one person on the line and you flat out refuse to help...  you’re not only being rude to the person trying to make my food,  but now you’re being very rude to me. Hop on the line!"
  ]
 },
 {
  "name": "Godfather's Pizza",
  "address": "5719 Yellowstone Rd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52ba70b4-932f-11ea-b240-14b31f159f22.png",
  "tags": [
   "eat",
   "affordable",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16200152422304097352",
  "source": "GoogleMaps",
  "reviews": [
   "Godfathers Pizza is the best pizza in the country. Even Italians would love it. New York and your weird thin slices of pepperoni... eat your heart out. you are doing yourself a huge disservice if you don’t try Godfathers Pizza. Get the taco pizza on regular crust.",
   "Great pizza, make sure to go from 11:30 to 1 everyday or from 5 to close Tuesday Thursday and Saturday for the buffet. If you're there another time make sure to check out the value meals they help make the meal options much more affordable. Also the staff is very helpful and courteous.",
   "Great local pizza place.  Great pizza. Great dessert pizza  The service has always been good when I went. Great place for a family get together. Nice little gaming area for the kiddos as well.  I don't think this place gets it's proper due because it gets over shadowed by the bigger mainstream pizza places in town.",
   "Godfather’s is great! One of my favorite pizza places in town. They fixed the inside up nice and have a lot of arcade games for the kids. Their pizza is always great and the service is good too. Would definitely recommend.",
   "Very good pizza. Had 2 larges both had loads of toppings and best crust I've had in a long time. Great service. Go and enjoy!!"
  ]
 },
 {
  "name": "Rubyjuice Fruit & Smoothies",
  "address": "113 E 17th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/52fd6d52-932f-11ea-9f6a-14b31f159f22.png",
  "tags": [
   "creative",
   "knowledgeable",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=10186167953881219614",
  "source": "GoogleMaps",
  "reviews": [
   "Oh my word. I absolutely LOVE Ruby Juice! They come up with creative smoothies and have classics as well. They are made-to-order. Ruby Juice is located right in the heart of tourist downtown, so in the summer there is almost always a wait. It's worth it! You can customize your shakes, and that's just an added bonus. The iwer is a dream of a woman who remembers her clients. She always gets your order right. Definitely recommend a smoothie from Ruby Juice before you head out of town!",
   "Very nice people and helped me for my first time i had alot of questions which he answered thank you.",
   "I became a regular when I found out this place existed! They already know my custom order when I come in. Great place!",
   "This place is awesome. I get a smoothie frequently in here. The smoothie is one that I picked the ingredients myself.. And the staff is very friendly and professional at the same time. They are very knowledgeable of the nutritional value their menu. Oh .. And the wellness shots are tasty too.",
   "Rubyjuice has some of the most amazing Smoothies in Cheyenne.  You can tell the staff that work there are really committed to making sure that you are happy with what you are ordering and they will anwser any questions you have. \n\nI'm a big citrus fan, so I've been making my way through the citrus drinks.  Next, the tropical tasting drinks!"
  ]
 },
 {
  "name": "Accomplice Beer Company",
  "address": "115 W 15th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5345acd8-932f-11ea-b64c-14b31f159f22.png",
  "tags": [
   "delicious",
   "cheap",
   "food",
   "brewery",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18103268055232772527",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome pizza and “pork wings” or dry rubbed ribs.  The DIY beer system seems odd at first but actually turned out pretty cool.",
   "Went there for a late lunch with my husband who is a big fan of breweries. He loved the concept of being able to get his own beer. The server was helpful when he had a problem with one of the beers not pouring correctly. We ordered the kale salad and the chicken club, both were excellent. The server was excellent. \nVegetarian friendly\nAccessible\nPatio service were you can watch the trains.",
   "I thoroughly enjoyed their beer, pizza and service.  Although I was there at opening 11AM on a Wednesday.  \n The problem came when I  ordered a  2 topping pizza which is $8.  I received a specialty pizza which is three toppings for $10. At the time I didn't realize it was only a $2 difference(thought it was 5).  Well I ate it and it  was delicious.  I didn't even notice the extra topping until about half way through it(because they were skimpy).  Oh well I figured it would be an easy fix when I check out.  I'd pay for the 2 toppings that I ordered. \n So the counter woman had to get the okay from the manager.  Fine. She thought I wanted it(whole pizza) comped.  Now I was pretty buzzed at this point(still am as I write this).  She brought the check which I was surprised at how cheap it was.  But it didn't compute at the time that she comped the pizza.  \nNext I was trying to figure out the tip.  Well if I'm pouring my own beer, there is no service = no tip. That's what tipping is for, service.  I was talking aloud to myself about how much to tip since I poured my own beer.   She then tried to snatch the bill and said \"we don't want your money\".  I told her I want to tip and I enjoyed myself and the beer and food and I would come back next time I'm in the area. I tipped on the food only. \nI'm not a fan of being my own beertender.  \nIf anyone is reading this and visits this place, enjoy but don't tip for serving your self. Its kind of a scam.",
   "Went in for the St Louis Ribs that it says they have on the website. They do not have this item on the menu. The \"bartender\" was not friendly and didn't say anything about getting my own just asked for my debit card and handed me a beer card. Figure it out I guess. If I am back in Cheyenne I will not be back to this brewery.",
   "Drove to Cheyenne from Nebraska after traveling from California. Pulled into town and looked for a place to eat. We found Accomplice and loved the location and decor. Once inside, we knew we had found the right place. The bar was cool, but we were there for lunch and didn't try any beer. Son had pizza, which he loved and we also had salad. Service was friendly and food came out quickly. A great place that would rival some of the best craft beer places we have in Cali. Bought pint glasses to take back home."
  ]
 },
 {
  "name": "Cheyenne Country Club Restaurant & Bar",
  "address": "800 Stinner Rd, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53885b7a-932f-11ea-926b-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12533363015625019883",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful course. Great service.",
   "Very nice atmosphere and great service. I had a prime rib sandwich and it was good. The deserts were outstanding. The restrooms were very nice and clean. The parking is a bit chaotic and finding the door to the restaurant was a bit of a trick.",
   "Prayer Breakfast for the EHS class of 1979.  Best food ever.  Room was perfect for the occasion.",
   "Great golf!",
   "Awsome food"
  ]
 },
 {
  "name": "Taqueria Mi Tierra",
  "address": "314 Dell Range Blvd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/53ccc334-932f-11ea-a0be-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6102754496001736518",
  "source": "GoogleMaps",
  "reviews": [
   "I Love this place!!",
   "Genuine Authentic Mexican cuisine. Fantastic flavor, good portions excellent hospitality and service.  A MUST visit.",
   "Delicious and authentic food. Giving 4 stars for having the smell of the grill in dining area. Personal issue. Othee than that the food is well worth the stop.",
   "Food is amazing. Love this hidden gem",
   "Great food and service. Everything is made fresh - right before you. The mildild is mild and the hot is not too hot to take away from the flavor. The chef is flexible and will make items to order. Great place hidden away on Dell Range."
  ]
 },
 {
  "name": "Chick-fil-A",
  "address": "1400 Dell Range Blvd Spc 89, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5413be70-932f-11ea-a360-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9519560605642166975",
  "source": "GoogleMaps",
  "reviews": [
   "I ordered here and sat down. The person that delivers the food was busy taking other trays to other tables. The girl who took my order came from behind the counter to give me my food. The teamwork from the staff is incredible. The food was amazing! Will come here again for the lord’s chicken!",
   "I work in the mall, have worked in the mall for three years. I come here often. This location is a lot better than it used to be, even though I won't go in at night because most of the time the service and food quality are terrible. I went in yesterday during lunch and they were so busy but the service was pretty fast and the food was good. I've read some reviews and the manager, Karen, is misunderstood IMO. She has done a lot for this location and has always been very nice to me. If it is busy she is all business. I will continue to go back and I've been told it will get better at night.",
   "I'm a mall employee and just found out Karen, the manager is leaving!!!!! What a bummer.  Bad news for Chick-fil-A. Great news for 5 Guys. Good for you Karen! Now I'll start eating at 5 Guys again.",
   "Great food and  great service. Nice about food allergies (gluten) and very accommodating.",
   "I ordered a 20 piece nugget and I got less thhen 10. They were very small. I did let them know I didn't get what I ordered and they made it right."
  ]
 },
 {
  "name": "Casa de Trujillo",
  "address": "122 W 6th St, Cheyenne, WY 82007, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/545163dc-932f-11ea-9074-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3106015800010805877",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Been coming here for years. Great food and large portions. Friendly service awesome all the way around. I gave it 5 stars because it all they had it would get 10 stars from me.",
   "Not as good as they used to be. Still a great value!",
   "Good food and even better price!! The owners and staff were very accommodating even when we came in toward closing. Bring cash if you want the bar!",
   "Terrific Green Chili and homemade tortillas! The service was friendly and the price was right.  This is a family run restaurant.",
   "Ive been working here for years and i enjoy our customers soo much"
  ]
 },
 {
  "name": "Wing Shack",
  "address": "7367, 1439 Stillwater Ave #1, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/549fd95a-932f-11ea-bae1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15332459585583928870",
  "source": "GoogleMaps",
  "reviews": [
   "I've eaten there 3 times now, and been very satisfied 3 times now. I have 2 good friends of mine that work there so I know the food is quality. When I order to go, the wings are marinating in the hot sauce and pack an incredible kick. Cost is a little high but its incredibly good food so in my opinion well worth it.",
   "Love me some wings! And they serve beer, which is a must with those spicy bites. I always order traditional (because I have testicles) and the skin must be crisp. They did a great job with this. One of my orders (golden hot) was drowning in sauce. Not a fan of this, but the wings stayed crisp, and the flavor was great regardless, so I can forgive. Another highlight, I like to request a side of the hottest sauce at every wing joint. Some are short on flavor, high on heat. Their Bear Hot is actually very good. Yes, it IS hot, but \"bearable.\" 😂😂  The flavor was great, and if you dare, you can take their 10 wing challenge and get your goofy mug on their wall of fame. Give this place a try, it's worth the stop.",
   "We ordered online and made sure we were there early   and by the time we got home all of the food was cold cold. The fries had no seasoning and the wings are way too small. The best part of the meal was the sauce and side salad, DEFINITELY not worth the $50 we spent.",
   "Nice place for some chicken wings. Variety of flavors and just good food.",
   "Great food and excellent customer service.   The wings were delicious and weren't over sauced.  The roasted peppers were great and not super hot.  They had a great deal for restaurant week and otherwise their prices seemed pretty fair.  Definitely better wings than BDubs."
  ]
 },
 {
  "name": "Carol's Cafe",
  "address": "2800 W Lincolnway, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/54e434e8-932f-11ea-9d60-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9605738662433863101",
  "source": "GoogleMaps",
  "reviews": [
   "Adore the staff! Fun atmosphere. Lots of pastry options. Coffe is tasty!",
   "A truck stop...you would not believe...great food at a fair price...wife could not believe that it is a yrick stop.  We have been there several times and ate going to return with friends.",
   "Elegant luncheon, menu and buffet top notch, and the service was excellent!",
   "I had a Reuben with seasoned fries and a bowl of chicken noodle... Ruben was cold way too much sauce and it didn't even taste like a thousand island sauce the fries were freezer burnt the chicken noodle soup was okay service was okay not great but okay",
   "There food and service is great."
  ]
 },
 {
  "name": "Five Guys",
  "address": "1400 Dell Range Blvd Unit 85, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/552e5d80-932f-11ea-821a-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=16981936796266265477",
  "source": "GoogleMaps",
  "reviews": [
   "Great burgers, great fries. Minimal decor but service is fast and friendly. Have eaten there many times. Try it if you haven't eaten there.",
   "Update, over 2 weeks later, did not get a call back or email.  Dropping to 1 star. This is the 2nd time they've done something like this.  Customer service matters.\n\nMy ill wife wants a burger in a bowl.  After driving out and getting home, look what we find:  her bowl is missing the burger!  So I'm waiting to hear back from them after I called it in.\n\nGood thing we ordered \"all the way\", or it would have been completely empty.  She says, \"I'm disappointed that I have to check if my burger is in my burger.\"  So I gave her my burger.  I didn't want salad.  It's a bit of a laugh.",
   "Food is very gross for the price. Fries soggy, limp and taste like starch. Forgot bacon and when asked I was given a bunch crushed pieces in metal tin. For the price would expect a little better food and service. 20 something year old manager flirting with my 14 year old daughter too, should be more focused on food then getting some. Wouldn't recommend.",
   "Super slow. Not even busy and took almost 20 minutes. Usually good but burger died in the window waiting on fries.",
   "Good burgers. Was missing a standard ingredient (mushrooms) on the choices though."
  ]
 },
 {
  "name": "MrJims.Pizza Cheyenne on Vandehei Street",
  "address": "453 Vandehei St #180, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/557c89a2-932f-11ea-838e-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2756431727376949937",
  "source": "GoogleMaps",
  "reviews": [
   "Just ordered a pepperoni and sausage pizza and decided to pick it up, as pickup was only 15 minutes and delivery was 40 minutes. Best pizza ever! It was hot, the crust was perfectly golden and it had a lot of sauce and toppings. Wow! Very impressed. 🙌",
   "Easily 5 stars!  Mr. Jim's lives up to its reviews!!  I tried it on my way thru town from northern WY to CO.  Pizza was delicious!!!  The hand-tossed Garlic Parmesan crust was perfectly crunchy around the edge, but not burned.  Toppings were fresh, green pepper pieces were just the right crunchiness, cheese, pepperoni, ham, mushrooms were very good.  Not even really greasy at all, which is a huge difference plus for me.  I got the lunch deal, 10\" any pizza for $5.95.  Definitely a GREAT deal!!  Would highly recommend dropping in for some awesome pizza.  (I didn't use any, but they even have coupons, and online deals.)  If I am ever out here again, I will definitely come back for a pizza.  :-) 👍👍  (Boy who took my order was very polite.)",
   "Mr. Jim’s pizza is so delicious! And they support the locals schools. Thank you for excellent pizza and supporting the community",
   "Stopped in on our way through and was looking for a quick bite and stumbled upon this gem. Was not disappointed. The crust was a perfect balance of soft and crunchy. The toppings and sauce ratio made it a flavorful pizza. Definitely recommend this place.",
   "Ordered carry out and they brought it out to me in my car. Pizza is delicious!"
  ]
 },
 {
  "name": "Honolulu Poke & Ramen",
  "address": "1400 Dell Range Blvd # 36, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/55cf03a4-932f-11ea-a1d9-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16213791681887209997",
  "source": "GoogleMaps",
  "reviews": [
   "Spicy Chicken Ramen above average spicy was delicious.  I loved the broth and complex favors. Very good! The purple storm drink was definitely not for me. The grape jelly in the bottom ruined the drink. Over all I recommend Honolulu Poke!",
   "Delicious Ramen. I have tried at least 4 different types and they were all delicious and had different levels of spiciness as well. My favorite one is the chili pork ramen. The bubble tea and black bubble tea are also delicious.",
   "Lots of options for ramen, poke and curry! And they have appetizers. They're quick and I'd say best ramen in town! Here almost every week 😅 I recommend the spicy chicken ramen, chicken curry, and takoyaki. My favorites.",
   "Both the Ramen and the Poke are very good. I love the way they cook the pork belly 😋 I'm really happy about having this place in Cheyenne, this town needs more restaurant varieties. The prices are quite reasonable for the amount of food you get too",
   "Great food! Great service. Would recommend 100%"
  ]
 },
 {
  "name": "Arby's",
  "address": "5250 Yellowstone Rd, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/561b4f1e-932f-11ea-ade4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14987879364399328725",
  "source": "GoogleMaps",
  "reviews": [
   "Omg, the brown sugar bacon that they have right now is amazing! So crispy and the perfect balance of sweet and salty. Also got the Cheddar roast beef - delicious as always and onion rings - perfectly crisp out of the fryer. The employees were friendly, efficient, and were on top of keeping the dining area clean. Everything I hope for when eating out at a fast food joint!",
   "Friendly and fast! Went in with a large to go order and we got our food with no mistakes and wait time was shorter than I thought it would be!",
   "Good food and quickly served during a busy time. The area was clean and well kept. I wouldn't hesitate to come back here when I need some \"fast\" food.",
   "Pretty good, and service had a good attitude. Order was correct. Don't recommend brisket it was very dry.",
   "The best arby's in town recommend going out of your way for this one"
  ]
 },
 {
  "name": "Paramount Ballroom",
  "address": "1609 Capitol Ave, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5663f108-932f-11ea-872e-14b31f159f22.png",
  "tags": [
   "unique",
   "sampling",
   "walking",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4374529494007526295",
  "source": "GoogleMaps",
  "reviews": [
   "Charming cocktail bar in downtown Cheyenne. Walking distance to downtown hotels and a few other restaurants.  They have small plates and fantastic cocktails.  We tried a small sampling and they all tasted great with unique flavors.  Would definitely recommend to anyone in town!",
   "Drinks are.good but not strong. Friendly light place. Snacks like deviled eggs and cheese board are excellent.",
   "I loved the atmosphere here. You can actually hold a conversation. Great, original drinks, good food, excellent service. I feel like we've been waiting for a place like this in Cheyenne, and now it's here! We will definitely be back.",
   "Love this place! Great cocktails and super friendly staff. You can tell the bartenders love what they do because they were really open to answering questions and helping me find something I would love. Definately reccomend!!! I had the girl in a kimono 😘👍🔥",
   "I've been here many, many times. The atmosphere has consistently been superior to any place in Cheyenne, but unfortunately that is all. Over time the service and quality of food & drink has plummeted. Drinks are frequently cloying and lack the balance they once had, food lacks the flavour of even a couple months ago, and the service has become increasingly insufferable. The owner frequently has walked by people who have yet to be waited on without acknowledgement. I want to continue to support Paramount Ballroom, but their drinks just aren't worth the price anymore."
  ]
 },
 {
  "name": "Best Tacos y Burritos La Paz",
  "address": "200 E 18th St, Cheyenne, WY 82001, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56b076ca-932f-11ea-92d9-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14905921328007307093",
  "source": "GoogleMaps",
  "reviews": [
   "Not a bad little spot. Ordered two different kinds of burritos and they were both great. The biggest criticism I have has to do with how dry the meat was -- not the end of the world but definitely noticeable. The portions are great for the price (a big burrito is $4.75 if I recall correctly).  The owners are both really nice people too. I'd definitely stop by here again next time I pass through Cheyenne.",
   "Lives up to its name! Seriously the best tacos and burritos in town, the barbacoa beef is probably the best choise but all of them are great.",
   "This place is terrible! Pretty sure my meat was rotten. Smelt terrible and made me super sick. I'm Mexican and just moved here from Denver so I know good tacos. But this place is nothing like I'm use to. They don't have many options of meats and toppings. Stay away.",
   "OMG....the place rates a zero for ambiance,  but if you want the best burrito this side of the Rio it scores 5 stars. Order it with everything, rice, beans, onions, salsa, cilantro, queso, and any meat selection. You will not he disappointed! F A B U L O U S!!@",
   "Excellent...going BK to shop"
  ]
 },
 {
  "name": "Dickey's Barbecue Pit",
  "address": "1400 Dell Range Blvd Spc 85A Ste 085A, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/56fd31b6-932f-11ea-89be-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18385979939544392833",
  "source": "GoogleMaps",
  "reviews": [
   "Great barbecue. I had the 2 plate meal and the chicken and turkey I picked were freaking amazing. Great flavor, extremely moist. The line was long but it went pretty quick. A little pricey for the amount of meat and sides they give you, but at least it tasted pretty dang good.",
   "Andrew was awesome.\nThe rest of Dickeys is terrible.\nThere websight is a failure. There delivery is a failure. They cant except cash is a failure?\nIt appears as if there is upper management failure.\nCorporate should get there act together.\nUnfortunate that the kid working working there seems to know more then corporate does on how to get things done.",
   "Dickeys usually fills me up.. but this time, no way. We obviously got food to go, considering covid19, & their side to go cups are SMALL as heck & they were so stingy with the food :( thank goodness I had enough meat in my sandwich, but I got a picture of the Mac and cheese, and they didn’t bother filling to the top. We spent $26 when we could’ve went to Taco Bell & got waaayy more food for less than half the price. So disappointed because I use to LOVE Dickeys! :( :(",
   "Hey for recent info. Dont order ahead of time expecting it to be ready. I call at 6:15 for my order to be ready at 7:30. It was not then when I called in I was told to tell the guy at the door I was here and waiting. The guy at the door was very rude when I explained I was condused on how the whole thing worked and told him my name.",
   "Great food!  Love the barbecue and the macaroni.  Our company used them to cater and it was fantastic."
  ]
 },
 {
  "name": "Corner Cafe LLC",
  "address": "6101 Yellowstone Rd # 90, Cheyenne, WY 82009, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=16488400590336156810",
  "source": "GoogleMaps",
  "reviews": [
   "The food is fresh and very fast.  The owner is nice too.",
   ""
  ]
 }
]