[
 {
  "name": "Riverbanks Zoo & Garden",
  "address": "500 Wildlife Pkwy, Columbia, SC 29210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/573ec508-932f-11ea-8c4f-14b31f159f22.png",
  "tags": [
   "family",
   "sightseeing"
  ],
  "link": "https://maps.google.com/?cid=5878382912266439608",
  "source": "GoogleMaps",
  "reviews": [
   "The animals are an amazing sight to see. There was an area were you can pet goats, the goats were peaceful creatures. A rhinoceros area is coming in summer, 2020. The most fun I had was called the ropes. The ropes got your adrenaline going. Trust me you will not want to get off of it. I totally recommend  going to Riverbanks Zoo & Garden.",
   "I grew up with a Riverbanks Zoo pennant on my wall most of my young life.  My parents brought me there and I totally enjoyed it.  Few years back we were in the area visiting family and we saw they were doing Boo at the Zoo.  We kind of plan for it on our way down bringing our costumes.  We had a great time.  The park was all decorated for Halloween.  The exhibits were too.  It is a great zoo!  Lots to see and do, barely can do all in 1 day.  Take your time, check out their schedule and try to attend some of the cooler things.  You can't go wrong here!",
   "Although it is most recommendable to come in the spring, especially when you're heavy on loving different array of flowers. The Riverbank Zoo & Garden sure had its perks through sightseeing and attractions. I especially loved how all of your coworkers and trainers there are so passionate in their workings with each animals that were featured there! It was sweet as it was exciting!",
   "Loved every minute of our visit. Animals are happy and in clean environments. Staff are friendly and very informative. The Botanical Garden is beautiful. Even in February. Definitely a great place to visit.",
   "The place was awesome. They have the most incredible reptile exhibit. Husband and I loved it more than the tots. The place is super clean as well as the I called animal housing was really clean. I'd recommend it to everyone"
  ]
 },
 {
  "name": "South Carolina Military Museum",
  "address": "1 National Guard Rd, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57878dfa-932f-11ea-82db-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=324711108041974728",
  "source": "GoogleMaps",
  "reviews": [
   "I went here to have a German bayonet looked at and while there I took a quick stroll around.  Mr. Freeman was very helpful and told me a few things about the bayonet I brought in.  He was very helpful and I appreciate the research he did on my behalf. This is a great military museum hidden behind the state armory. I will definitely be back in to take a longer stroll through all the exhibits!",
   "Nice museum that honors our wonderful military history. Very informative. They could have better signage along the main road to attract more visitors.",
   "Great museum! This was a quick stop with four boys on the way to TN... boys were ages 2 - 12 all liked getting to see the pieces this museum has including the mechanized display they have",
   "Amazing displays from revolutionary wars to the Iraq war including information on 9/11. Uniforms from different eras. Mostly Army and some Air Force. Military equipment ranging from helicopters to tanks! Spoke with a retired Army volunteer who made models of Amy equipment from tanks to transport equipment. Very impressed of what I saw definitely ranks high amongst all the large museums.",
   "Great history. A must see for military buffs. Staff is wonderful."
  ]
 },
 {
  "name": "South Carolina State Museum",
  "address": "301 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/57d008f8-932f-11ea-a2b3-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "family",
   "history",
   "kids",
   "history",
   "family",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=928196305548677249",
  "source": "GoogleMaps",
  "reviews": [
   "First time in this museum, so much to learn from here 🙌🏼  good service, good attention, professional staff, everything is clean, very colorful. You’ll find out a lot about South Carolina History, the time transition from the past to present, about the colonial government, you’ll see many maps. This museum it’s about science, society, culture, etc. This museum is amazing place for the kids to see and ask questions, the have the chance and the opportunity to ask and to be curious, we all can learn so much, I love this place and I recommend to come visit with the whole family I’ll come again for sure, because you can see about the revolution and evolution, you can see old routes that’s good for google map and on some on my pictures check it. In this museum museum you’ll see cool things like old transportation, you can find few theaters, it’s a big museum. It’s a café place Check all my pictures, let me know what you think, hit like to all of them 👍🏼",
   "We came for the NASA exhibit, but we're really surprised at how great the other exhibits were. We saw two shows, one at the 4D theater and one in the planetarium. Both were great and the kids loved them.\n\nThe museum features four stories of various themed exhibits, including the NASA and Apollo exhibit, fossils and dinosaurs, and South Carolina history. There was also a Sherlock Holmes feature, but we did not explore that because our children didn't seem interested. I was surprised at the amount of things to explore and we spent a good amount of the day here, which is more than I can say for the EdVenture museum across the parking lot.",
   "So this was my first time at this museum ever. I truly enjoyed myself and the exhibits. I got to see one of the planetarium shows as well and that was definitely fun to do. We were there for 2 or 3 hours and still didn't see everything. I look forward to the next time we visit though.",
   "Very clean and organized. I loved that they had several elevators for our stroller and for handicapped folks. The staff was very friendly and the exhibits were fascinating. The thing I liked most was there was a family room on the bottom floor that was available for nursing moms.",
   "Saw 4D Sherlock Holmes cartoon movie. 3D and additional 4D effects were GREAT. \nBeing a Member has many Benefits. Plenty of parking.  Fully HANDICAPPED ACCESSIBLE, elevators make it very easy to navigate the 4 floors."
  ]
 },
 {
  "name": "Riverbanks Botanical Garden",
  "address": "1300 Botanical Pkwy, West Columbia, SC 29169, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58106d8c-932f-11ea-8817-14b31f159f22.png",
  "tags": [
   "active",
   "walk",
   "family",
   "kids",
   "family",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=7282105495386116554",
  "source": "GoogleMaps",
  "reviews": [
   "Love every part of this place!  A true gem in the Midlands of South Carolina.  The gardens are as pretty to walk through in winter as they are in the spring.  Super clean.  Friendly staff.  Animals are active earlier in the day...try to arrive as soon as they open due to that reason.",
   "Always love visiting the zoo! Just a nice stroll through the gardens and down to see the animals!\nLove making memories with the family at Riverbanks!  Weather was PERFECT! The animals were out playing with each other, and we were able to get some great pictures!",
   "We always have a great time at the zoo and botanical gardens! There's a lot more for kids to do and see at the gardens since our last trip about 3 years ago. Our family really enjoyed visiting this weekend!",
   "The gardens are somewhat small in comparison to some of the other attractions on the property. The fact that they are connected to Riverbanks Zoo (by tram or short walk) is a huge plus. Doing both in a single visit is doable, but makes for a long day. Definitely a good way for the kids to burn some energy.",
   "Fantastic layout. I love to see all of the well kept plants, flowers and trees. We enjoy stopping in whatever we can."
  ]
 },
 {
  "name": "Columbia Canal and Riverfront Park",
  "address": "312 Laurel St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/586b6006-932f-11ea-bb23-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=8911544469547747247",
  "source": "GoogleMaps",
  "reviews": [
   "A wonderful experience!  Obvious what the City is doing with tax payers money.  They have come a long way over the years.  A variety of seating, picnic tables, playground areas.  It's an athlete's Oasis with the paved winding trail.  I will definitely visit more often!",
   "This is one of the things we love about Columbia and it's getting better. Expansions are going to be stellar and help Cola stand out. Rushing waters can be viewed along the way, but now there are even chairs and hammocks to relax in. A great way to spend a couple hours and get some exercise too.",
   "More for dogs rather then people... the only bathroom is at the front of the trail. Im pregnant and pee a lot so I couldn't get very far down the trail without having to turn around. Please make other facilities available. Saw a lot of doggy bag stations... they are not the only ones who have to go!",
   "Gorgeous free river walk! There are trails along the river with tables on overlooks, Spanish moss hanging from the trees, and a really nice area with hammocks and Adirondack chairs.  What a great way to spend the afternoon close to the downtown area.",
   "Riverfront Park was great when it opened in 1986, but unfortunately city of Columbia parks and rec is unable to manage our park system properly.  The roads are crumbling, the signs are falling down, parts are closed off.  It's just a mess.  That said if you want to get out and take a run its a nice place to go as long as you get there before it gets crowded."
  ]
 },
 {
  "name": "EdVenture Children's Museum",
  "address": "211 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/58c6c5ca-932f-11ea-ac0a-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=5009014924889452888",
  "source": "GoogleMaps",
  "reviews": [
   "This place is an incredible gem in Columbia. Possibly the best children's museum I've ever visited. My four kids were all engaged and busy for the whole 6 hours we were there, and they could happily have stayed for hours more. If you have kids, this is a must-see in Columbia. If you live here, it's one hundred percent worth the membership!",
   "Two year old son had a blast.  He found a friend to play with and the experience was wonderful.   As a pilot and former volunteer fire fighter, the exhibits were great.  Only problem was that the thrust levers on the 757 didn't advance for takeoff.",
   "A great day adventure with many different educational adventures. Food court had great food at reasonable prices, all staff was very friendly and there seemed like so much to do. Highly recommend if you have children and have never been!",
   "Our three year old really enjoyed it, but our eight year old was bored. There really isn't enough here to engage an older kid. We were disappointed that despite the large outward appearance of the building, there really wasn't much to keep our kids occupied for an extended time. I had expected to spend half a day here, but we struggled to stay more than an hour without revisiting areas.\n\nI don't really agree with the pricing, either. We paid for two adults and two kids, but after our experience, I wondered what exactly it is the adults are expected to enjoy? It's not like a science museum where people of all ages are encouraged to interact with the exhibits. There's nothing for a parent to do, other than follow the kids around. Certainly, most of the crawling areas can barely accommodate a grown man like myself. Overall, I think the experience was overpriced.",
   "As a retired Veteran, I enjoy the opportunity to spend more quality time with my family after 20 years of service. Our children asked to go to the Children's Museum, so my wife Tamara Pierre and I took our family (ages 5, 8 and 10) to EdVenture Children’s Museum and we all had an amazing time. My children's favorite activity is the Publix grocery store. They REALLY do enjoy shopping! (I wonder where they get that from!!! 😏)\n\nI especially enjoyed playing hockey and interacting with all the children. At first it was just a couple of us playing, and before I knew it... there were 6 kids (of all ages) vs. ME!!! 😎 Don't worry folks... I got this!!\n\nMy 5 year old Elite Jr. (in the black jacket) is a very timid and socially awkward child. This was his first time playing such an aggressive sport with so many bigger kids. All the kids were very kind and helpful allowing him to take shots too.\n\nAfter organizing a short game right before closing, the kids won 4 to 1. 😟\n\nAll of the parents of the other children thanked me for organizing the game and playing with the kids. One mother even pulled me aside and asked me to apply for a job to work as an Educator at the museum. She was so impressed by how I engaged with the children, she said, \"I'd hire you in a minute!\"\n\nI applied for the position today! Wish me luck!"
  ]
 },
 {
  "name": "The Final Door Escape Room Columbia",
  "address": "930 Knox Abbott Dr, Cayce, SC 29033, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/590a5ea4-932f-11ea-882a-14b31f159f22.png",
  "tags": [
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14089710463019890153",
  "source": "GoogleMaps",
  "reviews": [
   "This was a great experience!  This particular one was kid friendly.  It brought much excitement.",
   "Visited this establishment with my whole family. Our group consisted of my wife, my three daughters (ages 13,11, and 8), and myself. We chose to do the Down the Rabbit hole room. We were able to just barely escape with mere minutes remaining with a little bit of help from the overseer. The overseer did help more than I would have liked but clearly we needed every bit of help to finish on time. For the room itself it was fantastically themed and the puzzles had a lot of variety to theme. I will definitely be returning to try the other rooms!",
   "Mitsy was the best! She scared us and made it great! This was our 3rd escape room with them. All our experiences were great! We beat 2 rooms and lost 1 room. This experience is worth the money!",
   "We did Down the Rabbit Hole room and it was so clever!  We absolutely loved it. We've done escape rooms in other states and this place was one of our favorites.  Noah, The Mad Hatter, was hilarious. He was entertaining in his part and made the whole experience that much better.",
   "We had a ton of fun in The Sacrifice tonight.  The atmosphere at The Final Door was amazing, out Game Master (Mitchell) was wonderful, and the room was the perfect mix of fun and challenging. As soon as you walk in the building, you feel like you've stepped into a different world, and I can't wait to try out the other rooms."
  ]
 },
 {
  "name": "Columbia Museum of Art",
  "address": "1515 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59567076-932f-11ea-ae70-14b31f159f22.png",
  "tags": [
   "learn",
   "free",
   "art",
   "art",
   "walking",
   "art"
  ],
  "link": "https://maps.google.com/?cid=17573773874273889936",
  "source": "GoogleMaps",
  "reviews": [
   "I had higher hopes of the Tribe exhibit, seeing as there were several areas dedicated to horror films, but I digress. The collector's exhibits in the  upstairs area was the hidden gem, I was able to explore and learn so much. Beautiful for a different type of day date, great conversation starters. Make it your own",
   "Gorgeous inside and out.  First Thursdays are free to locals. The terrific gift shop is free to browse all the time!  Great for locally made art or beautiful mass produced.  All make great gifts.",
   "If you love art then you will love this place. I would recommend looking up their special events and going then since they have some fun and interesting events and you still get to experience the art on display.  A recent fun one I went to was the Wizard of Oz pop up.",
   "Just saw the last day of the van Gogh- themed exhibition. Well done, I think. Very fine rotation of their permanent pieces. Smaller, accessible venue. Superb location with many amenities in immediate walking distance. A credit to the rejuvenation of Columbia's downtown.",
   "Wonderful Art museum. It's a good size museum, not too big and over whelming and yet not not too small. I was able to see the Van Gogh exhibit and really enjoyed it.  I would recommend looking at their website and seeing what exhibit is in town so that you can pick something that you are interested in seeing and skipping what you're not interested in. \nThe stationary exhibits are also very lovely."
  ]
 },
 {
  "name": "Soda City Market",
  "address": "1300-1600 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5996dc5c-932f-11ea-a0f4-14b31f159f22.png",
  "tags": [
   "walk",
   "eat",
   "food",
   "food",
   "music",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2842810751571818959",
  "source": "GoogleMaps",
  "reviews": [
   "It's a nice place to go in the weekends but the actual farmers market is not always great. \nIt's much better in the summertime. A lot of times there's more food trucks than people selling there products, fruits and veggies. \nStill a fun place to walk around and eat on Saturdays.",
   "Best place ever. So much fun! Great food, great vendors, great events! Soda City is an awesome organization that does more than put on an awesome market every single Saturday! The market, alone, is amazing though! If you don’t have anything to do, you can always count on the Soda City market to be in full swing every Saturday! Such a great community building event for Columbia!",
   "I would leave my wallet at home unless you have more money than you know what to do with, but wow so so much fun. so much fu!lfood crafts nice people dogs everywhere music every Saturday 9:00 a.m. to 1:00 p.m. go you'll be glad you did. By the way, I did not follow my on advice. May who needs electricity anyway I have a hand carved wooden bowl it's beautiful",
   "Wow, just wow! The most awesome food!!! If you can be patient and wait in a few lines, man. . . eat your heart out! It will take you a few weeks, a few months even (if you aren't a pig like me lol) to get through all the food truck/vendors but it is SO worth it!! There is a fresh fruit and vegetable market, which is really cool. There are also some regular vendors selling products. One we really liked was Wag More Collars ❤🐾 The staff were friendly and amazing and the collars and bows were beyond beautiful! I also love that the Soda City Market is animal friendly! My pup gets to socialize with people of all ages and other pups. It's overall a great experience. One that makes for an enjoyable Saturday in Columbia.",
   "Worth checking out on the weekends if you are nearby. Would not drivefor miles to come but was overall a great experience. The breads bakery items I was impressed at the worldly selection of food products. Small farmers market as well."
  ]
 },
 {
  "name": "Frankie's Fun Park",
  "address": "140 Parkridge Dr, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/59f1bfde-932f-11ea-aa91-14b31f159f22.png",
  "tags": [
   "family",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=6378741184711366416",
  "source": "GoogleMaps",
  "reviews": [
   "This place is so cool not only for children but adults too. The laser tag was so awesome, it was the first time I had played. It was just me and my family who played and my sisters score didn't add up, almost like it wasn't turned on. So the employee let all of us play again. Great customer service. It started raining when we went to play mini golf, so they gave us a refund of our money. I've been back a few times. Expect to spend quite a bit of money when you come tho. My niece and nephew loved the child playground that they have inside. It felt safe because there was only one entrance to it.",
   "I haven't been here in years and how I like the upgrade of games and adventures. It was clean down to the bathrooms and Eating area. My daughter really enjoyed the Go Carts and Drop tower and I enjoyed the Batting cages. We'll be back",
   "We went on a Thursday and I loved it. It wasn't packed. I enjoyed not having to wait for lines of people to play games. \nDuring the summer when everything is open, drift park, water bumper cars, the go cart track,  drop zone and the mini golf it's so fun!!! It's also busy. Not like the other well known franchise but busy. The drop zone is perfect for little ones. The drift track was my favorite! We did that a number of times. The line for the race track was long. We didnt have a chance to do that but it will be something I'll do when we go back.",
   "My son and his friend had a great time for his birthday here yesterday.  I mean it is pretty pricey,  but they had fun! It was their first time there....I would say it was a hit.",
   "Had a blast! We went in October around 830pm. Boys loved the go kart race tracks. We got soaked on the bumper boats and never stopped laughing.  The employees were awesome and were very energetic. I liked that they answered all my sons questions with a smile. We did the fun maze and that was a blast. The arcade has some fun games and they all were working! It was clean. Bathrooms were clean.  My soft pretzel was delicious.  Definitely going again!"
  ]
 },
 {
  "name": "West Columbia Riverwalk Park and Amphitheater",
  "address": "West Columbia, SC 29169, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a394152-932f-11ea-b3b3-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "walk",
   "food",
   "free",
   "walk",
   "walk",
   "kids",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13424275961736358566",
  "source": "GoogleMaps",
  "reviews": [
   "A great place to go for a walk and view the river. The area is well kept and maintained. There are times especially after a long rain that the area will flood. Seeing the river flowing was a really neat experience, I've gone a couple times already and would recommend it for anyone who wants to take a nice hike with a wonderful view.",
   "Beautiful. I come here with my baby and dogs. I always feel safe and there are officers that ride through the park very often. So stunning. Great for a nice walk or run. Or to just grab some food and sit!",
   "Great for morning/evening walks. Try both the trails. It's Pet friendly. Parking spots are limited, lucky if you find a spot. Parking is free though 😊. You can carry some quick bites and have it there are a few picnic tables/ some stairs kinda thing. We did spot some snakes in the water .. wouldn't suggest going bare but good to go on floaters esp during summer.",
   "Love this place! It's a wonderful place to walk or run! Today however it's completely underwater. It's February 8, 2020 and we've gotten a lot of rain in a very little time. This is worse flooding then the 2015 flood.",
   "Limited parking is the only trouble. This is a lovely place to take a walk or run. Kids love to play at the riverbank. Small area sometimes features live music and river float/kayak rentals during certain months. Pet friendly. Bikes and skating are allowed. Plenty of grass space and pretty views for a picnic!"
  ]
 },
 {
  "name": "Robert Mills House and Gardens",
  "address": "1616 Blanding St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5a8c21cc-932f-11ea-9156-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "tour",
   "history",
   "tour",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=7062444965569929298",
  "source": "GoogleMaps",
  "reviews": [
   "This handsome, historic house and museum at 1616 Blanding Street in Columbia, South Carolina was built in 1823,  preserved by the Historic Columbia Foundation and designated a National Historic Landmark in 1974. \n\nIt was designed by South Carolina native architect Robert Mills, notable for not just one but two Washington monuments.\n\nTours are offered regularly, providing insight into the history of the  building and grounds reflecting the symmetrical Early Republic, Federalist architectural style. \n\nThe backyard formal garden is a beautiful highlight of the visit, mirroring the graceful elegance of the antebellum era.",
   "One of the highlights of visiting Columbia South Carolina. The house has a rich history involving Robert Mills, the architect of the house and most famous for designing the Washington monument. The guide was very informative and always asked if we had questions. Great Costomer service all around. The price for a guided tour is $10 a person and well worth it.",
   "Beautiful! Very nice tour guide as well. Very friendly and welcoming. Good people,  beautiful place.",
   "Lovely grounds and buildings, beautiful interior. Our guide was very knowledgeable and charming.",
   "Fascinating! Robert Mills was a famous architect. He built this home though no one ever lived in it. Mills designed the Washington Monument. This house gives you a feel of life in the south in the early 1800's."
  ]
 },
 {
  "name": "South Carolina Confederate Relic Room and Military Museum",
  "address": "301 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5acf4578-932f-11ea-8de2-14b31f159f22.png",
  "tags": [
   "kids",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=4481791160776700051",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice museum. My kids enjoyed it. Best part of it is that it was only 1$ for entrance per person. So many things to look at, will definitely be going back soon to finish looking at everything this museum has to offer!",
   "Went for the Sherlock Holmes tour. So much fun, from 8years old to 61years . We all found something fun",
   "An excellent opportunity to view the best collection of War Between the States artifacts in world.",
   "Absolute must for a Historian!! Great exhibit, easy to get to, took awhile to read and navigate exhibit. Did not bother me at all!! Many photos, flags and testimonials from Civil War veterans!! You will not be disappointed",
   "This was a fun museum and my fiance and I really enjoyed checking out all the exhibits. The museum itself is comprised of 4 separate stories, each story containing 3-5 different exhibits. There are also there different shows you can attend if you get the \"Master Explorer Ticket\" which cost approximately $12 per adult including a 4D show, a planetarium show, and an exhibit show. It was a fun day and we really enjoyed our experience. The ONLY reason this is getting 3 stars is due to my experiences with museum trips in cities such as San Diego, Washington D.C., and Norfolk which are vastly larger as would be expected."
  ]
 },
 {
  "name": "Harbison State Forest",
  "address": "5600 Broad River Rd, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b13564a-932f-11ea-9fa9-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "hike",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2804040522832769827",
  "source": "GoogleMaps",
  "reviews": [
   "This park has the best trails around for any activity. I go here to run and bike the trails. There's only so much that the Midlands have to offer in terms of terrain, so after that is taken into consideration this is a five star place to be. For bikes the biggest challenge in the area can be to find areas with decent trails and no deep sand. Harbison has basically no sandy problem areas and the riding is flowing and fast. As a trail runner I enjoy running different routes and not covering the same trails more than once. There's tons of miles to run on here and the other day I ran a half marathon here in my training. I thoroughly enjoyed the scenery and we'll maintained trails.",
   "I absolutely love this trail system. Always have some of my most memorable runs here.",
   "Always enjoyed walking the trails with the buddies back in the day! Went there recently and still as beautiful and fun to walk as back then! Highly recommend!",
   "It's a great forest. What more is there to say? It's good that with such a short drive you can be in the woods enjoying nature.  The drawback is that you can still hear alot of the sounds of the city life but I'll take that for some easy access hiking. The forest is pretty flat over all. There's plenty of trails to choose from to get a nice quick hike in or to spend the day on.",
   "Every time I come through Columbia, I make it a point to mountain bike at Harbison State Forest. The trails are well maintained and they seem to drain quickly after a rain (though, you may want to check with a LBS instead of taking my word on that). They have a bike wash station with a couple of brushes to help keep the boys of the park in the park instead of going home with you. There is also a pair of dog bowls with water for your furry friend. Trail dogs are welcome do long as you keep them leashed. Unfortunately, there is no bathroom at the trail head. If you have to go, you'll need to head down the trail to one of the pit toilets. \n\nThere is parking, but I've found that it can get crowded on the weekends.\n\nCost to play is $5/day or $25/year. Will worth it!"
  ]
 },
 {
  "name": "Waterfall Junction",
  "address": "Mohawk Dr, West Columbia, SC 29169, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5b61769a-932f-11ea-841d-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "hike",
   "walk",
   "kids",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16955362521686317737",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful area! In the garden area my eyes were wondering everywhere with all the beautiful flowers and designs all around. My kids absolutely LOVED the play area in the back. Had a dinosaur fossil digging area, little clubhouses, big tree house to walk in, waterpark area, grassy area for them to run around, cool little tunnels, But that's just the stuff that I remember! I think I could come in the summer and the family would probably just stay in the Waterfall Junction area the whole time! Oh and I like the little hike you can take (optional) in order to make it to this part of the Zoo.",
   "Lots to do but kids like to walk fast and still fall on the slick cement. They really need to change the flooring. We stayed with our kids the whole time but kept helping other kids up.\nKids were falling everywhere and busting heads and faces. \nLike that alcohol is available but way over priced and food is zoo food so again pricey for old stail chips.",
   "Great place for a family staycation. The Zoo has more than enough to keep your animal lovers entranced, and the splash pad provides a cool respite from the heat",
   "Such a nice, aesthetically-pleasing area for families to enjoy and cool off during a visit to the zoo & gardens. We were very impressed by the features and plan to visit many more times. There is a smaller area for young children, games on the lawn, seating, refreshments & snacks, etc....all in one spot! We loved Waterfall Junction!",
   "Absolutely gorgeous and fun place for families. Makes for great photo ops! 📸"
  ]
 },
 {
  "name": "Governor's Mansion",
  "address": "800 Richland St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5bb22ee6-932f-11ea-9330-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4565051564483453340",
  "source": "GoogleMaps",
  "reviews": [
   "I have been to the grounds of the Governor's Mansion many times. It is always well maintained.  During every season there is some natural wonder to see. It is always beautiful.",
   "Such an awesome place and beautiful grounds",
   "a beautiful place - excellent for photography and special events. my stepbrother and his (now) wife got married here a few months ago - and I was amazed by the beauty and charm of the place!",
   "I did not expect to find Lace House Gardens downtown. It is something different and night if you want to walk and clear your mind.",
   "Great place for an event, wedding and it was also nice to meet the Gov. Too!"
  ]
 },
 {
  "name": "World's Largest Fire Hydrant",
  "address": "1404 Taylor St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c03d162-932f-11ea-848e-14b31f159f22.png",
  "tags": [
   "art",
   "kids",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5442985309199641311",
  "source": "GoogleMaps",
  "reviews": [
   "Cool piece of street art and who does not love one of these 'worlds largest' items!\n\nIt's located at the side of the road and the whole of this area felt a bit sketchy to be honest.\n\nParking is limited nearby and there is not much in this area apart from the Hydrant itself. It seems years ago there was a water feature stroke element but this is now broken on the sculpture.\n\nAlso check out the mural nearby.",
   "This is free public art installation by South Carolinian artist \"Blue Sky\".\n\nThis would be a fun little stop if you have little kids is it promotes some wonder and fun conversations. \n\nAccording to Atlas obscura it weighs 675,000 pounds and was built to withstand a hurricane even though it was designed to look as though it had been hit by a giant car. \n\nPaid parking is available in the \"Busted Plug Plaza\" and on the street in front of it. Another of blue skies\n\"Tunnelvision\" is nearby as well.\n\n👩‍🚒 FREE PUBLIC ART. 👩‍🚒 \n\nSee you on the road,\n📸 🙋‍♂️@gabrielcraft.me",
   "This is the first time I have been at a \"world's largest\" thing. It would be very nice if they gave it a better surround-not just traffic walls and chain link fence. The mural in the same lot is incredible as well.",
   "This was a neat sculpture, but the location was pretty odd and there was quite a bit of construction around it's perimeter. Maybe that's part of the art...not sure.",
   "Just a random fire hydrant sculpture in the middle of downtown. Good photo opportunity, but nothing more. Also, it was hard to find parking and it’s surrounded my business. There are lots of cool murals around."
  ]
 },
 {
  "name": "Riverfront Park",
  "address": "1115 Gist St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5c63a50a-932f-11ea-bb2c-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "family",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1358223063042985478",
  "source": "GoogleMaps",
  "reviews": [
   "Small but with a nice view. Not too much to say, sometimes the pictures does equal thousands of words. \nThe bridge amazed me because it has some details you don't usually see on bridges. So from underneath you can see the sunset and its light on the bridge that creates a nice scenery. A nice walk a little bit out of downtown, not far at all, yet it reveals a more calm and natural side of the city.\n\nIt is close to the edventure museum for kids, so it is good for a family walk.",
   "A quiet place off Gist Street. Parking room for maybe a dozen vehicles, including handicapped parking. \nJust a little bit down are a set of large rocks under trees that provide nice shade for a peaceful break from the city. Follow the path down a little and there's an overlook, near the bridge.",
   "Nice place to visit lots of history. Dont visit when really hot though is my advice.",
   "Had a nice time out today at the river front near meeting street! Will definitely go back when it gets warmer to enjoy the sun and the sound of the river.",
   "Excellent access to a beautiful river.  If you visit, enjoy the area.  Please, remember \"if you pack it in, pack it out\".  Let's keep our natural resources clean and litter free for all to enjoy."
  ]
 },
 {
  "name": "Hampton-Preston Mansion and Gardens",
  "address": "1615 Blanding St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5cba7d1a-932f-11ea-bb77-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=7297446809818697081",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely garden \nLandscaping is excellent \nThe shade trees, makes you want to camp out there",
   "Excellent docent information complements what you'll see in the mansion.  Gardens are improving with funding to restore their glory.",
   "This is a beautiful and well-maintained property. The tour guide was extremely knowledgeable on the history of the property and the stories of the people who lived there. She was very passionate about the subject and pleasantly engaging with the tour group. Highly recommend for an educating and entertaining view of Columbia history",
   "Beautiful Garden convenient to downtown.",
   "Went for the Holiday tour. Very fast and disorganized."
  ]
 },
 {
  "name": "Palmetto Falls Water Park",
  "address": "6511 Marion Ave, Columbia, SC 29207, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d025bd2-932f-11ea-8c01-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "food",
   "walk",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3205085953173477426",
  "source": "GoogleMaps",
  "reviews": [
   "Enjoyed it. Please do not wear cotton. I got to sunbathe too😊",
   "Actually didn't go to waterpark as it is closed. We went to the playground. My grandkids love it there. And they have it decorated beautifully for Christmas. Everyone should visit. Especially at night to see the lights. Great!",
   "So this is a cute little water park close to home. My husband is a disabled vet so I am unsure about civilians with no military affiliations being allowed on. The process was simple the life guards are everywhere watching after the kids. And there is a little something for all ages. This is not by any means a large park but def fun. No outside food or beverages band if you have a cwp you still cannot being firearms on base. All looks to be fairly clean. Def a nice time to spend with family",
   "While the kids enjoyed this my concern would be how hot the wood was even with mats over top it was scaulding to walk on and when you tried to hurry they blew the whistle at you for running. \nI did appreciate how the lifeguards actually did their job and kept things running smoothly. But I also think they were a little too aggressive in some instances.",
   "My kiddos and I love it! Return several times! Small but fun, lifeguards always on point! The price for entry is low, and food is inexpensive but good! I would also like to share today's experience. Shout out to management! As I was leaving a family was trying to come in with a dachshund but couldn't bring it in. So the older man and little girl took it back to the car and left it! Then the family tried buy tickets to cool off from the 96 degree day! The park DENIED them entry because they didn't want the dog left in car! 👏🐶"
  ]
 },
 {
  "name": "Sesquicentennial State Park",
  "address": "9564 Two Notch Rd, Columbia, SC 29223, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d4aafa2-932f-11ea-aaaa-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "hike",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15568892834672260028",
  "source": "GoogleMaps",
  "reviews": [
   "The park itself was beautiful.  Two of the trails are super kid friendly. The waterfall was amazing for the kids. Plenty of places for picnics. We got to feed the geese which made their day. Definitely will go again.",
   "Nice little area. Had a great time camping with family. Nice, convenient place to stay while down for my sons basic training graduation.",
   "Lots to do for families or outdoor enthusiast. Biking, hiking, paddle boats, camping, playgrounds, dog park to name a few. I love this place.",
   "Great place to relax in a kayak and hike some trails. It's not free to get in, you need to pay per vehicle, about 10$ or 100$ for the year. Parking outside the park and walking in, is not a great option.",
   "The trails alone are worth the visit but the campground is equally fantastic!  Everyone is so friendly too.\nI got 20 miles on the trail system here and never got bored."
  ]
 },
 {
  "name": "Finlay Park",
  "address": "930 Laurel St, Columbia, SC 29201, USA",
  "avg_visitor_review": 3.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5d999c66-932f-11ea-b88b-14b31f159f22.png",
  "tags": [
   "nature",
   "walking",
   "food",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=218805609575239614",
  "source": "GoogleMaps",
  "reviews": [
   "It's not what it once was. When I was a child, it was a favorite. It's since definitely gone downhill. The playground is nice but they need to get the fountain back up and running...clean the water. I also don't feel safe there anymore. I miss the days when it had families, bike riders, people playing frisbee. Those were the days.",
   "A beautiful oasis of nature in the middle of Columbia. It has a nice pond and fountain with walking paths and a playground. The playground is great for able bodied children but not for those with special needs. The park hosts numerous events and concerts throughout the year. Parking is limited and you could end up walking a couple blocks to get here.",
   "Went down to take blankets and bookbags to the homeless. It was awesome and they really appreciated the items. Will be going back to take more items and food. It was good for my daughters to see that there are people that live like that.",
   "Love visiting. Park is usually clean and the view of downtown is breathe taking. I spent a lot of lunch breaks here when I lived in the area. There can be a lot of homeless people there but they don't usually bother you. Great place to workout and talk a walk. Nice for picnicking and hosting events.",
   "2 stars for layout and the potential view\nNo stars because there is sooo many homeless. I was approached by 3 guys asking to use my phone to find out where his brother is. Um no, not going to happen. There was packs of homeless people all over. \nThere is no fountain / waterfall, there is trash everywhere needs TLC on paths and steps (dangerous) \nYou don't see homeless ones in my pictures because I tried to hide the Debbie downer points."
  ]
 },
 {
  "name": "Granby Park",
  "address": "100 Catawba Cir, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5df09234-932f-11ea-aa0e-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "walking",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=12366516078987582956",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to go and take the dogs for a nice walk. Beautiful place.",
   "Great walk to beat the heat plenty of places to stop and sit and take pictures",
   "Very cool walking trail near the river but still in the heart of the city.",
   "Easy trails; nice shade trees, lots of benches & fantastic bird song. Clean rest room in cute building adjacent to parking lot.  Highly recommend!",
   "We went on a rainy, muddy day-- I loved it! We slipped and slid through some of the trails and had a ball. Definitely peaceful and a great place to meditate- especially near the waterfall there. We went to magnet fish- no luck but a great experience with nature in the city. I would visit again on a dryer day just to tackle some of the trails that were blocked by water and mud."
  ]
 },
 {
  "name": "Saluda Shoals Park",
  "address": "5605 Bush River Rd, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e46059c-932f-11ea-8cc0-14b31f159f22.png",
  "tags": [
   "music",
   "kids",
   "walking",
   "kids",
   "walking",
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=9822339226455398410",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Membership costs are reasonable, day passes are available, and there are lots of things to see and do here. Fishing, running, walking, hiking, biking, bird watching, canoeing, a dog park, playgrounds, a splash pad, an athletic complex; outdoor activities are pretty well covered. Then of course they have the locally famous holiday lights, a jazz music series, and they host a variety of events.\n\nNo place is perfect, but I have found that the administration is very conscientious about addressing issues that are brought to their attention. The staff seem invested in keeping the park in good shape. Visitors to the park are a fairly diverse bunch, and most of the folks that I've met who are first timers plan on returning.\n\nI brought my kids here to do their homework and play when they were little. My wife and I renewed our vows here. I bring my dogs here daily. It is a local treasure, in my opinion.",
   "A terrific way to spend the day in this hidden gem. Bring your own bikes or rent some, you can rent or bring your own tubes and kayaks to go down the river. They have pick up service for rental patrons. A enviromental center with play area for kids. As well as tons of paved and non paved trails for walking and bike riding. They also have a splash pad and covered play area and a handicap accessible nice new play ground and sports fields and tennis courts.",
   "We love the dog park here!  All kinds of pups show up and they have all been respectful to our new, one year old Lab.  It's about 3.5 acres, 2/3 grass and 1/3 woods. Theres a fire hydrant water fountain, three dog pools with drains and a hose so you can change the water.",
   "Great smaller venue. Attended South Carolina Paracon and got to meet some amazing paranormal celebrities. Not too big and plenty of room for speakers, vendors, fans, and therapy dogs!",
   "This is one of my favorite parks in the northwest.  Lots of trails to walk around, a small area for tubing or kayaking, a huge dog park, and an amazing all inclusive playground."
  ]
 },
 {
  "name": "Irmo Community Park",
  "address": "7473 Church St, Irmo, SC 29063, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5e888d1a-932f-11ea-810c-14b31f159f22.png",
  "tags": [
   "walking",
   "field"
  ],
  "link": "https://maps.google.com/?cid=16396205146574299824",
  "source": "GoogleMaps",
  "reviews": [
   "Such a beautiful park! Great new playground, walking or riding trail, and lots of pokestops and gyms for playing pokemon Go",
   "A great Park. Point Blank. 😃",
   "Nice wooded area with plenty of space for the children to play. There is a small stage field bands to play. The jungle gym area for the children was colorful. The only thing that I noticed missing was trash cans. They had a couple but not near enough for my liking. There is also a pavilion for people to rest under.",
   "There is a lot of pokestops so I love them and there's raids",
   "Excellent place for grandchildren to play and get rid of that excess energy!"
  ]
 },
 {
  "name": "Mann-Simons Site",
  "address": "1403 Richland St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5edc79c0-932f-11ea-821a-14b31f159f22.png",
  "tags": [
   "walk",
   "tour",
   "history",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9092721959556013753",
  "source": "GoogleMaps",
  "reviews": [
   "We did a tour, and walk through this place. The staff tells you about the history of the house and of Columbia. It was a great place to visit.",
   "Fun and educational look into the history of Columbia, SC.  The house is well maintained, and some of the artifacts on display are from local excavations.  ",
   "Jubilee Festival was amazing. Look forward to this event every year. Very well planned.",
   "Remarkable history!",
   "Great place to visit. History in Columbia."
  ]
 },
 {
  "name": "IrmoTown Park",
  "address": "7330 Carlisle St, Irmo, SC 29063, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f2f06e2-932f-11ea-ae50-14b31f159f22.png",
  "tags": [
   "nature",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9048614039455835966",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I love this park. We love it so much, we actually chose it to be the place where we were married. This park is focused on nature and the beauty found within that nature. The park is serene which makes it a great place to think and relax. There are no pieces of playground equipment at this park. Again, this park is focused on the beauty of nature.",
   "Such a lovely respite in the middle of a busy area! Well kept and lit well at night. Benches, gazebo, water feature with fish, and public bathrooms as well.",
   "A relaxing place to stroll and/or Pokemon hunt.  Beautifully landscaped and well laid out. A small gem in the Irmo community.",
   "Came here for some outdoor family photos. What a great location!",
   "What a nice little park! My family stopped here for a picnic lunch on our way from Kentucky to the coast, and were very happy to find this place! It's a lovely green space with a pond, picnic tables, a large gazebo, and public restrooms."
  ]
 },
 {
  "name": "Elmwood/Roy Lynch Park",
  "address": "Abbeville St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5f81bacc-932f-11ea-9c95-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4794385269780902862",
  "source": "GoogleMaps",
  "reviews": [
   "Great little park in downtown Columbia! It's kind of small but very kid friendly. Their climbing structures are interesting,newish and in good condition.they have a monorail type swing  like I have never seen before and had a hard time getting my 7yo granddaughter to give it up! Only downside is no bathrooms but considering the area I can understand.",
   "Nice. We loved it. I unvoluntarily sunbathed though becuse the splash pad part of the park isn't really shady but i loved the water it was nice. Nephew wished water was continuous but he got use to it. He loved the playground area. It was shady to me, new and clean and the water is user operated!",
   "Nice Peace and Quiet with Alot of Surveillance Cameras around the park😎😎",
   "Awesome park with great facilities, slides, fountains, swings, channel line and more. Recommended totally for kids of all ages and family groups.",
   "Cute little park near downtown Columbia. Plenty of shade. One entrance to park. Play areas for smaller and bigger kids, swings, and a cool little zipline. Small splash pad perfect for cooling off. Only downfall, no restrooms."
  ]
 },
 {
  "name": "McKissick Museum",
  "address": "1501 Pendleton St, Columbia, SC 29208, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/5fe055e4-932f-11ea-9c65-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1364451472515993667",
  "source": "GoogleMaps",
  "reviews": [
   "LOVE LOVE the McKissick Museum!!",
   "A beautifully designed piece of architecture.",
   "Welcome to Gboard clipboard, any text you copy will be saved here.Touch and hold a clip to pin it. Unpinned clips will be deleted after 1 hour.",
   "So McKissick is a museum as well as an office location AND the USC welcome center.   Stick to the museum part and you'll be fine. ",
   "Nice collections of memorabilia !"
  ]
 },
 {
  "name": "Memorial Park",
  "address": "700 Hampton St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/602accae-932f-11ea-991b-14b31f159f22.png",
  "tags": [
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17083320257735389792",
  "source": "GoogleMaps",
  "reviews": [
   "The park could use better grooming techniques and the homeless that sleep there.  I found a used condom by an isolated statue I had to pull my dog away from trying to eat.  That was disgusting. Please help to do your part and \"clean\" up the park. Our Veterans deserve better.",
   "It's great just needs a restroom",
   "It needs some cleaning but other than that it was beautiful!",
   "Great feelings to standing beside a Veteran and that loving dog 🐕",
   "Very nice memorials in this park. A little hard to find but worth seeing. Really sad though that several homeless men were sleeping on or near several statues and someone actually defecated behind one. Unacceptable!"
  ]
 },
 {
  "name": "Owens Field Skate Park",
  "address": "1351 Jim Hamilton Blvd, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6078c5e2-932f-11ea-9cd9-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "kids",
   "walking",
   "kids",
   "family",
   "learn",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=15496839141174509571",
  "source": "GoogleMaps",
  "reviews": [
   "Great little skatepark. Three nice bowls, one of which has real pool coping and tile. The concrete is still in good shape on everything and it was free of garbage.",
   "What a great place, we drive from Waxhaw NC for our kids to skate this great park.  It has everything from beginners to advance obstacles. Lots of grinding rails and 3 bowls to skate.  One looks like a old swimming pool and is awesome.",
   "Really neat and clean place for kids. Cool skate park and play ground. Lots of soccer fields and what looks like walking trails. Also some baseball fields as well.",
   "Incredible park to visit!!! I've only gone once so far, but I'm already wanting to visit again!!! The skaters are pretty cool to watch and the park also has an herbal garden that you can sample and a zipline for kids & adults!!! Very nice park! Great for a family outing!!! 👍👍👏👏🤗😍",
   "For a walk-up public park it's pretty darn good! Scooters, rollerblades, skateboards, bikes all welcome. Sometimes the language gets a bit colorful, but the locals are great to support and encourage kids to learn and grow."
  ]
 },
 {
  "name": "Saluda Shoals",
  "address": "6071 St Andrews Rd, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/60bf44d0-932f-11ea-8ed0-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "kids",
   "family",
   "walk",
   "walk",
   "field",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=3830684200350818551",
  "source": "GoogleMaps",
  "reviews": [
   "Today was my first time at Saluda Shoals park and I have to say that the new playground is absolutely beautiful. I love the turf so kids can be safe and as care free to able to just worry about playing ( which should be every kids only responsibility). My daughter had a blast running up and down the ramp. I love the fact that its made also for kids that may have disabilities or not capable of using their motor skills normally. I love the over look of the small pond which is guarded with a fence and the small waterfall that just relaxes the atmosphere. I really love everything about it.",
   "I've always loved coming here for walks and fishing. Recently we bought the fisherman's pass for my husband. $65 and we can go 24hrs. No more $5 parking. The pass is 100% worth the money. Also if you have little ones the splash pad is wonderful. Its $3 for each person. They have so many different sprinklers. Just watch for the bigger kids and don't forget sunscreen. They have picnic tables and a playground right next to it. It makes for a perfect family day.",
   "Love this area.  Kayaking with old friends. My friend Shawn took me here.  Rip.   He had a season pass and we would kayak.  Walk the dogs.  Have lots of fun",
   "A great place to walk by yourself or with your dog.  Trails are paved and wide.  There are also dirt trails off the paved trail that you can go right up to the river.",
   "I absolutely love the new Leo's Landing park! It's amazing to finally have an affordable, all inclusive play location for children in Columbia!  It has something for everyone. I could even see it being a great location to have an Occupational Therapy field trip! I honestly cannot say enough good things about this park. \n\nSaluda Shoals was fun to visit before Leo's Landing; so many trails, a splash pad, river access, etc. But Leo's Landing is definitely our favorite part now! Thank you for providing a safe place to play for our community."
  ]
 },
 {
  "name": "Emily Douglas Park",
  "address": "2500 Wheat St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61074dba-932f-11ea-a415-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "free"
  ],
  "link": "https://maps.google.com/?cid=4227159316015410847",
  "source": "GoogleMaps",
  "reviews": [
   "We take our dog here all the time. It's a nice park in a nice neighborhood and you can walk around in the neighborhood too. Currently there are so many different kind of mushrooms growing in the wild which I find quite fascinating. They have a children's area and a separate dog park too.",
   "There was too much gravel for the dogs to run around on. It should either be grass or sand. A lot of people just leave their dogs poop lying around. They do have 2 places to get water for the dogs and there are a lot of tennis balls laying around. The only \"plus side\" to this park was that it is free and located in a nice area.",
   "Great park, dog park and playground in the beautiful outdoors. Very family-friendly and safe. Highly recommend!",
   "It allowed me to gather myself this morning!",
   "Its the only dog park that is free in the area. It needs some improvement; lots of mosquitos & sand. But because its free, people keep going and that means there is usually a few dogs there at any time. My dog is always worn out after and sleeps well for hours. If you need your dog to get out some energy, go here for free. (see pic below)."
  ]
 },
 {
  "name": "Broad River Canal Riverfront Park",
  "address": "312 Laurel St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61617f22-932f-11ea-a294-14b31f159f22.png",
  "tags": [
   "nature",
   "walk",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11474834096334783444",
  "source": "GoogleMaps",
  "reviews": [
   "Another positively awesome day @Broad River Canal. The weather was great, not to hot nice breeze the pollen was low. The human & animal traffic was mild but tolerable w/a German beer festival starting as I was leaving... I 💛 nature. I have enclosed a few pictures of the canal & some of the scenary. Enjoy!!! 😎💃🏽☀🚲👟🍻🌳🌾🍃🍁🍂🌷🌼",
   "Very nice. 2.5 mile walk each way, so you easily do 5 miles. Very pretty - one of the few things I like about Columbia.",
   "I love this place. It's peaceful. There are restrooms. Check for TP before you sit! Not always clean because not everyone received the same home training and they abuse the privilege.\nThere are paved asphalt trails that run along the canal and there are sidewalk trails that run along a portion of the Broad River that feeds the canal. It's a great place for exercising, strolling, or taking pictures. Some people get in the water at the river. There is no lifeguard and this is not recommended! Don't do this!\nThe canal trail is connected to the Riverfront Park. Partially shaded along portions of the trail. Great views!\nParking usually isn't a problem. Do not leave any valuables in your car. Do not leave your car unlocked. Do not leave anything visible in your car either. Again, not everyone has home training and there is no video surveillance.",
   "Best trail to walk in Columbia. Since I moved to Columbia 21 years ago. Every time I walk this 5.3 miles great satisfaction.",
   "It's one of Columbia's hidden gems. I love walking, biking and fishing there. Most of all I love the covered sitting areas."
  ]
 },
 {
  "name": "Woodrow Wilson Family Home",
  "address": "1705 Hampton St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61a6051a-932f-11ea-99de-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "tour",
   "family",
   "history",
   "tour",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9267929932090192924",
  "source": "GoogleMaps",
  "reviews": [
   "If you are interested in Reconstruction or the Wilson family,  this home has a lot of stories to tell,  enhanced with a guide who fills out detail in very educational and entertaining ways.  We collect Presidential homes and are glad to have visited this one.",
   "I didnt realize Woodrow Wilson had grown up in Columbia. The garden was simple but interesting nonetheless. A plant in backyard looked like the largest thistle I have ever seen. Didnt get to traverse the inside of home because I arrived too early but I believe it was well worth seeing. Wilson was noted for guiding U.S. through WW1 and I believe he was instrumental in the League of Nations, the forerunner to the United Nations.",
   "Great place to learn some American history. Amazing tour guides! Brought my family to visit from Omaha, Nebraska and they loved it, too",
   "Great tour, so much history. Learned a few things I never knew or heard of.",
   "So much History. Beautiful Gardens. His parents are buried down the Street."
  ]
 },
 {
  "name": "Earlewood Park",
  "address": "1113 Recreation Dr, Columbia, SC 29203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/61f9918c-932f-11ea-b067-14b31f159f22.png",
  "tags": [
   "kids",
   "music",
   "free",
   "pets",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=13215676415924199575",
  "source": "GoogleMaps",
  "reviews": [
   "You could just come and set up for a party. You don't have to pay or anything , just in case its last minute. The area is Very nice and clean. There's sections for picnics, music events, kids playground, dog park and nothing interferes with each other. Its awesome",
   "Noma Bark Park is a nice safe place for your pets to run free located at the N\n Main  entrance of Earlwood Park. Again, have no reservations about your safety, because there is a nearly constant police and/or park ranger and/or parks & recreation staff presence. There are also 3 baseball fields, tennis court, outdoor full court basketball goals, disc golf course and an amphitheater. One of my favorite places to play ball",
   "We like going to this course. It's very spread out and if it has rained, it doesn't stay as wet as some of the flatter courses like 7 Oaks. I love the hills because it feels almost as if you're in the mountains.",
   "Loved playing kickball here!",
   "Great location and very spacious.  Had my sister's gradation party here and was easily able to fit 50 plus. Projector used and good parking."
  ]
 },
 {
  "name": "Seven Oaks Park",
  "address": "200 Leisure Ln, Columbia, SC 29210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/624281a8-932f-11ea-af9d-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walking",
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=5023034650861801484",
  "source": "GoogleMaps",
  "reviews": [
   "Get place to play around of disc golf. Well kept. And plenty of parking. Has a nice picnic area as well. It is handicap ramps as well. Baseball fields are well maintained. It has a kids park as well recommended age is 12 but i think younger kids would like it as well.",
   "This is a nice little neighborhood park. I enjoy walking my dogs here in the fall. This is an ICRC park, so it is pretty well kept. There is a semiannual bulletin that is mailed out to residents in the area detailing seasonal activities. I haven't been in the main building, the Leisure Center, very often in the last few years because I don't go to the park to be indoors. The last time I was in there was right after the renovations a few years back. It was a nice looking facility at the time.\n\nThere are several athletic fields here, I often see youth sports teams practicing. Frisbee golf is popular, there is a nice course here. There are picnic shelters, playgrounds, and trails to walk as well. A stream runs along one edge of the park, basically separating it from the neighborhood behind. There is a bridge that allows you to cross over.\n\nParking is typically not an issue, they have two large lots. There are restrooms available down by the athletic fields and of course, in the Leisure Center. There isn't a lot of light in the park area at night unless the athletic fields are in use, but the area around the Leisure Center is well lit.",
   "I very regularly go here to play a casual round of disc golf. Very nice facility. One thing to keep in mind is that the ground doesn't absorb water very well, so even days after a rain, the place is very wet and muddy. \n\nThere's very nice playground equipment here as well, so it's a great place to bring the younger family. Ball fields surround the area. Multiple parking lots. Also a recreation center. ( I haven't been inside this one)\n\nThe park is part of Irmo Chapin recreation.\n\nI love this park!",
   "The playground is nice, and layered with recycled tires so no worry of splinters like with some parks. Not a lick of shade so it's almost impossible to stay very long considering it doesn't open until 2pm, when it's the most hot during the day.",
   "The lunch program for the seniors is great!!!! And the bingo on Wednesdays is fun to!!!!"
  ]
 },
 {
  "name": "Boyd Plaza",
  "address": "1515 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/628a6050-932f-11ea-a580-14b31f159f22.png",
  "tags": [
   "eat",
   "art",
   "kids",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=9373039354843097371",
  "source": "GoogleMaps",
  "reviews": [
   "Big improvement over the old design to accommodate large crowds. Nice shaded area to relax. Very functional",
   "Great redesign in 2019.  The since it's now much more livable with multiple seating options.  A great spot to eat your lunch outside",
   "Great events. Beautiful spot. Very well done all the way around. Oh, did I mention the Columbia Museum of Art? Two thumbs up.",
   "Quiet peaceful sitting area right in the middle of downtown Columbia. City Life rolling with a little piece of heaven with Functioning modern abstract designed fountain with wishing well to make your wishes come true. Charging ports for phones and laptops. Good place to work or study, and eat with friends or business partners. If you have kids, there is a children's area shaded by trees. With a turf covered area Incase you want to lay back...",
   "The redone space is wonderful for hanging out and having a snack Frome the Soda City Market."
  ]
 },
 {
  "name": "U.S. Army Basic Combat Training Museum",
  "address": "4442 Jackson Blvd, Columbia, SC 29209, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/62e613dc-932f-11ea-9fce-14b31f159f22.png",
  "tags": [
   "kids",
   "history",
   "learn",
   "tour",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9811671585610808228",
  "source": "GoogleMaps",
  "reviews": [
   "This was a nice stop to visit and view some military history.  I love to take my kids to these types of museums to let them see what our armed forces have used and currently use while protecting our country.",
   "Very interesting  . Loved it. . Must see",
   "A great place to learn about Army basic combat training. Shows a historical overview of initial entry training. My 6 and 4 year olds loved the museum. The tanks on display outside are awesome. On the inside, there are many hands on and interactive exhibits. My son loved getting mad at the drill sergeant hologram.",
   "Very informative as to what tour soldier endures and learns. Great that it's free too. Lots to look at. Really loved it!",
   "Very nice and numerous interactive displays even had a drill sergeant yelling via hologram which scared my son and hubby...the veteran and current soldier. Highly recommended."
  ]
 },
 {
  "name": "Southeast Park",
  "address": "951 Hazelwood Rd, Columbia, SC 29209, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/632ff85a-932f-11ea-a908-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "family",
   "nature",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7690848465435764560",
  "source": "GoogleMaps",
  "reviews": [
   "The best park in the immediate Columbia area, it is worth the drive to it from downtown. Great disc golf course, some beautiful oaks, and a nice place for a walk. It also has a ton of tennis courts, a kayak/canoe friendly pond, and some nice open fields (not completely flat).",
   "Beautiful park with nice walking trails. Always feel safe and comfortable there. The pond loop is 1/2 mile and sometime disc golfers are on the trail but I’ve never had a problem. My go to park!",
   "I love feeding the 🐢 here great place for family fun",
   "A somewhat hidden gem.  Unless you live in the Lower Richland area, you may not have visited or even know about Southeast Park.    Situated just off of 378/76, it feels like you are further out into nature than that.  Well done walking trails and the best disc golf course in the area, it's worth a visit.",
   "Nice quiet place to walk around or fish. A little on the small side but great place to get away from the city."
  ]
 },
 {
  "name": "Community Park of Irmo",
  "address": "7507 Eastview Dr, Irmo, SC 29063, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/637eda9c-932f-11ea-ac95-14b31f159f22.png",
  "tags": [
   "parks",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=13708908757841129365",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place with nice and clean play ground and beautiful park area as well. One of the best community parks in cola.",
   "Looking around for a new place to live (we aren't from around here) and came across this park. Very cool park. A major plus to living near it. It's obvious that many people of the community came together with a lot of great ideas to make this place happen.",
   "Well lit. Very clean. Public restrooms. Picnic shelters. Walking path. Great playground. Parking is difficult during peak months. Patrolled regularly by law enforcement.",
   "raffles. Shelters for picnics. Large level. Area for volleyball football soccer etc. We held our outdoor baptism for 11 members of Onelife community church. Perfect place with built in seating. Bri g umbrellas for shade in sun. Nice platform for musicians. Beautiful setup.",
   "I liked it. A newer park in Irmo. There is\na bandstand and cement seating area, play area(jungle gym etc) sandboxes swings seesaws restrooms and good parking. Hours are in photos at each of two gates. Mommies with little tots walking about made it look like a safe place to read while I waited for my car nearby at Eurowerkz. Thanks Lex. or Richland Counties & the Town of Irmo in any case."
  ]
 },
 {
  "name": "Maxcy Gregg Park",
  "address": "Blossom St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/63d4a602-932f-11ea-9dae-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "parks",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12571737489455133840",
  "source": "GoogleMaps",
  "reviews": [
   "Clean, well designed park. Good for a short walk. A road runs beside, so you don't feel completely isolated.",
   "Very nice place to go for a walk and there are three places to go in that area. and yes they have homeless people sleeping in the parks but they are people having a hard time. Put yourself in their place. But all in all I wasn't worried about anything and park trucks were making their rounds checking out the parks and cleaning the park Great parks to walk in and spend the day.",
   "The park is nice. A calm place to walk\nAnd relax. Not a place to visit at night\nalone. But during the day...it is a \nBeautiful park. Day swings in the main part. Benches to sit on. Walking trails\nNo Bathrooms !",
   "Some homeless around the park. Not many people hang around on Sat",
   "No 9nexwas there when I got there on the 4th"
  ]
 },
 {
  "name": "Greenview Park",
  "address": "6700 David St, Columbia, SC 29203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/642f97f0-932f-11ea-851b-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=17290712781645675621",
  "source": "GoogleMaps",
  "reviews": [
   "Loved it. Kiddy pool was a little dirty but other than that......great place!! Very fun",
   "The water park was well attended and very clean.  Great family atmosphere!",
   "Nice park, in a random part of town. My son enjoyed himself. Only issue was the rude employee that yelled at me for eating in the park. I was unaware that food wasnt allowed and felt attacked by the older gentleman that worked there.",
   "Greenville Park was one of the parks that had a swimming program. My granddaughters loved going to the pool there in the summer.  Best tennis program among all the parks.",
   "Greenview Park is my go to place.  Exercise classes....line dancing & areobics!!!  Moral is wonderful...we are FAMILY....😆😆😆😆"
  ]
 },
 {
  "name": "NOMA (North Main) Bark Park",
  "address": "1250 Recreation Dr, Columbia, SC 29201, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6480ec0c-932f-11ea-b055-14b31f159f22.png",
  "tags": [
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=4146393806155457131",
  "source": "GoogleMaps",
  "reviews": [
   "Went to have Santa pictures made and was able to walk around and check it out. This place is great! Can't actually go in yet because my pups aren't fixed. That's my only problem with this and other dog parks, as a vet tech I know the benefits of not fixing your pups until their growth plates have closed so they don't have arthritis problems later in life but dog parks won't allow you to bring them not fixed. If owners are responsible you can keep accidents from happening if they aren't fixed. Other than that I absolutely LOVED the place itself and it's amenities.",
   "All the bad reviews are super dumb. It’s a great place for $30 a year. Yes, your dogs need to be up to date on shots. Probably not a bad idea.",
   "I do not have a dog, but was here on business.   There are wide open places for dogs to run, and even a place where they can jump into the creek.  Plenty  of parking. Looks like a good place for puppies to have fun!",
   "My Beagle loves the new playground equipment!",
   "Been a member for the 3rd year. LOVE THIS PARK! All breeds of dogs and people. Is a comfort to know that ALL the dogs have had their shots and there will never be accidental puppies. And all are registered with the city."
  ]
 },
 {
  "name": "Capital City/Lake Murray Country RTB",
  "address": "2184 N Lake Dr, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/64deeacc-932f-11ea-8c47-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=18210285170333849803",
  "source": "GoogleMaps",
  "reviews": [
   "I attended the Lake Murray Christmas boat parade. It was a very pleasant experience and I loved how pretty the boats were. I also loved the fireworks show and I loved how the fireworks mostly contained the Christmas colors. It was a very nice treat and I hope that it will be brought back next year. I'm happy to be a resident of Lake Murray.☺",
   "I love Lake Murray great boat ramp at the dam clean water except in the children's area of the park",
   "Everyone should visit this place. Wonderful information and a Great little gift shop.😊👍",
   "Great place to get your local information!  They have a lot of brochures, a Lake Murray Map, History museum and even some Lake Murray gifts, shirts, hats and more.... They are very friendly and quite helpful! Definitely worthy of stopping in:)",
   "This is my happy place. I love it."
  ]
 },
 {
  "name": "Heathwood Park",
  "address": "800 Abelia Rd, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65236e26-932f-11ea-b76c-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10101313617235924083",
  "source": "GoogleMaps",
  "reviews": [
   "Really nice shady park in the Heathwood neighborhood.  One picnic shelter, tennis courts, handball court, two play areas, and an activities building.  Not a lot of benches, but enough that we could all sit.  It was a pleasant surprise and we'll go back.",
   "Great for playing",
   "My kids love this place",
   "Nice little neighborhood park for the kids and their elders to have fun for a while",
   "This is a vast and well-kept park, with multiple areas for kids to play. The trees surrounding the area are great to provide shade during the hot months."
  ]
 },
 {
  "name": "Trenholm Park",
  "address": "3900 Covenant Rd, Columbia, SC 29204, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/656c5e26-932f-11ea-b12e-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=10701080558300899038",
  "source": "GoogleMaps",
  "reviews": [
   "The fields are clean.  The fields are sectioned off adequately.   Bleachers are available, dugouts available.  Excellent family atmosphere.   My only concern is the lack of parking.",
   "It is a awesome place to play baseball and softball. It has a minor league and major",
   "We had a birthday party there nice and clean place.",
   "The little park was pretty fun but my nephew and i visited at a bad time. There are renovations going on at the moment so we werent able to go swimming at this park but looks fun and there were older boys playing baseball. Looked like they were having fun. Will visit again later.",
   "Great staff and nice park."
  ]
 },
 {
  "name": "Icehouse Amphitheater",
  "address": "107 W Main St, Lexington, SC 29072, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65ba7e58-932f-11ea-a033-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "free",
   "walking",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7380050872050212483",
  "source": "GoogleMaps",
  "reviews": [
   "Very well kept amphitheater. Parking was off-site due to the parking lot being so small, but still not a bad experience by any stretch. A short walk at most. The staff was friendly and efficient. The restrooms were very well kept. Would absolutely come back to this venue.",
   "Really love this place in the middle of Lexington. Kids really love free movie nights and always a ton a free kids events. Love when the beer festival is held there as well. Maybe some sort of ramp from the bottom side parking would be nice rather than walking over by the road",
   "What a wonderful place! This is a gem right in the downtown area of Lexington! We spent a Friday evening there enjoying the Battle of the Bands fundraiser for the MDA. This amphitheater has a comfortable, relaxing vibe set in front of a pretty wooded area. Definitely recommend fun a fun outing with friends and family!",
   "Really enjoyed this amphitheater! Great comfortable seating with grass. Parking was a bit tricky, but if you get there early you should be fine.",
   "Had a great time at the Thursday concert. The free Thursday concert series is a wonderful opportunity for the community to enjoy the new downtown in Lexington"
  ]
 },
 {
  "name": "Timmerman Trail",
  "address": "Cayce, SC 29172, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/65ff33ac-932f-11ea-b44d-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "walking",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=930276522499322908",
  "source": "GoogleMaps",
  "reviews": [
   "Great trail for walking/running/biking,  only draw back is we found no restrooms. There should be at least  port o potties at beginning and 1or2 down the trail. Still it was all paved concrete. Extremely nice with that one exception. Law enforcement was traveling down trail on four wheelers. Another plus.",
   "Great place to walk, run, or ride your bike. Signage could be a little better. Wish they had mile markers.",
   "My family biked over 7 miles here yesterday and we all loved it! Even though it had been raining for several days prior, the trails were in good shape and safe. The woods and trails are beautiful and give you the sense that you're away in the mountains. We saw a deer and two snakes along the river bank along with your typical woodland birds and squirrels. The trails are wide enough to pass others without fear of running one another off the path. The park IS pet friendly. There are multiple parking areas, so do be sure to check signage if you're meeting up with others. This is an awesome (and not overly crowded) place to go on a date, have a family outing or just exercise alone. Although I have not personally been in the evenings I did notice that they have ample lighting and emergency call boxes. There are picnic tables and benches, so it's a lovely place to get your picnic on. I have been twice and definitely plan to return.",
   "Very nice paved path. Good for walking Poppa. Hiking and bike as well",
   "Great trail to walk, run, or bike. Make sure you bring water. There are no restrooms on the trail. Shady paved trail paths and scenic river views. Several bridges to walk over as well. The trail extends to neighborhood in Cayce that connects to another section of the trail that has been closed since the Oct flood a few years ago. The trail paths are wider than most paved trails which makes it better for biking. The trail is maintained, and free of debris. There is also a trail that leads to the creek for canoe access. The trail head is also easy to find and beautiful in the Spring and Fall."
  ]
 },
 {
  "name": "Lake Murray Dam North Recreational Area",
  "address": "2101 N Lake Dr, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6658ec90-932f-11ea-b94b-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "family",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16107715029511194772",
  "source": "GoogleMaps",
  "reviews": [
   "Get out of the house and enjoy yourself. Lake Murray is a great place to relax and pass the time away. Young and old will like being out in the sun looking at and playing on the water. Free fun for all, fishing for the sportsman, boating for the water activites or just a drift on the water.\nThe damn is nice for the walk and many use it for this. Get out of the house and enjoy life! No excuses.",
   "Fantastic location close to the capital to check out lakeside life.  A well kept park with plenty of picnic tables and charcoal grills to afford family and friends a cozy place with beautiful views allowing for a day time escape.  The location has a boat ramp, fishing dock and a ramp for kayaks and canoes.",
   "Love the walk and view. I'm new to this area, and I am looking forward to warm days and lake walks. Beautiful area!",
   "It is always a good place to take the kids for some outdoor time. The views are great, especially at sunset or on a kayak!",
   "Peaceful and beach like feel. Plenty of activities can be done. Lake has so many picnic spots. Columbia's pride."
  ]
 },
 {
  "name": "Congaree National Park",
  "address": "100 National Park Rd, Hopkins, SC 29061, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/669ca5cc-932f-11ea-8809-14b31f159f22.png",
  "tags": [
   "unique",
   "parks",
   "walking",
   "hike",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2443332632627061658",
  "source": "GoogleMaps",
  "reviews": [
   "One of the most unique National Parks I have been to.  Spent the afternoon walking the boardwalk through the swamp and seeing a ton of wildlife.  4 snakes and a box turtle, some fascinating beetles, and a whole lot of squirrels.  A must see for any nature-lovers in the area.",
   "This was awesome. It's a flood plain forest. It was so flooded we could not hike the trails. The video the ranger showed us was good. The ranger was very nice. Maybe next time we can enjoy it more.",
   "2.5 mile boardwalk, just reopen today because of flooding. Flooding is a understatement, The water was feet high above the trees. Remnants of the park benches being underwater are very visible. Lots of birds and wildlife. The trees were absolutely amazing! ** this is a must do!!",
   "Great for family walks and picnics. Great for little ones. Just pack a snack and being your camera. There is sometimes flooding so tennis shoes or boots are advised! Go into the visitor center and also do some Geocaching! (Download the app)",
   "A short boardwalk makes up the easy hiking portion of this park. There are backcountry trails with views of lakes and trees. Some nice features like tree 'knees' and good views of the water. It is fairly quiet in the later hours of the day and a good time to feel like you are surrounded by nature. Check if the floodplain has flooded the trails before you go."
  ]
 },
 {
  "name": "Columbia Historic District II",
  "address": "Columbia, SC 29201, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/66e037ee-932f-11ea-8977-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=5849587533273449645",
  "source": "GoogleMaps",
  "reviews": [
   ""
  ]
 },
 {
  "name": "Congaree Creek Heritage Preserve",
  "address": "634 Old State Rd, Cayce, SC 29033, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/674706cc-932f-11ea-8665-14b31f159f22.png",
  "tags": [
   "unique",
   "hike",
   "food",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=17498201139397808516",
  "source": "GoogleMaps",
  "reviews": [
   "Favorite place to hike in Columbia. Unique ecosystem full of wildlife just across river from city. Alligators, snakes, deer, otters, and birds of prey seen on a regular basis, especially if you know where to look.",
   "If you live in Columbia, SC and you want to get away from the city for a short trip, this is the place to go. 10 min drive and you are walking on trails and encounters the wildlife. Make sure to bring food and water. And I recommend bug stray in the Summer.",
   "Typical swamp wetland heritage preserve with decent parking lot and trail.",
   "A beautiful natural area, especially for wildlife viewing, not that far out of downtown Columbia",
   "Beautiful trail to walk down. Me and some friends seen a baby gator down there"
  ]
 },
 {
  "name": "Cayce Historical Museum",
  "address": "1800 12th St, Cayce, SC 29033, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/678d736e-932f-11ea-ba4b-14b31f159f22.png",
  "tags": [
   "tour",
   "family",
   "history",
   "walk",
   "knowledgeable",
   "nature",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=15217474048491599020",
  "source": "GoogleMaps",
  "reviews": [
   "This is a beautiful museum with so much history. Take advantage of their tour and other fun family activities!",
   "A True hidden gem. Like a little village from the past. Makes a visit to the nearby Cayce River walk much mire interesting !   Staff is So knowledgeable and helpful. Plan to spend an hour or more in museum and walking the grounds. Beauty park with nature trails and a Cinderella pumpkin coach !! Beware the Wildlife !!!",
   "A interesting place, it takes your mind back to how it use to be for others. Yet beautiful to view.",
   "Excellent place to go with adults or children. Children's playground walking trail, Museum, historical buildings. Birthday parties.",
   "A relaxing place go visit."
  ]
 },
 {
  "name": "Virginia Hylton Park",
  "address": "111 Maiden Ln, Lexington, SC 29072, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/67e56480-932f-11ea-bced-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "walking",
   "unique",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1353881265491534470",
  "source": "GoogleMaps",
  "reviews": [
   "Our First time here & it's an amazing park. One of Lexington County's hidden gems. Beautiful park layout with lots of shade. Very clean with lots of benches and tables with covered tops. Very safe and secure children's paradise tucked behind the Lexington Municipal building. Very clean restrooms with water fountain. Highly recommend to all parents.",
   "Beautiful park that also has swing sets and a playground for both children and children with special needs. Part of the park is being redone to make it even better. Flower galore! Many paths and gazebos. Benches for resting. Little waterfalls and rivers. Cute, quaint, and a nice place to take little ones or just contemplate.",
   "Park is great for kids, it's behind a police station so I assume it's safe, I chopped off 1 star due to the ground being very unstable on one side alot of roots and drop offs, the equipment could use a little upgrading but kids enjoy it you just have to watch them, obviously. It's fully handicap accessible and the view is nice, been there many times never had a bad one.. at the park that is!",
   "We go to the park often and we love it for a walking exercise. However the walking trail is in need of repair as roots from trees have formed large cracks in the walk path. Be careful especially with little ones.",
   "This park is beautiful and unique! There are two play structures and plenty of swings for all ages go children. I love how it’s tight in the middle of downtown yet with all the trees it feels like a little oasis. The police station is right by the parking lot which provides and additional peace of mind. I have kids ranging in ages from 12-2 and they all enjoy what Virginia Hylyon has to offer. This is the best park in the area by far!"
  ]
 },
 {
  "name": "Bomb Island",
  "address": "Lexington, SC 29072, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6851bb06-932f-11ea-b05e-14b31f159f22.png",
  "tags": [
   "unique",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=14622257167894964723",
  "source": "GoogleMaps",
  "reviews": [
   "The Purple Martin migration is amazing to experience and as a bonus enjoy some of the most beautiful sunsets you’ll ever see",
   "I love lake Murray. Best recreational lake I've ever put my house boat in !! Love watching the birds on bomb island . Always drop anchor close and admire.",
   "The purple Martins are an awesome sunset site to see! Mother nature is incredible! Do not miss the beautiful sunset and unique experience if the Purple Martins!",
   "Definitely a must see when on Lake Murray.",
   "Beautiful place to see purple Martins."
  ]
 },
 {
  "name": "North Springs Park",
  "address": "1320 Clemson Rd, Columbia, SC 29229, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/689ad226-932f-11ea-9189-14b31f159f22.png",
  "tags": [
   "field"
  ],
  "link": "https://maps.google.com/?cid=7948486822538547290",
  "source": "GoogleMaps",
  "reviews": [
   "Nice community center.  Modern and open plan.  Clean restrooms.  Open play ground.",
   "Very poor attitude of people need some Christmas spirit peoples very clean in the areas of the gym",
   "They have a basketball court that is never open because the community obviously doesn’t need a court. Oh and if you bring a backpack with basketball shoes in it expect to have to go all the way back home to drop off your backpack cause black people cant bring bags in.",
   "I went to see PCW for the first time and I had a blast! Great price for ring side seats. Awesome entertainment. Very pleased. I'll most definitely be back for other events.",
   "Decent park with a playground, two baseball fields, and a soccer field"
  ]
 },
 {
  "name": "Dreher Island State Park",
  "address": "3677 State Park Rd, Prosperity, SC 29127, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/68dd1b68-932f-11ea-8df3-14b31f159f22.png",
  "tags": [
   "kids",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10096220897923917036",
  "source": "GoogleMaps",
  "reviews": [
   "Great view",
   "Our favorite getaway for a picnic, camping, fishing.",
   "Just a great place to visit, but there is a couple of things I think they could improve here though. Adding a few more ramps and adding some more docking area around the ramps. To say this is suppose to be Murray's mega landing for big tournaments, it's kinda disappointing.",
   "Cool outing for a weekend. With Villas, boating, trailing it gives a good option for a small group, a large group or even for a single person to lay down, relax or fish or swim- you decide the way for your fun. The entry fee is just $2 per adult and free for kids.",
   "Had a great family reunion and the place is very well kept"
  ]
 },
 {
  "name": "Riverfront Park Amphitheater",
  "address": "Three Rivers Greenway, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/693651ca-932f-11ea-9ccc-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "walking",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=129620302349552958",
  "source": "GoogleMaps",
  "reviews": [
   "Great trail along the canal to run or ride your bike. It goes on a good few miles and is a nice place to exercise or walk.",
   "Great place for walk, nice view and people run or walking with dogs. Is very peaceful.",
   "Excellent trail to walk and exercise. \nIt has a open gym.\nPublic restrooms available.\nFree parking.",
   "Nice stroll or bike along a flat paved trail along the river.",
   "Nice park. Good place to bike or bring your dog. Has a few PokeStops if that's what you're looking for. "
  ]
 },
 {
  "name": "Historic Columbia Foundation",
  "address": "1601 Richland St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/698fe468-932f-11ea-bace-14b31f159f22.png",
  "tags": [
   "historic",
   "historic",
   "food",
   "knowledgeable",
   "historic",
   "history",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=3010527376952651032",
  "source": "GoogleMaps",
  "reviews": [
   "The Seibels House is a beautiful historic home and the christmas party was a great event to have there.",
   "This hard working group has preserved historic buildings for Columbia's citizens to enjoy. Their tours are fantastic. They stepped up and prevented our iconic landmarks from being razed when no one else would!",
   "We went to the candle light Christmas  evening  event it was a let down it was supposed  to be how people  of columbia   celebrate  Christmas  but most of the decorations  were plastic  most of the tour guides were not as knowledgeable  ha some would think  Hampton Preston home  -Robert Mills plastic reefs on the front doors it was a chaotic  experience  the horse and buggy ride we paid for was around the block in a wagon drawn by  mules or donkeys veey short and uncomfortable  ride  soaking wet seats so we went on the tour with wet pants the staff was in running  at the last minute unprepared .they did have a choir that really sound good while we should out in the rain waiting what seemed like a long time to finely  get in only to get only one Christmas  Carol when we did get in the house no one would take the time to tell where to go or what to do then the rushed us through the house it was over before it started it seemed I will say that one tour guide did do a great job was very knowledgeable Rose Mary she is English sad a brit knows more about the history  of  our land marks then the rest of the.lical tour guides who didn't seem to know anything only rushed us through  and where not  very friendly my advise for next year to the poor folks that were there with us is save your 50.00 dollars next year and go across the river to the Lexington museum  were the Christmas event is free long lasting friendly  in coustum  guides and plenty of free food and refreshments with real demonstrations of how it was in those days lit fire places blacksmith  and even enslaved people working in the kitchen columbia  historic said there would be hot chocolate  we saw none",
   "I went to the Mann-Simons House. It was an awesome experience and the museum was incredibly well kept.",
   "Peaceful"
  ]
 },
 {
  "name": "Cola's Restaurant",
  "address": "1215 Assembly St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/69d7a60c-932f-11ea-9d35-14b31f159f22.png",
  "tags": [
   "food",
   "free",
   "food",
   "unique",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=8952443505511312301",
  "source": "GoogleMaps",
  "reviews": [
   "Best food ever! Everything tasted fresh! My office had our Christmas party here, and we had 2 great waitstaff. They were on top of everything!! So professional!",
   "This restaurant was great. It was my first time there. I was celebrating a birthday. My meal was AMAZING. I got the pan seared salmon. With double vegies. I told them to hold the risotto. Midway through the meal someone hit a transformer and all the lights went out on the whole block. We ended up eating in the dark. I would have given this restaurant 5 stars because they could have compensated us with like a free dessert on the next visit or 10% off of our meal. It was not there fault but we where ear eating in the dark. They did provide tea lit candles but they did not provide much lighting. So for that reason they get a 3 star.",
   "Love this spot and it’s usually really easy to get a reservation on a Friday night. I usually get the BBQ pulled porked egg rolls for an app, and the roasted chicken for the entree. The food never misses the mark. I visited last night for dinner and our waitress was less than attentive and the food took forever to come out. We continuously had to request things like bread and refills that other tables seemed to get with no issue.",
   "Set your reservations and be prepared to be amazed. The menu is unique,  the service is fantastic. The cuisine is something I've never experienced before, I had herbed grits and beef spare ribs the first visit. When I heard the two in the same sentence,  it kind of threw me off...but guys, it was absolutely amazing. My second visit was just as superb as the first, never ceasing to amaze.  This place ranks very high with me.",
   "Super service, great ambience, fantastic sweet tea. Shrimp Savannah, fresh bread, poached pear salad wonderful. Not impressed by braised beef or fish almondine. Vanilla bean ice cream delicious. Very pricey, not quite worth it at that price point, but still a very good meal."
  ]
 },
 {
  "name": "Saluda's Restaurant",
  "address": "751 Saluda Ave, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a21ab9e-932f-11ea-bfae-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5214153063177084582",
  "source": "GoogleMaps",
  "reviews": [
   "I was passing through SC for a special event and Saluda was a wonderful Cap to the night. Fine dining meets Southern Comfort with a charm that will whisk you away. The appetizers were delightfully original. I was in love with the Shrimp and Grits because the dish is packed with more surprises and flavor then the name suggests. Lastly, the red wine velvet cake was to die for. YOU MUST DINE HERE!",
   "Delicious!! But very expensive. Definitely a special treat place. I had the fish of the day and it was probably the best fish I've ever had. My boyfriend loved the pork chop. The sweet potato hash and Brussel sprouts AMAZING and the pumpkin cheesecake HEAVENLY",
   "Wonderful evening. Wonderful space. Wonderful service. Wonderful food. On an unexpectedly busy mid-week evening, we were treated to great service and great food. I had the pork chop. She (a vegetarian) had the stuffed acorn squash. Both cooked and presented expertly. Strong wine list to complement our food.",
   "Booked a table for busy parents weekend far in advance and then needed to change the time AND number of guests. They were great! Let me add 3 people and change our time. Food was excellent. Everyone ordered something different and everyone raved about their dinner. I had shrimp and grits were the best he’s ever had (sorry, Bobby Flay) and daughter’s steak was perfectly cooked. Waitress recommended the steak special (can’t remember the exact name) and everyone who ordered it loved the choice. I would definitely go back on next visit to Columbia.",
   "Great food, great service. Very accommodating to allergies. Excellent wine selection, good beer selection, and nice atmosphere."
  ]
 },
 {
  "name": "Midwood Smokehouse",
  "address": "702 Cross Hill Rd 400 D, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6a649dd0-932f-11ea-9f76-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11928198877793242190",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious, smoked BBQ! When you can smell it cooking outside, you know it's gotta be good inside! Loved the brisket and love they allow you to choose what pieces you like and how well it's cooked. Wait staff was friendly, very accommodating, and shared info on their different house made sauces and allowed me to try each! Will definitely go again! Food was good, wait was short for a Saturday night. My extended family and I all loved the dishes. The cornbread is a must!",
   "Long wait times with no real area to wait is my only real issue... the food is consistently fantastic and the burnt ends are some of the best I have had in SC... this is a good place",
   "The food comes out fast here! Fast but still hot and good. They do a lot of take out because people kept coming to pickup food and I don't blame them because it's GOOD! Great flavor and good portions. I had the small Carolina Pork plate with Hash & Rice as the side kick to the pork. Hush puppies and some cucumber, onion, and jalapeño pepper slaw thingy (trust me this thingy tastes great!). I inhaled all of this down real fast because I was hungry and not greedy. Oh I can't forget the service. Great service with a side of smiles. The draft beer is fresh clean, cold and refreshing. I hate getting draft beer from some places and it has a sour taste! Not here... It's good. Well that's about it... About it for this review but not for the food. I ordered some smoked & crispy wings to go. Again because I'm hungry and NOT greedy...",
   "It here on our road trip back from Florida to Canada. Definitely glad we made the stop because the food was amazing and the mac and cheese was even better! My boyfriend and I had the pig out which was more than enough food for the both of us. I would stop in if you're looking for a good barbecue🙂",
   "A solid BBQ place.  Good food, good prices.  I've been there for weekend and weekday lunches. The service and food was the same for both; definitely a place that can turn tables with a crowd. The bacon wrapped jalapenos were some of the best I've ever had.  The menu doesn't have nutrition information, but you can still make some smart choices -- and if that's not your thing, you can certainly go unhealthy!  Overall a solid choice."
  ]
 },
 {
  "name": "Menkoi Ramen House",
  "address": "1004 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6aaf67dc-932f-11ea-995c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2150198992722277918",
  "source": "GoogleMaps",
  "reviews": [
   "Attn: Owner(s)~ I just wanted to give a HUGE shout out to your sweet, kind, efficient and genius of an employee from this past Saturday night. How does he do it? Super powers? I think so!! He remembers where everyone is seated while calmly taking orders for people with a line out the door. Mesmerizing!! He deserves a huge raise or cut of the pie.. so to speak. lol!",
   "BEST NOODS YOU'LL FIND THIS SIDE OF TEXAS 🤤🤤🤤 My husband and I have weekly dates at Menkoi and today was no different!  So happy they were still open for pickup orders!  Quick and easy and as delicious as always!",
   "First time here was great!! I loved it. Food was great. I saw a lot of reviews recommending the Spicy Ramen & it was so good. Customer was also amazing!! Definitely coming back!",
   "This place is great and still offering to-go food during the issues we are having. The Spicy Ramen has been my favorite for some time. Customer service is also top notch!",
   "This spot is my favored. I go to plenty of restaurants but to this one I go the most. The stuff is very friendly and the cuisine they cook is so good. I am always happy to have a nice dinner in this place. I recommend this place with pleasure."
  ]
 },
 {
  "name": "Pearlz Oyster Bar",
  "address": "936 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6af598ba-932f-11ea-820d-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "knowledgeable",
   "music"
  ],
  "link": "https://maps.google.com/?cid=15313124818391716128",
  "source": "GoogleMaps",
  "reviews": [
   "This place had a great environment. It gave me a sports bar and grill feel.  And of course I was there for the oysters. I am certainly not a fan of oysters but if I were, I can imagine I would have enjoyed these. The prices were in between expensive and cheap so there was something for everyone's. I will visit again.",
   "I was very surprised by how much I enjoyed the food here. We had 10 dishes and all were amazing. Then I just had to waddle next door for dessert too. Well done Pearlz.",
   "WOW...Food and staff were fabulous! Wife & I ordered several items off the Happy Hour Menu (until 7:00). We will definitely be back. Little bit of a drive for us but we'll make an exception.",
   "Enjoyed a wonderful dinner today at Pearlz. We came in right after 4 on a Friday with no wait and were seated immediately. We were met with a kind and knowledgeable waitress who recommended the Crab Dip appetizer which was full of flavor and by itself a respectable portion. After ordering the Shrimp and Grits by the waitresses recommendation I was greater by a beautifully presented plate with creamy filling grits and flavorful breaded shrimp that gave a nice crunch to the dish. The music selection was good and the lowlight setting gave the place a tasteful ambiance. I look forward to coming again to this great restaurant",
   "Awesome oysters! Very friendly and helpful staff. Connected dessert parlor. Not too busy in the afternoon to pop in for a snack."
  ]
 },
 {
  "name": "Oyster Bar Columbia",
  "address": "1123 Park St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b38bc88-932f-11ea-8054-14b31f159f22.png",
  "tags": [
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2087372014013843618",
  "source": "GoogleMaps",
  "reviews": [
   "First time here and was quite impressed! Guys shocked oysters pretty quick and we had no issues with little shell pieces left behind in our oysters! Highly recommend their oyster shooters! We will definitely be returning!",
   "Me and my wife have been coming here for over 10 years. Unpretentious, just good oysters at a good price. The other stuff on the menu is good too, but come for the oysters and watch them shuck them fresh in front of you. Always tip your shucker!!",
   "The crab was delicious. Their clam chowder was amazing. Would recommend 5/5. You can just chill at the bar while waiting on tables.",
   "1st time here. All the seafood is steamed. Modelo's but no Red Stripe 😥.... This was a pretty cool spot! Will definitely be back!",
   "I went here after hours Saturday. Pretty cool night life with great drinks. Very diverse crowd."
  ]
 },
 {
  "name": "Hampton Street Vineyard",
  "address": "1207 Hampton St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6b763ad8-932f-11ea-866e-14b31f159f22.png",
  "tags": [
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=3377275742711961653",
  "source": "GoogleMaps",
  "reviews": [
   "Sweet potato coconut milk soup was amazing! Lunch dish I had was the salmon with rice noodles. It was a little too sweet for my taste, but not bad.",
   "Enjoyed a wonderful dinner last Friday Nov 1. Stephen/Steven, was our waiter and did and excellent job. Our last visit wasn't the best so we decided to give them another shot and they did not disappoint. The dusted Oysters app was superb, followed by a great soup and then we split the special Halibut. Incredible dinner and excellent service. Glad to know we will be back as this is one of our favorite restaurants in Columbia.",
   "The atmosphere is super chill. Very simple yet sophisticated. The food was fantastic. The service is excellent. Thoroughly enjoyed it.",
   "Too often will restaurants treat to-go lunch salads too lightly. Pun intended, no one likes 95% lettuce and 5% toppings. You know the salad I'm talking about, where the toppings are scantily scattered over a thick forest beneath. This place did no such thing. The salad included an ample amount of almonds, blue cheese, and strawberries. In fact, they could've added too many strawberries, or included the ones with yucky bruises or fibrous green stems, but instead they included just enough perfectly cut red treasures to conserve appreciation for each bite that included one. The Atlantic salmon filet on top was crispy and cooked medium rare. Phenomenal salad. No wonder it cost $18! For context, in Columbia, SC, an $18 salad is exorbitant.",
   "Great place to eat lunch or Dinner, today I had the Tuna dish, so fresh and tasty! Loved it"
  ]
 },
 {
  "name": "The Southern Belly BBQ",
  "address": "819 Harden St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6bb7b12e-932f-11ea-a18d-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=13930418039085098095",
  "source": "GoogleMaps",
  "reviews": [
   "We saw Southern Belly BBQ on Yelp on our way back home from Asheville,  NC. Great BBQ, liked by the entire family! I had the signature sauce traditional sandwich. I ordered the pork on the side for my daughters grilled cheese. My son lived the Southern Belly.",
   "Simply Breathtaking. Took several days to gather myself after having a lunch here. Fantastic, authentic, BBQ food. EXPLOSIVE sauces. Fries curled to perfection. Did I mention the sauces? This place is a must visit if in Columbia.",
   "Amazing food! Delicious bread to go with that meat! Not alot of fat at all. Higher price for better quality anyday.",
   "Awesome place. Must check it out. Order your sandwich and then choose the sauce. Be ready! You’ll need a nap afterward:)",
   "Extremely disappointed!! So I've dined at this establishment for lunch on a few occasions in the past, with no problems whatsoever! Until recently, when me and a coworker went there for lunch (Thursday). Well, the next day (Friday) when I checked my bank account (I tend to do this on a daily basis with the risk of fraud being so high), I noticed that my card was charged twice for lunch. So basically, I was being charged two payments of $15.75 for lunch. No big deal....I figured the waitress accidentally swiped my card twice without realizing it, because my coworker and I told her that we were paying separately and we both had our own individual bills that we paid with our cards. Well, when I contacted the establishment the next day (Friday), I was told by a young lady that I will receive a refund for the additional amount, and to expect a call from the manager once the refund has been processed. To my surprise, I never received a call from the manager or anyone. So on Monday, I contacted the establishment again and asked to speak to the manager. The manager was the person that actually answered the phone, and when I explained to him what had happened and that I was waiting on his call, of course, the manager didn't have a clue what I was talking about!!! He seemed very friendly and was very apologetic. He told me that he would process my refund immediately, and call me back the minute it was done. NO CALL WAS MADE!!! I called again on Tuesday and left a message for the manager, because he was not there when I called, and here it is on Wednesday, and I still have not heard from the manager or anyone!!! This screams POOR MANAGEMENT!!! The last thing you want your establishment to portray is that you knowingly take STEAL money from your customers, and that you don't even have the decency to reach out and resolve the issue...POOR MANAGEMENT SKILLS!!! I will NEVER eat at Southernbelly BBQ on Harden St. EVER AGAIN!!! My advise to anyone that dines at this establishment, is to pay with cash and if you pay with a debit/credit card, be sure to check your bank account after dining here!!!!"
  ]
 },
 {
  "name": "Rioz Brazilian Steakhouse",
  "address": "410 Columbiana Dr, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6bff8f88-932f-11ea-8a61-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "learn",
   "drink",
   "hospitable",
   "food",
   "kids",
   "family",
   "eat",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4323104992892477684",
  "source": "GoogleMaps",
  "reviews": [
   "Last night was my first night here and I was celebrating my girlfriends birthday. I wasn't prepared for what was about to happen. They give you a circular card one side is green and the other is red. Green means you want food to keep coming to your table and red obviously means stop. I kid you not literally every other minute there was someone coming around with different meats to try. The steaks were delicious. The inside is extremely nice and gives you a luxurious feel to it. It makes you feel important. If you love to eat this is the place for you. I was stuffed within the first 10 minutes. I will be coming back. This time I am prepared. Best place I've eaten at in a long time. Extremely friendly staff as well.",
   "The food was absolutely wonderful. I'm giving this place 4 stars because the customer service could've been a lot better. My server only came to the table twice: To give me my drink, and then to give me my check. I didn't receive a refill on my drink, and she didn't check in to see if everything was okay. It's seems like the only person who was very welcoming and concerned about my stay was the manager. He was warm and hospitable to all the guests. The rest of the employees need to learn about quality customer service.",
   "Stopped by with the wife and kids last night and I must say I had a wonderful experience. Great atmosphere, we had more than our fill and were never left with an empty plate! The manager stopped by to check on our experience and we assured her this will be a frequent stop for our family from now on! 10/10 recommend!",
   "Pretty sure our server was Steve from Stranger Things. Regardless,  he was awesome. The meat! So much meat! Meat coming from every direction. I felt like Piper Perri.The beef rib is a must try. Everything was spectacular.  Left with a serious meat drunk. This place could convert the most devout vegan. When you're in Columbia go get your meat eat on.",
   "Love Love Love, We have all our family celebration dinners here. The wait staff is great. The variety of meats is awesome, the cold salad bar is great. And the hot stuff they have at the bar is always good. They have a bar and have great mix drinks that they prepare at your table. As well as a variety of desserts. The wait to be seated can sometimes be long, especially if they have a promotion going on."
  ]
 },
 {
  "name": "Blue Marlin",
  "address": "1200 Lincoln St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6c5fff5e-932f-11ea-a387-14b31f159f22.png",
  "tags": [
   "food",
   "walking",
   "drink",
   "food",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5768715148537404067",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding food and atmosphere. Lively and very posh looking. Easy walking distance to hotels and other venues. The food is absolutely amazing. There is nothing in the menu that can’t be enjoyed. Recommend the Salmon Pontchartrain! Filling, tasty and very appetizing. Lo Country Shrimp and Grits is also amazing. Tasty and the grits are out of this world! Deserts are also worth a try if you have the room. They will be a sweet ending to a great night! Give this place a try if you are looking for something new tonight!",
   "Food was good, however my wife ordered seared scallops which very too salty, but were redone without a problem, they were cooked well. She crab soup was very good.  Flounder and salad were good. Bread was a hard roll reminding me of a German bakery. No charge for coffee or soft drink. Service good and friendly",
   "This was my first and DEFINITELY NOT THE LAST time visiting this spot. I was overwhelmed by the tastiness of this restaurant. The vibe was intimate and welcoming, as well as relaxing. The food was amazing. Flavorful and fulfilling. My only regret is not having another serving of the shrimp and grits. Hands down THE BEST shrimp and grits i've tasted ever!!!. Being a photographer, I definitely made sure I captured a few shots of my dining experience!",
   "The food was good, not great.\nHowever, this is take out and dining in may offer a better dining experience.\nAlso, I didn't order seafood so the potential for the restaurant is high. Will return to dine in when able.",
   "This seafood place normally has rave reviews and is recommended as one of the places to visit in Columbia.  I was disappointed.  We had a fair sized group of 11.  They informed us that they could not seat 11.  They broke us up into 3 groups.  During the entire time they kept multiple tables open in the middle of the restaurant.  As we were leaving they pulled the tables together and sat a party larger than us.  The most disappointing part was that they required a gratuity for a party even though we were broke into 3 groups with separate wait staff.  The food was average at best.  I will give them credit for large amounts of food.  More than I could eat.  I had the firecracker flounder.  The sides of grits and slaw had better flavor than the fish.  The fish was bland and over fried.  It definitely needed the side of salsa for flavor.  The rest of the party at my table had similar experiences."
  ]
 },
 {
  "name": "Julia's German Stammtisch",
  "address": "120 Sparkleberry Crossing Rd, Columbia, SC 29229, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ca62b26-932f-11ea-99a7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "free",
   "foodie",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=202555016542569769",
  "source": "GoogleMaps",
  "reviews": [
   "Everyone was extremely nice. Super flavorful.  Definitely let you try the German experience. Honestly will never forget. The owner an inspiration for the menu was present and they definitely want you to understand the culture and their flavors. I will be back. Love it",
   "The best taste of Germany outside of Germany itself. I had the Jager schnitzel that was perfectly crispy and covered in delicious gravy. Do yourself a favor and grab dessert, if you have room, because the apple strudel is out of this world! Can't wait to come back again!",
   "Julia's location is great, as in the decorative sense.  The feeling you get stepping past the doorway is a teleportation to Deutschland!  The Bar area is welcoming and covered with wonderful Bohemian and Bavarian beer!  Nothing to complain on that department.   Now the food... I was not impressed with the food provided at Julia's, but I blame it on the fact that I lived in Germany for 8 years. Now, if you are not familiar with the German cuisine give it a try, you will enjoy this food and all the Bier!",
   "I lived in Germany for many yrs, so I finally decided to try Julia's for the first time. They have a new location, which is a nicer and bigger facility. Plenty of parking all around, easy to find once you come off the interstate. Its locate on the Northeast side of town in Columbia, SC.  It was recommended by a few people that I work and some locals.\n\nThey have a full bar and lots of seating inside, very welcoming place. I did a to go order and waited at the bar. They give you a free complimentary drink while you wait on your order. They were very busy the night I went. They give you huge servings that two people can share. The jager schnitzel was flat, dry, and burnt, gravy didn't have much of a flavor. The salad was good with the red beets. I really wanted to enjoy this place, maybe I will try again and have a different dish. It could be the chef was having a off day. \n\nI would recommend that everyone at least try once, especially if you have never had the German foodie experience. It just didn't do it for me.",
   "We LOVED this place. My son served a church mission in Germany and loves the food so it was fun to eat the authentic stuff. One cool thing that happened while we were there is that because my son was dressed in his blues, a stranger paid for our dinner. Wow!"
  ]
 },
 {
  "name": "A Peace of Soul Vegan Kitchen",
  "address": "2338 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6cecf84a-932f-11ea-8627-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "eat",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16387736963076152727",
  "source": "GoogleMaps",
  "reviews": [
   "A Peace of Soul Vegan Kitchen is ranked in the, \"Top 20 Vegan Eats Coast-to-Coast,\" by Food Network, and every dish I've EVER ordered there proves why! The owner, Folami, is super sweet and deserving and a true culinary visionary—I'm amazed at how she's able to transform so many southern comfort favorites into healthier, plant-based delicacies that are packed with flavor. Even my meat-eater friends love it! The newly renovated space and food truck (now on hiatus) really reflect the goodness of the food AND the people. This is HANDS-DOWN my favorite place to dine!",
   "I'm originally from Columbia South Carolina and moved away and now I am vegan so I decided to look up vegan restaurants in my city where I'm from. I found this restaurant and was very pleased the customer service was great, the food was awesome, it was a great overall experience. When I go to visit the home now I will definitely come to visit this place for their delicious food!!!!!!",
   "I had the \"chicken\" sandwich,  mac-n-\"cheese\" and curry potatoes. \n\nLet's me start by saying that I do not eat sides with my sandwiches,  let alone mac-n-cheese with it. \n\nSecondly,  I am a cafe, therefore my palate is very sensitive and I taste EVERYTHING when I eat. \n\nEverything,  I mean, absolutely everything was amazing. I have been vegan/plant based, for roughly 2 months, I lost count and I wanted to return for another order and I wasn't even 25% finished with this order. \n\nCongratulations on your restaurant and it's amazing success, so far. The restaurant business is no joke, let alone bringing something so uniquely different to the area.",
   "The Mac n Cheese is really good but the bacon cheese burger was pretty disappointing, it's a huge patty but it's dry and falls apart easily, it also tastes more like sausage. The vegan bacon is disturbingly chewy, would not recommend it, but I'll definitely go back to try their other stuff tho.",
   "The \"chicken\" sandwich was amazing. The macaroni and cheese is pretty good too. My first time having vegan macaroni but I would eat it again. It's a little pricey but no more so than if you went to texas roadhouse or smashburger. It's good food and well worth the money."
  ]
 },
 {
  "name": "929 Kitchen & Bar",
  "address": "929 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d312d9a-932f-11ea-88c4-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11909334410252851950",
  "source": "GoogleMaps",
  "reviews": [
   "Gorgeous restaurant in the vista, wonderful ambience and decor. Food was very good and the drinks in pouches are definitely worth a try. I believe they were some sort of speciality juice on the menu. Only caveat would be the menu selection is a little limited. I understand they would probably want to focus on doing a few dishes well, but maybe some weekly or daily specials. A little variety and this place would be the stuff of legend.",
   "The ambiance is refreshingly cosmopolitan yet down-home.  Food is delicious and taste very authentic! You can see in the clips it’s suitable for older children.  Luv luv luv the ice cubes. Definitely a date location.",
   "I took my wife here for her birthday this past weekend, and we were not disappointed!  The drinks were great, as well as the food!  The ambience was nice.  I wished that I was given the option for the way my egg was cooked on my bibimbap, as I would have liked it runny, but other than that, everything was amazing!",
   "Stopped by for dinner to celebrate our anniversary. The food was delicious and the service was amazing.\n\nModern twist on traditional Korean dishes. My wife and I ordered two appetizers and main dishes, and shared everything. I wish we could have tried the dessert, but we were too full.\n\nHighly recommend you visit for something tasty.",
   "Hands down one of the best restaurants in Columbia. Even if you haven't tried Korean food you will love this place. I have been visiting Columbia for almost two weeks now and I have eaten at this restaurant at least five times if not more. The first night I ordered delivery on bitesquad. Everything came packed separate and was piping hot. Since then I've gone in for lunch and dinner trying different dishes and everything is utterly fantastic. They also have a small but well-stocked bar and plenty of beer selections as well. Don't miss this place it's a gem."
  ]
 },
 {
  "name": "DiPrato's",
  "address": "342 Pickens St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6d771048-932f-11ea-a2db-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food",
   "delicious",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=12785225994969756812",
  "source": "GoogleMaps",
  "reviews": [
   "I decided to try it for the first time. I liked it. I love how all of the beverages come in factory sealed packaging. Eliminates the issue of having flat beverages. The food was prepared quickly, yet accurately. I had the pastrami on pumpernickel. The dessert selection was pretty unique. I ordered a slice of Coconut Cake. I may return in the future.",
   "This place was amazing. Great food, atmosphere and great service. The server told us about all kinds of different sandwiches the way she likes them. Was very informative. Tomato bisque was awesome and the cheescake was the best I have had in a while.",
   "This place is really good! The prices are a little high but the quality of food is great. Only reason I rated them a 4 instead of 5 star is because the chicken on my husband's sandwich was very dry. Tasted a little bland but we let our server know and she apologized asking if we wanted to speak to a manager. But we just wanted her to let the kitchen know. It tasted like they precooked then cooked it again to warm it up. I was happy with my sandwich. I got the croissant breakfast sandwich, which my husband was drooling over! We will definitely be back to try something new!",
   "Always charming & delicious! A great place to meet up for business, lunch date, girlfriend's outing, or takeout. Terrific menu selection, everything always tastes fresh, and the staff is super nice. Try and get there before noon. Lunch is usually packed. But if you can't, it's still worth the wait. Remember, they're only open for lunch.",
   "Their pita chips are to die for.  The service was friendly and fast even during a busy time of the day.  I got their Cobb salad which was delicious.  The bacon crumbles were fresh and think.  Would come here again."
  ]
 },
 {
  "name": "Lizard's Thicket Restaurant",
  "address": "818 Elmwood Ave, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6dbd1a2c-932f-11ea-b2c1-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "eat",
   "delicious",
   "family",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8638698370159630580",
  "source": "GoogleMaps",
  "reviews": [
   "I love Lizard Thicket's. The atmosphere of the restaurant is that of a warm and caring family, I've been coming to the restaurant for about 10 years, I came up from Florida in 2010 and what of my pastors and his family took me there for my first time, and since then, that's how I've always been treated at Lizard Thicket's. Also, food is very good, for country cooking it's really spot-on and the cleanliness of the restaurant is more than impressive. And I'll end with this the restrooms always clean. So with all that said, I will keep coming back to Lizard Thicket's for as long as I'm alive.",
   "Always a welcoming location. Drive-thru is usually busy in the mornings, but always a table available inside. Meal is quickly made so my time inside is short. The service is quick and friendly, so that I don't have to wait a long time to eat in the morning. Love the Liver Pudding.",
   "Great location and atmosphere. Our service was great,but the chicken sandwich was not cooked to taste. The fried chicken breast was not cooked to taste . They both were under and over cook. I didn't expect your chicken sandwich to be just a hunk of grilled  breast meat (filet) or (Pull)or a chicken tender style and it didn't come with a side. See this was our 1st time. We got our sweet tea to go which by the way was very good tea also to go boxes for our chicken that would we recook some and season it  our way at home after all it was to much chicken to be thrown away if it was prepared right.",
   "There were lots of items to choose from on the menu. I opted for a dinner plate with a meat and two vegetables. It was delicious! My whole family enjoyed the food. The service was very good. There was a calm, quiet vibe in the restaurant and I liked that, too.",
   "I'm from PA and I was in south Carolina couple of years ago and my family and I stopped for dinner. The food was so amazing and fresh.  I so would drive the 12 hours just for lizards Thicket. I wish they would build one here in PA.."
  ]
 },
 {
  "name": "Tazza Kitchen Trenholm Plaza",
  "address": "TRENHOLM PLAZA, 4840 Forest Dr #20, Columbia, SC 29206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e05bc12-932f-11ea-a675-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14870754711066007696",
  "source": "GoogleMaps",
  "reviews": [
   "Every time someone offers up a suggestion of Tazza for brunch or dinner I emphatically say or think....\"YES!\". For a, smaller regional, chain they go out of their way to specialize and individualize themselves to feel like they're only a local Columbia restaurant (granted they are the only location in SC). I have honestly never had reason to complain about a single meal from any angle: food quality, drinks (great cocktails!), and service they do a wonderful job. It is tough to recommend only one or two things but I would absolutey suggest the spicy sausage and black pepper honey pizza and the cheeseburger (dijonnaise is incredible).",
   "What a fantastic little restaurant. The ambiance is very nice and the service is great. I had the spicy Italian sausage and peppered honey pizza two days in a row... it's that tasty!  The butternut squash soup is also really good. I will definitely return next time I'm in town.",
   "The food was fresh and had great flavor. I ordered the brisket tacos and they were delicious.  My husband and daughter ordered their own wood fired pizzas so I snuck a bite of each.  They were amazing, and the presentation was perfect.  The server was very attentive and accommodating to our requests.  I highly recommend this restaurant, and we will be returning again.",
   "Fantastic food. Went for brunch about 10 min after they opened and place was already packed so that's a great sign. Super friendly and fast service. Had to wait over 30 min for food but it's so worth it because you can for sure taste how fresh everything is. Drinks not the greatest but the food makes up for it. Prices are a little high but you get what you pay for. Cant wait to go back!",
   "Great service, atmosphere, and cocktails. However, the food left much to be desired. Ordered the cast iron goat cheese (amazing!), a pizza, and my significant other ordered a pasta dish (can’t remember exactly what it was). Overall, the food was just okay. The pizza was a bit burnt, which I normally don’t mind, but it was lacking flavor which exacerbated the taste of the burnt crust. The pasta was just okay, did not taste authentic or of restaurant quality. I would definitely like to give Tazza another try since everyone I know absolutely raves about this place, but maybe try some other items on the menu."
  ]
 },
 {
  "name": "Solstice Kitchen & Wine Bar",
  "address": "841-4 Sparkleberry Ln, Columbia, SC 29229, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e52cae6-932f-11ea-844f-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "eat",
   "food",
   "food",
   "delicious",
   "cheap",
   "kids",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6295978493848609629",
  "source": "GoogleMaps",
  "reviews": [
   "A lovely diner evening, and enjoyable experience. Great, well balanced menu from which I would highly recommend The brussels sprouts as a starter. For a main I had The bronzed Atlantic Salmon which was delicious. The service was fantastic. Our server was very knowledgeable about the menu, very attentive to our table, and very friendly. Interior of the dinning area is very well laid out and makes for a very welcoming environment. Would love to eat here again.",
   "Service was great and everything we ate was amazing! Highly recommend the fried oysters! The food was SO good! The restaurant itself is a little small, so you don't get a ton of privacy, but it made for a wonderful dinner for my wife and I. We will definitely be returning! Keep up the great work guys! 👍",
   "Great place for a dinner for two. The service is fast and friendly. The food was exactly as ordered. It has a nice sized bar with a large selection of drinks. Definitely will be back.",
   "The meal was excellent, I mean absolutely delicious. The price was reasonable for the quality, 25-50 per person (50 with adult beverages and desert). The average age of the crowd was 40-60. Definitely not the place for kids or a cheap date. Fabulous for a small group of up-classed adults or intimate dinner. Dress ranges from very nice to relaxed but not too relaxed.",
   "A gem of a restaurant in Columbia. You need reservations here. The food is local and delicious and changes with the seasons. Great ambiance, great service, fantastic cocktails and wine list."
  ]
 },
 {
  "name": "Jason's Deli",
  "address": "823 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6e9dddda-932f-11ea-b6cb-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4154326229314121322",
  "source": "GoogleMaps",
  "reviews": [
   "My first time in a Jason's Deli.  I knew I wanted a salad so a quick search for that and Jason's popped up.  Thank you Will for showing me what you have to offer, where to go to order and for being over all helpful and nice.  The salad bar is great, everything is fresh and crisp! I also had the Irish potato soup, wow! I wish we had a Jason's Deli in Orangeburg!!!",
   "My brother and his wife had bragged on the Jason's Deli in Athens, GA for a while, so when we met up in Columbia, SC, they recommended lunch there. My only problem was finding parking close enough for my feeble self to be able to walk in with my walker rather than have to have help with a wheelchair. But with it's downtown location, mostly metered parking and my lack of knowledge of the area, I think we managed fairly well. Upon walking in we were greeted by genuinely very friendly staff members. They explained the menu, made some recommendations, and I still wanted to try everything. So many sandwiches, baked potatoes, soups and combos to shower from! Although I had planned on the wonderful salad bar I had heard so much about, I went with half a grilled veggie sandwich, fruit, and cup of seasonal lobster chowder (so good). My mom chose a half club sandwich with chips and a cup of broccoli cheese soup. They had so many good soups on the menu it was difficult to choose one. I'm still thinking about the descriptions of the Irish potato soup and the chicken chili and wishing I could get back there to try them. By the way, complimentary soft serve ice cream is included with the salad bar. How cool is that? Their pastry/dessert selection looked amazing, but we didn't splurge at the time. Great lunch spot, I highly recommend giving them a try.",
   "Under new management. Really appreciate the new manager taking the time to come face to face with the customers to make a better name for this location. Some of the food on the salad bar needed to be refilled, but we were there during the lunch hour. The cashier was not the friendliest and seemed like she wasn’t thrilled to be at work. Will definitely come back again as Jason’s is one of our go to spots.",
   "Large deli with fresh food. Dine in or carry out makes it very convenient. Good food, large portions, and low prices.",
   "Best lunch in town with a trip to the very fresh salad bar and sandwich  (I got it without bread).  Less than  $8.  And you get dessert!"
  ]
 },
 {
  "name": "Thirsty Fellow Pizzeria and Pub",
  "address": "621 Gadsden St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6ee60aac-932f-11ea-8dbd-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "library",
   "food",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5053946764731586152",
  "source": "GoogleMaps",
  "reviews": [
   "Stop at Thirsty Fellows before all the home SC women’s basketball games. Staff is attentive & food is awesome. If Jessica is working, she’s a fabulous waitress. The cold adult beverages hit the spot. Great atmosphere. Recommend highly for good grub & a good time.",
   "Nice casual dining within walking distance of the Carolina Coliseum and the Colonial Life Arena.  Food was great.  I was skeptical of the lemon vinegarette dressing but it was surprisingly delicious.  I'm not a huge lemon fan but this dressing is a must try.  I can't remember what my husband are (pictured) but he loved it.  The inside is decorated with walls full of books.  Gives you sense that you're in a library. Bathrooms were clean.  Outside area with high top tables for sitting around and watching the games with friends.",
   "TRASH. Im so embarrassed to say that I helped open this place many years ago. It takes an act of extreme ignorance or neglect for a pizza to turn into soup. Thanks for wasting our lunch",
   "From service to atmosphere to food,  this charming establishment gets all high marks . I visited Columbia, with my dog, to take my college student to lunch. She suggested Thirsty Fellow, based on a prior visit and that they are dog friendly.  The outdoor seating area was covered,  super clean and had heaters. It was a windy, chilly day so that was a plus! The server was attentive and the burgers we ordered were BIG!  I have paid more for much less filling lunches.  This was definitely a great dining experience that we want to repeat.",
   "Went for lunch and had several of their special items. Food was good but service was lacking and the food took along time to come out. We did have a table of 8 people so I'm sure that contributed but still they weren't packed and the food wasn't anything that should have taken 30 min to prepare. Overall experience was good. We enjoyed our meal and I would go back."
  ]
 },
 {
  "name": "Backstreets Grill",
  "address": "2400 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f364da4-932f-11ea-966c-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5362667614434587721",
  "source": "GoogleMaps",
  "reviews": [
   "We got take out lunch today and the online order was easy! The food was done in the by the estimated time. We got the Cuban with Coleslaw, the Crab & Artichoke dip w/ pita, the Asian Salad w/ Salmon, Med-Hot Wings, & the Quesadilla w/ chicken. All of the food was very flavorful. The portions are a good size. The building was easy to find and the interior decor was very modern, clean and stylish. I can't wait to go back and eat inside! PS - They enclosed a hand written note in the Togo order thanking us for supporting local business! Very nice touch!",
   "Nice atmosphere - more of a bar. Would be good on game day to watch your favorite team. Wings were not great (Public House still has best ones). Will try burger next time - it is the litmus test for Columbia ;)",
   "Very good food, excellent service, good drinks. Nice varied menu. I had the Reuben and potato cake. Karen had the Southwest club and truffle fries (they're a little extra, but consider them) They were very accommodating in substituting the pepper jack (a little too much, we thought, with the spicy sauce). The Reuben was perfect, including a perfect crust on the bread and good balance -- not overwhelmed with kraut or thousand island. Loved the tomato parmesan soup, and Karen said it was some of the best French onion she's had. I wasn't overwhelmed by salt the way too many are and had a generous cheese crust. The potato cake was a little under seasoned, but just needed a quick shake of table salt. Backstreets is in the old Dianne's on Devine. We'll be back when we're in the neighborhood.",
   "Awesome Reuben and loved the sweet potatoes also. Great lunch and service was excellent.",
   "Looking forward to coming back here. A friend and I decided to give this a try and we were not disappointed! My friend had a salad with grilled chicken, mandarin oranges’ and I am not sure what else. She ate it all! It was very popular that day. I got their Cuban sandwich. I’ve never tried one before and it did not disappoint. I loved it! They’ve got a great selection of tap beer also. Not sure common run-of-the-mill Budweiser or Miller light either. I had a Sierra Nevada But I can’t tell you which one. It was perfect with the sandwich."
  ]
 },
 {
  "name": "Cantina 76",
  "address": "1301 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6f7ddf6e-932f-11ea-8059-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "kids",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17097482813622876660",
  "source": "GoogleMaps",
  "reviews": [
   "Love this place. They always have new specialty tacos when I'm there, that are just as amazing as their regularly served tacos. Everything on the menu is delicious. Staff is always very friendly and helpful. Food always comes out quickly and fresh. Definitely give this place a try if you're in the area looking for a great place to eat. Especially if you want Mexican style food but not from a traditional Mexican restaurant!",
   "Nice quick little place. Had a wonderful meal.  The was cooked just right and the restaurant was extremely interesting and fun to look around at.",
   "The food was great and it's obvious everything is fresh and made in house. The margaritas were excellent. We brought our kids, but it was apparent quickly that this isn't really a \"family\" restaurant. While there wasn't a kids menu, they were still very accommodating when we ordered for them. The tacos were good, but if you're expecting authentic Mexican, I would look elsewhere.",
   "My daughter took me here for a late lunch. Nice atmosphere and good food. The staff was very professional and courteous. Can't wait to go back!",
   "Busy but worth the wait.  We went for lunch on a Monday and it was crowded with downtown workers but the wait wasn't too long and service was quick, Tori was friendly and efficient.  The fried chicken taco salad was one of the best I have had.  Husband had the chimichanga and loved it.  Fresh salsa and chips were tasty too."
  ]
 },
 {
  "name": "Motor Supply Company Bistro",
  "address": "920 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/6fc6ce46-932f-11ea-aad7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "eat",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=1300887774481802294",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere, good location, amazing servers, delicious food! Our server was Shelby, she has a wonderful and uplifting personality! She put our experience here over the top! My wife had the Salmon Salad, I had the Patty melt, we were both very pleased. We will definitely be dining here again!",
   "Our first time dining here.  Why did I wait so long?!  Food is fabulous.   Even my husband was impressed, and he doesn't care for \"fancy\" food.  A bit pricey, but I promise, you get what you pay for.  I will be back.",
   "We stopped in randomly for a bite to eat and all I can say is WOW! Incredible service, delectable food, and well made drinks. Serving sizes were great and the overall ambiance was great. Next time I'm in Columbia this will be at the top of my list",
   "I thought the service was some of the best I have ever had in a restaurant. I also thought the ginger ice cream sandwich was amazing! I however was not impressed with my steak. It seasoned well and cooked well but was very  tough. I really expected better quality meat for what we paid. I would come back for sure and give them another shot.",
   "Pricey but worth every penny!\nService was prompt and very knowledgeable on menu items.\nI like the complimentary valet and the ambience of the place was very rustic yet elegant.\nGreat spot for a fancy lunch. Highly recommended."
  ]
 },
 {
  "name": "Al's Upstairs Italian Restaurant",
  "address": "300 Meeting St, West Columbia, SC 29169, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7014a04c-932f-11ea-b0ce-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8701269680372722096",
  "source": "GoogleMaps",
  "reviews": [
   "I've lived in Columbia, SC for nearly 12 years and by some cruel twist I had never visited this landmark restaurant until 2019. What a remarkable experience. Beautiful view of the Columbia skyline and river. Soft atmosphere. Impeccable service......all this was just the beginning. The menu is diverse and resplendent. The wine selection is deep and supportive of the exceptional menu. Portions are generous and flavorful with absolutely perfect ingredients. Every phase of this experience was satisfying and rewarding. Highly recommend! 5 Giant stars!",
   "Loved it. Great view of Columbia sky line. Service was excellent. The food was great! From the meat balls to the sauce, the chicken park, kabobs to the dessert. Will definitely go back. Was disappointed only because they had run out of eggplant. 😟 I love eggplant. Maybe next time.",
   "Amazing romantic setting! It’s upstairs (hence the name) and offers a great view of Downtown Columbia! We had the fried oysters and crab cakes for an appetizer and they were top notch. The service was exceptional and the server was attentive without being intrusive. It is definitely an adult only restaurant. The price was appropriate for the food and setting offered.",
   "Al’s Upstairs is by far one of favorite restaurants in Downtown Columbia. Our host/hostess is always highly professional and courteous. And the food? The food is always amazing. Our favorite are the crab cakes appetizer followed by the Pasta Alla Al entrée. Try to request a window seat while making your reservation to take advantage of the Downtown Columbia city views.",
   "Our son was graduating from USC School of Pharmacy and wanted to go to Al's Upstairs for his celebration dinner. When we called to make a reservation, they were already booked. After talking to Al and explaining how much our son liked the restaurant, he was able to accommodate our party of 3. We had a wonderful dinner. The food was great; Pasta a la Al - amazing, Veal chop - perfect, Chicken Charleston - great. They had our favorite Italian wine, Amarone. The service was also outstanding. I wish I could give them 6 stars."
  ]
 },
 {
  "name": "Terra Restaurant",
  "address": "100 State St, West Columbia, SC 29169, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7059028a-932f-11ea-b27d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4936326711745549953",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely ambience with this spot, great for a date night dinner or a casual lunch. Outdoor seating looks lovely, it was winter when we went. Additionally the pizza menu is quite diverse and the two we had were dynamite. Definitely recommend and will be going back soon!!!!",
   "Food delicious and fresh. I had steak that came with fries and small salad. Only a few entrees to choose from and I think the chef changes them sometimes from day to day. Husband had flounder which was in a sauce and he said it was delicious but for all entrees on the day we went you had to order sides additionally except for the steak. We had a macaroni and lamb appetizer dish which was very very good. Desserts wonderful. The ambience is nice and a big beautiful bar area. Terra is located in a very old (about 100 years?) Building in a row of original buildings in West Columbia and feels like an \"extension\" of the Columbia Vista. Highly recommend Terra but, ok it's pricey but it's worth it. Lovely courtyard area available for private parties.",
   "This was by far one of the best pizzas I've ever had in South Carolina. Definitely worth 20 $5 or more. I will be returning. Looking forward to the next time they have mahi-mahi on the menu. I highly suggest trying this restaurant if you have never been and if you have the bankroll to do it. No scum or bums allowed.",
   "Always an exceptional meal! Tonight we were planning to get the grilled pork chop, but it wasn't on the menu. We were not disappointed though, as we had the swordfish, and we were very happy with it. And delicious profiteroles for dessert.",
   "I was blown away by my experience at this restaurant.  Presentation and flavor of our food was exquisite! If your looking for a fine dining experience,  this is a great place"
  ]
 },
 {
  "name": "Mr. Friendly's New Southern Cafe",
  "address": "2001 Greene St A, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/709a5182-932f-11ea-a756-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12536469716291573130",
  "source": "GoogleMaps",
  "reviews": [
   "Decided to try Mr. Friendly's this evening looking for good southern cuisine.  Believe all of the great reviews about the food, it's authentic, exceptionally prepared and served in phenomenal quantity.  The wine list, beer selections and, cocktails are varied, eclectic and a little unique. Finding a wine pairing for your meal won't be a problem!  The staff are engaging, attentive and professional without being hard to talk with.  Questions about the menu didn't require a trip to the kitchen as our waitress knew menu and made great suggestions.",
   "very small restaurant with a good seasonal menu. our server was pleasant. large wine menu! I wasnt a fan of my entree but everything else including my dates dinner was tasty!",
   "Busy on a Monday for lunch was a great first impression! Really cool little spot in Columbia featuring comfort food of The South. Great menu selection with beer wine and cocktails and friendly and prompt service. I will definitely return when I'm back in the city.",
   "Food was great,  except for the grilled green tomatoes.  They were too salty. The portion sizes were small for the cost of the food.  The waitress was pleasant and friendly. Nice ambiance and beautiful artwork.",
   "Awesome restaurant! Service was exceptional, presentation was on point, food was delicious! We stopped here cause they buy local and it didn't disappoint. Would highly recommend this establishment."
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "1410 Colonial Life Blvd W Ste 130, Columbia, SC 29210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/70e71750-932f-11ea-a6cb-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "delicious",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=11761743874476978575",
  "source": "GoogleMaps",
  "reviews": [
   "Me and my boyfriend visited this location the day after Valentine’s Day for a belated celebration. This place is amazing!! So comfortable, romantic, fun experience. The food was so good and the drinks were fantastic. The only reason for 3 stars is our waiter was run ragged. He explained how they were short staffed that night and to bare with him which is completely understandable. Every single time he came to our table he was sweating and out of breath, obviously stressed.\n\nOur reservation was at 9:30, we were sat by 9:40. We didn’t leave till 12:40. Which we didn’t notice since we were on a much needed date and our waiter even gave us a free bottle of wine for the inconvenience. He was so informative and helpful. But please, hire more people or you will for sure lose the good quality ones!!!",
   "This is the best place to take out a date or to take spouse out for a dinning experience sure to impress,  the table/booths are very private and intimate you wont have to worry about the people at other tables staring at you while you dine. Be ready to sit and enjoy dinner for at least 2 or more hours because you will be cooking most of your food at table in different cooking styles from grilling to a boiling hot broth dip , the food is of the highest quality",
   "Very nice restaurant, a welcomed change from the norm. The restaurant itself was nice and our server, John, was absolutely amazing! He was passionate about his job it it showed! The prices were a little higher than expected, but I would definitely recommend that you give this place a try at least once!",
   "That place it's always fun to eat at. It is a pricey but delicious. Make sure you bring your appetite with you!!! Jason was a very attentive server and did a great job!",
   "I absolutely love The Melting Pot with my entire heart! An amazing and intimate atmosphere. We had a great waitress! Can't remember her name but she had green hair and was so down to earth and kind."
  ]
 },
 {
  "name": "Kimchi Korean Restaurant",
  "address": "1807 Decker Blvd, Columbia, SC 29206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/712bfa9a-932f-11ea-a9fd-14b31f159f22.png",
  "tags": [
   "hospitable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14195931907215782323",
  "source": "GoogleMaps",
  "reviews": [
   "It was a delightful experience! I ate my entire meal and with chop sticks for the first time in my life ( successfully! 🥰.  The attendant was very hospitable and professional / attentive. Everything ( the entrees and appetizers) were great. I now know to ask for fried rice with my meal although the steamed rice was superb. The food was authentic per my son who served in S. Korea and was more of an expert in the cuisine than I. 🙂 Looking forward to returning. 👍🏿👍🏿❤️❤️❤️❤️❤️",
   "Service was great.  I was the one who took a while ordering.  I got the kalbitang (beef stew)  and it was so good and the meat was very tender.  Would come back again.",
   "I like to go with friends to this restaurant with my warmest recommendations. I visit this restaurant often. I get very good feedback from my friends. The the cooking is appetizing and the stuff is generous and cooperative. always when we visit this place we pass a splendid time.  highly recommended.",
   "I like to go with friends to this place with my highest recommendations. I visit this restaurant often. I get very good feedback from my friends. The the cooking is appetizing and the stuff is very friendly and cooperative. Whenever we go to this place we have a pleasant evening.  I recommend this place with pleasure.",
   "Delish! If you are looking for excellent, authentic Korean food.... This is the place to visit! The lunch specials were great and there were even \"box\" options - which offer a little more variety then the specials. I had a tasty Kimchi Soup and we splurged and bought a \"Korean Pancake.\" Sides were wonderful, as usual. Highly recommend making the trip!"
  ]
 },
 {
  "name": "Asanka Kitchen",
  "address": "10203 Two Notch Rd, Columbia, SC 29229, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/716e9b52-932f-11ea-80e0-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "family",
   "family",
   "food",
   "tasting",
   "food",
   "music",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2894520801177416709",
  "source": "GoogleMaps",
  "reviews": [
   "Elizabeth was just wonderful! She gave us a \"taste tour\" of the dishes and explained West African cuisine. We had the jollof rice and tomato stew with mackerel, the red pepper soup with goat meat, the spicy Mac and cheese and the fried plantains. Everything was delicious! Elizabeth is so welcoming and treats all her guests like family, we can't wait to come back!",
   "This is an amazing place! I was met with love from day one and everytime I come back they make me feel like family! Food is amazing! They give you great portion sizes and there is something for everyone here!",
   "It was our first time eating West African cuisine and we absolutely enjoyed it. It is an excellent establishment with very courteous service, good vibe music and an overall great experience with their \"Ritual\" of food tasting. Wish we weren't leaving the area soon, so we can frequent this hidden gem more often!",
   "Jollof rice, red red, and plantains were my staple meal the summer I studied abroad in Ghana. So happy to discover I can dine on this meal at home! The food was hot and delicious and everything I hoped it would be. Can't wait to get it again!!",
   "It's safe to say that Columbia is full of hidden treasure that could not be discovered unless someone else told you about it. Asanka Kitchen is at the top of that list and will continue to grow in popularity due to its delicious food and wonder customer service. Very welcoming friendly atmosphere filled with generous portions of food, served with a smile. I will be returning."
  ]
 },
 {
  "name": "Ristorante Divino",
  "address": "803 Gervais St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/71b449f8-932f-11ea-8957-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16720878626721497099",
  "source": "GoogleMaps",
  "reviews": [
   "Duck was delicious. Bread and stuffed peppers were also. Excellent",
   "Ristorante Divino is expensive Italian restaurant downtown.  The main dishes hit well and they have a extra helping of flavor. The scallops were seared perfectly and the risotto had a unique and interesting flavor. The pappardelle was flavorful and smooth and the sauce was well matched for a wide pasta.  The appetizers were also good especially the calamari, which I would claim was the best I've had in Columbia.  However, Divino faulters as a fine dining experience in Columbia in part due to it's outdated decor, its inexperienced staff, and a dessert, which was honestly . . . terrible.  The tiramisu was dry, lacked flavor, and should just be taken off the menu.  After quite a good meal putting that on the table left us quite literally with a bad taste in our mouth as we walked out the door.",
   "Very nice!  Great service and food.  Warm, cozy atmosphere.",
   "Very tasty authentic Italian dishes. Cozy atmosphere, very friendly and attentive service.",
   "The dining experience here was amazing. As soon as you walked in the atmosphere changed. All employees were dressed formally and spoke to you with respect.\n\nThe service was average, except for the waitress who treated my mother poorly because she ordered a soup and a salad instead of something expensive.\n\nI had the Paparadelle Bolognese. It was outstanding. The seasoning was just the right amount and I wasn't overloaded with the potatoes. I certainly received what I paid for."
  ]
 },
 {
  "name": "Top of Carolina Restaurant",
  "address": "900 Barnwell St, Columbia, SC 29208, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/71f82a9a-932f-11ea-9eba-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15547230752754548437",
  "source": "GoogleMaps",
  "reviews": [
   "Tried far in advance to make a reservation for parents weekend but was booked. Due to a cancellation we get in! I'm from Chicago and have been to a few brunch and must say this place was Awesome. Better than a few places I've been to. The food was excellent, the staff were friendly , polite and helpful. The view was beautiful. Took a bit to get use to the revolving . I will be back!!!! Best brunch and priced reasonable. Thank you for a great experience . Students can use a meal plan here just need to pay the difference.",
   "Food was AMAZING!!!! EVERYTHING I ate was delicious!!! The view was fabulous!! Wait staff were friendly and those who are preparing your food were friendly and helpful!  Great experience and I can't wait to go back",
   "The view is nice. Unfortunately, the food is sub par. Food was lukewarm. Salmon was fishy a d the pasta was too salty. The salad with the orange vinaigrette was great. My wife was eating off of the \"vegan\" menu, but they brought her a salad covered in goat cheese that we had to send back, then on desert they brought her chocolate covered strawberries and a pound cake with cream that we also had to send back. I was \"aware\" of the price, because I called in and asked, but I was told $80, I overheard someone else in the restaurant be told $70, the bill came out at $77 but was not itemized. I'm not sure if that was $70 plus tax or $70 flat including tax and they up-sold me on the sparkling cider. At this point, I was just irritated, and I was ready to go.",
   "It’s been a long time since we’ve visited Top of Carolina and our first visit for their BBQ Friday lunch. We went the Friday before Easter for an “experience” with our 14 year old granddaughter. It exceeded all expectations. Other than finding a place to park, our lunch was perfect. There was a big selection of food; bbq, fried chicken, fish, salads, vegetables, deserts and ice tea, lemonade and coffee were included. It takes about an hour for a full rotation and we enjoyed the changing scenery. One of my favorite things is it’s casual....jeans, shorts and even baby strollers were there. For the price you can’t go wrong and our granddaughter had a meal she will remember for a long time. The servers couldn’t have been nicer and went out of their way to make sure we had everything we needed,",
   "Great atmosphere and food. Vincent is especially kind and friendly and makes an incredible custom omelette! Can't wait to go back."
  ]
 },
 {
  "name": "The Whig",
  "address": "1200 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7243db18-932f-11ea-9433-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "knowledgeable",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5556486274597700386",
  "source": "GoogleMaps",
  "reviews": [
   "The food is incredible! Wish the Veg-Fil-A was an everyday menu item because OH MY GOD IS IT GOOD... But I'll be happy to have the smoked Gouda Mac n cheese! The place is darkly lit but really good stop for dinner and a drink or 2. My only regret is that it's not open for lunch!",
   "Good beer. Good atmosphere. Definitely could be a cramped spot, but we were also able to sit down at a table on a Saturday night. Worth a look if you like the bar scene.",
   "This place is the fire. Great dive bar with awesome food. Huge selection of draft and canned beer. Bar tenders were knowledgeable and friendly. Highly recommend. No TVs.",
   "Great place to grab a drink. Solid variety and cool atmosphere. Food is pretty good too. Smaller inside so can feel full easily. Definitely worth checking out",
   "It's a hole in the wall dive bar that seems to be popular. I went on Tuesday Taco Night and there was a crowd but not overly crowded. It was easy to move around but seating was limited at times."
  ]
 },
 {
  "name": "1801 Grille",
  "address": "700 Lincoln St #200, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7285cd98-932f-11ea-8609-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5133046065002070784",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed my visit. We were seated promptly at our reservation time and everyone enjoyed their food. The only downside is that a lot of the staff are college students and they just don't have great customer service. Our server, Tyler was great. He offered great recommendations and made sure we never wanted for anything. I'll definitely return!",
   "This is my favorite sandwich right now..\n it is  fatty brisket with brie cheese ....\nsome kind of yummy mayonnaise sauce,roasted tomatoes and caramelized onions... it is one of the best sandwiches I have ever eaten in my life.....",
   "Really fun place with great service. Definitely has an upscale grill feel to it so you can dress up nice or not. The appetizer portions are small but the food servings are substantial. The only downside is finding parking but they can't do anything about that. Salmon was fantastic but has a lot of pepper. Strawberry salad was great too!",
   "We chose 1801 Grill for a rehearsal dinner party Friday, Jan 17.  Our contact, Sara Allen, was extraordinarily helpful and had great suggestions on setup, menu, and best use of the available space. We hosted 57 people in the party room and had the bar for happy hour and buffet.  The space was cozy but comfortable.  Chef Bruner's appetizers, buffet and desert totally exceeded our expectations.  Buffets tend to dry out; not ours--everything was hot, fresh and tender. They supported us with a huge staff of cheerful, enthusiastic servers; I think some were students of the USC School of Hospitality. They get top marks.  All-in--all, this was the best choice we could have made.  Sorry, I ran out of stars, this place is the best.",
   "Gouda cheese bites were a great way to start.\nRibs were tender, fall off the bone.\nBurger was cooked to perfection, and the bacon was flavorful and crispy.\nAll things considered, while the food was good it was not excellent, and the portion was far from the price point. \n\nService was attentive and professional, though it was a slow night."
  ]
 },
 {
  "name": "Eggs Up Grill",
  "address": "2930 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/72c7a642-932f-11ea-9380-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14398985277543825451",
  "source": "GoogleMaps",
  "reviews": [
   "We decided to do our Father’s Day breakfast here this year and we were not disappointed. The food came out fresh and fast. All of our party enjoyed the taste of everything. Service was fantastic for our party of 17. Our servers were very professional and patient with our children. Thank you to Stephanie and Rachel for the awesome job they did with our family! In watching the service around us, service was fantastic for parties of any side. I highly recommend the Sweet Potato waffles, the Southern Style Omelet, and the coffee. We will be back when we visit Columbia again.",
   "Wait staff was great, helpful, and friendly. Food was prepared quickly and tasted great. We had a large group and she did wonderful with our orders! I had no complaints and would definitely return again!",
   "Eggs Up on Devine Street is my go-to breakfast spot. Always delicious food and fast, friendly service! I highly recommend them for a meal or even catering. The egg white omelet is my favorite, but I haven't had anything I haven't liked there. I'm excited to go back!",
   "My daughter and I chose Eggs Up for breakfast and the food was wonderful! The pancakes were delicious and her bacon, egg, and cheese melt was great. Our server was also wonderful, even though the restaurants was busy. The food came out fast and the manager came over to check on us. A+ service!",
   "A must visit while in the area. From the staff to the ambiance- this place was amazing. Our server was playful, reasonable prices, no long wait times and this place was packed. Will definitely recommend this place to anyone who wants a delicious breakfast while in town. Bravo!"
  ]
 },
 {
  "name": "Travinia Italian Kitchen & Wine Bar",
  "address": "101 Sparkleberry Crossing Rd, Columbia, SC 29229, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7306d754-932f-11ea-98e2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5811236469825243147",
  "source": "GoogleMaps",
  "reviews": [
   "The Staff, Management and FOOD is Amazing. I have been to many restaurants but Travinia in NE Columbia is by far the best dining out experience I have had in a very long time. My server was Meagan and she was a great help with me deciding what to order. She took such good care of me! \nI can't say enough about the food and Staff...they really work hard to make sure you are pleased with Everything!!\nand I can't wait to go back!\nI give it 10 Thumbs Up!!!!",
   "We stopped in around 4:30 p.m. because the nearby restaurant and bar wasn’t open until 5 p.m. and were pleasantly surprised to find a lively bar crowd enjoying bowl games and post-holiday drinks. The single server/bartender was busy but pleasant and generously offered samples of the red wines I asked about before I committed to a glass. We shared the small antipasto ($12) and it was perfect for the small snack we wanted with our drinks. They even accommodated out request to leave off the roasted tomatoes and add more buratta - grazie!",
   "OUT OF THIS WORLD ITALIAN FOOD \nI had Chicken Parmesan. The linguine was AMAZING, so soft and fresh. The chicken was crispy and the sauce was definitely homemade. BEST meal I have had in months!  I would give this place 10 stars. The price was not bad at all for the quality. The ambiance was superb, the place was packed, but not so loud we had to talk over. The wait was a little long, make a reservation on Fri or Sat. Tons of wine in all price ranges. Excellent service. The total package.",
   "Entree, dessert, and atmosphere was all amazing. Our waitress, Ansley, was incredible and had sensational recommendations. We will definitely be returning. The only thing that saddens me about our experience was the table next to us. There was about 5 children who left a huge mess under the table. Their mother also was vocally complaining about her entree. I noticed we had gotten the same dish, the “Pan Roasted Chicken,” and she was loudly complaining to the manager that there was “Too much bacon.” Very unprofessional. The dish was amazing and included in the description it included bacon. I loved it and my husband did as well. We will be back soon!",
   "Popular Italian eatery in a convenient location.  Food, service and atmosphere were above par.  Hope was our server and couldn't have been more helpful.  It was our first time here, and she helped with our menu selections.  \nHubby had the Bolognese and enjoyed it very much.\nI had the Veal Marsala and it was divine.  For a nominal charge, they allowed me to substitute a side for the pasta, which I was happy about.\nTiramisu was our dessert choice and yummy - so large it is a must to share!\nKitchen has an open view so you can see the busy staff preparing the dishes.  \nWe definitely enjoyed our dining experience here and would return when we are in the Columbia area."
  ]
 },
 {
  "name": "Villa Tronco Italian Restaurant",
  "address": "1213 Blanding St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7347f846-932f-11ea-97b6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10010266572117841529",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent Italian cuisine and fine service. I enjoyed the sirloin steak with goat cheese. It was perfect. Topped it off with a cappuccino and tiramisu.",
   "The meal was excellent from start to finish. They have really improved this restaurant in the past few years and brought it to its original glory. Then wine selection was not huge but it was outstanding. The veal and the seafood dishes were delicious and so was the cheesecake as always. The service was patient and thoughtful. I would definitely return and recommend it.",
   "The service was friendly and extremely prompt! 👍 The meat balls were flavorful. I am not a fan of the sauce. It doesn't have much flavor. I didn't see any typical Italian seasonings in it. Some people like their tomato sauce that way. I won't knock it for that. Just not my thing. It is kind of like bbq, some people like Texas style some like Memphis style. To each there own. I gave 3 stars because our food was cold",
   "Been here several other times, this time was for my birthday. Place is clean, the food is great, actually it's phenomenal. The staff is always friendly. It's kind of expensive but amazing for special occasions.",
   "Eggplant parmigiana as good as from NY.  Excellent service.  Dinner comes with salad and bread.    4 stars only because the portion was a little  small."
  ]
 },
 {
  "name": "Inakaya Japanese Restaurant",
  "address": "224 Oneil Ct #9, Columbia, SC 29223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7396dba2-932f-11ea-8e33-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=2666351588573651521",
  "source": "GoogleMaps",
  "reviews": [
   "We went for my husband's 30th birthday and we had a blast! The waitress was amazing even though the place was super busy. The sushi was fresh and really good. The only problem was that the steak I got was flooded with soy sauce so it made it a little salty. Other than that would definitely recommend to anyone!",
   "My fiancé is a connoisseur (I’m more of an endless pit) but we both love this place. When we call in their people are always very helpful, patient and informed. 100% recommend checking them out!",
   "A+ for service and for variety and it sounds like their rolls are great. I have to give 3 stars because the quality of fish for sushi and sashimi was a little lacking. Stringy and tough is not what you want. Very nice environment and all the other cooked dishes we had were excellent.",
   "The taste of each sushi roll was as expected:  Great!  The only feedback is to focus on the structural integrity of the rolls.  They fell apart very easy.",
   "If you love Fresh Sushi, then this the place for you. They have an assortment of Sushi, Sashimi and various cooked foods on their menu. IF you don't see it on the menu, ASK for it. They can are happy to make anything you ask for. In my decades of experience eating here - Any roll or Japanese food eaten at any other restaurant, they are happy to make for me at my request. Cost-wise, they are comparable to prices paid elsewhere. However, Freshness is their selling point.\n\nThe clientele is mostly ex-military, military and an abundance of locals who love Sushi! They open at 5pm for dinner but get crowded early on but leave within 45 minutes. For best seating arrive at opening or well after 6:30pm.\n\nOh, they are open for lunch and frequently have Lunch specials - be sure to ask about them!"
  ]
 },
 {
  "name": "Publico",
  "address": "2013 Greene St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/73de1dfe-932f-11ea-8cec-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "delicious",
   "free",
   "delicious",
   "food",
   "affordable",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11804289038089698345",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome spot in Five Points! The atmosphere is so comfortable. You will see everyone from business, families to couples. Drinks were delicious and food was flavorful. Lots of options!",
   "I liked the lunch better than brunch. The drink menu is good. Tacos are decent. THE JOY IS IN THE PIMENTO BITES YALL",
   "You can not go wrong with anything you order from here. Everything is delicious and they are accommodating with anything you want to change. I ordered the nachos and everything was so fresh, even the queso was homemade and delicious on it. There is also buy one get one free drinks at brunch! I loved this place so much I went back the next weekend.",
   "This is a must stop place. We sat at the dog friendly patio. The food is absolutely delicious and the dog menu is especially nice. The service was great and prices were very affordable. I would definitely recommend and will be returning.",
   "Really relaxing on Sunday Brunch. Good choice of beer / drink and great food. Very good service"
  ]
 },
 {
  "name": "Il Giorgione",
  "address": "2406 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/742c9326-932f-11ea-bdad-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "food",
   "unique",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7820647172221069163",
  "source": "GoogleMaps",
  "reviews": [
   "This place has great food and I have been many times.  However, I don’t plan on going back after my last experience.  A group of friends had a table for 8 with a 5:30 reservation.  Some of the group trickled in closer to 6PM but someone arrived at the restaurant at 5:30 to claim the reservation.  Obviously with a larger group it takes more time for the entire dining experience than it would for a table for 2 or 4 people.  After 2 hours Monica, the owner, came over to our table and basically told us we needed to go to the bar or leave because she had the table reserved for someone else.  While I consider myself to be an understanding person, the way she handled it and her attitude was a complete turn off.  She wasn’t very pleasant and made us feel like we had to rush to finish our half full glasses of wine after ordering a bottle of wine.  She was not friendly or seemed appreciative of the business we had done at her restaurant.  George, her husband/co-owner, came over after she did and told us thank you and asked if we enjoyed the meal...how customer service should be!  With understanding this being a smaller space, it was never mentioned that there was a time limit when the reservation was made via the telephone.  In fact, my friend originally tried to make a reservation for 10 and Monica said we can’t accommodate 10 people in a short tone.  My friend’s response was “Well, I guess we won’t be eating at your restaurant will we?”.   I am extremely disappointed as there is no other place like iL Giorgione in Columbia.  Too bad...",
   "One of our favorite places to go for authentic Italian food!! They make their own mozzarella in house and it is amazing!! Love, love their Spaghetti Carbonara as it's as close to authentic that I've found!",
   "Great service, awesome drink menu, really tasty food, and good prices....they have it all. I'll definitely be back.",
   "Staff, atmosphere, and food were amazing! Can\"t wait to go back.",
   "I arrive at this unique restaurant often since I like the ambiance that is characterizes this restaurant. The staff is exceptionally friendly and professional. The service is exceptionally efficient. Needless to say, the food you eat is excellent. I ate there more than once and I was always happy. The expense is decent. I suggest this place to all my friends."
  ]
 },
 {
  "name": "Cantina 76",
  "address": "2901 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/746ef39c-932f-11ea-a45d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "affordable",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1964679055398033447",
  "source": "GoogleMaps",
  "reviews": [
   "I can definitely say this place has a great/fun atmosphere, just my opinion on this but the tacos are just weird, BBQ tacos? I mean come on.... that’s like something you create in your kitchen when you’re hammered, on a positive note the guacamole is exceptional. I highly recommend ordering that! Another note the bartenders are great! As a former bartender myself I can certainly say that these guys know how to make drinks! Very good guys!👍🏻",
   "Awesome fresh food and fast service!",
   "The spot is extraordinary and roomy, the food was delightful and the rates were very affordable. rapidly, efficient service and very personal waiters. Recommended.",
   "Great Tex- Mex food and mixologist Christina served my perfectly mixed Margaritas with a smile! Thank you!",
   "On Cinco de Mayo my wife and I decided to go to go here to get take out. We come here regularly and usually have had decent experiences. We waited in line for 20 minutes to order and then another hour for food, which was as to be expected due to covid and the Cinco de Mayo crowd. \n\nMy wife and I ordered 8 tacos. The girl taking our order wrote it all down correctly, read back to me what I read to her. She placed the order and brought me back a non-itemized receipt, which made sense cost-wise. \n\nWhen they brought the food to us, they read our order to me which was missing 2 tacos. We told them that we were missing those tacos, and a girl went to check on it for us. Five minutes later, a different employee came out with a $7.70 bill saying if we wanted them that we would have to pay. I told him that I already ordered the tacos and paid, but that my tacos simply weren’t in the bag. He went back to check on them for me. The employee then returned another five minutes later with the original receipt which was all balled up, like it was in the trash, and he went through the bill with me to prove that they were right and that I owed them the money for the tacos. \n\nI begrudgingly paid the extra, and he then placed the order for me, which came out 15 minutes after that point (which was 25 minutes after the original bag of food we already waited an hour for). By this time our original tacos were cold. \n\nIn addition, when we went in the car to eat the tacos, some of the tacos had cheese on them, which we ordered them without cheese due to my wife’s dairy allergy. \n\nThe poor customer service that I received yesterday is why I will never return to Cantina 76 and I will stop recommending it to colleagues and friends. I hope it was worth the $7.70."
  ]
 },
 {
  "name": "Pawleys Front Porch",
  "address": "827 Harden St #1001, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/74b4e6b8-932f-11ea-a0f5-14b31f159f22.png",
  "tags": [
   "delicious",
   "tour",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11958063188944752478",
  "source": "GoogleMaps",
  "reviews": [
   "Very good burger. Fresh and large patty. We enjoyed the chili cheese fries as an appetizer but the sweet potato fries were fabulous. True sweet tea. The only slight was the delay but server was very pleasant. We ate on the porch and was able to bring our fur baby with us.",
   "We found out about this place from our tour guide at USC. He mentioned it was featured on Dives, Diners, and Drive Ins, so we knew we had to check it out. Honestly, I thought it was a liquor store at first because of all of the decorations in the window, but as we walked to the door, we realized it wasn't. The inside was fun and the waitress was extremely friendly with quick service. They're known for their burgers, so some of us tried to that and they were HUGE. They were absolutely delicious and well worth the money!",
   "Good main dishes, but the service... I know it was busy when we came in but it tapered off long before we left. Never got drink refills, finally got our extra side of honey mustard as we left (which we ordered with our meal,) and spent 2/3 of our time in the restaurant AFTER finishing eating. This was our second time coming and second time with sluggish service. Our server was super nice, just... very slow. Happy to say the fries were excellent this time. Highly recommend the pimento cheese and fried green tomato BLT- it was off the charts! Giving 3☆ instead of 4 because I feel like service is hit or miss... and we just keep missing it.",
   "These burgers and fries were absolutely phenomenal! Service was great as well. I will be back soon to try more items on the menu. In my photo is the Wadmalaw burger on a pretzel bun",
   "Best Sweet Potato Fries EVER ! Burger was good,  the Fried Green Tomato BLT was excellent,  what a concept to add Fried Green Tomato and Pimento Cheese.  Completely different than other sandwiches.  Wife loved her buttermilk chicken wrap also. We ate there at lunch so it wasn't busy yet. We had great service and quick,  hot food."
  ]
 },
 {
  "name": "Henry's Restaurant & Bar",
  "address": "2865 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/74f99108-932f-11ea-a14b-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1815780678969001904",
  "source": "GoogleMaps",
  "reviews": [
   "Great burgers and fries - Greek salad was surprisingly excellent. Usually good burger places don't have good salad but this place beats their competitors nearby on this item. Furniture is basic but good and beer selection are very good.",
   "We were looking for a bite to eat for lunch when we happened upon this place.  Our server was Hilary, and she was so nice!  She sat us at the table our 4 year old chose, and was quick to get us beverages.  She was readily available when we needed to order our food.  The kids menu was perfect, and I was able to get a favorite, fried pickles!  I got a burger called the \"Mess\".  It was a burger patty with a fried egg, and chili.  Nomnom.  The kiddo got a corn dog and fries with a lemonade.  They had a large menu, and lots of beer choices.  The room was large for plenty of seats, and they had an outside patio as well.  I will return to this establishment again soon!",
   "They have the vittles! Outstanding brunch and beverages. My first time there, while visiting my pops for an early Father's Day weekend. Since it was my first time at the bar restaurant, I had to order the \"Chonga\"--stellar breakfast burrito with eggs and various meats, with a side of fruit and hashbrown casserole. I took half to go. Our server-bar tender, Alyssa, was outstanding--very professional (giving great recommendations) and friendly. You could tell she has experience working there--kind of runs that place but not in an overbearing style. Probably is fun to work for/with. Regarding the stellar food, apparently the head chef (Henry?) gets there at 5 AM to make the magic happen. Well done, good sir.",
   "The Divine St location is great.  The location, atmosphere, food, and service are all awesome.  Go out there, grab a beer and a burger and enjoy yourself.",
   "The food is consistently fresh and delightful, cashiers hands over fantastic customer service. I loved how neat it is and vibes. I highly recommend this place."
  ]
 },
 {
  "name": "Harambe Ethiopian Restaurant",
  "address": "2006 Senate St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/753ded5e-932f-11ea-9fb9-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11168085311958761445",
  "source": "GoogleMaps",
  "reviews": [
   "Calm and quiet, I loved the ambience of this eatery. Their spread is decent and reasonably priced. The flavors (read heat) although are kept milder to suit the taste buds of the locals.\nOur waitress was very nice and welcoming and did a very good job helping us decide the lunch course.",
   "We enjoyed a wonderful (takeout) meal from Harambe. I had been meaning to try the restaurant since moving to Columbia and I am so glad I did. The vegetable sampler and Harambe sampler are both fantastic. I can’t wait to order again and to eat in soon!",
   "The staff was friendly and the service was fairly fast. We got the veggie samosas as an appetizer and just wow! Those bite size samosas and fill with lots of flavor. As our main entree we had the Harambe Combo. It was very delicious! I cannot wait to go back, this place is a gem.",
   "My husband and I went at a quiet time, around 2. We were welcomed and given menus. Everything on their menu sounds good but I decided to try the chicken tibs and beef tibs. My husband had the meat platter. The flavors were amazing!!!! Lovely and cozy atmosphere. There is a bar and it looks like they may have a lively happy hour but we were able to enjoy our food and quiet.",
   "It was the first time i go to an Ethiopian  restaurant,  and I personally loved this place. The food was delicious, and a great experience  with the family.  Definitely recommend this place."
  ]
 },
 {
  "name": "Yesterdays Restaurant & Tavern",
  "address": "2030 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75977f40-932f-11ea-b7a9-14b31f159f22.png",
  "tags": [
   "unique",
   "family",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9883450714257202757",
  "source": "GoogleMaps",
  "reviews": [
   "Fantastic experience with this place during restaurant week! I got the rib plate (should say riblets as it advertises itself as a full rack of ribs when it's a half rack (?)) with mashed potatoes and gravy as well as mac and cheese. Ribs were tasty and the moonshine sauce was really good, though I wish it had more \"moonshine\" flavor and was a little less sweet. Mac and cheese was the standout. Unique and savory, with some bell pepper to give it a twist. Mashed potatoes were maybe a little on the heavy side, but flavor was fabulous. Friend got the London broil with the horseradish sauce (which was perfect) and the flank steak was spot on. Very good experience. I'll be returning.",
   "Went for brunch on a Saturday. No wait. Pleasant customer service. Pictured is the fish and grits, hash brown casserole and chicken and waffles. The fish was well seasoned. The grits were just OK. I'm a southern girl who knows grits. The chicken and waffles were average per the hubby. I didn't taste the hash browns. The fish and grits were quite filling!",
   "Ordered takeout through Bitesquad - ordered chili cheese fries and was given fries with cheese on top. No chili, no black beans. Ordered a taco salad and was given the most pitiful pile of iceberg lettuce with avocado and mushy chicken on top. I was so excited to be having a good meal and was left highly disappointed. In a time where takeout is KEY, take more pride in what you’re doing.",
   "We have been going here since they opened  40 years ago. It's also a favorite if we have out of town family or friends visiting as the menu has something for everyone. My husband loves the Confederate fried steak with gravy while I usually go with shrimp tacos or a vegetable plate. The hot fudge sundae is to die for and easily feeds two. Here's to another 40 years!!!!! PS: And their  servers ROCK!",
   "Been a long time since I've come down to five points to get some of that old cowboy, fully dressed in a tub. Great food, big selection of beer on tap and I've always had good service. College kids can be amusing."
  ]
 },
 {
  "name": "Hendrix Restaurant",
  "address": "1649 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/75dc0290-932f-11ea-9187-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "cheap",
   "food",
   "walking",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=811277271879186965",
  "source": "GoogleMaps",
  "reviews": [
   "Want to get some delicious food and cocktails.  Had the pleasure to eat here and had the catch of the day.  The Swordfish was purely magical with The Huntsman to follow.  A juicy perfectly cooked blackened Swordfish.  The Huntsman crafted by Boone was a beautifully concocted bourbon cocktail with a smokey campfire salted rim.  I feel I could eat here every night!",
   "Did not really know what to expect when walking in, but as soon as you get to the top of the stairwell you get a vibe of elegance and fine dining. Was a bit shocked at the menu prices, however everything prepared is locally sourced and was downright delicious! Is it a good place to go with your buddies to grab a cheap meal? No, but one shouldn't come to expect that of this restaurant. I went here for date night and it was a spectacular evening. The service was some of the best in Columbia, and the food not only was plated beautifully, but tasted wonderful as well.",
   "Outstanding service from Alyssa! (Hope I spelled that right) she was beyond helpful and constantly smiling. Highly recommend the winter vegetable salad (top photo), fried oysters, pork tacos, crispy fried Brussels spirit leaves (and I hate Brussels sprouts). Classy yet trendy ambience. Didn’t get to check out the rooftop bar because of timing in my end, but definitely will be next time.",
   "Hendrix is such a great place.  It's very cozy and very nicely set up.  The menu is delicious and so are the cocktails. My date and I stuck with the tapas menu and got the gnocchi, carnitas tacos, pork belly,  and the flash fried oysters.  All dishes were very tasty.  The shining star were the gnocchi.  OMG they were so good!  Definitely get 'em. The rooftop is also very cool.",
   "Love the food, atmosphere and service! It is a great place for date night and love the character of the location! We will be back to enjoy! The flash fried brussel sprouts are incredible and I do not like  Brussels but could eat these all night!"
  ]
 },
 {
  "name": "Boeshreen",
  "address": "2630 Decker Blvd, Columbia, SC 29223, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76332362-932f-11ea-a63d-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14329474570244375366",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I felt hungry when we go back to Florida from North Carolina. I searched some halal food than I saw this restaurant. \nIt was perfect than I thought. Cheese burger and gyro was delicious 😋 it was pretty quick. The workers were so polite. The manager was friendly, good cook at the same time. Turkish coffee was amazing \nEvery one should be stop by this Libya restaurant on their trip.",
   "Great food with fast and friendly service! I ordered takeout for the first time and had such a good experience. They have an expansive menu with lots of dessert choices. The food was fantastic--I would recommend the lamb gyro (probably the best gyro I've ever had) and walnut baklava. I will be back soon!",
   "The food here was spectacular and the service was great. The only downside was the baklava was old. Next time I'm in the area I will definitely go back.",
   "Super nice staff, great food. Very reasonable prices. Would def go again.",
   "The food is nothing special. The restaurant is kind of dirty. The food display was dirty with finger prints. The glass food display also had empty trays. The service was slow. I was expecting more from the good reviews. We came 15 minutes after it opened so it was disappointing. The bathroom wasn’t clean either. It was nasty."
  ]
 },
 {
  "name": "Kao Thai Cuisine",
  "address": "1001 Senate St #300, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/768143be-932f-11ea-8b86-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10941180999966735092",
  "source": "GoogleMaps",
  "reviews": [
   "I purchased the NYE 3 course meal with open bar package and it was a fantastic deal. The food was excellent (especially the soup appetizer and strawberry shortcake dessert), and so were the drinks. I was expecting cheap drinks for the NYE deal, but it was for the classic cocktails on their regular menu. I was very impressed with the service and all around experience. Highly recommend.",
   "Excellent Thai food in Cola. The menu offers traditional Thai dishes that are executed better than most asian diners. The atmosphere is fun and lively. Service is great too!",
   "I really liked this place! It wasn't crowded at all when we went, and as a really cool bonus, there's free parking (almost unheard of in the Vista). I tried both of their soups, which were excellent, and my friends got the drunken noodles (also good). The gyoza was perfection. Prices are a little on the high side for a lunch, but nothing unreasonable. I'd go again!",
   "Great food, great atmosphere and good prices. Food is tasty, great blend of flavors and ingredients are fresh. Menu selection is decent and not overwhelming. From starters to entrees there is something for everyone.\n\nThe atmosphere and setup is interesting and very well lit. Service is attentive and very friendly!",
   "I ordered pick up because of the lockdown and they were quick and courteous, labeled my boxes and brought it right out to my car. Very sweet and the Thai rice is good!!! 🌈"
  ]
 },
 {
  "name": "Zoës Kitchen",
  "address": "4855 Forest Dr, Columbia, SC 29206, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/76cfb20c-932f-11ea-a93b-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "affordable",
   "food",
   "delicious",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1912756748354964406",
  "source": "GoogleMaps",
  "reviews": [
   "First time I've ever eaten here and absolutely not my last. Where has this place been?! I loved their food! You can taste all the ingredients. Fresh vegetables, meats, and superbly well blended. Staff was very friendly and helpful. Our party ranger from 12 to 46 and we all loved. The tomato bisque with the cheese topping was perfect!\nEverything we had was tasty, filling but not heavy, and good for you. Nothing fried. \nKnow for a fact I'll be back and this place has earned a new customer for life. Glad I joined their rewards program because I believe I'll utilize this. \nGREAT FOOD!",
   "These guys help me get from class to work on time and in a healthy, affordable fashion! Always a pleasure over the phone and also quick and delicious. Well done guys! Thank you for your great service!",
   "First time coming and had no real idea of what to expect.  Turns it it’s pretty decent Mediterranean food. Ordered the Mediterranean chicken mean with roasted veggie and pasta salad. Along with the chicken I put a little  of the spicy dressing on it. Turns out the chicken was really good without the dressing but was even better with. \n\nOnly down side was the lack of some sort of bread. Since this was over $10 for it, that would have made it perfect.  I know the Mediterranean area is full of bread items, throw them in!\n\nStill can highly recommend everything!",
   "The food is delicious and the rice was soooooo amazing!! Definitely eating at this establishment again!",
   "Food was ok but not what I was expecting from a Greek like place to eat. It was clean and quiet atmosphere. More like a fast food place to eat"
  ]
 },
 {
  "name": "Green Olive Restaurant",
  "address": "922 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/770f050c-932f-11ea-bcb6-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "kids",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14189464936858804869",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoyed my visit to this restaurant. The food was good, service was excellent, (glass was full, checked on me, and ensured food was good) and the servers were nice. The restaurant was clean and well lite. I found the prices as average for this type of establishment. I enjoyed my food. The pita bread came out hot which was a first for me. Usually it is cut up in most places but you get the whole bread here. It is located behind the capital buildings. I look forward to going back.",
   "Great spot for Mediterranean food. This was my 2nd visit here.  Wait staff this time around wasnt as good as the first time I came. I wanted a side of mayo for my fries and I had to remind her after 5-10 minutes that i was waiting for it. I also asked for extra chicken in my chicken wrap and didn't get it and I asked for an extra portion of gyros for my takeout gyros platter and didn't get that either. I wasn't charged for them, so I didn't lose out.  I will be back again though as this spot is close to work and the food is always tasty.",
   "Delicious Mediterranean Food.\nI had the Gyro-which came with rice and vegetables. Austin, our server was excellent. We split the Baklava and were not disappointed. All was very well done. Highly  recommend!",
   "Love, love Green Olive. Gave it 4 instead of 5 stars due to sometimes it seems like they're short on staff. The food is delicious. I always come for the calamari and gyro with fries. Restaurant is neat and clean.",
   "My family went here when the first place we tried wouldn't take a large party, but I'm glad it worked out that way!  The food was great, especially the fresh baked flat bread.  My kids loved the shrimp kabobs.  Our server was very friendly and personable."
  ]
 },
 {
  "name": "Main Street Public House",
  "address": "1556 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77553600-932f-11ea-9faa-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "creative",
   "food",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3956833557424344277",
  "source": "GoogleMaps",
  "reviews": [
   "Server was very attentive and helped with every request we had. Made recommendations on everything we got and the food was great. Always a brilliant place to eat and drink.",
   "Great find!  Tremendous service and fantastic food.  Very creative menu.  Beautiful restaurant.   I went for dinner and then back for lunch.   Can't wait for my next trip back to Columbia!",
   "Great place for food and drinks. Yummy food at fair prices. Excellent and knowledgeable staff. Wonderful beer menu and whiskey selection. Sparse cocktail menu, but quality ingredients. Dry rub wings are incredible if that’s your thing.",
   "Good beer and food. Prices are OK. Service was very poor. Not a lot of people at the place yet it took forever for a few plates in our table. Some of us finished our food before others were served. Two people on my table received their plate and not their side. Received the side after finished they finished their food. Manager came and said sorry and that we were lucky it didn’t take longer. Unfortunately the good food was overshadowed by the poor kitchen service and manager.",
   "Didn't have a reservation for New Year's. We were fitted in within 30 minutes. Disappointed they were out of truffle fries though it looked like people that came after us had them served. Good service."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "902 Gervais St Ste A, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/779af1c8-932f-11ea-b1fa-14b31f159f22.png",
  "tags": [
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=15102573630307670133",
  "source": "GoogleMaps",
  "reviews": [
   "Staff greeted as we came in and as we were leaving. \nSteak was cooked to perfection. Teddy, our server, was awesome. Manager came by to ask how everything was. It was my friends birthday so they gave him a big dish of ice cream with whipped cream... overall, it was wonderful. I HIGHLY RECOMMEND this Longhorn Steakhouse.",
   "LongHorn lived up to its reputation in Columbia. Good food, good service and great ambiance. It was not very crowded which supported a faster service as they were six in our group. We also observed an even bigger group that also received similar service from the staff. There was a mix up with one of our orders, but management stepped in and quickly fixed the problem.We will be coming back.",
   "This is a very unique longhorn. It's in a very cool historical building. The service was excellent. They accidentally overcooked my son's steak, but took it back and had him a new one in no time. They had very good cocktails. I had the old fashioned and it was amazing. Just an over all very good experience. I would recommend anybody to try this location.",
   "I ordered the Cesar salad with chicken, the lettuce didn't taste very fresh, bitter and the dressing was awful, too thick. The smokehouse chicken wings were amazing!!! I'd return to order those chicken wings 👍",
   "Longhorn Steakhouse never disappoints.  One of the Best Steaks!  The Wild West Shrimp and the Strawberry Daiquiri are the Best Around!!"
  ]
 },
 {
  "name": "The Devine Cinnamon Roll Deli",
  "address": "2617 Devine St, Columbia, SC 29223, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/77e2d052-932f-11ea-b20d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10803321111250882561",
  "source": "GoogleMaps",
  "reviews": [
   "This place is luscious! Reminds me of my grandmother's kitchen. The smell of sweet cinnamon rolls fills the air and you are hit with it immediately upon entering the space. Such a cute and quaint space for a nice breakfast. Had the shrimp and grit bowl which was quite filling and delicious for the price. Loved that they include a mini cinnamon roll with each purchase. Just enough to satisfy my sweet craving! Will definitely be back to try the maple and bacon cinnamon roll 😋",
   "Great cinnamon roles bar none. What I was not expecting was how good their food was. I have a hot dog and it was pretty much the best I have ever had. Served on a brioche bun and the chips...wow. so very good. Get there early. They get crowded and close early. \n\nEveryone should go here if your passing even remotely close.",
   "Going to Cinnamon roll deli is always a great experience. The sandwiches are delicious and the cinnamon rolls are out of this world. Although parking is limited and there is normally a line, it is worth it and the owner is always trying to make sure that you have a great experience. She brought out waters and chip s while we waited. The food came out fast and there was a lot of it. Definitely recommend to everyone. It’s the first place I mention whenever anyone asks for recommendations in Columbia",
   "Everything is delicious. The food is absolutely worth the wait for  breakfast or lunch. And the owner is amazing, she make sure her customer are enjoying there food. I can’t wait to go back! The cinnamon rolls are not overly sweet they are the perfect Balance! They have something for everyone.",
   "My husband had the Big D sandwich, which he said was absolutely delicious! He also had the Carolina Nachos, which weren't great. They were freshly baked chips topped with cold chili, shredded cheese and sour cream. Would be better warm. I ordered two cinnamon rolls, the Wild Berry & graham cracker was delicious. It was fairly dark and crunchy around the edges, but still good. I also got the Black Pepper Maple Bacon cinnamon roll. The menu says this one was featured on the Food Network, but I'm not sure why. The roll was good, but it was all sweet and no salty. I could barely taste the pepper and the bacon had no flavor whatsoever. I might return again to try a sandwich, but as others said, parking is awful and it's not worth waiting in line if you go on a weekend."
  ]
 },
 {
  "name": "Camon Japanese Restaurant",
  "address": "1332 Assembly St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7833618a-932f-11ea-9952-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12448081983572710085",
  "source": "GoogleMaps",
  "reviews": [
   "It's really hard to go to any other restaurants in town because when I'm eating, I just think, \"Man, I could be eating something at Camon right now.\" 10/10 best Japanese food around, especially the sushi and curry. The service is excellent, staff is friendly, and - I cannot emphasize this enough - the food is incredible. I've had sushi around the world, including several restaurants in Japan, and Camon's is still one of my top favorites!",
   "Delicious sushi! Great sushi bar and people.",
   "Best sushi and authentic Japanese food in the area. You'd be hard pressed to find better in Okinawa or Sapporo. I personally suggest the Eel and softshell crab rolls. It was amazing! Just be careful of \"the sake\" it will sneak up on you and bam!!",
   "Best sushi place In Columbia hands down been coming for 20 years.  Always fresh and highest quality",
   "The sushi here is pretty good except they need to go light on wasabi!"
  ]
 },
 {
  "name": "The Pot Smoker BBQ",
  "address": "931-A Senate St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7876100c-932f-11ea-aa46-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "walking",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16205554081529908934",
  "source": "GoogleMaps",
  "reviews": [
   "First BBQ place we tried since moving to Columbia and we were not disappointed. Homemade sauces are great and I loved my Pulled Pork Plate!",
   "Brisket sandwich was huge. Tasted great with the different sauces. Hash and rice was not what I was hoping for, would get something different next time. Pork was also tasty. Great service dining in, nice outdoor patio seating with water features. Great place but not much parking, as typical in most places downtown.",
   "Amazing food the reason I actually came here is I was driving by and could smell the most amazing smell of bbq chicken! So delicious and so well prepared 5 out of 5 stars hands down! Will be returning!",
   "Just walking by The Pot Smoker will make you hungry. The delicious smokey aroma draws you in. We ordered the redneck nachos and bbq plates. Let me tell you...I am not a huge fan of pork rinds but their nachos use them in place of chips and are piled high with tons of smoked pulled pork, cheese, and bacon. These things can be a meal on their own. Prices are fair, staff is friendly and informative, and the food is excellent. This is definitely a must stop in if you're in Downtown Columbia and love BBQ.",
   "Bit into the Brisket sandwich and yelled \"Shut your face!\" The sandwich was amazing. You should eat one! Great prices and really good food.  Thanks for a memorable meal."
  ]
 },
 {
  "name": "Golden Bay Seafood Restaurant",
  "address": "6164 St Andrews Rd, Columbia, SC 29212, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/78bb0870-932f-11ea-b36e-14b31f159f22.png",
  "tags": [
   "delicious",
   "organized",
   "food",
   "food",
   "delicious",
   "cheap",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3235779282609237410",
  "source": "GoogleMaps",
  "reviews": [
   "Very clean and organized restaurant.  Service was quick and server was friendly and courteous.  Food came out quickly and was hot and delicious.  The flounder was mouth watering good. They have a nice menu with plenty to choose from. And the prices are very reasonable. The restaurant is decorated nicely throughout.  Great job folk's!",
   "Great little seafood establishment. Obviously not well known or else it would be more crowded. Great seafood and wonderful service. Prices are VERY reasonable.  Have been here several times and the food is ALWAYS good. The atmosphere is casual, food is always good and service on point. Will definitely be back!",
   "I am a seafood lover and I came across this restaurant on Facebook so I thought I'll go and check it out..OMG I don't know where to start, because everything was excellent. I ordered  the Captain Platter and it was soo fresh ,hot, delicious and the price was amazingly cheap. I once was a fan of Red Lobster not anymore Golden Bay is my New seafood spot. If you don't believe me go check it out for yourself. You will truly change your mind about going to any other seafood restaurant. I give this place 10 ⭐ and 10 thumbs up👍❤",
   "The food is incredible. It does not take very long to get your order. And the owners and staff are extremely nice. They make you feel like a part of their family.We visit here about three or four times a month and have yet to be disappointed.",
   "Eating fried sea food; you don't know what to expect... will it all be breading, is there flavor? THIS PLACE IS EXCELLENT!! Light on the breading and packed with great flavor! I followed the waiter's suggestion for adding tossed cracked pepper and salt; it was not overwhelming, but a nice kick to the food. I was too full for dessert, but I will be back... maybe next time. The waiter was very attentive. Thank you for a great dinner."
  ]
 },
 {
  "name": "The Mouse Trap Columbia, SC",
  "address": "2711 Middleburg Dr, Columbia, SC 29204, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/790dbcf8-932f-11ea-830f-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14148282602160503212",
  "source": "GoogleMaps",
  "reviews": [
   "I believe we stopped in Monday, May 6, 2019. I have eaten here twice before it was remodeled/redone. Both of those time were fresh and delicious. This visit was delicious as well. They had trivia night going and sounded like fun, although we did not participate. We started off with the Oysters Rockafellas. This appetizer is packed with so much flavor they will blow you away! My boyfriend had the Honey Mustard Chicken Salad and I had the Charleston Chicken as entrees. Both entrees were equally delicious along with the sides. Definitely an off the path place to check out.",
   "The cocktails were fantastic, and the service was amazing.  I think at one point we spoke to almost every staff member & they were all very sweet. However, I do feel like the food was a bit expensive for the quality.  Don’t get me wrong, it wasn’t horrible, the portions were adequate, but it wasn’t anything to swoon over, either.  Certain aspects of the meal almost seemed like they were frozen & then heated, rather than cooked fresh.  We generally enjoyed our evening, but I think if we returned it would be for the bar more so than the food.",
   "The crab cakes are excellent!  Fish Fry-Day features fried flounder, shrimp, hush puppies, and french fries and generally sells out, so order early.",
   "We tried the salmon wrap and a burger which was thick and juicy. Both were delicious and the service was good. I will eat here again. Recommend using GPS for location because it's at the back of the building.",
   "Excellent veggie burger! The fries are amazing. Family friendly atmosphere and neat history to the restaurant. Check out the cool bar made from old wooden doors. Mouse Trap is a hidden treasure and has a great menu."
  ]
 },
 {
  "name": "Bourbon",
  "address": "1214 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/794c4c54-932f-11ea-9f7a-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14203418486820125123",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food, great service!",
   "Brunch was amazing. Best place to eat on sunday morning",
   "If you're looking for a happy hour special, Bourbon is hard to beat. 4-6 pm, $10 will get you a $4 beer, a shot of Bulleit bourbon, and a burger (no sides). If you want a beer that isn't $4 they charge the difference. And Bourbon burgers are solid. Delicious beef ground in house and cooked to order. Served on warm delicious butter glazed buns with onion, tomato, and Boston bib lettuce, with condiments on the side. Your choice of cheese. The beef is perfectly seasoned so that you can really enjoy the flavor of the beef without it being overwhelmed by a lot of excess toppings.",
   "This place is amazing. It's my second time here and my food was beyond expectations both times. This time I ordered the lamb burger and egg rolls. The bartender was great and helpful. Will be back soon.",
   "Neat little place! \nI've been wanting to try it for some time. I finally made it there for brunch. (Mimosas are very good and inexpensive)\n\nI hope to get back soon for dinner and cocktails. They have a great selection of liquors from common to rare.\n\nI definitely recommend Bourbon."
  ]
 },
 {
  "name": "The Villa",
  "address": "1704 Bush River Rd, Columbia, SC 29210, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/799ed98a-932f-11ea-a635-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "delicious",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=3449007587549643531",
  "source": "GoogleMaps",
  "reviews": [
   "This Villa Special large pizza was enough for  \nthree. It was delicious and beautiful, look at it. Better yet, go eat some. We've been visiting this Bush River Road Italian spot since it was built, oh maybe, forty years.Yes, I know, we can hardly believe it either. When there was another \"the Villa\" in Five Points, they also were known for great flavor.They still have that special touch. We celebrated my wife's birthday here. Yum!",
   "The atmosphere and staff are great, but the food is not! The pizza crust reminds me of something you can get at a gas station, though the toppings were good. When I mentioned it to the staff, I was told that their regulars would revolt if they were to change the crust! Well I say that you should get a new set of regulars, because they have no taste in pizza! Go for the atmosphere, go for the wine, but don't go for the food or you will be disappointed!",
   "Fast service on my lunch hour and reasonable prices for my purse.  Plus all the menu options I've tried so far have been delicious!  Plenty of options for dieters, too.",
   "I 🧡💜 The Villa!  Beef & onion pizza and salad with meat & cheese with sweet tea....that is what was for lunch!",
   "Would make a great place for a date due to ambiance. However, their pizza was not great. I was surprised to learn that they didn’t have fresh garlic as a pizza topping given that it’s an Italian restaurant. Pizza did not have enough cheese and was heavy on the pizza/tomato sauce. Sauce tasted like it was straight out of a can. I can’t comment on their other items but was disappointed with their pizza."
  ]
 },
 {
  "name": "City Limits Barbeque (food truck)",
  "address": "2605 Devine St, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/79ea618a-932f-11ea-adab-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=17255849418043385835",
  "source": "GoogleMaps",
  "reviews": [
   "Ate here today for the first time, it was at WECO. Believe the hype this truck is the best. The brisket is so good, I’m really looking forward to being able to try the beef ribs when they have them.",
   "Great people, awesome food. Absolutely worth any sort of wait. (Usually there will be good beer nearby)",
   "Oh boy...where to start...I was hunting down beef ribs standing in the cold for 30minutes  to get them only to be disappointed when the person in front got the last of the ribs...but it forced me to try the Brisket and Pork belly bites...omg soo good. Can't wait to get the ribs. There is a fine line of wanting someone to be noticed and successful but not so much that it makes it impossible to get your favorites for yourself....lol\nGouda mac n cheese was great also.",
   "Robbie catered an event for me this month and it was simply AMAZING!!  My friends who are huge BBQ fans all said it was the best brisket, pulled pork and chicken they had ever had!  The service was tremendous, Robbie was so easy to work with.",
   "This is the best BBQ in town. City Limits combines top-quality meats with flawless execution on the smoker to deliver a fantastic product. The beef ribs are the only ones of their kind in the Midlands. They combine tender beef, a smoky finish and a peppery bark for a taste of Texas Q in South Carolina. "
  ]
 },
 {
  "name": "Michael's Café & Catering",
  "address": "1620 Main St, Columbia, SC 29201, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a339fc0-932f-11ea-b3b1-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18169583857816883072",
  "source": "GoogleMaps",
  "reviews": [
   "Our daughter was married 2/25/17. We booked the facility connected to Michael's Café called Agape Conference Center - Hampton Room. Michael's provided the catering for both the rehearsal dinner and reception. Everything was wonderful! A small group of us even returned on Sunday morning for their brunch. Highly recommend this venue for any type of event or business meeting when combining with their catering. Allison our event planner was great to work with and had her own check list to help us as we planned.",
   "Stopped in for a quick lunch downtown and loved the atmosphere. The food was delicious and service was great. I will definitely be returning.",
   "Used to love this place but it has really gone downhill ever since it changed to \"the venue on main/main course/top golf/Michael's\".  Service is just terrible now so just be aware of.what you're potentially getting yourself in to if you decide to go.  Having said all that, the food is consistent.",
   "This brunch experience was amazing. We walked in and were seated immediately. The staff was very friendly and the drinks were amazing. The food was incredible. This is definitely a spot where I will be visiting once a week.",
   "The menu is top-notch, if a little pricey, and the staff are extremely friendly and personable.  Just be careful not to get lost in its layout."
  ]
 },
 {
  "name": "Cellar On Greene",
  "address": "2001 Greene St D, Columbia, SC 29205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "GoogleMapsPhotoLibrary/7a7e8bae-932f-11ea-b585-14b31f159f22.png",
  "tags": [
   "delicious",
   "learn",
   "knowledgeable",
   "food",
   "food",
   "creative",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2175220414566046442",
  "source": "GoogleMaps",
  "reviews": [
   "Small, quaint, and intimate. I have been looking for a decent wine spot in this city and I am happy to learn that I have found one! WINE LOVER FRIENDLY. Not a huge selection of foods on the menu but the available options are tasty. Snacks and desserts are offered but the main focus feels like it’s on the wine. The bartender definitely knows her stuff and was able to accurately recommend two different wines based off my palate and preference.\n\nI got a Skillet Seared Cab Flat Iron Steak (medium) and the Dark Chocolate-Caramel Soufflé. The entry and dessert were more delicious than they look… if this is even possible.",
   "Great service in a cozy setting. I've never had a bad meal here and it's a wonderful place for a date night. Of course, don't forget about the wine. The knowledgeable staff will help you find a great pairing to any dish. It can sometimes be a wait to get a table but it's worth it.",
   "This is some of the best food in Columbia and just like the name suggests has one of those most varied wine Selections in Columbia. The reservation is probably recommended especially for Friday and Saturday. The dishes are amazing and the chef is amazing with everything I've ever eaten here cooked and plated to perfection",
   "Casual non pretentious atmosphere. They have an excellent, rotating wine selection. The food is consistently good and the menu changes werkly. The servers can help pair wine with food. Want to taste a new wine? Just ask!",
   "Wonderful evening and the 3 for $29 is a great value. Excellent wine list, creative and well executed food items, and a friendly and educated staff make for a great date spot.  Thanks to Jessica, Joanna and the rest of Cellar's staff for a delicious date night for our anniversary."
  ]
 }
]