[
 {
  "name": "Columbus Museum of Art",
  "address": "480 E Broad St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7acb253a-932f-11ea-937f-14b31f159f22.png",
  "tags": [
   "art",
   "free",
   "delicious",
   "tour",
   "food",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13788151179204151493",
  "source": "GoogleMaps",
  "reviews": [
   "Not a huge museum, but definitely has some interesting pieces to checkout. The employees were extremely friendly and awesome to chat with and discuss the artworks with. I had a really wonderful time here and enjoyed this museum a lot. The sculpture garden was really beautiful and perfect for warm weather. Definitely recommend.",
   "Small, but neat collection with emphasis on modern art and art of African American experience. The atrium with skylight is a breathtakingly beautiful space. I loved the idea of calling the number using my own phone to hear about the most prominent art pieces. However, the narration sounded like a voice mail that wasn't prepared or rehearsed.",
   "In years past I did not particularly enjoy this Museum because it was mainly portraits of dead people that were dark and without character or emotion. That era is gone now. The displays I saw recently were varied, lively, and interesting. The glass works in particular were amazing and the suspended Barrel it's always moving. The best part about the visit was to see all of the interactive opportunities that draw in all ages but especially young people and children. It would be wonderful if the funding for the museum was such that they were able to have other occasions with free admission has the Sunday I was there it was packed. There is a demand for this amongst those who don't have the pocketbook for it.",
   "For a small museum it's very well maintained and the calendar of exhibits are wonderful. Definitely worth a visit but have a look at their website to see what is currently featured. After your tour of the exhibits take a break and enjoy the cafe. Since it's change a few years ago it's become a fantastic place for lunch! It faces the sculpture garden and it's a fantastic way to while away the afternoon. The food is delicious and the view is inspiring.",
   "The museum is a nice place to come and enjoy the beauty that others have created. There is much diversity with the types of art on display. It is also very nice to come on Sunday's when it is free admission. It also has a very nice gift shop as well. Oh, and the architecture itself in the building is beautiful also!"
  ]
 },
 {
  "name": "John F. Wolfe Columbus Commons",
  "address": "160 S High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b0c7aec-932f-11ea-8dd8-14b31f159f22.png",
  "tags": [
   "field",
   "free",
   "music",
   "free",
   "field",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1120034394897274454",
  "source": "GoogleMaps",
  "reviews": [
   "I visited with my Glambaby around Christmas🎅🏽🤶🏼. This  was put together nice. A beautiful scenery of Christmas 🎄⛄lights. The Merry go round was closed because we arrived late. We enjoyed it even though it was really🌡️🌧️☄️",
   "Great centralized park, with a nice holiday light display for a relaxing stroll. Portable toilets are available and there is plenty of areas to just sit and relax. The central field does get muddy at times, so be aware when you choose footwear",
   "This place is amazingly beautiful, it is safe to ventured day and night. Security is visible at all times, decorations are beautiful and it always clean. The area is small but it worth visiting. It would be awesome if they let volunteered sing or put free music at night.",
   "They have awesome stuff happening down there! It's Christmas time right now and my children really enjoyed the lights, free hot chocolate, free train ride, and free carousel ride. They also had face painting, ballons, and Santa. During the summer they also have free concerts and events as well. I'd  highly recommend this place.",
   "It is beautiful this time of year..it's a must see. Go see the lights and kids can ride the carousel and run in the field. There were also amazing carolers to get you in the Christmas spirit.  A nice space."
  ]
 },
 {
  "name": "Schiller Park",
  "address": "1069 Jaeger St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b5332fa-932f-11ea-9f68-14b31f159f22.png",
  "tags": [
   "walk",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15812052079477598137",
  "source": "GoogleMaps",
  "reviews": [
   "Cool park in the middle of German village. Great place to walk around. There's a parking lot that would hold about 30 cars on site and street parking around the border. There is a playground, a pond, a stage for theatrical performances and a bunch of shade trees. A few Pokemon gyms as well if you're into Pokemon go. It's not big, probably a 20min walk around the outside, but the surrounding community is nice to walk around as well, especially if you are into architecture.",
   "We absolutely love this hidden gem in the middle of German Village. We take walks there as often as we can. During the summer we occasionally take a blanket to spread out under a tree and just enjoy the park views and the people. This park is also very pet friendly. We have also been told the pond provides a good fishing experience for children.",
   "Amazing park, quite and peaceful. The park hosts free outdoor theater sometimes during the warm season. You can bring your own food and chair to watch the show.",
   "Fairly expansive green space in old German village.  Great contemplation pond and overall well maintained grounds.  The park is frequented by lots of dog walkers about.  The long running summer en plein air theater hosted here is a tremendous contribution to Columbus' arts situation.",
   "It’s worth seeing this statue at least once. Around the statue is a brief story about the statue and the German community here in Columbus. Not to mention a stroll through Schiller park is just what I need sometimes to relax and enjoy the day."
  ]
 },
 {
  "name": "Topiary Park",
  "address": "480 E Town St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7b9bd61a-932f-11ea-9d2a-14b31f159f22.png",
  "tags": [
   "creative",
   "library",
   "walk",
   "library"
  ],
  "link": "https://maps.google.com/?cid=9767702327445260304",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of my favorites stops in Columbus.  It is great to see in all seasons.  Steamy hot summers.  Those cool fall nights while an outdoor movie is playing on the large inflatable screen.  The middle of winter when the snow is covering everything.  Or just like yesterday, January 1, a cold, but clear day.  \n\nTons of squirrels running around most of the year.  Lots of birds in the good weather months.",
   "It's a beautiful park. Super impressive and a very creative idea. I was really impressed. Plus the library next to it is AMAZING. I would love to go back when or if it ever gets sunny/warm.",
   "Very pleasant place to walk near the heart of the city.  It is fun to see a painting brought to life. We realized more deeply this time unlike the painting of Sunday in the Park you can change the perspective.  Moving around and viewing it from different angles changes the experience.",
   "Nice little park in downtown that's really well kept all year round. Next to a library and a high school!",
   "Went out of season would probably look amazing in the summer time"
  ]
 },
 {
  "name": "Scioto Mile Promenade",
  "address": "233 S Civic Center Dr, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7bf50038-932f-11ea-adeb-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "kids",
   "family",
   "parks",
   "walking",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1243475892647127320",
  "source": "GoogleMaps",
  "reviews": [
   "It's such a lovely area now with growing shade trees. We took our dog and teenagers for a picnic and it was so nice. It seems to be all open when you walk along the several levels of sidewalks, but when you settle in a grassy area, it feels like you have your own yard with neighbors walking by.",
   "Clean, nice and long beautiful trail that leads to a wetland in one direction. I love the beauty I often encounter",
   "Absolutely gorgeous and very well maintained. An incredible asset to downtown. Super convenient for lunchtime strolls, jogging, etc. Very accessible - lots of ramp entrances in multiple locations.",
   "Absolutely gorgeous and a joy to visit! My family loves walking downtown and seeing everything they can, and they're always building onto parks and building new parks and other places o  a regular basis, so you won't get tired of going; trust me, it's hard to keep a childs attention, but our crew of kids are 4, 8, 8, 9, 10 & 12... And they're NEVER bored of being down there!! Great places to have a picnic or just relax under a tree with a book",
   "Relaxing.  Great area to walk, run, ride bikes. Lots of benches to sit and reflect. Porch swings. Beautiful view of downtown.  Great vibe. Splash pad for the kids 2 play in the water."
  ]
 },
 {
  "name": "Bicentennial Park",
  "address": "233 S Civic Center Dr, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c3dc368-932f-11ea-adee-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "walk",
   "walking",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=1975661373267461912",
  "source": "GoogleMaps",
  "reviews": [
   "This is my favorite place to ride my bike in Columbus. It’s about more than just any one element, it’s about the possibility of the unknown that might be new every time. Of course, you can people watch, take in the views, relax & just sit back on the banks of the river & chill. The views & sites are beautiful & amazing, personally I’ve stopped to watch skaters filming tricks using the unique structures (a few times), toddlers playing & discovering the awesome effects of the water fountain, girls row teams embarking & disembarking from the river, photographers with their modals, runners in races... the possibilities are endless depending on the path you choose & the time you take.  Not to mention the 229 restaurant with it’s fabulous food, views & lite easy vibe.",
   "Beautiful scenery great paths to walk and admire the skyline and river. Looks amazing at night time but be careful out there! Only complaint is there is ABSOLUTELY no restrooms. They have locked bathrooms 24 hours a day, so don't waste your time walking all the way to them!",
   "Had a great time working on a photography project at Bicentennial Park. Love this park! Great for kids and adults alike. Plenty of shops if you like that, me? I’d rather be here relaxing at the park with my dog Lexie.",
   "This area is just one of the better places in Ohio I may say. I would love to spend lots of time here if I had it. Would be perfect for like even just a date.",
   "What a beautiful Park located in the heart of it all. This was my first time visiting this location and I could not be more impressed. I came down to the area to put my paddle board into the river and paddle around and I was very impressed with how easily accessible the Waterway was and how beautifully clean the area is being kept. This location is very easy to get to, clean, and I felt very safe. The views were spectacular especially from the water and I really enjoyed my day. I highly recommend this location to others and I will definitely be back again."
  ]
 },
 {
  "name": "Center of Science and Industry",
  "address": "333 W Broad St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7c7cc864-932f-11ea-8b2f-14b31f159f22.png",
  "tags": [
   "drink",
   "kids",
   "food",
   "field",
   "learn",
   "kids",
   "family",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3400745502878202500",
  "source": "GoogleMaps",
  "reviews": [
   "Went to COSI after dark and it was pretty amazing.  The lines were a little long for food and drink so prep before hand.  It was great to drop being an adult and play/learn from the interactive exhibits.  The planetarium was mind blowing.  To see how insignificant we all are compared to the massive size of everything else.  The shows were also not childish so they were enjoyable.  There was not enough time to see everything so we will be planning a trip back next after dark.  I highly recommend this place if you have kids but also if you are an adult, just after hours on the special event nights.",
   "We went on a Saturday in the winter so it was quite busy. They have lockers to store coats which require quarters and is convenient. Variety of dining options for each type of diet.  The exhibits were great with a variety of activities for all ages. The Ocean space was my favorite and such a different take on ocean theme. Would definitely come back.",
   "This place was fun and we look forward to coming back and exploring more of it! The second floor has an AMAZING play area for toddlers (mine is 15ms) and older. It's a great place for them to run off steam. My son especially loved the firetruck he could climb in and pretend to drive.",
   "We had a school field trip here and we had a great time! The kidsspace was an excellent place to let the kids explore, learn and have fun in a more controlled environment. The gadgets section had many fun and educational stations and the progress area was a hit as well. I'm certainly considering a membership here for the family.",
   "Absolutely fantastic for kids of any age. They're supposed to touch and climb and hold everything, so as a parent, it's incredible. The little kids area is well-conceived, with cubbies, stroller areas, family restroom, nursing area, tons of interactive exhibits, and even a little sitting area with tables, chairs, sink, and paper towels for snack time. \n\nI hear there are things for adults too."
  ]
 },
 {
  "name": "Hayden Falls Park",
  "address": "4326 Hayden Run Rd, Dublin, OH 43017, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7cc6553a-932f-11ea-be35-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=635891355412219119",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice little falls and creek .There us a small parking lot ,and a few stairs .Once you are down the steps there is a wonderful wooden deck /pathway that leads to the falls. Well worth it .You would never know you were right off a 4 lane road",
   "Fair warning, this \"park\" is small.  A path to the waterfall and back.  Very little parking.  I thought it would be more.  The view was pretty, but there just wasn't much to it.",
   "There honestly isn't much to see here outside of the waterfall, so if there hasn't been a lot of rain, don't waste your time. \nIt was completely dry the first time I saw it and flowing at about 25% the second time. We only went the second time out of stubbornness after it had rained a bit. \nThe stairs and bridge take about 3 minutes before you hit the waterfall and have no further to go, so don't expect this to be a long jaunt. Definitely don't go unless you happen to be in the area and need fresh air.",
   "Absolutely beautiful! Such an awesome place that you would never know existed when driving by.",
   "Nice trail and beautiful waterfall. Tucked off right in Ohio. @otimages on Instagram! 🖤📸"
  ]
 },
 {
  "name": "Highbanks Metro Park",
  "address": "9466 Columbus Pike, Lewis Center, OH 43035, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d23bf12-932f-11ea-85ce-14b31f159f22.png",
  "tags": [
   "walk",
   "parks",
   "walk",
   "hike",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7451794177091148460",
  "source": "GoogleMaps",
  "reviews": [
   "Easy to navigate trail system.  Plenty of parking options, restrooms, playgrounds, picnic tables, and small grills.  We hiked a 6 mile loop in February.  Trails are nice and wide.  Most wore hiking shoes or boots because it was muddy.  The mud didn’t stop people.  There were people out and about on the sunny day, but not so many that you would feel overwhelmed.  Great park.",
   "High Banks is is so beautiful, great hiking/walking/running. One of the best metro parks in Columbus. The trails are very well kept, the trees are gorgeous in the fall, and there are a number of lovely views. It is a great place to run, walk, or walk your dog. The park is also nice and large, so you can easily get in some mileage.",
   "We've come here a couple of times now to go on a walk or hike while in Columbus. \n\nThe parking lot can get crowded on nice days, but we've always managed to find a spot. \n\nIt's pretty easy to meander through the different trails. There are quite a few interconnected ones, so it's fun to string them together. \n\nWe most recently walked on the dog path which is nice, but I prefer the hiking trails in the middle of the park. \n\nThis is a great place to come to get outside close to the city.",
   "Such a great area to walk, and my dogs love it too. its peaceful and everyone seems so vaooy to be there. Wonderful park",
   "Great! The path was clear and smooth for walking. Sights were beautiful and saw deer, squirrels, large woodpecker, and other birds.  Will visit again soon!"
  ]
 },
 {
  "name": "Columbus Park of Roses",
  "address": "3901 N High St, Columbus, OH 43214, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7d7a5efa-932f-11ea-9d1f-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13072460059033781109",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park.Very beautiful and pleasant. Huge park to walk around. Huge variety of roses can be found. Amazing feeling seeing all those colors. We went in summer which made perfect sense weather wise. We spent about a couple of hours good spot to spend a few hours walking around.",
   "I came the wrong time of year out of medical necessity.  It was still calming and relaxing, and the dog and I got much needed recreation and fresh air.  The ducks on the fishing pond were charming, as were the kids on  the playground... But the only flowers in bloom were wild ones untended by man, only invigorated by God.",
   "This place is an absolute Oasis... it’s very relaxing and serene.  A perfect place for a walk in the spring and fall especially. The flowers are absolutely breathtaking! Gorgeous to say the least... a grounding environments deed.",
   "Very good park for Pokemon GO, and plenty of benches for disabled folx like me. The whole area is nice too (from what I saw). Five stars!",
   "This would be a great park if it wasn't always so packed. But foot traffic helps keep the park funded I guess. Some additional parking spots would be nice tho."
  ]
 },
 {
  "name": "Franklin Park Conservatory and Botanical Gardens",
  "address": "1777 E Broad St, Columbus, OH 43203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7dc4b73e-932f-11ea-b5bb-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "delicious",
   "food",
   "history",
   "historic",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8151134564748058593",
  "source": "GoogleMaps",
  "reviews": [
   "Coming here is a small get away into other countries. You'll feel like you have left Columbus and entered into the jungles or deserts from across our amazing oceans. I do feel it wouldn't hurt for them to look into expanding the size of buildings and exhibits. Add in more plants and a little more variety.  However, it's a great place for adults and kids. Family fun for everyone. Cannot forget winter months, when the outdoor gardens are hung with lights and festive fun. Come check out your local garden !",
   "Absolutely amazing..It made my day :) September was definitely a perfect time to visit the conservatory. Gardens were at their best and we also saw a lot of glass work on t display. We even saw the glass work as a ceiling. There is huge butterfly room. Before you go to the butterfly rooms check the time when they release the new/baby butterflies to the room. The staff makes a display as they try to fly for the first time. The staff was very enthusiastic about what they were doing.",
   "Absolutely amazing place ❤️ Worth every dollar spent!!! The plant life is gorgeous and you can tell it’s well taken care of. I was absolutely in awe the whole time. I highly recommended giving this place a visit!!!! Also, the food at the garden cafe was so delicious and fairly priced! The staff were also extremely nice.  A must see place!!! So happy I decided to make the drive and spend the day here 😊",
   "I've been going to the conservatory since I was a child and I've always loved getting to see the Chihuly pieces intertwined with the flowers and trees. They've added a massive outdoor children's area that even in the winter seems very inspiring and adventure worthy! Not to mention their seasonal displays which are always beautiful and educational. As a history nerd, the current exhibit about Victorian green houses and flower arrangement was super cool in how it ties back to the conservatory's own history. Always a lovely experience!",
   "The conservatory is a historic treasure.  Some parts of this area are 125 years old and make you feel part of a bygone era.  Amazing plant variety and displays.  Went to see the Chilluly exhibit at an after-hours event.  Very classy!  Music, drinks and upscale snacks made this a night to remember.   You should come and experience it for yourself."
  ]
 },
 {
  "name": "Wagner-Hagans Auto Museum",
  "address": "476 E Kossuth St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e18e95c-932f-11ea-9916-14b31f159f22.png",
  "tags": [
   "walk",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1872770936839223994",
  "source": "GoogleMaps",
  "reviews": [
   "Great little bit of history tucked away in Columbus with a private collector who’s done his research and gives awesome little fun facts and trivia questions  during the whole  walk through. Thank you Steve for the amazing experience. 5/5 would recommend!",
   "If you're looking for something to do in German Village and you love cars, this is the place to go. I recommend you to call, since it's by appointment. They have cars from the 40', '50 & 60'. Also plates from different states and other countries... I found one of Puerto Rico! The host guide you and talks about every car they have, and kindly answer questions if you have any particular doubt.",
   "This is a great place to visit! Call and make an appointment before you go. It's really easy to do. Lots of artifacts from recent auto history...1940s onward.",
   "Fascinating place for car lovers as well as car noobs. Steve Wagner is an amazing person!",
   "To my knowledge, it is a private car museum owned by two life-long friends that have been collecting cars since their early 20's. As of late, these guys have accumulated between 40-60 cars, that are scattered around Columbus. This location holds roughly 20 cars, ranging from mostly old classics, to newer sports cars, with the vast majority being mint.\n\nI've passed this place so many times in the past, and I had always wondered what's inside... especially after seeing the pictures online, and even snapping a few myself as they rotated cars! I noticed the door was open on Labor Day, and I decided to stop in.\n\nI spoke briefly with Steve Wagner, and it's clear that they're just two car guys in love with what they do, and in love with these great classics. Their collection is open to all, but only by appointment. Tours are free of charge as far as I'm aware, and they prefer to hold them on the weekends. Contact information is still hard to find, but it is out there.\n\nOverall, this is just one of the many gems lying around Columbus, waiting to be discovered! I highly recommend taking some time to stop by, and to hear the stories they have to share!!"
  ]
 },
 {
  "name": "Ohio History Connection",
  "address": "800 E 17th Ave, Columbus, OH 43211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7e60a0f4-932f-11ea-a1c6-14b31f159f22.png",
  "tags": [
   "wander",
   "history",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12677374854580083323",
  "source": "GoogleMaps",
  "reviews": [
   "Loved it here. My wife and I were married here. Excellent selection for a wedding. I love you and you are my world, my breath, my everything.",
   "Wonderful insight to Ohio's past and what life was like in the late 1800s . Plenty of history and cultural galleries to wander through at your own pace.  The village is interesting also. It takes you back in time to a progressing era in our world. A great place for young or old to enjoy. The onsite cafe has plenty to choose from for eats. I would give yourself at least 4 to 5 hours to enjoy.",
   "A great way to spend a couple hours learning about regional and state of Ohio history. I particularly enjoyed the walk-through experience of the Lustron manufactured home, as well as the exhibit about Ohio soldiers' participation in the Civil War. Great for all ages! (Visited in Oct. 2018)",
   "A great way to spend a couple hours learning about regional and state of Ohio history.",
   "Came years ago for school and missed it so I visited again and enjoyed it!"
  ]
 },
 {
  "name": "Scioto Audubon Metro Park",
  "address": "400 W Whittier St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7ea6964a-932f-11ea-92a2-14b31f159f22.png",
  "tags": [
   "free",
   "free",
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=161785513614801599",
  "source": "GoogleMaps",
  "reviews": [
   "Love the free rock climbing wall.  The dog park is good as well.  Paved trail is good for rollerblading or biking!",
   "Trails seem to be well kept, and there is a rock climbing wall next to a playground. If you plan to climb, be sure to bring gear like harness and clip, as you could get in trouble for trying to free solo the wall without the gear. In addition to that, when it's not too muddy, theres an obstacle course just a couple steps away from the wall, and a water tower where you can take a good look overhead of the park.",
   "We love this park! My husband boulders and my pup and I love to walk the trails and pathway into the city. It also has a large kid's park next to the rock climbing pad. We really enjoy coming down here!",
   "Awesome park! Lots of walking paths and grassy areas. The obstacle course is really cool, and so is the rock climbing wall.",
   "First time visiting and our dog loved it, very clean, very friendly owners and a great way fornour dog to play with other you will love it."
  ]
 },
 {
  "name": "Ohio Statehouse",
  "address": "1 Capitol Square, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7efc4c98-932f-11ea-ac35-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "free",
   "tour",
   "history",
   "history",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=7034705459757195578",
  "source": "GoogleMaps",
  "reviews": [
   "We visited from Cleveland, and it was a wonderful experience to see the Capitol of our own state. Even on a Monday morning it was a quick, painless drive from a nearby suburb where our hotel was. We parked in the garage under the building that was easy to find and very inexpensive (for 2 hours it was $4). We began the free tour in the Map Room that has all of the counties of Ohio in stone, which was a very beautiful tribute to each location. The tour guide was very friendly and knowledgeable about the history of the buildings, as well as current happenings in the government. It is a beautifully done Greek Revival style building that has many tributes to the history of Ohio. There is also a very interactive museum that houses modern displays of new government as well as the original Ohio declaration. Everyone was friendly, had a kind welcome and warm smile. We felt so welcome and will be happy to return- an overall great experience. It made us very proud to be Ohioans!",
   "I'm so pleased that there's a cafe near our side with an interior layout of tables fully intended for their customers to linger over a coffee to work, chat, and socialize. This courtyard is delightful, with a shade tree and a dripping water fountain along a vegetated wall, that shuts out the ugly concrete grind just on the outside. The tables don't feel flimsy, and they are well sized for laptops or discussions among groups. Certain tables are closer to the outlets which are often thoughtfully pointed out, and most of the exterior tables are within proximity of one of their standing gas heat lamps, which is precisely necessary when seated for long periods. In all this is a cafe user's dream, which most other places don't seem to get right.",
   "What an incredible experience. Beautiful architecture, wonderful history and well preserved and detailed grounds. We had a great time. Parking was easy and affordable and everyone was friendly. This is a great tribute to Ohioans and Americans alike.",
   "Beautiful building! Definitely worth exploring. And the gift shop was lovely.",
   "I attended the Ohio's Hill Country Heritage Area Recognition luncheon. It was a wonderful event."
  ]
 },
 {
  "name": "Goodale Park",
  "address": "120 W Goodale St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7f47fbe2-932f-11ea-9f49-14b31f159f22.png",
  "tags": [
   "pets",
   "nature",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9173791493520643944",
  "source": "GoogleMaps",
  "reviews": [
   "The park is very clean, and taken care off. The people that come here with their dogs, are always taking care of their pets and making sure all the animals get along. Very pretty here and relaxing.",
   "One of the things I love about my neighborhood is Goodale Park, situated in the middle of Victorian Village. On any given day--especially from spring to fall--the park is filled with neighbors, dogs, tourists, joggers, picnicers, and nature lovers. The park is the perfect place for a morning or evening stroll, the perfect spot to play tennis on one of the many tennis courts, the perfect place to hold or attend a neighborhood meeting, and the perfect spot to soak in the sun. Definitely worth the visit.",
   "Best park in downtown! There are always a lot of people walking their puppies/using their hammocks here. There are also a lot of ducks around the fountain! Love coming here.",
   "Great place to enjoy a walk in the city. Grab coffee at Short North or the north market before hand. Very dog friendly!",
   "The area is great for crowds of all ages. Parking is challenging but you'll find a place. Most enjoyable in spring/summer."
  ]
 },
 {
  "name": "ZipZone Outdoor Adventures",
  "address": "7925 N High St, Columbus, OH 43235, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7f9ea774-932f-11ea-8bc7-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=13470604192345954962",
  "source": "GoogleMaps",
  "reviews": [
   "We had so much fun here! They train you and help you all along the way. We did the zipline in the trees and the scenery was amazing! Staff members were funny and very helpful. If you want a fun trip to do something different I highly recommend this!",
   "The instructor was super friendly and thorough! Very fun and out of the box activity to do! I was there with a group of 22-27 year old adults but saw families and people of all ages there!\n\nThe only reason I gave them 4 stars is due to the location, you have to make a u turn to find it! And the path to the “parking lot” is super narrow",
   "We love ZipZone! Our first time there was great. Staff is super friendly, & understanding for people like me who are afraid of heights. There is a variety of levels available for different skills from easy to extremely difficult. The forest is beautiful & shady. Can't wait to go back!",
   "Had a wonderful and it was a beautiful day. Will definitely go back",
   "It was very fun and the staff was great. They emphasized safety and they were very patient with people that were scared. I will probably be back to do the adult course because I took the kids. Despite that it was a fun place if you enjoy outdoor adventures and activities."
  ]
 },
 {
  "name": "LEGOLAND Discovery Center Columbus",
  "address": "157 Easton Town Center, Columbus, OH 43219, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/7fdbfedc-932f-11ea-8685-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "creative"
  ],
  "link": "https://maps.google.com/?cid=1898422913986848077",
  "source": "GoogleMaps",
  "reviews": [
   "Let's just get this out of the way... the entrance is in the mall! Other than the entrance being a little hard to find this place is awesome. My 8 and 5 year old had an absolute blast and they cannot wait to go back. The staff was very friendly, helpful and patient. We will definitely return!",
   "Lots of fun for the kids. They space out your start times to make sure it does not get over crowded. Constantly updating so every visit they seems to be something new for us. (We do not go that often though)",
   "It was an amazing day trip. Employee's we very nice and helpful. Kids had a blast. There is plenty to do and you can spends a few hours here. Kind of nice that it is in a mall. So if you want to go shopping after you can. Crowd was not bad for a saturday afternoon. Parking was easy. Great experience.",
   "This place has 15 minute 4D (3D plus spays water, fog and has lighting) Lego movies in the movie theater.\n\nSmall 4 person ride with lazer lego guns to shoot at tagets and at characters on multiple screens. \n\nHas some nice huge displays\n\nPlaces to build and race cars down two different tracks.\n\nHas a couple other areas that have sandbox type areas full of Legos to just be creative and build. \n\nA lot more than I expected.\n\nOh also has a small circular ride (2 seater) that has petals and the faster you petal you hight you a lifting in the air.",
   "We had a great day with our son. He is 10yrs old and had a great time.  Prices were fair for all you get to do, but having lunch there is a bit pricey.\nVery clean and safe."
  ]
 },
 {
  "name": "Central Ohio Fire Museum",
  "address": "260 N 4th St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/802e1690-932f-11ea-bbda-14b31f159f22.png",
  "tags": [
   "tour",
   "kids",
   "historic",
   "free",
   "knowledgeable",
   "learn"
  ],
  "link": "https://maps.google.com/?cid=1567853316950729208",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to visit with guided tour. If you have kids then they work great with them as well.  Highly recommend this for a visit!",
   "I visited the Central Ohio Fire Museum recently [10-24-2019] during a leisurely afternoon stroll between Italian Village and Franklinton.\n\nI had arrived at the Central Ohio Fire Museum about twenty minutes before they would be closing so the guy at the entrance let me in for free. Actually, I probably would have spent only about twenty minutes there anyway.\n\nI had been able to see, during my brief visit, several things that I clearly remember from my childhood [for example, a former black-and-white embossed City-of-Columbus \"street sign\" design that is no longer used and a former yellow \"telephone call box,\" to be mounted on a telephone pole, that is no longer used].\n\nThe Central Ohio Fire Museum building is historic because it had served for many years as a Columbus Fire Department fire house. The \"No. 16 ENGINE HOUSE\" words are clearly visible on the front wall of the building above the large doors.\n\nThe \"OSU-Michigan football rivalry\" had been clearly evident at the Central Ohio Fire Museum. The horse for a horse-drawn fire truck in the center of the room had been wearing both a \"University of Michigan\" cap [on the right side of its head] and a \"The Ohio State University\" cap [with only the word \"THE\" visible on the front] [on the left side of its head].",
   "small town but interesting things to see from horse drawn fire trucks",
   "Really cool place. Attended a birthday party here and it worked out really well. A lot of neat historical fire fighting equipment and the goddess were very knowledgeable and friendly. Would definitely recommend it.",
   "A nice museum  in an old firehouse from the horse drawn era. The real asset is Sue who is very passionate  about fire safety  and the items and rooms with actual fire damage so people  can see the effects  of fire.  Well worth the low admission  price. What you learn may save your life."
  ]
 },
 {
  "name": "Grange Insurance Audubon Center",
  "address": "505 W Whittier St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80805574-932f-11ea-99e5-14b31f159f22.png",
  "tags": [
   "walking",
   "walk",
   "family",
   "nature",
   "nature",
   "hike",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8895899707204354536",
  "source": "GoogleMaps",
  "reviews": [
   "Nice area, first time seeing it after walking trail for at least 3 miles.",
   "I really love going there. What used to be the cities impound lot, eyesore, was transformed into a beautiful park and mini nature preserve. Rock climbing wall, parcore course, nature and bike trails. Dogs are welcome, and there is a dog park for our furry family members. Be sure to take a walk through the Audubon center at the visitor center.",
   "Nature is all the more precious when it's an oasis tucked in the midst of the hustle and bustle of the city.",
   "I love the center and the surrounding park they have created over the years. Great place to visit with the family while on a hike!",
   "Great place for birding during migrations.  Bring binoculars and/or a spotting scope and have a blast!  Some years they hold the national birding expo at this location.  Highly recommend."
  ]
 },
 {
  "name": "Kelton House Museum & Garden",
  "address": "586 E Town St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/80d330a2-932f-11ea-872b-14b31f159f22.png",
  "tags": [
   "family",
   "cheap",
   "historic",
   "history",
   "tour",
   "history",
   "knowledgeable",
   "tour",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11597804035854049541",
  "source": "GoogleMaps",
  "reviews": [
   "Loved seeing the authentic furniture in the home and hearing the story of the family taking in the sick little girl slave who had traveled from VA.  The bsmt display where the slave would stay was great too!",
   "This is an interesting historic site, if you are a history fan, especially the civil war, you will definitely love this place. The guide here is very helpful and friendly. Also the ticket is really cheap, if you have student Id, it's only 4$. And they offer an electronic self guide system. So you can know everything about the house while enjoying the view.",
   "Such a rich history.  Had a very abnormal experience in the dining room.  I felt a sudden burst of tears and started bawling my eyes out during the tour. Not sure what happened but I felt fine as soon as I left the room. Beautiful gardens and wonderful staff.  If your nearby it's worth the stop.",
   "We were able to go mid-morning on a weekday and were the only people touring the building. The house is stunning and the single employee was very knowledgeable/ helpful in getting us started on the self-guided audio tour. As it was the holidays, there were local antique Christmas decorations throughout the house. With many rooms to explore and comprehensive information on the audio guide tracks, it was informative and overall a fun experience. It was too cold to tour the gardens and had there been a larger group our solo employee may have been overwhelmed, but if looking for history in Columbus this is a can’t miss!",
   "Lovely place to visit. Really liked the decor of the house. Went for the self-guided audio tour; it helped to have my wired earphones with me."
  ]
 },
 {
  "name": "Scioto Mile Fountain",
  "address": "Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81206678-932f-11ea-bea6-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "walk",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16455996228467109415",
  "source": "GoogleMaps",
  "reviews": [
   "Get cool..!!\n\nThis is a great place to get cool amid hot summer heat. Kids enjoy the splash. Enjoyp great walking along the downtown skyline view. Great view of downtown.\n\nStreet side paid parking available.",
   "This is a lovely park. It feels very safe, and I would definitely recommend it.",
   "This fountain is located in downtown Columbus and is a wonderful place to bring kids on a summer day. There are actually three types of fountain here where kids, and adults, can play around and cool off. The long stretch with jets of water shooting up from the ground is the most popular and there are children of all ages splashes around. There was someone on duty while we were there reminding kids to walk and not run. There are some tables, stone \"benches\" and plenty of grassy area to sit and relax while keeping an eye on your kiddos. We parked in the lot right across the street for a $10 daily fee",
   "Beautiful location. Fun fun all ages.",
   "Awsome fountains for the kids to play in. Not all of them were working."
  ]
 },
 {
  "name": "Inniswood Metro Gardens",
  "address": "940 S Hempstead Rd, Westerville, OH 43081, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/816781c8-932f-11ea-bbdc-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "pets",
   "walking",
   "walk",
   "family",
   "parks",
   "historic",
   "free",
   "kids",
   "art",
   "walk",
   "free",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9089113309968798275",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful little spot. Great variety of flowers. Pretty paths and lots of great places to sit on a bench and chill.",
   "Inniswood Metro Gardens was a lovely park to visit. The walkways were well maintained and the variety of plants and trees was impressive. I will certainly be back.",
   "A nice little getaway from the fast-paced city life. There's no admission and you walk right in. A good place to take the kids. No pets allowed though. Peaceful trails, beautiful flowers and wildlife. There's always couples walking, people playing Pokemon go, birdwatchers, or groups taking wedding photos or prom photos. Even with the variety of people, it's never too crowded.",
   "Of all the Metro Parks near Columbus this one has something for everyone.  Lots of paths where you can stroll past wildlife and trees, but it also has wonderful themed gardens, many of which are aimed at kids. Throughout the park it has art along the paths, from giant statues to small mosaics and everything in between. My favorite that they had in the past was a giant steel praying mantis. My daughter loves the \"hidden\" walled garden and my son loves the bridge over a stream where he can sit and watch for fish. If you want to take the family for a walk and enjoy a little bit of a lot of things, Inniswood is a great place to go. Also has bathroom facilities, picnic tables and a historic home on site. The park also prides itself on its flowers, they are planted everywhere and they are beautiful. Admission is free so take the family out for an afternoon and enjoy some clean air and stretching your legs!",
   "I really enjoy coming here, it's free! Walking around here is pretty wonderful and it's nice to have a place to go when I just want to get out of the house for alone time. I saw an owl today, at 5 pm, it was still light out! There are many different paths to walk through and most of them are labeled with the distance. There are also lots of benches scattered around and the place is well managed. The restroom condition is unknown to me, which is surprising. Thanks for reading, I highly recommend visiting, and I hope this helps."
  ]
 },
 {
  "name": "Pizzuti Collection of Columbus Museum of Art",
  "address": "632 North Park St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/81bca6e4-932f-11ea-87e0-14b31f159f22.png",
  "tags": [
   "tour",
   "art",
   "free",
   "free",
   "art"
  ],
  "link": "https://maps.google.com/?cid=3315891379333337079",
  "source": "GoogleMaps",
  "reviews": [
   "The Pizzuti Collection is always worth a stop. Now part of The Columbus Museum of Art, you don't need a separate membership to go. If you're from out of state and belong to a museum that's part of the North American Reciprocal, you can use that membership card at the Pizzuti, too.\n\nThe Pizzuti focusses on contemporary art and installations. It's on three floors and can be seen in less than an hour if you don't stop to read all of the interpretations. If you take a more contemplative tour, you can spend two to three hours seeing everything. \n\nThere are some metered parking spaces in front of the museum and ample parking in the various garages in the Short North.",
   "Fantastic exhibits time and time again.  If you haven't seen \"Chairs\" yet, do yourself a favor and check it out your list.",
   "Enjoyed the collection and the staff were very helpful.\nThe rooms and lighting  make viewing the works very enjoyable.",
   "Amazing place and free on Sundays",
   "It was so cool with lots of  different art. And the art is always changing. I went on the free day, and I really recommend it."
  ]
 },
 {
  "name": "Thurber House",
  "address": "77 Jefferson Ave, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/820066c8-932f-11ea-9bec-14b31f159f22.png",
  "tags": [
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=6924095837245581947",
  "source": "GoogleMaps",
  "reviews": [
   "An interesting museum in the house that James Thurber lived in and wrote about.  Thurber was born and raised in Columbus, Ohio.  He became a writer and cartoonist.  He spent much of his career writing and drawing for the \"New Yorker\" magazine.  The house is furnished much as it was in 1917.",
   "Took a trip to Columbus for some Paranormal fun and did a surprise visit to The Thurber House — the tour guide was amazing! We enjoyed our visit and for some awesome EVPs! Mame does not like her portrait!",
   "Great day! My niece became a Docent yesterday.",
   "Amazing place, so beautiful.",
   "Really cool piece of history."
  ]
 },
 {
  "name": "Wyandotte Winery",
  "address": "4640 Wyandotte Dr, Columbus, OH 43230, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82422b00-932f-11ea-b4c1-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "tasting",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=2928922350572979773",
  "source": "GoogleMaps",
  "reviews": [
   "We had an amazing time! The owner was so nice and answered all of our questions. The wine was some of the best wine I have ever had. We read reviews before going and had high expectations that were far exceeded. The back patio was so comfortable and the food was amazing. Anyone trying to find a nice low key place for a date or day trip with friends should definitely go to Wyandotte. We will be going back every chance we get!",
   "First time at Wyandotte and it was an awesome place. Great atmosphere and great service. Wine was good and the appetizers were very good as well. Wednesday is happy hour night so there are some great deals. We will definitely be back.",
   "My wife and I visited Wyandotte yesterday for the first time as a part of their Unwind and Rewind with Thrive. After a fantastic experience at Thrive, we were really let down by Wyandotte. After telling the man working that we were there for the promotion, he set us up with our wine and hummus plate, and then never came back to check on us, which was disappointing because we wanted to hang out for a few hours, and order lunch and a bottle or two of wine. \n\nI am not entirely sure how they split up sections, but there were two other employees who checked on the 3-4 surrounding tables while we had empty wine glasses 4 different times. I had to flag down our original server to ask for a tasting of two other wines, but he never came back to ask if we needed anything else. My wife was upset and felt like we were being ignored because we were there as a part of a promotion, so she asked to go somewhere else for lunch. It definitely was not how I wanted my wife to feel on our date, and made me feel cheap. There was a man in a black shirt that noticed our empty plate and 4 empty wine glasses (two from the promo and two from the tasting) after a few rounds of checking on other tables, but at that point, we were just ready to go. \n\nCompared to other reviews, it seems like this experience is the exception, but we probably won’t be back to find out, which is disappointing because the wine was fantastic. Our time here left my wife feeling insecure about herself since we didn’t receive much service compared to the other tables, which is the opposite of how I would ever want her to feel on a special date.",
   "Great place to meet friends drink some good wine,very laid back,fun..great staff",
   "Really enjoy the atmosphere!\nCustomer service has always been EXCELLENT\nWines are VERY TASTY!  They have quite a few choices.  Check Wyandotte Out!👍👍"
  ]
 },
 {
  "name": "Scioto Greenway",
  "address": "400 W Whittier St, Lockbourne, OH 43137, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82846440-932f-11ea-8c01-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "pets"
  ],
  "link": "https://maps.google.com/?cid=8769858501671174305",
  "source": "GoogleMaps",
  "reviews": [
   "Not crowded and has a good view...what can you ask more? Close to Columbus Science Museum and sometimes there is fairs at the park.",
   "Lots of open space. Kids loved the military style course. Great for most ages and abilities.",
   "Girlfriend took me and I was amazed . Great job down there",
   "It's worlds different than when I used to come down here as a kid for red, white, and boom. Letting the river flow naturally makes all the difference!",
   "Beautiful from the river to obstacle course and a great place for family & pets"
  ]
 },
 {
  "name": "Orton Geological Museum",
  "address": "155 Oval Dr S, Columbus, OH 43210, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/82d2ab86-932f-11ea-8eb4-14b31f159f22.png",
  "tags": [
   "library",
   "library",
   "free"
  ],
  "link": "https://maps.google.com/?cid=9484292276945019348",
  "source": "GoogleMaps",
  "reviews": [
   "This is a great place to stop in if you are in the area.  I took my 12 year old who is really into rocks, minerals and fossils and he loved it.  They have a great library across the hall as well.",
   "Great little museum to spend around an hour in when on campus. There are around 5-6 dinosaur fossils and several small fossils and minerals across many geological eons to explore. A geological library is also present next to it. A small store too.",
   "Great place to see fossils and minerals. My 8 yr old enjoyed it. It is a part of an OSU education building.  It's a small museum but it has a lot of cool stuff. The building it's in kinda looks like a castle which was also cool.",
   "Great little museum of geology. There are some great fossils and displays on various geological formations. Definitely worth a visit if you're in the area.",
   "Good local museum where you can meet Zeke the dinosaur.  Free admission and it takes about half an hour to see everything.  Best place in central Ohio to take children to see dinosaur bones."
  ]
 },
 {
  "name": "McFerson Commons Park",
  "address": "218 West St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8315f646-932f-11ea-8579-14b31f159f22.png",
  "tags": [
   "music",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=15042784381248529816",
  "source": "GoogleMaps",
  "reviews": [
   "I've been in Columbus since 1961 i am 58 yrs old the photo me was last year. Columbus has changed from a one cent pony town. To a vibrant mecca of specialized shops. Music so good from neck of the woods its impossible to keep up. We have are ups and downs homelessness has grown but its being dealt with frantically and carefully. The homeless are vibrant and weary but they are survivors. Some industry have changed Columbus. Downtown is a wonderful to be McPherson Commons Park is a fine example Mayor Coleman left as he finally retired from the mayorship after 12 beautiful long years. When you see the high rises all over Columbus you'll see Mayor Coleman. I met him last year panhandling for a sick friend. I also gave him money. I was amazed how he shook my hand and gave me money😲🥵😂i was truly happy to meet the man who gave Columbus a superior shot arm. Enjoy us,live with us. You'll love what you'll see 😉",
   "Great place to host an outdoor event.  Convenient parking and near the river with great views of the city. We were there for Leukemia and Lymphoma Light the Night event",
   "Arch from former downtown train station moved to this park. Nice size park well shaded and plenty of benches. Easy to walk around park. Park is across from Blue Jackets hockey arena.",
   "Very peaceful place to hang out. Was very quiet on a Wednesday evening.",
   "Arena District Athletic Club brings us here weekly in the spring and summer months. Love it!"
  ]
 },
 {
  "name": "Indian Run Falls",
  "address": "700 Shawan Falls Dr, Dublin, OH 43017, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/836268cc-932f-11ea-8c88-14b31f159f22.png",
  "tags": [
   "walking",
   "free",
   "nature",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=4647706025450977341",
  "source": "GoogleMaps",
  "reviews": [
   "A nice little park with a nice stream running through it. The waterfall is pretty relaxing plus its within walking distance to tacos so win win.",
   "Indian Run Falls is a neat little nature trail located in Dublin, Ohio. Has small yet beautiful falls and a nature trail the goes back about 8 tenths of a mile. When you pull in to the small parking lot there is a small log cabin and another one right behind it. Very scenic and peaceful to see and here the water ripple over the falls. If you are ever around the Columbus, Ohio area, make sure to stop by and pay this place a visit.  There are several other falls that are in the area as well. It's all free and well worth the stop to to get off the beaten path for a while and enjoy the scenery.",
   "I love coming here. You can tell a lot of effort was put into making this a place that people can enjoy. I especially like the observation decks.",
   "great place to have a moment of peace and enjoy nature! I enjoy dipping my feet in water every time I visit.",
   "Beautiful place, you would never expect this place by its surroundings. Definitely worth a visit."
  ]
 },
 {
  "name": "Glass Axis",
  "address": "610 W Town St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83ac9164-932f-11ea-8662-14b31f159f22.png",
  "tags": [
   "unique",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=6185017049923238634",
  "source": "GoogleMaps",
  "reviews": [
   "Just took glass ornament class tonight. It was incredibly fun & informative. Lisa was an excellent instructor and super encouraging to us first timers. Color choices were wonderful, the facility was great & the prices in their gift shop were super affordable. I'm getting my unique glass ornaments here from now on. I can't wait to take another class.",
   "Excellent!! Took the pumpkin class great instructors great fun!",
   "Went twice instructor was amazing with us. We made witches balls and tumblers. Amazing date idea!",
   "The glass blowing class was a lot of fun.  They have a shop full of beautiful glass decorations for sale. ",
   "Instructor was helpful and skilled.  Classes allow for easy introduction to the complicated processes."
  ]
 },
 {
  "name": "North Bank Park",
  "address": "311 W Long St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/83efb506-932f-11ea-8bc3-14b31f159f22.png",
  "tags": [
   "walk",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7314599676274039689",
  "source": "GoogleMaps",
  "reviews": [
   "A beautiful park with a spectacular view of downtown Columbus and the Scioto River. If the parking meters on Spring Street are bagged for no parking you can park in the Neil Avenue Garage in the Arena District. It's a very short walk after that.",
   "GORGEOUS. Would love to have my wedding here someday. The view is gorgeous; the space is cozy, yet big enough for a decent sized party (ceremony and reception). I would mainly just worry about parking, but there are a couple of parking garages just up the street (walking distance).",
   "Great place to walk or sit and think. I remember when it was being built.",
   "Married the love of my life and it was beautiful venues...gorgeous sunset, view...",
   "An absolutely amazing place to spend a few moments having lunch or hosting your event. Please, treat yourselves."
  ]
 },
 {
  "name": "Magic Mountain Fun Center - Polaris",
  "address": "8350 Lyra Dr, Columbus, OH 43240, USA",
  "avg_visitor_review": 3.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8432b1a8-932f-11ea-9b1d-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "cheap",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13831520885253186652",
  "source": "GoogleMaps",
  "reviews": [
   "I loved this place so much as a child. So many good memories here. I spent hours climbing up and down the massive play area and playing the arcade games.",
   "Overall, if you want a cheaper place to let your kids run around and play games for a bit it's a good place to go. However they opened their mini golf but no waterfalls working which may be normal since it just started getting warm and all the greens had holes and ripples through it making it really hard to play. We ordered pizza and fries and the food was terrible! I'm not expecting gourmet at all but the pizza wasn't even cooked all the way and tasted like cardboard and they burnt our fries to where they were dark brown. They didnt have any normal size straws and all condiments were out and the snack sitting area was filthy!",
   "Was here for a neighbor's birthday party. Liked the place. Children's gym kept the kids busy. Laser tag was exciting as well.",
   "This is a fun place in my opinion. It’s cheap you pay 5$ I don’t remember how many tokens you get but it’s a great deal. Games here are great to. There’s nothing that I don’t like about this place. But if you’re willing to splurge you should go to Scene 75 it’s really fun there to I wrote a review of that to 😁.",
   "We booked a party, under the impression the kids would be able to play (weird right?) When we got there my 4 year old was kicked or of the play area for not having a wristband. Ok, no problem, they come with the package. We asked the attendant who said our server would have them in ten minutes. After waiting about 30 we were told the children couldn't play until after the party was over. Which of course we were never told. We were told it was a sure managers decision. What kind of a company not only neglects to tell their customers vital information about their contracts?! Also, the food was absolutely disgusting and EVERYTHING was sticky. If we had known what we were getting into we never would have paid for they're \"service\" they absolutely ruined his birthday"
  ]
 },
 {
  "name": "Antrim Park",
  "address": "5800 Olentangy River Rd, Columbus, OH 43085, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/84827f8c-932f-11ea-bcd9-14b31f159f22.png",
  "tags": [
   "walk",
   "walk",
   "active"
  ],
  "link": "https://maps.google.com/?cid=8526703506149142362",
  "source": "GoogleMaps",
  "reviews": [
   "Our daughter loves the playground. It's small, but so is she.\n\nMy wife and I run here regularly. The oval path around the lake is great.\n\nCould use better restroom facilities, and you have to be careful of bicycles, especially as you first go under the bridge to the trails. It would be nice to have permanent restrooms, not port-o-johns, and some sort of bypass for the main entrance so people don't cross the traffic coming in either direction-speeding bicycles and runners with headphones going in perpendicular directions causes accidents.",
   "My favorite park of all times. This park has perfect sunsets. Beautiful views...It has a great path circling the beautiful Antrim Lake. If you just want to watch the view, that is fine as well, there are various places to sit and they are mostly available. You can walk your pet with a leash on. There is plenty of parking; no need to worry about. I advise you to bring a water bottle with you because there is no water fountain and no place to buy refreshments. This park is a heaven! I missed this park so much because I moved away.",
   "A very nice trail around the lake. A good path down to a dam in the Olentangy River. Wonderful rocks on the river shore: flint, slate, fresh water oysters, and more. Lots of fungi, too. There's a bike trail as well.",
   "What a beautiful place to walk... the walk around the lake is approx 1.3 miles..a serene, quiet place to either walk or run. It is a little secluded, so I do not walk @ night for obvious reasons.",
   "This is a lovely park. They have soccer fields, a basketball court, and three trail choices. The first is a short path great for little ones, small dogs or less active people. There's medium trail that is great for a jog. Finally, there's the ten mile bike path that gives you a great ride down to Columbus. The park is well-maintained and feels very safe during the day. There's a small lake for fishing too!"
  ]
 },
 {
  "name": "Sharon Woods",
  "address": "6911 Cleveland Ave, Westerville, OH 43081, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/84c52e0c-932f-11ea-8c0d-14b31f159f22.png",
  "tags": [
   "kids",
   "hike",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=12816708023515657661",
  "source": "GoogleMaps",
  "reviews": [
   "So many paths. The lake and the view were great. Playground for kids was great. Lots of programs go on even during the winter months. Can't wait to see it in the spring and summer 😊. Just moved here. I'm excited to go back..",
   "I took my granddaughters to the annual winter hike. It was overflowing with hikers, but the park rangers kept things moving. The hot chocolate and soup at the end were wonderful. My only complaint was that the shorter 2 mile route was not stroller friendly. I couldnt have made it up the gravel paths without the help of some very friendly fellow hikers.",
   "Very nice area in Hocking Hills. Beautiful cabins everywhere. The one we are staying at is very secluded and in the middle of a deep valley. It's very serene and peaceful here",
   "We attended a wedding reception here. The space was warm and clean and inviting. It was a perfect place for the party. Parking was easy, even for my parents who need to be close to a door. We were very happy to have had a chance to see the park and lodge.",
   "A lovely little metro park tucked away between Columbus and Westerville. It has a few good walking trails, it's pet friendly, and there is beautiful small lake in the back where you can fish."
  ]
 },
 {
  "name": "Columbus Zoo and Aquarium",
  "address": "4850 W Powell Rd, Powell, OH 43065, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/850dcffe-932f-11ea-a433-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8530890742723642025",
  "source": "GoogleMaps",
  "reviews": [
   "Best zoo in Ohio. They have a wide variety of different exhibits grouped together based on climate regions. By far my favorite place to visit in Columbus. The highlights include the amazing polar bear exhibit, African safari, aquarium, tiger exhibit, and chimpanzee exhibit. \n\nThey have something for every age here. There are plenty of concession stands and restaurants throughout the park. Highly recommend going to the nocturnal exhibit on hot summer days to escape the heat. \n\nThe zoo lights around Christmas are a must see. The entire park is lit up with colorful lights. The pond at the entrance of the park is decorated for a light show that plays about every 20 minutes and will keep everyone entertained. Not all of the animals will be out on display during this time, the ones that are include the bears, Mexican wolves, Arctic foxes, and most of the indoor exhibits like the aquarium and the nocturnal exhibit.\n\nIf you’re visiting Columbus or live in Ohio, you should definitely stop by!!!",
   "My experience at this location was absolutely magical. I was blessed and able to take in the beauty of the Wild Lights. I took pictures and videos of this and it was just gorgeous. I will make sure to visit this spot every winter to take in the all that is the Wild Lights of Columbus Zoo and Aquarium. There were a lot of smiles on every face of every child. It's a place where you see love Blossom both young and old as elderly and young people Jeremy experiences a hold hands and see the beauty of this place. Going at night who made the difference.",
   "We love this zoo.  Since my kids were born we've tried to make sure the hit a few big city zoos every summer.  Columbus is our favorite.  It's big, but not so big that you have to rush to get through it.  Every major animal is here.  In the back by the lions there's a restaurant with an awesome views of the African plains animals, definitely worth have lunch there.",
   "I love this place. Amazing animal habitats, awesome staff, and honestly the food courts aren’t bad. I will say that the carousel never works (I’ve been there twice in two years and both times it was closed). Overall I do like it!",
   "A beautiful zoo. The animal habitats look like what the animals would live in if they were in their natural habitats. In order to really enjoy the zoo, you need to allow for a full day for your visit. There are several restaurants to purchase food from or you can pack your own."
  ]
 },
 {
  "name": "Blacklick Woods Metro Park",
  "address": "6975 E Livingston Ave, Reynoldsburg, OH 43068, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/854c477a-932f-11ea-9e37-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "nature",
   "walking",
   "nature",
   "kids",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=2958743023453128471",
  "source": "GoogleMaps",
  "reviews": [
   "This is the best park in our area. We live about three blocks away and spend the majority of our summer here. There are three playgrounds here, each with different equipment, for different ages. The shelters are clean and open, surrounded with grassy area for games. We used a shelter for our daughters first birthday party and had a blast. The shelter was easy to decorate and large enough for our fifty guests. The kids ran around in the grass and played at the playground. We walk the trails with our kids and visit the nature center. This park is fantastic for families.",
   "We really enjoy this park. We bring our daughter here all throughout the summer because it has nice walking trails and a couple playgrounds. She never gets bored and if you play Pokemon Go, the place is littered with pokestops and gyms with raid battles. This park is a hot spot during community day.",
   "Love this park. Both small trail and long trail. If you go in morning, you will usually see deer. Mamma with babies, just laid there and looked at me. Beautiful park",
   "This park reminds of the late 60s and early 70s. The walkways and the nature center are kind of a homey feeling , but the noise from 24, 7 traffic,  ugh.  A nice getaway for awhile in the woods. And seems pretty safe.",
   "The nature center was fun for my toddlers. They had a lot of fun watchinf the fish, bird view and the toys and puppets. Great spot for kids!"
  ]
 },
 {
  "name": "Pickerington Ponds Metro Park",
  "address": "7680 Wright Rd, Canal Winchester, OH 43110, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/859a1a4c-932f-11ea-8c67-14b31f159f22.png",
  "tags": [
   "walk",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=7666556714639235470",
  "source": "GoogleMaps",
  "reviews": [
   "Good for a quick walk, but nothing much to look at. Decent pond view. I will go back in the summer to see how it looks without being all brown",
   "Nice place to birdwatch, no dogs allowed. Glacier Knoll, a bit further north is good for walkie.",
   "Great walking and biking trails!  Plus it's a fantastic spot to bring your dogs!",
   "Absolutely beautiful! Very hidden and secluded! Highly recommended!",
   "Wonderful views, great paths. Well maintained and clean"
  ]
 },
 {
  "name": "The Ohio Railway Museum",
  "address": "990 Proprietors Rd, Worthington, OH 43085, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/85e257c2-932f-11ea-a1f5-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=9472735204933527306",
  "source": "GoogleMaps",
  "reviews": [
   "A small but very informative train museum. It appears to be ran completely by volunteers so that’s why the museum has limited hours. \n\nYes the some of the trains appeared to be in disrepair but it’s because they rely heavily on donations/volunteer work to restore them.\n\nWe attended during one of their Saturday holiday events and enjoyed it. My daughter and I really enjoyed the trains. We especially enjoyed the 30 minute ride down the line and back in a old train car. \n\nHighly recommend this place for the train enthusiast in your life or for kids. Be sure to check their website for hours and special events.",
   "This was such a great afternoon with the kids. The museum didn't need anything too fancy because they just had really great trains.  We had a great little ride on the inter-urban, but I had hoped it would be a little longer than it was.",
   "It was lovely, learned alot about the trains and da kids also got a train ride",
   "Trolley rides and great train cars to walk through",
   "Small place but jam packed with neat stuff. The trolley ride is short but well worth it. We were lucky enough to catch a passing NS freight and they stopped so we could watch it."
  ]
 },
 {
  "name": "SegAway Tours of Columbus",
  "address": "400 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/863225ba-932f-11ea-85cc-14b31f159f22.png",
  "tags": [
   "learn",
   "parks",
   "learn",
   "tour",
   "tour",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=15903443071742885969",
  "source": "GoogleMaps",
  "reviews": [
   "A must see and do experience. We’ve went twice now and have told so many about it. You gather a wealth of knowledge about Columbus that you probably didn’t know previously. Usually a small group and very personable staff. I highly recommend this.",
   "Definitely the best way to learn your way around the city and see it's sights. You get to visit many parks and great views of the Columbus area. Definitely worth the time.",
   "Very fun and informative! Great way to get out and learn more about Columbus! The tour was lead safely and thoughtfully with room for fun and speed. Great for all levels of ability.",
   "This was such a great adventure. I had never used a Segway before and the tour guide, David, had great instructions and made sure we all were educated well enough to travel before heading out. The Segway was so much fun to drive and I want one. The tour was fun and it was nice when we stopped a few times, David took our photo for us.",
   "Such a fun way to learn more about the City of a Columbus. Our tour guide was great and the segways were surprisingly easy to learn. We look forward to doing the Christmas tour!!"
  ]
 },
 {
  "name": "Buckeye Escape Room",
  "address": "1495 Morse Rd, Columbus, OH 43229, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "performance"
  ],
  "link": "https://maps.google.com/?cid=14326406308238901766",
  "source": "GoogleMaps",
  "reviews": [
   "Vest fun ever with matt",
   "What fun we had! This was our first try with an escape room and thankfully there were more experienced people with us lol\nWe did help with a few things and assisted in figuring out some of the puzzles. It's too bad we live so far away - I'd love to try the crazy kittie room. 😹\nThank you to fun actor \"Antonio\" for a great performance and being our subtle clue giver.  Also kudos for allowing complete novices (us) who just walked in off the street (again us) asking if we could join in. It was great not needing a reservation. \n\nThe only thing they could improve on is having a website with information about how to sign up for an adventure.",
   "Think like a vietnamese man you will win",
   "We had a mixed group - 3  adults, 3 teens - and everyone had a great time.  Jasmin was awesome at giving us a few subtle hints and at making sure we were all involved and enjoying ourselves.  We escaped the 90's with minutes to spare and would definitely try another room.",
   "Very fun, though the guide was a bit too generous with the clues. Definitely hope to visit again and just let them know that we'd prefer to do things on our own and only get help when we're truly stuck on something."
  ]
 },
 {
  "name": "Blendon Woods Metro Park",
  "address": "4265 E Dublin Granville Rd, Columbus, OH, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8673c2b8-932f-11ea-ba0e-14b31f159f22.png",
  "tags": [
   "kids",
   "nature",
   "kids",
   "family",
   "nature",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4763006684459651558",
  "source": "GoogleMaps",
  "reviews": [
   "Great children's programs! Very impressed with their rangers, and my kids always have a great time. We also really enjoy the natural play area and expiring the park!",
   "Great park with beautiful hiking trails.  It is a birding hotspot in spring as it attracts a wide variety of warblers and other songbirds.  It is also famous for it's numerous wild turkeys.  I don't consider my visit \"official\" unless I see a Blendon Woods wild turkey.  Their nature programs are very good. The naturalist, Bruce, is an excellent and enthusiastic birding expert.",
   "Great park, but the sugarbush trail was muddy as heck. Pretty much impassable. Be nice if they could throw down more gravel on the trail. I'd go back and try again.",
   "Blendon Woods is so much fun for a family with kids. The nature center was fun and informative. The trail to the viewing area was also lots of fun and the signs are full of good information. The best part is the viewing area, on our last visit we saw eight turkeys and a deer. Overall, Blendon Woods was a great experience!",
   "Very nice local park to walk around. It's nice to bring your kids or dogs as well but also not too crowded."
  ]
 },
 {
  "name": "Frank Fetch Park",
  "address": "228 E Beck St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/86bd00f0-932f-11ea-8063-14b31f159f22.png",
  "tags": [
   "pets"
  ],
  "link": "https://maps.google.com/?cid=229670238266888294",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful, beautiful park. Very refreshing with the plant life and little touches. This is a very small and delightful park. One nice touch is they have water bowls and a fountain hose for pets. We sent nearly an hour looking at everything and taking pictures. Early morning is best for street parking . Slow bumpy driving due to cobblestone streets.",
   "Cute little pocket park in the midst of quite residential block in German village. Cool little spot for some chill time after dinner near by. Water fountain seem to run late into the night was beyond welcomed on such a hot/humid day! Sweet! 😊",
   "Nice quiet restful park! Well designed!",
   "Cute little park, nice spot to come during a lunch break. Had a water fountain and hose for dogs. Very relaxing .",
   "Wonderful little park in the heart of German Village. Well-maintained landscaping that makes it obvious this little patch of land is loved and cared for. An underrated stop on dog walks through the neighborhood."
  ]
 },
 {
  "name": "Zoombezi Bay",
  "address": "10101 Riverside Dr, Powell, OH 43065, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/87147ade-932f-11ea-89f3-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "food",
   "kids",
   "family",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=9822550419793555049",
  "source": "GoogleMaps",
  "reviews": [
   "The website says 26 slides and I believe them. There is a good mix of slides with some going into a  10 foot drop. The wave pool is great for family's and they have a kid pool and baboon lagoon which was more fun than I expected. I bought a season pass for $495 which was $105 a piece and $70 for kids under 10. You can also bring snacks, drinks, and sandwiches. To be honest I don't know why you would buy a pool in Columbus with the water park here.",
   "Great fun! Lazy river, wave pool, kids water park area, an adults only area, and large water slides! Food is good, and they have cabanas you can rent for the day. When you get admission to the water park you can also go visit the animals in the zoo!",
   "Best water park in USA for kids IMO. Love it. I went in evening and it's best because water is warm and less people. Fantastic and not too big of a place. Rides, slides and things are well designed.",
   "Zoombezi Bay is so much fun for the whole family from toddlers to adults! Its always safe. There are lockers $10 to rent. Decent food. Or pack a few small snacks in a soft sided cooler. Be sure to get there early especially on the weekends,its hard to find a place to sit.",
   "This water park was great! I was surprised by how large it was, being that it was in the zoo, but it has separate quarters. The kids had a ball. It was raining and a bit chilly, but it was a great experience and the kids had a great time and memories! So thank you!"
  ]
 },
 {
  "name": "Homestead Metro Park",
  "address": "4675 Cosgray Rd, Hilliard, OH 43026, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8764940c-932f-11ea-8b17-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "walking",
   "nature",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=85117880004706728",
  "source": "GoogleMaps",
  "reviews": [
   "A great park.  Good walking paths, exercise equipment, playgrounds, pavilions, small lakes, and a beautiful covered bridge. The park is huge and you can definitely spend a lot of time there. It also has a ton of Poke-stops and gyms for people who play Pokemon Go",
   "It's a nice park. It's changed since the metro park system took over. Some of the fun things that kids liked have been removed like the squirt gun fort and the toddler water play area. Those were great in the summer. The main play ground is fun and the walking path is nice.",
   "First visit.   Fall 2019 (basically early winter, right Ohio?)\n\nPretty large park.  Has plenty to see and do for everyone.\n\nThey have two playground areas, pne large in the center.. And a smaller train station themed one next to a replica train depot.\n\nA covered wooden bridge crosses a large pond, a nature center with covered shelter, a large enclosed rental shelter and so much more...",
   "Good running trail and lots of Pokemon go stops! A compact park with everything you'll need: playground, gazebo, basketball, volleyball\n\nAlso, a popular place for people getting pictures taken and weddings",
   "Very cool place to visit.  We have some of the best metro parks we have visited.  There is a lot to see in Ohio."
  ]
 },
 {
  "name": "Billy Ireland Cartoon Library & Museum",
  "address": "1813 N High St, Columbus, OH 43210, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/87b40940-932f-11ea-9bae-14b31f159f22.png",
  "tags": [
   "library",
   "organized",
   "free",
   "history"
  ],
  "link": "https://maps.google.com/?cid=7841301118392100139",
  "source": "GoogleMaps",
  "reviews": [
   "Very good museum, rich with good content.",
   "LOVED the Cartoon Couture exhibit. The Exhibit was laid out in an organized manner & highly detailed. Such great content. \n\nThe front desk staff were friendly & welcoming. I highly recommend any exhibit at the Billy Ireland Cartoon Library & Musuem. Such a great time!!",
   "Decent collection of comic/cartoon artifacts. It's hard to complain about a free attraction, but I was expecting a little more with the word museum in the title (three rooms of items). Good to combine with the nearby Orton Geological Museum, which is also free and smallish.",
   "Nice dive in American cartoon history . Was Some education for my kid too.",
   "Wonderful, go check it out!"
  ]
 },
 {
  "name": "Battelle Riverfront Park",
  "address": "25 Marconi Blvd, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/87f389fe-932f-11ea-8619-14b31f159f22.png",
  "tags": [
   "parks",
   "walk",
   "cheap",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13423846670709110754",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to sit and just enjoy the sunset. Very Calm. People mostly come in groups with families and friends. Great place for cycling and skating as I saw many people doing that. A perfect picnic spot with great restaurants nearby.",
   "It's a beautiful place, right in the middle of Downtown Columbus Ohio! Beautiful parks, seating areas, fountains, huge shade trees, a blast every time we go!",
   "A great park to visit during your visit to downtown. Lovely river views. The statues have a story behind that you can read about on a plaque!",
   "Nice park to visit and relax, we took a 10 min. walk by the river and it is truly one of the more peaceful spots in Columbus. There are alot of plaques and iron made statues, you can also walk close to one of the train bridges and rent bikes for cheap.",
   "I took my nephews (3 & 26) for lunch on the swings then a walk along the river. The 3 yr old loved looking at the water and all the people watching. The 26 yr old liked the slower pace but being so close to downtown. We loved looking at the sculptures. It was the 1st wk of scooters being back in use so traffic on walk was pretty fast paced."
  ]
 },
 {
  "name": "Motorcycle Hall of Fame Museum",
  "address": "13515 Yarmouth Dr, Pickerington, OH 43147, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/884d89ec-932f-11ea-894c-14b31f159f22.png",
  "tags": [
   "family",
   "learn",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3372290453012043534",
  "source": "GoogleMaps",
  "reviews": [
   "This was a very cool place, especially for someone like me, that is a novice motorcycle person at best. Their \"bike nights\" that are twice a year are quite entertaining and interactive. The museum is very cool, and my 10 year-old was mesmerized. A nine gift shop as well, and friendly and helpful staff. They genuinely want to be there. If you're in driving distance, it's a must do. You can also feel good about supporting a non-profit.",
   "Fantastic place! Such amazing pieces on display! We are already planning a trip with family",
   "Went with the whole family and everyone of us enjoyed it! There were some historical pieces as well as videos and artwork! There is a lot to look at and really cool facts to learn at each exhibit. I would highly recommend and can’t wait to go back!",
   "Interesting and visually appealing even to me and I have no interest in motorcycles. Helpful and friendly staff.",
   "Saw my first Observed Trials. Pretty cool...! A great family sport as the little tykes participated using small electric bikes and striders. The advanced and pros were interesting; some took the harder challenges with not much effort. Others were dabbing left and right. Literally! Go see one..."
  ]
 },
 {
  "name": "Motts Military Museum, Inc.",
  "address": "5075 S Hamilton Rd, Groveport, OH 43125, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/889aab86-932f-11ea-abeb-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "organized",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15154580740420508798",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of the best collectons of military equipment in the area. In fact, I would say that this is one of my top 3 musumes, and I've been to quite a few. If you like military history, weapons, or things that go BOOM, this is the place for you! The staff are knowledgeable and friendly, and the museum is very is well organized. The gift shop has lots of cool things too! My favorite item in the museum would have to be the fire truck from 9/11. I highly recommend this place!",
   "Very interesting! I could have spent much longer than we did there. I can't wait to see progress on the 9-11 museum.",
   "Mr. Motts' collection of weapons and military items is one of the coolest places I've ever been. Seeing all the little (and not so little) pieces of history there and their stories of where they came from is interesting. Very cool place with a lot of history",
   "What a fabulous collection! The museum director and guides are fonts of information, friendly and engaging. We stayed for 2 1/2 hours and could have stayed twice as long if we'd had time.",
   "One of the best military museums I have ever been to. Staff is friendly, tons of artifacts from all US involved conflicts, Civil War stuff is amazing. The Vietnam War Dog Memorial is top notch and was honor to meet the handler!  K-9 leads the way!"
  ]
 },
 {
  "name": "Arnold Statue",
  "address": "486 N High St #474, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/88dfcaca-932f-11ea-95d7-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=17125219521507130189",
  "source": "GoogleMaps",
  "reviews": [
   "A great inspiration to athletes competing at the convention center",
   "It is outside Columbus convention center. Well maintained. Not much crowd would be there . So you can take pics without any trouble .",
   "Not sure if this was meant to be life-size. Weird detailing, on the veins, but overall it was kinda cool. I was hoping for a statue of Christopher Columbus though",
   "I'm a HUGE fan so this was pure awesomeness for me. Drove downtown just to see his statue and So Worth It.",
   "Alyssa's cheer comp and loving it girls are doing great"
  ]
 },
 {
  "name": "Gardens at Gantz Farm",
  "address": "2255 Home Rd, Grove City, OH 43123, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8929f328-932f-11ea-8a36-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11432321810901542612",
  "source": "GoogleMaps",
  "reviews": [
   "Nice family place with huge playground, cosy spots for fishing with your kids.",
   "Amazing aromatherapy with their herb garden. My go to place to take a quick stroll and smell along the way. Really beautiful in the spring time when everything decides to bloom!",
   "Fond childhood memories of the Barn! The new playground is excellent, a great update to a great park. Creek, walking paths, a cute gazebo and plenty of picnic opportunities. Beware on any HOCO or Prom night though, it's a hotspot for pictures.",
   "Play ground updated. Lots of fun.",
   "We love Gantz Park! It’s gorgeous year round. Can’t wait to see what the new playground is like!"
  ]
 },
 {
  "name": "Hoover Reservoir Park",
  "address": "7701 Sunbury Rd, Westerville, OH 43081, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/897c0b3a-932f-11ea-83a8-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "walk",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=5763076050101067058",
  "source": "GoogleMaps",
  "reviews": [
   "Nice to walk around and across the Hoover Dam. Great place to take pictures and enjoy the nature that is all around the dam. Was very peaceful the day we were there. I would guess it is a favorite place for the locals to walk and walk dogs. Was extremely clean and nice. Very nice parking lot.",
   "I've been going to Hoover Reservoir Park since I was a child, never had a bad time here. The disc golf course is pretty good and there's ample space for traditional park activities like cooking out and such. Lots of area to walk around and enjoy nature. You can walk across the reservoir, fish and sail. Just a really good park to visit!",
   "Very nice scenic area. A small amount of parking nearby. Not the most obvious turning off the road so keep your eyes sharp when heading towards it!",
   "Beautiful place. Close to easy access. Nice cardio going up and down the stairs",
   "Nice little park to go for a walk or bike ride. If you're from out of town the dam is definitely worth seeing."
  ]
 },
 {
  "name": "Alum Creek State Park Beach",
  "address": "3400 Lewis Center Rd, Lewis Center, OH 43035, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/89c79362-932f-11ea-9443-14b31f159f22.png",
  "tags": [
   "free",
   "walk",
   "kids",
   "free",
   "family",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1706347611271860685",
  "source": "GoogleMaps",
  "reviews": [
   "This place should be called Kitty Litter Beach. \n\nThe sand could be better, but it's not bad for Central Ohio!\n\nA good place to go for a little swim. Best bet is to go when the water is cooler so you don't get the flesh eating bacteria from the lake.",
   "Wonderful sand beach.  If you go during the day, Monday through Thursday there are very few people then.  Feels like you have the whole place almost to your self.  2 play grounds.  The water gets deeper very slowly so a great place for young children.  No life guards though.  Public restrooms.  Lots of free parking.  Free admission.",
   "Clean beach and Nice playground area. It's free admission. Water is crystal clear. Less crowded. For kids play ground area good. No lifeguard on duty. You can say purely a picnic spot with family. You can do kite flying, swimming, boating , kayaking and enjoy the outdoor activities. Dip your feet in the water and enjoy. There is plenty of parking and  two (at least) restroom facilities. Signs for beach rules were easily seen. Parking is very near to the beach and not to walk much. Perfect place to spend 2-3 hours",
   "Spent some time there and I played with sand. Enjoyed a lot 😊",
   "beautiful park with a nice lake and walking trails.  The beach is rocky but clean. We didn't stay long, just checking  the place out for the triathlon race tomorrow. There were families enjoying the nice weather. I imagine during the summer season the concession area would be open. There were  locker rooms and showers available."
  ]
 },
 {
  "name": "Columbus Museum Of Art KidsSpace",
  "address": "Inside the museum of art, Columbus, OH 43215, USA",
  "avg_visitor_review": "",
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a156576-932f-11ea-9042-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=11348349240177116977",
  "source": "GoogleMaps",
  "reviews": []
 },
 {
  "name": "Whetstone Community Recreation",
  "address": "3923 N High St, Columbus, OH 43214, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8a76bf7a-932f-11ea-ae71-14b31f159f22.png",
  "tags": [
   "kids",
   "library",
   "kids",
   "library",
   "library",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=488040733701286481",
  "source": "GoogleMaps",
  "reviews": [
   "My kids love the high slides but WHY is the tire swing so darn high? My 8 yr old can't get on it without my help and they are too heavy to lift that high.  It doesn't work properly being that high because it can't get enough swing going. We love that there are 2 play sets, one by the library and the other down by the open fields just past the rose garden.",
   "This is such a great resource for families. Many kid classes such as gymnastics, pottery and even a soccer league and basketball teams. Adults can even take exercises classes, or workout in the gym. The library is right next door and the perfect size for kids and adults.",
   "Nice gem of a park in the middle of an urbanesque community. Large swaths of fields, scattering of  ponds, plenty of geese, birds, and other wildlife. There are a few nice playgrounds, some nice shelters with fire pits, and even one with a giant mantled fireplace. Throughout the year there are an assortment of community events held here including fireworks movie nights and *plenty* of youth sports games. There are portapotties but no permanent latrines or plumbed bathroom facilities in the park itself but there's a community center nearby as well as a library. This is one of the most comprehensive, well-maintained, and enjoyable parks and recreation areas in central Columbus. Kudos to those responsible for establishing this park and those who continue to care for it.",
   "Used to go all the time!!! This is a good place to hang out and do things you love.",
   "Wonderful community resource. They have a wide variety of activities for all age groups and a wonderful staff supporting everyone"
  ]
 },
 {
  "name": "Main Street Bridge",
  "address": "303 W Main St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8acf8e12-932f-11ea-9b63-14b31f159f22.png",
  "tags": [
   "unique",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=2506877548783643848",
  "source": "GoogleMaps",
  "reviews": [
   "Main Street bridge sports some amazing views of downtown Columbus. This bridge has a unique arch and side walking path to add to it's functionality and aesthetic. This is not the most travelled bridge for me(like it's neighbor sibling) but it's sure is the best looking of all three street bridges in the area.",
   "Beautiful bridge from a distance and even better walking across.  Great views of the city in either direction.",
   "Clean and beautiful with a nice walking/bike trail",
   "This is a fine looking bridge that has enabled me to cross the river several times. Fine job to the construction crew and architects who made this possible!",
   "This is a really nice spot for a photo in front of the cbus skyline. This area along the scioto mile is a great little place to take a stroll."
  ]
 },
 {
  "name": "Glen Echo Park",
  "address": "510 Cliffside Dr, Columbus, OH 43202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b1040dc-932f-11ea-8e04-14b31f159f22.png",
  "tags": [
   "kids",
   "walk",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=14801981906227581111",
  "source": "GoogleMaps",
  "reviews": [
   "It's a precious Jewel of Columbus, hidden in quiet area, beautiful at every season.",
   "Very nice place for inside a city. Quiet and secluded in a way",
   "This park was just what I needed today! It's in the low 70s the Sun was shining getting ready to set. There are plenty of bridges in this little Park to take wonderful pictures at the birds have been chirping you can see everything blooming all around you. This is a nice little getaway if you just want to disappear for awhile and have some you time. I would recommend it to anybody.",
   "It was so pretty , there was bridges, pathways into the forest, and a nice little place to camp at as well. We all had an amazing time ! Perfect to bring kids as well☺️",
   "I have to say this is a rather disappointing park. It's quiet and peaceful and a good place to walk your dog if you live in the area. However it's basically just a large open sewer for run off from the areas storm sewers. There are better parks to explore."
  ]
 },
 {
  "name": "Jeffrey Park & Mansion",
  "address": "165 N Parkview Ave, Bexley, OH 43209, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8b58e2c2-932f-11ea-b452-14b31f159f22.png",
  "tags": [
   "walking",
   "parks",
   "drink",
   "food",
   "walking",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=16900531451327169765",
  "source": "GoogleMaps",
  "reviews": [
   "Great park, nice wooded trail that takes you down by stream. Mansion is well kept and a   step back in time to gilded past.",
   "This city park is totally unexpected. The old Jeffrey Mansion and grounds are serene break and the hubbub of a city, even in the suburban setting where it lies. Very pleasant walking trails with some athletic facilities and wonderful play space for children.",
   "An absolutely beautiful place, both outside and in. Home of Bexley Parks & Rec offices, this exquisite setting is enjoyable for all ages. There are extensive grassy areas for playing or lawn picnics, paths through woods leading to Alum Creek, sturdy playground equipment, the city-owned outdoor swimming pool, and the updated mansion, which can be rented for private functions. Handicap parking, entry, and restrooms.",
   "Jeffrey's Park and Mansion is a nice place to take a stroll. It has playground areas for youngsters and quite a few miles of walking trails. There are white tailed deer on the grounds so don't be surprised if you see one or several. If you enjoy Pokemon Go or Ingress Jeffrey's has quite a few Pokestops and Ingress portals. There are public restrooms available as well as shelters with picnic tables. You will need to bring your own food or drink as no vendors are on site.",
   "- Nice park\n- Very clean\n- Big area with playgrounds, walking trails, etc \n- Cool castle to see\n- Nice area for photography\n- Can get busy at times"
  ]
 },
 {
  "name": "Franklin Park Adventure Center",
  "address": "1755 E Broad St, Columbus, OH 43203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ba6dbf6-932f-11ea-b7d2-14b31f159f22.png",
  "tags": [
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=5918618293455817126",
  "source": "GoogleMaps",
  "reviews": [
   "Asian Festival nice time walking seeing different booths. Sat ate and watched shows on the stage. Need to add more different Asian food vendors",
   "This place has an all handicapped accessible gym! All the same gym equipment you find @ Victories or Planet Fitness, modified so you can wheel right up and get your workout going! And it is ran by fantastic knowledge people who are always willing to help!",
   "My daughter plays 4 foot hoops here.",
   "This weekend the Asian Festival was held at the park. Except for the health screening, it is a magnificent festival. More details to follow, but go!\n\n(Health screening chooses to turn high blood pressure from being the Silent Killer to them saying, \"Die already!\" First complete a dense four pages which take 10 minutes for a 2-minute BP reading? Typical American health care.)",
   "Provides great experiences for the community in all facets. "
  ]
 },
 {
  "name": "Hayden Run Falls Park",
  "address": "4460 Hayden Run Rd, Columbus, OH 43221, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8bfcc46e-932f-11ea-b635-14b31f159f22.png",
  "tags": [
   "walk",
   "creative",
   "nature",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7667998841755198047",
  "source": "GoogleMaps",
  "reviews": [
   "I really enjoy this small kind of hidden park.  Nice location off of Hayden Run Road with space for less than 10 cars.  It is a nice walk down the steps, careful it can be a little slippery, to the boardwalk below.  Probably about 100+ yards on the boardwalk back to the falls.  It is a popular place to take pictures so there will be photographers here from time to time.\n\nCome here after a heavy rain to get a nice view of the water.",
   "Nice quarter mile boardwalk trail. The water might not flow some time but when it flow it is a nice place",
   "It was short and to the point, nice spot for creative B Roll & waterfall nature shots. @otimages for shots I took here!",
   "It's always been a special place. It used to be rough to get to when there was decent rainfall. Now the boardwalk makes it easier to get to.",
   "Such a beautiful place to visit, right in the heart of the city. Easy access and parking and a short walk to get to the falls, have to manage 40 some steps to get up and down in doing so, please ensure that you are in descent health to tackle them . Some planks on the wooden pathway need to be replaced  with the weather beating down on them. Worth the trip!"
  ]
 },
 {
  "name": "The Refectory Restaurant and Wine Shop",
  "address": "1092 Bethel Rd, Columbus, OH 43220, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8c576794-932f-11ea-9f1d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3325371017411994375",
  "source": "GoogleMaps",
  "reviews": [
   "Food was amazing. Only downside was the downstairs bathroom is kinda not befitting of a place this nice. They also have a great wine selection and the staff is very helpful. Another  thing I really appreciate is the waiters and waitresses explain everything with great detail. Prices are on the high side but worth it. Check it out for yourself!",
   "One of my all time favorite moments. Came here today for my anniversary dinner with my husband and I was NOT disappointed. The staff were helpful, friendly and professional. They even made us a card for our anniversary and brought us an extra desert with candles! You could tell everyone was expertly trained and they did their job flawlessly. The food was the best I've had anywhere else. The atmosphere was perfect. Everything was perfectly cooked and plated. I will definitely be coming back and recommending it to others.",
   "My girlfriend and I came here for a romantic Valentine's day dinner and couldn't have been more impressed. The food was truly 5 star quality, right along side the service. I even requested a bouquet of white roses be on the table and they set it up perfectly. \nBear in mind this is every bit a 5 star restaurant, anything less than a collared shirt would stick out and the bill is what you will expect for this kind of food and service.",
   "This is a great place for a special occasion. Our server Eden made the dinner something to remember.  Even surprising us with a great desert selection to cap off our event as a token from the restaurant.\nThe atmosphere is quiet and upscale while also being rustic. You feel like you are in an old country cottege or building from France. It is great to have a slow paced dinner with friends who want to talk and enjoy company.",
   "The Refectory is likely the best restaurant in Columbus, especially for people who like French cuisine. Its chef was a stident of a French gastronomic legend Paul Bocuse, and it shows. I wish I had enough money to dine at the Refectory often, since every time I go there, I enjoy the food a lot, but also regret that I cannot try everything on the menu which changes regularly. Luckily, my favorite dessert, the warm pear tart, has been offered constantly for the last 3 years. Highly recommended!"
  ]
 },
 {
  "name": "The Guild House",
  "address": "624 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ca316e4-932f-11ea-9449-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "delicious",
   "food",
   "food",
   "knowledgeable",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18221996228864256947",
  "source": "GoogleMaps",
  "reviews": [
   "I've been here several times and have really enjoyed it each time. The food is familiar but creative and always flavorful. My favorite item is the Lamb burger, this is the best one I've had in Columbus. The atmosphere is upscale and quiet despite being busy and packed. The service is friendly and knowledge but it is not a quick in and out, plan to stay awhile. My son also liked the salmon and fries, the cooks were happy to make the dish plain (no sauces and such) for him.",
   "We’re from out of town in town for a Valentines weekend getaway. We had a great experience for our Valentines dinner with our two toddlers. Beautiful establishment, great service and food was delicious! We loved that were kid friendly! We’ll definitely be back next time we’re in town!",
   "Loved the food (pictured: cheeseburger, chicken roulade, steak salad). Presented beautifully. Tastes great. Perfect portions. And the service was exceptional - adjusted our order based on allergies (shout out to our server Alex W.).",
   "Chelsea was absolutely amazing.  Extremely knowledgeable, very sweet and very personable.  Ambiance and decor was amazing, love this place.  We live 5 hrs away but will definitely be back.  Thank you.",
   "The Guild House was not what I was expecting. Everything we had was really good. The only difficult thing was that it has like tons of words on the menu that aren’t common knowledge. Our group of 5 collectively knew a few, but it was definitely google search while reading the menu. I’ll say that the waiter was excellent. Our cups were never dry. Last piece of advice: not a place for kids. They had no options on the menu for drinks other than alcoholic ones. There were changing tables in the bathrooms, but definitely more of an adult place. Overall, great food and great service."
  ]
 },
 {
  "name": "Martini Modern Italian",
  "address": "445 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ce8ac40-932f-11ea-bdda-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17968007651744580257",
  "source": "GoogleMaps",
  "reviews": [
   "My favorite Italian restaurant in the greater Columbus area. I have been there 3 times now and everything I have ordered (cocktails, appetizers, first plates, second plates, and desserts) has been spectacular. If you haven't tried the squash tortellini you should. It is one of the best pasta dishes I have ever had. Service was also top notch. Our server Joe was on point and we lacked for nothing. Wonderful experience. We will be there again for certain. Valet parking is offered and makes parking much easier in this part of the city.",
   "I love Martini’s! It is one of my favorite Cameron Mitchell restaurants. The food is amazing, the service is wonderful and I’ve always had a great experience here. It’s a little pricy but my family loves going here on special occasions.",
   "Really amazing dinner experience with wonderful food and superb wine. Went for a friend's bachelor party and had an amazing meal. The service was great and attentive and the food was out of this world. Everything we had was phenomenal and was cooked to perfection. Make sure to try the fresh mozzarella, it's great!",
   "Dinner at Los Angeles' Providence is an all-evening affair. The service is beautifully orchestrated and the meal is truly the showpiece. Plan to stay for two hours or more, watching as course after course is gracefully presented at each table around you. The mood is festive; since there's a good chance someone in the room is celebrating a birthday or anniversary. For the full experience, arrive a half-hour early and enjoy a deliciously innovative cocktail in the Forbes Travel Guide Four-Star restaurant's lounge. Tailored to the seasons, a savory winter choice includes the “Eskimo,” made with cognac, spiced squash, egg, cream, vanilla and black truffle.",
   "Place was better than expected. We were not sure on portion sizes but they were good. The lamb was so good. If we didn't buy drinks and extra meals we could have walked out of there spending less than 100 $. Service was excellent for how busy it was."
  ]
 },
 {
  "name": "The Pearl",
  "address": "641 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d55778c-932f-11ea-9946-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8685302986226315815",
  "source": "GoogleMaps",
  "reviews": [
   "English style pub food. Tables are close together and I did not have enough room under table for my legs. Fiid was delicious. They have a vegetarian shepherdess pie that I ordered topped with a short rib. It was outstanding!",
   "Great atmosphere. The Pearl is a trendy place. It brings in all types of people. The food is fantastic. If you are a seafood lover this would be the place to go. They offer specials on seafood. If you are not into seafood they also have sandwiches and burgers. The mixed drinks are great. The deserts can really make a meal and getting the brown sugar pie slice was truly a topper.",
   "Incredible place. Feels like you're in a different city. The service is outstanding the food is excellent. And the happy hour you cannot beat it. They're incredible Moscow Mules for $5 each. Best Moscow Mule in the city even at full price.\n\nAnd fresh big pies each day, wow.",
   "Stopped by for dinner during restaurant week.  It was pretty crowded, but the noise level wasn't too bad.  Our waiter was excellent.  He was very personable and knew the menu well.  The jalapeno cornbread appetizer was great, enough for 2 or 3 people.  It wasn't dry like a lot of cornbread.  The fried chicken was juicy and the skin was crispy.  Comes with 4 good sized pieces of chicken.  By the time dessert arrives, I was stuffed and took it home.  The coconut cream pie was tasty.  Definitely recommend The Pearl!",
   "A random Thursday night dinner lead to a nice surprise, $2 oysters! Service was exceptional (Eric). Everything on the menu is a must try. I will definitely be back next visit to Columbus."
  ]
 },
 {
  "name": "Barcelona Restaurant and Bar",
  "address": "263 E Whittier St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8d9f51f8-932f-11ea-a4d7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5518879702601320212",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food, drinks, and service. Michael, our server was fantastic. He was very helpful in navigating the menu. The grilled octopus tapas and sea scallop main dish was excellent. Great beer and mixed drinks. Delicious deserts. Prices are definitely moderate to expensive. However the quality and portions of food present a good value. Would recommend to anyone who wants a upscale dinning experience.",
   "A memorable night! I highly recommend the pork meatballs — they are exquisitely moist and flavorful, and the accompanying beans are beyond divine. My entree was the veggie paella (with marinated mushrooms and black beans), which exceeded my expectations. Absolutely phenomenal.\n\nService is top notch (almost to the point of suffocation, but not quite). Just a great spot for a special meal.",
   "The food was delicious, our chef was named Trinity and she was beyond amazing. The service was wonderful and the food was even better than expected. I definitely will be back. Thanks for the great time.",
   "We tried this place out for restaurant week. It was fantastic! My husband and I each tried different items off the prix fixe menu, and they were all amazing! I think they need to have the Blondie with bourbon peaches all the time! The cocktails were also great, and the service impeccable!",
   "My best friend and I stumbled upon this place while we were staying in German Village, and we were absolutely starving. Calamari was wonderful, the hummus was great, but the scallops were hands down the best I’ve ever had. Portions were huge, my friend and I split the scallops entree (they are able to do so with a small fee which is noted in the menu) and it was more than enough for both of us after appetizers. Service was exceptional and the ambience was chic but relaxing. Definitely wanting to visit again!"
  ]
 },
 {
  "name": "The Thurman Cafe",
  "address": "183 Thurman Ave, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8de27578-932f-11ea-8d60-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "food",
   "music",
   "delicious",
   "eat",
   "music"
  ],
  "link": "https://maps.google.com/?cid=12336292578390766074",
  "source": "GoogleMaps",
  "reviews": [
   "Burgers bigger than your head! Delicious too. Not much seating inside, so prepare to wait if you want to sit down. Or go next door to the Pickup Window if you're in more of a hurry. Great place!",
   "Despite not being able to substitute the chips for fries, because kettle chips rip my mouth to shreds, and having to pay extra for said fries, I did like the place and the food. The burger I had was the a-1. It was huge and definitely hand made, like grabbing a hunk of meat and just slapping it on the grill kinda hand made. The fries were really good, not crispy but not mushy. You're typical campus type dive bar with really good food.",
   "Absolutely phenomenal. Fantastic food, great music, very cozy atmosphere. Massive burgers, what else would you want in a cafe!?  Great service? Well they have that too! If you don't walk out feeling like you're about to burst you haven't really been to Thurman cafe! Highly recommend trying it! Will definitely be visiting numerous times.",
   "Fries were hot and tasty! The wait was about to 30 minutes or more on a Wednesday night. But it was worth the wait! Hamburger was delicious I couldn't eat it all ! I think I had the JOHNNY \"which was served with a side of TEQUILA & LIME...it also had blue cheese with a horseradish cheese. Small cozy hole in the wall... LOCALS recommended the THURMANATOR !!!",
   "Very small place. Very busy. Large portions. Had the Rad Shroom burger. Very tasty. Didn't have enough horseradish sauce for my taste. Excellent fries. Good service. Music selection was all over the place, from country to new age."
  ]
 },
 {
  "name": "Skillet",
  "address": "410 E Whittier St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e2746f8-932f-11ea-a9a7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15860554153165615170",
  "source": "GoogleMaps",
  "reviews": [
   "Easily some of the best food and drinks I have ever had. The food was perfectly cooked and I can only describe it as delicious. The drinks were a perfect balance of flavor. Our waitress was wonderful and friendly as well as the bartender. You couldn't go wrong with what you order.",
   "If you want amazing farm to table brunch, then Skillet is for you! Absolutely delicious food, it does has a small sitting area so unless you come early expect to wait a while. It is definitely worth the wait! They change up the menu regularly, and everything I've tried has been mind-numbingly amazing. Excellent service and  staff, I cannot recommend this establishment enough.",
   "Consistently the BEST breakfast in Columbus and it's not even that close. In my experience, the staff is friendly, attentive and familiar with the menu. I've never been disappointed when ordering based on their recommendation. The menu is always changing and even when I order something I don't think seems like it would be my taste it's absolutely delicious. I can't recommend Skillet enough.  If you live near Columbus and haven't tried it stop waiting.",
   "This is a wonderful little restaurant. There is not much room inside, so waits could be long. It is worth it, though. They have a fairly unique menu and said much of the food on their menu is farm to table. The staff was friendly and helpful. I highly recommend trying it.",
   "One of my favorite breakfast places in Columbus! Their food is always great. I would call it a fine dining quality food in a casual setting. Their menu does change, which makes it a treat to try something different every time I go there. They do have a small sitting space and a line in front most of the times they are open. I would argue this is what makes Skillet so attractive, it is a part of the whole experience. It makes this place feel more cozy and food taste better when you finally get inside. And, in my experience, their stuff is always super nice and friendly :) Kudos to the chef and owner!"
  ]
 },
 {
  "name": "Schmidt’s Sausage Haus und Restaurant",
  "address": "240 E Kossuth St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8e6fc1c2-932f-11ea-83e2-14b31f159f22.png",
  "tags": [
   "sampling",
   "eat",
   "food",
   "delicious",
   "walk",
   "food",
   "music",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7968645518100359985",
  "source": "GoogleMaps",
  "reviews": [
   "Found ourselves downtown after visiting the Home and Flower show, and not wanting to eat junk, decided to stop in at Schmidt's restaurant in German Village.  Although it was Sunday afternoon, which is a popular time, my wife and I were seated in less than 5 minutes and enjoyed sampling all the choices in their Sunday buffet.  Food was excellent and the service exceptional.  Many of the servers have worked there a long time and really know how to treat good customers well.  They definitely remember who are the good tippers.  It is a great place to take families. Will definitely come back.",
   "Sausage Heaven! One of my most favorite places to go in the world! Walk in and you are overcome with the smell of sizzling sausage in an entertaining, lively environment. Happy servers, oompah music, authentic decor and delicious food! The Autobahn All-You-Can-Eat Buffet, at $15.99, is unbeatable, loaded with a succulent assortment of tender sausages (with a perfect snap) and German fixings! Wash it down with a couple of Large German draft beers! Don't forget the cream puffs!!",
   "I LOVED the energy of the space and place! Dinner was awesome! Service was prompt but not rushed. Food was incredible. I wish I had taken pics. \n\nDon't neglect to take time to shop down the street at both the fudge shop across the street and also the artisan's gallery two blocks down.  This is an awesome area of the city!\n\nEnjoy!",
   "The food and ambience were good.  Loved the historical details.  My only drawback was the waitstaff.  I think our waitress must have been having an off-day as she checked on us the absolute minimum number of times and then brought the check before we ordered dessert.  Needless to say that the check was brought promptly again when she brought our desserts.  No refills offered and a \"hurry up, eat, and leave\" feeling.  I did not get this impression from other staff.  So, five stars.",
   "We come here whenever we're in Columbus. Great atmosphere and good old German fare including lots of cabbage, potatoes and sausage. And German beer!  Prices and service are good. We often go for the buffet but the menu is extensive and good. Don't skip the homemade cream puff or German chocolate cake for dessert. Can be pretty crowded but we don't care."
  ]
 },
 {
  "name": "Rodizio Grill - Columbus",
  "address": "125 W Nationwide Blvd, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8ebbbf3a-932f-11ea-acb9-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=14792497712194194604",
  "source": "GoogleMaps",
  "reviews": [
   "Came with a big group for lunch. The buffet has a good selection of salads and sides. True to Brazilian Steakhouse style, the servers bring skewers of meat  to slice at the table. The food was all well prepared - the sides had great flavor and variety while the meats had various spices. Everyone in our party was satisfied and stuffed.",
   "So delicious and you leave satisfied and filled. This place is amazing, filled with a wonderful staff and a plentiful amount of options at the salad bar accompanied with several savory options of meats. We were greeted in and felt very comfortable in the atmosphere. The location was extremely clean including their restrooms. The server instantly noticed I was brazillian and I was quite impressed with her observation. She remained very nice and extremely helpful making sure we knew the process and were familiar with everything else. She was definitely a highlight of our visit and we were very please by her service. The side items brought out were not only bottomless but delicious. Of course, the steak, the main course was fantastic and was cooked to our preference. I loved every single moment of this visit and will be coming back again soon. Thank you so much!",
   "The Rodizio Grill was a great experience and the first time I was offered fish at at a Churrascaria, and I’ve been to several. The fish was a nice touch. The Gauchos were tentative and made their way to my table in a timely manner. One of the best experiences I’ve had visiting Brazilian Steakhouses. Unlike some Brazilian Steakhouses, Rodizio offers fountain soft drinks instead of individual canned drinks which is nice considering the cost of the meal per person, for me, I went to dinner and it was $36.99 before tax and tip. I would love to revisit this location or another in its franchise.",
   "Amazing experience! The staff was super friendly and made us have a wonderful time dining. Isaiah was especially awesome and extra attentive to what we liked. The food was super yummy too! Highly recommend!",
   "My wife and I loved it, but if you don't like Brazilian cuisine then you may not. But my wife and I have visited Brazil and I thought it was pretty authentic. But I have read some reviews on here that said otherwise, but I am sure they have never been anywhere in their lives but the Ohio dump. Even if you are looking to try something unique and different besides your typical American cuisine, it's worth a one time visit. I end all of my reviews with the same reminder. If you find yourself in the Dayton dump, keep your expectations very low and you won't be disappointed."
  ]
 },
 {
  "name": "Lindey's",
  "address": "169 E Beck St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f013d58-932f-11ea-926c-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=15762243631249603995",
  "source": "GoogleMaps",
  "reviews": [
   "First time there after several recommendations and it's no wonder why it's one of the top restaurants in Columbus. German Village is made better by Lindeys' atmosphere. The food is incredible; not a single entree or appetizer in our 6-top was below average. All the cocktails were too notch, heavy pours. Don't let the prices deter you because you will leave satisfied and wanting to come back.",
   "AJ was a fabulous server! He took his time and made sure we had everything we needed. He also described the dishes and was very personable. The food was outstanding! Definitely stop by and check this gem out. I would recommend it for a romantic dinner or quality family time. Beautiful.",
   "Lindey's is great! The Tempura Cauliflower appetizer is a must anytime we go there. Perfect for lunch, dinner, work meetings, anything. Everyone is always satisfied. And if you have the opportunity, the patio is one of the best I have ever seen. Hot chicken sandwich and burger are always a great go to for lunch. Their pasta dishes are a favorite for dinner time",
   "Had a delicious dinner here for our last night in Columbus.  I ordered a pomegranate mule, which was so good I ordered another!  For my entree, I opted for Australian Sea Bass which was pretty good.  I  will admit I envied my husband's choice if steak fritters, as it was most delicious as was the sauce that accompanied it.  Our table was a bit too close to the hostess station for comfort, but otherwise a very nice atmosphere for dinner.",
   "Fantastic dining experience for brunch and dinner!  Set in the heart of the gorgeous German Village, sitting outside by the fountain in the warm months is a great time."
  ]
 },
 {
  "name": "Polaris Grill",
  "address": "1835 Polaris Pkwy, Columbus, OH 43240, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f4707fa-932f-11ea-8d9e-14b31f159f22.png",
  "tags": [
   "organized",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14163222440403502375",
  "source": "GoogleMaps",
  "reviews": [
   "Great place \nVery reserved.\nGood and romantic for dates. \nVery clean and organized.\nLovely and professional staffs.\nTasty meals with variety of options. \nDifferent drinks to pick from.\nGo there and see for yourself.",
   "I enjoy the setup and the food, have always been able to accommodate our larger than average parties. Foods good and the menu has good variety so everything can find something.",
   "We've eaten here enumerable times including company affairs and have never been disappointed \nHowever my wife ordered takeout Saturday after working at Costco where she manages the flowers \nObviously valentine's is a busy week so we celebrate the day after  The crab cakes were marginal and small and my favorite dish shrimp and scallops new Orleans wasn't very good either  The only items worthwhile were the 55 salad .  Needless to say we were not pleased",
   "The food and service are both excellent if a little pricey.   We ordered two meals, no appetizers, no alcohol, and the bill was still close to $100.00.  Nice place if you can afford it.",
   "Great place to take a date. Lighting is dim and very relaxed atmosphere. Wait staff were professional and courteous, offering to suggest meals, if needed. Prices are pretty much in the $25-35 range with several items under $20. I had walleye amandine, which came with risotto and veggies. It was all amazingly good. There was enough food that I had leftovers to make lunch the next day. I noticed two very long family tables in a separate area. I will definitely return for special nights out."
  ]
 },
 {
  "name": "J. Gilbert's Wood Fired Steaks & Seafood Columbus",
  "address": "1 E Campus View Blvd, Columbus, OH 43235, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8f891966-932f-11ea-b95d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "drink",
   "unique",
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12292127952460782912",
  "source": "GoogleMaps",
  "reviews": [
   "For our anniversary we decided to order dinner from J. Gilbert's--curbside pick up. It was the best decision we could have made! The entire process from placing the order to picking it up was seamless and efficient.  We can't say enough about the food. Everything was fresh, prepared well, and absolutely delicious. We ordered the crab cakes along with some lobster mac and cheese. Oh my! We are originally from Maryland and these crab cakes brought back happy memories of the famous Maryland Crab cakes we used to love. We will definitely be ordering food from here again, and we can't wait to be able to actually dine in (someday!).",
   "We have been here before and they made me an offer that I couldn't refuse---a Birthday coupon! The food, ambiance and service are excellent. A word of advice concerning sauces is to try a sample before putting any on your dish. The crab cake sauce and the house steak sauce are both too hot in our opinion.",
   "Cannot believe I have not reviewed this place! This place is truly a hidden GEM. My family, friends and I have been going here for the last 8 years or so and our waitress, KIM, always takes such good care of us. Last night we went back after having not been for several months and she still remembered my drink order and how I liked my Salad. WOW. Great and very unique wood fired Steak, very high quality food and by far the best service of any Steak house in the city. I am continually unimpressed by places boasting better food and costing twice the price. They may say they are better but they aren't. Despite being in this location for more than a decade the place is always very clean and very well presented. A must for date night. 5 stars! Ask for KIM, tell her Tim sent you :-)",
   "This place is the best steak house in all of Columbus.  The staff is there to always help you and make great recommendation.  The atmosphere is what you think a steak house should be.  The chocolate cake is maybe the best dessert I have ever had.  The steak is always done to perfection and needs no extra sauces.  When they bring the bread try the pastrami butter.",
   "Fantastic food! Easily one of the best steaks I've ever had. Wonderful service and atmosphere. I can't wait to come back!"
  ]
 },
 {
  "name": "Lavash Cafe",
  "address": "2985 N High St, Columbus, OH 43202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/8fd6b978-932f-11ea-baee-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8706843327152669580",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best if not the best Mediterranean restaurants in town. The staff is super helpful and accommodating. Food is absolutely delicious. Ambience is nice. Ample of space. Centrally located near OSU campus and easy to spot from the main road. \n\nNote to Owner: The back room for eating doesn't have the same ambience as main hall and needs work.",
   "We are not residents of the Columbus area. We were in town for business and were looking for a lunch place that served great Mediterranean food. I looked on Trip Advisor and found this place. It was truly outstanding! The food and service were exceptional! We will be returning on our next trip to Columbus.",
   "We love Lavash! We always get the chicken with rice and onion slices and that amazing cream on the side. It's just delicious. I'm sure that, just like any great restaurant, everything is equally delicious there. The service is very good and it's a very international place.",
   "We ordered something wrongly. The owner and employees handled the situation promptly and kindly. They offered to replace it with what we wanted. Amazing customer service! We left pleased. Don’t hesitate coming here.",
   "The best Lebanese Restaurant in the States.\nThe food is delicious, amazing staff and very clean facilities."
  ]
 },
 {
  "name": "Firebirds Wood Fired Grill",
  "address": "8760 Sancus Blvd, Columbus, OH 43240, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/901dd4b6-932f-11ea-83cc-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=856582671558651974",
  "source": "GoogleMaps",
  "reviews": [
   "I went here for a quick bite after a long day at work.  I was a bit stressed as I was only just getting to go to lunch at 4:30 PM after starting my shift at 8:30 AM.  However, once I sat down by the fireplace and was greeting by my awesome waiter who put me at ease. and a wonderfully prepared old fashioned was brought out to me, all my of stress began to melt away.  \n\nI rarely say anything about restaurant ambiance but I really felt this place a standout in this department.  Between the very cool looking bar, the nice warm fireplace, the friendly and welcoming staff, I think this was one of the best locations I've been to so far in Columbus in those categories.  \n\nThe food was a happy hour selection and I chose the ribs.  Depending on your preference, this may not be the ribs of choice.  As far as I could tell it was a brown sugar based glaze with a touch of maple syrup, which seemed like a bit of an odd combination at first.  However, the meat was just falling off the bones and after the initial surprise, I really warmed up to the taste.  Half delicious dessert, half delicious ribs, making for a delicious dish.  I had a side fries that were freshly prepared to go along with it.  \n\nThis was just an excellent dining experience in all regards.  I will say the prices outside of happy hour can get moderately expensive.  However, based on the experience I had, I'm rather looking forward to trying the more expensive items on the menu when I come back.  Would recommend: 5/5, will be back.",
   "I was looking for a good steak house and I find it here. I felt so comfortable, like I was sitting at a friend's house having dinner. That's how awesome my waiter was. Everything that came out of the kitchen was spectacular. The Philly cheese steak egg rolls and the Delmonico steak were of my favorite.",
   "The atmosphere is really nice.  The fireplace, even though you aren't always near it, gives a great ambiance to the place.  Service was fast, maybe a little pushy but quick and efficient.  Orders were brought out accurately which was nice.  Pricing may be a little high for what you receive but sometimes you pay for the atmosphere.  I will go back one try the pizza next time.",
   "Typically not a huge fan of chain restaurants but this menu is banging and most items I have ordered seem to be made reasonably fresh upon order. Deviled eggs are literally the best. The Delmonico steak is great. The meatloaf is top notch, the drinks are made by well trained bar hands. For the price relative to other chain restaurants, Firebirds is in a league of 1",
   "We just moved to the Columbus area and myself and my husband wanted to find a nice restaurant for just the two of us to go to for special occasions throughout the year. We chose Firebirds restaurant for our date night tonight to see if this could be our restaurant. From the moment we walked in the door until we left we were smiling and happy. I would like to focus mostly on our sever, Alexander,  although the greeters, bartenders, and other staff were amazing and welcoming as well. Alexander was extremely friendly!! He was definitely an ambassador for your restaurant. From the drinks to the food he knew all about how amazing each thing tasted and was able to recommend without us having to sit and think and make a decision. The martinis were amazing and are my new favorite. We’ve lived here for about 7 months and have not received the type of service like we got from Alexander. Alexander along with his manager Erich and other co workers, are the reason we’ve chosen your restaurant as our new “special occasion” and maybe a few times in between, restaurant. Thank you for making our evening so great!!!"
  ]
 },
 {
  "name": "Mitchell's Ocean Club",
  "address": "4002 Easton Station, Columbus, OH 43219, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/906935ca-932f-11ea-af2c-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "free",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11243037524852979464",
  "source": "GoogleMaps",
  "reviews": [
   "Years ago, it was only special occasions that I would venture across the city.  Not anymore, this is an excellent seafood restaurant... one of the best!\nIt’s classy, sophisticated... the servers and bar staff are professional and fun! So now I’m there now on a regular basis(4x/month)... and when I’m in Naples, I also go! \nExceptional food and service!",
   "Wow. What a great seafood restaurant. Very professional and knowledgable servers. Great ambience and location. I tried the Chilean Sea Bass which was cooked perfectly, presented eloquently and was a nice serving size. I also tried an old fashioned cocktail, and the table shared some parmesan fries. Overall it's a great restaurant for special occasions, or just a great night with great food.",
   "My boyfriend and I had our 4 year anniversary dinner at this restaurant and absolutely loved it, came back today 1/16/20 just because we loved it so much and got engaged here. This place will forever be special to us and we will continue to come back, our waitresses were AWESOME! So sweet and so informative and very attentive. The food is always amazing!! I wish I could remember our waitresses name because she was so sweet and they even gave us free champagne for our engagement!  forever thankful to Mitchell’s Ocean Club.",
   "Without a doubt the best Ranch I have ever had. Their Ranch has changed me. Colors are more vivid, my smile is wider, my friends say my skin is glowing. I was hesitant to ask for Ranch at such a nice place but I am so glad I did. Please try their Ranch, its especially good with the parmesan truffle fries. 10/10",
   "Great seafood restaurant. One of the best I've ever been too. I love their selection of food. I had the lobster bisque and crab cakes for appetizers, and they were both fantastic. For my main course I had the twin lobster tails which were also really good. And for dessert I had the butter cake which was delicious, the best dessert item they have. I love this restaurant."
  ]
 },
 {
  "name": "Valters at the Maennerchor",
  "address": "976 S High St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90a7ec9c-932f-11ea-b623-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2472019060484248813",
  "source": "GoogleMaps",
  "reviews": [
   "This place was really very enjoyable. The food was fantastic and the serving size was more than adequate. The price was more than I had expected, but what youorder to eat is well worth it. I would eat there again and plan to do so. I am planning to take my friends and relatives there to treat them to some amazing food. The desserts are also very good and taste amazing too.",
   "Food is good. Portions are not very large, I'd say a bit overpriced given the amount of food. The menu needs more variety, despite being typical for what a restaurant in Germany would have. Good selection of beers on tap. The hefeweisen is great. I heard a waiter mention that they have Budweiser in bottles. Get rid of it. You can't have real beer and Budweiser at the same time.",
   "One of the best steaks I've had in Columbus coupled with good wine and pleasant atmosphere. This cozy, hole in the wall spot in German Village doesn't get enough respect. If you're looking to get away from the crowd or an enjoyable date night, look no further.",
   "The first time my wife and I tried Valters, we were so obsessed that we went back 3 more times that week. Almost a year later, it’s still one of our favorite restaurants in Columbus. Overall a delicious and authentic German dining experience. I have a vacation rental property in German Village, and a few of our guests have actually traveled here and booked our place just to try Valter’s. Highly recommended.",
   "The best authentic German cuisine I've ever had. The German potato salad here is on a whole other level than all others. The pretzel rolls are fantastic. The food was flavorful and done to perfection. Staff was super friendly and allowed us to try beer before ordering. And yes, you do have room for the cream puffs."
  ]
 },
 {
  "name": "Wolf's Ridge Brewing",
  "address": "215 N 4th St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/90eda852-932f-11ea-bd9c-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=183356120923925136",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely love this place, one of my favorite restaurants in the city!  Was busy on a Saturday night, but got in immediately with a reservation.  The duck confit was juicy and tasty.  The pork tenderloin was cooked perfectly and seasoned well.  The lamb was so tender it didn't require a knife.  The beer is awesome too!  Service was friendly and attentive.  I can't wait to come back.",
   "In my top 2 favorite breweries for Columbus. Pub fare in the back with restaurant option in the front. Always have 18 WR taps and 4 wines on menu. Garlic fries are good and conveniently located by PINS, elevator tap and platform if your looking to hang out longer. Half a mile from arena district as well",
   "The restaurant was so good, our staff was so nice. We went there for brunch on Saturday, they're busy!\n\nMy husband got Croque Madame with garlic fries. It was huge but so good. Duck egg made everything so smooth, I like his food more than mine 🤣\n\nI got Toad in the Hole, it was good too but in my opinion the bread was dry I just don't like the texture that much, but don't get me wrong, I ate them all and ate my husband's too!\n\nThe garlic fries is👍🏻👍🏻👍🏻👍🏻👍🏻 the dish was clean and their OJ is fresh pressed, so yum, finally I found a good fresh pressed OJ ($4)\n\nOverall this place is good, will comeback for sure!",
   "Awesome experience. Received beer delivery up to the Akron area. Keep brewing and thank you again!",
   "Great beers and excellent bar. The food was well prepared, hot with excellent service. The staff was fantastic and friendly. Can't wait to go back.Highly Recommend!!!"
  ]
 },
 {
  "name": "Bakersfield Short North Temporarily Closed",
  "address": "733 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/913ade2e-932f-11ea-8bb6-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7117089005649050140",
  "source": "GoogleMaps",
  "reviews": [
   "Stumbled upon this place last summer when we were in town for a concert and it was the first place we stopped upon our return this year. Everything we've tried has been great (guac, salsas, tacos, Johnny salad and the margaritas). Get the pineapple margarita spicy... Worth the extra dollar. We'll be back!",
   "Had dinner here last night with high Hope's after reading reviews. Must have been an off night or our server was new. It was a chore to order a beer if you actually care about what kind of beer you are getting. Asked the server if there was anything on tap that wasn't on the menu. He says no. So I asked about the Madtree seasonal and he proceeds to pull out a hand written list with several beers that weren't on the menu. If you have rotating taps just print a real beer menu that is up to date. Then they brought me the wrong beer. \nWe ordered our meals and they bring everything out of big platters.  Would be much better to just plate the food. We had a large party so they brought half our food at a time and had to switch players out so we could serve ourselves es our tacos. Not extremely enjoyable but tacos were pretty good. No real reason to come back.",
   "Always enjoyed this place. Tacos are good. Good for hanging out with friends. Good for bite and quick drinks. Better to call in before you go during rush hours.",
   "This is most likely going to my go to place for happy hour spot since I work 10min away in Short North AND for Brunch. I mean what can I say about this marvelous establishment. The staff is great, the food is amazing.  It's a random goal of mine so we'll see what happens.",
   "Tacos and queso were very good. The margaritas were amazing! Definitely will be back."
  ]
 },
 {
  "name": "Z Cucina di Spirito",
  "address": "1368 Grandview Ave, Columbus, OH 43212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/91808bae-932f-11ea-8997-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "creative",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13543795693593826943",
  "source": "GoogleMaps",
  "reviews": [
   "Had to see what the number 1 restaurant in Columbus, Ohio was all about. Italian theme with a wonderful evening to enjoy dinner on the patio. I loved the Lasagna and the cheesecake was perfect. Loved the marshmallow on top along with salted caramel and raspberries. Look for Glory as she is such a nice person and made the visit a very enjoyable experience.",
   "The main dish does not meet my expectation. They have more space to improve the taste to match their price. But the meatball is very delicious! We have lots of choices for wine. And servant is really nice but the dish is a little bit slow when coming from kitchen.",
   "Ordered pickup at 4:30 for 6:15. Got here at 6:15. Didn’t receive food until 7:25. The food was fantastic, as usual, and they tried to make it right.  That said, the pickup business model needs a lot of tweaking.",
   "Wonderful service and staff. The food is really great. I tried something from the temporary menu. The chef who designed it is obviously skilled, although there were a few parts to the dish that I did not like. Mainly, I thought the smoked shrimp tasted odd and wasn't a great method to cook it. The flavoring it added to the risotto was incredible, but the smokey flavor on the shrimp itself tasted clashing with its natural flavor. The tomato salsa on this dish was absolutely perfect and the fish was light and crispy - delicious! It was really neat to try something that was creative and fun, and I would definitely come back to see what else the restaurant has to offer.",
   "Absolutely one of the BEST Italian restaurant in Columbus. Hands down! Not only was the food absolutely amazing and well worth the money but the staff was so accommodating and on top of everything. Highly recommend if you're looking for a fancy place for dinner or to celebrate something romantic. Highly recommend!!"
  ]
 },
 {
  "name": "Basi Italia",
  "address": "811 Highland St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/91c8158a-932f-11ea-8a10-14b31f159f22.png",
  "tags": [
   "free",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13879851492328371322",
  "source": "GoogleMaps",
  "reviews": [
   "Small. Seats about 30 in upstairs dining. Can be drafty near window during cold weather. Thoughtful & ever-changing Italian focused menu, including specials. There can be misses, but mostly home runs. Downstairs bar and seating. Great cocktails & wine selections. Additional seating Outdoors weather permitting. $10 valet parking if you don't have cbus parking app. Vacated giant eagle parking lot may be a free option 2 blocks away. Reservations are highly recommended.",
   "Amazing! The drinks were on point. Service was top notch. Can't say enough good things about the food. Already excited to go back!",
   "Small, noisy, parking is a pain, but the food is on point. Started off with the mussels and though I'm not big on tomato based, these were excellent. I had ordered the short ribs but the waiter came back and said they were out so I landed on the the lamb chops. If the short ribs are anywhere as good as the lamb chops are, I can't wait to go back. Surprisingly, the prices are very reasonable for the quality, the latter about as close to a five star as I would give a restaurant.",
   "I've eaten here three times and each of the three times, my entree was absolutely perfect.  Our server (Kaitlyn was it?) was fantastic.  The atmosphere is like nothing else with its small, cozy dining room which is basically a large living room.  This is my go-to special occasion restaurant.",
   "Best restaurant in Columbus hands down.  Whitney was our server and she took great care of us! She was on top of her game like I've never seen anyone! Ask for her when you come here. You won't regret it! The food is EXCELLENT! There are alot of good restaurants in Columbus but they are mediocre compared to Basi Italia! Waaaaay under-rated in this city! The service, food, and wine selection is out of this world! A Columbus hidden gem that should be beating out places like Lindy's and the Pearl   no question! Thank you Whitney for making our anniversary dinner wonderful! We will definitely be coming back!"
  ]
 },
 {
  "name": "The Melting Pot",
  "address": "4014 Townsfair Way, Columbus, OH 43219, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/920fcd30-932f-11ea-ae11-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9914249157107394432",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely amazing experience, that has to be on everyone's bucket list!  Can be quite romantic, or a fun visit for a small group of 4-6",
   "Great spot for an intimate girls night out. Cocktails, cheese and chocolate was fun and delicious. Had fantastic service from Brandon. Classic Alpine and Wisconsin cheddar cheese fondues with all yummy dippers. Original chocolate and peanut butter and the white chocolate bananas foster dessert fondues with the add on dippers. Love the macarons and cheesecake. Highly recommended the Love Martini if you like a sweet and fruity cocktail",
   "The good- our waiter was wonderful. The food was tasty, my favorite being the chocolate fondue. \n\nThe bad- \nI basically paid $100 for two people to cook my own food with portions that would cost about $10 max if I bought them at a grocery store. Ridiculous. $22 for 3 shrimp, 3 small (I'm talking like pink eraser size) pieces of steak, chicken, and salmon. The best steakhouses in Columbus serve bigger portions and cook it for you! This really is my biggest gripe. I can cook my own food at home, the \"experience\" isn't worth the cost by a long shot. Actually buying a hot plate and double boiling the ingredients yourself at home would have been more cost effective. \n\nThe front desk attendant was extremely rude and cannot string together an intelligible sentence. She mumbled and gestured at us after rolling her eyes when the other host told her to seat us with our group. \n\nAll of my clothes and coat had to be washed thoroughly as they smelled to high heaven after leaving. The place should probably have better ventilation if there's going to be steam all over. It really does cling to your clothing.  \n\nAll around-\nWe had fun but I wouldn't go again.",
   "The experience was great. It was fun and romantic just doing the fondue. My husband and I enjoyed it. Service was excellent but for the price the quality of the food needs to be greatly improved. And the atmosphere could be much nicer.",
   "The Melting Pot is an awesome experience and so fun. I feel it is very romantic with a significant other! It is a little pricy, however the experience is worth it! I have only been twice but the staff both times were out of this world!"
  ]
 },
 {
  "name": "Hyde Park Prime Steakhouse",
  "address": "569 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/92569a7e-932f-11ea-8a39-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=937217903962852875",
  "source": "GoogleMaps",
  "reviews": [
   "Went last night for our 3rd year anniversary and had such an excellent time. Great friendly staff that took amazing care of us and made the experience so special. The food was so amazing. It was the best steaks we have ever had. Definitely would go back and recommend others to go.",
   "I got to experience Hyde Park at a lovely event as part of a private group. The atmosphere is beautiful, the dim lights and fresh white tablecloths fit the mood of the restaurant perfectly. All the food was wonderful and the care put into every detail was stunning. Every member of staff we spoke to was friendly, knowledgeable, and very professional. I would highly recommend this Columbus staple for any private event or party.",
   "The food was absolutely amazing. They have a broiler for there steaks so it instills a really nice char to the beef. The service was wonderful. They'll bring out the Japanese Wagyu before its cooked to inspect the marbling. I will be returning soon.",
   "A great place to have dinner with a beautiful atmosphere. The staff were all friendly and helpful. We celebrated our anniversary and they helped make it even more special. Thank you!",
   "It was my 23rd birthday and the food was so amazing. Drinks were really strong too. I believe a manager actually took the time to help our table, we had a party of 10. It was my first time at a really nice steak house and I will be back for sure. We got a free dessert and it was the BEST dessert I've ever had in my life. I highly suggest to anyone looking for a fancy night out to go to this place. The restaurant made my birthday amazing. Thank you!"
  ]
 },
 {
  "name": "Scotty's Cafe",
  "address": "2980 E Broad St, Columbus, OH 43209, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/929b6bae-932f-11ea-ba04-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "delicious",
   "food",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5596522102291816008",
  "source": "GoogleMaps",
  "reviews": [
   "The service right when I walked in was top notch. Greeted very friendly. The service was very good & quick. She was super nice and kept my coffee full the entire time. The breakfast was great. But the French Toast was the best I’ve ever had. It was out of this world good. Yes his will definitely be my new local spot.",
   "Scotty's Cafe was delicious! I tried the tomato basil soup and pastrami reuben. Everything made in house. Service was fast, friendly and efficient. Greeted warmly by all staff members including owners Scott and Gina. Gina even reviewed the menu with us! Drinks refilled quickly and we never felt rushed to leave. We were actually encouraged to sit and relax. It is a must try! I will definitely be back and bring other family members to enjoy!",
   "Very good food at a good price. Good portion size and well displayed. The small space filled fast for lunch. The owner came out to personally check on every single person. Great attention to detail. Friendly, caring staff.\n\nI travel a lot for work and always try to hit local diners, I’ve been to diners all over New England, New York, Pennsylvania and now Ohio and this has been one of the best overall experiences (food and hospitality) I’ve ever received. \n\nThank you to the entire staff for their hard work and tasty food!",
   "I discovered this fantastic little diner with very friendly service while passing through on my way back home to Indiana. All of the staff worked together to ensure the customers are taken care of.  The owner made it a point to stop by every table and knew right away that I was a newbie. We chatted a bit and I discovered that everything in the diner is made fresh, including the various breads that are made onsite. The food was delicious and my experience ended with a wonderful chocolate chip cookie for me to take with me on my trip back home. So glad that I got to experience the wonderful hospitality and amazing food that they offered. If I'm ever back in town, I definitely will stop by again.",
   "We stayed in Columbus last night and this morning I googled breakfast near me. This was one of the first places on the list with 4.9 stars. Unheard of! Google also said the place was similar to Lincoln’s Waffle Shop which is one of my favorite places in DC. It did not disappoint. The coffee was delightful. I ordered a veggie omelette and my husband got the French toast. My omelette was good. We both agreed the French toast was the best we’d ever had. The service was wonderful. Staff was friendly and attentive. We even got free cookies for the ride home. Will definitely be back."
  ]
 },
 {
  "name": "Brassica in the Short North",
  "address": "680 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/92db0cf8-932f-11ea-845a-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "delicious",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15310057678847878087",
  "source": "GoogleMaps",
  "reviews": [
   "The food was amazing. However, deep in my dish I found this metal piece in my food and almost swallowed it. Thank God I coughed it up. It could have messed up my esophagus or stomach. I want to eat here again but is it safe????",
   "The best Mediterranean food!! So fresh, and so many ingredients to pick from! You can tell they really take the time to not only create great options to pick from but make them absolutely delicious! Staff is so friendly and knowledgeable. Cannot wait for things to open back up because the ambiance in this restaurant in general is fresh, modern, and inviting!",
   "Amazing. They were super accommodating for a work lunch. Food was delivered on time, without issue and was delicious. Great option for allergies/vegetarians. Also - their online menu was super easy to use/navigate and place an order - loved the family style options - made it so easy to please a large group!",
   "Very good, 4.5 stars for what it is. But then again, what exactly is this place? \n\nJust had lunch here and it was great, it seems young people and hipsters give it five stars.  But perhaps old crusty folks such as myself will experience a limited menu, or maybe be a little confused.\n\nFor example, it appears the main act here is Mediterranean type pitas, or you can deconstruct that into a salad bowl. The pitas are great, warm, fresh, and they have pickled cabbage, feta, tahini sauce, hummus, things you get with Mediterranean street food. \n\nBut the meat choices are… Southern? Like brisket, and caramelized bacon.  The brisket was really good, lean and flavorful, no disappointment at all.\n\nBut still a little different combination and a little different kind of deli. Limited seating, small tables, you do your own table busing.",
   "Real food, really really good! I suspect, from the fabulous bright flavors that I'd never run into anything microwaved or out of a packet here, and that the food had low to no additives (as I try to stick with over 99% of the time). Also thrilled to find that they are sourcing such high quality ingredients, that there was Real Salt, (although my food was already perfectly spiced) and very clear allergen information for several different allergies!"
  ]
 },
 {
  "name": "Forno Kitchen + Bar",
  "address": "721 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9320c8c8-932f-11ea-86f7-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "tasting",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7209221198944424412",
  "source": "GoogleMaps",
  "reviews": [
   "Best happy hour ever! Half off the majority of their menu from 4-6pm including cocktails. Servers, at the bar, are very attentive even in the chaos of happy hour! Food was delicious and definitely enough to share.",
   "I go here for happy hour after work quite often and it's dope! Half off great tasting cocktails, appetizers, and pizza keeps me coming back. The service is also A1 and we're always taken care of. \n\nIt can be a bit busy though so you might have to be comfortable with chilling at the bar unless you call ahead of time.",
   "Not worth it. The chicken was dry and the food over seasoned with garlic.  Pizza was not up to snuff.  A bit soggy in the middle. It wasn't that expensive and the service was good, but I would have rather gone elsewhere. (Also this is def an Italian place, not 'New American')",
   "Very cool atmosphere, great service and tasty food.  I had the carne pizza with artichokes.  Crust was nice and crispy and the pizza held together nicely.  It was large enough to have leftovers the next day.  Drinks were great as well!  I can't wait to go back.",
   "Went here for a birthday brunch last year with friends, and it was great! Food was delicious and the service was great! I’ve been other times, with good service and food, as well!"
  ]
 },
 {
  "name": "Milestone 229",
  "address": "229 S Civic Center Dr, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93751eda-932f-11ea-9eff-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=359419949347154922",
  "source": "GoogleMaps",
  "reviews": [
   "Milestone 229 is an amazing restaurant in a fantastic location. Its sits right in the Bicentennial Park and has an amazing view of the the Scioto River. Myself and a group of work colleagues ventured to Milestone for dinner and we were all impressed with the service and food offerings. We were able to select entries from burgers to short ribs to shrimp and grits. The libations were top notch and I would personally recommend the Manhattan. I left this establishment with a phenomenal restaurant to add to my list of places to return. 5 Stars.",
   "great food, a bit of the pricey side but really good. good views of the park during the day and awesome outdoor seating. Make sure to get a reservation as they fill up quick. also , kind of a short menu so look ahead of time to make sure there is something that interests you. Valet available out front.",
   "Great location (though parking can be a hassle) and very comfortable at both inside and outside seating. Sat outside for brunch and had very good, meaty sandwich. Everyone really enjoyed their food, and the staff was polite. Would definitely recommend to anyone.",
   "Milestone 229 has fantastic food at very reasonable prices. This restaurant offers a great menu that doesn’t get overly complicated. I have never had a bad meal here and anything that I choose is always excellent. This is a fantastic place for a date night or an evening out. The restaurant has a lovely atmosphere and the quality of the food sets this place apart from other restaurant. Fantastic!",
   "Recommended by a dear friend and they were spot on ! Milestone 229was awesome. .best I’ve ever had.  very good. Service good. Not your average dining experience, but far below Fine Dining pricing."
  ]
 },
 {
  "name": "M at Miranova",
  "address": "2 Miranova Pl, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/93b95598-932f-11ea-84aa-14b31f159f22.png",
  "tags": [
   "food",
   "art",
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11488070980547003237",
  "source": "GoogleMaps",
  "reviews": [
   "Excellent food, drinks, and service.  Celebrated our wedding anniversary with dinner and it was  fantastic. The service was everything you expect from a fine dining experience. I had a surf and turf while my wife ordered veal. It was some of the best food we ever had.",
   "Presentation was eye art and everything tasted as great as it looked.  Staff was helpful.  Will go again.   Restaurant is fairly small and intimate,  reservations are must.  Would love to watch fireworks from their outdoor patio.",
   "Honestly the best service I have ever received!!!! The food was phenomenal but the service was out of this world! I would most definitely recommend. If you want a quiet place I would direct you not to go here. It’s a busy place so therefore noise levels come with that! You won’t be disappointed!",
   "First time being here since the remodel and menu update. From traditional steak house to modern flare, M has flipped itself around. Food is prepared perfectly, but flavors are unique and may require an open mind compared to the old stuff. I'm glad they updated but want to see if they fine tune their flavor choices in the future. Great time either way and glad we went back!",
   "The best restaurant experience you can have in Columbus!  Now a 4 diamond restaurant, the best around!  Cameron Mitchell at it's best."
  ]
 },
 {
  "name": "The Top Steak House",
  "address": "2891 E Main St, Columbus, OH 43209, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94097174-932f-11ea-931d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "unique",
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6038234195512178398",
  "source": "GoogleMaps",
  "reviews": [
   "Love the ambiance of this place and I also love that the steaks come with large onion rings.  The steak itself is simply seasoned - I like mine with a little more oomph.  I ordered mine cooked more well done than my husband but his was cooked more well done which annoyed him.   The broccoli has no seasoning or butter, making it nothing special. The Mac n cheese was perfectly delicious. \n\nWe’ve been going to the Top for several years and I feel like the food “taste” is not quite what it used to be.  Would love to see some improvements.",
   "The best meal I’ve ever had!!! Ripeye steak and onion rings are below my mind😍Steak was cooked medium well and onion rings were crispy but not oily at all. Love their soufflé too,crispy on top but soft inside. Good vibes with old songs and bartenders treated us well. We enjoyed our meals and will definitely come back",
   "The Top is unique among steakhouses in Columbus. It is an unapologetic step back in time to the late fifties and early sixties. The only thing missing is the cigar/cigarette smoke. The wait staff is attentive and knowledgeable. The steaks are on par with the other high end steakhouses. The bone marrow appetizer was a real treat. It was done really well with a bacon red pepper relish. The high point for me was the cocktails. They are head and shoulders better than the other steakhouses in town. My wife and I were skeptical about The Top because of the area of town it is in, but it really is one of the best steakhouses in Columbus and we will be back.",
   "......The atmosphere is great, which earns this place its only two stars. While the Kansas City Dry Aged Steak is FANTASTIC, that's about it. I won't visit again after my meal tonight. $51 for lobster tail that tasted like a car tire (I literally counted to 32 seconds of chewing) on top of my $42 steak (that was the steak and lobster dinner) Yes my Steak and lobster was over $100 (I normally don't ask for $$ at MP, but I usually don't expect it to be gross) In the end I paid for everything because I should have mentioned something earlier... but $100 for a single plate on this side of town is atrocious when the food (except the one steak) is mediocre at best.",
   "One of the best steaks I've ever had. If you want to go to old Vegas but can't travel back on time, this is the place for you. You can almost see Frankie and Dean smoking in the corner booth. Great service and the food is terrific"
  ]
 },
 {
  "name": "Cap City Fine Diner and Bar",
  "address": "1299 Olentangy River Rd, Columbus, OH 43212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/944eb824-932f-11ea-be57-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "free",
   "food",
   "delicious",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14162762729384557771",
  "source": "GoogleMaps",
  "reviews": [
   "This is a good spot.  Showed up on a week night with a big group, and this place was hopping.  I expected slow service but was pleasantly surprised, very energetic staff.  The food is delicious.  I sampled multiple dishes and saw many more at our large table and was very impressed.  I like places like this.  They have an adequate menu and do it well, as opposed to offering everything imaginable and average food.  Definitely be back.  Give ‘em a try.",
   "This place is amazing. It has been spectacular every time I've come. Excellent service. Really friendly people work here. And the food and their attention to allergies is off the charts fantastic. I cannot recommend it highly enough. And they have dishes that you normally just cannot get gluten free. Like a cheese steak sandwich and beer battered fish and chips. Love love love it here! And they are very careful with allergies. When you come at dinner they even have dinner rolls that are gluten free. Today I came on a Sunday afternoon and they had fresh hot delicious cinnamon rolls. This place is the best. Wish I didn't live an hour and a half away.",
   "The perfect lunch spot. I only say that because I've only ever been there for lunch since it's close to my office and I live far outside town. I can only believe it's a great dinner spot as well. I like to try something new off the menu every place I go more than once. More often than not I get burned by that mindset, sadly. My fault for liking variety in life, I suppose. Not at Cap City though, every time I get something different, it becomes my new favorite dish. The one constant, because I love blue cheese, is their blue cheese salad. It's amazing. At my last visit I got the walleye blue plate special (pictured) and I couldn't have been happier.  Cap City will continue to be one of my go to spots.",
   "We went here to dinner, me, my fiance, my mom and his mom last night. Amanda was such a great server. She was so sweet and helped us make sure we got our leftovers boxed up. We will definitely go back to Cap City again. I highly recommend the carrot cake, thanksgiving day sandwich, the fish or the cheeseburger. And the rolls they give you are delicious! Thanks Amanda!",
   "My party of two wanted a regular table but the wait was over 30 minutes. The hostess said we could sit at the bar overlooking the men getting salads and desserts dinner. We hesitated sitting at this spot but we really enjoyed this seating!  Our server did excellent service with our drinks and food. My order of food had an item that I do not eat. (I mentioned it to the server but it ended up having the ingredient.) The server was very gracious (he was still fairly new) and immediately told the chef. The chef came out and suggested how he could prepare my order which was agreeable to me. The chef was wonderful! Our food was yummy as well at the chocolate cake! We will definitely return to Cap City Fine Diner."
  ]
 },
 {
  "name": "The Table",
  "address": "21 E 5th Ave #101, Columbus, OH 43201, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/949732e6-932f-11ea-be2a-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "drink",
   "food",
   "family",
   "food",
   "foodie"
  ],
  "link": "https://maps.google.com/?cid=5869490832690112890",
  "source": "GoogleMaps",
  "reviews": [
   "We have eaten at The Table numerous times for dinner and brunch. It has been so amazing each time we have gone from the service to the homemade food! Such creative dishes and such care taken in the preparation. I also have enjoyed their amazing cocktail selection. High recommend!",
   "We went there and got a couple of appetizers and a drink the appetizers were around $12 a piece the drink was also $12 which was approximately 3 to 4 ounces or less the appetizer was perfectly plated  with fresh local ingredients... food was amazing I just can't get over the specialty drink that we got it was gone in about three or four small sips it cost the same as the appetizer \n\n if their entrees are as good as the appetizers its worth checking out... definitely need some remodeling... the owner was very nice we will probably stop back and give it another chance",
   "Top Notch!!  The food, oh the food, is amazing...  BUT it’s this FAMILY of owners and staff that make it what it is...  a great experience surround by people who are passionate about what they do and the people they serve!\nWe love the uniqueness of the menu and  the newness and creativity by their cultured chefs!  \nWe will definitely be back for more of those melons and ham hocks!!!!  ❤️",
   "I am a foodie and the Table is one of favorite places to dine.  The funky decor, thrift store china, and the amazing east meets west integration.  I am truly happy to be alive to just have enjoyed last night's winter pasta so much.  Of course I was hungry too.  The drinks were fun, the server attentive, the crowd lively but not too much so.   If you're a burger and fries sort, it probably not your place.",
   "I don't spend much time bragging about restaurants, but this one is incredible! I highly recommend experiencing this culinary delight. Ask for Samantha and you will be treated like royalty. I got the impression all of the staff had the same mindset to give their customers the best treatment possible. You won't be disappointed.👌"
  ]
 },
 {
  "name": "Pasqualone's",
  "address": "5766 Emporium Square, Columbus, OH 43231, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/94e3f38c-932f-11ea-91be-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2872019833720093191",
  "source": "GoogleMaps",
  "reviews": [
   "Cant say enough about this place. I had the linguini with clams special and it tasted so fresh and filling. We had so much food, but we didn’t feel miserable and I think that’s a testament to how fresh this food was. Will definitely be back!",
   "Incredible. This is the place you want to go for an authentic Italian meal. Service, food, and ambiance was exactly what I was looking for.",
   "A true dining experience.  Fresh, homemade Italian at its finest. Impeccable service. Go casual or dress up.",
   "This was our 1st time here and it was so good that it won't be our last.  The atmosphere is nice and cozy but, it can be a little loud because it's a small dining room with only about 13 tables. You should call and make a reservation especially on a Friday or Saturday night. The service was excellent! We had our main waiter but there were 2 other guys who help out and the 3 of them worked great together bringing food out, clearing the plates, and making sure our waters were kept full.",
   "Best Italian restaurant in Columbus and it's not even close. Do yourself a service and go."
  ]
 },
 {
  "name": "Katalina's in Harrison West",
  "address": "1105 Pennsylvania Ave, Columbus, OH 43201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/953261f4-932f-11ea-bf63-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "creative",
   "food",
   "delicious",
   "free",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1169711355043442049",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a gem! The style and ambience was wonderful! It's fun and eclectic. The food was so delicious!!! I try to eat a lot of vegetarian meals when I can, and this place had a surplus of options and flavors. It was definitely busy and took awhile to get our food, but the wait was worth it. That's what you have to endure sometimes to try the best in town. Will definitely come by again!",
   "We got curb-side delivery to our car. Pancake balls & thick slice bacon, vegan sausage biscuts with eggs for brunch. Also, got their chicken breast sandwich to warm up later for our dinner. Everything is fresh, creative & a good value. Staff is helpful & friendly!",
   "I come here often. In fact I think I actually  live there. The people are friendly.  They've  never met a stranger. The food is yummy! I always pick up an order before going put of town to have for dinner later that night and to have for breakfast the next morning. Plus, I think my husband is so used to me doing it that it's an absolute must.",
   "We recently had breakfast here. Good food! Advertised as locally produced and all natural. Free parking next door from 8:00am to 4:00pm. We noticed after we parked. I had the Southern Brown Betty Biscuit Balls with apple butter for dipping and my wife had the Breakfast Chick 'Wich. Both were delicious! A little more expensive than we thought for a small local restaurant. They sell bottled sodas, water in the box, hot coffee/tea, and varied juices. They are coffee was fresh and tasted like a local coffee house. It was a good find!",
   "I love this little neighborhood joint! My go-to is their pork sandwich, which is big enough to last two meals. The avocado toast is also great - don't let the price deter you! It comes with scrambled, seasoned eggs with queso fresco and roasted seasoned pumpkin seeds. Breakfast taco is equally delicious and filling. The only thing I wouldn't recommend is pancake balls as they were incredibly underwhelming. You're better off with one of savory options instead."
  ]
 },
 {
  "name": "Ambrose and Eve",
  "address": "716 S High St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/957d26ca-932f-11ea-834d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "unique",
   "family",
   "food",
   "delicious",
   "organized"
  ],
  "link": "https://maps.google.com/?cid=1322937710258447169",
  "source": "GoogleMaps",
  "reviews": [
   "The staff is friendly and attentive. Ruby was super helpful and made our first visit very enjoyable. We had a party of 10 in the private room so we had a little of everything. The food is amazing! Seriously everything I tried was delicious. It feels like a special occasion place without the special occasion price. I’ll be back again very soon.",
   "Truly outstanding fried chicken dinner. The best I have ever had. It is clear that true love and care was put into making this food the best it could be. Tons of food for 2 people. The chicken was the star of the show. It was remarkably crispy and juicy inside and the sides dishes all complemented the chicken well. Absolutely will go back and split this 4 ways with friends",
   "Atmosphere was amazing. Food was top notch. You can tell by the way it tasted and was visually appealing that the person who made the food really cares about what is sent out of the kitchen. I can't wait to go back and try different things. On a side note, I overheard the bartender say that there has yet to be a dish he tried that he did not love.",
   "The space is cute and the service is friendly so that's good. Regarding the food - if you've got a choice between brunch or dinner, then choose brunch. I'd recommend trying the hash browns and the french crepe with simple salad. \nFor dinner, \"sweet\" is very clearly the chefs' forte here and permeates virtually every dish I tried on the menu - from the roasted brussel sprouts to the poached calamari - and the best execution was on the dessert course. While the plating on some of the items were interesting to look at (the calamari, the carrot cake), the overall food experience was missing the mark on providing dimension.",
   "My friend and I came here because we've heard good things about their drinks and food. The place was packed inside, so we were seated outside. It was a very cozy and cute place, from what I saw from the outside looking in. There's various street parking options and many other businesses surrounding the area. Their menus are very pretty and organized pretty well. The prices are a bit expensive and portions are a bit smaller than we expected. Each dish is supposedly enough to share and be family style, but I can tell you, what we ordered for the 2 of us, wasn't enough just for me.\nWe ended up ordering 2 drinks, an entree, and a shareable dish; braised ribs and brussel sprouts. Our drinks came about 15 minutes after our food, which also took a bit.\nThe brussel sprouts were very good, but they were crazy special or anything. The ribs on the hand, were delicious! They were Thai inspired and had a unique flavor. However, the portion of the ribs was not worth the price.\nWe also order the Hydra and Super Bloom cocktails. The Super Bloom was super strong, but the Hydra was pretty refreshing.\nThis is a cool place to try and it had relaxing and cozy vibes. We enjoyed the atmosphere and our waitress was very nice. I think it's a good place for a casual date or to grab some drinks."
  ]
 },
 {
  "name": "Marcella's",
  "address": "615 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/95c5537e-932f-11ea-9aef-14b31f159f22.png",
  "tags": [
   "food",
   "kids",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=6450536266282355269",
  "source": "GoogleMaps",
  "reviews": [
   "High end pizza/pasta in a casual/classy environment is a great stop for all occasions. Intensive and helpful service, amazing food all around, and though this may be weird to add in a review, very clean and well maintained bathrooms which is much appreciated. All around must try!",
   "I love Marcela's.  The Margharita pizza is so fresh and satisfying.  It's a great deal during hour 4- 6 weekdays.",
   "We were nicely impressed by the place! The restaurant was very busy but very friendly, efficient and accommodating! The atmosphere was warm and friendly! The food was wonderful! Both kids and adults can choose  from the menue! We definitely come to Marcella's again and bring our friends!",
   "I went on Valentine's day and had a reservation for 9:15pm. There was still a wait for reservations when we arrived, but that was expected since it was a holiday and the wait wasn't too long. Our server was very friendly, knowledgeable about the menu, and gave great recommendations. We had the braised veal meatball as an appetizer and it was seriously one of the best things I've ever tasted, I would go back just for that. For my main course I had the eggplant parmesan with a side of spaghetti with marinara sauce. The eggplant and pasta were both cooked perfectly. Also, I recommend the strawberry balsamic cocktail, it is now one of my favorite drinks.",
   "Make sure you reserve a table, especially on the weekends. If you do, you will have a great experience wait. We were there no more than 15 minutes before we are seated and provided service. I was very impressed with the quick service considering how busy it was. The veal meatball was highly recommended as an appetizer and for good reason. The risotto was also very authentic and i don't think it could have been better. I would highly recommend Marcella's for a casual night out, especially with that someone special."
  ]
 },
 {
  "name": "Dirty Frank's Hot Dog Palace",
  "address": "248 S 4th St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9603e33a-932f-11ea-954a-14b31f159f22.png",
  "tags": [
   "drink",
   "free",
   "drink",
   "food",
   "delicious",
   "cheap"
  ],
  "link": "https://maps.google.com/?cid=531905216648182422",
  "source": "GoogleMaps",
  "reviews": [
   "This is one of my favorite places in Columbus. Great prices, great selection and atmosphere. Fast and friendly service. They have good gluten free buns too. They turn tables fast and there is frequently a wait. Not the kind of place you go to sit for hours drinking with your friends. Head next door to 16 Bit if you're looking for a place to camp and/or drink.",
   "Best late night place to go to if you want drinks and hot dogs. It's not too expensive and the staff are amazing. I personally recommend the Loaded Potato dog and the Fried Leeks, but there's plenty of options on the menu. They also have vegan friendly options so no one feels left out! Best hot dog place I've ever been to.",
   "Talk about choices! There’s a hot dog for everyone at Dirty Frank’s, even vegans and vegetarians! I had a vegetarian polish sausage fire on the Rhine and a vegetarian sauerkraut dog and they were both excellent. Their fried leeks were also good, not too greasy and cooked just right. \nThe only downside is it’s pretty small inside, but take a seat at the bar and have a drink and you won’t even notice.",
   "There is a beauty in finding a restaurant that simultaneously has a great atmosphere, excellent service, a myriad of food and beverage options and a quick ticket time. I can’t say enough great things about this place - most notably their $2 PBR option for happy hour. My favorite dogs are the Chicago and the Princess but I try to switch it up often. \n\nWhether you sit at the bar or one of the tables, you’ll be in the presence of great company and receiving excellent service. This place sets the bar very high!",
   "Best cheap eats in Columbus (they've literally won this title from magazines). I'm usually not a big hot dog person, but this place is amazing. The sheer variety alone is enough to satisfy the pickiest of eaters. You'll find the strangest of unexpectedly good combinations. Last time I went, I tried a dog with pretzel bites on it! Their Mac and cheese is also surprisingly delicious. Love this place."
  ]
 },
 {
  "name": "Hot Chicken Takeover",
  "address": "59 Spruce St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/964d96a6-932f-11ea-a828-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "free",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=11434009528245477286",
  "source": "GoogleMaps",
  "reviews": [
   "Hard to say anything more about this place than the 1000 of other reviews.  It is just great chicken.  If I live closer I could probably eat here 4 times a week.  I love the common tables as you can always strike up a random conversation if you want to.  With the location in the North Market it gives you a few other places to stop for desert on the way out.",
   "DELICIOUS CHICKEN! Also really enjoyed the Mac and Cheese as well. The line was long (waited for the better part of an hour), but other than that, i have no complaints. Would recommend it to just about anyone who would want my opinion.",
   "Awesome hot chicken & so much food for under $15. Really cool that the tea is always free!",
   "Love this place. The service is always friendly and the people make the experience worth the wait. I enjoy that they have a chart on the wall to tell you what they are \"All Out\" of, so your aren't too disappointed when you make it to the register.",
   "First timers.  I went with the HOT.  The dark was sold out so I went with boneless chicken breast.  I did double Mac sides (mistake).  First off, the chicken is delicious.  I was worried because white meat can be dry, not this chicken.  And yes, it was hot.  I drank A LOT of iced tea.  The Mac and cheese was a bit gritty.  Flavor was okay, but I don’t like grit.  The coleslaw ( which I had some of my friends) is more vinegary than mayonnaise-y....and I am okay with that.  Definitely, going back.  Five stars for the chicken.  What took it to 4 was that Mac n cheese."
  ]
 },
 {
  "name": "BRAVO Cucina Italiana",
  "address": "1803 Olentangy River Rd, Columbus, OH 43212, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/969415c2-932f-11ea-9666-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "delicious",
   "kids",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15373071165271545254",
  "source": "GoogleMaps",
  "reviews": [
   "Today was my very first visit to the Bravo location on Olentangy River Road. My mentor and I stopped in to grab a quick meal while waiting for traffic to clear up in the area. The setting in the restaurant was traditional and set the tone for the meal. We were seated quickly by the waitress after being offered a booth or a table. The waitress (Devin) was kind and knowledgeable, which is always greatly appreciated. The appetizers arrived to the table quickly, which was a surprise considering the number of tables our waitress had to attend to. The entrees came quickly and without erroror or complaint.\n\nAll in all it was a positive experience!\n\nWill return again in the future.",
   "Overall, this restaurant is wonderful. Servers are professional. This can be a nicer restaurant for a date, but it can also be good for the occasional casual family outing. Kids can have fun too - usually they'll role out some paper for them to draw on, and (at least historically) they can bring out some dough for them to play with.\n\nSo far the only dish I haven't approved of is the stuffed french toast from their brunch menu. Although it's delicious, I don't think 3 bread slices (halved) is worth $9.",
   "My husband and I have been to this restaurant several times and have always been pleased with the service and the food here.  But last night, as full and busy as they were. I felt they truly excelled themselves!   It was extremely busy, being not only a Saturday night, but the night preceding the big Superbowl game! We watched the waiters coming and going in a very efficient but friendly way, and the whole atmosphere was one of congeniality and expertise.  We were both amazed to witness how well everything was being managed in such a friendly and caring way. And it goes without saying really, the food was excellent. A night to remember! Bravo! to Bravo!",
   "Overall great food, the staff tries their best to be amazing but  sometimes when there's a ton and I mean a ton of people on a weekend let's say they're a little run thin. Last time there with the place packed, a few things I asked for never ever made it to the table. Even after 3-4 reminders. But if you catch this place not too busy, it's basically 5 stars. The food is really killer, I recommend the pork chop plate.",
   "This is some of the best Italian food I have had in a very long time. The flavor was over the top. Highly suggest it!"
  ]
 },
 {
  "name": "Veritas",
  "address": "11 W Gay St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/96d898e4-932f-11ea-8db8-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "unique",
   "tasting",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17152695329793746588",
  "source": "GoogleMaps",
  "reviews": [
   "Veritas is as the name states the truth of cuisine.  Each dish is masterfully crafted and every element tended to as if it was its own dish. \nWhen you go truly allow yourself to embrace the magic of the cuisine and taste every element of the dish.  To rush through a course is only cheating yourself of a blissful delight.\nThe staff is great and highly attentive. The level of service here is one not often seen these days as they embrace the passion of the experience with you and make each dish come to life.\nThe wine pairings are also well thought out and accent each dish to perfection. If you are not a wine person or do not drink at all, do not fret as they have a wide array of other options.\n\nTreat yourself and someone else to a devine experience by checking out Veritas.\n\nThe Whitaker Review",
   "Incredible cuisine. That’s the word for it. Bigger than just food. Looks and tastes great. Amazing wine list. Be sure to do a pairing while you visit.",
   "While the food/pairings were amazing, I felt that my meal was a little rushed,  especially since there were only 3 other tables in use when we got there. No sooner than we finished one course, then the next one was being served. They even tried to take my desert away before I was done. \n\nAgain - food was phenomenal.",
   "Veritas is the best restaurant in central ohio and it’s not even close. The attention to detail and unique combinations create a superb dining experience. Meal aside, bar and tender rival any of the hottest spots in NYC. There will be a changing of the guard at the bar in the fall, get there before he heads west. Cheers!",
   "The overall experience was enjoyable with the majority of the tasting items interesting and quite tasty although everything was served cold or room temperature. The steak was on the menu as fillet but was far from it. The texture and lack of tenderness was more like a sirloin. Wine was pricey with very small pours.  The timing of the dishes was off with a hurried feeling to eat and a lot of down time in between. Staff knowledge and attention were very good."
  ]
 },
 {
  "name": "Bonifacio",
  "address": "1577 King Ave, Columbus, OH 43212, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97174fcc-932f-11ea-a03e-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "music",
   "delicious",
   "food",
   "delicious",
   "food",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=17748677123040567941",
  "source": "GoogleMaps",
  "reviews": [
   "If you're craving for Filipino food or have never tried it, I highly recommend this place. At first I was doubtful because it was modern Filipino, but all the dishes still reminded me a little bit of home! With a modern twist. I was surprised, but enjoyed it immensely.",
   "We went there on a Thursday night which was a Boodle Night. The food was amazing. To be authentic, you have to eat with your hands but utensils are available, too. Some of the menu cocktails were on the sweeter end of the spectrum but overall they were good and the service was excellent and the bartender was really nice. \nThey do have a special menu in which it shows all GF and vegan/vegetarian options, there are quite a few picks, so I encourage vegan/vegetarians to go there as well. Personally I wish there were more of those options though. \nOn Friday nights, if I’m not wrong, they have Manila nights with a DJ and music after 10 pm until 1 am. \nHighly recommended, will go back.",
   "Delicious food. Intended for leisurely dining. Slow down and enjoy the conversations around you",
   "All the food was delicious. The service was excellent (minus one lil issue) and the experience was great. My only complaint was that I asked the server about the dish I was ordering, to get clarification on what it was and it was not as described at all how it actually was. FYI the mung beans is not like a green bean, which is the dish I'm referring to that I asked  the server about. Luckily, I had an open mind and it was still delicious but I wish he would have clarified what I was getting with the kitchen if he didn't know what it was either, he could have said I'm not sure lemme check. It tastes a lot like black eyed peas.",
   "I visit this great spot many times a year! This is my favorite place to to have a good dinner.  I visit this place routinely. The cooking is excellent, the team is courteous and the rates are affordable. I enjoy being in this restaurant for a nice dinner."
  ]
 },
 {
  "name": "The Eagle Short North Temporarily Closed",
  "address": "790 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/975e4408-932f-11ea-86c8-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14651234252412935086",
  "source": "GoogleMaps",
  "reviews": [
   "Legendary and award winning fried chicken? Not really sure about what. It’s a cool spot, really open dining room with a big bar, good local taps. But i came for the fried chicken. When I think of fried chicken I think of that super crispy crust, not what I got, yea it’s crisp and plenty of flavor. But where’s the texture! The price is pretty good for that location. The hot chicken takeover in the market is a better bet for fried chicken in the area in my opinion.",
   "Even though it was a busy Saturday night, we were still seated within 15 minutes. They offer family style seating here, so be prepared to sit in a booth with another party. With that being said, you will have more than enough room to yourself. They have a nice selection of beer and you can’t go wrong with fried chicken! The BLT was filling and tasty. The Mac n cheese is to die for! If you’re looking for a fun place to scratch your fried chicken itch, this is definitely a great option though the parking situation isn’t ideal but that’s to be expected in the short north!",
   "I devoured a Sumptuous and succulent chicken sandwich with a delectable side of spoon bread. Once finished I proceeded to wash the meal down with a thirst quenching stout. Please do yourself a favor and stop by for a meal, it’s worth its weight in gold.",
   "The Eagle is some of the best food in the Short North. High end southern food with a great beer selection. They have larger communal seating or seating at the large bar. The ambiance of the bar is very nice and the place is clean. My chicken was cooked perfectly and my mac n' cheese was outstanding.",
   "Awesome place with fantastic food! Delicious and the service is incredible. Couldn't be more happy."
  ]
 },
 {
  "name": "Cooper's Hawk Winery & Restaurant",
  "address": "4230 The Strand, Columbus, OH 43219, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97a49c1a-932f-11ea-94e5-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "delicious",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5350335836918925867",
  "source": "GoogleMaps",
  "reviews": [
   "So delicious went here to celebrate my best friend's birthday! I got the jambalaya and it was very very good! My best friend is member and she goes all the time she's had a few things that are good. I love love the sweet red wine its my favorite.  Before I tried this wine I hated wine but this wine is delicious! The service was great as well the people are so personal and friendly. Great place to eat, drink and have a nice time.",
   "Overall great experience. The food was delicious. Everyone talks about the brussel sprouts, and for good reason, it's very good. Highly recommended. Also the cheese plate is a great way to pair some food with a wine sampler. The entree's were very good. Your take away should be the service!  Sam was fun, and had great passion for all things food and wine.  He was informative and not pretentious. Cooper's Hawk does a nice job on capturing wine flavor profiles in easy to understand descriptions.  I will be back. If you're on the fence, get off it and go. So much fun!",
   "Service was impeccable. Food and wine was delicious. The only downside was the Nashville hot chicken was not very spicy - at all.",
   "We were in town for business and decided to have a nice evening.   We had made reservations a day in advance and after an exhausting day was looking to relax with friends and good conversation.   After about a 1/2 hour wait, which wasn't out of the ordinary, we were seated upstairs next to the check out register.   Due to an injury, I clearly have an issue with stairs, and never once did our hostess offer an elevator.  In fact, after climbing 20 steps, yeah for me!!!, I noticed the elevator in the back, and commented on that, and she replied \"oh we could have use that.\" My response: \"That information would have been helpful at the bottom of the stairs.\"  Onto order, our waiter Devan, who was clearly more concerned about his birthday party of 8 people that our table, left us in the dirt.  After finally, grabbing the arm of one of the other waiters, who subsequently received our gratuities, tirelessly waited our table and well as many of the others, while Devan, concentrated on \"his\" 8 people.  My meal was wonderful, however, my friends who ordered the surf and turf decided that the seafood had a extremely fishy taste,  unlike crab cakes and scallops.  Would I recommend this to friends, very unlikely. I was extremely embarrassed to have taken my friends here.",
   "This place was amazing. All their food os made fresh in house. The service was perfect. She was attentive and helpful. She answered all of our questions. The food was amazing, fresh, and flavorful. It is pricey, but well worth it."
  ]
 },
 {
  "name": "HangOverEasy",
  "address": "1646 Neil Ave, Columbus, OH 43201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/97e74a8c-932f-11ea-90a1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "creative",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16143867726663600530",
  "source": "GoogleMaps",
  "reviews": [
   "Great breakfast and really reasonable prices. Normally a long wait during Saturday football game days but worth every second. Staff is super friendly and quick on service. Food and drinks were top notch! Definitely recommend going if you have the chance",
   "We came here because we've heard good things and reviews. It was pretty busy this day and parking was a bit hard. We were seated at the bar, which was fine. We got one of the skillets and the Reuben sandwich.\nThe Reuben was pretty greasy and the bread was a bit soggy. The meat wasn't very flavorful and not filling. The sausage skillet was lacking a lot of flavor and seasoning. We were a bit disappointed in our food. I love breakfast foods because it usually is made good and isn't complicated, so I was surprised at how disappointed I was.\nI thought services was decent, but it seemed like everyone was busy and didn't care to stop and check the bar area.\nThere's a decent amount of space to sit, parking is usually garage or street, and there's no WiFi that we noticed.\nThe atmosphere and area is really nice and chill, so I did like the environment.",
   "Very cool little brunch place. Reasonably priced food and drinks. My order of corned beef hash was the perfect portion and it was impressively good. I always have low expectations for corned beef hash from a restaurant, and I think this was better than homemade. Very impressed!!!",
   "Food far better than many seemingly-similar places. Creative, well-prepared and just plain yummy. Highly recommend Chicken Chorizo Skillet and Whole Lotta Goodness. Also, breakfast should always come with the option for dessert, so I recommend checking out their seasonal pancakes. Always fun, always delicious.",
   "Even on a busy Saturday morning, my friends and I were able to be squeezed in.  While a bit loud and busy, we understood because of the usual breakfast and brunch rush to a popular campus spot.  Service was good, with food coming out relatively quick.  Everyone at our table had a great meal, with a good choice on the menu for most people.  I had the Pork Belly Benedict, which was cooked perfectly.  I would absolutely return, and recommend it to anyone and everyone looking for a fun breakfast spot near campus and the med center."
  ]
 },
 {
  "name": "Kooma sushi Restaurant",
  "address": "37 Vine St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/982983d4-932f-11ea-b0f0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15708645547113198323",
  "source": "GoogleMaps",
  "reviews": [
   "Got 4 different sushi rolls and I'm not able to take any home because it's all been eaten, very delicious and quick service.  Smaller setting and yet absolutely perfect to be a sushi bar would 100% come back! Note: had the 007, buckeye, san Fran, and misty rolls!",
   "My favorite sushi hidden gem! Limited hours which is great. Staff is awesome everytime I've been. I think Hadley was the name of my waitress and she is absolutely beautiful and very personable. She spent a large amount of time helping me try to find my favorite. The miso is a must have! I very rarely give a 5 star rating but this is well deserved. Can't wait until I'm back in the area for lunch...",
   "Kooma sushi is always consistent. The lunch box has a variety of some of the best dishes Kooma offers.  It is filling and a great value for the amount of food.  Substitute the California roll for any roll of your choice to spice things up (upcharge applies).",
   "One of the best sushi spots in town, and not terribly expensive. Can't wait to go back!",
   "I eat here quite a bit as it's near work. The lunchbox is a great portion but generally a few drawbacks... 1, the place smells bad. I know its sushi, but it's really bad all the time. 2, quite a few times my chicken teriyaki has been inedible rubber in the lunchbox. It happens enough that it's clearly something to do with how they're keeping it. Still a decent place for lunch.."
  ]
 },
 {
  "name": "Buca di Beppo Italian Restaurant",
  "address": "343 N Front St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/987b4dba-932f-11ea-9f25-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "family",
   "eat",
   "food",
   "family",
   "food",
   "delicious",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15920187802787284966",
  "source": "GoogleMaps",
  "reviews": [
   "This is the first time me and my wife have been. This place is amazing! Food was excellent and the staff were on point. I would definitely recommend this place to all my friends. Portions were huge and we had to get to go containers. Next time I will bring an extra person to help eat all the food. I will definitely be back! Thank you all for a wonderful experience!",
   "This place is a amazing place to eat and have an all around great time. The servers are nice and treat you as if you were family. They all work together to make sure everyone is happy. The food is timed so you don't get everything all at once. Speaking of the food, it is DELIGHTFUL! Perfectly cooked pasta with just the right amount of seasoning. You gotta remember the portions are huge so order carefully or clear out some room in the fridge for leftovers!",
   "(Bad)No soup ,(fad)Best fettuccine ever , (overpriced) ,$20  small bowl mac n cheese bites.we wanted reg. mac n cheese not bites. The birthday dessert was  (Spectacular) the brownie sundaes. the good the bad and the  ugly. Will go back for fettuccine  for sure. Hope it is the same. What Italian restaurant does not have wedding soup. Or any soup all the time.",
   "Hot food was cold upon arrival. Salad was wilted and warm with lettuce hearts in the mix. One dressing for a family salad. Chicken Parm was soggy. Garlic bread was underdone. And one of the cake slices was missing. I would love a refund or an attemp for them to make this right.",
   "Definitely worth it! Tonight was our first time dinning there.  We felt like family. We had an amazing server (Dottie) The food was over the top delicious! We recommend everyone give it a try.  You won't be disappointed!"
  ]
 },
 {
  "name": "Service Bar",
  "address": "1230 Courtland Ave, Columbus, OH 43201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/98d2bcac-932f-11ea-9cce-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "delicious",
   "food",
   "food",
   "tour",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12843422473957305452",
  "source": "GoogleMaps",
  "reviews": [
   "Our party of four arrived around 7pm on a Friday night and was seated immediately because we made reservations.  The restaurant was at about 90% capacity at that time.  The ambiance was a modern 1920’s vibe, there was a lot of attention to these details in their clean restrooms (especially soap dispenser).  The spirits were plentiful and the bar was sprawling.  I came here for the culinary infusion foods and the presentation of it.  We ordered the smaller plates as starters, it was the pork grinds and the mussels; which were both delicious, they had a great technique to create pork grinds as well as they did.  About 25 minutes later, our main course arrived.  We ordered the whole chicken, which came out to our surprise half roasted chicken and topped with the other half with fried chicken, and then topped with naan bread.  Reading from the menu, I visualized a whole roasted-red tandoori chicken.  The fried chicken was fresh and had a good light batter coating it, but was overly salted.  We finished the meal with the cheesecake which wasn’t overly sweet and a good way to finish.  Overall, we spent about $325 for the course and experience.  I’ve come to realize my love and appreciation for simple street food.",
   "Fabulous from start to finish. Dumplings in their sauce were delicious, the duck was the best I've ever had, and the desserts were amazing. Decadent, rich, so tasty. Love that they have a whole vegetarian menu. The Ross (a kind of Reuben style sandwich) was also very very yummy. Would go back anytime. Decor is classy, beautiful natural light.",
   "The cocktails here are insanely delicious! And the food always takes us by surprise. Can't recommend Service Bar enough.",
   "Drinks are super tasty!   Mocktails are dope too.  The food tho!  Try the brisket tacos and Szechuan dumplings 🥟.",
   "The food and service was great.  We had dinner after taking the distillery tour (and buying a lot of spirits!). \n\nTwo stars for two reasons:  the host told me twice that they were booked until 9pm and couldn't seat us (I then used OpenTable to book a reservation for 15 minutes later).  And, my dinner consisted solely of 7 small (rabbit filled) tortellini for $25..   I left still \nhungry!  My fault for not ordering something else."
  ]
 },
 {
  "name": "Dempsey's Food & Spirits",
  "address": "346 S High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9933ce08-932f-11ea-b24a-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3119616770980171207",
  "source": "GoogleMaps",
  "reviews": [
   "I was craving pub food and wanted somewhere I'd not been before. Google suggested Dempsey's and I was so happy I tried it. It was delocious and perfect.",
   "This hidden gem has tons of charm. The bar itself has a story and just creates a fun atmosphere. The walls are lined with Columbus nostalgic photos. The menu was filled with a great variety of Irish classics and local favorites. The service was wonderful too! Parking was a challenge but worth it!",
   "The comfortable little gem is tucked away in the downtown area of Columbus, right around the corner from the Southern Theater. It's beautiful inside and not what you expect looking outside in. \n\nThe service was ok. It was a very busy night when I went in and only two tables were open. The staff seemed to be overwhelmed with the response of the game that was playing. They looked checked out and ready to go. The waitress didn't really check in on us and brought us our bill without us asking or her asking if we needed anything else. \n\nThe food was great. The buffalo chicken wrap tasted great. The crab cakes we're delicious. Their menu is quite large so I am excited to try this place again even if it's delivery or carry out.",
   "Had breakfast Today before doing my civic duty as a juror and ate an excellent  breakfast. The cubed potatoes with rosemary alongside the crispy bacon and fluffy scrambled eggs made start of the morning appealing. Thank you so much.",
   "Popular local. Genuine Irish hospitality in downtown Columbus. The bar and surrounds are some of the oldest parts of the city. The food and drink is wonderful. Enjoy."
  ]
 },
 {
  "name": "Bangkok Grocery & Restaurant",
  "address": "3277 Refugee Rd, Columbus, OH 43232, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9976161e-932f-11ea-a61e-14b31f159f22.png",
  "tags": [
   "food",
   "cheap",
   "food",
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=1202390816535374269",
  "source": "GoogleMaps",
  "reviews": [
   "They don’t have fountain drinks in this place but they have true Thai food. Spring rolls are always the best. Good Pad See Eww. \nMany spices come to the table so you can adjust the heat as hot as you like.\nIt’s very quiet and dim. Service is fast! So this makes a great lunch spot.",
   "This is a great hidden gem. The best Thai food I've had in Columbus and the prices are cheap! You get so much bang for your buck. It's a small restaurant, very casual. There are lots of pictures on the menu which make it easy to try something new. The servers are very nice. There are two entrances because there's a grocery store one one side. Make sure you go to the right door.",
   "I always enjoy going to Bangkok. Bic is so sweet and wonderful. I love that lady. Her sweetness makes the food all that much better! So handy that the grocery store is connected to the restaurant",
   "The facilities and location are a little run down, but the staff and food are great.  Best authentic Thai food in central Ohio. Having the grocery store next door is a plus.  The Som Tam is just like Bangkok! Highly recommended!",
   "Some of the best Thai in Columbus and a great grocery store for those looking to cook with authentic ingredients from the region. Every dish I have had is great and the prices / portions are very appropriate. I would not hesitate to bring friends along on a trip to eat here!"
  ]
 },
 {
  "name": "Smoked On High BBQ",
  "address": "755 S High St, Columbus, OH 43206, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/99bc2026-932f-11ea-92fb-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5315430177283993584",
  "source": "GoogleMaps",
  "reviews": [
   "This place has amazing food!  My husband got our Easter dinner from here and I wasn’t disappointed one bit.  We had the drum sticks, mac n cheese, coleslaw, and cornbread.  All of it is amazing.  Can’t wait to try the rest of the menu.  Keep up the good work.",
   "I try to reserve 5 stars for very special occasions.  So not to say this doesn't necessarily warrant 5 stars, like most other reviews have given it, just putting my review into context.  When it comes to BBQ in the greater Columbus area, in my opinion it's between this place and Ray Ray's Hog Pit.  The venue is a converted Victorian style (?) home so seating in the colder months can be very limited.  During the warmer months seating outside adds to the capacity.  I would suggest for the first visit to get the sampler platter (pictured) which has a little of everything.  This is plenty of food and will allow you to taste it all and maybe decide your favorite(s) for future orders.  If you're in the area, definitely a place you should visit.  Make sure you try the \"Max N' Cheese\" if you're seeking a spiritual experience.",
   "Top notch BBQ. The Brisket was top notch not certain if I have ever had better. Great smoke and tenderness. Flavor out of this world. The greens were also incredible you are doing yourself a disservice if you don’t try them. The Pork was also great easily on par with anything I’ve had in North Carolina aka the home of Pulled Pork. Don’t sleep on the smoke drumsticks either. Overall everything thing I had there was great if you are in Columbus and like BBQ and haven’t ate there then go right now. 10/10",
   "Great BBQ for an awesome price. We didn't know what to order so Anna and Alex helped us out with some options to get a meal for 2 of us situated. They were very friendly and helpful. We got 2 meals and a meat only option and there was more food than 2 of us could finish. Everything was fantastic and the sides were great. We ordered the brisket, pork, and sausage for the meats and had cornbread, coleslaw, and Max n cheese for the side. Great flavor for everything and the Victorian house converted restaurant was really cool. They also have outdoor seating if you want. Would highly recommend and would definitely return again.",
   "My husband and I had the ribs from this place twice now.  The ribs are great! They are by far the best ribs in Columbus.  Very meaty with a great smoked taste.  Highly recommended!\nWe did takeout both times, so can't really comment on inside service. When we arrived both times the ribs were waiting on us for takeout - no wait time!"
  ]
 },
 {
  "name": "Buckeye Chili & Smokehouse",
  "address": "30 S Young St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a077a1c-932f-11ea-9941-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=16064541938365293026",
  "source": "GoogleMaps",
  "reviews": [
   "As someone who works about 100 yards from this place, I am very disappointed that I found it because I will be spending all my money on lunch here! I decided to give it a try as it's a new restaurant and I do love BBQ and I was not disappointed. The people working there were all very friendly, and my order was up in a timely manner. I ordered just the pulled pork and cornbread with a side of Mac & Cheese. The food was fantastic. The pulled pork was one of the best pulled pork I've ever had, and I've eaten quite a bit. The mac & cheese was delicious as well, very creamy and not grainy like it can be sometime. Even the cornbread was warm and moist. If I had one complaint it would be that I wanted more! Will be back to try the wings and the brisket real soon! Do yourself a favor and go here, it's a nice change from the multitude of sandwich shops downtown.",
   "Diamond in the rough.\nThis new restaurant/ bar sits tucked away in off broad Street. You won't want to pass this up. They have a full bar for cocktails, wine and beer. The food ,I had today was really good. I had the chili spaghetti. I ate whole dish. It comes with garlic toast which is a great bonus. The flavor profile of the chili was very good and well thought out. It had just enough kick to it to compliment the spaghetti which was topped with cheese. They told me you can get the chili spicy if I wanted but this was perfect. Stop by to beat the rush hour traffic and have some great food ..",
   "Food was amazing. Great staff. And what a wonderful change of pace from \"downtown\" dinning.  Definitely one of my new favorites.",
   "This is Real Stick to your Ribs, gonna need to unbutton your pants. Someone one Stop me! It's so Good, BBQ!!\nReally cool older building with unique features! Gotta say the view of downtown Columbus is really on display through out the dining area!\nCan't wait to go back before everyone else discovers this hidden gem!",
   "Excellent service and excellent meal. I had a cup of regular chili to start and the brisket/cornbread for my lunch meal. Everything was wonderful. I know where I'll be going for barbecue when I'm downtown! I can't recommend this place enough!"
  ]
 },
 {
  "name": "Condado Tacos",
  "address": "132 S High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9a670c34-932f-11ea-9012-14b31f159f22.png",
  "tags": [
   "drink",
   "eat",
   "food",
   "delicious",
   "library",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13706935932012776357",
  "source": "GoogleMaps",
  "reviews": [
   "I have to say that these are the best tacos in Columbus Ohio. They have half off margaritas during happy hours. And an option to make your own tacos or to choose from a predetermined list. The place has a hip artwork around. Our waiters were also helpful and cheery. Would recommend. An absolute 5 star experience.",
   "Great inexpensive option to eat. The decor is fun, and the staff are welcoming and friendly. The food is good, with plenty of options for customizing your tacos. Happy hour is 4 to 7 and tacos are 1 dollar off. Margaritas were half off. Good quality drink.",
   "I can't say enough good things about this place! A real gem downtown offering fantastic tacos of which the build your own option is very well done. Their menu is labeled appropriately for dietary needs, and who can go wrong with flights of margaritas!? All that and I haven't even mentioned the great atmosphere. I really enjoyed the outdoor patio area!",
   "I ate at Condado Tacos Commons earlier this year [6-26-2019] while on my way to a discussion meeting at the Main Branch of the Columbus Metropolitan Library.\n\nThe main product of Condado Tacos, as one might imagine from their name, is tacos. There are many choices and combinations of ingredients. Customers place their orders by filling in circles on pieces of paper that resemble absentee ballots. Up to two different flavors of tacos [of any quantity] may be ordered on the same piece of paper.\n\nI had previously eaten at a different Condado Tacos [2977 N. High St.] so I had already learned how to order tacos at Condado Tacos. My carefully-ordered tacos arrived quickly, had been made to order, and had been absolutely delicious.",
   "Wow. Pleasant surprise. Place was totally packed but we had good quick service and was seated quickly. The food was delicious, probably our favorite of all similar chains. Will be returning!"
  ]
 },
 {
  "name": "Black Point",
  "address": "570 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9aba8d9a-932f-11ea-8ee1-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "family",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14790142262743344241",
  "source": "GoogleMaps",
  "reviews": [
   "I loved it! Very classy but also encompasses a trendy, inviting neighborhood (Short North) vibe. Delicious steak & seafood offering but plenty for the vegan to enjoy as well. I visited as a group but it could be romantic also. Thank U for an entirely enjoyable evening b4 the game!",
   "Let’s start with the filet mignon it was absolutely insanely delicious. Cooked to perfection. The sides are top notch as well. Friends we went with tried lobster for the first time and they loved it. The service was exceptional. To top it off the salted Carmel cheesecake was out of this world.",
   "Great evening at Black Point celebrating my birthday! Awesome service, fabulous food, loved the lobster crab cake and my bison steak! Family style sides and the flourless chocolate torte as delicious as well! We will be back and it is one of my new favorite restaurants.",
   "The food was great, the service not so much. I went on a Wednesday, we were seated at the other dining room on the right  which only had 3 tables including mine(and a group of loud people in the party room behind me ). Out of the first 3 cocktails we ordered from their main cocktail menu , 2 of them they were out of the ingredients to make, which shouldn't happen if you put those drinks on the front page. I finished my drink before the entree came but was never asked if I wanted a second one. Our desserts came without forks or spoons and we had to flag someone down to get us forks....\nSteak and dessert were awesome though.",
   "Omg great time awesome experience, our server was great and fun!!! We went during restaurant week it was still a great time"
  ]
 },
 {
  "name": "J. Alexander's - Redlands Grill",
  "address": "7550 Vantage Dr, Columbus, OH 43235, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b01b102-932f-11ea-8ca5-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4081268659685342839",
  "source": "GoogleMaps",
  "reviews": [
   "Had the rotisserie chicken. It was amazing, tender and flavorful! The smashed potatoes, salad and croissants we delightful too! Service is always great, fast and friendly. The servers are knowledgeable and fun. Top plates for me: Rotisserie Chicken, Rattlesnake Pasta, Steak Maui. My wife adores the chocolate cake with ice cream!",
   "Our waitress wasn’t the best this time around but overall still a great experience. Food is always good and the atmosphere is relaxed and quiet. The Mac and cheese is really good give it a shot.",
   "The smell of wood fired steaks hits you as soon as you open the front doors! Great steaks and sides with a friendly staff that’s helpful and fast. Lunch menu is slightly different with smaller meal options for a little less money.",
   "Went there two nights in a row for their prime rib which is excellent. The BEST! Eva recommend the crab cakes...best I ever had including on the East Coast. \"Trust me\", she said. Wait staff are great, making us roadies feel at home for the past 8 weeks. What's more, they carry my scotch, not available in most restaurants.  We three go here at least twice per week. Disturbing news that the Governor has closed all restaurants and bars in Ohio today.",
   "Excellent food, steak grilled to a perfect medium rare.  Rachel gave the best service we've ever had.  And we've had some very good service.  If I could rate this higher, I would."
  ]
 },
 {
  "name": "Yats Grandview",
  "address": "1386 Grandview Ave, Columbus, OH 43212, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b48572e-932f-11ea-936d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10795378601721774817",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful Cajun style food with right amount of Spices enough to fill your Taste buds. NOLA themed Restaurant will sure remind you of that NOLA style food, if u had tasted it earlier anywhere. You can ask for multiple samples before you can make your orders as everything comes on a Bed of Rice and Cajun spices dripped French Bread. Plenty of Parking space in the Lot opposite to it.",
   "Great food, good portions and reasonably priced! Appreciate that carry-out is still open, love to support local! \n\nYoung lady at the front counter was EXTREMELY rude, but given working through pandemic you never know what you’re going to get.",
   "Great food, very quick service. The highlight is that the food is quite homely, and doesn't taste like it's made by some fast food joint. The variety of sauces and seasoning options are also great. The option to mix and match dishes and main course is also worth trying. Recommended for lunch and dinner.",
   "My new favorite place in Columbus.  The food is amazing! Start with the drunken chicken and work your way down the menu.  The Cajun flavors are incredible.  Just go ahead and ask for an extra helping of bread, yes it’s that good.  I always get a couple extra to share with coworkers.",
   "Never had creole food before until I had Yats. Not only is it full of flavor, but a full plate. The will drench a bed of rice in any entree you order. The chorizo and drunken chicken are my favorite! I wish I could remember the name of the little desserts because those were the best! And that's just the food. The customer service is great and all the staff are the sweetest people. I can't wait to order from them again"
  ]
 },
 {
  "name": "Jeff Ruby's Steakhouse, Columbus",
  "address": "89 E Nationwide Blvd, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9b96293a-932f-11ea-bce8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7746725884644831578",
  "source": "GoogleMaps",
  "reviews": [
   "Oh, my... What a wonderful dining experience! Our table was ready when we arrived. The service was attentive without being pushy. The food was perfect. I had the NY strip, medium rare. My date had the baked lobster tail. We shared sides if crispy French fries and green beans with garlic. A bottle of Super Tuscan wine accompanied everything. \n\nWhile we dined under crystal chandeliers, a flash flood filled the streets, turning them into an impassible lake. After our meal, we toured the rest of the restaurant and were allowed to leave through a back door into an alley that was in higher, drier ground. \n\nWhat a night!",
   "Awesome place! Beautiful restaurant, waitress were very helpful and very friendly. Everything was really good, my son and daughter n law took me out for my birthday and I loved it. Very special! Thanks Aaron and Nora! Had a great time!",
   "Absolutely amazing. The food was impeccable and the staff was incredibly engaging and courteous. The atmosphere was different in a great way. My wife and I had an unforgettable 5 year anniversary. Make sure your wallet is ready as this is a top tier steak house but it is worth every penny.",
   "Best place I have ever been. The staff was extremely personable a d easy to talk to. The chef came out to ask how was my salmon (it was the best salmon I have ever had *single tear falls from eye*). He sat with us for a while and we talked about his ink and how he loves cooking (his name was Tom). Awesome evening.",
   "This place never fails to impress. Beautiful decor, amazing ambience, and excellent customer service. Perfect for a date. The food is delicious! Not ready to drop $50+ on just a slab of meat? Jeff Ruby's offer specials throughout the year!"
  ]
 },
 {
  "name": "Northstar Cafe in the Short North",
  "address": "951 N High St, Columbus, OH 43201, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9bdd6b9a-932f-11ea-8f4a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17164533405380536793",
  "source": "GoogleMaps",
  "reviews": [
   "We stopped in for breakfast. There is a patio, but we sat inside. You go up and order at the counter, but they bring you your meal. The coffee was very good. I had fresh squeezed orange juice, WOW!! My wife had a blueberry smoothie, WOW again!! Our food was amazing, eggs were perfect and the sausage was delicious. Adding to this delightful meal was the biscuits, soft and fluffy and the jelly that came with them was the best I've ever tasted. I would recommend this restaurant to anyone, and I really hope to stop again soon!!",
   "I love coming to Northstar! All the staff here are friendly and make me feel happy whenever I step in there - the vibe is contagious! It's a bright, airy space and is a mix between quick-service and table service. The food is executed consistently and they are very accomodating if you need modifications (and will suggest the right mods to fit your needs). I love that I can get local beers here, as well. Come here by yourself or with friends to enjoy their patio in the spring/summer as well.",
   "The store is very clean and the staff is incredibly friendly. All of the food is organic and local(when available), they have multiple vegetarian and vegan options. Northstar Burger is my favorite veggie burger around. A little pricey, but I'm always willing to pay a little more for a local company that provides clean food. Will definitely be back.",
   "Fresh varieties of local goodies! Vegan and vegetarian options are plentiful. The local cafe can be very busy, with good reason. Even when there is a line out the door, it's worth the wait!",
   "Everything is always so phenomenal! April was amazing in every aspect! This is now my favorite location 💜"
  ]
 },
 {
  "name": "Due Amici",
  "address": "67 E Gay St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c2682d0-932f-11ea-99e4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17674416860598166576",
  "source": "GoogleMaps",
  "reviews": [
   "My wife and I had our rehearsal dinner here the night before our wedding in March of 2020 and LOVED it. The staff were beyond amazing, the space was terrific (we had the private room on the side), the food was delicious, and planning was easy and simple. Our rehearsal dinner was 40 people and everyone fit perfectly. \n\nSpecial shout out to Lexie and MaryCatherine for their help!",
   "Great place for a romantic date! Went for Valentine's day and the atmosphere was romantic. Rose petals on the floor and table was a nice touch. Food was delicious and flavorful!",
   "Trendy Italian restaurant and bar in downtown Columbus. Cool decor. The bathrooms seem like they're in a basement dungeon but the entrance decors are still cool.",
   "Awesome service, cocktails, and food.  Nice mix of trandy/new and traditional dishes on the menu.  Highly recommend trying a pasta dish.  Wasn't busy on a Wed night.  Walked right in...",
   "Great atmosphere and ambiance.  Food was great at a reasonable price.  First time there on Valentine's Day and plan to go back again!"
  ]
 },
 {
  "name": "Tony's",
  "address": "16 W Beck St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9c7629b8-932f-11ea-984c-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18166858402850286717",
  "source": "GoogleMaps",
  "reviews": [
   "A wonderful restaurant! This was my second time and everything is delicious and the service is wonderful! Kyle was out server and he's great! I recommend the Roman bread for an appetizer especially if you like blue cheese. The \nVeal Saltimbocca is mouth watering good. Tony's Own fettuccine put me outside my comfort zone. It's a seafood pasta with a cream sauce. That to was very good and I would have both again. My friends all had different items. They all taste good. I posted a picture of my first cosmopolitan. Go to Tony's and enjoy some real Italian food!",
   "This place was amazing! The wedding soup tasted just like my grandma's from Italy. Everything was delicious,  we will be back and probably frequently.",
   "Love Tony’s ! Never had a bad meal there. The chicken liver appetizer is the best ever! Highly recommend it!",
   "Met Tony tonight. Super nice. I had a great time. The food and atmosphere was awesome. Great to patronize a locally owned establishment like Tony's.",
   "We was so disappointed after reading the reviews. We had the meatballs and spaghetti and meatloaf. The meatballs and meatloaf taste the same very mushy and had absolutely no flavor. The marinara sauce on the meatballs did not have the nice tomato flavor that you would expect from a true Italian restaurant. The spaghetti sauce was just as Bland."
  ]
 },
 {
  "name": "Strongwater Food and Spirits",
  "address": "401 W Town St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9cba38ca-932f-11ea-af7f-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "unique",
   "walk",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=318411770673321694",
  "source": "GoogleMaps",
  "reviews": [
   "We showed up for happy hour. The ambience was good and staff were okay. The food was really good. We got the Tennessee chicken which was very spicy in a great way! We also got the mushroom risotto which was really rich and good. Highly recommend. The dessert was very underwhelming though. It was essentially chocolate in a cup that felt more like chocolate pudding. Still recommend this place and will go back.",
   "Strongwater is one of the few sit down restaurants in the area but it's one of the best visually. Beautifully decorated with the well maintained vintage factory character. The lighting is great in dark evenings for a nice romantic date night or even just a chill place for drinks with some friends.\n\nSpeak of drinks- craft cocktails here are amazing. Over the years of coming here, their cocktails hold a high standards, with premium ingredients and well blended. My most recent visit, they unfortunately were out of a few ingredients and couldn't make what my friend ordered. She chose something else and enjoyed it. Excellent quality overall.\n\nAlthough I have had their food a couple of times, I cannot recollect my experience eating here entirely. The menu is a bit eclectic and I remember the food being of great quality. However, it's not a menu that pulls me in. \n\nThe staff has always been great.\n\nRegardless of my taste of the menu, I often recommend Strongwater and people generally enjoy it. If not anything other than a cocktail.",
   "Service was excellent, Erika took incredible care of us as well as suggested some unique dishes with their watermelon gazpacho! \nSeriously some of the best french fries I have ever tasted and the breakfast sandwich totally hit the spot!",
   "I recently [10-24-2019] attended the 2019 \"Gift To Be Simple\" fundraiser for the Simply Living community organization at Strongwater Food and Spirits.\n\nPreviously [1-27-2016 and 2-2-2017], I had attended two \"Allies for Equality\" receptions, sponsored by Equality Ohio, at that same location [though not necessarily in the same room].\n\nStrongwater Food and Spirits is a great space and definitely has plenty of room.\n\nI had been somewhat confused when first arriving for my most recent event at Strongwater Food and Spirits because I had arrived at what I had assumed to be the \"main entrance\" for my event [based on the \"401 W. Town St.\" address that I had been given].\n\nMy event had actually been in the Strongwater Event Space rather than Strongwater Food and Spirits so I was directed to walk through several intervening areas to reach the actual location of the event, the Strongwater Event Space [on the west side of the building that faces Lucas St.].\n\nI now know that there is also an entrance to the Strongwater Event Space that is directly off of Lucas St.",
   "Strongwater has the BEST fries hands down. All the servers are really friendly. I had a black bean burger and got the appetizer that's like a fried risotto (can't remember the name) so delicious. Great drinks too! It's a little expensive but the food  and service is awesome"
  ]
 },
 {
  "name": "Happy Greek Restaurant and Pub",
  "address": "660 N High St, Columbus, OH 43215, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d01ef62-932f-11ea-b4f5-14b31f159f22.png",
  "tags": [
   "comforting",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2994688065249242306",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely love this place. It was my first time and my s/o insisted on the flaming cheese. Even though we were about to go into a lock down, the energy was calm and comforting. Service was friendly and the food was amazing. We will become regulars via takeout for now but I cannot wait for all of this to be over so i can go in again!",
   "Dinner was delicious and genuinely Greek. Vegetarian dolmadas - vine leaves stuffed with spicy rice in a lemon garlic sauce plus a salad, left enough room for dessert.\nNot a wheelchair accessible venue at all. Stairs to enter and very narrow. They do however do take away.",
   "Got take out yesterday.  The fried smelts were awesome and the dolmades with meat very satisfying.  Will definitely go back for the full experience once restaurants are allowed to seat customers again!",
   "Great Greek food and nice atmosphere. It’s a happy place to dine!",
   "I’ve been here multiple times now. For some reason every time I’ve gone it’s always almost empty. I never understood why I think their food is amazing and the staff is always really great. If you like Greek food I highly recommend checking Happy Greek out. Greek  lasagna is fireeee! Enjoy!"
  ]
 },
 {
  "name": "BJ's Restaurant & Brewhouse",
  "address": "4020 Stelzer Rd, Columbus, OH 43219, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d4931c0-932f-11ea-893c-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4044780566345442838",
  "source": "GoogleMaps",
  "reviews": [
   "This place is a favorite among my entire family, and throughout multiple relationships of mine! Food is amazing, fair prices for the portion sizes, and the dessert is superior to anything I’ve ever had. The service is always great and friendly, I’ve never had a rude waiter here. The rare times things have gone wrong, the server always fixed it right away and management never has to get involved. In my opinion this is the best restaurant in Columbus. Best of all, it is family friendly while also having a great selection of beers and bar food. The menu is the perfect size, with an option for everyone. Large parties are accommodated well, and they are good at keeping wait times minimal.",
   "The worst dining experience I've ever encountered. Nearly all the food is processed, very low quality, and price hiked. One of the meals wasn't even properly cooked. It's astonishing this place is still in business. The bartenders and a handful of staff were hard-working, but the majority of the workers seemed disengaged. I've seen Fast Food places run more smooth, and taste way better too. The CEO should be ashamed serving TV dinner quality food at restaurant prices. If you work here I'd recommend looking to work at a higher class establishment. You guys honestly can't be proud serving that menu or eating that food. Dissatisfied doesn't even begin to describe the entire experience of this place and their Facebook reviews are some of the worst I've seen. Across the whole country. Have some decency and serve your fellow citizens healthy and clean food. Shame on you.",
   "I placed a takeout order of Enlightened Seared Ahi Salad (see attached picture) today for dinner. Once I got home, I opened my bag and didn't see any sauce for my salad. Moreover, they didn't even give me any fork to eat it with. I live half an hour away from the restaurant so there is no way for me to waste more time and gas just to go back there again and ask for my sauce that was supposed to come with my salad. I'm a regular customer here and I've noticed that the staff at this takeout station are awful. They are NOT nice and helpful at all. They are so slow in ringing up customers out. They never put silverware in all my takeout orders. I always have to speak up and ask them to put silverware and napkins in my bag. I think they expect customers to eat with bare hands or something. Ugh! 😡",
   "Amazing experience and clean restaurant! Food was fantastic. I had the Chicken And Back Piadina and it was the bomb! I'm so excited to go back once the governor allows us to!",
   "We placed an order for carry out and the chicken Garcia with black beans was a disappointment in presentation and taste. April 16, 2020. The boneless chicken breast was the size of a half dollar and it was so dry. It looks more like a rubber chewy toy for a pet.  I am trying to support this restaurant but it is becoming increasingly difficult."
  ]
 }
]