[
 {
  "name": "Oak Hill Hiking Trails",
  "address": "292-342 Shaker Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9d911038-932f-11ea-8fdf-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "hike",
   "hike",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=1981383098853402363",
  "source": "GoogleMaps",
  "reviews": [
   "Great trail system with distance and different viewpoints. Lots of area to explore and not a hard walk which makes it easy to go the distance. There are a lot of cutoffs, some circles, and even a few places to sit down. The fire tower is nice and tall which allows for great panoramic views/photos. During the warmer months it would be a great biking trail.",
   "The last time I was here was when I was working on my fire tower quest in 2016. There have been a lot of improvements made since then. Especially with updated signage. If you do all the loops off of Tower Trail, you can get a pretty good workout and enjoy nature at the same time. The fire tower itself is in Loudon, and I didn't go to the fire tower this time. That wasn't my goal. I was just exploring the other trails.",
   "Nice hike this morning at Oak Hill! \nThe fire tower is currently under construction so you can't go up to check out the views at this time. There's a lot of black flies at the top where the tower is. \nI recommend a natural non toxic bug spray made with essential oils and always check for ticks. \nHappy Hiking!",
   "Great little hike right in Concord, take advantage of what's around you",
   "Nice place to walk the dog and get lost in the woods. The trails are Marked really well. Only 0.75 mi to the Scenic views w/benches!"
  ]
 },
 {
  "name": "McAuliffe-Shepard Discovery Center",
  "address": "2 Institute Dr, Concord, NH 03301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9de4f4b8-932f-11ea-a18b-14b31f159f22.png",
  "tags": [
   "free",
   "library",
   "family",
   "learn",
   "history",
   "free",
   "kids",
   "kids",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15604511544297655166",
  "source": "GoogleMaps",
  "reviews": [
   "We were pleasantly surprised! A good selection of exhibits and hands on activities. Very informational and educational. We enjoyed the planetarium and the movie on the northern lights. We spent about 2.5 hours at the museum. My son is twelve and didn’t complain once about being bored. There is a small cafeteria and gift shop. \nWe had free passes from our local library, but paid $5.00 each for the planetarium show. It was a great experience.",
   "I had a great time here. It was not expensive, the exhibits were really cool, and the planetarium was great to! Spent a out 3 hours here which was plenty of time to see everything including the Planetarium.",
   "Brought my son and older daughter and they both had a blast.  My son doesn't really do well with crowds and the museum wasn't really crowded the day we went.",
   "So cool for all family members! \nA lot of things to learn, to explore, to do, is free, parking lot available, cleaning spaces, bathrooms, cafe, souvenir store, for sure is a place to bring your kids and teach them about NASA and Concord  NH History.",
   "I went here just to look for a squished penny machine. And I ended up staying and I liked it so much that I got a membership. I like that it has a lot of hands-on things for kids to do, even though I don't have any kids. It's good to keep kids busy in a place like a museum. And it's the kind of museum that's not like a regular museum, because you can touch things. They also have a planetarium. I will say the planetarium program is very old, and they do tell you that in the beginning. So it has some glitches, but still it was awesome to just stare at the stars for a while. The best part of the presentation I saw, which was the night sky presentation, was when they flew you to the Pleiades, because it felt like being in a starship. Besides all the history that they have regarding our space history, starting with the space race with Russia, it is named after Christa McAuliffe and Alan Shepard because they both came from New Hampshire. There is an observatory but they only open it the first Friday of the month, and only if the sky is clear. It is advisable to call ahead if you're going for one of these Friday night observatory events. I had lunch in the small restaurant that they have there, and I had chicken quesadillas that were absolutely amazing. All of the staff that I interacted with while I was there were very friendly, helpful and courteous, and that's important to me."
  ]
 },
 {
  "name": "NH Audubon",
  "address": "84 Silk Farm Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e263c52-932f-11ea-90fd-14b31f159f22.png",
  "tags": [
   "walking",
   "kids",
   "learn",
   "knowledgeable",
   "eat",
   "active",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16818148815445589233",
  "source": "GoogleMaps",
  "reviews": [
   "Great venue to experience the NH out of doors at. Nice walking trails and beautiful scenery. Plenty of events scheduled throughout the year. Closed on Sundays but the trails are always open. The trails have markers and easy to follow. Plenty of rest and informational stops. HUGE &TALL trees everywhere. Watch for woodpeckers and deer. All kings of flora & fauna to see.",
   "Always enjoy coming here. Several trails of varying lengths and degrees of difficulty. Orchard trail is ea the yellow tail should probably besy, 20 to 30 mins out and back or you can join up with the yellow tail and loop. Great for bird watching and you end up at the pond. Yellow trail is harder and loops onto the other trails. Pictures are from blue trail. Blue can be done with kids over 3(if they like to home) but yellow should be 6 or over. A few wet spots and some rocky spots.",
   "What a great place to bring children to learn about NH'S wildlife, especially birds. We enjoyed a wonderful talk on Arctic foxes, my granddaughter's favorite animal. She was thrilled to see one in person and learn about them and their cousins, the gray and red fox. We enjoyed the reptile room (which also had a lot of taxidermy)and also went up to the Aerie to enjoy the view. Their gift shop is wonderful and had a good assortment of small items that made a great souvenir. We'll be back in warmer weather to enjoy the trails!",
   "What an awesome place and organization.  The people there are friendly and very knowledgeable about birds and other wildlife.  Especially enjoyed watching the owls and eagle eat.  First time I ever heard an eagle make a sound.  The barred owls were rather vocal, too.",
   "Tbe NH Audobon McLane Center is great. The kids love it every time we go. This time there was a kids summer camp in session. It looked fun.\nThe birds and turtles were very active, hamming it up.\nThe trails are really well maintained. We walked 2 of them. The kids jumped and played on all the rocks and logs they could find. The bugs were relentless, so bring some bug spray. The trails go along the marsh and pond."
  ]
 },
 {
  "name": "Winant Park",
  "address": "53, 11 Fisk Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9e66eeec-932f-11ea-a087-14b31f159f22.png",
  "tags": [
   "hike",
   "hike",
   "hike",
   "hike",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=17669152938807671890",
  "source": "GoogleMaps",
  "reviews": [
   "I needed a little more movement after a day of skiing in NH and this little gem of a 3.2 mile hike from Winant Park to Marjory Swope Park and back was the perfect apres ski activity. It was a little mushy (I wore the absolutely wrong footwear🙄), but the setting sun,and brown leaf carpet was a tannic and still wonderland.",
   "May be better in the spring and summer but not too many sights or anything to write home about. Decent enough for a winter hike with the dogs though.",
   "I didn't actually hike the trails at Winant park today. I discovered a trail that went to Swope Park and it was 1.6 miles each way. So I hiked that because I was curious. It was very well maintained! Unless somebody is completely color blind to red, it would be almost impossible to get lost on that trail. Also at the junctions they had very good signage. I would rate the trail as moderate for someone with my kind of disabilities. I wouldn't try to take a wheelchair on that trail. But there was handicapped parking at the Winant park parking lot where I started. There's supposedly a handicapped accessible Trail at Winant park, and I'm going to return one day and look for it :-)",
   "Great little hike.  Well maintained trail.  Have hiked here with my dog's for years.  Not to steep and usually very quiet.",
   "A great hike and the trails are well marked, has beautiful scenery with many educational posts about the park and surrounding areas, ice cleats are recommended, dog friendly park,"
  ]
 },
 {
  "name": "Chuckster's",
  "address": "9 Bailey Rd, Chichester, NH 03258, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9ec03f1c-932f-11ea-bcb9-14b31f159f22.png",
  "tags": [
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=15578709330543309428",
  "source": "GoogleMaps",
  "reviews": [
   "What a great time for a senior coup. Made us feel like kids again.",
   "The park was wonderful. It was hot that day and I got sick from the heat. They need a place where people can cool off.",
   "Had a great time at mini golf and playing all the other activities",
   "Fun fun,  more things seemed to be added a great place to take the family!",
   "So much fun! What a great date day!"
  ]
 },
 {
  "name": "Greater Concord Chamber of Commerce",
  "address": "49 S Main St Suite 104, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f0c8acc-932f-11ea-8855-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=13804640297154013119",
  "source": "GoogleMaps",
  "reviews": [
   "This location has a nicer decor with the stone-look tiles but the staffs is not accommodating.",
   "The entire staff are extremely helpful but the location was too far to travel.",
   "If you need help getting around Concord this is the place to go guys also a great place next door to help artists out New Hampshire that has absolutely great gifts that are one of a kind New Hampshire Craftsmen League",
   "Join the chamber! Great place to network with other business people. They have events several times a month. Check out there website for dates and times.",
   "The Concord NH Chamber of Commerce is an outstanding organization. The Chamber really gets that networking and relationship building is an important role for the Chamber and its members. They offer great networking events, both large and small. The staff goes out of its way to encourage connections and avoid a membership of isolated cliques. With members from across the state, if you want to join a Chamber to get involved and be involved, this is the one. It has been great for me and my business."
  ]
 },
 {
  "name": "The Pierce Manse",
  "address": "14 Horseshoe Pond Ln, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9f614ac6-932f-11ea-b159-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "family",
   "tour",
   "knowledgeable",
   "family",
   "tour",
   "field",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=2598514276859436588",
  "source": "GoogleMaps",
  "reviews": [
   "It's closed for the season now. The surrounding environment is nice.",
   "The Franklin Pierce Manse is the historically significant home of the 14th President of the United States, Franklin Pierce.  Set on a side street in Concord, NH, it is easily accessible.  The staff is knowledgeable and enthusiastic about their mission of keeping alive the memory of Franklin Pierce and his family.  My guide was extraordinary at painting the former president and his family as fully dimensional people.  The successes of the Pierce administration were highlighted, such as the Gadsden Purchase and improved relations with Great Britain and Canada.  Less was said of the Kansas-Nebraska Act and its aftermath.  Pierce's strict interpretation of the Constitution and his firmly held beliefs in States Rights during his presidency began the inexorable march of the nation toward the Civil War.  It is a credit to the staff and guides that after a tour of the Manse one has the impetus to delve further into the life and presidency of Franklin Pierce.",
   "The house is only open a few months a year but brigade will open the house for you if you contact them in advance.  The ladies were extremely nice and very knowledgeable. Mrs. Cat gave our family a wonderful tour and we learned so much.  Thank you for letting us visit!",
   "Went on a field trip with a local school. Very educational and neat",
   "Wonderful historical tour of beautiful home! Also enjoyed their ice cream social and U.S. ARMY BAND concert 🇺🇸🇺🇸🇺🇸"
  ]
 },
 {
  "name": "White Park",
  "address": "1 White St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9fa6b022-932f-11ea-af66-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "walk",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16727654776704840441",
  "source": "GoogleMaps",
  "reviews": [
   "Nice park to walk around. There are benches, picnic tables and a pond with ducks. It is relatively quiet, but for the playground area.",
   "Checked it out for ice skating...woohoo it's ready and waiting. I don't think skate rentals are open yet though.",
   "I love this park!! The pond and ducks the kids can feed. They have a big play area for kids. There is also a pool in Sumer time!! Amazing park!!",
   "Plenty of parking.  Plowed walkways.  Great place walk the dog year round.",
   "I love this place! It has a lively pond with ducks.  Parents and kids feed them. A great jungle gym, slide and swings for the kids. I don't have children, but there are benches and picnic tables scattered about. There are trails and and it's just a really easy, nice walk."
  ]
 },
 {
  "name": "Lehtinen Park",
  "address": "Concord, NH 03303, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/9ff3bc50-932f-11ea-a7a3-14b31f159f22.png",
  "tags": [
   "hike"
  ],
  "link": "https://maps.google.com/?cid=12226379149398385595",
  "source": "GoogleMaps",
  "reviews": [
   "The \"park\" is a widened shoulder turned parking area with a stone monument that opens to a narrow trail that seems to connect to a whole network of trails around the river. This seems promising, but when I visited the place I was equipped for a kayak on the river, not a hike, so I could not explore much. There is no boat launch or anything like it here.",
   "Good hiking spot.",
   "Little known secret. Great if you can find it. Lots of trails and tracks to take a dog or a bike. I almost feel bad rating it because I'm exposing one of my childhood favorite secret respites! Enjoy!",
   "Great place to push off on the river!",
   "I love how Concord has set up these little green zones all over the city."
  ]
 },
 {
  "name": "Scenic RailRiders",
  "address": "188 Sewalls Falls Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a039d840-932f-11ea-959d-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "free",
   "family",
   "history",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=1934835454439390434",
  "source": "GoogleMaps",
  "reviews": [
   "It was our first time doing something like this,  loved the fact that it's a family business and both parents and kids worked together.  Definitely will be doing it again preferably in the fall. My husband and I enjoyed it very much so. The scenery was gorgeous also. It's a fun activity for the entire family , age doesn't matter either.  I highly recommend this if you haven't tried anything like this. GO! 🙃",
   "I brought my three kids ages 13-6 today! They loved it! The carts are easy to pedal! My 6 year old pedaled the whole time! The seats moved forward! I really enjoyed how relaxing it was. They have small baskets on each cart to hold waters. You are hands free, therefore you can take pictures the whole time! There are 3 stops during the 2 hour ride. You get to stretch your legs while they turn your cart around. This is a family owned business! The owners make the experience wonderful! They have put a lot of work into this amazing ride! We will be back! Great job!!",
   "Scenic Railriders is a great experience for anyone that has a fascination with Railroads and or Nature in general. It's extremely easy to pedal these Railcars which is unexpected and they are very well built and made almost entirely out of Aluminum. You get to see some scenic views of the river, go over a train trestle and pass a farm that has a lot of cows. The only advice I'd like to provide to the owners is to provide a little more information on the railroad and the history of the passage, and maybe a little bit more about his business. Otherwise it was a great experience and I would do it again with my son soon. Thank You Scenic Railriders From: #brocksjeeps",
   "So much fun. Very easy-going",
   "It was a lot of fun. I do recommend everyone try this at least once. It felt a but rushed, but that was just from the people behind us. We were taking our time enjoying the scenery and before I knew it the couple behind us was right behind us. The crew working were very friendly and put no pressure what so ever. I can't wait to go back in the middle of fall."
  ]
 },
 {
  "name": "Rollins Park",
  "address": "33 Bow St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a087843e-932f-11ea-ac32-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "walk",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11536374141563384188",
  "source": "GoogleMaps",
  "reviews": [
   "Great park. A lot of the equipment is for 3+ years old.",
   "Restoration Foursquare Church once a year loves coming to this beautiful park to worship and praise Lord.",
   "Its a wonderful place to experience a picnic, public events, there is a local pool for concord residents. A soccer field also played there is baseball, softball, lacrosse. An awesome place to walk the dogs of all sizes!",
   "Best park in Concord. Sun, shade, places to sit.  Walk the dog or fun with kids. Trails plowed in Winter.  Awesome!",
   "We love Rollins Park, in all four seasons. Always beautiful. Always fun. Wonderful place to make memories with friends, and family."
  ]
 },
 {
  "name": "Mary Baker Eddy Historic House",
  "address": "62 N State St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a0eb9cd0-932f-11ea-9320-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "history",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10385141315220032173",
  "source": "GoogleMaps",
  "reviews": [
   "I LOVE HOW IT TAKES ME BACK FROM TIMES TO TIMES LIKE THE PAST TO PRESENT LIKE ALWAYS CURRENT AND NEW!!!",
   "Very nice place  but the guide was not really good.",
   "Nice place- the guide was very nice n knowledgeable.",
   "This is a great little piece of history. Two rooms are furnished in period pieces similar to what Mary Baker Eddy would have. Another room is dedicated to Pleasant View, her next home that she loved but is no longer standing. Another room has a video about her life and pictures. One thing I learned from the tour is how dedicated to her community she was.",
   "Wonderful step back in time. Great learning experience for the adults as well as kids"
  ]
 },
 {
  "name": "Hannah Duston Memorial State Historic Site",
  "address": "298 US-4, Boscawen, NH 03303, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a13a3214-932f-11ea-b384-14b31f159f22.png",
  "tags": [
   "historic",
   "family",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=13770765682929617763",
  "source": "GoogleMaps",
  "reviews": [
   "Never been here but want to. I am a direct descendant of her on my Grandma Websters side. I will one day get out there to see the \"mother of the American tradition of scalp-hunting.\" Not that I condone that now days, but 300 plus years ago it was a way of survival.",
   "Great historic spot.",
   "She is my 9th Great Aunt .. A True Blooded Emerson! My favorite place to visit and think how it was in 1697 being capture and dragged from Harverhill Mass to where her statue stands. What bravery she showed and made it home to her family after they thought she was dead! 1st woman erected statue in the United States to honor her",
   "Nice trail walk today down by the river",
   "The area needs a lot of upkeep.. Not a place to bring small children"
  ]
 },
 {
  "name": "Canterbury Shaker Village",
  "address": "288 Shaker Rd, Canterbury, NH 03224, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a19daef0-932f-11ea-af59-14b31f159f22.png",
  "tags": [
   "history",
   "tour",
   "learn",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=18290379660349544293",
  "source": "GoogleMaps",
  "reviews": [
   "Oh my goodness I loved this place. It is a must see! So much history. It is so well taken care of and I learned so much. I honestly did not know anything about Shakers before this. They were truly hard working people. I love how they got their name!",
   "The Canterbury by Candlelight Christmas tour was just magical! It was blowing a gale, but nobody cared...we just bundled up and enjoyed the ambiance. Our guide Bill was a hoot and a half! \nAn amazing and heartwarming connection to the past, at a time when a simpler, quieter lifestyle has more and more appeal!",
   "Like stepping back in time\n Learn about a simpler life but it was also a time of great learning skills that are falling by the wayside to modrrn tech. These skills taught pride in what you did and created. Now there is no pride because machines can't take pride as they don't feel.",
   "The late 18th century in New England as it was when the Shakers established Canterbury brings to the eye a most beautiful study of architectural lines.  Each building had a purpose and a design to maximize efficiency. The beauty astounds me on each visit.   This village is protected as as national historic monument.   A must-see in New Hampshire.",
   "Very interesting place from a historical perspective. Loved the fact that women and men were regarded as equals in many aspects of their work and lives."
  ]
 },
 {
  "name": "Mercury Redstone Rocket",
  "address": "Concord, NH 03301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a1f0b258-932f-11ea-b8fc-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=12533303797356042734",
  "source": "GoogleMaps",
  "reviews": [
   "Great piece of cold war history in the middle of a small town!",
   "I didn't get to go inside the museum but even admiring the rocket outside was worth it.",
   "Great photo opportunity. It is also quite amazing.",
   "Who is Wernher von Braun?",
   ""
  ]
 },
 {
  "name": "North East Motor Sports Museum",
  "address": "922 NH-106, Loudon, NH 03307, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a234bf40-932f-11ea-9d53-14b31f159f22.png",
  "tags": [
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=18270876414584548217",
  "source": "GoogleMaps",
  "reviews": [
   "Such an interesting spot!!  Decided to do the membership since it wasn't the much more than 2 admissions!",
   "Absolutely love the displays and History.  Dick Bergerren is a wonderful historian of the sport and very eager to share stories and knowledge",
   "Very impressed. They've done a great job memorializing racing in New England.",
   "ARCA champion Austin Theriault's car and Eddie MacDonald's car are inly 2 of the historical cars there. Everyone should visit!!",
   "Great non-profit museum near NHMS.  Lots of history. Loved the John Buffum display. They have great presentations and car shows. Membership cost is super reasonable. I strongly recommend, if you're a gear head in new england, stop by."
  ]
 },
 {
  "name": "Clough State Park",
  "address": "455 Clough Park Rd, Weare, NH 03281, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a27683d4-932f-11ea-be36-14b31f159f22.png",
  "tags": [
   "walk",
   "nature",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10346721836911930547",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful place for a walk paddle or day st the beach.",
   "This place is unbelievable. I go there all summer. Looks like Switzerland. Great beach, there are tables, grills available, 4 dollars per person. So clean! So quiet! love!",
   "The views are wonderful! Nature at it's finest. What a great place to take in the sights and sounds, to get away from the everyday and just let things flow and be.",
   "Great place to spend the day alone, with friends or family around a beautiful lake.  The water temperature was lovely.  People were boating, swimming, fishing and kayaking. Lifeguard on duty.  Picnic tables, barbecue pits and grill stations throughout and available port-a-potties. Sites available for larger groups and events.  Great time had by all of us!",
   "Beautiful setting & pretty clean- but often quite crowded. Black flies are a problem out on the water & sand wasps are pretty intense the second half of August.\nAll in all I like it though."
  ]
 },
 {
  "name": "Currier Museum of Art",
  "address": "150 Ash St, Manchester, NH 03104, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a2bd028c-932f-11ea-8096-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "art",
   "creative",
   "family",
   "art",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=13116227134579516847",
  "source": "GoogleMaps",
  "reviews": [
   "I was here for the Shaker Furniture exhibition. The facility is very nice. The collection of works was excellent. I wish that more emphasis had been given to the craftsmanship of the pieces, instead of just their historical provenance. None of the cabinets had drawers pulled out to display their joinery, which was a disappointment. A better historical furniture exhibition can be found at the MFA in Boston.",
   "Remarkably good provincial art gallery.  Nice cafe area.  Knowledgeable docents. Decent shop.  Great art programs for children and adults. We've been supporters for years because of the leadership they show for local arts.",
   "The Currier is always creative and I enjoy it each time I go.  Refreshing, thought-provoking, fascinating, joyful, diverse, friendly.  I would use all these to describe my experiences there.  Wonderful exhibits and activities.  Community engagement.  Family friendly.  Plus the winter garden cafe, the gift shop, and the Frank Lloyd Wright house.  Marvelous.",
   "It’s funny I don’t think a lot of people in NH realize that we have our own Art Museum! The Currier is awesome though, they work hard at getting new featured exhibits and keeping their collection fresh!  They also offer arts classes and have a bunch of events throughout the year!",
   "Came here for a tour of the Frank Lloyd Wright designed Zimmerman house. Tour was great with helpful and informative guides. The museum has a nice collection and a moderately priced deli inside. Blue trees looked beautiful but a bit bare as it's winter."
  ]
 },
 {
  "name": "Contoocook Railroad Covered Bridge",
  "address": "Contoocook, NH 03229, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a307a064-932f-11ea-8541-14b31f159f22.png",
  "tags": [
   "history",
   "walk",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=5730000082739370849",
  "source": "GoogleMaps",
  "reviews": [
   "The covered bridge and train were awesome. The history was great to hear. Met some really nice people working on the train.",
   "Worth stopping by if you are in the area.",
   "Stumbled upon this covered bridge while driving and had to stop to view this beautiful construction. Situated over the river, the biggest challenge was getting photos of just the bridge as people clamored about.",
   "Gorgeous place to do engagement pics!",
   "Beautiful and photogenic historic bridge there are some nice trails to walk in the area as well."
  ]
 },
 {
  "name": "Hatbox Theatre",
  "address": "270 Loudon Road, Suite 1161, Concord, NH 03301, Concord, NH 03301, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a354aee4-932f-11ea-9589-14b31f159f22.png",
  "tags": [
   "music",
   "family",
   "theatre",
   "art",
   "performance",
   "free"
  ],
  "link": "https://maps.google.com/?cid=5096803560944443625",
  "source": "GoogleMaps",
  "reviews": [
   "I attended the Goblin Market production this past Friday, and was thrilled about the experience. Not only is the theater very accessible, easy parking, has great programming, live music, and an intimate environment, it's also repurposing an otherwise empty space in a mall - brilliant!",
   "This is a different experience. Sort of a cross between a small stage startup and open Mic. I mean this in the best possible way. It is an intimate setting. In that there are a few rows, so everyone is close to the stage. They use lights, screens, and a few props to set the scenes. The acting is very good, as is the timing. Everything moves along smoothly. This is a very casual setting. Maybe to casual. There is a bit of bantering between staff that make it seem as though they are still working at the process. Yet Hatbox has been here for a while. Well worth the price of the show, family friendly, snacks VERY reasonable price, and every seat is a great seat.",
   "Sorry it took me so long to try one of their plays.  Great evening.  We will be back soon and often.  Very reasonable price, so if you don't care for the play little is lost.",
   "What a great little theatre! And such a wide selection of entertainment offered. Come out and enjoy real live theater & Performance Art. I really love Tales Told. Every community needs a place where the folk can  share their tales. Next time you come by the old mall check in.",
   "This is a great space for productions. Mall has free parking which is nice."
  ]
 },
 {
  "name": "Old North Cemetery",
  "address": "141 N State St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a393db18-932f-11ea-809b-14b31f159f22.png",
  "tags": [
   "historic",
   "nature",
   "kids",
   "history",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7243484132559723060",
  "source": "GoogleMaps",
  "reviews": [
   "Truly historic in nature, the burial place of 14th President of the United States, Franklin Pierce.  The Pierce plot is located in the Minot enclosure, a small fenced in area off the main area of the cemetery.  Pierce's strict interpretation of the Constitution and his firmly held beliefs in States Rights during his presidency began the inexorable march of the nation toward the Civil War.",
   "Support your history and get your kids involved! Make it a game.",
   "a gem in the city for folks who like to visit old graveyards. In the summer, there are  is a group of middle school students who give free, and informative tours, as well. a great way to spend 30-45 minutes.",
   "Have always enjoyed visiting this super  awesome graveyard whenever I was visiting my aunt.",
   ""
  ]
 },
 {
  "name": "The Escape Room Experience",
  "address": "555 Main St, Laconia, NH 03246, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a3dbe0b4-932f-11ea-b782-14b31f159f22.png",
  "tags": [
   "family",
   "family",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=9145020528092154744",
  "source": "GoogleMaps",
  "reviews": [
   "Christmas at this grandma's was greatly enhanced by the fun our 3 generations of family enjoyed at the Escape Room Experience \"Christmas at Grandma's\" themed room!  It was rated as Easy but was challenging enough to engage two 13 year old boys for their first escape room experience as well as the 4 adults with limited experience.  We will definitely plan to bring the grandsons for another escape when they visit this summer!",
   "It was really great! I was surprised at how much fun and it was more difficult then we had expected! I would definitely do another room...excited to hear the slasher room is coming this Spring!",
   "This is our second time visiting The Escape Room Experience as a team building activity. It is amazing to see how everyone can play a part in solving the puzzles! We were happy to complete The Fortune Teller and leave with our souls! We look forward to our next trip.",
   "Great family fun for a 13 year old's birthday party.  These guys run a polished and exciting shop and are clearly excited about providing an awesome experience. Mission accomplished.",
   "This place is great. Super unique puzzles. The dungeon master was fantastic. The story of the hangover room was entertaining."
  ]
 },
 {
  "name": "Bear Brook State Park",
  "address": "157 Deerfield Rd, Allenstown, NH 03275, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4396a68-932f-11ea-b32a-14b31f159f22.png",
  "tags": [
   "hike",
   "nature",
   "knowledgeable",
   "hike",
   "walking",
   "cheap",
   "hike"
  ],
  "link": "https://maps.google.com/?cid=14936989504122529078",
  "source": "GoogleMaps",
  "reviews": [
   "This park is beyond amazing and I say this with a lot of reservations as I'd like to keep this treasure a secret. The park is absolutely amazing as I bike it, hike it, ski it and it is always a great time. Luck to have resources like this to get out and enjoy nature.",
   "This state park is beautiful. The staff is very knowledgeable and assisted us quickly and efficiently. They offer camping for the day, rest rooms and changing rooms. You won't be disappointed stopping at this state park!",
   "Beautiful state park, with nice trails for walking. Did our first day hike on new years day here and really enjoyed it!",
   "It was beautiful there. Bathrooms are to way you would expect a park to be. So not great but that is why the price is cheap. I would love for them to add more electrical site work ups for RVs.",
   "Nicely marked trails. Beautiful hike with the dogs. Nice foliage in the fall."
  ]
 },
 {
  "name": "Escape Hour House",
  "address": "401 Gilford Ave, Gilford, NH 03249, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a47fe976-932f-11ea-be5e-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=14811921493451703270",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great night in the \"Russian connection\" room. Will definitely be back to try another room. Recommend to anyone. Was great!",
   "Very fun!  Well thought out escape room.",
   "Best escape room I’ve done! Really well set up and lots of fun to solve. Highly recommend.",
   "This was such an awesome, fun experience for a surprise bday! Highly recommend! 👍🏻",
   "Group of friends booked Swan Song and The Russian Connection. Had a blast! The rooms were both challenging and took us the whole hour to complete. We all had to work together and everyone loved it. We will definitely be back when Mission Impossible opens!"
  ]
 },
 {
  "name": "SEE Science Center",
  "address": "200 Bedford St, Manchester, NH 03101, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a4cecccc-932f-11ea-8870-14b31f159f22.png",
  "tags": [
   "kids",
   "cheap",
   "kids",
   "kids",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=3260004798039431399",
  "source": "GoogleMaps",
  "reviews": [
   "Great place for kids! Not too big, and not as overweight as some of the larger museums. A hidden gem!",
   "Great place for kids. More like 4/5 years or older. Lots of interaction toys ..like how engines work and how pulley systems work. They also have a Giant lego set of the old millyard. This is the main reason we went. Cheap prices.",
   "SEE Science Center has many 'home grown exhibits, see which one your kids like the best as the explore the both floors.  Is there a concept  that needs to be explained, make a suggestion the staff, maybe they can design and build it. \nDo not miss The Millyard Museum on the ground level.",
   "This Science Center is housed in a commercial building shared with other companies. The building itself is very nice. There’s 2 floors of stuff to do and the science demos are very nice. You have to park on the street, but there’s plenty of parking and it is free on weekends. I don’t know if it would be harder to find parking during the weekday though.",
   "Amazing hands on displays for kids to test out"
  ]
 },
 {
  "name": "Zimmerman House",
  "address": "150 Ash St, Manchester, NH 03104, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a50fb958-932f-11ea-993b-14b31f159f22.png",
  "tags": [
   "walk",
   "knowledgeable",
   "tour",
   "art",
   "field",
   "art",
   "structure",
   "knowledgeable",
   "free",
   "tour",
   "art",
   "field",
   "kids",
   "art",
   "history",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8820853908414404974",
  "source": "GoogleMaps",
  "reviews": [
   "Tour of the  Zimmerman house departs from the art museum and it was the highlight of my trip to Manchester. The docent was very knowledgeable about the house and had lots of information to share going from the design stage all the way through to how the house came into the museum's possession and the work that was needed to keep it in great condition for guests to walk through. Seeing a FLW house as it was actually lived in was magical.",
   "The Zimmerman house is a restored Frank Lloyd  Wright creation, built in NH in the early 1950s for a couple who both worked in the medical field. The house apparently cost about $60, 000 all in and is close to 1600 square feet with two bedrooms. The home althoug small by today's standards, is incredibly well placed on the lot and wonderfully quiet. The interior feels a lot like Kentucky Nob in Pennsylvania,. You enter with traditional Frank Lloyd Wright compression, take a right and enter the great room. It has extremely small windows along the front of the house above the banquette of couches running along the front wall facing toward the back of the house. The back side of the great room is filled with windows and planters that allow for an indoor outdoor feeling. Moving around the center axis of the house you come back to the kitchen area that's placed exactly in the same way it is with Kentuck Nob. The central Kitchen and operational center of the house is found within the central access and core of the structure. There is a master bedroom in the back off the kitchen. From the front door if you enter and turn left, you'll go along a corridor that then goes back to an open area that could also be a bedroom with a bath for any guests that might have stayed over. The home is maintained in a Suburban setting still by the preservationist of The Currier Museum of Art in Manchester. Tours start at The Currier Museum and take about 5 minutes by bus to get to the actual property. You'll be asked to don protective booties before you enter the home, and the care and restoration that the museum has put into the home shows. It's beautiful. And if you're a Wright fan, it's a must see and wonderful example nestled in the woods of New Hampshire.",
   "It is a mus for Frank Lloyd Wright admirer. Reservations required for all tours, it is recommended purchasing tickets well in advance, number of people is limited, adult admission $25. Tour starts at the Currier Museum of Art, little bus will take you to the house. 90 minutes tour is guided by volunteer and we were lucky, our volunteer was really knowledgeable and pasionet. She made the whole tour very interesting and added personal stories. Thank you! After the tour you can visit the Currier Museum of Art for free.",
   "Had so much fun in my daughters field trip today with my husband. We really enjoyed coming there. If you can appreciate art and a little bit of history this is the place to go. I have never been to any other art museum so it was my first time but seeing it in person was so much nicer than what people claim online or in books or through TV or movies. I enjoyed the entertainment they provided for the kids and got the kids to make their own artwork. This place was really nice one day i will have to go and really look at everything myself",
   "The only Frank Lloyd Wright house you can tour in New Hampshire (recently, the museum bought the Kalil House nearby, so the museum owns the only two FLW houses in NH). Worth the detour if you are in the Manchester area. FLW's Usonian house is at the origin of all American bungalows. The volunteer guides are very diligent about the house: you reach the house by bus only from the Currier Museum, you cannot touch anything --like in a museum--, you have to wear shoe covers, you cannot take pictures inside. They are a bit fussy, at Fallingwater, we can take pictyures inside."
  ]
 },
 {
  "name": "Pats Peak Ski Area",
  "address": "686 Flanders Rd, Henniker, NH 03242, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a56bbc2e-932f-11ea-b9ae-14b31f159f22.png",
  "tags": [
   "family",
   "organized",
   "family",
   "food",
   "family",
   "food",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6762900410220887512",
  "source": "GoogleMaps",
  "reviews": [
   "My family and I went skiing for the first time here. All of the employees were very nice and the place was very organized. My family and I had a really fun day together skiing and taking the beginner lesson. A few of us (who had skied once before) did some green slopes later.\nThe chicken tenders, big cookies, and hot chocolate were awesome. During meal times the chicken tenders are disappearing so fast they keep coming out freshly fried. Remember to ask for marshmallows to go with the hot chocolate.\nI would happily go back here for another novice day of skiing with family or friends.",
   "One of the best family ski areas. It gets crowded but the staff is good at handling crowds. We had ski classes for the whole family and all the instructors were very good and friendly and eager to help. Tubing area is fun for all ages. It gets crowded too but lines move quickly thanks to staff. The slopes were well maintained. The lodge seemed crowded but we always find a spot to sit. The food in the cafeterias are good, too. Rentals move seamlessly.",
   "Always a fun ski area. Brought my son and we both had a blast. Lift lines were reasonable, as was the space in the lodge. We ate lunch off peak time and there was no problem finding a table, and no line at the cafeteria. Food was surprisingly good for ski area cafeteria food. I've liked Pat's Peak for casual family friendly skiing since I was a kid, and this last visit didn't disappoint.",
   "My daughter and I only went snowtubing. Forty dollars for two hours per person, price I suppose is reasonable since maintaining a place so big, especially since they make their own snow. It hasn't snowed in weeks and there was plenty for winter activities. \nThe staff was very accommodating to my daughter because of her needs and let my daughter ride down sitting since she was scared going down head first. I prefer not to go down head first as well since your head could take a possible impact. But, we had fun. Forty degree weather was nice.\nParking lot was tough on the suspension of cars. I saw on car bump the ground because the car drove low to the ground.\nVery busy and popular place. I would go again.",
   "This mountain has a very family friendly and \"homey vibe\". The lodges are beautiful and they are always making improvements around the mountain, to quote a staff member: \"There is no finish line.\" The customer service is on point here. The staff here are so helpful that when I brought my new boots to be refitted to my skis they not only offered to do it for free they found a problem with my boots and gave me a voucher for a completely free set of rental gear. There is no shortage of commendations I have for this mountain and their staff. While it may be on the smaller side, the mountain offers plenty of trails, features, and reliable snow making. I've been going here for years and it has never let me down."
  ]
 },
 {
  "name": "The Palace Theatre",
  "address": "80 Hanover St, Manchester, NH 03101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5af85c0-932f-11ea-82b3-14b31f159f22.png",
  "tags": [
   "theatre",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=12074442606378052663",
  "source": "GoogleMaps",
  "reviews": [
   "The palace theatre is such a beautiful venue. The seats are fantastic no matter where you sit. The staff are extremely professional and helpful. And the actors are always amazing. We see plays with our kids and they love it every time. We also see plays just the 2 of us and have an amazing time with other adults. My favorite venue for a good play with a fancy feeling",
   "A beautiful theater with amazing acoustics! Ticket prices are very reasonable and a membership is only $75! The staff were wonderful.  The merchandise was cash only so be prepared...there is not an ATM at the venue.",
   "Love the Palace Theater in Manchester we go often and are members. Most shows are 39.00 dollars each for tickets.  Can't beat a nice night out and a good show for under $100.00 for 2 tickets. If you become members you get 2 free tickets each year also.Also some good restaurants near by that the theater gives coupons to members.",
   "One of my favorite places in Manchester! They have great shows and do a lot in the community. Take advantage of all they have to offer, you don't see this much programme anywhere else nearby. I love going to see shows and keeping up with their latest news. The Palace is also a beautiful theater worth a visit any time!",
   "This venue is absolutely amazing! Just the right size to get great views, awesome sounds and great shows! They do an excellent job with the youth!"
  ]
 },
 {
  "name": "Cowabunga's!",
  "address": "725 Huse Rd, Manchester, NH 03103, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a5f355c2-932f-11ea-99be-14b31f159f22.png",
  "tags": [
   "music",
   "kids",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=6133752540744762261",
  "source": "GoogleMaps",
  "reviews": [
   "I went here for the birthday of  a friend's child. I have never been to a place like this so I cannot compare it to any other.  What I do know is that the place was very clean, safe and well staffed. The noise level was insane but that's to be expected with music, children and blowers running to keep things inflated.",
   "My kiddos had a blast. We have been in a lot of bounce house places and this is by far the best.\n\nI had fun in the arcade machines, specially Ms. PacMan. The place must have read the other person’s complain about the carpet. I saw pads around the bounce houses so no worries. $12 per kid was so worth it.",
   "I love this place, my son loves it as well he was 3 in these pictures but he is 6 now and still has a blast on all the slides etx",
   "We went here with our twin granddaughters. They had a blast! There were many things for them to try. They had favorites but as kids grow, they need to try new challenges. Cowabunga's gave them the latitude to gave fun and to stretch their courage a little. They loved it which is all that's necessary!",
   "Half the stuff they didn't open until way later in the day. Kids got bord really quick. It would be a ideal place to bring 2-4 year old"
  ]
 },
 {
  "name": "Franklin Pierce Homestead State Historic Site",
  "address": "301 2nd New Hampshire Turnpike, Hillsboro, NH 03244, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a63ddd06-932f-11ea-8596-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "knowledgeable",
   "tour",
   "history",
   "knowledgeable",
   "family",
   "historic",
   "knowledgeable",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=6136669254151907724",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful historical home. (I LOVE old architecture.) The tour guide, Sara, was very knowledgeable and extremely friendly. Definitely worth a visit.",
   "Fascinating house and knowledgeable historians/tour guides. The gift shop is a plus. To this day my son regales facts when we pass, which is everyday as we're neighbors. Rarely can a person visit the home of a president. As history is being lost with younger generations, having a tour of this homestead inspires learning, and more importantly history can be learned and touched by children, leaving an impression that lasts.",
   "The volunteers are knowledgeable and friendly. The home is a museum, smaller family members should be able to climb stairs and be patient with standing behind the chords",
   "Lovely historic place filled with interesting books, China and a documentary.  The house and grounds are superbly kept.",
   "I loved  visiting this house.  The tour guide was swift & knowledgeable.  So interesting.  They've done an excellent job of restoration."
  ]
 },
 {
  "name": "Memorial Arch of Tilton",
  "address": "5 Memorial St, Northfield, NH 03276, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a68ccd92-932f-11ea-be3a-14b31f159f22.png",
  "tags": [
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=11872813015436626276",
  "source": "GoogleMaps",
  "reviews": [
   "Piece of my childhood. Perfect sledding spot. Great for picnics. Good for prom pictures. random piece of history",
   "Beautiful Place To Hang Out And Sit Around. The Arch Is Massive And Is A Place With Many Mysterious Rumors To Constantly Spark. A Place To Respect And A Place That Will Stand. \n\n- A Top Notch Place To Visit While Your In Town",
   "The Tilton Arch is a life-sized reproduction of an arc in France, and located atop my childhood sliding hill! As a child, and living below it on Arch Street, I thought my family owned it... Great place to visit in the summer (there are grills to accommodate you), and it's also a curious, interesting landmark.",
   "Beautiful tall Arch in a nicely landscaped park where you can barbeque too.",
   "Beautiful up there. Nice place to take photos!"
  ]
 },
 {
  "name": "Pawtuckaway State Park",
  "address": "128 Mountain Rd, Nottingham, NH 03290, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a6d7f586-932f-11ea-b7f9-14b31f159f22.png",
  "tags": [
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=10948701292543470287",
  "source": "GoogleMaps",
  "reviews": [
   "I love 5 minutes from this park and go almost every weekend. It's a good little park and has some nice short hikes. If you are looking for something more intense head further north.",
   "We really like camping here.   It's unfortunate that it's getting so popular that everything is booked a year out.  Yet, when you actually go, 50% of the sites are just empty.  I'm guessing people from Boston are just booking it up \"in case\" they decide to go.  Would be better if they went back to taking walkups and not booking the entire place long in advance.  That's why they lose a star.",
   "I love this campground and state park. I originally came here for the first time because I was looking for places to use my new kayaks. I’ve been back every year because of the wide variety of activities. It is such a large park that’s perfect for hiking as well. Fishing is great, sunsets are amazing, lake front campsites are to die for.",
   "Another great place to go camping in NH. We absolutely love coming here when we can get a spot. It's very well maintained, quiet and beautiful. If you have a kayak you will absolutely love kayaking here!",
   "Grew up close to here, able to ride my bike there. Awesome camping sites, extremely affordable. Friendly staff. Highly maintained even though guests can be gross."
  ]
 },
 {
  "name": "LOK'd! Room Escape - East Side",
  "address": "750 E Industrial Park Dr b, Manchester, NH 03109, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7290658-932f-11ea-b448-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=1691908027486772870",
  "source": "GoogleMaps",
  "reviews": [
   "This was the first time ever doing an escape room. The directions were clear and the employees were nice. Everything was clean and good. Some things didn't work as well like the dollar thing which set us back awhile trying to get it open. It was fun and I'd do it again",
   "Very unprofessional. Called around 4:30pm and was told there was multiple spots available for two different escape rooms. Show up around 6:30pm to find store is closed when it’s listed as 9pm for Friday. I proceeded to call store number three times. First time was a young female that hung up. Second time was a male that said they’re were closed for winter. Third time same male answered phone and pretended to be dominos pizza and when asked to speak to manager I was hung up on.",
   "We’ve done two of their rooms at this location. Our first room, and our first ever escape room, went very well and we had a good time. Our second room here, their hardest, was much more difficult. I think this is to do with some worn equipment - nonetheless we managed to work our way our. I think LOK’d was is a good place to start out doing escape rooms. Their staff was very welcoming and made the scenarios fun.",
   "It was a really fun place to go and was my first ever escape room experience. Check in was super easy and quick. The theme of the room was really fun and different.",
   "We have been here 3 times.  All have been entertaining and challenging.  A storyline to follow.  Lots of fun!  I would highly recommend it."
  ]
 },
 {
  "name": "Gunstock Mountain Resort",
  "address": "719 Cherry Valley Rd, Gilford, NH 03249, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7647ec8-932f-11ea-a2f1-14b31f159f22.png",
  "tags": [
   "free",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10802889988413398497",
  "source": "GoogleMaps",
  "reviews": [
   "I loved the view of the snowy mountaintops and conifers upon arrival. I tried snowboarding for the first time and found it very fun, especially after I moved from the practice \"bunny slope\" to the significantly longer slope with the chairlift. \nThe staff member from whom we bought our tickets was very friendly and helpful as well as patient with our large group. Since we went night skiing (~ 4:30-7pm), both lessons and equipment rentals were free, so overall it was relatively inexpensive! Unfortunately, the teachers didn't seem very enthusiastic but did their job.",
   "Was there with family over President's weekend. Conditions were very good. Staff was exceptionally helpful. A great value for the money. We all had a great time and look forward to our next visit, soon.",
   "The staff was great! I want sure where to go twice and both times I easily found a staff member that helped. They were very friendly! I had a conversation with two of them. Both said they looked forward to seeing us again. My son was the only one that skied. It was his first time and he loved it! He had beginner lessons and off he went. We will be going back!",
   "Had a great time here on the snow tubing hill and the coaster. It was very warm out and likely one of the last days for the hill. Still enjoyed ourselves for the two hour pass to these two areas.",
   "I absolutely love it here. It is such a family friendly mountain.  We got married here last after a horse drawn sleigh ride. Instructors are amazing for our 5 year old.  Everyone is friendly here.  Summer activities are also amazing.. huge zipline, awesome ropes course. We have tent camped here in the summer and currently park a travel trailer here in the winter. Love this place!"
  ]
 },
 {
  "name": "Candia Springs Adventure Park",
  "address": "446 Raymond Rd, Candia, NH 03034, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7ad05d0-932f-11ea-b233-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "organized",
   "family"
  ],
  "link": "https://maps.google.com/?cid=17427515120185214185",
  "source": "GoogleMaps",
  "reviews": [
   "Great  places , so much fun   small  but  is great.",
   "It is a small water park, but fun for all ages.  I kiddie splash pad, a small pool,  4 water slides and the reef, a pond and beach with a large inflatable obstacle course that ends up 15 out of the water.  Didn't use the zip line or the adventure offerings.  Snack shack with the usual food options, and a cool make your own milkshake machine.",
   "Lot's of fun for the entire family. I can't wait to go go back for more fun and adventure.",
   "Awesome. Absolutely liked it. Clean, well organized. On stage 2 think twice before starting. It is not that simple. It wss our first time but we will be back.",
   "Great family fun💚"
  ]
 },
 {
  "name": "Manchester Historic Association Millyard Museum",
  "address": "200 Bedford St, Manchester, NH 03101, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a7fa2e2e-932f-11ea-9789-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "learn",
   "history",
   "history",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12654191449348769740",
  "source": "GoogleMaps",
  "reviews": [
   "Much smaller than I anticipated but it was still interesting. They had \"special closed hours\" that didn't show up anywhere prior to our arrival so we arrived 2 hours before the \"special time\" opening. There is no parking lot just for the museum and so parking is a big challenge.",
   "Since moving into a Mill building 2yrs ago in Manchester I've always wanted to know more about the history of Manchester. Not the negative stuff everyone says about this historic city. The Museum had a little of everything to see. Our forefathers built a great city and this museum shows you that. Highly recommend",
   "Great place to learn about the history of the Mills and Manchester. \n\nThe layout is logical and covers not only what happened, but why and how it effects the people back then.\n\nWe spent almost 2 hours going through the exhibits.",
   "For more than a century, Manchester was dominated by the Amoskeag Manufacturing Company, whose buildings still define the cityscape of today. One of those buildings is the home of this museum, which presents interesting and notable artifacts from the company's manufacturing heyday. It also describes the company's decline and bankruptcy, and the subsequent revitalization of the area, which continues to this day. If you're interested in local history, definitely check this place out.\n\nThe museum is one level below ground and was only accessible by elevator during our visit.",
   "One of the best exhibits in NH, tour The Millyard Museum and see Manchester history. At entrance, a penstock greets you, once delivering water to turbines powering the mill. Entering the main hall you see the vibrance water power brought to the Queen City. While your are in the building climb the stairs to check out the Millyard Lego Model at the SEE Science Center."
  ]
 },
 {
  "name": "Mt Kearsarge Indian Museum",
  "address": "18 Highlawn Rd, Warner, NH 03278, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a84ba9d0-932f-11ea-8824-14b31f159f22.png",
  "tags": [
   "walk",
   "learn",
   "tour",
   "walk",
   "field",
   "nature",
   "learn",
   "history",
   "food",
   "learn",
   "tour",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=9152016062098940438",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to learn about native Americans! You can walk through on your own or get a guided tour, lots of artifacts and interesting stories. Also the building is located on a arboretum, full of all kinds of trees.",
   "Went here with my son's school on a field trip. Felt very informed as they went into detail about the different histories of the different Indian nations of our country. The nature walk was very nice. Would definitely recommend this place to others.",
   "Awesome place. Plenty of history to learn. Wonderful pieces on display. Highly recommended!",
   "The Staff that showed us around did more than answer our questions. We were shown why American Indians were so successful fisherman, designing clothing from natural resources. As a culture living without our current resources, Mt Kearsarge Staff showed us how Indian choices and ingenuity worked to provide resources for a culture that was not mechanized. It showed me how American Indian culture provided not only for its own people, but designed options for obtaining healthy food, clothing, & transport for those who were willing to listen & share.",
   "I absolutely LOVE this museum! There is so much culture and nature to learn about! The tour guides do a great deal to make sure they answer your questions before you leave and sometimes staff will send a follow up email if you couldnt get answers that day! The events are even more amazing and Bud and Nancy are such inspirational people for making a place like this a home to so many folks!"
  ]
 },
 {
  "name": "McIntyre Ski Area",
  "address": "50 Chalet Ct, Manchester, NH 03104, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a893fd98-932f-11ea-b04e-14b31f159f22.png",
  "tags": [
   "learn",
   "food",
   "family",
   "food",
   "delicious",
   "learn",
   "affordable",
   "kids",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5857007575586006288",
  "source": "GoogleMaps",
  "reviews": [
   "People there are nice, the mentors are the most chill people I ever met. Everything about this place is about helping others which I find nice. You can learn snowboarding with the help and it's nice knowing that you have a community to count on. Great place. Worth going. Even with the three different stages of hills, you still learn a lot.",
   "Super fun afternoon with our group.  The weather was great, the lodge crowded at times, but the food is great!  The tubing trails are fast and fun.  Even my little one was able to do it on his own at 5",
   "Great place to learn how to ski!  They have a great \"learn to ski\" program and the mountain is small enough to not intimidate the meek.  As a plus, it's downright affordable.  If you're a seasoned skier you won't enjoy the mountain as it is small.  If you're a seasoned skier and are teaching a first time skier, this is the place to go!\n\nThe snow tubing is probably the best in the area as they let you \"connect the tubes together\" so a whole family can go down at once on multiple tubes... Making it way more fun!\n\nParking is ok and can sometimes get tight like on holiday weekends. They have night time skiing so there's no need to make sure you're there first thing in the morning to get \"all your monies worth.\"\n\nThe food at the lodge is surprisingly delicious with average prices.",
   "We went on Sunday Jan 26th. We only used the tubing section. My kids (6&8) had a lot of fun. The downside was the moving sidewalk which brings you to the top of the hill is too hard for some people to understand, you literally just have to stand still. When people don't stand still, they fall down which stop's the sidewalk. That builds the line and upsets everyone.",
   "Small inexpensive ski area that is nice for kids that are learning. Lessons weren't that expensive and were easily booked. Most of the paths were visible from the bottom, which was good for us to allow the kids to ski freely without us. Small lodge, but food was decent and a small bar was open part of the day."
  ]
 },
 {
  "name": "David J. Nagel MD",
  "address": "264 Pleasant St, Concord, NH 03301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a8dd89f4-932f-11ea-8fa1-14b31f159f22.png",
  "tags": [
   "approachable"
  ],
  "link": "https://maps.google.com/?cid=4695552184233769383",
  "source": "GoogleMaps",
  "reviews": [
   "Had a tremendous experience with Dr Nagel. He was approachable... he listened... and was flexible. We chatted during the procedure, during which time he kept me informed as to how things were proceeding, but found a subject matter to my liking that helped keep me from fretting over what was actually going on. Funny sense of humor. Excellent bedside manner. Highly recommended!",
   "Dr. Nagel was thorough & professional in his examination of my issues as well as explaining his procedure and its purpose for diagnoses. But the real quality of his work is his \"Bedside Manner\". His engaging and personal manner puts one at ease, and assures that he is interested. I never got the feeling that I was merely another passing patient. I am confident Hippocrates would be proud of him.",
   "I always enjoy visiting with Dr. Nagel.  He is so comfortable to be around and is so efficient at what he does.  Great doctor; great human being.",
   "We're blessed to have Dr. Nagel to help us.  He's willing to spend the time explaining things so you understand.  He is pleasant and helpful.  He keeps you comfortable and engaged while doing the procedure.  His nursing staff is pleasant and helpful as well.  I didn't know that once he's treated you, you can go to him directly if you have further problems.  Nice to know that.",
   "Doctor Nagel did a great job. He carefully explained what he was going to do and the specifics on positioning due to existing hardware. \nHe talked through each step during the process to help ensure that I would know what to expect.\nHe administered the 14 shot that I have received to my lower back and this was the first one that I could feel the medication working on the nerve from injection site to my calf. While a strange feeling I knew he hit the spot.\nI will be going back to see him for two more injections in the months ahead and feel very comfortable being in his care."
  ]
 },
 {
  "name": "Concord Craft Brewing Company",
  "address": "117 Storrs St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a91eb1e4-932f-11ea-a0d5-14b31f159f22.png",
  "tags": [
   "brewery",
   "brewery",
   "brewery"
  ],
  "link": "https://maps.google.com/?cid=17044927339530521188",
  "source": "GoogleMaps",
  "reviews": [
   "Beers are good, nothing blew me away but cool space. I will go back and try other offerings when I’m in the area",
   "Tried this place already with my friend and I am obsessed since then. I enjoyed the fantastic ambience and flavorful dishes and beverages. Kudos.",
   "Cool little brewery in downtown Concord. \"Safe Space\" is a solid IPA. The DIPA on tap was pretty good too and packs a punch!",
   "Loved the interior setting, small, but brewery like.  Great service, brews were very drinkable",
   "Concord Craft Brewing supplied kegs for our wedding at Lake Shore Village Resort a couple weeks ago. We had stopped in to try it out and the beer was awesome! The staff and owner were super helpful in picking beer,  how many kegs, delivery and pick-up, etc. Everything was awesome about them! Can't wait to visit the brewery again and will definitely pick up their beer when I see it in a store (love the Safe Space IPA!!!)!"
  ]
 },
 {
  "name": "Winslow State Park",
  "address": "475 Kearsarge Mountain Rd, Wilmot, NH 03287, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9641f62-932f-11ea-a5e3-14b31f159f22.png",
  "tags": [
   "hike",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=16098156626703340684",
  "source": "GoogleMaps",
  "reviews": [
   "The view of the valley from Mt. Kearsage is breathtaking. The hiking trails are novice level but the view is even better from there.",
   "Pretty amazing it's my favorite easy hike in the state by far, with top notch parking.",
   "Great park and access to trails. People here are incredibly friendly and helpful. Park is VERY well maintained, all the way down to the lines on the pavement. Awesome place to bring kids and enjoy the whole day outside. We will definitely be back again soon to do more exploring.",
   "Offers a couple hiking paths up Mt Kearsarge, you can start at a decent elevation which makes the hikes more reasonable.",
   "Great train up to the top. You can drive a fair amount of the way"
  ]
 },
 {
  "name": "Phenix Hall",
  "address": "38 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9b8a5ca-932f-11ea-9521-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=14741113585663533593",
  "source": "GoogleMaps",
  "reviews": [
   "Awesome building with some very cool history to it.  I just learned that Abe Lincoln and other notable people in history have spoken in this upstairs venue.  Really hoping to see it become revitalized in the coming years and make downtown Concord even cooler than it is!",
   "Great place",
   "",
   "",
   ""
  ]
 },
 {
  "name": "Stark Park",
  "address": "550 River Rd, Manchester, NH 03104, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/a9f9f4ba-932f-11ea-a615-14b31f159f22.png",
  "tags": [
   "music",
   "walk",
   "kids",
   "walk",
   "walking",
   "learn",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1263505587390894280",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely place to go to just sit and think, stroll, play with my daughter. Friends of Stark park is great love the live music. Also play Pokemon go here too. I've never come across any rude people and it's always clean never any trash or litter.",
   "Very nice and clean. Good for walk.",
   "This park very well maintained , not a children's park as in ...a playground, there is a huge gazedo stage area , you can go on line to see whose playning there. Bring your own chairs!\n   Beautiful sprawling area to let the kids run  and have a picnic.\n I was blown away at the size of the Statue of General Stark , absolutely stunning.",
   "The walking venue is short. Its not conducive to take a walk. Other than that its a nice park.",
   "The park is really nice and you can learn some history. But the unpaved trails behind the park is where it's at. You can find some beautiful spots."
  ]
 },
 {
  "name": "Twin Bridge Park",
  "address": "485 Daniel Webster Hwy, Merrimack, NH 03054, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aa5422e8-932f-11ea-b26c-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "walk",
   "library",
   "walking",
   "structure",
   "nature",
   "kids",
   "kids",
   "family",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6370990278518972708",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing park. Be made me wish I was a little kid. So much thought went into it. Even a place for adults to sit and relax. The trails are gorgeous as well. And we'll keep up with",
   "What a fun place this turned out to be! I was actually trying to go to another park but missed my turn. When I pulled into this parking lot, I noticed there was another park! Well, first I noticed the sign for the park but I only could see a baseball field. But upon further looking, as I walked down the hill, I was pleasantly surprised to see so many people down by the entrance of a trail. This place is so awesome. It's a nice easy park no matter the trail you pick. There are a couple of bridges and areas marked off as private when the trail ends. This is a good place to bring the kids.",
   "Twin bridge is a fantastic spot. There is a great, safe playground for the kids and all the equipment is in good shape and well cared for. There is a small playground to the right as you enter for the little ones and then the main structure for bigger kids. There is also a set of walking trails, so when you're done playing with your kids, you can walk along the brook in nature as well as over the two Bridges that go over the brook.\n\nThere is also a little library of books available, sponsored by the Merrimack Public library, so it turns into a nice day of play, exploration and books!",
   "Great place for kids of all ages along with beautiful, easy trails to venture on for all ages whether your a seasoned hiker or just someone looking to take a stroll to enjoy the prestine beauty of nature. I would highly recommend this place to anyone looking for some family fun or couples looking to spend some quality time just an FYI if you decide to go during the summer time I would highly recommend bringing bug spray other than that... Enjoy and stay safe!",
   "AMAZING. BEST PLAYSCAPE EVER. WISH I HAD IT WHEN I WAS A KID ITS LIKE A CASTLE. I FELT LIKE A KID AGAIN, IT WAS A WONDERLAND. Trails were also beautiful. Never thought I'd enjoy hiking in the winter but the river was gorgeous and made it far more interesting and worth it to go in the cold. Going back next time we're in NH"
  ]
 },
 {
  "name": "Mount Washington Cruises",
  "address": "211 Lakeside Ave, Laconia, NH 03246, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aaa269fa-932f-11ea-be40-14b31f159f22.png",
  "tags": [
   "food",
   "tour",
   "food",
   "food",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=1706836900532595894",
  "source": "GoogleMaps",
  "reviews": [
   "I went on my first cruise on October 26th 2019. It was their Halloween cruise. I was so excited to go on this cruise with my Boyfriend. It was an amazing night for sure. Not only was the food great the entertainment was great and the views amazing even in late October. My then boy friend brought me out to the dance floor after dinner and then and there he git down on one knee and proposed. We are getting married in May ❤ I tell everyone to go on one if their cruises. Absolutely best night ❤",
   "My father and stepmother were visiting us and we thought they would enjoy the fall leaf tour.  They loved it and so did we. Good food,  fun entertainment and amazing views of the mountain covered in fall foliage.  The weather was great and the staff helpful and accommodating.  We'll probably do this trip again.",
   "It was our first cruise on M/S Washington. We booked it ahead to celebrate our friend's birthday. We all had great time! Food was tasty and service was super. The solo guitarist was an awesome performer. Everyone enjoyed the scenery and weather was perfect.",
   "I would highly recommend taking this cruise if you are already there, I would also suggest booking ahead of time. \n\nWe were on the Elvis dinner cruise and had a great time.\n\nThere are 2 floors and 2 stages. The main entertainment does go from floor to floor.\n\nThe Dinner is a buffet, as buffets go it is not elaborate with 25 options, but it had 3 main course choices, Chicken Marsala, Beef Teriyaki and Salmon. I had a bit of each and can say they were all good.\n\nThe cruise is about the entertainment and the atmosphere, we went the first week in Oct and at night it was chilly out on the lake, but still the stars were so bright and close also the moon was out. If you want romance take the dinner cruise.",
   "Fantastic way to tour a great NH lake while having a great time.  Ask about hosting your class reunion, wedding reception or birthday party for that special person."
  ]
 },
 {
  "name": "Capitol Center for the Arts",
  "address": "44 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aafc2302-932f-11ea-b1bd-14b31f159f22.png",
  "tags": [
   "music"
  ],
  "link": "https://maps.google.com/?cid=16043827711538245524",
  "source": "GoogleMaps",
  "reviews": [
   "Great venue, wonderful staff of volunteers, comfortable seats, and they even have oversized seats for large people so they don't have to squish into a regular seat and encroach on their neighbors' space. Good view of the stage from almost everywhere. Good selection of snacks that are reasonably priced. This was Recycled Percussion from the top center balcony.",
   "Great venue for music! Volunteers are helpful.The concessions are expensive. Over $2 for a can of Coke. Water as well. Seating in the Lobby would be a nice addition. Bathrooms were very clean.",
   "Good venue, but not my favorite. Getting in and out is tough, bathroom and concession lines typical for a small venue. They do well with what they have. Great atmosphere and great people. I'll still go when they have something I want to see.",
   "Nice place, always clean. Great shows",
   "We've been a few times as part of the Gile series.  They are great!"
  ]
 },
 {
  "name": "Rowell Covered Bridge",
  "address": "1433 Maple Street (NH Route 127) Hopkinton, NH, Hopkinton, NH 03229, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab3caec8-932f-11ea-9d67-14b31f159f22.png",
  "tags": [
   "historic"
  ],
  "link": "https://maps.google.com/?cid=16875002914715662314",
  "source": "GoogleMaps",
  "reviews": [
   "Small wooden historic covered bridge. Nothing special.",
   "Prettiest bridge around but watch out for black flies in May and June",
   "Nicely maintained wooden covered bridge. Check out the water reserve falls right there too! Very quiet area, nice to just listen to the water.",
   "We were looking for a covered bridge while traveling through New Hampshire.  This is a good one because of it's architecture and it is in use.",
   "I love checking out new covered bridges. I'm from Arizona and visit New England every couple of years."
  ]
 },
 {
  "name": "Arms Park",
  "address": "10 Arms St, Manchester, NH 03101, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ab86b030-932f-11ea-b196-14b31f159f22.png",
  "tags": [
   "eat",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14810141163053910062",
  "source": "GoogleMaps",
  "reviews": [
   "Its peaceful, you can get close to the water... It's a nice place to just sit and think or read or whatever you want to do and the foliage right now is amazing...",
   "Spacious. Plenty of parking. Picnic tables to eat at. Restrooms close by. Great views. Clear n easy to follow directions. On weekend events there is no parking meter price. Had an absolute blast at Boston Bruins fan fest for the 3rd year in a row.",
   "Located behind the UNH it's a beautiful riverside area to watch the stream and walk alongside the river.",
   "A nice place to see Merrimack river and you can also find chairs and tables where you can seat.",
   "My favorite city park in Manchester! I like its proximitt to the ricer in the middle of downtown. \nI dont't like how small it is and that it does not connect to any kind of longer heritage trail"
  ]
 },
 {
  "name": "Escape Room Concord NH",
  "address": "240 Airport Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/abcc9312-932f-11ea-b787-14b31f159f22.png",
  "tags": [
   "library",
   "family",
   "library"
  ],
  "link": "https://maps.google.com/?cid=6941389529435469805",
  "source": "GoogleMaps",
  "reviews": [
   "Went here with my colleagues for a fun team activity together. We were all first timers to escape rooms.We ended up experiencing two rooms back to back - library 1 and 2. They were a lot of fun! There was pretty much no downtime while we were there either, we used our entire 2 hours solving the puzzles. The owner / operator was super cool too. Recommend!",
   "It was a challenge. But we had so much fun working together as a team and we escaped!!!",
   "We had an awesome experience at the Concord Escape Room.  I went with my family of 5, cousin and grandparents, and had bought this experience as a gift for them since none have done them before.  It was their first experience at an Escape Room and they were really impressed with the quality of this experience they are not eager to do it again.  Our guide (Leigh) was awesome, friendly, and helpful.  The puzzle was fun and challenging and the place was really professional.  We had a blast and will definitely be back again.  And the photos at the end were a fun surprise and a nice keepsake of our experience.  Highly recommend for everyone!",
   "My co workers and I came to this Escape Room for some team bonding. Most of us had never done an escape room before and weren't sure what to expect but we all had a blast!! We can't wait to go back and try the next room. We were still talking about our experience the next day at work... definitely recommend!!",
   "I went with my husband and two of our friends. We solved the room with four other people who we hadn't met before and ended up getting along super well! It was an awesome way to spend an hour! We did the library room and loved it. Now I really want to try the next room in the series."
  ]
 },
 {
  "name": "Children's Museum of New Hampshire",
  "address": "6 Washington St, Dover, NH 03820, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac16946e-932f-11ea-9d4b-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "learn",
   "kids",
   "history",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=10971674568119292496",
  "source": "GoogleMaps",
  "reviews": [
   "Highly recommend it! Love the display with the metal pins that you can smash your face into and see your image on the other side! Kids love the kitchen, the submarine and the forest tree you climb to see all the animals. Nursing mothers can enjoy some privacy,up in the young children's area above the first floor. A snack bar area provides lunches and treats. Close to Dover must sees like Harvey's and antique shops.",
   "Great place for preschoolers and elementary aged children to explore. Great hands-on and visual displays/activities. Well thought out layout. Definitely worth a family membership.",
   "The kids had a blast at the Halloween event. They made several crafts, learned about history, and even participated in a 'green screen' video! There is so much to learn and do here and it  really is fun for all ages!",
   "Attended their T-Rex Tea Party recently with my 2 year old niece. They put on a terrific event. We're absolutely going to become members!",
   "This is a neat to places to take the young ones. They have some great restaurants and ice cream shops within walking distance."
  ]
 },
 {
  "name": "New Hampshire Telephone Museum",
  "address": "1 Depot St, Warner, NH 03278, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac5dd6d2-932f-11ea-bd03-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "history",
   "kids",
   "history",
   "tour",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=8059109943319214154",
  "source": "GoogleMaps",
  "reviews": [
   "Interesting and we'll presented history of the telephone. This year's exhibit of the telephone in movies was fun. I also enjoyed talking to the knowledgeable ladies at the front desk. Well worth the drive! I hadn't expected to stay as long as I did, and I would have liked to stay longer to read the many informative signs describing each display.",
   "Makes you appreciate your cell phone going to this museum",
   "Since I like history the telephone museum is an interesting place to see the evolution of the phone, reminisce about phones you had when you were young and see different designs. Great place to teach kids about the fact life want always cell and smart phones. Pair it up with the fireman museum just behind it and the look around down Warner you have a nice morning/afternoon.",
   "Great experience. I strongly recommend it. The staff were so helpful and nice. There is a lot to see so leave at least 2 hours. We didn't get to see everything because we had some time constraints. We used the app that you can download for free and it was quite helpful. Gave a good description on the tour around the museum. The firefighters museum for Warner is downstairs. It's apparently moving soon so if you have a chance, after the museum tour go downstairs and look at the fire engines and equipment. That should only take about 15 minutes. Great for all ages.",
   "I really enjoyed my visit to this small museum. I learned a lot from the essentially personal tour my son and I got when we visited during the week in September. There was a lot of information and facts presented in a fun manner and which explained a lot of trivia, like why some of the first area codes got the number 1 in the middle and others got the number 0. Easy to understand how the old switchboards operated, and you can \"ring up\" a mallard phone and hear it quack for it's ringtone. Fun! Absolutely recommended."
  ]
 },
 {
  "name": "Mt Sunapee State Park",
  "address": "86 Beach Access Rd, Newbury, NH 03255, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ac9ae00c-932f-11ea-bc13-14b31f159f22.png",
  "tags": [
   "cheap",
   "food",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=8855314344764699029",
  "source": "GoogleMaps",
  "reviews": [
   "This small gem recently hosted my son's college ski race. The lodge is an old-fashioned classic and the upstairs restaurant is a new-fashioned classic. There the pub-style food was amazing and portions were generous, but the best part was the gorgeous view of the hill. Skiing offered enough challenge for all skill sets and cheap tickets are often available for day-of skiing, so don't be afraid of the advertised $60 lift ticket price tag.",
   "Great mountain. The skiers in my family span in age from 8 to 15 (and me) and this is a great first ski experience. We've been going here for a few years now, in a school program, but I would come here even if we weren't. Not a bad drive from civilization and a wide range of skill/terrain is available. The views from the top are simply awesome, spanning all the way from Vermont's Green Mountains in the west to the White Mountains of NH to the northeast.",
   "Nice ski mountain with great views. Not much in the way of challenging terrain but well groomed. A great family ski mountain not far from Boston. Nice for hiking in the summer with activities like disc golf and ziplines for a fee.",
   "Kinda crowded and the lodge was small & stuffy. However, we were told later that there is a newer lodge that has a good vibe. We will check that one out next time. Otherwise a very pretty place.",
   "This place is amazing, stuff in child care was very nice,my daughter had first time on 🎿 and her instructors in two days did great job, prices are very reasonable,food in lodge great plus my favorite Starbucks coffee 👍  person in rental are professional so highly recommended"
  ]
 },
 {
  "name": "Canobie Lake Park",
  "address": "85 N Policy St, Salem, NH 03079, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/acdfb15e-932f-11ea-8b2f-14b31f159f22.png",
  "tags": [
   "kids"
  ],
  "link": "https://maps.google.com/?cid=10610509446301049783",
  "source": "GoogleMaps",
  "reviews": [
   "Nice little park.  It has some really nice rides.  Not like a Six Flags but Canobie has a much more reasonable price.  We had a great time here.",
   "I had been to Canobie with my mom and uncle when I was 3 years old so my mom and I decided we had to go again since I now live nearby and my oh my was that a lovely experience. Had so much fun looking for things we could remember from back then and enjoyed all the new surprises. Super cute place. Had a blast",
   "We go at least twice a summer. My wife and I love it as much as the kids. Allot of employers offer discounted tickets and employees don't even realize it. We buy passes in bulk in April they my wife's work at half price and they never go unused.",
   "Love it! Best amusement park in all of NH! They have rides for ALL types of people, from swings to vertical drop roller coasters. Just a fun atmosphere! A perfect way to spend the day!",
   "Love this place! It has great coasters and it's very easy to get to! The only downside was it was more expensive that I expected considering it's a pretty small amusement park compared to some other options in New England"
  ]
 },
 {
  "name": "America's Stonehenge",
  "address": "105 Haverhill Rd, Salem, NH 03079, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad256d36-932f-11ea-9e66-14b31f159f22.png",
  "tags": [
   "history"
  ],
  "link": "https://maps.google.com/?cid=1982847238498348869",
  "source": "GoogleMaps",
  "reviews": [
   "We have been wanting to visit for quite some time now and we went on a fairly nice sunny day in early March. When you arrive, you will enter through the gift shop. When you pay for admission, you will then be directed to watch a short presentation of this historical site. (Definitely watch it! It is so informative!!) The price of admission is quite fair and you can either use a paper map and read along with the numbers on the site or you can download the America's Stonehenge app and it will read each site to you and you can proceed at your own pace. It is early in the year and I'm not familiar with how the trails look in the summer, but currently, the leaves are covering most of the site and some of the leaves are a bit wet so be careful when exploring! There are ramps to help people who might not be able to do stairs easily HOWEVER, this is by no means a place that is able to accommodate someone who is wheelchair bound or stroller bound. The sacrificial table was covered and I'm not sure if this is a temporary thing or a permanent thing but it would be cool to see it uncovered. We look forward to visiting again in the summer.",
   "A beautiful place and amazing adventure. We took our 4 year old on February vacation and we can’t wait to go back in the summer. Absolutely gorgeous and everyone was so pleasant and kind.",
   "Thoroughly enjoyed my time here. Ignore the knickknacks in the beginning, they really detract from everything, but just keep pushing past them until you get to the numbered areas.  \n\nPretty amazing to witness, you might leave with more questions than answers, but that's not a bad thing.",
   "Visited there twice in the Fall two years ago, it was very interesting and the short video of the grounds made it easier to navigate the premises",
   "As a NH native and history enthusiast it was only natural that I visited this place sooner or later. I first heard about it on the history channel: \"History's Mysteries: American Stonehenge.\" This year I finally got around to seeing it myself and I wasn't disappointed. The site was expansive and there was so much to see and read. It's an adventure from start to finish. Everyone there was so friendly from tourists to the staff, it was delightful. This place is a gem and I'm so thankful it has been preserved so beautifully. What a curious world we live in. Seriously, check this place out if you love history."
  ]
 },
 {
  "name": "Carter Hill Orchard",
  "address": "73 Carter Hill Rd, Concord, NH 03303, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ad76738a-932f-11ea-b25d-14b31f159f22.png",
  "tags": [
   "kids",
   "eat",
   "family",
   "affordable"
  ],
  "link": "https://maps.google.com/?cid=45307291292923501",
  "source": "GoogleMaps",
  "reviews": [
   "One of my favorite spots to get freshly made donuts and a fun place to take the kids apple picking .\n\nThere is a play area for the toddlers and little ones and so\nmuch to do .\nThey sell a variety of produce and baking i teams inside the store.\n\nAnd dint forget the bird watching area . great spot to look at the raptors!",
   "We had such a GREAT time apple picking!!\nThis place is awesome. The people are friendly & helpful.\nMy husband is in electric wheelchair, he had NO problem getting around Carter Hill Orchard. The pathways are hard packed so wheelchairs, strollers & even wagons get around nicely.\nThey have the best apple cider donuts. Freshly made & warm!!😜\nI highly recommend this wonderful place.\nIt was our second year, we WILL be attending for many years to come🍎❤",
   "Get your complete \"Fall\" fix here!\n- pick apples (they were $1.10 per pound) \n- get decorative pumpkins (small, medium, & large!) \n- pictures on hay bales\n- hayrides (I didn't do this, but saw it was a thing :p)\n- eat warm, cinnamon, sugared donuts :D\n- buy cider, pie, etc. \n\nPicturesque views of the surrounding valley (they even have a small observation tower/stand to give you a better view of the gorgeous landscape).",
   "Great apple picking and terrific hot cider donuts. Nice views and tractor-pulled wagons. Pumpkins and other treats too.",
   "Great place to go. Great Apples,so many trees. Peaches amazing service and people.  Great views it is completely family friendly and affordable. So much to do,from playground to eating amazing apple cider doughnuts. Homemade pies and more. I recommend. They also have pumpkins!"
  ]
 },
 {
  "name": "Robert Frost Farm State Historic Site",
  "address": "122 Rockingham Rd, Derry, NH 03038, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/adb8faf6-932f-11ea-b930-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "free",
   "kids",
   "nature",
   "tour",
   "tour",
   "historic",
   "knowledgeable",
   "tour",
   "field",
   "learn",
   "walk",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=7969503493847159935",
  "source": "GoogleMaps",
  "reviews": [
   "You have to pay if you want a tour of the farm house, but to walk the grounds is free. The hike is easy and well marked. Nice place for peace and quiet, and contemplation. Not really a place for small kids unless you want an easy nature walk.",
   "Finally was able to visit this historic site and it was definitely  worth it. It was very hot today so lucky me  I got an almost private tour. There was one other guest. I'm not  big on tours and I'd rather look around on my own but Randee made the tour very enjoyable. She knew her stuff. After the tour was over I enjoyed the grounds  and even ventured into the woods for a little hiking",
   "beautiful place,  had no idea about the trails in back with many signs with his poetry. i did not do the tour, but the guy in the barn was very knowledgeable and nice.",
   "Robert Frost is my favorite poet, so this was a must-see on our recent New England trip. There is a small museum/interpretive center where visitors can learn about his life and read some of his work. The trail around the farm perimeter is worth the half-hour or so walk. There are several stops with his poetry and the stories behind them, and the field, woods, and stream are very picturesque. This was a beautiful spot with autumn color as well.",
   "Even in the off season with the historic home of Robert Frost closed the grounds and trails offer a wonderful visiting experience. It's truly like being in any of his master works written during his Derry years. At various points on the farm, signs are posted with his poems, all located at points that echo the words. My favorite is as the wood trail separates into two \"the road less taken\" greets you to read and ponder.\nThe snow was deep and snow shoes made the experience possible. Volunteers worked pruning Frost's Apple trees. A very good way to spend a sunny winter day."
  ]
 },
 {
  "name": "LaBelle Winery",
  "address": "345 NH-101, Amherst, NH 03031, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae13c586-932f-11ea-8c77-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "knowledgeable",
   "food",
   "winery",
   "family",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8240535104044059432",
  "source": "GoogleMaps",
  "reviews": [
   "The food at LaBelle is fantastic, and their whole staff is just as wonderful.  I have eaten here a couple of times and have been impressed each time, but this place definitely stood out even more so after my sister's wedding this past weekend.  The attention to detail and courtesy to guests was unmatched.  Olivia, Kristen, and Claire were phenomenal - going far beyond what you would expect from a venue's events staff- I have been to a lot of weddings and have seriously never encountered their level of professionalism and sociability.  Guests have been raving about the wedding ever since, and it was clear that no one wanted to leave at the end of the night. We ended up going back for brunch the next day because the food is so good.  Our waiter, Spencer, was also great.  I seriously think they only hire the cream of the crop here. I would highly recommend this venue to anyone.",
   "I sent my friends to this place with my highest recommendations. I go their often. This recommendation is always successful. The the food there is yummy and the stuff is generous and cooperative. always when we visit this place we enjoy a lovely evening.  I recommend this place with pleasure.",
   "I would love to pick this place up and move the entire thing to my hometown in Wisconsin! Everything was amazing! The food, the wine, our bartender Marie. She was so knowledgeable and friendly. The wines weren’t too sweet like a lot of little wineries in Wisconsin. I need the chicken wing sauce recipe! We are going to stop at they’re other location when we go to Portsmouth. Two thumbs up!",
   "The Bistro at Labelle has become the best restaurant in the region. 2 years ago it was just another place that was all price and not nice. The wine has never failed, but other aspects often did. Slowly but surely in the last couple years it has blossomed. The service is phenomenal, the management engages the guests and is always helping his staff (Ask for Michael, he always makes the trip extra special for you), the atmosphere had completely changed, and it has turned into a top spot for me and my friends. We cannot recommend those lovely restaurant enough.",
   "Hands down my favorite place in New Hampshire! Please do yourself and all of your family and friends a favor and get married here (and feel free to invite me too!) My husband and I got married here on November 2nd and people are STILL talking to us about how awesome it was. Kim was absolutely amazing to work with, as was her entire team on the day of (woo Kristen and Claire!!) Not a single detail was left out and the entire day completely exceeded our expectations. The venue is absolutely beautiful. The vendors they recommend are fabulous and the food is to die for. I am so glad I found this winery and I cannot wait to go back soon."
  ]
 },
 {
  "name": "Manchester Poker Room",
  "address": "1279 S Willow St, Manchester, NH 03103, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ae684e6c-932f-11ea-a1e1-14b31f159f22.png",
  "tags": [
   "food"
  ],
  "link": "https://maps.google.com/?cid=4636908007300499868",
  "source": "GoogleMaps",
  "reviews": [
   "Great place. The food is excellent,and you don't have to drive to Boston to play roullete and everyone is very friendly.",
   "Amazing friendly staff great atmosphere some very cool locals",
   "When I first walked in I was watching the way the first table on left was played. I believe it was Spanish 21. There were 3 lady's at the table. So I was asking the dealer about the game and 2 of the 3 lady's were the rudest card players I have ever encountered. I was told by the players not to play at this table... I found out later while playing New Hampshire hold em that they were regulars.... dom I'm just like why the heck are regulars treating people like this. According to one of the dealers these lady's do it alot. I have never in my life in any card room I have been in been treated like this..Its a bs small town casino that allows regulars to treat people this way. If I go back and this happens again I will never go back... watch your back here",
   "Great fun tournaments,cash games you can win big or lose big all depends on yourself",
   "Great atmosphere "
  ]
 },
 {
  "name": "Budweiser Brewery Experience",
  "address": "221 Daniel Webster Hwy, Merrimack, NH 03054, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aea94f08-932f-11ea-9b66-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "walking",
   "family",
   "music",
   "walk",
   "tasting",
   "free",
   "tour",
   "brewery",
   "free"
  ],
  "link": "https://maps.google.com/?cid=1949226290233618595",
  "source": "GoogleMaps",
  "reviews": [
   "Took our first Budweiser tour last weekend, what a great experience!!  Our tour guide Elizabeth was the best, very knowledgeable and personable. Will definitely request her for our next tour. We can't wait to come back again!!!",
   "My friends and I went on Saturday evening and really loved walking around looking at all the lights and enjoying watching the aerialists, and mostly noticing that everyone - adults and children alike - seemed like they were enjoying the festivities of the season. People were all in good moods and connecting happily with strangers to help take pictures or simply  to wish a Merry Christmas! That made me so happy to witness these joyful moments. 😊",
   "They do such a nice job of making everything so festive, with the lights, music, people working event, and even the concessions are festive and fun. A little pricey for a family, but what isn't these days. I would go again, it's a fun time.",
   "The beermaster tour was well worth it! Plenty of free beer during the tour, and you get to walk through more areas than on the Bud Light tour, such as the canning/bottling floor and your own private tasting  room. Monique was the best tour guide, she really knows her stuff and just loves talking to people! The brewery is very nice and clean, with lots of great things to offer.",
   "So much fun and learned a lot about other beers Bud makes! And you get lots of free beer! Highly recommend"
  ]
 },
 {
  "name": "Hampton Beach State Park",
  "address": "NH-1A, Hampton, NH 03842, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/aeef0b00-932f-11ea-b24f-14b31f159f22.png",
  "tags": [
   "foodie",
   "family",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7899671211773615985",
  "source": "GoogleMaps",
  "reviews": [
   "I loved Hampton beach!   Periodically throughout the length of the beach there are fresh water showers to get the salt off you and public changing rooms and rest rooms. If you are into shopping or a foodie, you will not be disappointed by their shops along the strip on the land side of the beach.",
   "I wish I could give this beach six stars. We went on a beautiful afternoon on Christmas Day with our family. I cautioned everyone to use the bathroom before we went, assuming everything would be closed. Imagine my surprise when we found the bathroom to be open - with heat to boot. Good job, Hampton council.\n\nThe beach as ever was lovely. Clean, well maintained and plenty of parking. We had a great day out.",
   "Great public and state park beach areas.  Good for quiet beach access ( state park ) or more busy beach access with food and fun stuff to do.  Amusements are a bit cheesy but still fun if you want to step away from the beach for a while.",
   "We enjoy Hampton Beach because of everything it is.  Great beach, boardwalk, the strip, entertainment, many restaurants, great place for the family vacation and/or adults. We've been going for years and will continue.",
   "One of the nicest beaches in New England.  Wonderful sandy beach and expansive view of the ocean.  Dunes add character and charm."
  ]
 },
 {
  "name": "Red Blazer Restaurant & Pub",
  "address": "72 Manchester St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af3a3d26-932f-11ea-b2f3-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2195459330823010485",
  "source": "GoogleMaps",
  "reviews": [
   "Quality food prepared with care. Never had a bad meal or experience. The staff is friendly and accommodating. The owners are there and there is a good chance you will meet or see one of them during your visit. Not an absentee ownership group. More beers on tap than anywhere in concord! I suggest eating your meal in the pub and enjoy a sporting event on one of their many TVs.",
   "Great Buffet for breakfast. Fresh Fruit, Pastries. Scrambled Eggs, Egg Lasagna, Eggs Benedict, Bacon, Sausage. Home fries, French Toast, hash.  Omelette station, Crepe station, Waffles and Pancakes. Loved my visit.",
   "Great job with Easter dinner take out!  The food was fantastic and we will be back.  Grateful to have The Red Blazer in our community.",
   "The setting is very beautiful and the assistants were friendly. You can to dine in the pub area or a more relaxing dinner setting environment.  Good food at a great price. We will be stopping by again for sure.",
   "Crispy duck with cranberry relish"
  ]
 },
 {
  "name": "Tucker's",
  "address": "80 South St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/af861366-932f-11ea-a136-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3463488908967800543",
  "source": "GoogleMaps",
  "reviews": [
   "I don’t say this lightly, but this is literally one of the, if not the, best breakfast restaurants that I know of.    And, I do not mean just in Concord or even in NH but anywhere in the country.  You have to put up with a crowd and it is a small place, but they consistently deliver amazing food and friendly service.  Variety of menu choices and never had a bad thing.  Quaint atmosphere.  Coffee while you wait.  This is THE place to go.  For the record, I like other locations I have visited but Concord is far and away the best.",
   "First visit was pretty good. Place is clean and fresh looking.  Food was tasty but plate's arrived cold. Our waitress was the reason this review got a 4 instead of a 5. I watched the waitress across from us making sure her customers were well taken care of while I couldn't find my waitress if I had GPS. May try it once more because of the food but will ask for a different waitress.",
   "This place is well worth the wait. Friendly staff, quick service, and the food: excellent! Fresh ingredients, healthy options, and all your standard breakfast options. Impossible to leave still hungry as the portions are large. We’ve been twice in the last week. Our new favorite place in NH",
   "Was a bit of wait to be seated but since our party was large I didn't mind. Food was tasty and you get a lot for what you paid. Very good deal. Server was nice, our only complaint is they never bothered to refill our drinks unless we called them over. Probably will come again!",
   "We were driving through Concord and I saw several positive reviews for Tuckers & we lucked out that they weren't on a wait until after we sat down! I recomend the French toast sampler (on the seasonal menu)...it was a great option to try all 3 types which were all so good!\n\nFriendly service from Natasha, nice atmosphere, great menu. We want to come back to try more!"
  ]
 },
 {
  "name": "Beefside",
  "address": "106 Manchester St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/afc6fa5c-932f-11ea-ae0d-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=17819586099874433908",
  "source": "GoogleMaps",
  "reviews": [
   "Huge portions of very tasty food. The onion rings are incredible! Light, fluffy and buttery. My Black Russian was overstuffed with meat. The scallops are large and juicy and are filled with scallopy goodness. There's usually a wait to get seated so be prepared and come a bit early.",
   "Their food is so good and very consistent while also not being freezer food. You know you're getting good stuff when you go there. My family has been getting food there for decades. Highly recommend.",
   "We were passing by Concord and pulled off the highway to eat dinner.  We happened upon \"Still Beefside\" (I guess they changed the name with the recent new ownership) and were very pleased with our meal. The service was good, and the food was tasty.  This place is dated and not fancy in any way, but the food and prices are good.  We would eat here if we're in the area again.",
   "Got my Husband hooked! Used to eat there all the time when I was with a Motorcycle Racer who's sponsor was a Freedom Cycles Mechanic. YUMMY Been around a long time which speaks volumes about the food!",
   "If you are looking for a \"North Shore Famous Roast Beef 3-way\" you wont find it here. They say their sandwiches are famous. Perhaps for the locals in NH. I went here in search for the beef that you truly can only find down in Mass. Beefside proved this to be true in so many ways. Roast beef 3 way is pictured. Yellow cheese? not on the bottom? No onion roll? Sauce where? Mayo where? Beef sliced thick? NOT rare?!!. UGH!!! My belly was sad to eat this. My search continues for a place in NH that can do this beef lover right!"
  ]
 },
 {
  "name": "Moritomo Japanese Steakhouse & Sushi Bar",
  "address": "32 Fort Eddy Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b007a1ec-932f-11ea-ba69-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1142291838231632947",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in for lunch and I just love this place! \nThe sushi chef is super friendly and very knowledgeable. The fish is very fresh, especially on Fridays. Probably the best scallop sushi I have ever had. Their mochi is served at the perfect temperature so that it is neither too firm or too chewy. The service is nice and they also have small private rooms.",
   "This hole in the wall Japanese restaurant and bar is so quaint and surprised me with how flavorful their tempura sauce was, how neatly packed their sushi was, and how beautifully their mixed drinks were served. There was a particular patron that diluted the experience by talking very loudly at the bar. Also, Moritomo would do well to clean their from sign or get a new one.",
   "Decent food. Hibachi was full and sushi was fresh. Drinks and service had room for improvement but they were not rude, just overstaffed. All in all good food. Good atmosphere. Certainly worth a look",
   "We are regulars here. The sushi is always excellent. The crunch spicy scallop roll is out of this world. If you like more spice try the Alvin roll. The hibachi is always fun as well. Our kids love it just as much.",
   "A HUGE selection of food, authentic, great seasonal selections. They have some nice isolated rooms where you can kneel and enjoy your meals as well. Everyone's SUPER nice. Highly recommend."
  ]
 },
 {
  "name": "Revival Kitchen and Bar",
  "address": "11 Depot St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0554d00-932f-11ea-89bf-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18126503459220262658",
  "source": "GoogleMaps",
  "reviews": [
   "I celebrated my PhD yesterday in this great place. I am glad to say that we passed a awesome evening and the restaurant was absolutely one of the reasons for the strong evening. The crew  contributed in a sweet manner, the meals were great and my friends were so  happy. We shall absolutely visit again for more joyful events. Thank you very much.",
   "Amazing hidden gem. Scallops were made to perfection. The catch of the day was Monk fish which was amazing. We finished with peach and blueberry crumble which was great, but the best was strawberry foam. It is served in a little glass jar, and is to die for. Google lists the place as $$$, but I found it almost underpriced.",
   "Fantastic staff, great selection of drinks. Laid back atmosphere but high end at the same time. The other best part is the food! Out of this world. And specials that will leave you wanting to come back for more. Just amazing.",
   "Great food with a modern atmosphere. I had the butternut squash risotto which was wonderfully filling and tastefully plated with a small arugula goat cheese salad. For dessert my date and I both had the Mexican chocolate creme brulee, which was delightfully chocolatey with a barely-there kick that was poetically appropriate for a dessert. I'll definitely go back again soon.",
   "have been here several times - each time I was consistently very happy with the service, gorgeous presentation of food, and overall taste and experience. the food and drinks here are rich, in the best way. this is a special place that I enjoy bringing guests to, and everybody is always super impressed and satisfied when we leave :)"
  ]
 },
 {
  "name": "Granite Restaurant & Bar",
  "address": "96 Pleasant St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0993fae-932f-11ea-a848-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=10452356905079126521",
  "source": "GoogleMaps",
  "reviews": [
   "Lovely meal with fantastic service. This was our first time here, and we were pleasantly surprised. We came because our other favorite restaurants had long waits on a Saturday at lunch. There was abundant parking and we were seated immediately. We had the apple parsnip soup with crab cake BLT, and clam chowder with Caesar salad and salmon. Everything was fresh. The soup was hot and delicious. The crab cake was so fresh. We will be here again. Thanks Granite.",
   "Wow! My husband and I are foodies and love to travel and try new places. We loved this place! The food is delicious & presented beautifully. The staff are all knowledgeable and wonderful. We will definitely be dining again soon!",
   "The food & portion sizes were on point though certainly expensive. I enjoyed a filet & the seasoning on the cut of meat was excellent. The lamb was also extremely tasty.The customer service was good. I found the atmosphere to be a bit \"lacking\" .... especially considering the location, it just seemed a bit generic or lacking in character.",
   "Overall good food and experience for a special night. Mozzarella app was great as well as spirits. Wife got the scallops which were large with a side of veggies...very good. I ordered the full filet medium rare, it came out medium well if not well. Mashed potatoes were loaded with salt, and this is coming from a salt guy. I'm not one to send food back to the kitchen as I work in the industry during summer months. Would definitely recommend and would go back.",
   "This is like a hidden gem. Great food, very good service and nice atmosphere (a few days it has live music). Highly recommended in Concord."
  ]
 },
 {
  "name": "Angelina's Ristorante Italiano",
  "address": "11 Depot St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b0dafa5e-932f-11ea-baa8-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7114726210295257269",
  "source": "GoogleMaps",
  "reviews": [
   "I'm jealous of all the people who apparently had a great experience here. We had a waitress with glasses and gray hair who was not pleasant. She was clearly stressed out and not managing her tables well. When we asked for recommendations, we were simply told that everything was good. The dishes were filthy. The tablecloth was stained. We were given cold bread. We waited an hour and fifteen minutes for an appetizer while the table who arrived after us (party of two as well) were finishing their dessert. The soup was cold and bland. Our waitress not once apologized for the wait nor acknowledged us while we waited for the appetizer. A waitress from a different section (young, dark hair, hoop blue earrings) noticed that we were being ignored and checked on us. She was the only good thing about our meal and she wasn't our waitress. Then it took another 30 minutes for dinner and it was not worth the price. The risotto was crunchy. More dirty silverware. First time and last time.",
   "The food is amazing! The scallops almost melted in my mouth. The sauce might be one of the best I've ever had, it matched the pasta beautifully. I would highly recommend going!",
   "This site is my number one restaurant.  Of all restaurants I know I like it most. I never miss an opportunity to go to this restaurant. when  I I need a decent dinner, this is the place that comes immediately to my head. extremely good and many types of  food and a large menu.trained team, and agreeable atmosphere. And very important, the pay is modest. I suggest this restaurant with great pleasure.",
   "Angelina's is the best Italian restaurant north of Boston. The food is excellent, so difficult to choose from the luncheons/dinners on the menu  the waitstaff is professional,  attentive, accommodating, wine selection cannot be beat, and try to decide what you'd like for desserts (all made on premise), so yummy. If I could, I'd give it 10 stars. Thank you to the wonderful chef and the employees who help to make it our \"go to\" restaurant.",
   "Food and atmosphere were splendid, as usual.  Only downside was the server seemed in a hurry to get us out the door even though we had a reservation and we'ed been there less than an hour."
  ]
 },
 {
  "name": "Margaritas Mexican Restaurant",
  "address": "1 Bicentennial Square, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b12d4bdc-932f-11ea-9205-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2749358794695251442",
  "source": "GoogleMaps",
  "reviews": [
   "Had a great time, our waitress Stephani was amazing! Her sense of humor really was on point and she made sure everything was just right. The blood orange margarita was very good as was the \"Mexican flag\". If you are looking for good Mexican food in a lively atmosphere I'd recommend coming here!",
   "1st time wandering through streets of Concord NH on our road trip today. Stopped in to celebrate National Margarita day. I would recommend the Black Cherry margarita for sure!  We had a great time having lunch in the old jail cell. Our waitress Stephanie was wonderful, sharing stories of the area (we asked a lot of questions!). We’ll be back for the patio season no doubt!",
   "In today's world with a ton of food and drink options, it's the wait staff that truly makes the dining experience. Our server Steph was amazing! Friendly, helpful, and the reason we will definitely be coming back! The food and margaritas were great too. I have long been a Margaritas fan and this was by far my favorite Margaritas experience to date!",
   "Very cool concept, being. The food was decent as well. Not my favorite Mexican place near here, but a very cool place to take guests. Our kids loved the novelty of the jail cells. ☺️",
   "We have been going to this restaurant for many years. Over the years we have celebrated many birthdays and other occasions. The atmosphere is perfect for a celebration of many or just two. The staff has always done there best to make our time with them great. We have enjoyed numerous menu items and drinks. Of course we love their salsa."
  ]
 },
 {
  "name": "Ichiban Japanese Steakhouse & Sushi Bar",
  "address": "118 Manchester St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1850a52-932f-11ea-99c6-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2703948711654691216",
  "source": "GoogleMaps",
  "reviews": [
   "Very good restaurant. Enjoyed the hibachi with family and friends many times.\nIt can get a bit hectic when the hibachi tables are busy. Seating in the restaurant is a little more laid back.\nThe sushi assortment and specialties are tasty. Try the Golden Roll.\nThe cooks at the hibachi are very skilled and put on a good show.",
   "I celebrated my nomination earlier this evening in this gorgeous place. Well it was a fantastic evening and the venue was unquestionably one of the reasons for this outstanding meeting. The waiters  contributed in a pleasant style, the cooking was tasty and my friends were very  happy. We shall definitely return for more joyful events. thanks very much.",
   "We sat in the hibachi section. Very entertaining. Food was fresh, portions were ample, not too spicy. Kid friendly.",
   "We love the hibachi. It is fun and the food is delicious! (Review written by my 8 year old :D )",
   "Hard to pick from the extensive menu. Service is good, not great. Food is reasonably priced. Easy location to find. On a very busy road so be careful entering and exiting."
  ]
 },
 {
  "name": "The Common Man Restaurant",
  "address": "25 Water Street Use 1 Gulf Street for GPS, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b1e5ef4c-932f-11ea-b7f2-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "food",
   "delicious",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5850913247457348231",
  "source": "GoogleMaps",
  "reviews": [
   "Really hearty meal. All food was very tasty. I would recommend the Chowder, the Nantucket pie and the Pot Roast. Also the staff was very friendly and welcoming. Definitely worth visiting.",
   "Great service and a cool atmosphere. Downstairs there are old comics, Life Magazines, and local products for sale as well. Food was great and nicely plated! Great selection of domestic and local beer. Scallops were cooked perfectly! Veggies were a bit well done, but I overlooked that...because the scallops were PERFECT! Crab cake was also amazing and cooked perfectly.",
   "Food was delicious. BF had the pot roast which was really good. Broccoli cooked just right. Not mushy, not hard. The only thing I didn't care for was the no personality young man that greeted us. I tried to engage him but got nothing back. But I'd definitely go back.",
   "Best service for take out.  Prime Rib and Mac And cheese we called in for take out and we got a full meal with dessert.  Food was great, service was beyond good.  Best dinner ever \nThank you To all employees at Common Man.",
   "A great restaurant. The food was very delicious, the salmon salad, the burgers and the cake were all well made and special. The design of the place was nice and catchy. On top of that THE SERVICE; from the moment you walk in you will be greeted with smiling waitresses, and the service at our table was superb. Arial with her lovely laughter and positive energy added to the experience a great value. A place that I would go back to for sure. Well done everyone"
  ]
 },
 {
  "name": "O Steaks & Seafood",
  "address": "11 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b22b03d0-932f-11ea-9a9e-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17765501806858407397",
  "source": "GoogleMaps",
  "reviews": [
   "I celebrated my birthday yesterday in this gorgeous place. Well we enjoyed a delightful evening and the place was no doubt one of the reasons for this strong evening. The crew  contributed in a graceful way, the cuisine was yummy and my buddies were so  glad. We shall absolutely return for more events. Thank you very much.",
   "While traveling for work I came across O Steaks & Seafood. The service is great.  This place is really clean.  I had the salmon which was cooked perfectly. I sat at the bar but the dining area was equally impressive as well as the outside seating. I wish I would have found this place on first night here instead of my last.  Hoping I have to come back this way soon just so I can come back again! If you are wondering if you should go here.... please DO!!!",
   "So let me start by saying \"WOW!! AMAZING!!!\" This place has some of the best food around!! A but more expensive than most places but the extra money spent is well worth it!!! This place will not disappoint all the way from the decor to dessert. Great service! Amazing food!! A place you will love and will always want to come back for more! Enjoy!!",
   "If I could give the O pops a 10 star rating I would. But in all honesty... I have been here quite a few times and everything I've had here has been perfect. Highly Recommend.",
   "Only our second time there but the food was delicious... My recommendation is to go for lunch based on the menu prices. You still get most of the same dishes with a decent amount of food but alot cheaper. You also don't have to wait for a table and the service was great! Try them out if you're in the area, you will not be disappointed..."
  ]
 },
 {
  "name": "El Rodeo Mexican Restaurant",
  "address": "22 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2777662-932f-11ea-aa26-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14762713499410696206",
  "source": "GoogleMaps",
  "reviews": [
   "Ate every last bite because it was so good! I would have given it 5 stars but we waited at the table forever before we were asked about our drink order. By that time we had scoured their elaborate menu and were ready to order! Food was great.",
   "I love the guacamole here.  The service was a little slow in the beginning today but they were very busy.  I highly recommend the Cadillac margarita!",
   "Great food. Fantastic drinks. A level 7 margarita with some reposado is fantastic. Highly recommend. I'm never disappointed here!",
   "My experience here have always been great. Margaritas here are awesome ! And never disappointed with their food so far. Good for both Lunch and Dinner. Will be back soon.",
   "Best Mexican food in the capital region by far. Always fresh ingredients and perfect portions.  Staff is attentive and friendly. Prices are moderate but a good value for the quality of the food served."
  ]
 },
 {
  "name": "Sunshine Oriental Restaurant",
  "address": "121 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b2bd3798-932f-11ea-8f10-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18061051103425797530",
  "source": "GoogleMaps",
  "reviews": [
   "I celebrated my birthday yesterday in this delicious restaurant. I am glad to say that we passed a cool evening and the restaurant was surely the reason for this happy celebration. The crew  contributed in a gorgeous style, the food was appetizing and my buddies were extremely  happy. We shall surely come back again for more events. Thank you very much.",
   "Really chinese in a long time. 3X BETTER THAN DC area. Soup was good.",
   "You must try this place. Excellent food and service. Owners are very friendly.\nTry the dinner combo plates...perfect foods!\nPuPu platter is a great choice as well.\nHot tea is always flavorful and the Hot & Sour soup is one of the best I have had.",
   "Was recommended this place by someone local. I have to say Tina is very nice and the food was absolutely amazing! If I stay in this town this will be my go to place she helped me find something new! So if you don’t know what you want Tina wi help you! Those shrimp dumplings where amazing!",
   "Owners are so nice. Tina remembers every customer's name! The food and dim sum are great. This is the only Chinese food place we go to."
  ]
 },
 {
  "name": "Constantly Pizza",
  "address": "39 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b302c2a2-932f-11ea-8e0a-14b31f159f22.png",
  "tags": [
   "hike",
   "eat",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=6147104615770211754",
  "source": "GoogleMaps",
  "reviews": [
   "I cannot express how much I love Constantly Pizza. I live in Epsom but will gladly make the hike to downtown Concord to get a slice (okayyy, maybe a whole pizza). The service is good and the pizza is even better. The cherry on top: their store smells like heaven.",
   "Constantly Pizza has probably been my favorite pizza restaurant in Concord so far. The sauce and cheese have simple flavors that allow the other toppings to speak for themselves. It isn't  greasy, I mean, some grease, but not a lot. The healthy amount of grease for pizza.\n\nMy 8\" sub was also a ton of food, and it nearly made me explode eating it all. I almost thought I wasn't going to be able to eat the chocolate dipped cannoli. Almost.\n\nBut I powered through, and that cannoli was amazing. 10/10 on the dessert. Overall, I am happy with my trip here! 8/10",
   "Ordered \"well done\" chicken wings. Three of them were uncooked and had to be thrown away. The pizza was good, but we now know where NOT to go for chicken wings.",
   "Awesome lunch deal the day I went. 3 slices and a drink for under 6 bucks! The slices are thinner than your average slice but was excellent for trying different toppings. The plain cheese was bomb dot com.",
   "Great pizza and subs and a great crew running the place.  We order here for work functions quite often and we can always depend on timely delivery with the correct order.  Pizza is some of the best in concord,  well worth a try."
  ]
 },
 {
  "name": "Siam Orchid Thai Bistro",
  "address": "12 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b34841c2-932f-11ea-95b1-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4620778328959556338",
  "source": "GoogleMaps",
  "reviews": [
   "We arrived at this restaurant for dinner. This spot was recommended to us by a friend.  Well, it was a winning. The staff welcomed us with a smile and we felt good. The food was just great. We enjoyed every moment and we will definitely return to this restaurant. Highly recommended.",
   "Great little cozy spot. My dad and I got pad Thai, the crispy chicken was particularly good. They had a little tray of spices that really kicked things up a notch. Friendly staff and nice interior design. Also a giant menu so even the oldest of people can read it, a nice touch.",
   "I love the Thai food here. It is the best I have had in NH. Cute little location as well. Their coconut soup is wonderful. I also recommend the seafood dynamite. The staff is friendly.",
   "I eat a lot of meals at Concord restaurants.  Siam Orchid ranks as one of my favorites!  They have a wide variety of Thai food.  The staff is very friendly, the food comes up promptly, and the flavors and portions are always very good!",
   "Delicious food! Got the pineapple fried rice and the mango curry, and both were really fantastic, not too spicy at all which was nice. Looking forward to the leftovers tomorrow!"
  ]
 },
 {
  "name": "Cheers Grille & Bar",
  "address": "17 Depot St #1, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b395c5de-932f-11ea-8588-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "family",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9967078245300282182",
  "source": "GoogleMaps",
  "reviews": [
   "Everyone at our table enjoyed most of their food.  Not sure why I could not have a cup of soup instead of one of the listed sides.  I was willing to pay an upcharge.  I had to buy a cup of soup and my husband took the fruit cup side ... which was not sweet at all.  My husband ordered tea and it did not taste right.  He had to pay extra to get his drink switched to soda.  Again, most of the food was really good but the small things that were not right made the dining experience annoying.\nUPDATE:  Made a return visit.  It was our server's first day at work ... she was GREAT!  I tried out the fried fish and it was EXCELLENT!  Today's visit was a solid five stars.",
   "Very good food, great menu with lots to choose from, great cocktails and family friendly. Waitstaff is attentive and friendly. You will not be disappointed.",
   "Food was pretty good overall. Steak was slightly overcooked but looked and tasted very flavorful. Had a stuffed haddock dish that I sent back because it was still cold in the middle but they were very nice and understanding. We will definitely go back again sometime. It's a cozy worn in place but still fun for date night.",
   "This place is always a top notch !\nThe entire menu is good.\nTry the adult Mac n' Cheese ...YUM\nPatty Melt is the best around!",
   "Cool atmosphere. Food was very good. Ser or was super friendly but was responsible for the whole outdoor area so it took her a while to get to us. Overall a very good experience and very good food. Would recommend if in the area."
  ]
 },
 {
  "name": "LongHorn Steakhouse - Curbside To Go Available",
  "address": "217 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b3e51052-932f-11ea-b3c8-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11717982353326125731",
  "source": "GoogleMaps",
  "reviews": [
   "Busy place.  One of the best flavored steaks I have had in ages.  The steak was preceded by a nice loaf of bread.  Staff was courteous and entertaining.  We had a guest with a lot of food allergies.  They went the extra mile to ensure the individual was properly treated and served.",
   "Most of the food was very good, but I think the prices were quite high. For example, we paid $22.49 for four small grilled lamb chops. A bit more reasonable was the LongHorn Steak Tips (12oz.) for $15.99. All totaled we paid $69.72 (not including the tip) for 3 entres and one iced tea. \nI chose the \"Loaded Idaho Baked Potato\" as my side dish. It wasn't as \"loaded\" as I expected and a bit dry. I had to ask for more sour cream to make it work for me. The service was good, but not exceptional. The atmosphere was pleasant, especially if you like a cowboy ranch theme. Next time I would choose to go to an all you can eat buffet for $20 less.",
   "They treat you well with bread at the table and great service. I had a bone in rib eye and they come just short of the fifth star due to a chewy steak. I ordered medium rare and they nailed that target. Why was it tough? - I don't know - maybe we're looking at the quality of the cut of meat. Our friend had prime rib and he was in heaven.",
   "Always a good meal here. Usually very tasty cuts of meat. Service is on the ball! Great portions and presentation.",
   "I love the food at Longhorn. Good steaks at reasonable prices. I like it way better than Texas Roadhouse which is so noisy and obnoxious. Longhorn is geared more towards a nice dinner for family or friends. I only wish they had more vegetable sides, most of the sides are potatoes."
  ]
 },
 {
  "name": "Vibes Gourmet Burgers",
  "address": "25 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b428d022-932f-11ea-9d0e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2600654905611771374",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious burgers with interesting options for toppings. The poutine fries were okay, better the first time we went over a year ago.",
   "Honestly one of the best burgers I've had!! As my son put it, \"my stomach was jealous my mouth got it first!\"  The burger was cooked to perfection, with the perfect amount of seasoning and juicy but not greasy.  If you haven't eaten at this establishment it's a definite must!  This place has it all great food and an awesome staff.",
   "I want to start off by saying that that we got there at opening so keep that In mind. So we walk in and they hand us menus to look over quickly before we order like five guys style but supposedly nicer but within two minutes of getting there one of the employees discovers the fridge was at something like 68 degrees and all the chicken products were spoiled. We are not too disappointed because we wanted burgers so we order anyway. Are burgers arrive relatively quickly. I ordered my burger medium(what I always get) and I bite into and am eating and it’s cooked pretty well but about halfway through I realize it’s cold. Pretty disappointed!",
   "Great little place for hand cooked fresh burgers and a small selection of local craft beers. After you eat here, you can to to the other side for some gelato! The service here isn't fast - so don't expect speeds like the fast food burger chains. The environment is nice and relaxed, no need to dress up here. Parking is available in the front on the road, or on the parking garage in the rear (accessed from another road).",
   "Great burger/sandwich place with local meats and tasty sauces. Their unusual burger lives up to it's name and they have made fresh veggie burgers as well. Their poutine is delicious and they usually have a pretty good tap selection. Try their milkshakes as well, or pop next door for a Sunday after your burger!"
  ]
 },
 {
  "name": "The Newell Post",
  "address": "125 Fisherville Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b46ff7ee-932f-11ea-8f9d-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12051413918489203897",
  "source": "GoogleMaps",
  "reviews": [
   "This place never disappoints.\nBreakfast is especially good.\nTry the Sausage Biscuit and Gravy and the Tortouire Meat Pie in an omelette...YUM.\nOh yeah great desserts.\nDo not miss this place. Very busy on the weekend morning's but we'll worth the wait!",
   "Amazing place!! The corned beef hash is homemade along with the bread! Crabcake and the meat pie were delicious!",
   "Always excellent food-home made bread and pastries as well as other delicious breakfast plates. Prices are good and the service is great! You won't be disappointed!",
   "First of all, I'm a Southerner and we kind of dominate the realm of breakfast, and I was surprised to see some very southern dishes on the menu. I was told the restaurant was very good, and it's true. They must have some Southern boys in the back! I've had country fried steak that wasn't half as good as what I got here. I was very pleasantly surprised. The grits were decent! The corned beef hash is absolutely AWESOME and made old school. This is a really good restaurant for simple American breakfast and brunch food, and perhaps a great reminder of home for any Southerners in the area.",
   "I have tried this place several times (sporadically) hoping that it might get better. I think today was my last visit for breakfast. My mother had an omelette that was unable to be eaten due to the eggs being very undercooked. My son and I both ordered the Hash Benedict. The hash was not hash, it was a bunch of shredded, dry and very overcooked corned beef and 4, yes 4 tiny chunks of potato. I would rather have eaten canned hash. Our server, Briar, was really great about it. It isn't her fault after all, she didn't cook it. Briar took the omelette off of the check and took 50% off of mine."
  ]
 },
 {
  "name": "Dos Amigos Burritos",
  "address": "26 N Main St #4912, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b4b5daca-932f-11ea-9ab8-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2002663668051478505",
  "source": "GoogleMaps",
  "reviews": [
   "Easy 5 stars!  I've been craving tacos like I've had visiting Texas... And this hit the spot!  Easy one of the best fish tacos and definitely the best chips and guac I've ever had!",
   "Dos Amigos was a cute little spot. I decided on the burrito. I substituted the black beans for refried pinto beans. The chicken was good. They add a twist with coleslaw on the burrito. I personally feel that there was too many flavors on the burrito to taste just one or two. The sauce was somewhat sweet. Not expected. May dine again due to convenience and speed of order.",
   "Nice to have a local burrito shop with friendly staff and consistently great food. \n\nVegan options. Beer. Great view of Main St.",
   "Everyone was so friendly and the food was delicious! We had a few food substitution requests and they were so accommodating. Food came out fast and everyone loved what they got.",
   "Delicious, reasonably priced food, in a casual atmosphere. Great vibes with beautiful artwork for sale by local artists. Next time in Concord, I'll visit again."
  ]
 },
 {
  "name": "Makris Lobster & Steak House",
  "address": "354 Sheep Davis Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b502e9c2-932f-11ea-be38-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=9135520117330715095",
  "source": "GoogleMaps",
  "reviews": [
   "Why does it seem like every Seafood restaurant that exists in the state of New Hampshire seems to not know how to make real New England style Tarter sauce. Seriously you would think that any New England Seafood restaurant that wants to be well respected would at least get their Tarter sauce right, but NO, not in New Hampshire. Anyway, honestly, even mixing sweet gherkins relish with mayo, would make a better Tarter sauce than \"Makris\" awful, bitter, nasty tasting Tarter sauce, yuck! Oh' and I know some of you might say, why make such a big deal about Tarter sauce, cause without providing a good tasting Tarter sauce, you simply will ruin the rest of ones meal. Yeah, things like... Sweet Whole Belly Fried Clams will taste awful, if the Tarter sauce is terrible, and in this case that is what we exactly experienced!!!",
   "It was a last minute decision to stop by on the way to the lake. From the outside it’s looks nice and with all the bikes outside you might think it’s just a biker bar but when you enter the restaurant it is quite large. \n\nThe decor is a bit campy but clean, nothing fancy. The servers were very nice and helpful and my lobster was fantastic. Of course it’s  kinda hard to screw that up:). Toni had steak tips which were cook exactly as she ordered them and the quality of the meat was very good. \n\nI don’t think there’s any question the quality of the food is excellent and I saw the owner walking around constantly, which is always reassuring.  He appears to run a tight ship. \n\nThe bar was packed on an early Friday evening.  Live band setting up so they have a good bar following.  Looks like a favorite place for bikers traveling 106. \n\nDefinitely worth a try.",
   "Lobster roll was okay, crab cake was excellent, scallops were well done and the smelts were a bit overfried. The fries however, amazing. Crispy and lightly salted. Service was good. Decent meal with reasonable price.",
   "I enjoyed this restaurant. I got the fried native shrimp and native clams half and half dinner. The native clams were market price for $10 a half.\n\nOverall it was pretty good. We had a big party and they were easily able to sit us inside. I have been previously as well and sat on the deck. The deck has its own bar which is cool.\n\nIt can get really busy around race weekends with Louden being so close, so be prepared for that. Also your GPS may bring you to some back road to get there and you won't be able to actually pull into the restaurant parking lot. You'll have to go back to route 9 and then head north on 109.",
   "The ribeye steak I had was great and the price is very reasonable. My only complaint is that I wanted prime rib, which I was going to have rare/ medium rare, but was told it was already all cooked at medium. It was disappointing because you can always cook it longer by request, but once it is cooked you can’t go back."
  ]
 },
 {
  "name": "CC Tomatoes",
  "address": "209 Fisherville Rd, Concord, NH 03303, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b54745ae-932f-11ea-a099-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "walk",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16108514258650403103",
  "source": "GoogleMaps",
  "reviews": [
   "This is our local go to dinner place. They have friendly staff and a comfortable atmosphere. Good selection of options and the food is always good. Very reasonablely priced as well. Overall absolute great dinner spot.",
   "Absolutely fantastic food! My mom and I happened to stop in here and we are both chefs, absolutely amazing food! Cozy atmosphere and waiter was nice and outgoing! Highly recommend! We had the soup special which was the beefy potato corn chowder and it was outstanding, we were raving about it!",
   "The menu and service were ahead of my expectations. We really liked the vibes of this place. Excellent place to take the family out for dinner.",
   "I can't say enough good things about this place. Service was great. Our waitress, I believe it was Katija, was excellent. We placed our drinks and apps which came out in no time. The calamari and mozz fritters were awesome. The best calamari I had in a long time. Perfectly cooked. I had the prime rib which was cooked perfectly. Tender, juicy, and great flavor. Definitely come back again.",
   "We will be going back. This was our first visit, and it was so difficult to select a meal. Incredible reasonable prices. Friendly from the moment you walk in, until you leave. It is like you were family. I had the chicken pesto panini. I like a bit more punch to the flavor in my food, but overall it was all good food. Next time, and there will be a next time, I will add a bit of sauce. Soup/salad and sandwich for under $10!!"
  ]
 },
 {
  "name": "The Windmill Restaurant Inc.",
  "address": "172 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b590ab0c-932f-11ea-b070-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=533017625307318526",
  "source": "GoogleMaps",
  "reviews": [
   "It's been years since I've been there for a meal! It was fantastic! The customer service was pleasant, the food came super fast, large portion size, and was served hot. The atmosphere of the restaurant was family-like, peaceful with conversations happening at each table but you could still communicate at your table without speaking over all the other conversations. I would recommend this restaurant and I will return myself.",
   "Family environment. You feel it as soon as you enter the door. Whether it is your first visit or you go there regularly, you are greeted as if you you are coming back. With that said, just relax. You can enter from either side of the restaurant, they will keep track of who came in when. There can be a wait during normal dining times.\n\nThe food is good, home style cooking, no matter what meal you order. The prices are very reasonable. The staff here is a mixture of your brother who handles everything but you might need to ask twice; mother who will ask you three times if you have everything; sister who rather be some where else but will be fast, attentive, and takes the time to dialogue with you; and the aunt who knows everything that is going on even if you are not her table, she has what you need covered.",
   "Used to come here when I was a kid with my grandparents. Always loved it. Now as an adult I have been back to new Hampshire for vacation and this place was on my list. Everything I ordered here was delicious, the service was quick, attentive and friendly and the food came fast! They're always busy but it didnt effect any of the servers or cooks. Would recommend!",
   "We love getting breakfast at The Windmill! Their staff is friendly and prompt and the food is home-cooked goodness! They are accommodating for small children and have plenty of parking.",
   "Really like the Windmill! I’ve been a lot. I’ve had a few eh experiences but they almost always fix something if it is wrong! The food is inexpensive and super yummy, exactly what you’d expect for breakfast food. Love the homefries. All about em."
  ]
 },
 {
  "name": "Whiskey & Wine",
  "address": "148 N Main St #4917, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b5e9eed2-932f-11ea-af77-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16312966939061469844",
  "source": "GoogleMaps",
  "reviews": [
   "The ramen was great. Loved the roasted cauliflower.  Our waitress was attentive. The gal bartending need to turn down the volume.  Her voice was too loud.",
   "We stopped here on our way up to the mountains. We had their lunch special, choose a lunch size ramen and choose a bao sandwich for just $12. Very cool atmosphere and both the waitress and the chef were super nice. We will definitely be back soon! Worth the 45 minute drive for us.",
   "Always great food here, I’m always surprised they aren’t busier. Maybe it’s the location. But never a bad meal! Homemade food, small plates and ramen are amazing. Drinks are always delicious.",
   "Really nice vibe. great drink list and very interesting food choices. But it would be nice if there were more options with large portions. Your best off ordering two things off the menu.",
   "Delicious cocktails. Convenient location downtown. High recommend for a relaxed evening out."
  ]
 },
 {
  "name": "Puppy Love Hot Dog",
  "address": "50 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b644924c-932f-11ea-abdc-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=5902664045123057145",
  "source": "GoogleMaps",
  "reviews": [
   "The food was excellent! Very fresh and lots of choices of toppings for the dogs.  Best deal in town.  Family owned so we were happy to be eating local :)",
   "If you're looking for a great lunch great staff the owner as an awesome person the food is delicious reasonably priced this is a place to go support your local business and if you're a tourist this is a spot to go for some good old-fashioned American food yummy yummy",
   "If your in Concord and are craving a good hot dog try Puppy Love Hot Dog right in the middle of downtown. It's the hole in the wall pervayor with that little extra something I like to call heart. The dogs are delicious, and the service is always with a smile. I've enjoyed these hot dogs for years and years. You should definitely make a point of trying them out. There's lots of great toppings I recommend a chili cheese dog.",
   "Good dogs.",
   "Excellent service, great dogs"
  ]
 },
 {
  "name": "Gas Lighter Restaurant",
  "address": "204 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b68df77e-932f-11ea-a4ce-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=5642184647661553689",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped here after hot yoga in Concord.  Lots of Greek food choices; l chose lemon chicken soup and their stuffed cabbage Greek style with a salad on the side.  Pretty tasty!  (Ground pork, rice and diced pepperoncinis in the cabbage.) The place filled up as it was lunch time.",
   "Beer served in frozen mugs. What more can you ask for!? Awesome bar!",
   "Delicious food!!! Very friendly people; both staff and other regulars. Everything made on premise. One of the oldest restaurants in Concord. I will be back next time I dm in town!",
   "Always a pleasure.....Beef Stew was sublime.",
   "Food and drinks were perfectly as expected! Great job!"
  ]
 },
 {
  "name": "Willows Plant-Based Eatery",
  "address": "55 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b6e3dff0-932f-11ea-b4cd-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11016767872310967148",
  "source": "GoogleMaps",
  "reviews": [
   "The homemade blueberry lemonade was everything! The food was very good with cute catchy names for the dishes",
   "My first time there and it will not be my last super good I loved the salad and the broth of the soup",
   "Absolutely delicious and EVERYTHING IS ORGANIC!!! Great service and ambience. This is my new go-to restaurant in Concord.",
   "Only good option in the area for vegan/vegetarian. Kind of bland in flavor, but still ok.",
   "I had the half moon sandwich and it was INCREDIBLE. I don’t now how that was vegan. The food came quickly and a dog kept me company while I waited. What more could I ask for? I can’t wait to go back for more."
  ]
 },
 {
  "name": "Veano's Italian Kitchen 2",
  "address": "30 Manchester St #3, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b72e7dc6-932f-11ea-b3ba-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "food",
   "family"
  ],
  "link": "https://maps.google.com/?cid=2991475904586571148",
  "source": "GoogleMaps",
  "reviews": [
   "Eggplant parm and French onion soup were delicious!! Great portions. Highly recommend. Thank you for delivering!!",
   "Marinara sauce WAY too sweet, should have stayed home and had Newman’s jar sauce. Reminded me of Greek cuisine. Salad was poor and service was too. On a positive note, premises was very clean. Haven’t been to a Veano’s in many years, now I remember why.\nAmazed at so many good ratings, we dine out often and know fine dining, this isn’t it.",
   "The customer service was great! The homemade italian food my boyfriend loved the lasagna. The potato skins was huge and good. Mozzarella sticks were good. Chicken wings and strips were yummy! The pizza was delicious! I wish I could have tried more. Great service and food! What more could you ask for",
   "Best breakfast in town! Steak and eggs were top notch. Friendly and efficient staff are the best. Family owned and operated, they do a great job and the atmosphere is perfect. 5 stars!",
   "Great service and the best hollandaise sauce I've ever had!!"
  ]
 },
 {
  "name": "Primetime Wellness Club",
  "address": "117 Manchester St #4A, Concord, NH 03301, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b778584a-932f-11ea-93b0-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "walk",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=2072132706643383261",
  "source": "GoogleMaps",
  "reviews": [
   "I'm just one of their drivers that delivers some of their ingredients and they are some of my nicest customers I have, they always greet me with a smile and sometimes a delicious drink! Haven't tried much else besides the tea but it is one of the best teas that I've had and definitely helps with the morning kick I need! 10/10 Would recommend! Super nice, and great drinks!",
   "Great heathy shakes, amazing atmosphere!",
   "Great place! I love the huge menu of shakes! Best way to start the day with a Shake and the energizing tea! I gotta have the raspberry tea and cinnamon roll shake! Everyone is always so pleasant! You should check it out!",
   "The best shakes around... and healthy!!! I also can’t get enough of the energizing tea. So many flavor options for both shake and teas. The best part though is the smiles and personal connections you get as soon as you walk in!",
   "The incredible atmosphere and amazing coaches compliment the delicious + nutritious shakes they serve!! The extensive menu has something for EVERYBODY, and the energizing teas will completely make your day!! Open 7 days, too!! You should definitely stop in :)"
  ]
 },
 {
  "name": "Newicks Lobster House",
  "address": "317 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7b3174c-932f-11ea-b808-14b31f159f22.png",
  "tags": [
   "food",
   "knowledgeable",
   "food",
   "family",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2501372289344266232",
  "source": "GoogleMaps",
  "reviews": [
   "Part of my rating is because it seems to me the restaurant wants to portray itself as a higher end type place and not sure it stands up that well if that is the comparison.  Food was good.  Especially enjoyed the lobster pie.  Service was friendly but a bit slow.  I found the restaurant itself to feel dreary on the inside and in need of refurbishment. All in all, not a bad experience and I may go back, but I also am not going to be rushing back.",
   "We arrived 30 minutes before close and were the last customers there. Despite this fact they still took their time to answer all of our stupid questions about their menu and amazing variety of seafood dishes.\n\nThe food was amazing and our server was very knowledgeable about the menu. Highly recommended.\n\nThe picture is of my baked  seafood stuffed haddock and  a lobster that was added on for only $10. Loved it.",
   "My wife had the twin lobster,  which was pretty good (how can you really go wrong) she said the taste had a funniness ( maybe from the water in the tank). I got sea scallops, 5 oz for 18.99, which would have been fine,  but they were bay scallop sized (maybe 7/8\" at most) and overcooked. The coconut shrimp that I got was excellent,  the best thing I had by far. The service was prompt and the waiter attentive and friendly.",
   "Excellent food, service, and prices. Gorgeous decor. Created a wonderful memory with family",
   "Amazing. The waitress was awesome, made sure we were happy more than once. Accommodating to all our needs. Place was clean. Neat. Homey. Love the fact it small business family owned an it bout the customer satisfaction. Price seemed little high for me but food was PERFECTION!!! I love food. Know good food an this place an it employees are awesome.\nall in all great. Keep going back no problem."
  ]
 },
 {
  "name": "Hermanos",
  "address": "11 Hills Ave, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b7fb4446-932f-11ea-a79b-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12862644817189063394",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice people and service, food is delicious! Staff answered my questions and made me a. Fabulous meal!!",
   "Love this place! Excellent food, lots of healthy and vegetarian options. Great for lunch, family friendly. Live music quite often. Highly recommended, this is our favorite place for Mexican food in NH!!",
   "Fantastic well made food!  Celebrating local food & service with a menu that has just the right dishes to choose from.  The Garlic nachos has been superb for decades!",
   "Stopped in for a quick snack of salsa and guacamole.  Great service!  We had the house margarita which was very fresh!  Guacamole was excellent!  Lots and of great people watching in the parking lot.",
   "Got the Scotts Nachos and a couple margaritas!  Both were Great!"
  ]
 },
 {
  "name": "The Works Café",
  "address": "42 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b83dcb76-932f-11ea-b4bf-14b31f159f22.png",
  "tags": [
   "delicious",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4514624429163928259",
  "source": "GoogleMaps",
  "reviews": [
   "I have been here a few times and it always delicious! The sandwiches are always fresh. The ingredients are locally sourced and you can taste it! They have group of young people working there that are top notch! One in particular is Devin, what a helpful and polite young man!! Way to go Devin for showing people young people do work hard!!",
   "Great rustic place with brick walls, cow hide farm fresh vibe. Fabulous fresh foods and great atmosphere in this small Concord Main Street gem. Highly recommended.",
   "Absolutely delicious and fresh! Never disappointed here!",
   "Delicious food, amazing smoothies, and a relaxed environment. Definitely stop here if you're in Concord",
   "The bread quality at this place is really nice. I love their location on main St as well.  Thanks for a great lunch!"
  ]
 },
 {
  "name": "Tea Garden",
  "address": "184 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b885d12e-932f-11ea-9030-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12353734232306917048",
  "source": "GoogleMaps",
  "reviews": [
   "Alysa loved T.G. always had great service and great food. It was another regular T.G. night accept they forgot my white rice with my order of General Tso's. I was upset at first and called. I asked if they could deliver a white rice order to me. Before I knew it the white rice was at my front door and I was enjoying my mean in its entirety. Thanks Tea Garden  for another great night of food and service",
   "Been coming here since I was born. Always my go-to for comfort food or just a warm meal. Not expensive at all. My favorite meals here are the bean tofu, general Gau, sweet and sour soup, spicy green beans, and spring rolls.",
   "This is my favorite Chinese restaurant in Concord. Always been very happy with our food. We've Been coming here for ten years.   Thank you Yes Garden!",
   "We have ordered take out from Tea Garden for years but this was our first time eating in. The atmosphere is basic, but more comfortable than many Chinese \"restaurants\" that provide cafeteria style accommodations. We sat in a comfortable booth. The service was prompt and food was very good.",
   "Lunch meal was great and was enough that I have left overs. Hot and sour soup great"
  ]
 },
 {
  "name": "Sal's Pizza",
  "address": "80 Storrs St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b8c79568-932f-11ea-a929-14b31f159f22.png",
  "tags": [
   "cheap",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9125335583904887809",
  "source": "GoogleMaps",
  "reviews": [
   "I will always recommend Sal's pizza. From the taste to the size it is a great value. Basically a 1/4 pizza you get a choice of slices. Take a friend/ loved one and share a slice of each. Good crust, plenty of toppings. Soda, water and basic desserts.",
   "The meat pizza was great. I can tell the owner chose very selective toppings. Each topping stood out from each other. Great blend.",
   "Kids love this place. Slices are huge and cheap. And, they can pick from any one of a dozen or more different creations. Staff are friendly and typically will remember you from prior visits.",
   "As always I love food more than anything. And Sal's pizza is in the top on my rank. Good food and more important good people always greeting you with a big smile. The prices are good for the huge piece of pizza or for the whole pizza. Keep up the good work",
   "Sal's Pizza was the best pizza joint that I had when I went to Concord. It has a variety of options by the slice, but you can also order wings or whole pizzas if that is what you want. The serving sizes are a little on the large side, but that's exactly what you want when you get a slice of pizza. \n\nDefinitely the pizza place to go in downtown Concord."
  ]
 },
 {
  "name": "Man Yee",
  "address": "79 South St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b90cb4d8-932f-11ea-8d67-14b31f159f22.png",
  "tags": [
   "eat",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15034492987157334609",
  "source": "GoogleMaps",
  "reviews": [
   "This place is surely one of the best place to eat in the neighborhood. Always when I go there I am deeply pleased. They preserve their very high  standard service and the highest level of meals  they serve. You surely will enjoy this this restaurant. Very  recommended.",
   "Been going here for decades. The renovation is nice",
   "We came to this restaurant for lunch. my friend recommended this restaurant.  Well, it was very successful. The crew were extremely nice and we had an excellent feeling. The meal was tasty. We enjoyed every moment and we will visit this place again. Warmly recommended.",
   "Pretty okay, crab rags were yummy, fried rice was pretty good. Orange chicken was not so great. The chicken was very dark, looked like beef. Extremely chewy  kinda rubbery, small portions for a dinner plate.",
   "Delivery came faster than anticipated. And food is amazin!! Lots of crab ragoons and the seafood is delicious with lots of veggies!! I would have liked to have orderd sushi but thats a minor thing"
  ]
 },
 {
  "name": "Olive Garden Italian Restaurant",
  "address": "223 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9513812-932f-11ea-b712-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16843425584452084560",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great experience here. The staff has always been friendly and attentive but not overly so. Last night, we had Bree (not 100% on the spelling) as our server and I have to give her a shout out. She is absolutely amazing. She explained that she was new, but we would never have known. She made sure we had everything we needed at all times. The restaurant was busy but she did not show any indication of being overwhelmed or frazzled. Everything was just great! Super grateful, impressed, and appreciative.",
   "I know. How can Olive Garden get 5 stars? It's a chain, they're everywhere, and often not as grand as local farm to table establishments. Well they at least appear to have their stuff together at this location. Plenty of seating, wasn't greeted immediately but was seated quickly. But then there was Brandy, the Brandy with all of the kids. What a breath of fresh air. From offering wine samples to giving her honest opinion on her personal faves and giving us substitution ideas for our picks, this woman had it all. What's better? Eric who brought us our food was delightful. Funny and engaging. Truly a wonderful experience. The food with substitution options came out great and we brought desserts home per Brandy's recommendations. I would buy anything from this woman.",
   "We visit this place fairly regularly. I would say 4 times a year. It is always good. Food and service!! Glad they finally put a meat sauce on the menu!! Keep up the good work and I will keep on coming back.",
   "The service from our waitress was really great! I appreciated her helpfulness and humor. The food was good, but the pasta with garlic sauce I got was a little too oily for my taste. The bread sticks were quite salty. The atmosphere was warm and comfortable.",
   "The Olive Garden has always been a favorite of my husband and myself for years.  We love the Concord Olive Garden very much!  We went today.  The food was delicious and the wait staff were sooo great!  They are very kind to us.  We will be back soon.  Thank you for all the hard work you all do to make your restaurant great!!"
  ]
 },
 {
  "name": "Arnie's Place",
  "address": "164 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b99630b6-932f-11ea-8efb-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=16961832115187324837",
  "source": "GoogleMaps",
  "reviews": [
   "Super fun atmosphere with great service. The French fries are amazing! The staff is very friendly and helpful. I was taking my daughter just to ride the carousel outside and when we ran out of quarters an employee gave a us some more for a few more rides.",
   "Yum, yum, yum. Arnie's has been an institution in Concord, NH for ages. They serve grill food (hot dogs, hamburgers, pulled pork) and an assortment of homemade ice cream. You will find a flavor and size to meet everyone's needs. If you are lactose-intolerant please note that your option may be limited. They even sell Christmas trees during the Holidays.  Definitely worth a visit if you are in Concord. \n\nPlease note: Arnie's does close down for the winter, but reopens in late February/early March.",
   "This place is worth giving a shot. They serve big portions for convenient prices. Regularly neat and with awesome vibes. Will come visit again.",
   "Best burgers in Concord, great staff been going here for many years. The best places to eat are always non corporate!",
   "Old school grill featuring a variety of burgers, hot dogs, and barbecue items.  Delicious!  Side items including fries, onion rings, potato salad and some other items.  They also have delicious ice cream.  Ordering is done at counter.  Indoor seating is fairly limited but plenty of outdoor seating when weather is nice.  Prices are good.  Arnie's is an iconic spot in Concord and definitely well worth it."
  ]
 },
 {
  "name": "Splendid Sushi",
  "address": "26 Pleasant St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/b9eb7cb6-932f-11ea-a4e4-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "music",
   "family"
  ],
  "link": "https://maps.google.com/?cid=10473135673263923495",
  "source": "GoogleMaps",
  "reviews": [
   "Their sushi is delicious!! They are very nice, I called to see what time they were opened till and they said 7PM I looked at the time and it was 7:15pm so I went to say okay thanks. The woman I spoke with said it was okay to order anyway. She even let me call her right back with our order. When we picked up our order it was 8. Good food and good people.",
   "I’m in love with this quaint sushi bar. The atmosphere is relaxing like a day spa. Their food is fresh and always tasty. Did I mention CLEAN! Establishment is very clean and the people who work here are friendly and helpful. I’m so glad we have a Poke Bowl place close to home.",
   "Quality sushi, very reasonable prices—especially during lunch.  Ambience is a bit sleepy, the music sounds more like a massage parlor than a sushi place. But everything else is top notch.",
   "Amazing... the best sushi in town! I like their poke bowl too. And fair prices!",
   "Very friendly and nice people. Family run business.  Great Sushi.  Best in town.  Very clean and welcoming atmosphere. \n\nA. Gazelle"
  ]
 },
 {
  "name": "EJ's on Main",
  "address": "172 N Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba3b8526-932f-11ea-8de0-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "family",
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12985068497553464514",
  "source": "GoogleMaps",
  "reviews": [
   "We love the breakfast here!\nSarah and Evie and Karen all nnow Mom since she comes in almost every Thursday morning. Fresh fruit, carafes of coffee, real butter,  great service and scrumptious food makes EJs the perfect spot for breakfast.  They serve breakfast until 10, so get in there! Today's cinnamon pancakes were awesome!! 🥞🥓🍳☕",
   "Great place for a drink with friends or a family dinner.    Atmosphere and staff is great.  Was very happy with my experience.",
   "Waitress was great, but the kitchen messed up multiple parts of our order and the food was average. Chicken fingers were amazing and the drinks were delicious.",
   "Service is very friendly, food great quality and for some reason it is never over crowded.",
   "I am giving this one star because the food was absolutely terrible. The salmon was a strange color it had an awful taste the vegetables were hard. If it wasn't for the wonderful waiter I wouldn't give this place one star he was excellent, friendly and very attentive to a large crowd that we had. This is truly a restaurant that just caters to people in the hotel that may not have a car and cannot go out. It was very surprising that on a Friday night there was not many people in there at all but that did not surprise us after we ate there would not recommend it. And a word to the waiter go find a place that would appreciate your service, you did an excellent job and you should be in a restaurant that people appreciate not only the good service but good food."
  ]
 },
 {
  "name": "99 Restaurants",
  "address": "60 D'Amante Dr, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ba885ad8-932f-11ea-ac5e-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10028732966885064621",
  "source": "GoogleMaps",
  "reviews": [
   "Ordered take out during this “stay at home” time. Service was very good; boneless wings and seafood chowder very good as always! Was anxious to get the hot buttered lobster roll; Lots of meat but did not taste fresh, roll was very soggy (we’re only 5 minutes away) and fries were cold. I was disappointed, especially with the price of it!",
   "Our $9.99 meals of fried shrimp and twin catch were excellent. Bloody Marys to top it off..... excellent choice to accompany Christmas shopping!",
   "I loved my experience coming here! it’s a great place. The food I ordered was really good I would totally recommend this nice little place!",
   "Nice place for a good libation, good food, good conversation. The southwestern chicken bowl was very tasty, the beer was nice and cold, very refreshing. I'll be going back to check more of the menu.",
   "Enjoyed our time, waitress was nice and the food and drinks were great"
  ]
 },
 {
  "name": "Five Guys",
  "address": "56 Fort Eddy Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bad2349e-932f-11ea-bec5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "affordable",
   "delicious",
   "free"
  ],
  "link": "https://maps.google.com/?cid=13180433532841432226",
  "source": "GoogleMaps",
  "reviews": [
   "Ordering was quick and easy online, order came fairly quick after I got there. Even with all the stuff going on food still came out fairly quick and well made.",
   "Delcious milkshakes and hamburgers. Quick staff, and polite ones at that. The place itself is very affordable, being that its a fast food chain. Great place to satiate your guilty pleasures.",
   "I’ve been going to 5 guys since they have come to Nh. I’m absolutely in love w the company. Burgers are always delicious and the service. I would recommend 5guys concord Nh store any day!",
   "Excellent burgers made fresh with hand cut fries. The only downside is all the noise that the workers make. I had to move to a table further away from the grill.",
   "Best burgers in town, great price, and the french 🍟 you can't beat them they're fresh and a small fry will feed two people easily plus free peanuts,."
  ]
 },
 {
  "name": "Red Arrow Diner",
  "address": "112 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb1fcd6e-932f-11ea-8b30-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3716689806107784376",
  "source": "GoogleMaps",
  "reviews": [
   "It's always good. It's a traditional American diner, and if you want that kind of food they hit the nail on the head every time, plain and simple. My grandparents love it because it's food they love and my friends love it because it's at an amazing price. Just all around great, simple food with amazing staff who make you feel at home, whether it's your 1st or 51st time there",
   "Wow! 1st time eating here. Menu is massive and I love the fact that you can order anything on it 24 hours a day! Big fan of reuben and chicken fried steak. Also ordered a slice of raspberry almond cake.",
   "Great stop for breakfast lunch or dinner especially if your heading over to the white mountains.",
   "Great Diner Experience!  I’m not a fan of the Manchester location but always pleased with Concord. Clean stimulating diner atmosphere with great quality diner food and amazing service.",
   "Not 5 star in terms of a fine dining restaurant, but really good 24 hour diner with tons of good choices for breakfast, lunch, dinner, and dessert, friendly service, reasonable prices, and fun atmosphere.  Portion sizes are huge, but the food is also good.  My one complaint, despite friendly service, is it can be a little slow.  I do not know this for sure, but the slowness seems to come on kitchen side versus the very attentive front of house staff."
  ]
 },
 {
  "name": "Wow Fried Chicken & Subs",
  "address": "7 Depot St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bb70fb1e-932f-11ea-a08e-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9447760224408454863",
  "source": "GoogleMaps",
  "reviews": [
   "I don't usually leave reviews, but the Beef Shawarma demands 5 stars! In combination with the spicy rice it's one of the most flavorful dishes I've ever had! Definitely going to be ordering from here a lot more as they really know how to impact deep levels of flavor. Also, huge portions! I could twice!",
   "Great portions not to salty. Super fresh and the place is very clean. Bathrooms were spotless. Home made Humus is quite possibly the best I ever had. This is a Family owned restaurant and it is a hidden gem for authentic home made fried chicken and other specialties.",
   "Very tasty and high quality. The staff is very nice and helpful. I tried their crispy chicken wraps and wings and both are very good. The place is very clean and was overall a great experience.",
   "This was my first stop and I loved this place. We found the food excellent and the staff to be warm, friendly and accommodating. We'll definitely be adding this place as a regular stop on our trips to concord",
   "The best chicken in NH hands down, whenever I'm asked \"do you wanna get lunch\" my go to is Wow Chicken. Can't say enough good things and also a great way to try different and new food that always impresses my mouth! Don't think about it just go or order out for yourself and make sure you order the Wow homemade chicken tenders for the best results, your tummy will thank you for it!"
  ]
 },
 {
  "name": "Szechuan Garden",
  "address": "108 Fisherville Rd, Concord, NH 03303, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bbb72d3e-932f-11ea-8393-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8180462839272309917",
  "source": "GoogleMaps",
  "reviews": [
   "One of my preferred spots to eat. awesome location, well kept, and excellent customer service. 5 stars!",
   "I normally don't give out one star reviews. But this place has some serious improvement that needs to be done. It seems like the shell of something it used to be. Chicken didn't taste very fresh and it definitely was not crispy as described and there was way too much sauce! Broccoli was practically raw still and a lot of the food came out suspiciously quick. Place seems kind of beat down and it was very slow when I went in during lunch time.\n\nUpdate 7/26: Order Szechuan Shredded Beef and the beef tasted like it had spoiled. Wasn't the worst thing ever, but it waste definitely hard to miss and I sent it back. Fried rice was ok, but not very fresh either. Wonton soup was good.. They replaced my meal with the chicken version of it and it was much hotter, very fresh and tasted excellent!",
   "I really enjoyed my food and the guest I brought had never been here. The wonton soup is great. The service was very good.",
   "Nice staff. Grace under pressure. Super busy on New Years Eve, take was right on time.",
   "Standard NH Chinese food. Friendly staff. Can be dead or busy, depending on the day/time. Large parking lot and meeting or party space. They do kareoke."
  ]
 },
 {
  "name": "The Draft Sports Bar & Grill",
  "address": "67 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bbfa4fb8-932f-11ea-a286-14b31f159f22.png",
  "tags": [
   "drink",
   "unique",
   "food",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1212766222604000629",
  "source": "GoogleMaps",
  "reviews": [
   "Server was great. We came based on the photos on the website - pool tables and darts. When we arrived there was only a “casino.” A few card tables and electronic games. I ordered the Thanksgiving sandwich which turned out to be just turkey (very good) and gravy (meh.) The menu said there was stuffing on the sandwich, but when I asked about it was told there isn’t stuffing because “it’s out of season”... Stale bread and celery is widely available any time.",
   "Dinner at The Draft never disappoints. A unique door (it looks like a garage door) and dependable service it’s a great place to grab a drink or food. It has one of the best decks in Concord and a great view.",
   "Friendly bartenders who really know how to make a good drink. Highly recommend the cappuccino martini!",
   "Great place atmosphere, excellent service. Food came out a bit slow but, the funny and sweet waitress made up for it. The drinks were off the hook. The prices were reasonable. Will definitely be back again. 👍🏻",
   "Great atmosphere, plenty of TV's for viewing your interest. Great Food. Great wait staff and Bartenders, Love the place.😉.Paul  comes up with the greatest ideas for specials, you should give them a try, you can't go wrong.The new menu has great culinary fare, you'll have to try the many new options,and the great old stand by's..the noodle bowls are to die for. YUM...  Amy will take care of your refreshment needs, all you have to do is ask..🍺🍷🍸  🍀"
  ]
 },
 {
  "name": "Vinnie's Pizzaria",
  "address": "200 S Main St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc45c7d8-932f-11ea-9828-14b31f159f22.png",
  "tags": [
   "family",
   "free",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7099765096108063005",
  "source": "GoogleMaps",
  "reviews": [
   "Down home good pizza! No gimmicks no video games or screaming loud TVs. We are a screen free family for the most part so it's nice to come to Vinnie's and not be inundated with sight and sound pollution! Great pizza too! NYC style!",
   "Really really good simple pizza. Had some pizza by the slice, since it was cheaper than getting my own full pie. Fiance got the sandwiches. All of it was super good. Plus they have a nice selection of cold beer :)\nThe guy working when we went was super hilarious too. We stopped at the end of a 7 hour driving day and were kinda loopy and he played along.",
   "We were driving by and got a good feeling for Vinnie’s vintage place.  Simply wow!  Staff was super friendly!  \nWe were told that everything was made on site and that all ingredients were fresh.  \nWe ordered half/half Mest Lovers and Mac & Cheese.  What a Win!!!  🙌 \nWe’ll return for sure.  \nWifi available on site.",
   "Delicious pizza. Worth the wait!",
   "Sandwiches here are ok. The pie is better the next day. Ordered a cheese pie and the cheese would slide off each slice and drip with oil. Very friendly staff, but the food isn’t something to go out of your way for."
  ]
 },
 {
  "name": "Dragon Star",
  "address": "75 S Main St #1, Concord, NH 03301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bc8d40c0-932f-11ea-89fd-14b31f159f22.png",
  "tags": [
   "food",
   "art",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17994139689973449697",
  "source": "GoogleMaps",
  "reviews": [
   "Is it there is amazing so you should really get your food there because there are the only ones that can get your food as good as possible.",
   "I had a few minutes and had been craving fried rice for about two weeks so i stopped in for a quick order of house fried rice to go, I was the only customer there sitting my order but getting the pint of rice took about 15 minutes then when I get home and open it up i was immediately able to discern that they were out of fried rice at the moment and in a hasty corner cutting move to fill my order they decided to take white rice and mix it with the meat and vegetable fillings of house rice and put it in a container and send me on my way.\n\nI am completely beside myself with what just happened, and disgusted with the manor they were willing to let their food be presented to a customer, and laughed when I saw that on their website they claimed \"Dragon Star features authentic Chinese food to take out, our cooks are masters in the art of preparing the finest quality Szechuan, Hunan and Cantonese dishes.\"",
   "The food is always well prepared and delightful, workers hands over good customer service. I love how neat it is and ambience. Keep up the good work.",
   "I wish you were still open!!!.... I want your  Chinese food. Makes me said covid 19 happened",
   "Fast and reliable, food always taste pretty good. My go to Chinese takeout in concord"
  ]
 },
 {
  "name": "Nina's Bistro & Sandwiches",
  "address": "49 Hall St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bced054a-932f-11ea-8b03-14b31f159f22.png",
  "tags": [
   "unique",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13693042081861653158",
  "source": "GoogleMaps",
  "reviews": [
   "This place has a lot of charm. I first heard about Nina's from a few friends who recommended the cevapi pocket - an authentic Yugoslavian specialty. This is now my favorite spot, and the owner is a delight to talk to. If you haven't given Nina's Bistro a try, you're missing out on a truly unique hidden gem!",
   "I went there with my hubby and we love the place, what a great vibes! Our food was awesome, so yummy, delicious!!! Wishing their menu still available all day, after that even the restroom is sparkling clean. Thank You Nina, you are so lovely! I’ll be back!",
   "Was on my way back down to Nashua from a half day ski trip at Ragged Mountain.  This was a perfect stop to grab a sandwich (plus there’s a gas station nearby).  The Caprese panini was perfectly toasted and tasty, though the extra order of fries that I got were just ok and somewhat overpriced at $4.",
   "I used to visit The Sandwich Depot pretty frequently back when they were occupying this space, so I'll admit that I was a tiny bit apprehensive of a replacement with \"bistro\" in the name. However, I liked the mix of items on the menu and the still very reasonable prices, so I tried them for lunch today. I got the caprese salad with tuna salad and let me tell you, it was one of the best lunches I've had in a while. A perfect antidote for when you want to come off the holiday excesses with a healthy but still tasty meal. The tuna salad was flavorful, with bits of dill and finely shredded carrots; the fresh mozzarella was super soft; the tomatoes juicy; and the spring mix had just the right amount of balsamic vinaigrette drizzled. I'll definitely be back to explore the other menu options!",
   "The steak and cheese is fantastic! Always friendly behind the counter. Will continue to get lunch here weekly!"
  ]
 },
 {
  "name": "Applebee's Grill + Bar",
  "address": "260 Loudon Rd Steeplegate Mall, Concord, NH 03301, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd53d2a4-932f-11ea-8e3d-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=18128423565237581270",
  "source": "GoogleMaps",
  "reviews": [
   "Our server was the worst, his name was Joe. He was very unfriendly and quick with us. A manager had dropped off our food and we mentioned his behavior. It was very obvious with his retaliation towards us that she spoke to him. \"Got me in trouble.\" Actually came out of his mouth. As I was paying and leaving a review, he jumped in and even asked us if we were leaving a bad one. He continued to take out his phone and say he had an app that would show him. I was very quick to leave right afterwards. That was the most uncomfortable situation I have ever been in, in a public setting.",
   "Waitress was great, appetizers were really good. Loved the boneless honey BBQ chicken wings",
   "The food was very good. I got a  Barbecue whiskey bacon Burger",
   "My waitress was super! She got me everything I needed. She was AWESOME! I Don't usually like to eat alone but I was quite comfortable and really enjoyed my meal.",
   "The half price appetizers after 9pm are a great deal.  And they always have a $1 margarita that changes every month.  Makes for an inexpensive stop after a night out."
  ]
 },
 {
  "name": "Milano's Pizza",
  "address": "3 Broadway, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bd968112-932f-11ea-bfde-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9006858082276851859",
  "source": "GoogleMaps",
  "reviews": [
   "Best cheese steaks around by far this is my new sub shop in this area. Sub is packed.",
   "Good little local pizza shop!  Subs and salads are great as well. I only do take-out there because they blast Fox \"News\" on TV which is horrible to have sit through.",
   "Don't like Nicko making passes at my wife of 40 years. Food was good other wise.",
   "Phenomenal food, great price, no tip expected but definitely deserved. Looked like a gas station when we pulled in but I am glad I listened to the reviews. Delicious salad and pizza.",
   "Food is awesome and inexpensive! Grinders are loaded!"
  ]
 },
 {
  "name": "Chipotle Mexican Grill",
  "address": "265 Loudon Rd #2, Concord, NH 03301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bddd7c10-932f-11ea-ac30-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "family",
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7163512406406077496",
  "source": "GoogleMaps",
  "reviews": [
   "Extremely busy store. I went at lunch time on a Monday. The employees were all very well trained to multi-task and worked great as a team to get everything order correct and I was in and out in a matter of minutes. Food was good. Portion size is huge for the bowls. I finished half.",
   "I love this location and have been many times before and would give a 5 star every time but not this time. I ordered a burrito online and when I opened it up, the tortilla had 2 tears in it and it spilled out everywhere. Normally I would care but we ordered and we’re traveling in the car. The food was good but it was an absolute mess that I wish the employee that made it would’ve fixed the issue when they realized it was tore up. If they didn’t realize it, then they shouldn’t be working in customer service. Really disappointed.",
   "I’ve never had an issue with this location until tonight. I ordered my food, excited about the delivery option. I was told it was to arrive at 6:35. When 6:45 came and no phone or email that it would be delayed, I drove to the location where I asked if my order had left yet as my updated door dash said at restaurant. The woman and man at the front completely ignored me after they said they didn’t know where my order was. I was standing right in front of the cash register and was blatantly ignored by TWO of the employees. I kept updating my browser and saw that it was in route to my home. I then proceeded to call the driver multiple times but kept getting sent to voicemail where a voicemail was not set up. When she arrived, she openly told my family that the order was cancelled and then sent for delivery. Not a phone call, email or update as to why our food was over 30 minutes late. I’m appalled by the employees who ignored me right in front of my face while I was being very polite. I will be very careful when I enter this location again as they do not care what so ever about the actual customer.",
   "Waited fifteen minutes then walked inside and no acknowledgement. Wasn’t until someone else walked in got there food and told us to walk back in because the food was on the counter. Spent 27$ burritos smaller than usual and told us chips would give us a refund because they were out. No where on the site does it offer refunds or complaints. Bought chips at the gas station",
   "First staff member didnt seem very thrilled to be at work.  Cashier was much better. Several tables were dirty, but it wasnt very busy.  Food was good"
  ]
 },
 {
  "name": "Veano's Italian Kitchen",
  "address": "16 Sheep Davis Rd, Pembroke, NH 03275, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be28709c-932f-11ea-8e4e-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13391895820132823237",
  "source": "GoogleMaps",
  "reviews": [
   "20 degrees outside,but the restaurant was warm and comfortable! Our coffee was freshly brewed. Hot and tasted great. The meal was perfect too. Warm and tasty. Our service was awesome!",
   "I have been going to Veanos since I was a kid.  Now my husband and I bring his kids.  If you're looking for consistency in food and service.  Look no further.",
   "I used to eat here when it was on the heights back in the 80's they moved here in 2000's sometime.. best Greek restaurant I know of in the Concord area... Grinders are always fresh..chicken wings are vary good an not a fan of frozen french fries but they have good quality ones...Greek salad is vary good with nice slices of feta cheese... An dressing had a sweetness to it that is so good I could eat it on anything...always clean always good only reason I give  four stars are the people who go a few I ran into are vary rude not sure if that's Concord or Pembroke..",
   "Thank you Veano, we love your food! And plan on ordering again! Love the baked scallops!",
   "Enjoyed a great dinner here. Didn't take pics of the food but all were great.\nStuffed Cabbage with meat sauce\nMeatloaf Dinner\nHaddock au Gratin\nYummy \nItalian Lemon Creme Cake...melt in your mouth...yummmm!"
  ]
 },
 {
  "name": "Chief's Place",
  "address": "348 Village St, Penacook, NH 03303, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/be6eefca-932f-11ea-8873-14b31f159f22.png",
  "tags": [
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1337988013142054309",
  "source": "GoogleMaps",
  "reviews": [
   "Never had a bad meal over to Chief's Place. Our pizza took a bit longer than expected but the results were fantastic! An expertly cooked pizza! Even though we had a bunch of toppings the pizza was cooked evenly throughout, not raw in the middle, not burnt and not overly greasy. Perfect!",
   "On a diet? NO problem.....delicious broiled seafood and salads.",
   "Amazing food and a wide variety too. Friendly staff and comfortable restaurant seating.",
   "They make great sandwiches and calzones! Will definitely be going back !",
   "Very good food , meatball sub was tasty, yummy steak fries,"
  ]
 },
 {
  "name": "Washington Street Cafe",
  "address": "88 Washington St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/beab696e-932f-11ea-8a41-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=7290892046408724770",
  "source": "GoogleMaps",
  "reviews": [
   "I just love their food. I always get great service there. The place is well kept and the employees are always nice. Will visit here again.",
   "Fresh salads. Hot meals. Homemade soups. All natural deli meats for wraps or artisan bread.",
   "Best catering! Great Mediterranean food and sandwiches!",
   "very very close to 5 star",
   "Went here for lunch quick service employee was very nice. I got the unique lala chicken wrap. It was delicious great for a quick lunch stop."
  ]
 },
 {
  "name": "1896 Grill & Tavern",
  "address": "1 Beaver Meadow Dr, Concord, NH 03301, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "",
  "tags": [
   "drink",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=18312314142697865002",
  "source": "GoogleMaps",
  "reviews": [
   "Was very excelent service made my mixed drink the right kind of strong and a quesdilla that is better then any other restaurant ive had one at, there golf staff was very proper and knew how to have good customer service as well as being able to have a good time with the indoor simulator!!!!!!!",
   "Terrific comfort food. Highly recommend.",
   "Do it. You’ll thank me later. Yummy food and great service make the perfect combo.",
   "Friendly staff, delicious burgers!",
   "Had an amazing time.\n"
  ]
 },
 {
  "name": "bāked Cafe & Bakery",
  "address": "249 Sheep Davis Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/beeeb440-932f-11ea-8532-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3184586536830210650",
  "source": "GoogleMaps",
  "reviews": [
   "Stopped in for Breakfast and left with lunch to! Pin drop this place. Fresh and clean food with some interesting twist in normal flavor.   I'll be back some day!",
   "Normally I would give this a 5-star rating but my last visit was substandard. the place is always super busy because it's normally good so I got there very early and I was the only one in line before noon ordered my usual which was the turkey gobbler. Usually takes just a couple minutes to get my meal, but this time it took nearly 25 minutes and when I got to go it wasn't the usual warm delicious turkey dinner like meal. Instead it was akin to a cold deli sandwich with cold stuffing and cold hard cheese. Even this gravy side was more gel than gravy. This isn't normal so I was very surprised and very disappointed. I don't know if they're just short-handed this is day or what but it was quite a let down.",
   "Thank you for your high quality business. Yesterday my branch ordered different variety of menu options and it was superb, quick prepered,  fresh ingridients and an exclusive pinch of house made souses.",
   "Clam chowder was terrible. Watery with no flavor. BLT was good but it's hard to screw up a BLT. Didn't get my pickles. Salted caramel shortbread bar needed help. Shortbread was awful and dry. Kind of tasted stale. Shortbread mixture needed a ton more butter and a bit more sugar. Not enough good things to make me go back.",
   "This was our second time eating here - first time was great but the second time we got take-out I was HORRIFIED to find a stinkbug in my Reuben sandwich. I took a bite of the sandwich and as I pulled away I saw the body of a bug on the edge where I would have taken my second bite. I get smaller bugs can sneak in (e.g., fruit flies) but this insect was almost the size of a quarter. It is alarming that the bug was right on the top of the coleslaw in plain sight NOT buried - so little care and observation was taken while preparing the food. Sorry Bāked, this is unacceptable and I would be sickened if this happened to someone else."
  ]
 },
 {
  "name": "Dallas Pizza",
  "address": "156 N State St, Concord, NH 03301, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf2ecac8-932f-11ea-8713-14b31f159f22.png",
  "tags": [
   "food",
   "family",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6743232047790864183",
  "source": "GoogleMaps",
  "reviews": [
   "Great local pizza joint with friendly staff, good food, and a small but nice dining area.",
   "Greek style pizza crust has always been a favorite of mine and Dallas makes their pizzas just like I want it. The crust isn't overly doughy or so big that it takes over the pie. \nAlso tried their shaved steak sub, not too greasy like some places serve up which is nice.\nFriendly staff (family owned?) that is always courteous.",
   "Amazing pizza and burgers, they also have really good pastas.",
   "Their subs are stuffed with what your order. I like the steak and mushrooms. Bread is good for subs, but I do not like the bread for the pizza as much.",
   "Hoped for a quick walk in to order a couple small calzones for take out around dinner time. Did not appear to be very busy but order took 30 minutes to come out so call in advance. Not very large dining area. Price was a little high $13.00 for a small calzone. Food was very good though in the end makes it worth it."
  ]
 },
 {
  "name": "Wrap City Sandwich Co.",
  "address": "273 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bf6f3ef6-932f-11ea-aea5-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "family",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7523481072880425672",
  "source": "GoogleMaps",
  "reviews": [
   "I've ordered take-out several times now from Wrap City, and every time, the food has been absolutely fantastic. It always tastes fresh, it's always well-made, the staff is always very friendly and helpful, and the location itself is very clean, and well put together. So far, I've made it a point to try a different sandwich or wrap each visit, but I've become a big fan of The Warrior. Their chips are very unique, and very tasty. Pricing is also very competitive, although they could be charging twice as much as they do, and I'd still pay, since their food is VERY good. I highly recommend Wrap City if you need something quick and/or casual.",
   "This restaurant is amazing. It was a little bit of a wait, but so worth it. You must try their honey mustard, it is the best and tastes amazing on their chips. I came with my family and everyone loved it. The food tastes amazing and is nice and fresh. The place was very clean and comfortable. I definitely recommend this and will be coming back.",
   "Friendly service. Clean restaurant and bathrooms. Delicious food with so many options and willing to make custom orders, too. The kettle baked chips are sprinkled with what tastes like a cinnamon sugar and is the most amazing taste combination. Cannot recommend enough. Always excited.to go back! Must try!!!",
   "Had the Philly’s Best and it was terrific! Steak and toppings were amazing, the cheese wiz, although a bit much in places, was a nice addition to the overall taste. Chips were far better than the mass produced garbage from Lays. There are so many different things on the menu that I want to try, that I’ll definitely be back! Can’t wait to see this place grow and expand.",
   "Nice place, good food with excellent service, I did not find it on Instagram, I believe Google did not put the address.  recommend the venue"
  ]
 },
 {
  "name": "Donatello's Pizza",
  "address": "15 Village St, Concord, NH 03303, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bfb68386-932f-11ea-a78d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3274525981460748557",
  "source": "GoogleMaps",
  "reviews": [
   "We came to this spot for dinner. my friend recommended this place.  Well, it was a winning. we were warmly welcomed by the crew  and we felt fantastic. The meal was tasty. We enjoyed every moment and we shall absolutely come back again. Recommended.",
   "Great pizza, great people, great service. I ordered Chicken Fajita Pizza with extra cheese and it was delicious.",
   "We have gotten delivery from this restaurant for years and we have always had such great service and great food as well. The staff that we have encountered have always been very friendly! We always get the same girl who does the deliveries and she is awesome! I always forget to ask for her name, but she has red hair and is super friendly!",
   "This place is awesome! Super friendly folks and outstanding food! I love Donatello's!",
   "We enjoyed the NY style pizza, chicken fingers  and steak and cheese sub. It's nice to have housemade sauces and pizza dough."
  ]
 },
 {
  "name": "Papa Gino's",
  "address": "129 Loudon Rd, Concord, NH 03301, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/bff980a4-932f-11ea-8235-14b31f159f22.png",
  "tags": [
   "affordable",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18174856032253854833",
  "source": "GoogleMaps",
  "reviews": [
   "The best chain pizza place ever. Totally affordable and great quality.",
   "Haven't been there in a while. Was a bit disappointed in the pizza. Not much cheese but more than enough sauce on the pizza. It may have just been the evening so I won't judge on this one trip. One other issue was they never called us up to the counter for pizza and when my daughter inquired they handed her a box saying it was her pizza, we were eating in, do she took it. While she was eating it she realized a customer was complaining because her pizza wasn't ready. My daughter looked down at the receipt on the box and it was the take out order box!",
   "Associates were great. Very pleasant. Great food.",
   "Food is good, however was informed this location will no longer honor any coupons from ads or their website.\n\nAt the current price points, I suspect this place will lose more customers.",
   "Place has gone way down hill. The entire company itself has. Food quality is way down from what it use to be. Also they cant even properly maintain there building."
  ]
 }
]