[
{
 "name": "Governor Grant Park",
 "address": "Littleton, CO 80123, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "hike",
  "kids",
  "kids",
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Nice hike for kids and dogs, getting out of city while being in the city.",
  "Clean, good condition,  variety of equipment for younger kids. Just no shade.",
  "It's under construction, new more friendly walking paths.  Should be done in about 3 months ....",
  "Oo yes i had my birthday there",
  "Nice park good area for kids to play on play place. And trail  to walk"
 ]
},{
 "name": "Olive Garden Italian Restaurant",
 "address": "5380 S Wadsworth Blvd, Littleton, CO 80123, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Normally a great place to eat. But all of our meals were not good tonight. I'm positive my 5 cheese ziti only has 2 cheeses and was hard before I drove home 10 minutes. Trying to support local business. Also half the people working at this location couldn't even pretend to be in a good mood.",
  "Always a pleasure to eat here",
  "Hadn't been here in over a year and decided to come revisit. The food, compared to past visits, was very bland, not a lot of flavor. Our waitress wasn't very attentive either. When she came to check on us one time to ask how everything was I tried to tell her there was no gnocchi in my soup but left upon hearing my husband say he was ok. I don't know what's happened in the past year but the food and service just aren't what they used to be and its disappointing to say the least.",
  "We went for a quiet lunch after the graveside service for my grandmother. They put us in the back room and we had the absolute best service of any place I have ever been to!",
  "Had dinner.  Server was alright.  Happy bubbly until I said we would not be needing the wine glasses.  Then straight business.\nShe kept our glasses of raspberry lemonade full.  Had to ask for more bread but other than that it was good."
 ]
},{
 "name": "Good Times Burgers & Frozen Custard",
 "address": "8500 W Crestline Ave, Littleton, CO 80123, USA",
 "avg_visitor_review": 2.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Friendly service! Generally we LOVE Good Times; especially their breakfast burritos.  But, today, not so much.  The green chili and eggs seemed fine, but the burritos themselves were smaller than usual (they aren’t huge normally), flat, and just seemed off a bit.  The potatoes were undercooked, the bacon odd, and the tortillas were tough and chewy. Maybe they were old/stale. They were edible, but not fresh and delicious! Three stars because of green chili, eggs, and service.",
  "Spicy chicken is way too spicy for my liking but what I really liked was there veggie option, southwestern style was pretty good. Also the buffalo style burger was horrible, it seemed that it was done on purpose, both sides completely SATURATED with the spiciest buffalo sauce you can imagine. The sauce was even drenched on the Bread sadly. I was excited to try this establishment, as it seemed like a great option at the time, but I won’t be bringing my business here anymore sadly. Was kinda hoping it would be the “in n out” of Colorado.",
  "My favorite fast food burger when I get a craving. Reasonably priced and made fresh.",
  "I don't normally leave reviews, but today was a horrible experience... soft and undercooked wild fries, and the mac and cheese was literally a pile of plain noodles with cheese \"melted\" on top. I couldn't even use the provided plastic fork, it all came out as one huge block. Worst mac and cheese I've ever had. The burger was the only saving grace, but even that wasn't up to the usual standards. Probably will not come back again in the future, overall disappointed and very dissatisfied with my experience today.",
  "The food tastes fine HOWEVER I’ve been writhing in pain all night because I ate here. It’s 3 am and i can’t sleep because of the horrible pain. I’ve never had such a reaction to fast food before. Really concerning."
 ]
},{
 "name": "Boston Market",
 "address": "8500 W Crestline Ave, Littleton, CO 80123, USA",
 "avg_visitor_review": 2.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Quality doesn't match price. Cook could care less when we informed her. One prime rib was cut thin the other cut thick. Vegetables was under cooked.",
  "Do not order from this location for pickup. They have 2 staff for the entire restaurant 30 people in the drive thru line and refuse to open the door to allow pick up orders to enter. Forced to wait in the drive thru line for over an hour. No more Boston Market until after the virus.",
  "How about a thanks for coming during this totalitarian lock down? Seriously you're welcome for helping you to still get a paycheck dude. Tell the tattooed dark hair guy to speak up, he is almost whispering.",
  "I went there today, Thanks giving day to get some spinach, sweet potatoes, cranberry sauce and cornbread. Drive through was closed. I was 39 minutes in line, they were out of sweet potatoes and when I opened my bag of cornbread, it had biscuits. I was too tired to go back.  Happy thanks giving, judge for yourselves.",
  "Love their food! \nHowever, they stopped carrying green beans for some reason and it sucks! Please get them back, how do you have comfort food without green beans?!?!"
 ]
},{
 "name": "Chick-fil-A",
 "address": "5260 S Wadsworth Blvd, Littleton, CO 80123, USA",
 "avg_visitor_review": 3.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I purchased a #4 chicken tenders, they were over cooked and taste like old fryer grease. They also over cooked the waffle fries. You would think that considering the current situation that quality would be improved if anything. Thank goodness I purchased a frozen lemonade it was the only thing worth consuming, everything else had to be thrown away!! Have had issues with this location before??",
  "Clean clean clean!!!\nBest chicken, next to mine 😁\nI love their food, my staff loves their food.... who doesn't love their food? By far the best location around 🏆",
  "First it would be nice if there was an adult working here.. it would also be nice if there was someone who knew how to process a credit card. If your a \"director\" or manager you should know how to use your systems or be able to find a solution.  Bad service and lack of know how.",
  "I love the market salad with apple cider vinaigrette and a tea how sweet. That's my staple and I'm sticking to it. I love the friendliness and always happens at Chick-fil-A but I just wish they weren't homophobic.",
  "We went through the drive-thru and the line was short. Prompt service and food. Waffle fries were really good, as always and so was the lemonade."
 ]
},{
 "name": "Del Taco",
 "address": "5240 S Wadsworth Blvd, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "cheap",
  "food",
  "food",
  "food",
  "free"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I love that the food is fresh, looks good, tastes good. Always seem to have employees who would rather be doing anything else, but nothing terrible. Nice fast, cheap food",
  "It's been nearly 30 years since I was at a. \nAnd I believe the food has improved.\nThey have these potato things, it is so good\nYou just need to go.",
  "Welp... fast sometimes I guess... only they just can't seem to get my order right.... its sad. Wouldn't even let me get a compensated replacement",
  "Definitely not authentic Mexican food,  but it'll do in a pinch. I would stick to vegetarian and skip the mystery meat 🌯",
  "I stopped by Del Taco, location on Wadsworth and found after ordering that I didn't have my wallet. Theresa was so sweet and was able to give me my lunch for free! I gave her what change I could find floating around my car and left feeling so much gratitude to her and del taco. It wasn't a large ticket, but that doesn't matter. Thank you Theresa and Del Taco for making my tough day better!"
 ]
},{
 "name": "Applebee's Grill + Bar",
 "address": "5250 S Wadsworth Blvd, Lakewood, CO 80123, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "food",
  "food",
  "gourmet",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "When you go to Applebee's and see a promotion on the website and they don't honor it, that is extremely disappointing on top of it when you bring it to the waitress's attention you get attitude out of it. You really need to make sure that your promotions are up-to-date or you need to honor them. then she says are you sure you even put in for the state of Colorado and I showed her that it matched this exact location off of South Wadsworth.  I have attached a screenshot to show you what I was talking about.",
  "The only reason why I'm giving 2 stars is because the  waiter was nice, the person who brought out our food was not. The silverware and cups were dirty, the fries were over seasoned and soggy. We got our food pretty fast but it was   cold.  Plus the amount of grease in the burger was horrendous. I've been to many burger places in my life time and there has never been a burger I've eaten that's been this greasy, if you barely squeezed the bun or tilted it the burger in your hands it would start running. We also witnessed the bartender give her customers a 4 day old drink in a dingy looking plastic bottle that she specifically told them was that old and was gonna throw out.  But, she gave it to them anyway.  Definitely not coming here again for a long while.",
  "I had every good meal, French onion soup and then bourbon chicken & shrimp.  Service was a little indifferent and I had to ask to get my coffee warmed up.  Maybe wait person was having an off day?  Good casual food.",
  "Always love coming here. Staff is great and good always taste fresh. It's not too crowded so great for having a conversation.",
  "Comfortable,  come as you are, relaxed vibe. Staff is fun and laid back ~ but professional.  Not gourmet,  but good food, fast. My staff loves the Applebees outings!\n🏆🥩🌮🥖🍔🥬🥑🍅🍤🍝🍰"
 ]
},{
 "name": "Taco Bell",
 "address": "8500 W Crestline Ave Unit 8, Littleton, CO 80123, USA",
 "avg_visitor_review": 1.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "run"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "It's taco Bell! They got rid of their green \"spicy\" sauce, hence the 3 stars. I loved that sauce. First they got rid of the packages but you could still get it and now they got rid of it altogether. Bummed!",
  "There is no GM for this store or the one down the road.  The manager does not actively participate in the workplace during average dinner hours.  When ordering a black bean crunch wrap supreme, which I had to repeat saying because they put the meat one down, it rang up as 3.99 when posted as 3.69 on their menu and website.  This is called price fixing and is illegal and morally unbearable.  We called the manager and left a voicemail but had no choice to go down to the road for del taco.  The employee said there was nothing she could do about the price.  How about get training?",
  "Worst service imaginable! Couldn't ever call this place fast food and it's every time I go here. This last time I literally sat for 10 minutes at the window waiting to pay while our food was already ready for some guy to sit there and count out his drawer by the penny right in front of us at the window. Where's the management here????",
  "The last 4 times I have came to this taco bell, my order has been messed up, or there's food missing, etc. This by far is the worst I've gotten from here. The only good thing from the order tonight was the spicy potato soft tacos I had. This quesadilla made me gag from the burnt taste.. super disappointed. I'll be going to the other taco bell on Belleview and Kipling from now on.",
  "Store says they open at 7:30 but orders don't start until about 8:30. They say they close at 3 am but they really like to close at 2 am. Not to mention how many times they run out of baja blast...Customer service is garbage too. One of the worse taco bells I've been to."
 ]
},{
 "name": "Fontana Sushi",
 "address": "8601 W Cross Dr, Littleton, CO 80123, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Roll sushi was good. I also had the Dynamite baked seafood appetizer and loved it. I'll come back here for it. Fast friendly staff.",
  "Fontana Sushi\nThis is my go to sushi place. I absolutely love it,  it’s always fresh, delicious, the service is good and the quality seem to be very pleasing.   If we go in the evening we have to share at least one or two of the bomber beers.\n\nI WOULD recommend you go there and have a taste for yourself.",
  "Great place! Good place to take friends who like sushi! I don't care for sushi and there are great options so now when I go with sushi eating friends we can all enjoy.   The food is fresh and beautiful to look at.",
  "Awesome food, good prices and service.",
  "Fresh fish, well-made rice, nigiri and rolls; generous portions; reasonable prices."
 ]
},{
 "name": "Cody Street Park",
 "address": "Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Bonefish Grill",
 "address": "8100 W Crestline Ave, Denver, CO 80123, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Food was amazing! Even their bread was to die for. Keep an eye out for their daily specials. They were super busy, 45 min wait but well worth it. In addition, our waitress (I think her name was Brittany) was wonderful. Even though she was super busy she checked on us frequently and was very kind and charming.",
  "Our dining experience at Bonefish Grill was great. We were seated promptly even though we were early on our reservations. Our meals were served as they were ordered and tasted incredible. The fish meals are prepared with your choice of different sauces and sides so you have an individual flavor for your favorite plate. \nThe cocktails did not scrimp on the liquor here. An overall excellent evening with my date at Bonefish Grill.",
  "We love Bonefish Grill so much, we went back for lunch today.  I was impressed to see that they bring their “A Game” for every meal.  Had some delicious rainbow trout with mango salsa, and fresh crab cakes. Absolutely wonderful! The service and selection, even the plating said “Quality.”  But the proof of the meal was in the tasting, which is consistently excellent!",
  "Our waitress Kristy was amazing. She was so friendly. We come in all the time for brunch and I'm so happy when I see her happy face. Will continue to come because of great service.",
  "I like this place! They have first-rate meals, their menu is large, The chef in that spot is a real authority in the kitchen, I like very much trying all their food. The dishes are always fresh and tasty, the attitude towards the visitors  is good. I often go to  this place and I was never disappointed. I recommend it with no hesitation."
 ]
},{
 "name": "Angelina's Italian Restaurant",
 "address": "8100 W Crestline Ave, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "family",
  "food",
  "food",
  "food",
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I love this place!!! You want authentic Northeast Italian, look no further! Bob made us feel like family and Lara had impeccable timing. I have a new go to for my Italian fix. I love the ambiance and decor but the food is above reproach. Thanks Bob!",
  "Love this place this is a small quaint spot in a smal shopping center it has incredibly great food, great atmosphere, quiet and very much an adult atmosphere the evening was great I highly recommend it",
  "Being it was my first time at Angelina's I excepted the servers to be more helpful when it came to the menu options. The food does not match up to the pricing which was extremely disappointing. Would not reccomend and The Odyssey is WAY Better!",
  "Great Food!!  A True Family owned/run restaurant.  Bob and Chandra know how to deliver A truly great dining experience.  Few restaurants like this exist.\nWe will be back!!  David&Sandra",
  "The Best NY Italian, Hands down!"
 ]
},{
 "name": "Wingstop",
 "address": "8100 W Crestline Ave Ste A10, Littleton, CO 80123, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Great sandwiches but not worth what they are charging. 3 of is for $42..... It's not somewhere that you would consider going on a regular basis unless you have money to burn. You can go to a decent sit down reateraunt for about the same price. Soon most people will not be able to afford to eat out, lol.... It was good though",
  "Wings are really small. Good flavors",
  "Charged for ranch and did not get any. It has happen a few times. I did not check untill i left but honestly I should not have to. Good wings though.",
  "Loved it! Food was actually cooked thoroughly. It was a long wait but that's any wingstop. Call ahead and you'll be fine. Worth it.",
  "The hardness of the chicken turns me off. I like my chicken to be soft and scrumptious. I found there chicke rock hard, mainly consisting of breading, dissatisfying and will never return.  The premium chicken nuggets at McDonald's are better and have more meat. "
 ]
},{
 "name": "Buffalo Wild Wings",
 "address": "5138 S Wadsworth Blvd, Lakewood, CO 80123, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "We were dying to have some wings and my favorite place for wings is of course Buffalo wild wings.  The place was absolutely packed, what do you expect when it’s a Sunday afternoon and the Broncos are playing, hello!\n\nMy favorite is the mango habanero, followed by the spicy garlic.  I always asked for extra crispy. I don’t know what it was, but wow, it was the best ever.\n\nOlivia was training Timmie and was doing a great job.  It seemed As if she is a good trainer.\n\nI WOULD go back.",
  "I waited for over 90 minutes for my order of 20 wings. Only to be told that I don't know if it is even started. They started calling out names and no one with that name was even there. At least 10 names for orders for people not there. Will never be going back which is sad because they have great wings when you actually get them.",
  "I've been coming here for years. This place will never go out of business! Been here too many times and the workers are always changing but the food will always taste amazing! If you never been here then you are missing out American best chicken wings. My favorite flavor is Caribbean jerk since I love spicy! Not only that, you can catch almost every televised sport on their many TVs",
  "The food is not consistent. Some days I get the perfect amount of sauce on my buffalo wings and some days it's dry as a bone.",
  "Consistently good food and service regardless of where I sit or have as a waiter/waitress. I typically sit in the bar area, however. As with any restaurant with projection screen they're difficult to see because the bulbs are worn out from being on constantly and need to move on to large flat screen TVs. Beyond that I'll come here again and again."
 ]
},{
 "name": "Which Wich Superior Sandwiches",
 "address": "8100 W Crestline Ave Unit A-3, Denver, CO 80123, USA",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "My 1st time here so little confused by order process. Not much into filling out forms, but were fairly intuitive. Sandwiches were great and combo was good as well. Like the reusable plastic glasses. Just like Dickies the size I like to use at home as well.",
  "Food was very good, however both employees had a mask on their neck rather than on their face, not smart or safe!",
  "The best sandwiches by far. Much more superior to subway or quiznos. Fast, easy, and great rewards program.",
  "I usually always enjoy my sandwich from here. Today I got my usual grinder. There were only 2 other people finishing there lunch. I waited patiently for my grinder that probably sat for 10 minutes out of melt before noticed.(the young lady was too busy portioning fries)Then the girl behind counter finally noticed as other guests were arriving she asked another girl whom came out chewing from the back and finished my sandwich. Okay being in the service industry I'd let it all go because the first girl I interacted with apologized. But then I get home and my bread was hard as a rock. Very disappointed & will not return.\n.",
  "It is pretty good sandwiches but the service is kind of slow"
 ]
},{
 "name": "Smashburger | Delivery & Takeout Available",
 "address": "8100 W Crestline Ave Suite 2290B, Littleton, CO 80123, USA",
 "avg_visitor_review": 2.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "experience",
  "food",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The food here is nearly to die for. I love their Avacado-Burger and their special fries are the best I've ever had. The cleanliness of this location left a little to be desired for, but other than that, everything here is 5-stars.",
  "Used to love smash burger but we won't be returning after this last experience. We waited in line for about 15 minutes and then had to wait another 15 minutes for our food. It seemed as though the staff couldn't handle the business that was coming in.  When we got our food I truly couldn't believe anyone would ever serve food in this condition.  The hamburger patties were incredible small, the cheese was so burnt it was black and crispy. The entire thing was a complete mess. When we tried to have someone assist us in getting new food made, the staff were either too busy while others were too busy talking to each other. We did get good that was away least edible but it was the worst experience I have ever had.  Other customers were just walking out after being in line for 20 minutes.  Overall it just seemed as though no one really cared at all about service or food quality.",
  "Employee was cooking food today without wearing a mask.  I asked the manager, isn't everyone supposed to be wearing a mask? She said yes, they ran out.  She was dismissive of me and just walked away while the employee continued to cook people's food.  Those who are getting their food delivered  would never know that the restaurant is not taking the required precautions.",
  "Asked for no mayo or onion. Guess they got that right but they DIDN’T include the lettuce, tomato OR the guac I paid EXTRA for. Check your food before leaving this place.",
  "Burger = good... \nSMASHburger = better...\nNot sure what best is but this is about as close as you'll get at a fast food joint."
 ]
},{
 "name": "Chipotle Mexican Grill",
 "address": "8100 W Crestline Ave Unit A1, Denver, CO 80123, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Chipotle is usually a reliable place to eat. The food is reliably good and the service is reliably quick. Well, tonight must have been an aberration. It took the line longer than usual to make our food and my wife had to wait about 10 minutes for her margarita. The dude who made it didn't know what went into a margarita, so he had to refer to the bar book. That's fine -- not everyone knows how to make a drink, or they don't drink alcohol. But, pretty soon, the line was stretched to the door, so he didn't really have any time to read the recipe.\nWe weren't upset. If anything, we felt bad because the staff seemed out of sync and they were probably stressed that the line was getting so long. At least the food was good.",
  "the lady behind the counter kinda tall  was uninterested and seemed bothered... skimped on barbacoa and the rice... if you don't like working there why don't you look for something else and stop making your company look bad and you skimping people",
  "Great service and everything tasted fresh. The new carne asada is delish!",
  "The staff at this store is Great! They are always friendly and willing to go above and beyond. The food is great too! The meat isn’t dry like others I have been too. They are fast and friendly as while as Clean! Thank you all.",
  "Rarely am I wowed by employees these days the crew working here tonight were above and beyond amazing they made my food like a perfect picture took care not to drench the food with salsas asking is this ok about the toppings I felt like they actually cared if my food was good just wow I’d give 10 stars is I could!!! Big thanks to the crew working here on 12-9-19 6:30pm keep up the great work team thanks again!"
 ]
},{
 "name": "Slife's Devil Dogs",
 "address": "5258 S Wadsworth Blvd, Littleton, CO 80123, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "cheap",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I love the hot dog stands that’s are outside of Home Depot and Lowe’s!! This one specially was bomb!! The guy working it is so nice too. The hot dogs 🤤😍 SO GOOD!!! Try this place out if you want cheap dogs that tastes great go here.",
  "Hunter was very polite and cheerful!\n Great service, great food! \nWe will definitely be coming back to try the other brats.",
  "Great guy and great food! Very attentive and makes you feel like you’re at home. Awesome service. Keep it up!",
  "Best quick meal in the southwest metroplex! Caring service with a big smile! Get the Cheddar-Jalapeno dog for a great treat-my favorite! Support our local veterans!",
  "Always a great place to eat for lunch. Quite a bit to choose from"
 ]
},{
 "name": "Crazy Pho You",
 "address": "8100 W Crestline Ave Unit A9, Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Pho 18",
 "address": "8100 W Crestline Ave Unit A9, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "delicious",
  "experience",
  "food",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Pretty good Pho place. I'm guessing its relatively new to the area. The place looked a bit empty when I came in. I ordered a combo noodle bowl. Ive eaten this a lot elsewhere, but this was really good. I'm hoping this place sticks around for a long time.",
  "Great new Pho spot! Good vibes, the owner was super friendly, and the pho is delicious. I also had a pineapple tea and it was nice and refreshing. Glad to have this spot in the neighborhood! Will be back.",
  "This is our family's new favorite Pho spot in town!  The food is delicious and the customer service is top notch!  The owners and staff are delightfully friendly and it just makes the overall dining experience that much more enjoyable!",
  "Food was prepared quickly. Service was excellent. Prices are good the only thing was that the noodles were a bit cold but still delicious. Must try for those pho cravings",
  "Clean space. Broth 3. Brisket not tender 3. I asked for vegetable instead of noodles—apparently not many people do that. But they did it for me and it was a good amount of meat and vegetable. I can speak to the other dishes, but as for Pho, I will keep on searching for my “5” place."
 ]
},{
 "name": "Ccr Galleries",
 "address": "7145 W Belmont Dr, Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Bowles Lake",
 "address": "Lakeshore Dr, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "energy",
  "run"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I pass this lake very often and like it a lot! It’s very beautiful at all times of the day and it is a decent sized lake. I appreciate the benches on the sides so that you can sit and enjoy the view. The grass surrounding the lake is pretty poky and so it’s not very nice to sit on or play duck duck goose in but that’s a minor issue. One time there was this  dude that passed me on my run and I got very negative energy from him so I just looked at the lake to avoid eye contact so it helped get me through a potentially awkward situation. Yeah, this is a nice lake surrounded by rich people’s houses so I’d give it a thumbs up.",
  "So much fun.  We walked along the lake and they have a beach for the neighborhood residence.  Wish I lived in the neighborhood.  Would be a great place for a BBQ.",
  "It's a beautiful area",
  "great",
  ""
 ]
},{
 "name": "Cimarron Trail Park",
 "address": "Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Cimarron Park",
 "address": "Littleton, CO 80123, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Such a great weekend",
  "My grandparents lived  here",
  "",
  "",
  ""
 ]
},{
 "name": "Cimarron Trail Park",
 "address": "5482 Bow Mar Dr, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.25,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "A wonderful park with ball fields and trails for walking. The Columbine memorial is there also.",
  "",
  "",
  ""
 ]
},{
 "name": "Wawaez games",
 "address": "5432 S Camargo Rd, Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Walter's303 Bow Mar",
 "address": "5194 S Lowell Blvd, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "drink",
  "delicious",
  "unique",
  "delicious",
  "food",
  "delicious",
  "family"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Great food and great service! The wings were voted best in the state in 2019 on Buzzfeed and are so good. I would recommend the pizza with green Chile and sausage on it. Worth the drive if you don’t live in the area!",
  "As a gluten-free gal, I know how difficult it is to find a good crust! I LOVE Walters’ crust! A nice chew, texture, and flavor! The service is great, even though their drink prices, in my opinion, are high. The toppings on their pizzas are delicious and I LOVE their Caesar salad!",
  "I am totally in love with this pizza place. It is my go to when ordering or eating at the restaurant. The service is always great! And the food is always delicious I have been to multiple locations and I have not been disappointed. If you like spicy my go to pizza is the Tahoe so unique and tasty. And the wings with dry rub are the best! Definitely recommend!",
  "Very disappointing. Not a fan of overcooked,  dark crust.\nMike's pizza is hands down the best value and quality in any zipcode on the south side.",
  "Pizza crust was so delicious and the house made marinara was a great compliment. The service was top notch (Ramsey) and they have a decent house tap menu. We will definitely be coming back!!! I look forward to future meals here with friends and family."
 ]
},{
 "name": "Car Wash",
 "address": "5200 S Lowell Blvd, Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "klhjj kjhkk",
 "address": "5186 S Lowell Blvd d3, Littleton, CO 80123, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Berry Park",
 "address": "3400 W Berry Ave, Littleton, CO 80121, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "A truly special place to memorialize Danny Dietz who died a valiant heroe in the Afghanistan war.  He was one that did not make it home as depicted in \"Lone Survivor\" the movie.  \nA special tribute to all who have given their tommorrow for our today!",
  "Great poke gym. It has a lot of raids.",
  "Fun little park for a quick stop to play. Most equipment is for younger kids (under 10 years old) but still fun.",
  "Love this park for my two pups. It's close to a school, and a larger park, seems there is always someone there, either other dog people, kids playing on the play set. Great place for a little picnic. Parking is very limited, but I've never seen more than one or two other vehicles there",
  "Nice quiet, green space to have a picnic."
 ]
},{
 "name": "Fraco's Bar",
 "address": "5302 S Federal Cir, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Low key bar with a great stage. The sound guy is fantastic and the dance floor is big. Great bands too.",
  "Great stage and live music. Nice people there too.",
  "Dang! This band \"Hardcastle\" is rockin'! When are they comin' back???",
  "Fun establishment good drinks and great venue. Fun game room as well ;)",
  "The place has been cleaned up and it's more of a comfortable atmosphere for drinks and live music. I've even experienced karaoke with a live band here. 👌"
 ]
},{
 "name": "South Suburban Parks",
 "address": "3200 W Berry Ave, Littleton, CO 80123, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Good golf courses fairly priced",
  "Small park,parking is ok busy",
  "Hidden secret to have lunch or dinner",
  "Smaller park with a playground for little ones. Lots of parking on 3 sides!",
  ""
 ]
},{
 "name": "Hello Sharpness",
 "address": "5201 S Federal Blvd, Greenwood Village, CO 80110, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Piccino Wood Oven Pizza",
 "address": "5350 S Santa Fe Dr, Littleton, CO 80120, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "drink",
  "delicious",
  "active",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This is the best pizza we’ve found in Denver! After 5 years of living here we finally found it, which is saying something since we are from the Chicago area. Crust was the perfect medium thickness, toppings were excellent. The artichoke dip was delicious! We cannot wait until we can dine in in person. Cannot recommend this place enough. All I can say is thank you.",
  "I've been driving past this place for a year and finally went in.  They have a great lunch special! For $10 you get a personal pizza, salad, and a drink.  The pizza was delicious with a killer crust!  I'm thankful they were able to make the order to go, so I could get back to work.  I will be visiting this place more often.",
  "Wood fired pizza at its best! This is great pizza with incredible quality ingredients and great flavors. Friday nights are busy with carryout due to stay at home, but worth the effort! Owners are amazing and very active in their day-to-day operations!",
  "I eat in this nice place from time to time! This is the best place to to have a good dinner.  I go there regularly. The cooking is very good, the team is polite and the price is reasonable. I enjoy eating in this restaurant to have a nice lunch.",
  "Wow, I love this place. We were roaming around looking for somewhere new to eat came across this place. We both got the lunch special came with drinks salad and a pizza all for $8. Such great pizza and salad. The food was excellent and the environment was very nice inside. Kind of quiet and it was nice with a small little patio outside. This place has a large menu if you are looking for something different. I love this place, I wish there was one close to where I live. Great place."
 ]
},{
 "name": "LaMar's Donuts and Coffee",
 "address": "5350 S Santa Fe Dr E, Littleton, CO 80120, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I scouted this place out online based on recommendations. I took a big batch of donuts to my work group that I was meeting for the first time. Let's just say it was a hit! Apparently I found the best donut shop in the Denver area. I definitely enjoyed them as well! Would highly recommend.",
  "Probably the best donuts in a 20 mile radius. This place has several amazing donuts, but the cake donuts are the real stars. Perfectly fried for a crispy texture, buttery cake and sweet glaze. If that's not your style, try our one of the others, or even get a fritter the size of your head. This place has been around forever, and once you try it, you'll see why. The staff is friendly. A donut destination, for sure!",
  "As noted the best holes in town",
  "They were open and along my driving route. The shop is tucked away and not easy to spot, but it's there. Having pre-selected dozens already made up was nice.",
  "Excellent service and delicious donuts. Love the Long John with custard filling. Cake and raised donuts all great. Grandkids loved to pick up chocolate milk with her patriotic sprinkle donut."
 ]
},{
 "name": "The Lost Cajun - Littleton",
 "address": "5350 S Santa Fe Dr F, Littleton, CO 80120, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I happened upon this restaurant by accident, so I stopped in. I've been sampling Cajun cooking in the metro area, and did not want to ignore the promptings of Fate or Chance! I ordered two bowls of gumbo for home. They proved to be very tasty. The roux was rich and spicy, and it seemed quite authentic. My only complaint: the ingredients were a bit skimpy. The clams and shrimp in one gumbo were rather tiny and bland. You couldn’t really tell one from the other. The other gumbo I ordered was chicken and sausage. The sausage pieces were small, and not particularly spicy; the chicken had been overcooked so it was only threads. The hush puppies, however, were quite good.",
  "Fantastic food! Everything we tried was wonderful. Fried pickles were amazing. They gave us a little sampler tray to try some of their items and we liked almost all of them. Too many things we wanted to try. Will definitely be going back!",
  "Always fresh.  Fried oysters and catfish just awesome.",
  "Everything was great. Loved the gumbo sampler it was hard not to just get a cup of them all. Server was great and friendly. I will definitely be back next time I am in Littleton.",
  "Good food and good customer service."
 ]
},{
 "name": "Panda Express",
 "address": "5350 S Santa Fe Dr, Littleton, CO 80120, USA",
 "avg_visitor_review": 1.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food",
  "walk",
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "This plase need to training better the asian lady ..shes definitely not friendly and rude basically we escape from the place definitely never come back to that location",
  "Ridiculously long wait times!",
  "Absolutely the worst panda  express I been too.. don't give enough portions of food , staff looks un experience! ,they dont pay attention to customers!,I waited in line for 20 minutes!  For food they didn't have prepared!  Horrible!",
  "Bad experience. They have signs up saying you have to order on the app but they are allowing some customers to walk up and order through the door.",
  "Healthy choices, the menu changes, so you can try new entrees."
 ]
},{
 "name": "Poncho's Mexican Grill",
 "address": "5350 S Santa Fe Dr unit c, Littleton, CO 80120, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "family",
  "food",
  "food",
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I came to Colorado with my mom and dad to visit family for a short weekend trip and we wanted to try some Mexican food. We came to this place and I have to say it has the best atmosphere and great service, plus great Mexican food. At first I had a tough time deciding between the pancakes, eggs, and bacon or the breakfast burrito with steak or bacon. I chose the steak and eggs breakfast burrito and when it came to the table it looked appetizing and was very delicious with the green salsa on top. Finally, the portions are great, nothing too big, and very authentic Mexican dishes too.",
  "Did not know $10 Fajita plates even existed any more. For the price these are best in town. Lot of food for the price and meet cut wide like I like it. Definitely a good place to visit and if your on a budget live.",
  "I ordered online and picked up my order. The process was very easy, and the food was delicious as always! This has been our Sunday breakfast spot for a couple of years. It is family-owned and operated, great food and service.",
  "First time trying this restaurant.... VERY  friendly staff and amazing tasty food!!! The portions were huge! Couldn't even finish half of my plate! Definitely worth the money and time!!! I will for sure come back to try different items! Be sure to check this place out! I Don't think you'll be disappointed!",
  "Everyone is very nice here!\nEverything is made fresh and is made quickly.\nThey have great cheese dip!\nJust tried the breakfast burritos and they are huge. Really nice flavor."
 ]
},{
 "name": "City of Littleton",
 "address": "2255 W Berry Ave, Littleton, CO 80165, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Dependable city management and services. The building is adjacent to a nice park and public space, with an EV charging station."
 ]
},{
 "name": "Geneva Park",
 "address": "West Crestline Avenue, Littleton, CO 80120, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "run",
  "kids",
  "free"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Pretty small park with lake to walk around.",
  "Beautiful park! Too much cottonwood flying around right now for me, but always a lovely time!",
  "Hi there, I went to Geneva Park with my daughter several times over the past few years and she really enjoyed going there...\n\nI didn't take any photos of the Park in metro Denver metro area when I was there during the day, but if you're able visit this Park in the future, I really recommended that you go to Geneva Park in the future. If you have any children of your own, please consider going to Geneva Park in the future. I really enjoyed going there with my daughter several times in the past few years. Woohoo!!!",
  "A nice park of trees and grass around a pond, a bit hidden behind the Littleton city building. Great place for a picnic or to let the kids run free. A big bonus is the public EV charging station in the adjacent parking lot.",
  "The attraction for us wasn't actually Geneva Park we watch the Littleton Twilight Criterium and it was absitively phenomenal a highly recommend spectating this National level sports event"
 ]
},{
 "name": "Arapahoe County Support Services",
 "address": "5334 S Prince St, Littleton, CO 80120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Slaughterhouse Gulch Park",
 "address": "5562 S Crocker St, Littleton, CO 80120, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "What an amazing trail! Lots of scenery and wild birds chirping. I went on a walk a couple days ago and the people on the path were so friendly. It's a great quiet place to bring your dog or even read a book!",
  "Love it. Pretty. Quiet. Clean.",
  "Very pretty and nice place to go for walks",
  "Beautiful..trucking beautiful",
  "Great for dog walking"
 ]
},{
 "name": "Big Dry Creek Trail at Progress Park",
 "address": "Englewood, CO 80110, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "New park.kids liked it.has sum shade which is unusual for parks.",
  "Love this park. So much variety of plants and environments to choose from. After a large storm there was a huge turtle on the shore. Fantastic sight!",
  "There are no trash cans. Other than that, it's lovely. Used to be a trash can near Prentice Ave. Miss it.",
  "This is one of the best parks in Littleton. A creek runs through it, there's a pond, a play ground, picnic tables,ball fields, bathrooms,and a covered shelter you can reserve.",
  "Relaxing walking path"
 ]
},{
 "name": "Powers Park",
 "address": "Littleton, CO 80120, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "kids",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Its small but my kids love it. Sometimes there are smoking teenagers or homeless people who sleep here and others who litter so its dirty sometimes with broken glass, alcohol bottles and cigarettes",
  "Just a 3 star park",
  "I love the baby swing cornerstone down the street doesn't have one",
  "Fun place for the kids to play and bike.",
  "Good park! Clean and the kids loved it❤"
 ]
},{
 "name": "Powers Park",
 "address": "Littleton, CO 80120, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Elati Park",
 "address": "5340 S Elati St, Littleton, CO 80120, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "New playground with 2 covered  picnic tables",
  "Diane know what it was or that it good called that",
  "Small lovely park. It's very neat and quite. Great for kids to play",
  "Not to bad, tucked away park. Kids were able ti get a hour of play in and had the park to themselves",
  "The children and they're parents frequent this park!  Great addition to the neighborhood!"
 ]
},{
 "name": "Big dry creek trail",
 "address": "Big Dry Creek,, Englewood, CO 80110, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I'm litteray walking it right now! Well kept beautiful bikeing and walking trail. Paved with great places to sit, chill, and bring your dog.",
  "Beautiful Trail nice to ride",
  "This is one of my personal favorite trails to walk or ride. Beautiful parks in one direction and multiple trails with great scenery along then all. You can walk this for miles.",
  "Always wonderful",
  "It's a big creek"
 ]
},{
 "name": "Papa John's Pizza",
 "address": "5194 S Broadway, Englewood, CO 80113, USA",
 "avg_visitor_review": 2.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "free",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "So far it's been a hit or miss, mostly miss. I'll get a pizza that looks like they ran out of cheese, pizza not completely covered with cheese. \nThis last visit was the worst pizza. Not completely covered in cheese, not well done and my veggie pizza had all sorts of meats mixed in. As a vegetarian that hasn't had pork, beef etc in over a decade, this was seriously disturbing. I emailed them letting them know of my disappointment, no response as of yet. So it bothered me enough to call the store and complain and ask how jalapeno and olives could possibly translate to Canadian bacon, beef, and whatever the other meat was. I guess I was looking for more reassurance on the QC, that they'd speak to staff to be more alert, or any suggestions for me to help them do their job right. The manager, Josh's response was basically , there's a  don't similar pizza on their menu  but that has meat on it, I don't know what happened, we're understaffed, but I can give you a free pizza.... I said fine, but I guess I'll wait a few months when they're hopefully adequately staffed and possibly interested in satisfying customers.\nJust all around disappointed in the quality of their product, lack of assurance, and customer service skills.\n  |\n  |\n V\nEdit 10/18/19\nCalled in my order, guy on the phone was nice and said it would be ready in 30. Got there a little early, pizza was ready, order was accurate, and the young guy was nice. I'll have to order when he's working. Faith restored 😎",
  "Great pizza every time. The new sandwiches we're so good. The meatball sandwich was sideways in the box but it just made it finger licking good.",
  "Normally have great service here until now. Was left waiting 2 hours for delivery then was told it would be another half an hour and then the order came the pizza was soggy and it was the completely wrong order. Not impressed. And papa johns would not even answer the phone after I had ordered it.",
  "Don't order the pan pizza. They don't know the difference between \"crispy\" and \"burnt\". Those are my pics of the top and bottom of my pizza. My daughter (who is NOT picky) tried eating a piece and couldn't. The crust was burnt and hard. It was late enough that we made something else and then I took the pizza back while my mom put the kids to bed. They did admit it was left in \"a couple extra minutes\"... Ya think??? Why the heck did you deliver it then?? A call to say we had to make another one would have kept me coming back, but the way they handled it has left me never wanting to come back.\nUpdate: it's been a year and still not back. I hope there's a better crew now.",
  "My partner ordered a pizza here last night. It was never delivered and while he called over 20 times the phone was never answered. He called this morning and someone answered finally and told him they’d process a refund but there wasn’t a single apology or explanation why this happened which is honestly just terrible customer service."
 ]
},{
 "name": "Old Santa Fe Express",
 "address": "5501 S Broadway, Littleton, CO 80121, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "family",
  "food",
  "delicious",
  "food",
  "food",
  "delicious",
  "unique",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "We stopped in on a Sunday afternoon with our family. The waiter was: fast, friendly, attentive, and was able to assist with the menu as needed. The food was delicious. The restrooms were clean and well maintained. I would recommend the Old Santa Fe Express to my family and friends.",
  "Really good Margarita delicious food highly recommend it I visit this place usually once a week",
  "Amazing food, great service, all around awesome place to eat. We got there 30 minutes before they closed by accident so we ordered some food to go. Even though it was take out, the food was still amazing and they even put some chips&salsa in the bag along with napkins and eating utensils. I also love their food because they give you pretty good portions so I normally don't finish all of mine but even when I reheat it a day or two later it's still so good.",
  "Always delicious and super friendly! We have been regulars for 7 years! The Jalapeno sauce is so good!",
  "Delicious food. Nice little spot in Littleton with friendly service. Tried their chile colorado burrito and glad i did. Never had a burrito so unique and good tasting. Girlfriend had the steak fajitas and they were tatsy as well. Good place to visit again."
 ]
},{
 "name": "Duffeyroll Cafe Bakery",
 "address": "5198 S Broadway, Englewood, CO 80113, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food",
  "delicious",
  "family",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Natasha is amazing! Her greeting made my day and her smiley send off was the icing on cake, or cinnamon roll ;)\n\nI used to live in Denver and everytime I visit I have to grab a Duffeyroll! This time I got an assorted box of minis to share with friends; however, my favorites are The Original and The Irish Creme. \n\nGreat coffee, great location with outdoor seating, and a must-see for tourists who want to experience an authentic, local Colorado treat!",
  "I am from Colorado Springs and this is worth the drive. My hubby and I had the breakfast sandwiches, oh my gosh!!! Mouth watering!!! So good. Their coffee is excellent. Their variety of cinnamon rolls is out of this world. Not to mention their smoothies. Like there's so much to say about the amazing food these guys make. #justspicedright I love.",
  "Love this place. Fast and friendly! Pick up a half dozen and enjoy the delicious variety. Duffeyroll is a staple to locals and a treat for anyone!",
  "What a great little place for sandwiches, cinnamon rolls, coffee and friends family! Mini cinnamon rolls try those then get a big one, all different kind of flavors! Recommend orange flavor and maple! Yumo! They have great turkey sandwiches also! Thank you!",
  "Once again I had a great experience at this restaurant.  The employees are helpful and friendly, going out of their way to serve.  The food and drinks were great too."
 ]
},{
 "name": "QDOBA Mexican Eats",
 "address": "5188 S Broadway Unit B2, Englewood, CO 80113, USA",
 "avg_visitor_review": 3.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "This Qdoba location has always been a winner for me. Most days there is a short line for lunch. Food is great, restaurant is clean.",
  "False advertising and poor customer service. \nI sent my girlfriend Down there to take advantage of the Valentine's Day Special .She was denied by an angry employee who obviously was abusing the little power she has. The Qdoba down the way honored the deal kindly .We will never visit the boof location again. When you disrespect others it reflects on how you think about yourself.",
  "First time at Qdoba. Customer service was disappointing. Tried to charge me extra for stuff I thought was no extra charge. Will stick to Chipotle.",
  "Quick-service and generous staff",
  "Love this place! Great post meal after a 2 1/2 hour work out!"
 ]
},{
 "name": "Waffle Works",
 "address": "Mobile, Englewood, CO 80110, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Brookridge Park",
 "address": "S Grant St, Littleton, CO 80121, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Greenwood Pines Park",
 "address": "5289 S Franklin Cir, Greenwood Village, CO 80121, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Where 1%ers of Denver don't use their park so it was great for me. Had the place all to myself.",
  " ",
  "",
  "",
  ""
 ]
},{
 "name": "Joellyn Duesberry",
 "address": "2800 Willamette Ln, Greenwood Village, CO 80121, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Artful Exposures",
 "address": "5205 S Steele St, Greenwood Village, CO 80121, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Marjorie Perry Nature Preserve",
 "address": "Greenwood Village, CO 80121, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "A hidden oasis of solitude. Love the place! I bike ride there on the Highline Canal trail. Lakes, wildlife viewing.",
  "Beautifull area, didn't get to see much of the preserve as I was on a bike ride and only stopped to see the area around us.",
  "Once you get past the elaborate houses it's a wonderful nature trail",
  "We are in such a lovely state! Awesome bike path",
  "It's lovely, but getting to be a little over-loved.  Avoid it on the weekends."
 ]
},{
 "name": "Cattail Park",
 "address": "7500 E Prentice Pl, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.5,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Open spaces",
  ""
 ]
},{
 "name": "Monaco - Crestline Park",
 "address": "6363 E Crestline Ave, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "The price was right.",
  "",
  "",
  "",
  ""
 ]
},{
 "name": "Running Fox Park",
 "address": "5290 S Quebec St, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "run",
  "peaceful"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "3.5 stars. Beautiful but small park. Immaculate man made pond with tiny waterfall creek. Good for brief dates, breaks from lunch, and wedding photos. (Which happened when I visited.) not big enough for large groups. Trails aren’t long enough to hold my attention walking. Great as a green oasis among the city with a couple coveted spots for picnics.",
  "Nice park in greenwood village, quite a bit of noise from Quebec street. The new pond, bridge, waterfall is nice. Love how they put small boulders into the curb, like they were there and they poured the concrete around it.",
  "Nice little park. I went to run, it's part asphalt and part trail. Goes through some neighborhoods, but overall a pretty area. Mid-day Sunday, almost 40 degrees. Saw a couple other runners and a well-behaved, leashed dog. I'll run here again.",
  "I took my dog to this peaceful, spotless park and we didn't have to sit in duck poo. The park is very well manicured with beautifully working fountains. It's nice to go to parks where bums aren't approaching us for stuff and surveillance cameras are around for added security. 5 stars.",
  "It was beautiful."
 ]
},{
 "name": "Pizza Republica Greenwood Village",
 "address": "5375 Landmark Pl Ste 113, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Absolutely love this place! I grew up eating authentic home cooked Italian and this brings me back. The meatball is to die for and everything else I've had here is amazing as well. Highly recommended!",
  "Great Italian thin style pizza with entertaining selection of spirits.  What is impressive is the variety of cured meats and cheeses with a full description of each type so that each person can tailor their own charcuterie.  Great happy hour daily from 2:30 to 6:30.  Staff is professional.  Landmark is a great location for dining,  entertainment and shopping.",
  "I had a Chicken Caesar Salad. The price was not reflected on the plate though. Small portion for the \"full\" order. The gentleman behind the bar was personable but when I didn't show any interest in getting a drink the customer service began to lack. Not saying I wouldn't stop in again but also not saying it's a first choice. I spent almost 30 bucks got just a salad.. 😳",
  "It's hard to call pizza healthy but this is as good as it gets. You can pretty much build any kind of pizza under the moon. Great service, great staff, great food, great drinks, great location. The pricing is appropriate for such great quality",
  "Great food and atmosphere. Never disappointed when we dine here. This visit our waiter, Jeb (hope I got his name right) who was awesome and exemplified their gold star customer service. He made suggestions, followed up and was attentive to the point of knowing what we needed before we had to ask."
 ]
},{
 "name": "JING Denver",
 "address": "5370 Greenwood Plaza Blvd, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food",
  "experience",
  "knowledgeable",
  "food",
  "food",
  "drink"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Good service and upscale interior. However, couples tables are extremely close during Valentine's day. (Literally only 2-3 inches apart). It's obvious they're trying to fit more volume, but it hurts the romantic atmosphere. \n\n Prices: majority of prices are $10-15 for drinks and $15-60 for entrees.",
  "Very cool dining experience.  Asian and American mix type of food. Cozy decor.  After 6pm hard to get inside. Very popular place. Get a reservation.  Food is great and coming fairly quickly.",
  "Our server (Justine) was amazing; checked in just enough, kept drinks topped off, and was very knowledgeable. She made the experience what it was. The food was amazing, albeit overpriced. Absolutely beautiful interior! Definitely a great spot for a special celebration. Highly recommended!",
  "Amazing food and the service was excellent. Went there last night for my birthday. The staff was very attentive and the entrees were fantastic. Loved the lobster dumplings, Peking duck and the beef tenderloin. All the sushi we ordered was also very fresh. It was a great way to celebrate my birthday.",
  "Great place to eat and drink anytime. If you ask you shall receive. They will go out of their way to make sure your happy. Just ask! Great atmosphere also. Will go again. Food is awesome!"
 ]
},{
 "name": "Lucy Restaurant",
 "address": "5345 Landmark Pl, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "experience",
  "food",
  "food",
  "experience",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "It was my first visit to Lucy. The menu had a great variety of items. I ordered the Blackened Chicken Alfredo and Seared Scallops. The food came out quickly, hot and tasty. I was going to a comedy show downstairs and the staff got my tickets for the show. The seats were upgraded for dining with the restaurant.\n\nIf you are looking for a good meal, I would recommend checking out Lucy Restaurant.",
  "Dined at this place with some friends before we went to the comedy show downstairs. It was great from the service to the food and the atmosphere. Prices are very decent for the higher class dining experience you get. I tried the brussel sprouts and southwest egg rolls both were really good. My friend got the roasted pumpkin kale salad and it was absolutely amazing! One of the best salads I've ever had!",
  "Awesome restaurant, awesome food, and awesome people who did wonderful things for all the rescues at the Stand Up For Pits comedy show. Our rescue was in the red when we showed up, and back in black by the time we left the silent auction. THANK YOU!!",
  "My boyfriend and I stopped by this place for the first time and had a great breakfast. The atmosphere is fun, the staff was really kind and fun, and we both enjoyed the food. Hannah was our server and was very refreshing to talk to and made sure we were taken care of. This place isn’t just a typical breakfast place, and was a great experience.",
  "Going above and beyond is at the core of this business. When we tried to order a specific kinda of mimosa that my friend had tried there months ago, Manager Travis went above and beyond, asking what was in it, remaking the recipe from scratch, and even offering to make up the honey syrup in advance anytime we planned to swing by, as long as we called. The food was also to die for (highly recommend the chili cakes!) over all this place deserves 10 stars for the staff's amazing attitude and the delightful atmosphere and food! Below is the honeysuckle mimosa recipe if you want to try it!"
 ]
},{
 "name": "Slattery's Pub & Grill",
 "address": "5364 Greenwood Plaza Blvd, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "creative",
  "food",
  "walk",
  "food",
  "drink",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Beer prices are good. Location is also convenient. But...\nUsed to have good quality food with seasonal updates to the menu that made coming fun and refreshing each trip. I'd often bring by friends before and after shows at the comedy bar across the way. At some point last year though I noticed a sharp change in the taste and quality of the food. After a few disappointing trips in I had to figure out what happened.  It was after talking to some staff it seems there was a change in ownership. You could notice a drop in taste and presentation. I asked why the place always seemed busy so cutting cost didn't seem necessary and I was told the owner didn't really communicate with the rest of the staff.  Chicken tenders used to be so good I loved getting off work down the street and coming by for made in house tasty beer battered chicken and a few beers, and now its processed meat that you could grab from Walmart/Costco for half the price and I would get a larger portion in a meal. Also the Irish staple corned beef used to have more flavor and was ready to fall apart. Now it tastes significantly lower in quality and is tough and cut too thick. It's a shame so many new owners make the mistake of sacrificing quality when switching over. Colorado has had sub par food for years but in the last 10 we've seen a boom in small restaurants embracing the creative side of food and making it from scratch. Quality shows hopefully they revert to the from scratch instead of fast food. They also seemed to have replaced most the male staff with attractive women which is awesome no complaints there.",
  "Happy hour is decent, but our server had a look of disdain when we ordered appetizers with our drinks when she first came by.  I had the urge to just get up and walk out, but once she composed herself things were fine.  I understand that happy hour is probably very busy at Landmark, but if you can't handle it, add more wait staff. Don't take it out on the people visiting your establishment.",
  "A great place to visit and have couple late night drinks. I think the place would benefit from having more experienced servers, it really seemed like the overall group was very young and even though I'm only 30 I couldn't make any meaningful connections with servers. The community around you though is amazing and its easy to mingle",
  "On Valentine's Day 2020, we had a group of 10 at Slattery's for dinner.  We had reserved the private seating area (curtained off) for parties.  Slattery's really took great care of us!  The menu has great food selections... the Slattery's Burger with a fried egg, the Lamb Stew, the Rueben, etc., but just as important, the service was terrific.  Our waitress was Odegard -- ask for her!  She got everything right, and got us across the street on time for our show at The Comedy Works.  Stellar service!  Highly recommend.",
  "Slattery's is a mixed bag:  Always a good place to get a drink but food is so-so.  We had some great meals there, we live just a few block away and have been going there for years.  I got one of the best hamburgers I've ever had there last year.  But, their salads which have always been great, have gone down hill with new owners.  The chicken they use to add to the salads use to be freshly cooked to perfection but now its always over cooked.  I am told that the chicken is now pre-cooked to speed-up turn around time.  And, I don't know what the white stuff is they are passing of as goat cheese - cream cheese maybe?  If anyone knows what this fake goat cheese is, please post.  Any way, we still go there now and again but where as everything on their menu use to be great now we have to be more careful what we order when we go, no more salads. Oh, the fish & chips is still great, at least the fish part of the meal is.   However, sometimes when you order a sandwich, despite the menu saying its made on sourdough bread, you might get it made on a ciabatta roll with the excuse, \"we don't have any bread\".  There are a couple of other pretty good restaurants  right next to Slattery's you might want to try."
 ]
},{
 "name": "Hapa Sushi Grill and Sake Bar",
 "address": "5380 Greenwood Plaza Blvd #101, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "delicious",
  "creative",
  "drink",
  "delicious",
  "creative",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Went for dinner on a friday eve with a couple of friends. Definitely recommend reservations as the place was packed. Sushi was a bit higher quality than other places in the area and is priced accordingly. As other reviewers have noted the magic \"mushrooms\" are a delicious starter. Also tried the multi orgasm roll which was amazing. For drinking, try the mango infused sake. Its served cold and is fantastic! Parking is simple in the garage across the street.",
  "The sushi was good and the service wonderful.  I do think they need a lunch menu or special perhaps. Having a small roll of sushi with just 4 pieces for $8.50 seems a bit high compared to other sushi places in the area.",
  "Tastes delicious and was so artistic. I would recommend coming at a time when they're not as busy and have time to be creative. Minmin and Skyler were friendly and gave excellent service.",
  "Wow, based on previous reviews we were already expecting this place to be good, but how great it really was, blew us away. Simply delicious fish, and creative but not awkward done rolls. The happy hour drink specials (in the middle of the weekend) was the cherry on top. If you like sushi, you have to try this place out.",
  "Good food.  Had their Happa Poke Bowl with yellowtail.   Very tasty."
 ]
},{
 "name": "Ted's Montana Grill",
 "address": "5370 Greenwood Plaza Blvd #110, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "experience",
  "knowledgeable",
  "food",
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Plenty of handicap parking behind the restaurant.  I had the Red Rock Chicken sandwich which was prepared to perfection and tasted just as good.  The fresh cut fries were absolutely wonderful, I would recommend ordering them a little crispy.  I finished with the brownie topped with ice cream, 2 of us couldn't finish it!  My daughter had one of their burgers with egg on top and a side salad. We both had ice tea. Service was excellent.",
  "Been here a few times and always have the meat loaf sandwich.  That and their fries are excellent.  I'm not a pickles fan but apparently everyone I've been with raves about those things.  Good vibe/atmosphere and service too.  Autumn helped us and was awesome!",
  "Incredibly polite staff. Wonderful interior and booths that don't make you feel you're eating with your neighbor.\n\nThe menu is very well laid out and has a good variety. The staff is also very knowledgeable about this menu.\n\nThe food is absolutely delicious and is prepared without too much of a wait. During our meal the staff was very attentive and prompt.\n\nFor the wonderful experience and great food I was surprised it was not as expensive as I thought it'd be.",
  "Hadn’t been to Ted’s Montana Grill for years since I lived in an area where there wasn’t one nearby. Now that there is one nearby it’s better than I remember! The food was great and our service was even better. Michael, our server was great all night. He was so awesome the entire night that we were so surprised to hear it was his first night. Great experience and can’t wait to go back many more times!",
  "Great burgers and service as well, I highly recommend this place."
 ]
},{
 "name": "Yanni's Greek Restaurant",
 "address": "5425 Landmark Pl #1951, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "family",
  "food",
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Wonderful little place. They had lemon soup, something we were hoping for. It was so good and tasted just like it should. Music wasn't blasting like it is in most restaurants these days, which was perfect because I was having dinner with a friend and we just wanted to sit and stuff ourselves with good food and catch up. We weren't the only ones either with that idea, there were a lot of others who just sat and talked and enjoyed. It was such a different atmosphere than most places I've been to in Denver- felt like visiting with family who feed you well. \nMy friend and I shared a couple combo platters, 2 cups of the amazing lemon soup and a yummy yoghurt with honey and nuts. The establishment is clean, staff are laid back but professional and the food is authentic and tasty.  I'm looking forward to coming back.",
  "Relaxed, easy pace, delicious food across the board. Friendly service. I picked it on a whim and I'm very glad I did",
  "I ordered the lamb souvlaki for a late dinner to go and it was fantastic. The lamb was cooked perfectly, and the side of beans and rice had great flavor.  The bread included was another phenomenal addition.\n\nThe staff was all very pleasant to interact with.  Will definitely be going back for dinner and glass of wine.",
  "First time here. Vibe was good! The food was different than anything I have ever had, which was very good. We ate a late lunch - about 2pm on a Friday. The service was a bit slow for there only being three couples in the entire restaurant. (Reason for four stars) The restaurant was very clean and loved the decor. If it were later in the day, I definitely would have tried a cocktail or three at their nice bar! Something I thought was a nice touch, was the gentleman who I thought was either the owner or manager, escorted us to our table. \n\nAs a side note: two young, nicely dressed, teenage boys, quietly entered the restaurant with their skateboards in hand. They walked over to one of the tables and sat down. Each had their own soda, and were there approximately ten mins. I was about 3 tables away from them and watched the entire time. The owner or manager saw one of the boys plus his phone into the charger on the wall next to the table he was sitting at. Very sternly he said, “ Do you have permission to do that?” Repeating himself again, the boys quietly said no. The manager/owner said you can leave. The boys in shock quietly, and politely gathered their drinks, skateboards and phone and walked out of the restaurant. \nNow, I say all this looking at it from both sides. As an owner you don’t want people/kids just plugging in and staying all day and not buying anything. But as a mom, I saw two very quiet, polite, young teens. One needing to charge his phone. Maybe next time the manager/owner could have not made a scene, and asked the boys if they were going to get anything, and maybe explain the way ‘his’ rules work.",
  "Food and service were both very good. Enjoyed this place and very surprised there weren't more people taking advantage of such a place  We will definitely return on our\nnext trip to Denver. Thanks, Yanni's, for an enjoyable evening!"
 ]
},{
 "name": "Early Bird Restaurant-The Landmark",
 "address": "5425 Landmark Pl #101, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "delicious",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "For the prices, the value did not match. The atmosphere is super cute and the service is impeccable. But we are here cause we came to eat food. I ordered  2 eggs over easy with corn fritters, chicken sausage and a cheddar biscuit. Eggs were done well, bravo to that cook. The presentation turned me off right away. The fritters (hush puppies) were floating around on the plate. Maybe put them in a cone vessel with parchment paper. Or just a boat to contain them.  Second the mini chicken sausage link was cut in half as if doing me a favor. Why can’t you just give me 2 links, like a normal person? Why cut 1 link to TRY and trick my mind like I’m getting something special. I feel like you won’t lose cost with the supply of 2 sausages for your paying guest? That’s a question.  Cheddar biscuit, dry. Old. It was HUGE and not served with butter or jam which I needed to ask for. Strange there isn't any on the table for a being a brunch place. Also, your doll house salt and pepper shakers are sad. That must be annoying for your servers to fill all the time. But also provide adults with adult size things. I know you have it in you. That dry cheddar biscuit...",
  "Heard many good things about this place and decided to go.  Our server was enthusiastic however the food didn't match his enthusiasm. The food took a lot longer to prepare and was only warm.  Overall the quality of the food didn't match didn't live up to the price charged.  Next time I visit Denver I might go elsewhere to eat breakfast.",
  "We love coming here for breakfast. Sometimes the wait can get a little long but worth the wait. The food was delicious. The service was attentive. Even though it was busy the food came out within a reasonable amount of time. Nice having this breakfast spot at the Landmark.",
  "The food here is good, at least on par with the restraints around, pleasant atmosphere and friendly service. \n\nHowever the prices are definitely higher then the competition for the same or slightly lower quality. $13.00 for a breakfast burrito. $3.50 for coffee (when the average is $2.50-$3). 4.25 for a side of bacon (when I can get an entire pack of the best quality for $5-$6 at the market 5 minutes away). These prices are just not reasonable for what your getting in my opinion, and not competitive with restraints in the area. Honestly I don’t think I’ll be coming back just because my money goes much further elsewhere. On the upside the wait is very short even during prime time on Saturday morning.",
  "I've been there a couple of times now. Each time has been great. The last time the sever was new and we had a small issue with our order. Overall really good food for the price."
 ]
},{
 "name": "Bad Daddy's Burger Bar",
 "address": "5380 Greenwood Plaza Blvd Ste 106, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I love this place! Delicious burgers and really tasty sweet potato fries. The service is good and the pricing is reasonable. I like this location a lot too, right in Landmark so close to other things to do after dinner.",
  "Best burger!!! Juicy thick tasty meat patty, duke mayo n being able to customize burger makes this place YUMMY!!! I really liked their chili.",
  "Delicious burgers. Several options available to customize your burgers. Their Bad Daddy's dip has a lovely flavor! The ambience is nice, and friendly and so is the staff. Would recommend it for sure. Also, they are open until 11 P.M.",
  "Eric truly makes this place remarkable. His service is top notch and he feels like an old pal, even though we've only seen him twice. Today we weren't seated in his section and he found a way to make our experience special by bringing us our food (to relieve bartenders). We always look forward to the food and the service here. It's worth the wait!",
  "I've been here twice now and their burgers are the best I've had in town.  They have a normal menu to order from or a create your own burger or salad.  I've only had the burgers but always consistent and they will actually cook the beef medium rare.  Two thumbs up."
 ]
},{
 "name": "Zeal Food DTC",
 "address": "5370 Greenwood Plaza Blvd Suite 107, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "delicious",
  "free",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Food was delicious!!! I can't eat egg or dairy so I love finding places that allow you to mix meat with otherwise vegan dishes (even though I ended up going with the tofu which was also really good). And the \"lil sundae\" tasted so authentically like real, dairy ice cream. Great, relaxed atmosphere. My server was Nicole and she was so kind and courteous! Would love to come here again.",
  "My wife and I LOVE this place for brunch, lunch and/or dinner! We've never seen it full, and we have no idea why! Very tasty and thoughtful plant-based preparations always impress. But, I'm a total carnivore, and I always leave satisfied. Even the music is chill and pleasant.",
  "Came in with my fiance tonight after looking for new places to try. They were very nice and welcomed us in even though they were getting ready to close. Not very many places do that now a days so it was appreciated. The waiter was so nice and very attentive. Tried the rainbow curry with chicken, my fiance had the grass-fed burger and we finished it off with apple crisp. Everything was so delicious. Will definitely be back!",
  "New favorite restaurant find in DTC! The restaurant itself is beautiful, open & bright. They cater to food restrictions like vegan, vegetarian, gluten/dairy free etc. They even made a point to check that i didn’t have any restrictions when ordering. The food is amazing! There wasn’t a single dish I had that wasn’t spot on. The dessert (the olive oil cake) was so good I was practically finished before I remembered I should have taken a picture 😂 .  I had the sweet potato bisque and the tofu tikka masala (photos below). If you’re in DTC, try this restaurant! You won’t be disappointed!",
  "Snooze was packed so we decided to try a new restaurant. GOOD GAWD this place is delicious.  I honestly haven't had this good of food since being in Europe.  The place was empty, (which was cozy and even romantic) which made no sense to me.  Snooze doesn't even compare, and I don't say that lightly because Snooze is good."
 ]
},{
 "name": "Monk & Mongoose Coffee Co",
 "address": "5370 Greenwood Plaza Blvd #109, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "delicious",
  "experience",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Love this place. The light atmosphere and friendly staff make this place very cozy and welcoming for every customer. I often visit it to have a coffee break, relax while sipping their delicious ice latte or hot cocoa. The service is also is on top. Thank you guys for maintaining such a friendly and cozy place.",
  "Modern, chic coffee cafe. Staff was friendly, lattes were fairly quick, chocolate croissant was delicious.. overall, it was a good experience! The atmosphere was nice too. It was crowded, but wasn't too loud like some coffee shops.. and the fireplace in the back of the room is a nice cozy touch.",
  "Monk and Mongoose is where it's at! There aren't a ton of non-chain, more local type coffee shops in the DTC, but Monk and Mongoose is all you really need. Their lattes are amazing—smooth, rich, and creamy. I went out on a whim the other day and tried their seasonal cranberry mocha. I don't typically like sweet coffee drinks, but this was the perfect balance of flavor and sweetness. The cranberry, chocolate, and espresso paired well together. I would describe this flavor combination as exotic. It was absolutely delicious and I wish it wasn't seasonal.",
  "Upon entering the facility I was impressed and flabbergasted by the amazing staff.  They were extremely helpful and charming. As an avid coffee consuming nomad I would say mark this on the map. 5$ gets you a very nice mocha. BRAVO",
  "For coffee enthusiasts who love the taste and smell of the coffee itself. If you're looking for a Starbucks feel, it's not necessarily for you, but there is a little bit of \"create your own\"&\"mix and match here\". I absolutely love it and recommend it highly!"
 ]
},{
 "name": "Scissors & Scotch",
 "address": "7600 Landmark Way #107, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "run",
  "family",
  "experience",
  "drink"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I can't recommend Scissors & Scotch enough.  I have been twice and became a member on my second visit.  By far the best grooming experience I've had since moving to Denver.  The staff always exudes positivity and professionalism.  The services rendered are above reproach, and will leave you feeling satisfied and confident.  You deserve this... make an appointment and head over there today!",
  "This place was amazing! I tend to put everyone before me, so I wanted to treat myself. It was absolutely well worth it. I went in there feeling so run down, and left rejuvenated. Tony did an outstanding job, he made me feel welcome; like I was at home with family and friends.",
  "Great staff and service, every visit. The ladies behind the bar are incredibly nice and very good at what they do. Everyone greets you and seems to really like working there, which is saying a lot these days.\n\nAs far as the barber and styling services, it's pricey but you get what you pay for here. I couldn't recommend Jen enough, as she's been my stylist for over 7 years now, and I'm sure the other barbers and stylists are also very good. \n\nCan't recommend this place enough!",
  "Killer cuts, killer drinks. Macy cut my hair and did an amazing job. Loved the experience.",
  "Amanda is the best stylist there by FAR! Everyone there including the bartenders and receptionists are so nice and professional. I never thought I would want to go hang out and have a drink while I get my haircut, but THIS PLACE is amazing! Worth every penny! Amanda knows how to cut my hair better than anyone I've ever gone to before."
 ]
},{
 "name": "Lila B. Lounge",
 "address": "5345 Landmark Pl, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Michael was so cool and inviting! There was a cool crowd here too.",
  "Quiet - intimate , until the comedy show let’s out , it then becomes  a fun little hangout bar",
  "Ate brunch here a few times before seeing a movie at Landmark. So good!",
  "Great food & Drinks and service",
  "Awesome happy hour menu! Drinks and starters are fabulous. Live music by Tyler Stanfield.....he rocks!"
 ]
},{
 "name": "Zurich",
 "address": "5445 DTC Pkwy #100, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  ""
 ]
},{
 "name": "Sandwich Board",
 "address": "5445 DTC Pkwy g10, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 3.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Good place for lunch. Convenient for the business day.",
  "Can we get friendlier workers?"
 ]
},{
 "name": "Cuba Cuba Sandwicheria",
 "address": "5322 DTC Blvd, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Loved everything about this place. The food was very tasty. I had a steak plate. The steak was cooked perfectly with grilled onions on top. The black beans were cooked perfectly and had tons of flavor. The restaurant is fast casual so I ordered quickly at the counter and my food was served within a few minutes.",
  "Get. The. Mojito. Heck, get everything! The lady who made our mojito made it the best one we've had this side of South Beach. For real. And the pork... Why do I ever eat anywhere else? Love this spot",
  "This place is excellent and broad, the menu was delicious and the prices were very reasonable. fast, productive service and very personal staff members. Recommended.",
  "The staff is amazing! The food is great! They always have really good specials each time I have been in.",
  "So good! The Cubano sandwich is exceptional and the service is good and fast. I will definitely be going back! Yum yum! Que Rico!"
 ]
},{
 "name": "Rmr Colorado",
 "address": "5347 S Valentia Way, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  ""
 ]
},{
 "name": "Prentice Cafe",
 "address": "8101 E Prentice Ave, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "affordable",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Good location and affordable price. Their sandwiches, salads, and lunch specials are soo fresh and great. Definitely recommend this place!!",
  "Ramen during winter is really good. Cheap and big portion. Worker was really friendly.",
  "Friendly service in a nice clean cafe, just perfect for when you are busy in the office but don't want fast food!  Small, but they offer quality so I will be going back!",
  "",
  ""
 ]
},{
 "name": "Lil' Ricci's DTC",
 "address": "5322 DTC Blvd #100, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 3.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "delicious",
  "food",
  "delicious",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "While the pizza was great tasting, it wasn't exactly NYC style. At this price, $24 for a medium, I was kind of expecting that real floppy, need to fold it to eat it, thin crust, big slice, experience. Again great taste...but that's about it.",
  "Always consistent and delicious.  Super nice owner.",
  "Places doesn't know the meaning of cooking good food. Ordered a calzone and it wasnt even cooked. The inside was dripping with water so bad I had to through it away. Will never eat here again.",
  "It's one of those stores which makes you feel like wow how did I miss their food till now. Great customer service with super delicious food. I tried calzones and was completely satisfied.",
  "Omg the best deep dish pizza I've had in a long time! It only took 20 mins to get a whole 16 x 16 deep dish, plus it was only $30 with a bunch of toppings (sausage, pepperoni, onion, green pepper, basil, and tomatoes). Such a great pizza for a great deal. Im gonna get like 4 meals out of this thing."
 ]
},{
 "name": "The Delectable Egg",
 "address": "5312 DTC Blvd #100, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "affordable",
  "walk",
  "delicious",
  "free",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Their menu had an amazing variety for all dietary needs, and the Bear Cake was a hit with the kids. Everything was cooked perfectly and tasted great. The size of the place is appealing as well, being larger it looks like it would be less likely to have massive waits like other breakfast places. Very affordable, averaged about $12/ea. Will definitely be coming back!",
  "Mike was fantastic, A+, best service I've gotten at a brunch place. Coffee is always amazing, but the whole meal was great. The hash had hand cut potatoes and baked instead of fried! Butter light and fluffy, with eggs just right. Really the best Delectable Egg's around.",
  "This is my go to breakfast place when I am in Colorado. \n\nWhen you walk in the feel is just right for a delicious breakfast, a jolt of coffee, and a good start to the day. \n\nTheir menu is solid and has a good range of breakfast choices that don’t break the bank. They also have a lot of gluten free options and my dad who can’t eat gluten much anymore loves their GF pancakes and waffles. \n\nRecently have been exploring their omelette and they do not disappoint.\n\nWhat is your favorite breakfast meal? \n\nIn short I would recommending you try the breakfast here and see if you also think it is eggceptional!?",
  "We came here the first weekend we moved to Denver on a whim and have been coming back ever since for the past 6 years.  Tasty food, attentive service, reasonable prices, and great location make this our go-to brunch place in the area.  Highly recommended.",
  "Nice atmosphere. Friendly staff even though they were under staffed. Food was good. Price is ok. Overall a very enjoyable breakfast."
 ]
},{
 "name": "Cherry Bean Coffee",
 "address": "5322 DTC Blvd, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.75,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Jen is the best",
  "Jenny is the best",
  "",
  ""
 ]
},{
 "name": "Crave Coffee Roasters",
 "address": "5322 DTC Blvd, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Very welcoming and interesting space, staff was super helpful and spotted me an extra shot in my latte. Not usually in this part of town but when I am I'll definitely be back. The industrial looking machine is their home roaster for their coffee.",
  "Great stuff",
  ""
 ]
},{
 "name": "Lindsay Park",
 "address": "8300 E Prentice Ave, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Quiet, small park located on the SW corner of E. Prentice Ave. and S. Valentia Way, between Prentice Place Lofts and Ricca Design Studio.  Includes a pagoda, a few benches, and nice tree cover.  This park is in named for and in dedication to James Peter (Pete) Lindsay.  Situated there is a centrally located placard placed in memoriam to him.  According to the placard, Pete Lindsay played an integral part in the development of DTC as a board member of the Goldsmith Metropolitan District.  His work was instrumental, affecting not just DTC's building architecture, but also its landscape and extensive parks.  \n\nI won't lie, this location is somewhat hidden/obscured by all the buildings around it and is close to the intersection of a couple main veins in DTC.  It is very small in size and not clearly defined.  If I hadn't seen the dedication, I would have just as easily thought of this as \"the landscaping area between two buildings\".  I found this place by accident or at least by happenstance. \n\nHowever, I felt it absolutely necessary to add this location to Google Maps.  DTC is a staple of prosperity, growth, and architectural aesthetics in the greater Denver Metro area.  This small park deserves to be noticed; it is part of a greater, grander system of parks and landscaping that defines the beauty of the area.  \n\nHere on a summer day I imagine it would be nice to gaze at the sky at sunset, as hues of gold wash over the clouds and reflect off the surrounding buildings.  A happy accident.  Thank you, Mr. Lindsay."
 ]
},{
 "name": "Tavern Tech Center",
 "address": "5336 DTC Blvd, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "drink",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "We super liked this place when Shannon was working there.  Great food and service was spectacular. \nWe went there after she left and the bartender was great.  The food was also the same. \nMy only complaint would be to monitor the DJ on Thursday night.  Her music choices should be left on the playground.   We are adults with grown up taste.   It would be better not to play anything.\nBut for everything else,  good job!\nThank you",
  "Great happy hour specials and food was wonderful. I had the blt club on a croissant and my friend had the volcano burger! Fast friendly service, ask for Jay....he's the best waiter!",
  "Food and drinks were really good. Waiter was helpful and friendly but forgot to enter order for our appetizer. Ambience was nice. Restaurant was clean and all staff we encountered were very welcoming and friendly. Would definitely return there again.",
  "Did the Bloody Mary bar for brunch and it was fantastic.  A great selection to assemble your drink.  The food was hardy and was great on a Saturday morning.  We arrived shortly after open and the service was extremely quick.  Even after about an hour and a half there it wasn't too busy and service was quick.",
  "Stopped by for a whiskey sour, bacon cheddar burger, and some hockey. Left after enjoying all three and didn't put a huge dent in my wallet. Will visit again."
 ]
},{
 "name": "Burnt End BBQ in Denver",
 "address": "5332 DTC Blvd #100, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Have been eating here for years, and they have never disappointed. The food has always been delicious and the staff is always friendly. The bronco platter is hands down the best BBQ deal in town. Thanks Burnt End for the great food!",
  "Came in for restaurant week, great service, very friendly, we had 2,2 meat plates (brisket, Turkey, pulled pork and sausage) all the meats were tasty as were most of the sides.   The Mac was disappointing, but the beans, corn bread and wedges were awesome.   Also have a pretty good beer selection on draught.   Reason for 4 stars, our food was Luke warm at best and they were out of fries, brownies, burnt ends and wings.  Would surely return, just hope food will be hot.   They offer military discount!✌🏽",
  "One of my favorite BBQ places in the Denver area. The staff are friendly, efficient, and great to interact with. The place is kept clean. The food is great and priced reasonably. I totally recommend trying the brisket and the burnt ends. Overall I fully recommend giving them a try!",
  "Awesome (huge)  smoked wings.  First time eating here and loved it. I wish that the Carolina style sauce wasn't so spicy but otherwise amazing!  Boyfriend got the dtc bowl. He must have loved it too cause he ate every single bite.",
  "I have eaten here a few dozen times now, and I have to say their burnt ends are good, and the sauces are good, but the rest is lacking. the brisket thr last few times has been overcooked, dry, and bland."
 ]
},{
 "name": "ASA Sushi",
 "address": "5302 DTC Blvd #100, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience",
  "food",
  "delicious"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Complete surprise for anyone who loves Sushi. My wife and I had the best service and food here on Valentines day. The sushi was the freshest we ever had. The Hawaiian role was the best one by far to experience. We're incredibly grateful for the experience and cannot wait to go here again with friends.",
  "This place is YUMMY! My husband works nearby, so I meet him for lunch sometimes and this is my favorite place to go. They have wonderful sashimi and I love their cucumber salad. I’m obsessed with their fatty tuna, I could have that everyday for the rest of my life and be happy. It’s seriously the best. The service is always wonderful, the restaurant is clean and quiet. So unexpected for such a busy strip center. I just love this place!",
  "$17.00 for 2 tiny little, literally 3 cm pieces of beef in a mountain of fried noodles. Literally. Like there isn’t any meat on the dish. Why are you people rating this place 5 stars? Biggest ripoff I’ve ever seen in any restaurant in this entire city, hands-down.",
  "I pick up lunch for my boss often and it is always fresh and ready when I arrive. I don't know the girl's name behind the counter, but she is always super sweet.",
  "Great vegetarian options! Enjoyed so much the Angry Edamame and seaweed salad appetizers with the all vegetable roll, and veggie caterpillar roll!!!! Very fresh, delicious, and great service! Also, my friend has a gluten allergy and they were attentive to accommodate her needs! Check them out! :)"
 ]
},{
 "name": "Hoffman Park",
 "address": "5302 S Boston St, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 4.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "family"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Very nice and quite park, my almost 2 year old had fun running around.",
  "Hideaway park small and quiet",
  "I enjoyed my walk here Friday, its just beautiful",
  "Great small park with lots of big awesome shady trees. Excellent for an afternoon picnic with the family away from crowds. Decent playground equipment for toddlers and even sand to dig in!",
  "I'm sure this space was great at one time"
 ]
},{
 "name": "Francis H. Williams Park",
 "address": "5730 S Florence Ct, Greenwood Village, CO 80111, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Jeremy and David cleaning windows for our personal company DJ Windows!!!!It was fantastic customers were welcoming and enjoyable to work for.",
  "Walking my dog here, great place for kids!",
  "Quiet clean and relaxing",
  "",
  ""
 ]
},{
 "name": "Bear Park",
 "address": "5361 S Havana Ct, Englewood, CO 80111, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "kids",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "REALLY clean park, a quiet neighborhood, with lots of stuff for the kids to play on, as well as a large open grassy area, complete w tree carved into a BEAR!!! PRETTY COOL!",
  "This place would be a great place for children of all ages... But, there is profanity and vulgar depictions scribbled all over the playsets.",
  "its a really nice place although seems like a spooky abandoned place ahahaha. there's a playground for kids on the other side of the bridge over the creek. saw a few people fishing at the creek only enhanced the beautiful view. cars aren't allowed inside the park although there's a parking place at a corner by the entrance",
  "Park is always clean and well maintained... I only wish that the tennis courts are public and dont need a key.",
  "Nice place. Good for kids"
 ]
},{
 "name": "Jason's Deli",
 "address": "5440 S Parker Rd, Aurora, CO 80015, USA",
 "avg_visitor_review": 5.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "delicious",
  "delicious",
  "food",
  "run",
  "experience",
  "food",
  "free",
  "food",
  "free",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "The staff was very friendly and informative of their system and menu. The manager refused my tip and insisted I give it to a fellow employee of his instead of himself. Major act of humility! Salad bar was delicious and the customer service was stellar.",
  "I haven't had Jason's in 5 years since I moved to an area that doesn't have one but was pleasantly surprised to find myself just down the street from here while working in the area. It didn't disappoint! One of the only chain places I look forward to visiting! Friendly faces and delicious food! 😋",
  "I had a great customer service experience here today! I ordered food online and paid in advance. Then I got super busy at work and couldn’t run out to pick up my food until TWO hours later. I fully expected to just pick up my food and warm it back up in my office. Instead, my food wasn’t sitting there waiting for me and all of the employees knew who I was, and anticipated remaking my food whenever I did come in. They made my food fresh for me, assured me they didn’t want me to eat my cold, two hour old food. It was so nice!",
  "Great food and free ice cream!   It's a great place to grab a bite to eat and they have a diverse menu to choose from as well as a full salad bar and soups!",
  "Great selection of food. Large salad bar, huge sandwich menu, wide variety of soup, nice atmosphere and friendly service. And free self serve soft ice cream cones for dessert. Nice touch. Highly recommend."
 ]
},{
 "name": "Sabor",
 "address": "5350 S Parker Rd, Aurora, CO 80015, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "If you want some Mexican fast food this is good place for it just remember is fast food. the food is not very flavorful and place can be cleaner. Also they yelled the items in the order instead of the customer's name so you might get confused with someone else's order. Price is good.",
  "We wanted to try this place out since it has good reviews and it is close to home. We went through the drive thru and had to wait a bit even though the restaurant wasn't busy at all. The staff was friendly and apologetic about the wait but when we got home the food was lukewarm at best. Even the green Chile on the burritos was cold. Maybe we should have gone in but we literally live two minutes away so even if the food was hot to begin with it shouldn't have gotten cold so quickly so the food must not have been warm to begin with.",
  "Great food and service. I loved their tacos and the fact that they have lots of options while ordering a plate of food. I liked the black beans option. They also had a bucket load of different types of salsa.",
  "Food here is unfortunately just not good. Sub par service. Wanted to love it because I live so close but wont be back.",
  "Wow!! I feel like I got special treatment. \nEverything on point!... portions, price, flavor, service.\nThe only way I was able to bend the laws of physics and get the whole thing inside me was because the Sabor, I mean flavor kept me going till it was all gone!"
 ]
},{
 "name": "Thirsty 30 Craft Kitchen & Tap House",
 "address": "5428 S Parker Rd, Aurora, CO 80015, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "drink",
  "free",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "We were half an hour too early for brunch and didn't realize it because the doors were unlocked but the people were super cool and seated us anyway. The french toast was really good, loved the bacon and I usually don't like breakfast potatoes but boy, were they seasoned great. All of it was super tasty. The bar looked like it had around 30 beers on tap. Guess we'll have to go back for happy hour!",
  "This place burgers are one of the best here in Co/ Parker, they pretty much make everything from scratch from the buns to the pickles. Last hour not least there prices pretty good as well!! #mggritz",
  "I enjoyed the beverage selection and rotational taps, my wife and I were also given 2 free drinks while the bartender was making up new creations which was cool to be samplers. It is veteran owned and veterans get discounts which is always a positive. Food was great and came out hot and fresh. \n\nThe seats were not filled however and could be due to location and advertising. But it is a great stop for a quick bite and drink or to enjoy evening trivia.",
  "We are trying to support local restaurants during the \"shutdown,\" and decided to finally try Thirsty 30 after telling ourselves we needed to for some time. Placed a phone order and the food was ready when we arrived to pick it up about 20 minutes later. Everything was terrific: Barbacoa Burger, Loaded Tots, Apple Harvest Salad. The burgers were sided with roasted Brussels sprouts! The sprouts will make believers out of anyone. Will definitely eat there once this stuff is over.",
  "Great wings and lots of fun playing bingo!"
 ]
},{
 "name": "Shipley's Donuts",
 "address": "5400 S Parker Rd, Aurora, CO 80015, USA",
 "avg_visitor_review": 4.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "I feel like I am in a relationship with these donuts. We have a group text about them. We share photos of them. My husband makes plans around them. I preplan the flavor to order. Life is good with Shipley's.",
  "Decided to try Shipleys on an early Sunday morning. I love donuts and they did not disappoint!! So delightful and fresh! We enjoyed all of the ones we tried!! Large dining area inside, but we got them to go. We tried the sausage, cheese and jalapeño kolouches (I’m probably spelling that wrong) but pretty much a breakfast roll with different fillings. We also tried the ham and cheese. Simple and delightful. We’ll definitely be back! Also, great customer service!!",
  "I never leave a review, but my level of disappointment has never been so high. First time to this place, went through the drive thru and ordered a half-dozen iced cake donuts and two filled bars and a cappuccino. I specifically asked for chocolate frosting and sprinkles for the cake donuts. When I got home to see, only one of the cake donuts of the half dozen was frosted and it was nothing like the order I wanted. The employees did not mention that they were substituting the donuts in any way. I feel that I wasted my money and will not be going here again.",
  "Love the kalaches and the donuts are great. Coffee is pretty good as well. Employees and the owner are very friendly and up beat. Great place to meet up with a few friends to sit and chat. Would be a good place to get donuts for any office get together or meetings.. Much better than that dunkin place for sure.",
  "I came in and ordered seven dozen at the counter and prepaid for an additional 10 later in the week. Although there was a little bit of shock at the time of order they gladly boxed and prepared everything in a timely manner. Clients prefer these over other brands and the area. Definitely recommend"
 ]
},{
 "name": "Jabanero's Mexican Grill",
 "address": "5584 S Parker Rd, Aurora, CO 80015, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "family",
  "delicious",
  "food",
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "I’ve been coming here since the day they opened with no complaints. They are the only place I’ve been able to find good spicy green chili and a great burrito. The owner and her family are amazing I 200% recommended this place.",
  "First time visiting but I was very impressed with this place. Friendly, clean, comfortable. I ordered a breakfast burrito smothered and was delicious!! Watch out for the hot. They finish the burrito on a panini press which puts it over the top. I will be back!",
  "I've driven by this place a million times.  Finally went in for breakfast burritos this morning and they were pretty good!  Comparable burritos at other places cost double the price.  It was an inexpensive, filling, tasty breakfast.",
  "This place is amazing the owner always says hi to my kids,my husband and I, \nMost Mexican food in Colorado isn't very good but I love the food it's the best I've had in a restaurant here in Colorado.",
  "The food is pretty good. Not huge portions but very filling. The green chili is very good. The only downside is that the restaurant is on the small side. It can make you feel rushed to eat when you see a line forming at the door without any seats available."
 ]
},{
 "name": "Indian Ridge Samsung Galaxy Project",
 "address": "16501 E Progress Dr, Centennial, CO 80015, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Crestline Park",
 "address": "Centennial, CO 80015, USA",
 "avg_visitor_review": 4.8,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "walk",
  "kids",
  "walk",
  "run",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Beautiful park. Nice path and playground. Easy to access. Paths do get very icy in the winter.",
  "Beautiful community park. The kids love the play area and open field. Also, a great place to walk the pups and if you can go towards early evening you can smell the foliage.",
  "Quiet place to take a walk or sit and read. Also a large field and basketball courts for activities.0",
  "A pokestop and a gym here very nice 👌",
  "The new playground is really fun. My kids love to play while I run laps in the park."
 ]
},{
 "name": "Arapahoe County Open Space Grant Supported Project",
 "address": "17230 E Progress Ave, Centennial, CO 80015, USA",
 "avg_visitor_review": 3.5,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "Pretty as ever",
  "",
  "",
  ""
 ]
},{
 "name": "Smoky Hill Park",
 "address": "Centennial, CO 80015, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Goldrush Park",
 "address": "Centennial, CO 80015, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Big Sandy Park",
 "address": "17903 E Progress Pl, Centennial, CO 80015, USA",
 "avg_visitor_review": 4.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "kids",
  "walk"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Its small but great place to bring the kiddos.",
  "Nice little space close to home to get outside with the kids. Basic gravel playground with see-saw and swings. Lots of open grassy area to kick a ball around.",
  "Small park with a nice field and a bike path. Backing up to smoky hill, the traffic is sort of loud. The park has a pokestop and gym if anyone cares anymore, but it's pretty small, as far as the playground goes. Nice place for little kids. There is no parking, but you can park in the street behind the park. Not much entertainment, but it's not usually busy and it's got a book box. I'd recommend it to people with kids around 5 years old.",
  "Good place to walk.",
  "Dog friendly, large open fiels and a nice playground for youngins"
 ]
},{
 "name": "Arrowhead Park",
 "address": "Centennial, CO 80015, USA",
 "avg_visitor_review": "",
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": []
},{
 "name": "Sonic Drive-In",
 "address": "18535 E Smoky Hill Rd, Aurora, CO 80015, USA",
 "avg_visitor_review": 2.4,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "experience"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Used to be good. Now missing items and wrong burger orders. Been disappointed enough by this location. Don’t waste your time.",
  "This place used to be good. Now it's not. Everytime I go there, there's some sort of issue, whether it's drive thru being incredibly slow, my order getting messed up, or my shake taking 15 minutes to get carried out, causing it to be melted. I really don't mind driving the extra few miles to go to a Sonic just to avoid this one even if this one is only a mile away from my house",
  "\"let's create the tightest drive through ever and then put lamp posts and rocks all along the sides so that people have a hard time getting through. that'll be great...\"",
  "My boyfriend and I were so excited to see a sonic, as we don’t have any in the Seattle area. We stopped in and pulled into the stall, as we have always done, and waited. And waited. Finally, someone came on and said they would only help us if we came through the drive thru. Not a problem, but why still have the stalls set up if you aren’t going to service them? They weren’t busy, it was likely just inconvenient for her, as I saw her go out to another car while we were sitting in the stall eating.",
  "Big tasty portions at lightning speed. Drive-in location, so no bathroom or dining area or even register. Good deals: half price iced drinks 2-4pm, chicken, burgers Tuesdays and Thursdays. Great experience if you already like Sonic like me, and my wife's first time which she also enjoyed. Will go again."
 ]
},{
 "name": "Corner Store",
 "address": "18565 E Smoky Hill Rd, Centennial, CO 80015, USA",
 "avg_visitor_review": 3.2,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [],
 "source": "GoogleMaps",
 "reviews": [
  "remodeled inside now and has a few new employees.  Has ruffles and doritos usually along with arizona iced tea and sometimes slim jims.  Planters peanut sections and postachios, milk, and maybe a hot dog rack if you're lucky (don't remember).  It also has some sort of soda/slurpy machine I never use.",
  "This place charged me and didnt even give me gas. And the workers couldn't even speak English and refused to help me. ",
  "Always convenient",
  "Great selection. ",
  ""
 ]
},{
 "name": "Papa Murphy's Take 'N' Bake Pizza",
 "address": "18525 E Smoky Hill Rd Suite J, Centennial, CO 80015, USA",
 "avg_visitor_review": 2.6,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "food"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Love the Pizzas as always but my wife did an online order for me to pick up and they neglected to give me her salad after I tried to verify I got everything...probably wont be back to this location.",
  "We keep getting pizzas whose tray burns and our house is filled with smoke as a consequence. They need to fix this before we decide not to order from them any longer.",
  "This was my first time trying Papa Murphy's and probably my last. For having to cook the pizza myself it was way over priced. I payed $23 for 2 medium pizzas. One with no toppings and the other with two toppings. I would guess that this cost them maybe $4. That is a huge profit in which they don't put back into their ingredients.  It was just okay.",
  "First when I called in the music in the background was so loud the person couldn’t hear me. I told him he might want to turn down his music. \nThe person working the phones was not  competent. I placed an online order at the wrong Smokey Hill location. First he said it would take 5 minutes to find my order, the. When I said it was the wrong location he said he didn’t know how to reverse the charges for on-line orders. Really!!! Train your people better.",
  "Very busy place tonight! The staff were amazingly kind, incredibly professional, and working ever so fast! Papa Murphy's should be very proud of their staff at their Smoky Hill location! The food was so good! Well done!"
 ]
},{
 "name": "Pioneer Park",
 "address": "Aurora, CO 80015, USA",
 "avg_visitor_review": 4.0,
 "avg_time_spent": null,
 "photo_location": null,
 "tags": [
  "kids",
  "family",
  "kids"
 ],
 "source": "GoogleMaps",
 "reviews": [
  "Fun and family friendly. Soccer field and playground for kids. Picnic tables. Not crowded.",
  "Alot of people come her to smoke and get high here but overall the park is good just by its self it has a soccer field and a littl playground.",
  "I love coming here to hangout with friends. Great place to take kids!",
  "Nice field for soccer practice...",
  "It has a playground and soccer field. No bathroom and walking trail is limited"
 ]
}]
