[
 {
  "name": "Denver Botanic Gardens",
  "address": "1007 York St, Denver, CO 80206, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c041381c-932f-11ea-8b0c-14b31f159f22.png",
  "tags": [
   "music",
   "nature",
   "kids",
   "unique",
   "food",
   "nature"
  ],
  "link": "https://maps.google.com/?cid=6704051071303811988",
  "source": "GoogleMaps",
  "reviews": [
   "Whether in town for a couple days or a permanent resident of Denver, this is a MUST visit Denver attraction. The gardens are absolutely beautiful. They are open year round and every season brings something new. Additionally, they have great events ranging from music and concerts in the summer to their spring and fall markets to Blossoms of Light in the Winter. There really is something for everybody. Also, you can't go wrong grabbing a snack at their cafes.\n\nThe gardens offer a breath of fresh in the city. Its just another reason for you to spend more time outside.",
   "This place is beautiful!!! I always get amazing photos! I have never had a bad experience here and I've been going here for as long as I can remember! This place has an amazing landscape. I would recommend if you love flowers! It is so peaceful here! You can just sit with nature and enjoy it all.",
   "This is a very nice place to spend the day. There's so many beautiful plants and pools as well as some cool stuff for kids. I especially like the Japanese garden. It just was so peaceful. The Greenhouse area is also really cool. The plants in there are wild! Five stars!",
   "We visited during the week and it was not crowded at all. We strolled and enjoyed taking our time. I imagine that it probably would be more lively during the spring and summer months, but we still thought most parts were beautiful. The gift shop had a wide selection of unique things, but I wish more items had “Denver Botanic Gardens” on them, so that I could have bought some souvenirs. I loved the painted canvas greeting cards, though. Overall, it was great and definitely worth the visit!",
   "Came here after a work trip and loved it. It's a great place to sit and enjoy being outside to enjoy nature. There are several areas including a huge greenhouse and some water gardens.  The photos of this place do not do the beauty of the gardens justice.  They offer lunch there at the bistro and the food is very good."
  ]
 },
 {
  "name": "Downtown Aquarium",
  "address": "700 Water St, Denver, CO 80211, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0a2e06c-932f-11ea-bfd6-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "food",
   "unique",
   "kids",
   "food",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5731122937697157734",
  "source": "GoogleMaps",
  "reviews": [
   "Nice place to visit once in a while. The exhibit walk through is nice and engaging. I don’t like that you have to pay for parking and the tickets seem overpriced. I wish that you could walk through more than once but you can’t. The restaurant is beautiful, you sit next to huge fish tanks and the food is good too!",
   "We really enjoyed our time in the aquarium.   The exhibits are well done.  We had dinner after at the restaurant.   They went out of their way to take care of us and the chief even came to our table to discuss the menu and my allergies.   They made substitutions for us.  Great service and good food.   Best new England claim chowder I have had in years.",
   "Our kids love this aquarium. Especially the mermaid shows. That is something that we found unique here in Denver. Although the parking is not the best here (parking here is paid and across the street) we never had difficulty finding a spot and promptly get to the Aquarium. Also, a Royal Bengal Tiger in an aquarium! That was something unique too.",
   "Very nice! Swimming in the pool with the fish, sting ray and eels was fabulous! The food from the restaurant was terrific and the birthday cake was yummy. We were there for a birthday. 🎉The exhibits were all really wonderful so cool! Plenty gifts in the gift shop. The party guides were very helpful and nice to my 2 children which was very good. Out of all the exhibits the best was the shark tank. We saw very cool sharks and people were in the pool! You should really think about going...👍",
   "This place is a ton of fun. Not horribly priced and it’s good for kids and adults which I always enjoy. Took my boyfriend here on a date and we had a blast, a lot of cool stuff to look at and fun little interactive things to do. Just go on an off day as weekends are typically insane here"
  ]
 },
 {
  "name": "Denver Museum of Nature & Science",
  "address": "2001 Colorado Blvd, Denver, CO 80205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c0efc882-932f-11ea-b4c7-14b31f159f22.png",
  "tags": [
   "free",
   "kids",
   "free",
   "organized",
   "art",
   "drink",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=14789549545145786897",
  "source": "GoogleMaps",
  "reviews": [
   "We LOVE our museum! They always have great new exhibits and the tried and true exhibits never get old. We especially enjoy the Hall of Life and make sure to check out the Expedition Health interactive short film in the back! The IMAX is also great! Don’t forget to check for Free day’s but be prepared for it to be packed. Weekdays are best and you can be sure to have the run of the museum after 3 pm. It closes at 5 pm. A must for residents and visitors alike!",
   "Extremely wide variety of exhibits, plenty to do for kids. Workers have the most upbeat attitude and are pleased to help with any questions or interests. Clean and organized. Always have something new. Would recommend to anyone. They have free days for a variety of events and causes. Almost not enough time in one day to see all of it but worth the extra visit to see it all",
   "Lots of cool exhibits all in one place. Overall the exhibits were very well thought out and provided a lot of interesting and fun information. The amount of detail that went into the animals in the wildlife area was amazing. Some of the interactive exhibits need a bit of an update. And in the Space Odyssey exhibit it would be nice to see the significantly high quality images available from NASA. I would definitely come back to the museum and am going to suggest it to others.",
   "This museum covers so much, ranging from animals, science, culture and prehistoric era, etc. The work, art, and the details of the wildlife exhibits are simply amazing. I spent the entire afternoon, yet I hadn’t even read the descriptions; that tells you how big the place is and how many things you can see here. The mummy section is a little small, it’s probably better to make this theme bigger or simply remove it and change it to something else. But overall the experience is definitely a wow.",
   "This place is so cool. The rock and gem exhibit was definitely my fave but my three year old niece preferred the adventure center for kiddos. And the space exhibit was also amazing and fun for kids and adults. Fwiw, the kids hot dog meal is definitely enough for a grown adult. A small drink, a side of tots and cucumbers, and a half lb hot dog for 5.75."
  ]
 },
 {
  "name": "Denver Zoo",
  "address": "2300 Steele St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1408066-932f-11ea-9719-14b31f159f22.png",
  "tags": [
   "learn",
   "family",
   "food",
   "drink",
   "food",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=6052009770394020905",
  "source": "GoogleMaps",
  "reviews": [
   "Great way to learn and spend a day with family! I love that they are always working to expand and make the exhibits for the animals better. My favorite exhibit is the monkeys. I like that they have real trees to climb and can go inside and out freely. \nThe food is good there as well! I would recommend the Pineapple Dole Whip, it is just like ice cream but much healthier.",
   "The animals are easy to see with the well designed exhibits. Bring an umbrella on a hot day for shade; there are some long stretches of parts without shade. \nThe zoo does a lot of animal encounters and educational shows/activities throughout the day! So fun!\nFood and drink are pricey but you can bring in your own meals.",
   "We just got a membership, and although I’d love to give 5 stars, the limited accessibility of the zoo makes it hard for me to enjoy it fully. There are several bathrooms without automated door buttons and several exhibits I could not enjoy because of my wheelchair. My kids and husband had a wonderful time, and I did too, but I can’t give it a better rating than three stars. The paths are very uneven and it’s incredibly difficult to wheel around. I would have rented a scooter but they charge $30/day!",
   "As an Aurora Native, I have been visiting the Zoo all my life. As far as the dozen or so Zoo's I have visited, it is pretty good. They are always making improvements. My favorite attraction is Tropical Discovery (I could watch the bats all day!). The Zoo is building new attractions currently and I look forward to seeing the new Stingray exhibit. The giraffes, the primates and the pachyderms are also nicely developed. Well informed and very welcoming staff too. 🐠🦅🐧🦘🦇🐘🐫🦓🐅🐒🦏🐾🌲🌳",
   "Great zoo. Not too big but packs a punch delivering plenty of very interesting things to see. Great place to go for an afternoon stroll and ask questions to the volunteer staff. Would absolutely recommend for children and adults alike. They also have free days so keep an eye out for them."
  ]
 },
 {
  "name": "Denver Art Museum",
  "address": "100 W 14th Ave Pkwy, Denver, CO 80204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c18292ba-932f-11ea-80e0-14b31f159f22.png",
  "tags": [
   "creative",
   "drink",
   "art",
   "creative",
   "unique",
   "art",
   "kids",
   "art",
   "art"
  ],
  "link": "https://maps.google.com/?cid=4895980547090937649",
  "source": "GoogleMaps",
  "reviews": [
   "Purchased our VIP Hotel package for the Monet exhibit which was amazing!!! We flew in from Idaho on Th and spent all day there Friday, Jan. 31, 2020. We had \"dinner\" at their snack bar, salad, sandwich and drink and stayed for their QUARTERLY Friday night party, with a DJ, art trivia, a glass of wine,  and another exhibit on the third floor featuring light \"Entanglement\".  This was a most creative exhibit.\nThe other building was closed for renovation until 2021, so access to their great restaurant and permanent exhibits were not available. But, we so enjoyed our main focus: the Monet exhibit. I rate it a 10. Even the building is art.  Great work Denver Art Museum staff, organizers, docents, and volunteers!!! Will return again.",
   "This museum was very interesting. The attractions were creative to say the very least. The exhibits were all unique. There is a mirror exhibit that visitors can physically enter and see themselves reflected dozens of times over. A real play on vision. The design of the building itself is breath taking, from the inside of the building, top of the stairs...take a look down, the architecture is a work of art. This is worth the visit.",
   "A great collection of pieces with variety, artfully grouped in themes and sub-themes. Interactive portions were plentiful and engaging. I appreciate the opportunity to come and soak in inspiration, and then be asked to create something for myself. I'm glad we allocated most of our day to our visit, and that the pass is good all day so that we could take a break for lunch and return refreshed.",
   "I LOVE THIS PLACE! I’m actually pretty sure I’m going to do everything in my power to come back in May for the George Orwell installation! Great place to visit with or without kids! \n\nSo many beautiful works of art of every type of medium! I also loved how they really used all of the space available to them for art work. We didn’t get to go to the sculpture garden because it was snowing but I can only imagine. We went during the week and did not have any problem with a crowd - there were even a few school groups there but they were the best behaved I’ve ever seen (good job teachers!) \n\nI can’t wait to become a member here (: there gift shop also has a lot of neat things to offer!",
   "We are so lucky to have such an amazing museum here in Denver! They get some of the best exhibits in the country which people from all over come to see. The permeates collections are great too. I also like that the museum is kid friendly. I’ve been bring my nieces since they were quite young and because of their experiences here have found a love for art. Thanks DAM!!!"
  ]
 },
 {
  "name": "Coors Field",
  "address": "2001 Blake St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c1d1280c-932f-11ea-99a4-14b31f159f22.png",
  "tags": [
   "field",
   "kids",
   "food",
   "tour",
   "eat",
   "food",
   "field"
  ],
  "link": "https://maps.google.com/?cid=1665420542562589150",
  "source": "GoogleMaps",
  "reviews": [
   "Although I'm a Los Angeles dodgers fan from birth you can't knock this stadium. One of the cleanest nicest friendliest places to watch baseball. One of the most incredible 4th of July fireworks you could ever attend. As much as it hurts to say go Rockies.  Just not against the dodgers. I'm a local boy now and I got respect",
   "It's wonderful that the region has a baseball team; however, it is obvious the owners of the Rockies are satisfied with providing a team to the masses and little more. Their choice of management all the way down to the field managers makes this very clear. Too bad really but why bother because the people who have relocated to the area enjoy professional sports and the areas they came from provided professionals hell bent on winning. The Rockies? It's apparent all the owners care about is a reasonably full stadium.",
   "So much fun! Great food options and every seat in the house is good! We have been many times and sat in all parts of the stadium. The 4th of July was a blast. I would avoid the ticket resellers outside and if you are bringing kids I would make sure to get tickets far away from the beer garden. (which is actually so cool for adults) Just loud and the smoking section is a lot. \nGreat summer activity! Go ROCKIES!",
   "For someone who really isn't a large Baseball fan this Stadium was massively entertaining and had some of the most tasty american treats to eat. Took a tour of the full facility and the top lounge bar was a nice touch. Would recommend visiting even if you're not a fan of the sport. A+ Treatment and Food!",
   "Figured I'd come back here and give Coors Field a 5 stat rating after they hosted an awesome stadium series between the Avalanche and Red Wings in 2016. After going to the stadium series in Colorado Springs last night I kept thinking how Coors Field did an awesome job. No lines for beer or washrooms and the pro shop is awesome too."
  ]
 },
 {
  "name": "Molly Brown House Museum",
  "address": "1340 Pennsylvania St, Denver, CO 80203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2186a80-932f-11ea-a686-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tour",
   "tour",
   "unique",
   "tour",
   "kids",
   "history",
   "tour",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=16574832376407522221",
  "source": "GoogleMaps",
  "reviews": [
   "If you're a fan of the story of Titanic, you'll enjoy this place. There's a gift shop behind the house (where tour tickets are purchase) filled with interesting Titanic souvenirs. A ticket costs less than $15 and a tour lasts for about 1 hour. A very knowledgeable tour guide named Bennett was with us. Highly recommended if you're in the downtown Denver area and need to kill a few hours.",
   "What a fun little tour! The house is incredible and the story of Margaret Brown is neat. We had time to kill while in Denver so we started doing a little searching of things to do when touring the house of Margaret Brown came up. Did a little searching on who she was and was like \"I had no idea! Lets go!\" Id you don't know who Margret Brown is, she was one of the survivors of the Titanic. She is even portrayed in the Movie. (Not accurately, but you will have to go do the tour to know why I say that.)",
   "Really enjoyed seeing such a unique bit of history. The house is well preserved and getting the guided tour absolutely made for a great experience. Not great for small kids. However my teenagers really enjoyed the short tour.",
   "While I was thrilled to see the inside of the house, I was disappointed with the actual tour. I felt the information was kind of generic and I wished it was a bit more specific/educational. I enjoyed my visit, I just wish it was a better tour. We also couldn’t see the 3rd floor because they were doing training. Why have training in a place where you’re preventing visitors from going there?",
   "A beautiful museum that tells the story of an amazing and inspirational woman. A must see for everyone, especially those who live in Colorado. I had a great time learning about this historic location, and will surely return to share this experience with others!"
  ]
 },
 {
  "name": "Wings Over the Rockies Air & Space Museum",
  "address": "7711 E Academy Blvd, Denver, CO 80230, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c27559c6-932f-11ea-9c33-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "family"
  ],
  "link": "https://maps.google.com/?cid=18042612551295927622",
  "source": "GoogleMaps",
  "reviews": [
   "What a unique and interesting place to go visit! It's an amazing experience to be so close to the actual planes. Just the amount of history in one building is amazing. They do a great job explaining the types of airplanes and what they were built for. May not hold the interest of smaller children, but they do a good job of keeping things there for all ages.",
   "We had several companies celebrating here. Was wonderful, fun and interesting. Excellent space for such. However would also recommend for family or school outing visit.",
   "As you can see my husband enjoyed himself here. I think anyone who, as a as a child dreamed of flying planes are going into space, would enjoy themselves here. My only complaint would be that they need to do more interactive programs with the aircraft. But definitely a great way to spend a few hours.",
   "This may be a super cool place if you have a love for aviation. I have been spoiled with seeing many museums over the years. If you have visited the Air & Space in DC or the Air and Space Annex in the DC area this will be a huge disappointment.  If you have not experienced any similar ones, then this would be a good first one to see.",
   "I took my son and we spent three wonderful hour here. Very interesting and educational place. Would definitely recommend visiting!"
  ]
 },
 {
  "name": "Forney Museum of Transportation",
  "address": "4303 Brighton Blvd, Denver, CO 80216, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c2bb8c3e-932f-11ea-8085-14b31f159f22.png",
  "tags": [
   "walk"
  ],
  "link": "https://maps.google.com/?cid=8498080864738780099",
  "source": "GoogleMaps",
  "reviews": [
   "We spent the afternoon in Denver with my Dad.  He loves trains, planes and automobiles.  This was a really cool exhibit.  If you haven't been you really should go.  This visit they featured LOWRIDERS.  All sorts of modifications and artwork.  Indian motorcycle fans would be impressed.  And they have one of the Union Pacific Big Boys.  Much more than this short list.  Takes a couple of hours tops for the casual visitor to appreciate one of Denver's hidden gems.",
   "Fabulous museum to transport, just near Denver city centre. It covers all forms of transport and has some impressive exhibits. They have the massive \"Big Boy\" train, cars, planes, bikes and more. There is ample parking and friendly staff, plus it was good value for money",
   "This was a great experience! The museum has so many artifacts and it's easy to follow. Al took the time to talk to us about our many interests and told us many facts about the museum. It was a great way to spend a Sunday afternoon. Thank you and we will be back.",
   "So manny awesome things to see on display here. I will definitely be coming back. If you enjoy cars/transportation this is the place to check out while in Denver. Super nice staff. Super historical displays.",
   "I haven't been to the Forney museum since I was a child and it's quite a bit different than I remember. It's still need to see all the old vehicles and be able to walk through some of the old trains, But I did take a star away because it just seems like it's on its last legs and there isn't much anyone is trying to do to save it"
  ]
 },
 {
  "name": "History Colorado Center",
  "address": "1200 N Broadway, Denver, CO 80203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3040782-932f-11ea-a053-14b31f159f22.png",
  "tags": [
   "historic",
   "history",
   "kids",
   "history",
   "family",
   "art",
   "kids",
   "history",
   "food",
   "field",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=9897189083244038892",
  "source": "GoogleMaps",
  "reviews": [
   "Went here for a lecture on historic beer but dropped by early to check out the museum. And I am so happy we did! They had thoughtful exhibits that covered large ranges of Colorado history. The Beer exhibit we went for was awesome and we loved watching the old Coors commercials.",
   "It's the best interactive museum I've ever been to. If you have kids, this place is a must. Overseas visitors - insight into history and future\nThere are a lot of things from the past - some are visual and when others are tactile. We spent 3 very interesting hours there. Would highly recommend visiting!",
   "Awesome museum you can potentially spend a whole day in. Plenty of historical stuff as well as rotating exhibits of things like the school kid art exhibition that was being installed when we arrived. During our weekday visit there were lots of school groups so be prepared for that.\n\nI loved the exhibit about beer, especially the vintage Coors ads. My family has worked at and distributed Coors beer so I have a bit of a personal tie but even if I didn't I think I would have gotten a kick out of the 1970s era \"mountain man & woman\" (this ain't no flat lander beer) ads",
   "We came to the History Colorado Center for the first time today and were thoroughly impressed. The exhibits are awesome, the staff was great, plenty to do for both kids and adults, and the cafe had A+ food. Prices are reasonable too. This is a great gem in Denver!",
   "We went with our kiddos on their field trip. We didn't know what to expect. It was awesome! So much history. My husband and i were pleasantly surprised. Great tour guide and very interactive. Lots of hands on learning(even for adults). So excited to go back!"
  ]
 },
 {
  "name": "Colorado State Capitol",
  "address": "200 E Colfax Ave, Denver, CO 80203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3494b9e-932f-11ea-9abd-14b31f159f22.png",
  "tags": [
   "learn",
   "tour",
   "free",
   "history",
   "tour",
   "free",
   "history",
   "tour",
   "wander",
   "tour",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=1342660936494811791",
  "source": "GoogleMaps",
  "reviews": [
   "Free entrance and if time permit, do sign up for the free tour as it allow you entry into the dome. Our tour guide Maddy was excellent and provided interesting fact about the building and some notable person in the history of Denver. I enjoy it more than expected. The staff are helpful and friendly. The interior of the building are majestic and grand, and as a first time visitor to the states, it is also fascinating to learn more about the how the voting procedure is done.",
   "Great educational place! Very detailed history and well maintained. Many interesting things inside of the capital building itself. I recommend the free guided tour to go in detail about the history. Also, try to avoid busy times and school groups. The Senate and House of Representatives chambers were my favorite!! I recommend this place for sure!!!",
   "The state capitol building is beautiful, and while one can wander around and see the building, I highly recommend stopping by the visitors desk and taking a tour. The tour took about 45 minutes, and was fantastic! We went from ground floor to the dome (walked around outside). The guide shared lots of things I would have missed. Extremely worthwhile!",
   "Cool place to visit. The tour guide was awesome and super informative. Definately worth the stop. The tour is about an hour long and ends at the top observation deck.",
   "Colorado's state capital is one of the cooler state capital buildings I have visited. Really great exterior and interior with nice landscape. Everything is really interesting with a bunch of different history all over the building. It is usually open to the public and they do tours throughout the day. If you are in the tour you get to go much higher in the building then just visiting. Cool place!"
  ]
 },
 {
  "name": "Washington Park",
  "address": "701 S Franklin St, Denver, CO 80209, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c39ee4b4-932f-11ea-add2-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walking",
   "approachable",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=16795350865364075867",
  "source": "GoogleMaps",
  "reviews": [
   "Beautiful touch of green in the city. Worth going for a walk just to see all the amazing homes that line the park! Lack of restrooms and water fountains though, although it was out of season. Not a while lot of parking spaces, but should be able to find on-street pretty close if necessary.",
   "We were visiting town and had to stop by the famous wash park. It was nice, spacious. The amenities aren’t redone or super new but everything is functional. The kids had fun at the playground. What else can you ask for? The neighborhood surrounding it is pretty nice too.",
   "What a lovely gem of a place this is! It's a great place to people watch, and walking by the bodies of water here is a serene experience. Great for nice long walks, jogs, and bike rides. They even have a rec center in the park that's 6 dollars a day for a visit.  Definitely a great place to spend an entire day!",
   "Truly Denver's iconic unofficial answer to Olympic running training! One of the best places in the metro area to train on a secured route, there are both paved loops and a dirt trail loop along the edge. These supply a good distance as well, measuring approximately 2.2 miles and 2.5 miles respectively.\nWith landscaped flower beds and an impressive tree line and 2 ponds, it is quite a beautiful park as well! Plenty of activities for kids and picnics and lots of volleyball during the warmer months. So it's a great family place, and like so many great places in Denver, is quite well-known with locals and tourists alike so typically a decent-sized crowd on a warm sunny weekend! And for the record, if you really want to head out during the night for a nice cool dark run, you will always have some company! Truly a year round, 24 hour approachable training Park!",
   "What a great place to go. Nice view of the pond, nice neighborhood and 2 walking/running trails. Great for social gathering, work out, a picnic or a date. Gets plenty crowded on the beautiful days so be prepared, lots of people and dogs"
  ]
 },
 {
  "name": "Kirkland Museum of Fine & Decorative Art",
  "address": "1201 Bannock St, Denver, CO 80204, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c3ed9e80-932f-11ea-95c4-14b31f159f22.png",
  "tags": [
   "walk",
   "unique",
   "art",
   "history",
   "unique",
   "free",
   "art",
   "art",
   "walk",
   "tour",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13641377193401308822",
  "source": "GoogleMaps",
  "reviews": [
   "When I was planning my visit I saw this museum and it was top on my list. Kirkland did not disappoint. First, the building is beautiful, and the staff was incredibly friendly. The museum packs a lot of amazing design history inside and does a great job of it. Unsurprisingly, the layout is well thought out. The rooms along the promenade walk you through the history and evolution of design better than any history class or any other museum I have seen. The museum is set up more like a furniture store or the home of a collector than a white-walled modern art museum.  Each room offers a holistic glimpse into that era of design. The items are presented in a way you rarely see at other museums, in a more natural and contextual space. \n\nThe studio space feels like it is still someones home. It does not feel like much was changed to make it a museum. The smaller space and more natural layout makes for a unique experience. A fantastic museum filled with a great history.",
   "If you’re a lover of fine arts and design, this is a MUST see. Absolutely stunning collection filled with the most beautiful artifacts collected from all over the world. Immaculately maintained and displayed. From stills to prints, sculptures small and large, it is the single best collection of unique and forward thinking art and design anywhere in the world.\n\nWent during Denver arts week which happens during the first Saturday of November where multiple art museums graciously open up their doors for free between 5-10pm.\n\nMuseum admission is not expensive on most other days and it’s a fantastic way to spend some time and taking in the breathtaking modern art pieces with many that transcend time and still can be considered pieces that should not be missed hundreds of years later.",
   "My hubby and I are art lovers. We decided to visit this museum to get some inspiration. We were pleasantly surprised by the beauty of the paintings and the enthusiasm of the staff. We are waiting for a new exhibition in February. Would highly recommend visiting this awesome museum!",
   "So much to appreciate, and all new to me. Loved the furniture styles and glasswork. The discussion of synesthesia was especially interesting.",
   "I was in Denver on a Final Friday and this was on the art Walk list. The listing seemed like a museum dedicated to Vince Kirkland, but its actually a portion of a massive collection of many modern artists with connection to Denver like Andy Worhol. Imagine the finest estate sale of a modern art collector. It would be nice to have a docent tour of all these distinctive pieces or better yet a virtual reality tour. There's a lot of interesting stories to be told here."
  ]
 },
 {
  "name": "Clyfford Still Museum",
  "address": "1250 Bannock St, Denver, CO 80204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c42f1566-932f-11ea-84b6-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "art",
   "art",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=17181863244217161053",
  "source": "GoogleMaps",
  "reviews": [
   "The best artist you've never heard of. He stopped showing his work and continued to paint and create for years. He gifted all of his paintings to a trust with the condition that they create a museum with only his art. His story is  much more nuanced and complicated but he really was a rebel, even among the rebels he hung out with (Pollock, Rothko, etc.). Definitely worth taking your time here.",
   "I stumbled onto the Clyfford Still Museum after visiting the Denver Art Museum and I was completely blown away.  The paintings and his story are breathtaking.  The building is beautiful and being surrounded by these enormous achingly gorgeous paintings is an experience.  I was not a fan of abstract expressionism but this museum and exhibits help me “get it”.  The exhibit rotates every couple months or so.  And the current exhibit is spectacular - one room had noise cancelling headphone and putting them on and just looking at the paintings in the complete silence was the most peaceful and stress relieving experiences I’ve had.",
   "Really enjoyed the art... read about the art as much as the artist's life to fully appreciate the museum. The building itself is beautiful - many interesting angles from inside and outside that let light through. Look for their evening discount if you're flexible with your schedule and want to save.",
   "Magnificent architecture. There are 3 different concrete finishes compose the whole building. The combinations creates many interesting feeling in the museum. Art work is amazingly beautiful. It’s one of the jewel of museum!",
   "The staff was incredibly knowledgeable and helpful, yet they were unobtrusive unless you appeared to have a question. The premise was clean clearly labeled and wonderfully aesthetic.  The displays are logically configured and placed for maximum impact.  I have been to many museums but this one stands above. I highly recomend a visit."
  ]
 },
 {
  "name": "Children's Museum of Denver at Marsico Campus",
  "address": "2121 Children's Museum Dr, Denver, CO 80211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c46f180c-932f-11ea-9648-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "kids",
   "free",
   "kids",
   "unique",
   "art"
  ],
  "link": "https://maps.google.com/?cid=13865368703228205308",
  "source": "GoogleMaps",
  "reviews": [
   "Always a great place for kids to encourage learning and exploration. So much to do and experience! Ours have always loved the bubble room and areas they can play and draw. Plenty of activities inside and out to keep the whole family entertained",
   "Great place for kids! There are plenty of different areas for kids to play in. There is even an area for younger kids with age appropriate toys. There is a cooking class that you can sign up for throughout the day and make a healthy snack with your kid for free! On inclement weather days it does get very busy.",
   "Excellent children’s museum- and we have been to dozens and dozens! The things that really make this museum stand out from others are 1. Adventure Forest- it’s like you fall inside a piece of artwork and physically go on the adventure that was happening in the artist’s head. This, alone, is worth the price of admission. (Must be 5yo or 44”) 2. Teaching Kitchen- quick, easy, fun cooking classes for all ages! Just sign up the day you visit. 3. Workshop- kids love getting their hands on actual tools and finding out what they can do. The self-contained stations allow families to work independently without checking tools out from a staff member or waiting for a turn with a tool or making too much of a chaotic mess. Supervision obviously important here. 4. The art studio has unique features like real clay, chalk paint, and the opportunity to paint large sculptures that stay in the studio.",
   "I LOVE the Children's Museum for so many reasons. Children and growing their brains is number one! But their event team is stellar and spaces are bright, light and airy with tons of options that you wouldn't expect! And it is centrally located in downtown Denver with parking!",
   "Wonderful place to take young children. Could use a dedicated coffee spot for the parents/grandparents and always SUPER crowded, but I think that only speaks to how fun it is for littles. Buying the pass is worth it if you can go often. We love it here."
  ]
 },
 {
  "name": "Stranahan's Colorado Whiskey",
  "address": "200 S Kalamath St, Denver, CO 80223, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c4ba791e-932f-11ea-b596-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "free",
   "tour",
   "tour",
   "tasting",
   "history",
   "knowledgeable",
   "tour",
   "tasting",
   "knowledgeable",
   "tour",
   "drink",
   "tour",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=14628294289246584546",
  "source": "GoogleMaps",
  "reviews": [
   "I'm not the biggest Stranahan's drinker. I like your stuff and I think you make a great product. The taste is just not my favorite. I'll never turn down a free dram though!\n\nThat being said, the facility, lounge, shop and tour were all fantastic. Logan was very knowledgeable and entertaining. You guys have a great thing going. Keep it up and thanks for the experience.",
   "What were we thinking doing two distillery tours in one afternoon?!? I tell you what, it was totally worth it. I'm not much of a whiskey drinker, but you have to check out Stranahan's Colorado Whiskey.\n\nWe had some time before the tour, so we bellied up to the bar. Steve B., mixologist and server, was really cool and explained the drinks to us. When it was time for the tour, we were introduced to Logan. He was an awesome tour guide, and has a great personality for it. He gave us a history of Stranahan's as well as what it takes to make their whiskey.\n\nDuring the tour, we were given some samples. Again, not being a whiskey drinker, I was surprised at how you go about tasting it. And it wasn't bad! Logan even showed us what happens to the whiskey when you add a little bit of water to it. We were able to keep our tasting glass as a souvenir, and some of our group took advantage of the discount after the tour to bring home a bottle or two!",
   "My girlfriend and I are in from Chicago and decided to do the guided tasting tour and we got Kevin as the leader of our tour. He was super knowledgeable about the process, the product, and broke it down easy for us to understand. We've been to other distilleries in other states and Kevin was one of our better guides. The stemless Glencarn glass was a great souvenir to receive at the end. Diamond Peak is the best!",
   "I bought tickets for the tour for my boyfriend on his birthday. It was us and a couple friends. We had an absolute blast! Dave was very knowledgeable, passionate and funny. He made the tour very interesting and enjoyable. He taught some of us first timers how to enjoy Stranahan's and other whiskeys properly. Cool place to hang out and enjoy a whiskey. They have games at their bar too. I highly recommend!!",
   "Do the tour! Their guides are well versed on the brand and are awesome storytellers. The tasting room is gorgeous as well, if you want to just stop in a for a drink without the tour.  If you get as lucky as I did and get selected for a bottling, make whatever arrangements need to be made to attend! It was an awesome experience overall! The staff was fun, they give you breakfast and lunch for the morning crew, as well as a sample each time the crew filled a pallet! Very cool that all their bottles are done by volunteers. Highly recommend!"
  ]
 },
 {
  "name": "Confluence Park",
  "address": "2250 15th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c502d6e2-932f-11ea-8f36-14b31f159f22.png",
  "tags": [
   "walking",
   "learn",
   "historic"
  ],
  "link": "https://maps.google.com/?cid=4802733497033393869",
  "source": "GoogleMaps",
  "reviews": [
   "The park and its associated running paths are a spectacular addition to downtown Denver. You may have to dodge a tipped scooter here and there but it's a peaceful place to picnic or stop for a breather while on a jog. There's practically no city noise and it seems fairly safe, at least in daylight.",
   "Really nice, well designed, and well maintained park on the banks of the river. Great for leisurely strolls, dog walking, and picnics. Not sure if you can canoe, didn't seem like it. Also has a good view of the Denver skyline.",
   "Even in the winter months it never ceases to amaze me. The sound of the water drowns the fast traffic right above. Plenty of people here biking, skating, runners and even a few practicing their rafting skills. A great place to visit anytime.",
   "Nice place the river was rushing through, people were actually Fly Fishing too. It was cool. I was blessed with fantastic weather too",
   "This is a nice urban park right where the South Platte River and Cherry Creek converge, hence the name. The cascading water and the city skyline make for a postcard perfect scene. This place is quite historic too - it's around this spot where early prospectors started looking for gold, triggering a gold rush that would mark the beginning of Denver as we know it. Really neat when you learn something new as you discover new places."
  ]
 },
 {
  "name": "Cathedral Basilica of the Immaculate Conception",
  "address": "1530 Logan St, Denver, CO 80203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c555b0c2-932f-11ea-a2c5-14b31f159f22.png",
  "tags": [
   "walking",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13195664702627923387",
  "source": "GoogleMaps",
  "reviews": [
   "The architecture on this place is unbelievable and it feels like a castle! I'm not sure about parking as we are walking this day but I look forward to coming back to visit sometime in the future. It is nice that Denver has such a beautiful location in the heart of the city and capital. Found this beautiful little squirrel close to outside. Have a wonderful day!",
   "This Cathedral was gorgeous. I didn't actually go inside but I sat outside it for about an hour in awe of the excellent architecture. What a lovely view. I'm writing this review based solely on the external aesthetics, which were absolutely lovely. I recommend for this alone. But upon now seeing the internal pics now, I see this place is just a wonder all around.",
   "Gorgeous cathedral. Neo Gothic style is beautiful day or night. Our priest had a very good homily and the choir and pipe organ were great.",
   "Mass here is always beautiful. The music at 6:30p service is uplifting.  They used a different incense yesterday.  The smell lingers on what I wear and brings the peacefulness back.",
   "It was Christmas eve midnight mass. My first time in Catholic  church in more than four years and my first time in the Cathedral. If you have never been it's stunning. The music was incredible  and the Archbishop's word was exactly what I needed to hear."
  ]
 },
 {
  "name": "National Ballpark Museum",
  "address": "1940 Blake St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c59cce10-932f-11ea-a6e8-14b31f159f22.png",
  "tags": [
   "unique",
   "history",
   "unique",
   "history",
   "history"
  ],
  "link": "https://maps.google.com/?cid=12234182339614607933",
  "source": "GoogleMaps",
  "reviews": [
   "I took my youngest son, who is a baseball history fanatic, and he was welcomed with open arms. He loved holding bats swung by Ted Williams and Mickey Mantle and taking in all the unique baseball treasures. The staff were warm, enthusiastic, and patient as my son delighted in fanning them with an array of trivia questions. The founder's love of baseball history emerged from every corner.  This is a unique museum and a great way to spend some quality time with the baseball lover in your life.  Also conveniently located in a special part of downtown Denver!",
   "Unique collection of artifacts. Compact but thorough set up. Great stop before a Rockies game. Extremely friendly staff.",
   "Wow! Such a great place, jam packed with information. The people who work there know so much and have great stories. If your a baseball fan you should stop by doesnt take long to complete but every spot is filled with throwback history about baseball.",
   "Fun place for baseball fans to spend a few minutes in downtown Denver!",
   "If you love baseball and you're in Denver, check out the ballpark museum! It's got so much stuff its overwhelming.  The tours are usually unguided, but we had an employee come around and highlight and explain some of the stuff which was amazing.  There is a good mix between ballpark and player history to be seen, several Babe Ruth balls, a personal tax return from the Babe, and all kinds of neat stuff.  Take all the pictures you want too, so you can relive the memory forever!"
  ]
 },
 {
  "name": "Museum of Contemporary Art Denver",
  "address": "1485 Delgany St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c5e1edb4-932f-11ea-89a7-14b31f159f22.png",
  "tags": [
   "art",
   "art",
   "cheap",
   "unique",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=16002543018715200408",
  "source": "GoogleMaps",
  "reviews": [
   "Absolute favorite museum in Denver. Love all the exhibitions they get here I became a member here because it’s so reasonable and totally worth it!! Their “rooftop” bar is also a lot of fun, especially in summer. I love this place, never have a complaint. Staff is also always very very friendly and extremely helpful.",
   "What a nice museum to visit in Downtown Denver. The exhibitions are interesting and well described in English and Spanish. An audio guide would be nice. The building itself is a piece of art. Make sure you explore. Suggest you take the stairs to the 3rd floor and enjoy a libation in the cafe and take in the nice downtown views on the rooftop. Check out their website for events, activities and current exhibitions. $10 for adults. $7 for seniors and students.",
   "A great immersive space for thought-provoking contemporary art! The staff is so friendly and warm and the shows they represent take you through the full spectrum of emotions. Space Elevate you and your perception of the city around you. They have wonderfully eclectic events I always feel like it's an art Escape within the city",
   "Cheap price for entry with a large space. Targets a very unique brand of artist that may not be your cup of tea, but for the price it's worth the risk. We spent two hours browsing.",
   "Came in for one of the Friday Tours and will be back ASAP. We were on a tight schedule and weren’t able to stick around for long after the tour. There is so much more to explore. The tour guide gave an amazing perspective and point of view."
  ]
 },
 {
  "name": "Sprightly Escapes: The Denver Escape Room Experience",
  "address": "1455 Quince St, Denver, CO 80220, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c62ed55c-932f-11ea-a56f-14b31f159f22.png",
  "tags": [
   "unique"
  ],
  "link": "https://maps.google.com/?cid=14273068169649274127",
  "source": "GoogleMaps",
  "reviews": [
   "Sprightly does an amazing job at creating a unique escape room experience full of interesting puzzles. I appreciated that the puzzles and challenges were low tech, and didn’t rely on fancy gimmicks in order to be clever. Their clue system is also really brilliant. The themes for each room are well thought out. I’ve done 2 of the 3 rooms they currently offer and will definitely be back to play the third room. Lucas has an obvious excitement for his business and does a great job with all aspects of the work involved. Also, I really love that every customer gets to shine on the photo walls, not just the top finishers. It’s a tangible display of appreciation for their customers that you just don’t see anywhere else. Certainly one of the top escape room businesses in Denver!",
   "Great fun for all ages!! Owner, Lucas, is a polite and friendly gaming nerd :).  Between my daughter and I, we have done all 3 rooms.  Rooms have a bunch of puzzles that are challenging for all levels.",
   "So much fun! We have now completed two escape rooms at Sprightly Escapes. Both have been excellent and innovative with fantastic and fun puzzles and themes. Lucas was so welcoming and encouraging. He let us reserve the room just for ourselves even though our group did not comprise the maximum number of people allowed in the room.  Sprightly Escapes is our favorite escape room experience in Denver!",
   "It was my first time doing an escape room and it was a great experience. The puzzles were challenging but not impossible, and the game master made the entire thing amazing. The game master (i feel bad that I can’t remember his name) did a great job of explaining things in the beginning and of giving us just the right amount of help when we were lost. I’ll gladly return!",
   "We had an amazing time here while visiting Denver! Gave us something fun to do together!"
  ]
 },
 {
  "name": "Sloan's Lake Park",
  "address": "1700 N Sheridan Blvd, Denver, CO 80212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6851f74-932f-11ea-9229-14b31f159f22.png",
  "tags": [
   "walk",
   "family",
   "pets",
   "food",
   "walking",
   "walk",
   "free",
   "walking",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=14008144389003267646",
  "source": "GoogleMaps",
  "reviews": [
   "I love going for my daily walk around the lake. Such a beautiful walk after a long day. People are always working out. It’s a long walk. It’s great place to start working out. Fun festive during the summer time. Great place to take the whole family. Just have to remember it is a lake so you have to pay attention with the little ones and pets.",
   "A large park with a large lake surrounded by walking paths. The park has restrooms stationed around, fairly equidistant from each other. The park has shops and food along half of it's perimeter and residential on the other. The bathrooms are heated during the winter. Lots of benches and open space to hang out with friends and have activities. It's quite a popular park all year round. Plenty of pokestops and gyms for Pokemon go too!",
   "Really lovely park to go for a walk or sit on a blanket and watch all the people and dogs. The paved path around the lake is a little under three miles. Lots of bird to enjoy, and you might even see a bald eagle in the colder months.",
   "The Sloan Lake is beautiful and worthwhile a visit if you are around Denver Metro area. Good for walking, biking, skating, etc. There is free parking available and places for picnic. Lovely park!",
   "Awful!!!! Haven't been to this park in years so my daughter and I decided to take our bikes and have a good time riding around the lake....well that didn't happen because it took us almost 15 minutes just to find parking spot plus ones we were ready we find out that you almost couldn't even walk. I miss the good old days."
  ]
 },
 {
  "name": "City Park",
  "address": "2001 Colorado Blvd, Denver, CO 80205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c6cfcf40-932f-11ea-b12e-14b31f159f22.png",
  "tags": [
   "kids",
   "parks",
   "kids",
   "family",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=18429167296331311683",
  "source": "GoogleMaps",
  "reviews": [
   "City Park is a great place to visit in Denver. The park is very large and clean. We love to watch the animals, especially the birds and dogs all year long. The playground is definitely a favorite for my son and his friends here in the Denver metro area.",
   "City Park is amazing. There is abundant space to play around in, multiple play areas for children to engage in, and its upkeep is second to none. If you're looking for something a park might offer, this one has it. It is massive, so you might have to go around a bit to find the thing you're after, and you'll find it to be worthwhile.",
   "Part of a larger complex of public space well maintained by South Suburban Parks and recreation district. Adjacent to Littleton war memorial rose garden. Recently upgraded all ages playground. Lots of geese so don't let the kids roll in the grass!",
   "Best farm to start the holiday season off at. Fun things for the kids, animals to feed, and the best pumpkins to carve!!\nIt has become a family tradition to come to Finks every year!!",
   "Great park! One of the 2 big parks in Denver area. Lots of things around and in the park to do. This is one of the most Romantic Views of the Sunset in the City. Totally reccomend it for that."
  ]
 },
 {
  "name": "American Museum of Western Art--The Anschutz Collection",
  "address": "1727 Tremont Pl, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c721bee2-932f-11ea-bfdc-14b31f159f22.png",
  "tags": [
   "family",
   "historic",
   "art",
   "tour",
   "tour",
   "knowledgeable",
   "historic",
   "history",
   "organized",
   "tour",
   "art",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14652925158322481462",
  "source": "GoogleMaps",
  "reviews": [
   "Thanks to the Anschutz family for making such a magnificent collection available for public viewing. In addition to their value as fine art, the paintings—mostly oils—have historic importance as depictions of life in the West prior to photographs or when photography was still in its infancy. Just a couple of drawbacks: The building, though charming, is too small for the collection, so that the paintings are crammed literally from floor-to-ceiling. This makes it hard to get a good view of paintings that are too high or too low. Moreover, the lighting relies mostly on traditional spotlights that create shiny bright spots on some of the works, especially those near the ceiling. Nevertheless, a memorable and worthwhile experience!",
   "Great docent-led tour but no photos allowed. Some great artists in the collection but I realized I’m not a fan of “salon-style” installations.  I would prefer a different style of curation.",
   "By far the best museum in Denver - intimate but full of amazing works. Recommend a private tour.",
   "The historic Navarre building, across the street from the Brown Palace, houses this museum and is the home of the Anschutz Collection. There are more than 600 paintings, drawings, and sculptures from almost 200 artists. The collection offers a survey of western art from the dawn of the 19th century to the present. Billionaire Philip Anschutz sent portions of this collection on tours of foreign countries, including China and the Soviet Union, to promote American Exceptionalism. In 2010, he founded the museum to exhibit the collection to the American public. \n\t\nThe museum's floor plan is simple: three large, open rooms on three floors. The range of styles is eclectic. There are examples of \"early American expeditionary painting, Hudson River School and Rocky Mountain School landscapes, 19th-century American narrative painting, early American modernism, Expressionism, Cubism and Abstraction, American Regionalism, New Deal Art, and Abstract Expressionism.\" That's from the museum's website. I certainly couldn't identify them all myself, and the collection is not organized by approach, but presented salon-style. The overall impression is of a rich and contradictory heritage, almost too much to digest in one trip. \n\t\nI must admit to my own contradictory feelings about this museum. The collection is stunning, certainly, but the founder, one of the wealthiest men in the U.S., is a conservative Christian who actively opposes equal rights for our LGBTQ citizens. Should his politics be a factor for people who might visit the museum? Or should that be set aside, for the sake of the art? \n\t\nI'm not sure. I went, and I enjoyed the visit. And... I left with feelings of ambivalence. Ambivalence about the history of the west, and about the owners of this collection. \n\t\nIf you go, take the guided tour. It's a must. Our own guide was extremely knowledgeable - and necessary, to be honest. There's so much to see - almost too much! \n\t\nAnother valuable resource is an excellent piece from Westword, which discusses the history of the Navarre building as well as the evolution of the museum within. Look for \"Philip Anschutz Opens His Substantial Collection of Western Art to the Public\" by Michael Paglia, in Westword's May 29, 2012 issue. \n\t\nPhotos are not allowed within the museum, so my photos here are all of the exterior. A quick online search will show you the interior and the splendid - if perhaps slightly overpowering - artwork on display. On the second floor, look for the portrait of George Washington; it is from 1823 and is the oldest piece in the museum’s collection.",
   "Meuseum was amazing. We browsed the museum for hours. Entry was only $5 and also had a recorded description of the paintings and thier creators. \n\nWe actilually came to the museum to find out more about the building. It has a rich history. My great grandfather purchased a grandfather clock when the owner at the time sold everything to move back to his county. The clock was in the building back when it was a school and/or bordelo. The clock was built in the 1800s as a train clock. Very accurate and used by others to set thier time pieces too...so I was told. \n\nClock has been modified with top and side shelves since (not sure when or by who) but a great piece of history and today is in my entryway. I was hoping to find pics of the building from that period and one with the clock in it. That would have been incredible. Works great."
  ]
 },
 {
  "name": "ROOM 5280 - Denver Live Escape Games",
  "address": "1640 Logan St, Denver, CO 80203, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7696e3a-932f-11ea-84cd-14b31f159f22.png",
  "tags": [
   "creative",
   "family",
   "family"
  ],
  "link": "https://maps.google.com/?cid=3869543585055905658",
  "source": "GoogleMaps",
  "reviews": [
   "Great time solving the Sherlock Room. As a fan of Sherlock, I enjoyed the homage. As a fan of puzzles, I thought this one was well put together. The staff provided a great service and knew just when to give us a nudge when we were getting ahead of ourselves.",
   "Our family has developed a small addiction to escape rooms in the last year, and we decided to give 5280 a try before a few of us have to return home from the holiday break. We were greeted by a very friendly staff member (owner?) who signed is in with ease and explained the rules of the Sherlock Room with thoroughness and a positive attitude. I especially appreciated her patience with a toddler in our group who was flinging themselves around the room while we were being briefed. In general the service and approachability here is excellent and they really do put in the extra effort to make you feel welcome and engaged. The Sherlock Holmes room itself was good, but not great, particularly compared to some other Colorado escape rooms we've visited. The puzzles were decently designed, but the room felt sparse, and the use of an electronic intercom interface suspended reality a little bit. We found most of the puzzles to be creative except for the final two which were either obvious (though we were told it stumps some groups) or a little tedious (although still very cleverly designed.) In all, I'd recommend it, and I know our group is excited to try their more challenging Heist room.",
   "What a fun adventure at ROOM 5280! I knew it was going to be interesting to try to get out. Seeing how our differences became our strengths was so cool. Great instructions and details that made this an awesome escape room 👍",
   "A fun, challenging experience. This was my first time in an escape room, and my group was in the “Heist” room. The puzzles along the way required some thought as well as trial and error, but they weren’t overly complicated. Would recommend for a group of friends or family.",
   "You can tell when an owner cares, it shows in the layout and puzzles! Highly recommended!!"
  ]
 },
 {
  "name": "Balistreri Vineyards",
  "address": "1946 E 66th Ave, Denver, CO 80229, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7b98924-932f-11ea-82a0-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "winery",
   "free",
   "tasting",
   "food",
   "delicious",
   "food",
   "drink",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10049834643631189177",
  "source": "GoogleMaps",
  "reviews": [
   "This venue was perfect and all that we could have wanted. We also used their catering service and the food was delicious! I highly recommend serving their red sangria as one of your drinks are your wedding. YUMMMY!!\nThank you Julie and her wedding planners! Mattie and Lauren! You all were so amazing and accommodating!",
   "Great food and great wine. They have free wine tasting and let you try everything they have. They also offer free winery tours.",
   "We had our wedding at Balistreri in September and it was AMAZING! Balistreri is a hidden gem and was the perfect venue for us.  Both the ballroom and the outdoor area were gorgeous, and the food provided by Balistreri was delicious!  We served Balistreri's white sangria during the ceremony/cocktail hour and it was definitely a crowd-pleaser, as was the other Balistreri wine we served.  The staff at Balistreri is very relaxed and accommodating, and really allowed us to make our day what we wanted. Huge shout out to Lauren and Mattie who were very easy to work with, responsive, and extremely helpful in coordinating everything for us!   We have had numerous guests tell us that this was one of the best weddings they have attended, which can be largely attributed to this great venue.",
   "It has great wines to drink.  It serves lite lunch, brunch to share and other up scale plates. You can also taste the 🍷, then purchase a bottle of your favorite.  This is located in Commerce City, so it takes a bit for some people to get used to the 👃.  Also, it is pricey, so bring your wallet or credit card.",
   "I love this place! Great wine and food. Also great event services. I had my wedding reception and rehearsal dinner here. Definitely my go to place. I always bring friends and family here 😄"
  ]
 },
 {
  "name": "Denver Firefighters Museum",
  "address": "1326 Tremont Pl, Denver, CO 80204, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c7ff44c6-932f-11ea-92dc-14b31f159f22.png",
  "tags": [
   "learn",
   "kids",
   "history",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=5372442486072723718",
  "source": "GoogleMaps",
  "reviews": [
   "A fun little museum! Especially for kiddos or those who love a little history... Old engines, the history of firefighting in Denver, a play area for kids w costumes, a mini fire pole & fire engine to play on! A wonderful place for children to learn 911 calling & fire safety skills while having fun!",
   "Of course we love going to all museums and love learning new things, however this place is super small. Our 3 year old loved the play firefighter's truck, but I don't think it was geared towards kids/activities were lacking. I could not imagine paying to visit, luckily we had a free pass.",
   "Small, but very interesting. My kids loved trying on the costume fire fighter gear and seeing where they slept. Parking is not included, but there are pay spots along the road. They have items I have never seen in person before and was pleasantly suprised with the attention to detail. Overall would definitely recommend the trip.",
   "My 7yo grandson didn't want to leave!  He put on all the kid-sized firefighter gear provided, including a Fire Chief hat, sat in the driver's seat of the big red fire truck and his imagination drove him to a whole new dimension. Lots of interactive play for everyone... very well thought out design of the museum for any age to enjoy.",
   "The Firefighter Museum was a nice stop while we were in Denver. The staff was nice and my husband as well as my 4 year old loved ed it. They had items children could touch and play with. Dress up like a firefighter and upstairs plan an escape route if there was a fire in a home."
  ]
 },
 {
  "name": "United States Mint",
  "address": "320 W Colfax Ave, Denver, CO 80204, USA",
  "avg_visitor_review": 4.2,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8491f50-932f-11ea-8934-14b31f159f22.png",
  "tags": [
   "tour",
   "tour",
   "free",
   "walking",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=7680850679702847328",
  "source": "GoogleMaps",
  "reviews": [
   "Great place to get back to the patriotic self and feel proud of how humanity evolved over time.",
   "Super cool tour. You get to see the actual coin mints in operation, with giant piles of penny and quarter blanks being converted to freshly-minted currency right before your eyes! However, hours are very limited and tour tickets are in high demand, so getting in is a pain. Planning ahead is essential. Read the website and other reviews carefully. My pro-tip suggestion is to go during the winter off season if you can. I went on a 9:30 am tour on a snowy November, and still arrived at 7am to ensure I got tickets.",
   "Tickets are free and are first come, first serve. Arrived at 9:30, and got tickets for the 12:30 tour. Have to arrive 30 minutes before tour to go through security. No bags allowed. If visiting during summer months or spring break, arrive at 5 am as tickets will be gone by 7:10am. Ticket window opens at 7am. Tour itself was ok... Not sure what I was expecting, it's a guided tour mixed in with self guided bits. After the guide says their script, you're free to roam around and read the information panels.. they give you plenty of time to read everything, maybe too much time.. there is a feeling of waiting around in between each room.. staff is super friendly but I do think the tour could be a bit more animated and interactive. Would I line up at 5am during peak season, no way... Off peak, why not. :) There is $12 and $13 (all day or $5-6 per hour)  parking nearby. Walking distance to the capital and other sites as well.",
   "This is a really fun place to visit. You get to watch money being made and can even take a bag of shredded money as a souvenir.",
   "Beautiful, and Historical. From the coin collection observed on tour to the building itself. Plan ahead, as to not be disappointed. Tickets are available for all tour times starting at 7 am. Everyone in line at 7 was getting tickets for tours scheduled throughout the day."
  ]
 },
 {
  "name": "Denver Millennium Bridge",
  "address": "16th St Mall, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c88f01f0-932f-11ea-acfa-14b31f159f22.png",
  "tags": [
   "walk",
   "structure",
   "free"
  ],
  "link": "https://maps.google.com/?cid=7050824205481536514",
  "source": "GoogleMaps",
  "reviews": [
   "Wonderful area to walk around, I took my friend here today to enjoy the warm weather. Highly recommend exploring Union Station, Tattered Cover and some of the nicest restaurants in Denver!!",
   "Bridges really aren't my thing but my wife wanted to see it. It was nice and looked like a engineering challenge. Goes over a railroad track or should I say about 5 Railroad tracks",
   "A place to make memories. So many of mine have been made there. I was 12 years old my first time passing it and for many a great 4th of July fireworks view!!!",
   "Very cool structure, definitely not just any old city bridge. Nice views and places to sit.",
   "It's a bridge.... what's not to love. Kind of at gateway to commons park or to the sixteenth street Mall. Access to the free mall ride.  Oh ya... it's an architectural feature downtown that makes for great photos."
  ]
 },
 {
  "name": "Center for Colorado Women's History at the Byers-Evans House Museum",
  "address": "1310 Bannock St, Denver, CO 80204, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c8e2a06e-932f-11ea-a4d5-14b31f159f22.png",
  "tags": [
   "tour",
   "free",
   "art",
   "history",
   "tour",
   "free",
   "history",
   "family",
   "family",
   "art",
   "knowledgeable",
   "tour",
   "history"
  ],
  "link": "https://maps.google.com/?cid=15475294351725957359",
  "source": "GoogleMaps",
  "reviews": [
   "Great museum pretty close to downtown easily accessible via public transportation. A museum that contains an immaculately maintained home with many artifacts that were handed down for multiple generations and still flawless after many years. The tour guides give a rich history and have in depth knowledge of the many different artifacts around the house.\n\nWent during Denver arts week which happens during the first Saturday of November where multiple art museums graciously open up their doors for free between 5-10pm.\n\nMuseum admission is not expensive on most other days and it’s a fantastic way to explore some history and immerse yourself in the life of someone with a house built almost 150 years ago.",
   "We were given free passes after visiting the main History Colorado Museum a day earlier. The house can only be visited via a guided tour, and we called ahead to make sure there's spots for us.\n\nThe house is definitely beautiful and looks remarkably well preserved. The docent shared a lot of interesting tidbits about the Evans family and the household items they left behind, but didn't really demonstrate the connection between the family and women's history in the state. There is a small gallery at the reception, but I also didn't notice any mention of the Evanses in that gallery.",
   "The home of a family who had great impact to the Denver area in terms of art and women's rights during the late 1800s to the early 1900's. This original and very well kept home is very interesting archectually and the original pieces of furniture, art, books, etc. give a real sense of the histories of the families that owned the home.",
   "Very nice place!",
   "This is a beautiful home with rich history. Our tour guide, Judy, was very knowledgeable about the house and the families that lived there. This was definitely a highlight of our trip!"
  ]
 },
 {
  "name": "Big Blue Bear",
  "address": "750-776 14th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c93813b0-932f-11ea-8973-14b31f159f22.png",
  "tags": [
   "performance",
   "art",
   "cheap",
   "art"
  ],
  "link": "https://maps.google.com/?cid=15500781806545111172",
  "source": "GoogleMaps",
  "reviews": [
   "On the night prior to November 5th, 2019, that Big Blue Bear had been peeking through the great window, trying desperately to catch any glimpse of mystical performance from Devi enchantress, Ms. Lana Del Rey, but alas, she already achieved night's completion, for I'd just exited the venue & never would I have allowed myself a premature ejection from her concert grounds; Not while Supreme Goddess of All Heaven & Earth still graced me in her divine song.\n\nBut, oh, such poor, poor Blue Bear... If it had been me standing out there in so much cold, gazing hopeless such deep void lying just beyond that wall of glass encasement, to be filled only with what emptiness makes when so greatly a loss felt, I would have been reeking havoc all over the damn place, being extreme mean throughout that downtown scene, like when in videogame demolition mode from a sin of Rampage play. But such helluva nice Bear, was Big Blue, who refused to take out these erupting emotions of hostility, anguish, & disappointment on the littler, though taxpaying, citizens of Denver, CO.",
   "He is so cool to see! So beautiful, very bright and pretty big, he is also very cute as he is peaking into the colorado convention center. Must see if you are anywhere near downtown! There are a few benches around him, it is worth sitting and pondering the meaning of life. Just saying.",
   "Towering public art so it's hard to miss. I've never seen anything like this anywhere, and I thought it was well done. NOT tacky or an eyesore at all.",
   "Big blue bear is an iconic figure in Denver downtown. This place is near the Colarado convention center where some of the science conference taking place. Also a couple indian restaurants are nearby. You can park in the nearby street parking here. There are also some cheap city parking spaces. 16th street mall is also located closed by to this place.",
   "It's an amazing piece of art. Found out it costed $425,000 to put up. Oh,  he sure does love looking through them windows 😂😂😂"
  ]
 },
 {
  "name": "International Church of Cannabis",
  "address": "400 S Logan St, Denver, CO 80209, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c99946c8-932f-11ea-a6e1-14b31f159f22.png",
  "tags": [
   "free",
   "unique",
   "music",
   "music"
  ],
  "link": "https://maps.google.com/?cid=16861186175716840207",
  "source": "GoogleMaps",
  "reviews": [
   "An awesome experience. Great hang out place. Chill hangout area with video games, snacks, and everything else. Very cool glad i came",
   "Very fun! The guided meditation is worth it. The show is awesome. Love the game room and the free coffee before the show. The staff loves answering questions and there's some cool stuff in the gift shop",
   "One of the most unique experiences in Denver! Make sure to come early and explore the lobby! Park on a side street or on the street parking on Logan.\n\nThe light show is a sensory symphony! Loved the music and visuals. I laid down in the pews and just existed. I recommend going with a group of friends or on your own. \n\nYou cannot smoke in the facility during the light show.",
   "i Love this place. very positive.message . self guided meditation . also fun . waiting room game area has lots of retro fun stuff. worthy cause ...not just about cannabis...that just heoghtens awareness not necessary tho",
   "Walked in not knowing what to expect... One of the most beautiful things I've ever experienced. We arrived just in time for a show and it was amazing. Truly a magical worship experience full of music, colors, and some very inspiring words. Would absolutely recommend and I hope to see this expand into more places. \n\n\"Even when we're busy, we can focus on what matters.\""
  ]
 },
 {
  "name": "Four Mile Historic Park",
  "address": "715 S Forest St, Denver, CO 80246, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/c9e3e47a-932f-11ea-b186-14b31f159f22.png",
  "tags": [
   "tour",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=5122670447582721355",
  "source": "GoogleMaps",
  "reviews": [
   "When you are on a long bike ride, this is a great place to pull over and have a snack, beautiful and quiet. It's a great place with a covered pavilion and tables.",
   "Awesome tour for those who would like see what life was like for a few in the 1840-60's, the tour guide was very informative and passionate and well dressed for the time period, great experience.",
   "Getting the docent tour was definitely worth our wait. She shared a lot of great information about the property and those that lived here. If you don't have the opportunity for a docent lead tour of the main building you can catch some great information from the video playing in the visitors center. \n\nMy 11yo enjoyed seeing a historical how. With all the details and mining for some gold.",
   "Great stop when biking on the Cherry Creek trail. The quilts on display are beautiful. Friendly staff.",
   "I'd like to visit it in spring or summer, it's a bit cold to explore everything in winter. Great locations of Wild West"
  ]
 },
 {
  "name": "ROOM 5280 - Denver Live Escape Games",
  "address": "142 W 5th Ave, Denver, CO 80204, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca30ef1e-932f-11ea-9855-14b31f159f22.png",
  "tags": [
   "family"
  ],
  "link": "https://maps.google.com/?cid=17686859283295661037",
  "source": "GoogleMaps",
  "reviews": [
   "Beyond amazing customer service. Price is totally worth it. So much fun. Extremely stimulating. Staff will not leave you hanging and they are very encouraging. Went once, loved it so much we came back the next day for the other room. We plan to visit the other location as well to complete the remaining rooms. Can't thank Room 5280 enough for being the start of our new addiction! Haha!",
   "Staff are super friendly and the building was easy to find/clean. We did The Experiment room and it was definitely fun. The max was up to 6 people but there was not enough puzzles for 6 people to do. Definitely more of a 4-person room. That being said, it was also REALLY hard but we escaped with 8 minutes left! I'm hearing the Heist room is super good. Will definitely be back for that one!",
   "Our host was cool and speedy, she had colored hair but I forgot her name :-(   Im from Los Angeles and have done close to 20 rooms.  The Weird Heritage room does not have a lot of production value but the puzzle were legit every step of the way. With out spoiling anything there was a perfect task that needed two people to work in unison testing the limits of their dexterity and calmness under pressure. Great room!",
   "We had such a great time at this escape room! Guthrie was a great game master. He was super friendly and gave good clues and direction when we needed it. We will be back!",
   "Kings hard to find, it blends with the houses around it. SO MUCH FUN!!! We made it out with 8 mins to spare!  Great group/ family activity!!"
  ]
 },
 {
  "name": "Denver Free Walking Tours",
  "address": "200 E Colfax Ave, Denver, CO 80203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ca86d376-932f-11ea-80ba-14b31f159f22.png",
  "tags": [
   "walking",
   "tour",
   "free",
   "walking",
   "tour",
   "knowledgeable",
   "free",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=12787170545265521001",
  "source": "GoogleMaps",
  "reviews": [
   "First time visit was with the woman i adore and we had an amazing time. Beautiful views and all.",
   "I enjoy taking walking tours for the cities I visit around the world so I thought I might as well take one in Denver, my hometown.  I wasn't disappointed and learned a few things I didn't know.\n\nNote - Directions say to meet at the Capital steps but there are a lot of steps to chose from.  Specifically meet at the Civil War stature also known as the Chivington Statue or the Genocide Statue.",
   "Loved our free walking tour! Alyce did an amazing job - she had so much cool information! She walked at a good pace, I never felt rushed. Wear tennis shoes and bring cash to tip your guide - definitely worth it! I feel like I got to see all the big things around downtown Denver after this tour, highly recommend!",
   "We learnt so much about Denver with Cami as our excellent tour guide! It was a fabulous way to be introduced to Denver. We also signed up to the Greyline bus tour but we learnt so much more on this tour! Id recommend this to everyone!",
   "EXCELLENT tour given by Alyce.  She was knowledgeable , informative and interesting.  She was happy to answer questions and was so warm and friendly.  The tour was great...I still can't believe it's free.  Highly, Highly recommend."
  ]
 },
 {
  "name": "Tropical Discovery",
  "address": "2900 E 23rd Ave, Denver, CO 80205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cade1886-932f-11ea-96a8-14b31f159f22.png",
  "tags": [
   "field"
  ],
  "link": "https://maps.google.com/?cid=14955295725778054147",
  "source": "GoogleMaps",
  "reviews": [
   "Fun time. Good scenery for the animals",
   "Amazing! Still here so I'll edit in a better review later!",
   "Very cool! Lots of different reptiles and amphibians. They have a black room where you can view nocturnal animals",
   "Fun for all ages.",
   "Loved this zoo! I am from colorado springs and  have always gone to the chyenne moutain zoo, not bad, however I enjoyed the DZ much more. There were lots of awesome shows with helpful trainers who had no problem answering questions about the animals. They made the shows very fun while also remaining very informative. The trainers even reccomend apps that are informative and help us make mindful decisions considering endangered species. I would recommend this zoo for couples, old and young, as well as families, and field trips. \n\nAlso this zoo has the largest bird exhibit I have ever seen. Super cool!"
  ]
 },
 {
  "name": "Lakeside Amusement Park",
  "address": "4601 Sheridan Boulevard, Denver, CO 80212, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb384eba-932f-11ea-890d-14b31f159f22.png",
  "tags": [
   "cheap",
   "drink",
   "kids",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2731565663136255498",
  "source": "GoogleMaps",
  "reviews": [
   "I love this place. Rides are fun and cheap. We always go for the Denver Film Society’s Summer Scream. Adults only. All you can ride. All you can drink. Be careful... that’s a dangerous combination.",
   "Full of nostalgia, this is something worth experiencing at least once. It’s not super clean and the rides are old, but there was never a moment where anything felt unsafe. If you’re someone who loves typography, there are many old signs and plaques that are fun to see.\n\nCome on an off day to beat the crowds and prepare to spend 2-3 hours here.",
   "My grandfather used to run the pony track which has been gone for so many years ! My mom and uncle worked there when they were teens.   Fun house was my favorite and the train rides! I haven’t been there in years as live in Mississippi but lakeside has always been a part of me . I saw in the pictures the Whip may still be in action???  Ahh sweet memories !",
   "Fun rides, and surprisingly decent food items to buy while there. The place looks kind of rundown, but it's still got its charm factor. During the week gets you a very nice all-inclusive price, and kids will like the kiddie rides. My favorite part is they allow you to bring in food and have covered picnic tables to use.",
   "Love Lakeside! Fun rides, good food, never too long wait for rides. Great Family atmosphere."
  ]
 },
 {
  "name": "Aspire Tours",
  "address": "6275 W 38th Ave, Wheat Ridge, CO 80033, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cb8046ae-932f-11ea-885d-14b31f159f22.png",
  "tags": [
   "tour",
   "history",
   "food",
   "tour",
   "food",
   "knowledgeable",
   "sightseeing",
   "tour",
   "family",
   "tour",
   "historic",
   "hike",
   "walk",
   "hike",
   "history",
   "tour",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=15736229537346113985",
  "source": "GoogleMaps",
  "reviews": [
   "I visited Denver for the weekend by myself and really wanted to check out the Rocky Mountains but I didn’t have a car nor the knowledge of where to even go in the mountains if I had a mode of transportation. I went on google and searched up “Rocky Mountain tours from Denver” and this listing came up. I was apprehensive at first but I read the reviews and it was all good feedback. I went on a Saturday and it was a breathtaking experience ... literally! My tour guide was Ryan (I forgot his last name but he has a PHD and grew up in the east coast) and he was amazing. We met at union station at 9am and we drove up in a big van with enough room for everybody and the whole ride up he provided great background and history.  He looked out for our safety by not letting us get too close to the animals that we saw throughout the day and made sure we got scenic views throughout the park. The food for lunch was great as well and it was able to keep me full for the remainder of the day. I was concerned about the trip being all day and whether I’d be able to handle it cause of the altitude but I was perfectly fine. I had a bottle of water with me the whole time which Ryan kept refilling for me and I wore comfortable clothing and shoes for the days adventure. I had a great experience and the price of the tour was justifiable. I would definitely recommend this as a must do for others visiting Denver!",
   "Me and my wife went during the 1st week of march to the rocky mountain tour. Let me summarize my review at the onset: We had THE most iconic and memorable trip to the snowy mountains along with these guys. If you are in Denver/Boulder I would highly recommend you to take this trip. Our guide was perfectly on time at the pickup location and all along the way he took care of us and kept us entertained. He was the perfect travel companion and guide you could wish for; funny, informative and excellent knowledge of the region. The lunch sandwich+chips was good (they took our food allergies into account as well). There were multiple stops along the way to use to the washroom and stretch our legs. It was a particularly sunny day hence the views of the mountains were breathtaking providing multiple insta-opportunities. We heard many bear and moose stories and spotted a few dear. On our way back an entire herd of elk crossed the streets right in front of us!\nA perfect 8.5 hrs trip from Denver.",
   "Jennifer was our guide, we loved her.  She was very knowledgeable about the tour areas, very safe driver. Highly recommend this to see foothills without having to navigate& drive through yourself.  My family of 4 loved the sightseeing and small group tour setting.",
   "If you’ve got an afternoon to spare and want to get a quick taste of the Boulder Flatirons (and Pearl St in Boulder proper), then the Boulder Hike and Beer four hour tour is the way to go! Jed was a fantastic guide, giving us enough historic facts about the area (as we drove from Denver to Boulder) to keep things interesting, but not so much that it was overwhelming. The hike is nice and moderate, giving you a good view of the mountains and surrounding plains — I especially enjoyed Jed teaching us about the useful (and not so useful!) plants we breed along the way. A beer in Boulder was a nice way to finish up the hot afternoon! \n\nA++ would Jed again.",
   "Jeff our tour guide was the perfect Denver host. He was friendly and laid back and well informed.  About 2/3 into the day he mentioned he was actually a geologist which was super cool as he understood the geologic history of the region as well.  The van was comfy and he was easy to hear.  The coolest part was Jeff had an eagle eye for wildlife and we saw male and female elk groups and deer and a hawk. We stopped at a whiskey distillery to eat our box lunch. Box lunch was turkey sandwiches and chips from a local grocer. Make sure to wear shoes that you can walk on snow and ice and grab some gloves and hat. You head up to 9400+ feet and do a short hike to a cool lake and stunning view so this city girl was not as prepared as I should be.  Awesome tour and highly recommend it!"
  ]
 },
 {
  "name": "Mile High Wine Tours",
  "address": "1660 Champa St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cbe154ca-932f-11ea-b171-14b31f159f22.png",
  "tags": [
   "winery",
   "knowledgeable",
   "tour",
   "tour",
   "winery",
   "tour",
   "tasting",
   "tour",
   "family"
  ],
  "link": "https://maps.google.com/?cid=9334543151582780851",
  "source": "GoogleMaps",
  "reviews": [
   "Outstanding guided tours both times we went. \n\nOn one of our outings, When, after the first winery and lunch, cousins admitted beer was much more to their liking, guide switched gears and spent the remainder of the afternoon at craft breweries down town. \n\nGood deal with knowledgeable guide. Will do it again as a great way to introduce visitors to the mile high city.",
   "Fun afternoon spent on the tour! Got to taste many wines over the 3 venues around Denver. Everything was taken care of including pickup and drop off in a nice Mercedes van. Also included a tour of the cellars/wine making process. There was also a lovely gourmet lunch at the first venue.",
   "AMAZING! Cindi was the best host. She was fun, enthusiastic and really friendly. We did this wine tour with 12 girls for a bachelorette and we had the absolute best time. She was so accommodating to our needs.  Highly recommend this tour!!!",
   "This tour was amazing! So well planned timing wise to let us spend enough time enjoying tasting at each of the wineries (we visited total of 3). We tasted about 30 different wines!!! and had an amazing lunch at Balistery Winery. Would definitely recommend Mile High Wine Tours and I will be back again!",
   "This was my first visit to Denver and the wine tour was a great experience!! Cindy our guide was marvelous!! Her knowledge, her personality made the tour very enjoyable! I will tell all my family and friends about the wine tour and Cindy!!!"
  ]
 },
 {
  "name": "Rocky Mountain Balloon Rides",
  "address": "8114, 2845 Fenton St, Denver, CO 80214, USA",
  "avg_visitor_review": 4.9,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc222e0a-932f-11ea-b7a5-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "knowledgeable",
   "history"
  ],
  "link": "https://maps.google.com/?cid=14047104555354684314",
  "source": "GoogleMaps",
  "reviews": [
   "BREATHTAKING! This hot air balloon ride was such an amazing experience. Jeff was a great pilot with an immense amount of experience and knowledge. Jeff had coffee and breakfast snacks while setting up, which was such a sweet gesture. Also, he kindly let us sit in his car with the heat blasting so we wouldn't freeze while the balloon was blowing up. This was perfect for the cold morning and despite the cold weather, this ride was so worth it! What was great was that we had the basket all to ourselves since we were the only one signed up so private ride for a group rate, you cannot beat that!!!! The views are spectacular & that you can only get high up, so what better way! During the ride, Jeff educated on us on what he was doing and what gadgets he was working with. We landed safely and upon landing, Jeff brought out mimosas (or mimosas without OJ lol) and said the hot air balloon prayer. It was perfect way to end the whole thing and he even gave us suggestions for plans after since we were new to the area. Best way to start off the 2020 year!!",
   "I had an awesome morning with Rocky Mountain Balloon rides. I was really nervous to do this but quickly felt comfortable and had a blast. Jeff has tons of experience and is a fun guy with great stories. We had a smooth take off and landing with about an hour flying in the air, close to 10 miles. Jeff’s your guy for an unforgettable experience!",
   "This was an intimate and breathtaking experience that was well worth the money. Jeff was a fantastic and knowledgeable pilot who's 20 years of experience really showed through in his professionalism and piloting of the craft. Tom was also fantastic in making sure the details were attended to. They both has wonderful information and we knew we were in good hands with them. We will definitely be coming back for any future hot air balloon rides.",
   "Jeff and his crew are awesome! He has been doing this for 20 years and is very knowledgeable of how to maneuver and deal with weather patterns. Amazing views of the Rockies and he made sure to slowly spin the balloon so we all had the same view. Safe landing and when we returned to the launch site they provided champagne and fresh fruit. Awesome time and highly recommend.",
   "The ride piloted by Jeff Powell was truly remarkable. From the history he shared and the sites he pointed out, every minute was an experience. The rainbow balloon is a magnificent sight and the handling impeccable. \n\nThank you for making our first anniversary -an unforgettable celebration!"
  ]
 },
 {
  "name": "The Money Museum at the Federal Reserve Bank of Kansas City, Denver Branch",
  "address": "1020 16th St Mall, Denver, CO 80202, USA",
  "avg_visitor_review": 4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cc62bbb4-932f-11ea-bdf6-14b31f159f22.png",
  "tags": [
   "historic",
   "free",
   "history",
   "kids",
   "free",
   "learn",
   "tour"
  ],
  "link": "https://maps.google.com/?cid=11953732222987817271",
  "source": "GoogleMaps",
  "reviews": [
   "Any museum about money is sure to delight, and this is no exception. It's small so you don't need more than an hour. Most of the historic artifacts on display are (unsurprisingly) old banknotes and coins, some dating from the colonial years of the country. The rest of the exhibits describe the history of the Federal Reserve, provide interesting tidbits about the money supply and the economy, and promote financial literacy and independence.\n\nTo get in, you need a state-issued ID or passport, and you go through an airport-style security check. Admission is free. The staff were all very pleasant and helpful. There is no gift shop, but be sure to grab a free souvenir by the entrance, a small bag of shredded banknotes!",
   "This place is so cool! It shows you how to detect counterfeit money by looking at it and even smelling it! Also you can see what $30,000,000 looks like! \nIt is not a large museum, and it is free! You also get a little free bag of shredded money to take home with you! I wouldn’t recommend for kids under 5, just because they wouldn’t be able to really reach or understand the museum. \n\nAlso you enter from the side of the building, google maps will take you to the front.",
   "Nice for a little ten min stop, not much else. Also, I get money is around but security guard was really sketchy. If your that scared, don't people in?",
   "This is the best quick museum for when you have 30 minutes to spare. The information is amazing. It is so cool to see how U.S. money has evolved. They have several interactive components and you can even take a picture with $30,00,000!",
   "I wish there was more to see! We only had access to one main room and a projector tv room, it would be cool to have had tour of the whole building. Otherwise it was a very cool experience! They have high intense security but they are extremely friendly. Cool place to bring your kid. They have interactive activities and it was overall a decent experience. You learn a lot about money!"
  ]
 },
 {
  "name": "Epic Escape Game",
  "address": "1750 N, Gilpin St, Denver, CO 80218, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ccabe2ae-932f-11ea-b6f5-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=3570214310580655624",
  "source": "GoogleMaps",
  "reviews": [
   "Well, we lost but it was a lot of fun. The crew was really nice and this place is surprisingly spacious. I suppose I haven't really done any non trivial escape rooms. It's difficult to really go into details without spoilers. I would recommend about 5 people though and no more than that otherwise some of the rooms become too crowded.",
   "I thoroughly enjoyed visiting this escape room facility! I am on a journey to visit escape rooms as I travel and this was the one I chose during my Colorado visit this week. Stephen was an excellent game master! The lore at the beginning was full of heart and the room was awesome with a nice medieval ambience track. The puzzles were nice as well. My pleasure to vindicate your room Stephen! Hope to visit again in the future, thank you.\n\nDetails:\nRoom - Excalibur\n(Cloak is a must wear! Lol not really but enjoy the experience)",
   "Had an amazing experience. I had messed up and booked a room at that Denver location by mistake. With that, when we showed up here they didn't have us on the books. J.J. went above and beyond and contacted the Denver location, transferred our booking to his location and got us in a room shortly after arrival. The room itself was a lot of fun, we had some first timers and they had a blast. The room we did was The Presidents Briefcase and it was challenging for the 6 of us. We finished with 5 minutes left. I totally recommend Epic Escape, stellar customer service and a great game. Worth it.",
   "It was a good time. They had to stop the game to fix a couple errors but it was fine after that",
   "By far the best! Challenging and fun. The hosts are always friendly and in theme!"
  ]
 },
 {
  "name": "Puzzah! Escape Room",
  "address": "1440 Blake St #150, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ccf10242-932f-11ea-89f5-14b31f159f22.png",
  "tags": [
   "creative",
   "kids",
   "family"
  ],
  "link": "https://maps.google.com/?cid=4570504528677504810",
  "source": "GoogleMaps",
  "reviews": [
   "I went to Puzzah with a group of 6 people. The room we did was not as we expected. The puzzles had to be solve one by one to move on.  We thought we were able to solve other puzzles while another team member worked on one. It was frustrating to get stuck on one puzzle and not being able to move on. There was a point where all 5 of us were watching one team member solve a problem for over 6 mins and not being able to progress in the room. All the escape rooms we did in the past, this was beyond the least favorite of them. Hopefully they come up with creative ways to solve the puzzle rather than giving you the answers.",
   "Loved it we will do one again.",
   "Fun, puzzled based team work activity. You get about an hour to complete. The room was decent and the puzzles were mildly difficult even for kids. The house was friendly and the place was clean.",
   "I am so incredibly sad that this location closed down, our family loved it. We will absolutely support the others.",
   "This was so much fun! Definitely need to be in \"thinking mode\".... want to try more soon!!"
  ]
 },
 {
  "name": "Sculpture Park",
  "address": "1736 Speer Blvd #1848, Denver, CO 80204, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd3a6768-932f-11ea-b90a-14b31f159f22.png",
  "tags": [
   "music",
   "walk",
   "music"
  ],
  "link": "https://maps.google.com/?cid=13122810985656706364",
  "source": "GoogleMaps",
  "reviews": [
   "This place was amazing, it was the first time we saw the tree light, and it was playing music, like it was a party. It was really fun and, exiting! I would recommend for anyone but there are a lot of flashing lights, and it doesn't stay all year, so keep that in mind.",
   "Such a great little park, perfect for small breaks or if you just want to have some fresh air in the middle of Denver. This year (2019) the opened a new attraction for winter holidays, the Christmas tree! Definitely check it out if you are visiting, it won't disappoint you.",
   "No goes there but to walk there dog around the sculpture. Also many outlets that no one can charge there phone. Good for the dogs...",
   "The park is fine but the symphony at Boetcher Concert Hall is an experience a person should not miss. This was my first time there and I strongly recommend going at least once...it most likely will not be your last.",
   "Went for the 35 got digital tree show synced with music. It was cool. The event was sponsored by Cherry Creek so they had giveaways and invited for friends for pics with Santa, etc."
  ]
 },
 {
  "name": "Denver Skate Park",
  "address": "2205 19th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cd8357ae-932f-11ea-85e4-14b31f159f22.png",
  "tags": [],
  "link": "https://maps.google.com/?cid=12464012682325237158",
  "source": "GoogleMaps",
  "reviews": [
   "It was dope we got there early and started clearing the snow, next thing we know the whole skate park grabbed shovels and we cleared it as a community then we all shredded. The park is huge and there was so much to do there. Liked it alot.",
   "It caters to begginers and those with more advance skill equally.   I wish this park was in NYC so I could use it all the time.",
   "A great place to think & release the mind/soul. Practice the sport and network. It can be crowded with foreigners/visitors. Though always a fun/challenging time to skateboard with the locals. I constantly pick up trash there that people leave behind, would encourage to at least pick up after eating/drinking\nPlace is like a home away from home",
   "Had fun. There was ice all in the bowls but when I go back it'll be gone. Wasn't crowded at noon on a Friday. The floor of the party is pretty nice, no one really got in my way. Will update when I go back.",
   "Great park with a large street section, 3 bowls, and some other interesting terrain to roll on. Only down side was that it was pretty dusty when I was there making it a little slick. But great park."
  ]
 },
 {
  "name": "Rocky Mountain Arsenal National Wildlife Refuge",
  "address": "6550 Gateway Rd, Commerce City, CO 80022, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cdcdf552-932f-11ea-9fb0-14b31f159f22.png",
  "tags": [
   "walk",
   "hike",
   "free",
   "walking",
   "nature",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=1091898854583194636",
  "source": "GoogleMaps",
  "reviews": [
   "This is so much fun! It is a wonderful place to walk and hike. And, if you take the 11mile route around d the Arsena, you will see plenty of wildlife. The journey takes 45 minutes, but it took us 2 hours because of the amazing photo opportunities. This is worth a visit, and who can argue with Free? Thank you, Rocky Mountain Arsenal!l",
   "Absolutely beautiful views and awesome experiences seeing the wildlife here 😍 I definitely recommend this place to visit regardless of the time of year. We visited in the winter and there were still plenty of animals out and about!! Take your time through the drive (the road is wide enough on the one way trail for other cars to go around you) so you don't miss anything. Also definitely stop by the visitor's center! The staff there gave us a run down on where we might see what animals and the most recent location where the Buffalo were seen.",
   "Pretty cool place to drive through and check out some wildlife. They also have some nice walking trails and a cool visitors' center.  It's an easy spot to drive through on the way to the airport if you haven't seen any bison or deer during your visit to Denver.",
   "Great facility! I've never seen so many bison and that close. They were right up next to the car. The prairie dogs were also very fun to watch. Park, bring a snack and get out of the city.",
   "Really cool, wide open space with mountain views and high caliber wildlife. It's worth taking the nature drive (past the visitor center) to see herds of buffalo and deer. There are also lots of walking trails and some fishing spots. Great escape close to home!"
  ]
 },
 {
  "name": "Westlands Park",
  "address": "5701 S Quebec St, Greenwood Village, CO 80111, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce1cd8d0-932f-11ea-9c2c-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "kids",
   "art",
   "kids",
   "parks",
   "kids",
   "family",
   "food",
   "field",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=3047870364400133589",
  "source": "GoogleMaps",
  "reviews": [
   "This park is still one of our favorite places to go.  Great places for the kids to play and explore, and great trails for walking.  We like to check out the ponds and trees for birds as well.",
   "Beautiful. Varied paths. Lush greens. Public art. Large playgrounds. Multiple sports fields / courts. Bubbling water fountains for kids to play in. Large pond. Gorgeous trees. Spots for public events. A must see.",
   "We Googled and found this nearby park since we are new to the neighborhood. It's great! The section with the instruments is the best I have seen compared to similar areas of other parks I've been to in three other states. My daughter also enjoyed chasing geese around. The playground has great equipment and there are paths for kids to ride their bikes.",
   "Large and a very good place for kids to enjoy and play. Lots of slides and swings of different type. Many places to choose with good photo spots. One can come with family picnic, food and stuff. Beat thing is they have restrooms and drinking water. Small water pond also.",
   "We visited this place for a short while yesterday. My daughter loved the play area. It was also a great place for walking. The field was huge and there were a lot of geese yesterday, which added to the beauty of the field, the park and the small pond nearby. There is also a watchtower from where you can get a better view of the surroundings. Overall, a very good place to spend 1-2 hours."
  ]
 },
 {
  "name": "Museum of Outdoor Arts (MOA)",
  "address": "1000 Englewood Pkwy #-230, Englewood, CO 80110, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ce69243e-932f-11ea-9f57-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "art",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=4876009018084009726",
  "source": "GoogleMaps",
  "reviews": [
   "Very nice exhibits. Impressive amount of art in display. Staff very knowledgeable on the displays. They answered all my questions and explain more on detail each display. I recommend, if you are around the area, to stop by and check it out.",
   "Great display. There's some really beautiful stuff in there. I interacted with 3 members of the staff and though they were not rude they weren't friendly at all. Still worth going.",
   "This was a great morning. The RR exhibit and the levels of enthusiasm and knowledge of the staff was incredible.",
   "This museum is geared more towards children. Took maybe 30 minutes to read everything thoroughly and decipher hidden messages. \nThe installations were small, but I appreciated how different it was. It immersed you in an surrealist alternative reality.",
   "Was denied entry. Told it was sold out, even though we drove over an hour from Greeley. My kids were disappointed as was my wife since I had talked it up beforehand. They needed a better system of communication. Maybe if you register they will tell you beforehand if it's sold out or warn you so you can buy tickets beforehand"
  ]
 },
 {
  "name": "Civic Center Park",
  "address": "101 14th Ave, Denver, CO 80204, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cec0ba64-932f-11ea-9042-14b31f159f22.png",
  "tags": [
   "history",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=4632000574480854412",
  "source": "GoogleMaps",
  "reviews": [
   "Civic Center Park is actually a really nice place to hang out and chill. They often have rallies here that attract large crowds and the atmosphere is usually great but they do have a history of uncontrollable homelessness in which hundreds of homeless people come here to camp, use, and deal. This is definitely something people should know before bringing any young ones",
   "Luckily I actually got to visit on a day that it wasn't snowing and it was very pleasant outside.  I have lived off and on In Denver since 2013 and ha e frequented the area in the past, but never took the time to take a walk through the park as the saying goes.  Very peaceful, very clean and educational!!  I will definitely visit it again!",
   "Nice place. Recommend going during the day. There is a mixture of people in the area and there was a lot of litter on the day I went, but the area was still beautiful.",
   "Excellent open area park in the heart of downtown. All the major buildings have numerous historical plaques and have stunning architecture. The promenade is a wonderful place to have a picnic or just take in the scenery. Photo ops abound. A must stop for visitors to the city.",
   "Neat green space in the capitol area, surrounded by modern buildings and yes, the magnificent capitol with its eye catching dome. The place does have a sketchy feel with all the homeless and panhandlers roaming about, but they looked harmless and were not aggressive. When you see these people right where the seat of state government is, you're left wondering what those in power are doing to help them."
  ]
 },
 {
  "name": "Pirates Cove Water Park",
  "address": "1225 W Belleview Ave, Littleton, CO 80120, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf0e6568-932f-11ea-8e4f-14b31f159f22.png",
  "tags": [
   "kids",
   "food",
   "kids",
   "kids",
   "kids",
   "kids",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6511626523483944042",
  "source": "GoogleMaps",
  "reviews": [
   "A great, safe place to take little kids. I have a 5 and 2 year old that love the water. They have splash pads, and a large enough 3.5 ft pool area that the kids can enjoy. The larger slides and pools are in a separate area and so my littles aren't bothered that they are unable to play there. They have a Sandy Beach area to play in as well. I love that you can bring your own food in, too.  We will definitely be getting season passes each year!",
   "Path Home Real Estate customer appreciation night with Frank's BBQ &. Pirates Cove pool party.  All the kids loved it and the adults ate it up.  Thanks Joe Bogar.",
   "Best water park for littler kids (teens might be less entertained, but still plenty to do).",
   "We arranged a birthday party for my 2yr old daughter here. She loved it as all other kids. parents enjoyed too. Very few -water slides but good enough for kids. Definitely recommend.",
   "Always a fun time. The kids really enjoy this place. The staff is always friendly and the prices are low. My only complaint is that they could take better care of their restroom/changing rooms. I had the food for the first time and it wasn't half bad."
  ]
 },
 {
  "name": "Cherry Creek State Park",
  "address": "4201 S Parker Rd, Aurora, CO 80014, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cf5818c6-932f-11ea-8d44-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "eat",
   "walking",
   "walk",
   "hike",
   "parks"
  ],
  "link": "https://maps.google.com/?cid=8697569306435351271",
  "source": "GoogleMaps",
  "reviews": [
   "This is a beautiful park. We stayed here for a week in November and had such a great experience. The laundry facility is very nice. The grounds are clean. The wild life is the best part though. We were washing laundry and my children rode their bikes back behind the building. My daughter came riding back to let me know there were deer near. They were right behind the building! We stood on the sidewalk and watched them stop along the walkway to eat and they ended up walking all the way down the walkway and right over to our RV spot. After that my kids decided to ride again and found the whole family of deer. We enjoyed our time here so much and would definitely recommend!",
   "Massive area for so many activities. The off-leash park was INCREDIBLE. So much space, my dog definitely loves the entry ways for creek access. Really cool that the pass rolls into the next afternoon for up to 3 dogs.",
   "I LOVE this park!  My friend had me meet her there the first time I went.  I was a little put off by the $10 admission PLUS a $3 fee to use the dog park.  But I was hooked after visiting!  There are two loops within the off leash dog area. One is about a mile and the other is about 2 miles.  It was super nice to be able to walk and not have my dogs leashed.  They romped and played, met new dogs and new people, and I could launch a ball as hard as I could without it going over a fence!  It was great!  I ended up buying a yearly pass which was $108.  I take the dogs 3-4 times a week and it's been wonderfu . Totally worth the money.",
   "I think one of the best State parks around Denver. Remember the State Parks have hot showers. Great place to hike bike and have done plenty of orienteering courses at this park. Don't forget camping and grilling.",
   "Great space, has a few agility obstacles strewn about. The dogs love the creek too and it's deep enough in places that they can swim a bit. The car line can be long though - usually around 30 minutes"
  ]
 },
 {
  "name": "Delicious Denver Food Tours",
  "address": "1365 Clayton St, Denver, CO 80206, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cfa0bac6-932f-11ea-8c8c-14b31f159f22.png",
  "tags": [
   "walk",
   "food",
   "drink",
   "knowledgeable",
   "tour",
   "food",
   "tour",
   "family",
   "food",
   "delicious",
   "tour",
   "history",
   "food",
   "tour",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=11217620959291169871",
  "source": "GoogleMaps",
  "reviews": [
   "So much fun! We have done a few food tours in other cities and this one will definitely be one to remember. We did walk through some snow, but it wasn't unbearable. We learned so much about the city and Rob did a fantastic job answering our questions and taking care of us. Thank you Rob! This really made our trip special.",
   "What an amazing experience! We had Chris as our tour guide and he was awesome. Funny, personable and knowledgeable. Jessica planed everything flawlessly even though our group had many food restrictions. I would definitely recommend the drink pairing as it really enhanced the experience. I am a Denver native and was surprised by how much I learned about the city on the tour. I highly recommend this tour if you are looking for a fun group event. We will be back!",
   "Jill was amazing! We had a fabulous three hour tour with her all over lodo Denver. Our family loved her and all the food was perfect. From type to portion sizes. Absolutely fantastic.",
   "The food tour was not only delicious but a lot of fun! It was very interesting to see local restaurants, hear about their history or specialties and have great food at each location. Highly recommend this tour!",
   "The highlight of our time in Denver was our walking Food Tour.  The variety of tastings was perfect - loved the Navajo tacos, the REAL Italian pizza, butcher curated meats and cheeses and oh, those baked empanadas.  The drinks served with each were a great compliment - best margarita, housemade limoncello, old-fashioned with housemade bitters and finishing with a glass of Malbec.  The stories about each place were so interesting and Lisa was a really fun guide who managed to get a behind the scenes peak at the pizza kitchen.  We learned about this fun emerging neighborhood LODO and just had the perfect evening."
  ]
 },
 {
  "name": "Denver Trolley",
  "address": "1400 Water Street, Behind REI along the South Platte River., Visit our website for hours of operation., Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/cfee4df4-932f-11ea-9fbc-14b31f159f22.png",
  "tags": [
   "kids",
   "kids",
   "kids",
   "free"
  ],
  "link": "https://maps.google.com/?cid=15470272515206118502",
  "source": "GoogleMaps",
  "reviews": [
   "The Denver Trolley is an under appreciated gem near REI and Starbucks. The gentlemen we had were polite, funny and respectful. The reversible seating once you hit the end of the line was awesome. If you wanna get to the children’s museum or even Denver Broncos home games, take this trolley.",
   "I absolutely loved this little trolley experience. The ride isn't long but the workers have cheesy funny jokes and give lots of fun facts about Denver and the area surrounding the trolley ride. Kids will definitely enjoy this!",
   "Great day had a lot of fun.  Enjoyed the ride.",
   "Good overview of the scope of Denver. Super touristy. Lots of kids. This isn't necessarily must do but it's worth the ticket price and it's fun.",
   "Fun for kids! \n\nTip: go early; opens at 11am. Adults $5, kids under 4 free! "
  ]
 },
 {
  "name": "National Western Stock Show",
  "address": "4655 Humboldt St, Denver, CO 80216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0353d90-932f-11ea-9d26-14b31f159f22.png",
  "tags": [
   "kids",
   "walking",
   "family",
   "food",
   "walking",
   "free",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7524121082064817016",
  "source": "GoogleMaps",
  "reviews": [
   "The National Western Stock Show was awesome!! We got there right at 8am for the best parking... many of the exhibits don’t open until 9 bit there was SO MUCH TO SEE that really didn’t matter!! From the Children’s area that has the petting zoo (which we also got in line early for:)) to walking around and seeing SO MANY different animals...and BABY animals :)-it was PERFECT! There are shops galore and we went on the second to last day so were able to get some good deals on different items! If you haven’t gone, I would highly recommend it! Wear comfortable shoes for lots of walking and a bag to carry all your stuff in 😊... have a great time with your kids or on a date! Worth the time and money!!",
   "I always go to the stock show every year with the family. We typically steer clear of the food stands because of prices but we enjoy walking around all the different vendors to see what cool things are being sold. We always would watch the rodeo because not only is it inexpensive but who wouldn't want to watch a clown jump in a barrel and get smashed by a bull? Can't wait for next years stock show when I have some land!",
   "Get your cowboy on and come out to one of Denver's most iconic, annual events. You'll love the rodeo announcers banter as you're served up one bucking bronco after another twisting bull. There's tons of excitement to be had in that little stadium. Then, don't miss the hundreds of vendors throughout the complex. Some of this stuff you can only find at the Stock show.",
   "Had a great time. Loved seeing all the animals. The babies are so cute. Watched the draft horse show. It was great. It was so funny watching the mules barrel race. I also enjoyed the beautiful prancing horses. The big strong horses doing the weight pulling was sure something to watch. They seem to love trying to pulled the heavy sleds. This is a great place to bring the entire family...young or old. Parking is free and they have free shuttles. Plan to spend the day.",
   "Pretty cool place with different animals to look at and a great petting zoo! The arena is cool too and there are events that happen there off and on all day. The stock yard is great too and had buffalo, yaks, and even Texas Longhorns. Great educational experience for the whole family!"
  ]
 },
 {
  "name": "RiNo Art District",
  "address": "3525 Walnut St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d07aad90-932f-11ea-bb43-14b31f159f22.png",
  "tags": [
   "art",
   "walk",
   "art",
   "music",
   "art",
   "walk",
   "art"
  ],
  "link": "https://maps.google.com/?cid=5253998860059245060",
  "source": "GoogleMaps",
  "reviews": [
   "Great art , great bars and cafes, awesome people and a great night out district. You won’t find yourself at a loss with activity here. Good eats and nice cozy cafes to lose yourself in. The new RiNo district is definitely becoming more and more booming by the minute. And it’s also very accessible by public transit and the birds or limes scooters!!!",
   "One of my favorite places in the Denver area. A lot of wall art building art, art and garages, on the ground.  You just never know what alley something beautiful might be worth the walk.  It’s such a fun cute place for people to express their creativity and their talent.\n\nFantastic restaurants, great shopping, and some super fun music.",
   "Such a wonderful place to go visit. Quiet and lots to see. Really a great place to go if you're looking to see some amazing art.",
   "Great area for a date night. Even better to grab a Lyft, Bird, or Lime scooter. Most of them are pretty low in battery in the evenings though. Lots of restaurants and bars in the area!",
   "A beautiful walk to discover art and architecture. Easy to navigate the area on foot or public transportation."
  ]
 },
 {
  "name": "Let's Roam",
  "address": "1801 California St UNIT 2400, Denver, CO 80202, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0b78f36-932f-11ea-a375-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "history",
   "learn",
   "tour",
   "free",
   "kids"
  ],
  "link": "https://maps.google.com/?cid=995275644521036677",
  "source": "GoogleMaps",
  "reviews": [
   "This is AMAZING!\nI highly recommend it for all people of all ages who enjoy a good adventure and don't get bored easily. Awesome get-to-know-places kind of thing. Such a great idea whoever made this scavenger hunt, I say to you now and forever. With the full force of my team; you did a jolly good job, mate. Well done.",
   "Love the holiday decor.  The cocktails were amazing, the atmosphere was wonderful and the food and service great.  Would totally go back when in the city again.",
   "Nice way to see the city- lots of variety - coast, gardens, history, inner city. Brings you relatively back to the same spot. I am an android user and had no issues at all with the app. Paused it many times to explore areas further and eat lunch. Liked the questions at each point and the option to find places yourself or spend points for directions. Didn't like the photo challenges but they were easy enough to bypass.  Good length- took us most of the day. Will definitely be doing another one.",
   "The lack of a proximity feature and distance/direction indicator proved to be frustrating. We relied on Google maps several times for guidance to the next location. Once at the locations the hunt was enjoyable and educational.  Three generations enjoyed our leisurely stroll through the campus of Arizona State University.",
   "This was super fun. Such a great way to learn about the city. The kids loved it also. Easiest way to get them outside AND on their phone at the same time, not to mention the exercise that they got without realising it. Everyone who saw us doing the tour asked questions and helped us out, right down to opening the fire station for a quick free tour. We plan on doing this on every city that we can on our upcoming tour.  Recommended."
  ]
 },
 {
  "name": "Great Lawn Park",
  "address": "101 Yosemite St, Denver, CO 80230, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d0f4fafa-932f-11ea-a464-14b31f159f22.png",
  "tags": [
   "walk",
   "kids",
   "walk",
   "walk",
   "free"
  ],
  "link": "https://maps.google.com/?cid=18194736787545522624",
  "source": "GoogleMaps",
  "reviews": [
   "Peaceful park to walk around. Pond and stream give it a peaceful atmosphere. Playground is great for kiddos.",
   "It is a very great calm place for relaxing and great distension to let your kids enjoy the safe playground, but unfortunately, I noticed a tree trunk left after cutting a tree, which is frankly I consider it as a safety hazard. They can provide tripping hazards to children playing in the playground since they are solid wood, where if a person tumbling onto one can be seriously hurt. I am gonna attach photos for the park administration's reference for quick and early action.",
   "It is a good park to have a good time with your children Ina clean, quiet, pretty and peaceful place, good lake with gooses, ducks and fishes. \nPlenty of space to walk and jogging.",
   "Peaceful and beautiful lake. Awesome place to take dogs - both sidewalks and lush, green open space. Seated viewpoints. Highly recommended.",
   "What a great park. Perfect for a walk. Woth or without a dog. Need a FREE DOG WALK? Download the Wag app and use code DEBRA1018."
  ]
 },
 {
  "name": "Rockmount Ranch Wear Mfg Co",
  "address": "1626 Wazee St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d13c446c-932f-11ea-a4e0-14b31f159f22.png",
  "tags": [
   "kids",
   "family",
   "history",
   "history",
   "family",
   "history"
  ],
  "link": "https://maps.google.com/?cid=895793065535065952",
  "source": "GoogleMaps",
  "reviews": [
   "Known for their iconic diamond shaped snap buttons, Rockmount has been a Denver landmark for generations...So much so that the city memorialized the late founder by giving that block of Wazee Street honorary signs renaming it Jack A. Weil Way. \n\nRockmount is where you go to get something that will get you compliments every time you wear it. It's a preferred shopping stop by rock stars, rodeo champs, and anyone seeking high quality Western wear with distinctive flair. The space itself is store, warehouse and museum wrapped in one, and every time I've been in the staff treats me more like a neighbor than a customer. On multiple occasions, I've even had other loyal customers act as ambassadors, chatting me up and sharing about their \"collection\" of Rockmount.\n\nThe prices are on the higher end (expect to pay around $75-$110 for men's shirts) but the quality and style are worth it. My leather gloves are at least 6 years old and continue to look great. I still wear shirts I bought there 10+ years ago. I even have vintage 70s + 80s Rockmount shirts picked from thrift stores that have never so much as had a snap button fail.\n\nIf you're on a real spending spree, their hats, leather jackets, and cowboy/cowgirl boots are A+. If you'd like to get the experience but not the expense, t-shirts run about $25 and they have beautiful bandanas, stickers, and tin reproductions of their famous logo for under 10 bucks.",
   "Fantastic store. Love the shirt I bought. Only low point was the staff shooing me away from new stock. I get it isn't for sale yet. I'm not local so encourage me to keep my eye on the website or give me the option to pre-order.\n\n*There was a rack by the desks to the left behind the register. I was very interested in a shirt but was told it wasn't for sale yet. I will check out the website because it was an awesome shirt. I love the one I did buy and would buy another.",
   "What a gem of a store! We visited for boots, and picked the store based purely off reviews and location. Little did we know, we walked right into a piece of the Western history. I've been enjoying reading Denver post articles about the history of this fantastic store and original owner. It's a family owned store with a variety of quality Western wear items from a variety of manufacturers. I now know their bread and butter is their line of high quality and I in Western shirts. They carry clothing apparel, jewelry and footwear for men, women and children. You'll be shocked at how much great stuff they pack inside this location. The store appears to be family operated, and the staff were about as kind as you could dream up. Apparel pricing is pretty great, including their still handmade in the USA Western shirts and high quality belts. We nabbed some boots for the kids, a gorgeous embroidered children's button up shirt (sadly, a gift), a book, and a beautiful tooled leather belt for me. They even let me swap the belt buckle with one I liked better.  \n\nTip: Don't forget to head upstairs and visit the little family curated, complete with personal items, anecdotes, and collectors memorabilia. And say \"hi\" to the Humboldt, the lovely yellow lab.",
   "An excellent establishment for traditional western wear. Great atmosphere even if your just window shopping. Take a look at all the pictures,  some amazing history on those walls.",
   "Coolest western clothing shop west of the Mississippi River. Uniquely designed shirts and large exotic boot selection. Family run store with a long history. Be somebody and be seen here. A destination onto its self."
  ]
 },
 {
  "name": "Chamberlin Observatory",
  "address": "2930 E Warren Ave, Denver, CO 80210, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1873068-932f-11ea-b07c-14b31f159f22.png",
  "tags": [
   "tour",
   "music"
  ],
  "link": "https://maps.google.com/?cid=3517724101781207908",
  "source": "GoogleMaps",
  "reviews": [
   "Saturday night viewings & Tues/Thurs. public nights. If you are one that cares about the universe, space, astronomy, physics, or life in general, this is a great place to go. Whether visiting to view through a telescope, view the stars in a dimly lit area of the city, or just experience a peaceful ambiance, this is a must visit. The experience lends itself to all. People are friendly, observations are stunning, the experience is thought provoking. Thank you to Denver Astro Society for this! Much appreciation!",
   "Took a tour of the Observatory and got to look at the moon through the telescope. It was an awesome experience. Even touring the basement. Highly recommend for everyone!!",
   "The iced latte was nice but a bit watery. The ambiance was good, the internet was fast, but also it was hard to find chargers and the washroom was a bit dirty. Overall really nice atmosphere to study, the festive lights and music helped brighten the mood.",
   "What a great Gem in Denver.\nBeautiful when they have the open house nights",
   "So fun to be able to go and peek through a giant telescope while getting schooled on  space by people who are passionate about it."
  ]
 },
 {
  "name": "The Denver Central Market",
  "address": "2669 Larimer St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d1d9bd74-932f-11ea-9cb2-14b31f159f22.png",
  "tags": [
   "food",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=9447312708417286029",
  "source": "GoogleMaps",
  "reviews": [
   "A great location to go if you're looking for food in the RiNo area. They have an amazing selection of local vendors and almost any time of food you could want. Also a good place to go if you're looking for a centralized location to meet friends and have a quick coffee or pastry.\n\nIt was difficult to find seating at peak hours but eventually we were able to find a table to fit our group. We were able to sit here for a few hours getting some meetings and work done without issue.",
   "Super cool market! Sooo much going on. I was amazed at all the options. To name a few, ice cream shop as you walk in, bakery to the right, bar to the left, BBQ, vegetarian food outlet, oven baked pizzas(you can see them making your pizza!!) And chicken and burgers on the end. Lots of more things to do and see too! MUST go check this place out.",
   "Such a cool location right in RiNo! The market place is huge with vaulted ceilings and a warm, industrial feel. There’s probably 10 different vendors in the space. Pizza, bbq, sandwiches, coffee, ice cream, pastries, etc. is all there. The Central Market is a wonderful place to hang out with friends or show visitors!",
   "Fun atmosphere and vibe. Great location and great food options. It was hard to find a place to sit and I'd love to see the use of fewer to-go type containers.",
   "Definitely gonna give five stars to this restaurant because their Meat items have impressed me a lot. There are various kinds of fast foods such as Chocolate cup cakes chicken, chicken and salad, etc. Very good customer service. Recommended to nearby people."
  ]
 },
 {
  "name": "Rio Grande Mexican Restaurant",
  "address": "1525 Blake St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.1,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2276878-932f-11ea-936e-14b31f159f22.png",
  "tags": [
   "delicious",
   "free",
   "music"
  ],
  "link": "https://maps.google.com/?cid=8250140790111902904",
  "source": "GoogleMaps",
  "reviews": [
   "Very delicious chili con queso and tacos. Place was busy on a Wednesday evening after Rockies game, but server, Kati was efficient, friendly and helpful. She did say most items could be made gluten free and that they had a separate fryer for gf!",
   "Quite the treat in LoDo Denver. Our server Andrew was really attentive and on his game. Each of us had different items and really enjoyed it. Definitely would recommend Rio Grande. If you come in, ask for Andrew.",
   "Pretty good! The steak and chicken better than the fish I think! Quick and pretty good service",
   "Went solo on a Monday at 6:30pm with beautiful 80 degree weather and sat outside. I was seated quickly at a 4 person table as the outside bar wasn't open yet. \n\nThey have a relaxing fountain, although some modest music drowns it out a bit, and it's next to the street but the traffic is not loud or bothersome.\n\nI met a cook that works there and asked him what he recommends and he said anything with steak. Ended up getting the steak fajitas with double rice, no beans, which was well portioned and had great sized veggies. Four flour tortillas came with it and were warm and soft. It was $22.63 with tax and I considered it well worth it!\n\nThe on-the-house salsa also had great spice to it and they offered to get me more, which not all places do, especially for one person.\n\nHighly recommend this for a few friends getting together for a low key dinner or drinks.",
   "I loved this place. They have quite a few vegetarian options and they are really good. They don't have any veggie taco options. But the way they make their black beans is amazing. I would recommend trying the house Margaritas (Mango - Strawberry is my favorite one). \nRecommend any vegetarian dishes to try. I tried a veggie burrito and a quesadilla."
  ]
 },
 {
  "name": "Rioja",
  "address": "1431 Larimer St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d26ea336-932f-11ea-aa99-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17121331333134231372",
  "source": "GoogleMaps",
  "reviews": [
   "The food is exceptional, I believe this might be the best food I have ever tasted. The service was great as well, I am vegetarian and they made the tortellini vegetarian for me. Still so flavorful. I had a pear thyme soda, it was so delicious as well. They offer delicious bread to start with. Just a perfect experience for my 2 year anniversary with my boyfriend. I never can go to such fancy places, but this was well worth the price.",
   "From start to finish this restaurant hit everything. Servers knew the menu and made excellent recommendations. (Thank you Jason!) Wine by the glass was nicely paired with interesting menu options. A wonderful meal overall. Stopped in for a weekend lunch recently and was very pleasantly surprised! I had been hoping for the standard lunch menu (which looked awesome) but was provided the brunch menu - which was terrific! Service was top notch. I would return here again without any hesitancy.",
   "Great food! Amazing service.. the pasta were great and the vegetarian 4 platter was amazing! Really enjoyed dining at Rioja. Definitely on the expensive side but worth it. Also a good place for romantic dinner",
   "Good service and good food. A few of the items I tried where worthy of high honors, but sadly A couple items where only normal quality. Still overall it was a good place for a special occasion",
   "Rioja is always excellent! Service is the best you will get anywhere and food is always on point. One of the most consistent spots in Denver. Worth a visit or multiple!"
  ]
 },
 {
  "name": "El Five",
  "address": "2930 Umatilla Fifth Floor, Denver, CO 80211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2b1ad74-932f-11ea-aaf1-14b31f159f22.png",
  "tags": [
   "drink",
   "food",
   "delicious",
   "knowledgeable",
   "food",
   "foodie",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11766026102108403718",
  "source": "GoogleMaps",
  "reviews": [
   "I honestly did not know what to expect before coming to this restaurant and I would be lying if I said that I wasn’t a little bit nervous about going to it. But after my experience I realize that this place has so many amazing qualities to it that I will definitely be returning  within the nearby future! As soon as I walked in I felt very comfortable because of how clean the whole place was from the windows to the tables to the ground! I was immediately greeted by a very friendly staff member who walked me to the exact table that I actually wanted! My waiter was extremely superb and made sure that he got everything that I needed fast. Even though I only saw my waiter a couple times he was extremely kind and was willing to spark up a conversation which was very well mannered! That just shows me that this place only accepts top notch waiters to work there! There is also a very popular bar area inside of the restaurant that has any drink you could possibly ask for! The bartender is extremely helpful and will inform you on what exactly you are about to or currently are drinking. If you have not been to this restaurant yet and you live within the area, then you are highly missing out on the great food and customer service that they provide! Whether you live within the area or not if you truly want fresh quality food come give this restaurant a shot! The prices are also extremely fair considering you really get top notch food and customer service there, I have already recommended this place to multiple people and I will continue to do so due to the amazing experience that I received during my very first visit!",
   "This is definitely one of the best restaurants in Denver. My friend and I weren't very excited when we read the menu online but everything was very well executed and delicious! We sat at the chefs table so we also enjoyed a few small samples. The sommelier was knowledgeable although we waited a while for her to show up. Their wine list has some less usual varietals. I had a white blend from Sicily and it was paired great with the sea bass dish. The view is a bonus.",
   "I LIVE for this restaurant. Best service ever! Thanks Drew, Thanks Jack. WOW! The food is the best I have ever had & I travel the world as a foodie. Nothing beats El Five. You are not crowded in (Which is a deal breaker for me). Yes the views are the best in town but the food…Oh my God…the food will make you cry. Great different drinks. We took all of Jack’s suggestions & WOW did he ever hit the mark. See you soon.",
   "Great view.  The mini lamb chops the best. It's I bit expensive but is worth it. They also valet which is convenience.  Clean full of beautiful people take  your  next date here and is a Done deal he/She will love it ❤❤❤",
   "My wife and I had the pleasure of dining here while on a getaway weekend.  The food was amazing and beautifully presented; definitely recommed the smoked buffalo.  We were also lucky enough to arrive on a clear night and really enjoyed the view.  Our reservation was later in the evening, however at no point did that deter from the quality of service. Our server's recommendations were spot on for us. Overall a really memorable experience!!"
  ]
 },
 {
  "name": "Denver Biscuit Company",
  "address": "3237 E Colfax Ave, Denver, CO 80206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d2fc4cc2-932f-11ea-a76a-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "delicious",
   "food",
   "eat"
  ],
  "link": "https://maps.google.com/?cid=6665378868563934674",
  "source": "GoogleMaps",
  "reviews": [
   "We got the Franklin it was really good! Hot chocolate was great. Big cinnamon roll biscuit was not good compared to regular cinnamon rolls. It seemed not cooked all the way through. Husband liked it, I'm picky about pastries. Got a side of scrambled eggs and they were perfectly cooked! I would definitely go back.",
   "I was visiting from Texas and and we had a great meal! We loved that all the coffee cups were different and I happen to find a Texas one! Only downfall is they have all of these high tops, we really didn’t want to sit there but we had to if we wanted to eat. Great food but I would eliminate those tables!",
   "Always a long wait but the food is incredible. The parking situation could be better but its usually worth it. The drinks are great and the service is usually pretty good. Definitely one of my favorite restaurants. I get the vegetarian biscuit pot pie, with a scrambled egg on top and it's always amazing 👌🏻",
   "The food here is so delicious. I’ve only been here twice but the flavors are consistent. I definitely recommend The Franklin. It is very scrumptious!",
   "It certainly lived up to the hype! The biscuits were gigantic, tender and fluffy! I could eat a bowl full of that sausage gravy though, so deliciously indulgent! And the chicken, while you can't see it, was spicy, smoky and deeply crunchy.\n\nDefinitely worth the stop if you're in Denver, CO"
  ]
 },
 {
  "name": "Fruition Restaurant",
  "address": "1313 E 6th Ave, Denver, CO 80218, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d346c38a-932f-11ea-952b-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "delicious",
   "food",
   "tasting",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12237681217782802676",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely amazing food and service.  This place has been on my bucket list for years and I am so happy I finally had the opportunity to visit.  The food and service were excellent.  Everything was above and beyond my expectations.  Thank you Fruition Team for doing what you do!  I hope to see you again soon!",
   "What a wonderful experience! Went to celebrate my anniversary in memory of my husband with my son. They wrote a touching note thanking us. Food was fabulous and will definitely return. Thank you for a great night!",
   "The short rib and jar o’ red velvet cake was spectacular. Thank you. Not sure what sort of magic Chef used to soften and cream the provolone, but wow. Marvelous as always. Thank you for working and continuing to feed your neighbors.",
   "Fruition is always amazing but posting specifically about the takeout during Covid... absolutely incredible! Food is on point and delicious, packaging is well executed, call ahead process to grab a pickup slot is seamless, menu changes which is wonderful.. Thank you Fruition for making quarantine less terrible",
   "Stellar restaurant. Top notch experience. 2 Michelin star level dining. And a 7 course tasting menu for under $100? An incredible value for such high level food. Service was easy and impeccable. I do a lot of Michelin level eating and this was one of the best. When I'm in Denver, I will return here for sure."
  ]
 },
 {
  "name": "Barolo Grill",
  "address": "3030 E 6th Ave, Denver, CO 80206, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3886952-932f-11ea-ac67-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17632536167581134634",
  "source": "GoogleMaps",
  "reviews": [
   "This is a high end, authentic, Italian Restaurant. The food is delicious and authentic Italian. When the Gnocchi is so flavorful that you want to lick the bowl; you know its great food. The pasta is hand made, the portions can be sized to smaller plates, a huge selection of wines. Very high end, environment was warm and cozy. Waiter was on point, informative and attentive.",
   "We went here for our 18 year anniversary and had an incredible experience. Missy our server has been here for a few years and gave is an incredible experience.  Food was wonderful!! Manager (Adam) came out and said hello as well.",
   "Wow, what an experience!! The atmosphere was lovely and lively, yet not overbearingly loud. Our waiter Seth truly did a wonderful job explaining everything and offering proper suggestions. To top it all off, the food was incredibly flavored and perfectly proportioned to your liking. It was the perfect place to celebrate a birthday or any special occasion.",
   "This place is amazing. Time after time. By far the best Italian place in and around Denver.  My favorite restaurant hand down. The food is 5 star all the way. And Seth is the best server I have ever had. We only ask for him.",
   "The food, staff, ambience, the food. The food. Did i mention how incredible the food is. I just did a 2 week trip in Italy eating pasta most if not each day. This was just as good. Wow. Stop reading this and just head over to Barolo Grill, you won't regret it. \n.\nAside: make a reservation. Also, the food seems pricey but on pasta you can do half orders. We did that so we could have a few different types of pastas. Yum!"
  ]
 },
 {
  "name": "Tavernetta",
  "address": "1889 16th St Mall, Denver, CO 80202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d3d3f158-932f-11ea-8dc6-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=13516146007308691311",
  "source": "GoogleMaps",
  "reviews": [
   "Actually came here for the 1st time yesterday. And we were so nicely surprised. Such an modern clean design of the interior. The staff is very kind and helpful. And food is amazing modern approach to my favorite classic Italian meals which I love when I am in Italy.",
   "Tavernetta is where you go when your best friend is in town. Food A+, Wine A+, Service A+, Location A+. Eat something from every course. Pasta is magical. Meat perfectly seasoned. Beautiful ingredients, layers of flavors. Portions are just right. Impress your friends (or your date or your husband). Live your best life.",
   "This restaurant is fabulous. The service from the moment you walk in is great. You are cared for by several staff members through your meal and they make sure you are taken care of well. The food was  fantastic and the portion sizes were perfect so we could try several dishes without getting too full too fast. Definitely will go back.",
   "Absolutely amazing experience! Every dish was exceptional and the presentation was perfect! The staff is extremely helpful, hands down some of the best service I've encountered in a while! Keep up the great work, I recommend Tavernetta to anyone wanting a top notch experience!!",
   "We stopped by for a Negroni for my birthday and stayed for a meat and cheese plate with dessert. Check out the community room it’s the best place to dine. You get a private window view of the kitchen."
  ]
 },
 {
  "name": "Guard and Grace",
  "address": "1801 California St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d41ba902-932f-11ea-ba0f-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "food",
   "delicious",
   "knowledgeable",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18413065755118645889",
  "source": "GoogleMaps",
  "reviews": [
   "What an amazing experience. This place hits all the marks. The food, the drinks and the service are perfect. If your looking for a place to grab a perfectly cooked steak, or perhaps grab some oysters and crab legs, in downtown Denver, this is it. The wine selection has a wide range and there is something for everyone’s palette.  I highly recommend their version of surf and turf and check out their fresh bar of seafood. It has a fine dining/ classic American menu, with just enough unique flavors to appeal to pretty much anyone. \nWe went here for an anniversary early dinner and it was perfect. Definitely make reservations because it books fast, even for lunch.",
   "The food was great!  Everything came well-cooked and well-flavoured.  It should be the same with other upscale seafood restaurants.  But what sets this place above the others is the speed and the quality of the service!  Our server (sorry I did not get her name) worked wonders.  Her recommendations were sound, her appeal was above-board, her speed was unbelievable, and her Guard and Grace made the experience memorable!\nGuard and Grace",
   "Love Guard and Grace, but it has lost something over the years. I cannot place my finger on it. Overall, this is one of the best restaurants in Denver. You cannot go wrong with anything here. It can be a little pricey, but you would already know that if you were reviewing the menu.",
   "If I could give more stars, I would. Everything about this place was amazing. The staff, the location, THE FOOD, and the ambience were all wonderful. We have the luxury of knowing Kyle Biddy in the kitchen. He was so knowledgeable about every dish and talked to us about everything on the menu. We got to try a lot of items on the menu and everything was delicious! (The Gnocchi, just WOW) The server was very attentive and knowledgeable as well. I would recommend this place if you are looking for a nice time out, great food and nice staff! On the pricey end, but well worth the money.",
   "All the stars go to our server. Went here for a birthday celebration and Sarah made the experience unforgettable. I have never had such a great server- recommendations were on point, she was attentive but also not stiff. Thank you so much for making our dining experience amazing"
  ]
 },
 {
  "name": "Work & Class",
  "address": "2500 Larimer St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d46875e8-932f-11ea-8d2a-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14588461797921754321",
  "source": "GoogleMaps",
  "reviews": [
   "Great place! Our table had a broad range of dietary restrictions including a vegetarian and a vegan but all of us left satisfied. This restaurant serves food primarily in the form of small plates. Many of the menu options were already vegan and several others were easily adapted to accommodate without sacrificing flavor. Everything was delicious, shareable, and beautifully plated. The view was also breathtaking from every table and the ambiance was perfect for dinner and drinks  with friends.Highly recommend",
   "Denver tends to have a lot of the same options when it comes to bathrooms. The gentle, classy ambiance provided by Work & Class is not typical of what you find in the city, but a wonderful change of pace when looking to hide in the bathroom to get away from your sister while she vacations in the state of Colorado. I highly recommend spending some time enjoying the wonderful vibes provided in this grade A dump center.",
   "I visited Work & Class for dinner while in town visiting a friend. I was intrigued by their approach to dining and the wonderful reviews for the food. \nI have to say I was not disappointed. The place was packed when we arrived on a Thursday night. Thankfully they were able to seat us. We got a table in the heated patio area which had a very appealing feel to it. \nFelicity was our server. She was enthusiastic and did a great job going over the menu and making recommendations. \nWe ended up ordering a 1/4 lb of the lamb, the brisket and a 1/4 lemon brown butter chicken along with several sides. All proteins tasted amazing. The brisket serving seemed really small and wouldn’t have been enough on its own for one person. \nAt the end of our meal we ordered some desserts to go. One of them being a hot brownie a la mode. They packed the brownie with the ice cream already on it which was a very poor choice and affected how we’d be able to enjoy the dessert later.",
   "Just stopped by to get my first to-go food of the past few weeks, 1 meat and 1 veggie breakfast burrito. Both burritos were exceptional, these are new to my knowledge as a menu option. The mole sausage was fantastic, but the mushroom veggie version was my favorite. The mushroom was kinda like sausage, crumbly and savory. The gentleman that helped me out at the window shared the hospitality that work & class is known for. They had a jar of sanitized pens and gave my dog a treat. Great experience for my first meal 'out' in awhile, i'd recommend stopping by and supporting local, they are taking customer safety very seriously.",
   "Amazing fun quirky place. Great location. We came here for a team dinner and although we had quite the wait. It was worth it. Went across the street to get drinks while we were waiting and had some here, no problem. Definitely get the mashed potatoes."
  ]
 },
 {
  "name": "Panzano",
  "address": "909 17th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d4acd20a-932f-11ea-8a77-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "eat",
   "food",
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15547743853428611598",
  "source": "GoogleMaps",
  "reviews": [
   "We love going out. Yesterday we came to this magnificent restaurant which friends recommended to us. We passed a beautiful evening there with exceptional cooking and a well-trained team and a distinguished chief cook. We  added this venue in our phone list  and we shall definitely come back very soon.  Highly recommended.",
   "Delicious food! Everything was very fresh and amazing! We definitely will be eating here again! Came here for our 10th anniversary meal and it definitely did NOT disappoint! Would love to try their breakfast and other entrees they serve as well!",
   "Absolutely loved the bread basket with the paste to spread on it. It is absolutely delicious. The rest of the food was great as well. Almost wish they had a little bit of an easier menu but I guess it has a lot of traditional Italian foods. I wouldn't say that I'm the most pickiest eater but definitely a little bit more than most. I was able to find something that I would eat and it was actually quite delicious once I ate it. Highly recommend if you are a huge Italian foods person. Price wasn't terrible either. The food quality is worth every penny. The Waiting staff did great as well. Very prompt and helpful and was very good at explaining everything.",
   "Delicious food & great staff!  Located inside the Hotel Monaco.  Reservstions are recommended.  Be sure to come with an appetite!",
   "Came for restaurant week, will definitely be back to try their full menu. The food was amazing and the service was phenomenal! We were so full, we couldn't finish dessert but they boxed it up to take home and it was just as good the next day."
  ]
 },
 {
  "name": "TAG Restaurant",
  "address": "1441 Larimer St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d4eee448-932f-11ea-bbda-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=10382034834054918996",
  "source": "GoogleMaps",
  "reviews": [
   "We went last night for Restaurant Week. The menu was OUTSTANDING, but what I want to highlight is the exceptional service we received. \nOur reservation was a bit delayed so the hostess had us wait at the bar and bought us a round of drinks. The bartenders took great care of us. The hostess kept us updated even though it was so busy. Once seated our waiter was just lovely. He seemed so relaxed even though they were busy. We had a great time and felt taken care of. It was so appreciated, beyond what the staff at TAG could possibly know. Thank you an out-of-this-world meal and a wonderful experience!",
   "The food here was very inventive and interesting.  I really enjoyed exploring the chef's creations.",
   "Great atmosphere and staff!!! The food is incredible! If you get the chance, sit at the bar facing the kitchen! Watching the cook's is so entertaining!!!",
   "Couple of buddies and me went to the Motorcycle Show and after we went to TAG in Larimer Square. The experience was awesome some of the most tasteful food I’ve ever had. I had the Hamichi which was perfectly prepared love the Jalapeño and Pop Rocks touch. We had few other apps including the Kobe Sliders with fries. You’ve got to taste the fries! Epic French Fries. Dusted with cinnamon and sugar I think. Awesome taste. Our drinks were good the entrees were even better. One of us opted for the Hanger Steak - came out superb really flavorful and no over cooked. Try the sushi tacos another great dish. Over all we had a great experience and our food was epic. Gotta try this place.",
   "If I could give this 10 stars I would. From the moment we walked in the door it was obvious the class and hospitality this place had. Our server Melissa was BEYOND. Even if the food was terrible, in which it was world class 5 star, I still would have given 5 stars based on Melissa’s service alone! The management was just sweeping the place, bussing tables, chatting with guests, picking up the slack like any amazing restaurant management would. The Director of Operations was in the house, what a guy, incredibly accommodating and clearly beyond passionate about the restaurant and the other restaurants owned, exactly why this restaurant is what it is. He was just magic, interacting with guests, his staff, ensuring nothing but the best for not only his guests but the people that worked for him. The food was ridiculously good, YOU MUST order the Kobe beef sliders, never had something like it in my life. Every dish was decadent, not a flavor missed. Tag Restaurant is a must when living or visiting the amazing city of Denver! Thank you to the Tag Restaurant team for an incredible night out."
  ]
 },
 {
  "name": "Snooze an A.M. Eatery",
  "address": "2262 Larimer St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d5484f24-932f-11ea-9d1a-14b31f159f22.png",
  "tags": [
   "drink",
   "unique",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=8040809900748654196",
  "source": "GoogleMaps",
  "reviews": [
   "This lovely joint is a can't miss! Do you enjoy eclectic food and drink with an appropriately bacon focused appreciation? Then this is the place for you. Great staff as well!! It does get busy, so prepare for some extra time. I highly suggest exploring their unique adult beverages. And boy oh boy, that Shrimp and Grits, tongue-boggling. Enjoy!!",
   "Every dish was amazing I tried. Went on 4 different occasions. Atmosphere and music were nice. Pretty 'hip' place. To me the espresso flavour could use some loving. But small details especially for a diner 🤘",
   "This restaurant always has a wait time, but at this location it is absolutely worth it. We went here for my 21st birthday and the staff was amazing. They made excellent recommendations and took all my allergies into consideration. Love this location, good job everyone!",
   "As always I love coming here. I always joke with friends that paying $15 for pancakes is absurd but they make great food here. I have found myself hooked on the shrimp and grits of late and it has not disappointed one bit. The staff is welcoming both on your way in and on your way out -i think I was wished a great day by 7 or 8 people on the way out!",
   "***this was for the Colorado Ave. location***\nJust came for the first time ever. Quit my job and wanted to celebrate with a great brunch. The breakfast burrito was amazing. Even had hash browns in it. I got the spicy Bloody Mary and it wasn’t too spicy or too strong. The perfect balance. At the end, I told the waitress (who I’m sorry I forgot your name) that I was celebrating and she gave me props for living my best life. As I was leaving, she told me the manager has covered my meal and that they were happy I was doing this for myself. I talked to the manager, Noah, and said thank you. He even gave me a hug and said it was no problem and to keep “living my best life.” 100% will be returning."
  ]
 },
 {
  "name": "Tables",
  "address": "2267 Kearney St, Denver, CO 80207, USA",
  "avg_visitor_review": 4.8,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d58ef550-932f-11ea-838a-14b31f159f22.png",
  "tags": [
   "creative",
   "food",
   "kids",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2818954961388497828",
  "source": "GoogleMaps",
  "reviews": [
   "On a recent visit to Denver our friends took us for dinner at Tables—it was an exceptional experience and delightful meal. Everything we had was so good, nobody wanted to share. Biggest standouts were the tuna tar tar, scallop risotto, and pork chop. Can’t say enough positive. Outstanding restaurant, totally worth a visit.",
   "Tables is our Park Hill neighborhood special dining restaurant. With an eclectic atmosphere, the food is always excellently prepared, lots of it sourced locally with in-season freshness and the chef is creative in the presentation. You will be greeted warmly and have a great experience from the time of your booking until you have been served.",
   "What an experience!  Once you're through the door and the curtain, you'll see why it's called Tables.\nExcellent choice for either small business dinners or date night. Still casual enough that jeans aren't out of place. \nThe food was simply amazing. Every detail was spot on. Presentation... Flavor... nothing was lacking.\nService was equally impressive. We were given plenty of time to select our meals and the waitstaff answered every question without a hint of condescension.\nProbably not a great place for kids, though. So get a sitter and treat yourself!",
   "We're from out of town; our relatives love this restaurant. Simple, inviting atmosphere - check. Gracious hosting - check. The FOOD! - Obviously crafted with an understanding of both  flavor reduction and simplicity that comes only from expertise and fresh components. The chef checked in us regularly.  Hope to be back soon!",
   "Amazing service, lively but reasonably quiet atmosphere, well made, nicely presented and tasty food. Truly excellent."
  ]
 },
 {
  "name": "Root Down",
  "address": "1600 W 33rd Ave, Denver, CO 80211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d5cf0bd8-932f-11ea-95f5-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=17225337941047925068",
  "source": "GoogleMaps",
  "reviews": [
   "Everything we had--starters, main plates and desserts were amazing. They were super respectful of my mushroom allergy (even though it's not life-threatening) and even put the mushrooms in my husband's starter on the side so we could share (which was wonderful because his starter was delicious). My friend has an incredibly cheesy sense of humor and indulged in it a lot but our server was a great sport and very sweet.",
   "THE Happy Hour to rule them all. Every drink was perfect, and service was phenomenal. There wasn't a single thing we didn't love. We ordered one of each for the apps and the arepa was my favourite by far, my boyfriend loved the beets salad with steak on it.",
   "Terrific food, cocktails and ambiance. Trendy spot in a trendy neighborhood, every time I've been there the place has done a wonderful job. One of the more consistent restaurants in Denver!",
   "Absolutely loved this place. Great atmosphere and the food was delicious. The menu was small but was eclectic and modern without being pretentious. The combination of different flavors in each dish was mouthwatering. I highly recommend.",
   "It is pricey but wonderful!  I love what they are doing here.  I'm not a huge fan of going to the highlands, parking sucks and many other things but this place is delicious.  They also have a spot in the airport with we visit anytime we are there."
  ]
 },
 {
  "name": "Acorn",
  "address": "3350 Brighton Blvd, Denver, CO 80216, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d611e168-932f-11ea-9cf0-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "delicious",
   "organized",
   "music",
   "knowledgeable",
   "eat",
   "unique",
   "food",
   "food",
   "music",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12290491210482868743",
  "source": "GoogleMaps",
  "reviews": [
   "I Spent a few weeks at the Four Seasons Hotel in downtown Denver experiencing all of the great dining experiences and adventures that the city had to offer.  I had heard about this restaurant but was a little hesitant to visit due to the mass amounts of other restaurants to visit. When I finally did give this place a shot, I was not disappointed at all coming here and I  was very surprised at just how well everything in the restaurant runs. As soon as you enter the restaurant you feel this atmosphere of class and chill vibes which is very relaxing, as well as just how clean and organized they keep the whole restaurant. All of the music playing around the restaurant was nice and at the perfect sound. There is an extremely large menu to choose from with lots of different options for different preferences in people’s taste. Overall the food is beyond spectacular and I would highly recommend visiting this restaurant if you live within the Denver area or just wish to dine some exquisite food! I have already recommended this restaurant to multiple amounts of my friends and family and the ones that have tried it have told me that they have had similar experiences to mine and just truly how amazing the service and food at this place is! The staff at this restaurant are also extremely friendly and will accommodate you with any needs you may have! This is some of the better food in Denver Colorado, and I would put it up there with other high class delicious restaurants within the area. As I said if you have not visited this place yet you are severely missing out and need to come on by and experience the greatness within this restaurant!",
   "We hadn't been here in years, but it seems quality and above all service is still at a high level.  \n\nWe came here first when it was.newnajd the place to eat, but today we just came for some appetizers and drinks before a charity event. \n\nBartender was knowledgeable and passionate about his whiskey and was able to assuage by curiosity about Japanese whiskeys.  \n\nWe enjoyed the cornbread appetizer and the sourdough appetizer and the green olives.",
   "We came to Denver on our honeymoon, and explored many different restaurants during our stay. On our last night, on a whim, we came to Acorn, and experienced the best service and food of our trip! Our server Peter went above and beyond to make our dining experience special and unique! The food wasn’t what we expected at first, but with the first bite my new husband exclaimed that this was the best meal of the trip! If you come be sure to sit at one of Peter’s tables, and be prepared to enjoy a meal out of the ordinary; extraordinary!!!",
   "Inspired dishes , wonderful service, top notch cocktails, and exquisite food. We went for lunch and were impressed. The music was just the right volume, the service was just the right level of attentiveness, and the food set the bar high. Acorn is what farm to table is supposed to be.",
   "Some of the best food I have had in Denver! The waiter steered us in the right direction.. if you are in the mood for rich food, this is the place and the price matches it. Luckily it was worth every penny. In the photos you will see the tartar dish, the duck confit, and asparagus dish. Each one had incredible flavors and I’m not sure I would try anything else next time I go. When you find what you like, why change?"
  ]
 },
 {
  "name": "Sushi Den",
  "address": "1487 S Pearl St, Denver, CO 80210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d659bfd8-932f-11ea-a1e5-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "tasting"
  ],
  "link": "https://maps.google.com/?cid=12975132885708167184",
  "source": "GoogleMaps",
  "reviews": [
   "You won’t be disappointed. Had a blast here with some friends. Service was fine not over the top not lacking anything. The menu was fantastic and the prices were fair. I would definitely go for sushi only or again for sushi and entrees. The calamari was the best I’ve had in the states. The waiters can really help you with decisions on unique dishes to try. Great service and the sushi is so fresh. Always want to visit Sushi Den when I go to Denver!",
   "Fantastic sushi. And did not expect to have a sukiyaki available which was excellent. Basically a Japanese hot pot that I suggest everyone have once from anywhere worth getting it and it is certainly worth getting at sushi den. They also serve your choices in sequence of what should be eaten according to their taste profiles like what should be done; but is difficult based on the rate you eat and how much was ordered. Handled perfectly here",
   "This was the best sushi we have had in the states. The rice was so wonderfully flavored and the balance between rice and fish was perfect to me. The fish was fresh tasting with a melt-in-your-mouth texture. They also use crisp veggies that added great contrast. The service was pleasant and helpful. Both the hostess and server offered great suggestions. We arrived on a Friday around 9pm and were seated and served promptly. Would highly recommend to anyone.",
   "Incredible meal as usual, even during these times. You can see how hard the staff works inside from the street and it’s awesome to see a team coming together. Crispy spicy tuna, toro sashimi and a red dragon roll is the highlight of my week! Warm welcome from the patio, she even got me a water while I waited for the additions I made. I will absolutely do takeout again and be back when open to dine in. Wish we could do more than 18% tip!",
   "Best sushi restaurant I've been to in my life. \nEverything from the miso soup, to the sushi rolls, and even seaweed salad was a cut above any I've had elsewhere!\nStaff is courteous, professional, and service is all you'd expect and more at such a dining establishment.\nThe atmosphere is classy meets sultry. Bring a date, a colleague, or some friends. They'll thank you!"
  ]
 },
 {
  "name": "Watercourse Foods",
  "address": "837 E 17th Ave, Denver, CO 80203, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6a6cea4-932f-11ea-b74a-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "food",
   "food",
   "food",
   "drink"
  ],
  "link": "https://maps.google.com/?cid=1111322747512873617",
  "source": "GoogleMaps",
  "reviews": [
   "One of the best restaurants in Denver. Vegan/vegetarian restaurant with plant based foods. Denver needs more restaurants like this that provide healthy, tasty, plant-based food. Thank you for creating a restaurant for vegans, vegetarians, plant-based eaters, health conscious consumers, and those looking to just eat really good food. Thank you! It is appreciated",
   "This place is amazing. Coming from Boulder, I thought I we were pretty lucky to have the vegan options that we have, but this was a whole other level of amazing. I was completely blown away by Justin and Andrew’s service behind the bar, and coming from being a bartender for almost 10 years, I was so happy to see that there are people that not only work hard, but get to know their guests. Andrew was amazing to suggest things to do during our day in Denver and Justin shared travel experience ideas with us. Thank you so much for the great experience and having such great members on your staff! Great food and so many wonderful options!",
   "Every vegan friend who's been to Denver told me to visit Watercourse Foods while here. They nailed it! Even my omnivore coworker absolutely flipped over the excellent food, drinks, staff and atmosphere here. He was even telling other folks about it the following day. It's truly that great. Not one single weakness here or at City O' City either (same owners, also top-notch in every way), just incredible vegan food done wonderfully well!",
   "You guys made our day today. It’s been a crazy month and you proved food can make everything better.  Thank you very much.",
   "First time we tried a Beet Latte and now we are hooked. A yummy healthy alternative for a drink to warm up a chilly evening. The beet latte also distracted us from the long wait (only downside) as this place was packed (and rightfully so).  The Beet Salad was scrumptious, we enjoyed every bite. But the showstopper for us was the Tamarind Street Noodle entree. We almost ordered a second plate just to take home for later. The Blueberry Chai Cheesecake ended on a nice note. Not too sweet and creamy even though 100% vegan. Love!"
  ]
 },
 {
  "name": "Mercantile Dining and Provision",
  "address": "1701 Wynkoop St #155, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d6f3411a-932f-11ea-bef6-14b31f159f22.png",
  "tags": [
   "eat",
   "creative",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14260686690125886110",
  "source": "GoogleMaps",
  "reviews": [
   "Popped in for a breakfast and coffee. My entire party was able to find seating (party of 7) and the counter service was simple to use.\n\nThe real star of the show is the owner (I think -- she might have also been the floor manager), but she made my morning. I ordered a sticky bun and it came to cold. She immediately noticed and told me to hold on. She returned shortly, asked me to close my eyes and breathe deeply. Suddenly, my senses were willed with warm caramel scent and I open my eyes to see my sticky bun warmed and waiting for me. \n\nWhat a great eye she had for customer satisfaction!  (I was going to eat it cold -- you can't keep me from pastries, but she made it an amazing experience)\n\nMy party had traditional breakfasts and everyone seemed to enjoy.",
   "An amazing dining experience!\n\nMy brother (a local) recommended this spot noting that it had received the James Beard award in the previous year.\n\nI was sold, but I wasn't sure how to dress  as I did not want to go out to a place that was too formal.\n\nMercantile is casual at the bar and closer to business attire at the tables.\n\nThe Menu did not disappoint as everything sounded great.  \nI went with the duck:Tender with a perfect assortment of sauces and sides to accompany it.\n\nThe staff was friendly and it was enjoyable being able to watch the kitchen staff.\n\nIt is good enough for a special anniversary but priced to make it a weekly outing.\n\n5 stars to this restaurant. I am looking forward to trying their partner restaurant",
   "Fantastic! We went for lunch and will definitely be back for dinner. Even the gluten-free bread was excellent. The spare ribs was juicy and flavorful. We had 6 (and some very restrictive diets) and everyone was happy.  Love the bustle of having the market, cafe, and restaurant in one spot.",
   "I enjoy service and I really like a restaurant the prides itself on providing the best. Mercantile numbers among the greats for this.\nAttention to every detail. A complete immersion in a world where people care about your dining experience. It rarely gets better than this.\nThe food. I don't even know how to adequately compliment it. The foie dish I had was so good I wanted to cry.\nI love their approach to modern American cuisine and their desire to provide it in the most creative way imaginable.\nIf you love good food accompanied by phenomenal service, you must try Mercantile.",
   "This place is so good!! The service was amazing and the atmosphere was relaxing. Very easy to enjoy yourself at this restaurant - even as a single diner as I was this evening. Will definitely be coming back if I ever come back to Denver either on business or personal trip!"
  ]
 },
 {
  "name": "Table 6",
  "address": "609 Corona St, Denver, CO 80218, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d741d680-932f-11ea-b4c5-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18345920828713295260",
  "source": "GoogleMaps",
  "reviews": [
   "This is a cozy yet spacious restaurant with a unique and a thoughtful menu.  The vegetables were in season and fresh, the bread with sea salt and pepper butter is delicious, and there were both meat and vegetarian dinner options.  I really like how customers can see the chefs working in the kitchen, and how our server took the time to explain the different menu items.  There is an expansive wine and beer list as well.  Overall, we enjoyed our meal very much!",
   "This place is wonderful. Too many great things to say but the food is fabulous, they have an excellent wine selection, the atmosphere is cozy and inviting, and the service is great. Naomi did an awesome job and was very pleasant to dine with. Will certainly be coming back!",
   "This was my first time trying this restaurant and I was referred there by one of it's chefs... I  thought that everything was great from the appetizer to the main entree and the wine pairing... Amazing experience...  (Mike was awsome...)",
   "I have been coming here for many many years and seen changes which have never been bad. The food is always amazing and I love and hate the seasonal menus. All of the food is always amazing but savor it because you will more than likely never have it available again because of the menu changes, which isn't a bad thing :) Atmosphere is amazing especially when you can watch the chefs which is what this environment is. I'll keep going here for many more years to come!",
   "We came for brunch. It was nothing short of amazing. First things first, Tommy (our server) was fantastic. The first thing he did after welcoming us was bring us 2 glasses of sparkling wine to wish us a happy anniversary. While we awaited our food he also brought us these amazing cookies (maybe almond). The food was also extremely good. We got to sit outside since the weather was gorgeous and sunny. The French toast, bacon, and eggs are notable from the menu and are delicious. We were also given this amazing peanut butter and chocolate dessert. The chocolate oozes out of these small dough balls dressed in powdered sugar with some kind of peanut butter garnish. It was awesome. Thanks Tommy."
  ]
 },
 {
  "name": "Avelina",
  "address": "1550 17th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d7882e9e-932f-11ea-a2c6-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "food",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=7414395531377873495",
  "source": "GoogleMaps",
  "reviews": [
   "We went for restaurant week. Good food, boyfriend's pork was way salty unfortunately. Their flat iron ribeye was delicious. Old fashion was alright.  Nice atmosphere though!",
   "We came for Sunday brunch in December and I was surprised how good the food was. The meals were substantial but very well balanced and delicious. We went for bottomless and they were very generous! The Bloody Mary bar was amazing! If you are looking for a good brunch place you have to try here!",
   "After some reservation woes elsewhere we were able to find this Valentine's Day reservation only a week in advance. We're glad it happened the way it did, because it was perfect! The atmosphere is good, the service is good and the food was excellent. I was way overdue for perfectly cooked tuna, and the flavors in this dish were incredible. We also had Lamb shoulder and Osso Bucco and both were expertly done. Well be back, even if just to sit at the bar for some perfect drinks. Thanks!",
   "Honestly a great meal. \n\nThe pate could use seasoning and needs to cook slower to not be grainy. \n\nThe anglotti were stellar",
   "Was able to book the restaurant the same day for two of us and it was excellent! We started with both the meat and cheese platters and they were outstanding! Better than any place I have been to. They were large enough we regretted ordering dinner and the waiter was so kind and was able to cancel one of our orders and so we just shared our fish dish which was also delicious. Highly recommend this restaurant. The ambiance is also great."
  ]
 },
 {
  "name": "Tacos Tequila Whiskey",
  "address": "1514 York St, Denver, CO 80206, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d7d8e6ec-932f-11ea-bb10-14b31f159f22.png",
  "tags": [
   "walk",
   "field",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=14006398658531425455",
  "source": "GoogleMaps",
  "reviews": [
   "Fire flames!! This place is legit, loves the atmosphere upstairs in the deck. Great place to hit before a Rockies game and walk or scooter over to the field. Check out happy hour! Great deals and food is even better. You won’t be let down. Recommend the hit salsa on the tacos and shots! Enjoy",
   "Great little spot for drinks and tacos. Parking can be difficult because of the area so be mindful. They have a nice variety of taco flavors and even offer veggie options.",
   "I really like it here. The staff is friendly, it feels cozy, the drinks are on point and the food is delicious. They have a lot of solid taco options, i have my favorites but i do try to order whatever special taco they have to branch out flavor wise. We love the salsas they have and we wish we could buy them by the bottle.",
   "Absolutely delicious! Hongos (mushroom) tacos were surprisingly amazing! Lengua (cow tongue) tacos were simply mouth watering, along with everything else these two stars made this meal unforgettable. Definitely worth every bite, not to mention the drinks! Come thirsty, my friends.",
   "This is my special occasion taco place, mainly because if wasn't \"special occasion\" I'd be there everyday. The staff is so energetic and funny, they really make you feel like your eating in their house. The tacos are out of this world dude. Love everything, cant wait till my next \"special occasion\" maybe I'll make up some holiday just to go back sooner!"
  ]
 },
 {
  "name": "Izakaya Den",
  "address": "1487A S Pearl St, Denver, CO 80210, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d81e7b8a-932f-11ea-8326-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walking",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12295134960868459754",
  "source": "GoogleMaps",
  "reviews": [
   "This place is absolutely our favorite go to for sushi in Colorado.    The atmosphere and vibe is very hip and the food is always fresh and delicious.     The only thing that could make this better is if we lived closer so we could come more often.     The neighborhood is a gym and if you go early, you can spend some time walking around in some of the cute boutiques around the area.",
   "I will absolutely come back here again. Just the architecture alone made the restaurant come alive. An open sushi table to watch the chefs create their masterpieces, a great selection of rare whiskeys, a saké selection of unmatched variety and quality, all perfect reasons to go. The entire restaurant transforms once you get to the upper level. So open!",
   "Best sushi in Denver hands down! Incredible food and unparalleled service! The location is very nice and so warm and welcoming while broadcasting a fresh modern vibe. You want to impress your date? Take them here!",
   "Excellent food. I love this place. Izakaya is better than many highly rated places I've tried in New York City, San Francisco, Los Angeles, Seattle and Vancouver. The freshest of ingredients expertly prepared. And the atmosphere of the restaurant is nice, especially sitting upstairs on a warm day with the roof opened up.",
   "First time visit, and it was as perfect as I could have imagined. The quality of the sashimi is best I have experienced yet in Denver, and some of the best outside of Japan. The staff are very attentive, informative and polite. The interior of the building is beautiful and sets the perfect atmosphere for an Izakaya in the US. We will be certainly going back, and this has become on our list of must go hangouts."
  ]
 },
 {
  "name": "Sam's No. 3",
  "address": "1500 Curtis Street, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d87415f4-932f-11ea-b2e5-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=15256724634413373141",
  "source": "GoogleMaps",
  "reviews": [
   "I can't describe in words how amazing this place is. Before I get into other details, huge shout out to our server Tyson! He's an amazing server. Super friendly, very quick, and probably the best server I've had anywhere in the world I've been to. I hope his employers know how great he is!\n\nNow for other details- we were supposed to be on a 25 minute wait, but we were seated much sooner than that. It was 2pm on a Thursday and I can see why there was a wait at such an odd time of day. The food is spectacular and the servings are huge. The mimosas have half a bottle of champagne in them! The green chili sauce on the breakfast burritos is to die for. The whole menu looked so good, so it was really hard to decide what to order. If we weren't traveling, I'd probably be a daily customer here. Do yourself a favor and check this place out.",
   "This place is awesome. Servers are excellent. The food was great. Had the buffalo breakfast burrito. The breakfast burritos you can probably split between two people. Will definitely have to come back for lunch or dinner cause they’re menu has a lot of great options. Must stop!",
   "I dropped into Sam’s hoping for a quick lunch and it was fantastic. Despite the lunch rush I was able to find an open spot at the counter and I was waited on right away. My 2 chili dogs were tasty and my fries crisp and hot. My drinks were refilled without having to ask for it which is always a plus when it comes to good service. I’d love to come back and try more of the many items in the menu.",
   "The menu goes on forever here.   My group of five all had burgers and everyone was happy.  My California Burger was excellent and they weren't stingy with any of the toppings. I could only eat half my burger it was so large.  I can also recommend the onion rings.  Two of my colleagues had the Mac and cheese.  Both said it was super cheesey but lacked flavor.  Neither even ate half.  The vegetarian in the group liked the veggie burger with a lettuce wrap.  Happy dining!",
   "Nice spot with friendly staff. Prompt service, both the server and food. I had the fried chicken breast sandwich with mashed potatoes while the wife had the All American cheeseburger and fries; both were tasty. Comprehensive menu where you'll likely find something you're in the mood for. Would definitely recommend."
  ]
 },
 {
  "name": "Tocabe, An American Indian Eatery",
  "address": "3536 W 44th Ave, Denver, CO 80211, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d8c93bae-932f-11ea-92cd-14b31f159f22.png",
  "tags": [
   "delicious",
   "unique",
   "family",
   "food",
   "delicious",
   "organized",
   "eat",
   "delicious",
   "unique",
   "history"
  ],
  "link": "https://maps.google.com/?cid=4439379120960103375",
  "source": "GoogleMaps",
  "reviews": [
   "First time eating here and it was delicious!  My lunch companion is a carnivore and I'm a vegetarian, yet there were plentiful options for both of us. (It's very vegan friendly too.) My friend got the fry bread plate and absolutely loved it. He felt the portion was kind of small for the money, but loved the taste and flavors. I got the bowl and found my portion size much better.  We both agree this is definitely a place we'll return regularly!",
   "The food here is absolutely fantastic to say the least! This place is a local place that serves mouth watering authentic foreign food that everyone in Denver Colorado needs to immediately try! There are so many options on the menu to choose from that you never truly run out of options, not to mention all the food is always fresh and unique (in a great way). The interior of the place is also very clean as well as neatly organized by the staff there, it made it much more comfortable to be inside of compared to other places that don’t keep it clean and ruin the dining experience! Prices are amazing considering the quality of the food is much better compared to other places within the local area! The location of this place is also really simple to find and there are always places to find a parking spot nearby which is very nice! The service from the staff is also far better than most places within the city, they are very kind and friendly and will help you make sure that you order something that you will like to eat. Overall I would not only give the food a 10/10 but I would give the inside, the staff, and everything else inside of the store a 10/10, if you have not been here already and live within the nearby area I highly recommend stopping by and trying out their delicious food you will not regret it! I will most certainly be recommending this place to all of my friends and family so they can have a fine dining experience as well!",
   "This was delicious. We arrived just before the lunch rush and got to deliberate a little over what to get. We ended up with a Indian Taco and Vegetarian bowl. I loved that I could custom add the ingredients and everything tasted great. \n\nIt's an order at the counter spot and find your seat from the available ones. It was clean and had an overall chill vibe.",
   "This was our first time here and we will be back. The staff was good about explaining things and we had great Indian tacos. I had a ground Bison taco. It had black beans, squash, lettuce, cheese and sour cream. I think I’m forgetting something but it was so tasty with so many flavors and textures. There are many different combinations that are possible. Yummy!",
   "Growing up in Texas and having a long history of smoking meats I was thrilled to see bison ribs on the menu.  The rub and smoke was perfect and the portions were very generous! The elderberry dressing on my salad was unique and perfectly balanced.  Wash your hands, put aside your fears and go try this amazingly worthwhile place!"
  ]
 },
 {
  "name": "Beast + Bottle",
  "address": "719 E 17th Ave, Denver, CO 80203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d91d27b0-932f-11ea-a19a-14b31f159f22.png",
  "tags": [
   "food",
   "food",
   "drink",
   "food",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6247774310624457348",
  "source": "GoogleMaps",
  "reviews": [
   "This place is very good both in food and atmosphere.  They have a very good lamb pasta which has almost stew like qualities.  The wine recommended pair well.  Staff were friendly and this place has a nice neighborhood atmosphere.  The desserts were also worth a taste or two.  It’s worth a visit.",
   "Experienced for the first time during restaurant week. They have a curious and experimental kitchen staff who create a large variety of both vegetarian and meat plates. Staff was friendly and attentive. Quaint atmosphere perfect for date night.",
   "I've always enjoyed this venue. It's cozy, romantic, elegant and quaint. The idea of utilizing everything in their butchering of an animal really appeals to me. The whole conscientious philosophy is so appreciated.\nGreat food, service and an educated approach wins me over!",
   "The food was really good. The Brown Betty waffle is just as good as everyone says. We were asked to move from our table to the bar because the next reservation was there. We still had drinks and coffee and hadn’t been there that long. It was a first. But they gave us a drink. Bartender was super friendly.",
   "Excellent food drinks and service.  Brunch was great and relaxing.  Breakfast sandwich on a homemade biscuit, Cacio E Pepe omelette...really good....sticky bun a must try.  Dimmi Shelter excellent drink. Friendly and attentive service. Will visit again when in Denver."
  ]
 },
 {
  "name": "Snooze an A.M. Eatery",
  "address": "1701 Wynkoop St #150, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d9630a6e-932f-11ea-bf9b-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "eat",
   "food",
   "food",
   "free",
   "walk",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2056608006063087569",
  "source": "GoogleMaps",
  "reviews": [
   "I have always wanted to eat here, but the wait is always so long, I have always avoided it. On this day, we were dropping off family early at Union Station, so it worked out well for us to give it a try. I would describe the food as breakfast food to indulge on. You won't get plain pancakes or muffins here, but it's a wonderful place to eat at every now and again. They have lots of options of eggs and pancakes, and they even have boozy coffee and breakfast drinks. I enjoyed the cherries jubilee pancake, which was delicious. It wasn't even as sweet as I expected it to be, so it was perfect for me. Others in our party had egg plates, porridge, and French toast, which they all said they enjoyed. The staff was friendly and helpful too. I wouldn't come here to eat all the time, but it's definitely a fun place to go on occasion.",
   "The food and service was phenomenal. Definitely call ahead to get a place in line during the mornings because it can be up to an hour wait to get a table. We called ahead and they got us a table within 20 minutes after arriving. Their servers are very polite and prompt and even on a busy day, they got the food out to us in about 15 minutes. Snooze for sure needs to be on your brunch list!",
   "Without doubt, the best-tasting healthy meal ever! You are likely to encounter a wait when you get there; it's worth it! And DO listen to the recommendations of the wait staff (you'll still be able to customize things your way). Free coffee helps the wait go by faster. I want to go back already!",
   "Very good food their drinks are amazing. We had great service. this location is very busy you can expect a wait on the weekends. But Union station is nice to walk around and tattered cover is right across the hallway from the restaurant. they send you a text message when your table is ready so you can go exploring while you wait which is a very nice option. I highly recommend this restaurant.",
   "The pancake flight!  Perfect option for people like me who can't decide on which pancake to try.  (Hint: they're all great!)\n\nThis is my first time visiting the city.  There was a small, but reasonable wait.  (And it was worth it.)  The service was great, and so was the food."
  ]
 },
 {
  "name": "EDGE Restaurant & Bar",
  "address": "1111 14th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d9aa73da-932f-11ea-862b-14b31f159f22.png",
  "tags": [
   "drink",
   "knowledgeable",
   "free",
   "food",
   "delicious",
   "delicious",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3207931376457819495",
  "source": "GoogleMaps",
  "reviews": [
   "I went here on my anniversary with my boyfriend. The service is amazing, I really like the waiter. He was very professional, funny, and knowledgeable on what alcohol I should get, since I don't drink alcohol often. The plating is very minimalist and clean (the filet mignon), but the flavor is bland for my dish (salmon with curry). When we paid our bill, the waiter gave us chocolate cows for free. That really made our night!  Overall, I really like the service and the atmosphere, but the flavor of the food could be improve.",
   "Stayed in the 4 seasons for Valentine’s Day, wanted to make the night easy so we made reservations at edge because it was in the hotel. Everything was great! Our waiter was great, friendly but not too friendly, he recommended things purposefully and actually listened to our questions. All and all a great night!",
   "Scott was an amazing server. We arrived after a 7 hour drive and chose Edge for the bison burger. When we arrived, we discovered that they were only serving brunch and that the bison burger wasn't on the menu. Scott offered to ask the chef did he could make it anyway and the chef agreed!!!!! It was DELICIOUS. My husband said he'd drive to Denver just for this burger. I can't thank Scott enough for being so accommodating. He even recommended other adventures for us :)",
   "We had just arrived in Denver late. We were tired and hungry so we opted to stay in the hotel and dine at Edge. It was perfect! We both agreed that this place was great. We loved the restaurant decor. The service was wonderful and the meal was great! We would definitely recommend this restaurant in every way!",
   "Great food and atmosphere.  Appetizers were unique - the hot stone where you cook a small steak wasunique and delicious.  Staff was top notch.  Great dessert - whiskey flavored ice cream.  4 seasons is a beautiful setting.  Great spot to dine downtown."
  ]
 },
 {
  "name": "Hop Alley",
  "address": "3500 Larimer St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/d9f7346e-932f-11ea-90f2-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "food",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11264717927871361436",
  "source": "GoogleMaps",
  "reviews": [
   "My man and I came here for our early \"service industry\" Valentine's day since we'd be working all weekend. \n\nThis restaurant was his old stomping ground, so he guided me through the menu with ease and confidence, and put a beautiful meal in front of us. \n\nWe had duck rolls, the whole fish, the cold tofu dish, and about 4 cocktails and some wine. \n\nEverything was perfect. The lady bartenders were absolutely on point, friendly and knowledgeable. Loved them.\n\nOverall, a small, cozy restaurant that might be on a small wait, but is worth it. Glad to have checked this place off my list ✔️",
   "Very hip and friendly atmosphere and the food execution was 5/5!  The dumplings were perfection, spicy but as good as it gets.  I don’t usually go for tofu but I would get that every time I visit, excellent sauce.  \n\nIf you can’t handle spicy, this isn’t the place for you (I’m sure you can find something on the menu though, it’s all good).",
   "Went right when they opened and there was a long line out the door. A few folks before us were told that the next available table would be around 9pm, so we were fully prepared to go somewhere else. Luckily, we were a party of 3, and they had space to seat us immediately at the end of a communal table!\n\nWe ordered a bunch of dishes, and while everything was tasty, nothing really jumped out as super interesting or unique. Overall, I think it's a decent upscale restaurant with good Chinese food, but I personally don't think it's necessarily worth the price or the hype. I would definitely recommend getting a reservation if you want to try it out though!",
   "My friends and I ordered takeout for a celebratory dinner. The food was ready fast and pickup was easy! They brought the food out to the car so it was super simple. The food was hot even after we got home, 20 min. The duck rolls were amazing! The La Zi Ja is also a must have. I will totally be going back!",
   "I had a terrific meal with friends here last night. The food and service exceeded all expectations. I like to ask my servers for suggestions, and Risa offered several great options. I recommend the duck, grilled octopus, and tomahawk steak. Their cocktails were also magnificent. Risa and Samantha provided outstanding service. Thank you to both of you!"
  ]
 },
 {
  "name": "Bar Dough",
  "address": "2227 W 32nd Ave, Denver, CO 80211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/da3caf50-932f-11ea-9c18-14b31f159f22.png",
  "tags": [
   "active",
   "delicious",
   "food",
   "family",
   "free"
  ],
  "link": "https://maps.google.com/?cid=3132414380163033084",
  "source": "GoogleMaps",
  "reviews": [
   "Get a pizza. Just do it. Some of the best pizza in Denver. Their pasta is incredible too. Service here is unparalleled as well. The attention to detail deserves notice from all other nearby restaurants.",
   "Arrived solo around 6:15 pm on a sunny Monday evening and sat at the bar. The place was lively, with an active dinner crowd of large groups (6+), friends and what looked like colleagues.\n\nI ordered a Tuscan wine ($18, 9 ounces) and one of their pizzas with sausage ($17). The wine was a hit, definitely a bit upscale and just right. The pizza was par for course as well, well balanced and appropriate against expectations.\n\nService was good, attentive while multitasking vigorously. They had some odd black and white cartoon dog series on TV, where they were playing soccer and driving. The wine definitely helped make that more interesting than odd.\n\nThe counter tops at the bar were nice, and there was plenty of space and options for an even larger crowd. The outdoor patio was nice as well, more suitable for groups of 3 or 4.\n\nI would recommend this place for medium-sized groups, informal business meals and friends looking for a lively environment.",
   "Cute spot for brunch. Excellent service and tasty food. The bacon was delicious and quite possibly my favorite bite of food of the day. The fried chicken was good. And of course we had to try a fancy toast. I enjoyed my aperol spritz as it was a perfect compliment to my brunch.",
   "Fantastic place! Great to take your friends or family members. The staff are humble and attentive that make you feel like a king. I recommend sitting at the chefs table to get a dinner and a show.",
   "The pizza was phenomenal. Got gluten free crust with no sausage and beyond good. Breast pizza in Denver"
  ]
 },
 {
  "name": "Buckhorn Exchange Restaurant",
  "address": "1000 Osage St, Denver, CO 80204, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/da821cca-932f-11ea-a69e-14b31f159f22.png",
  "tags": [
   "unique",
   "eat",
   "unique",
   "food",
   "delicious",
   "cheap",
   "eat",
   "kids",
   "family",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7262769948373021552",
  "source": "GoogleMaps",
  "reviews": [
   "Been a few times, and it's amazing every time!! The wild game they serve is divine, and the staff really seems to care about providing the best experience possible. One time, my ex and I ended up there after getting on the wrong light rail train after a Broncos game, and hung out there for a few drinks and an appetizer. The bartender was super friendly and fun, and gave us plenty of attention even though it was pretty busy as always! If you have guests coming from out of town and have a little money to spare, I highly recommend taking them to the Buckhorn Exchange for a truly unique experience.",
   "Buckhorn Exchange is the optimal place to eat a lot of different types of game meat, including elk and rattlesnake. However, their signature dish has to be the Rocky Mountain Oysters which aren't that amazing to be honest. The portion sizes for them are fair but they don't taste too good. Service, however, was fast and very friendly. The interior decor was also really nice, and this is a good place for exotic meat lovers.",
   "Yes, its pricey but you're paying for the experience as well as the food.  We brought visitors from Spain and they were delighted.  We started with the rattlesnake queso which was pretty good.   I had the elk and it was delicious.  They ate bison prime rib and elk and were pleased. \nThe place itself is very entertaining.  Quite unique.\nWe had a very good experience service wise.\nAgain, it is not cheap to eat here and it is not the best cuisine I have ever experienced but it was a very fun night.  The Spaniards will have a good story to tell when they go home.",
   "My family and I came in from San Antonio and heard about this place...it was definitely an experience. We arrived and was told the wait was an hour long... I wasn't sure how the night would turn out after that... It was amazing! We waited upstairs in the bar area where our kids circled the back room.. The delightful bar service made our wait seem like minutes instead of hours. It was an enjoyable meal as well. Waitress was amazing as well. There is definitely a reason why they are still open after so long. Coming back here for sure!",
   "Absolutely delicious food and outstanding service.  I knew I wanted to try the buffalo and the quail and they put together a combination plate for me. Prices are reasonable.  I highly recommend this restaurant.  So good!"
  ]
 },
 {
  "name": "Hops & Pie/Berkeley Donuts",
  "address": "3920 Tennyson St, Denver, CO 80212, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dacac558-932f-11ea-9398-14b31f159f22.png",
  "tags": [
   "tasting",
   "food",
   "kids",
   "eat",
   "food",
   "unique"
  ],
  "link": "https://maps.google.com/?cid=3693446934527791562",
  "source": "GoogleMaps",
  "reviews": [
   "Wow! This place is a gem! Amazing tasting pizza. Cold beer on tap. A wide selection of their menu of both food and drinks. \n\nWe went as a party of four and waited about 30 minutes. It was well worth the wait. The restaurant is tiny, so expect longer waits when they are busy. \n\nI saw they had Rafe beer on the menu. I finally got to try Pliny the Elder. I'm not a fan of IPA's, but it was paletteable. \n\nService was great. \n\nI will be back",
   "Everyone is so nice here and they made our family’s day!  I went in for donuts on Sunday morning with my three kids (ages 3,5,&8). Needless to say we were slow to get out of the house and were a little late for the donut crowd. Although they were sold out the staff was able to find a donut for our crew to share. It was a small gesture that made us feel so special. Thank you hops & pie!",
   "Service was stellar. Beer selection is great. The thin crust was crispy and buttery. The house pesto was awesome on the slice of the day! The only thing that didn't make it a 5 star pizza joint was the pepperoni. We agreed they are equivalent to the pepperonis found on frozen Red Baron!!",
   "Ordered pizza and salad. Have been to restaurant multiple times and it was great. However when we tried to order it was disastrous. Good thing we had some cans of tuna. This  place is great for eat in but blows for delivery. 3 hours later and STILL waiting for food.",
   "Good customer service,  busy ambience! Unique beers, pizza crust was fresh and crispy all though I was expecting more smoke flavor on my brisket and chicken."
  ]
 },
 {
  "name": "Bastien's Restaurant",
  "address": "3503 E Colfax Ave, Denver, CO 80206, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/db161b06-932f-11ea-b5ff-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "family"
  ],
  "link": "https://maps.google.com/?cid=7112072793284660039",
  "source": "GoogleMaps",
  "reviews": [
   "Steaks, salads and desserts were delicious! Drinks were good. We had 8 at our table for a bday party (cheese cake with a candle was nice surprise).  Service was good until the check came. Then no one returned to take our money for 20-25 minutes. When the manager finally came and cashed us out, she was pushy to get us out.  Not our fault your person didn't pick up the credit card (1), it was ready immediately after bringing the bill.\nOverall,  good experience.",
   "We love this place. Old school cool all the way, from the building itself, to the professional yet courteous service. And the food. The sugar steak is a marvel, a charred exterior with just enough spice to accent the meat. The edible flowers on the plate take me back to the 80s, unfortunately, so do the steam table veggies, a real afterthought, but that's not why you go there. Last time had a couple minor problems, my steak was just barely over done, and everything needed a hint of salt. But trust me, we'll be back.",
   "Great steak place!!!! I visited on vacation and saw this restaurant came up highly recommend on Google Maps and I see why! Very high quality meal and not super expensive. If I’m back in Denver I’ll definitely visit again.",
   "The service and the food were just wonderful.   Bastions is kind of a classic standard place because it's so popular,  but it's anything but run of the mill.  Very high degree of personal attention and service.  The desserts we had were absolutely off the charts.  I had the sizzling apple pie with ice cream and it was worth the price of the extra calories,  lol!  If you're on this part of Colfax,  and want a truly delightful time with friends and great food, DO NOT MISS THIS PLACE!",
   "Went to this restaurant for first time on Valentine's Day.  It was delicious.  I was surprised they don't offer a baked potato as a side dish option.  Only two kinds of mashed potatoes.  They were delicious, but I am a steak, baked potato and side salad kind of girl.  I don't remember them offering any kind of steak sauce.  The steak was delicious.  We sat upstairs.  I remember the hostess was kind of trying to talk us out of going upstairs, saying there was no restroom and all you can see is the bottom floor. I found sitting upstairs nice.  It's a smaller venue, cozy.  Our waitress was really nice and kept our drinks filled.  The menu is a little on the spendy side.  There is plenty of parking in the back. Would recommend reservations.  As far as supporting local family owned restaurants, this place is a nice for a good steak."
  ]
 },
 {
  "name": "Safta Restaurant",
  "address": "3330 Brighton Blvd #201, Denver, CO 80216, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/db73d16e-932f-11ea-9971-14b31f159f22.png",
  "tags": [
   "eat",
   "food",
   "delicious",
   "food",
   "walk",
   "art",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16157981528135005707",
  "source": "GoogleMaps",
  "reviews": [
   "Was sat at the bar due to no reservation. Sexton was our amazing bartender/server. Offered some of his favorite items and they were great. Overall great first experience, would definitely recommend, definitely worth the try if you're looking for something out of your comfort zone. Spread for 2(my wife and I). I can eat and I got stuffed. Can't wait to try some of the other dishes.",
   "Excellent food! Went here for my birthday dinner last night. My friends and I were really impressed by the food and the service. You HAVE to get the hummus. They give you unlimited pita bread too. The waitress even gave me some to go!! They also confirmed my reservation several times (phone and text messages), which was encouraging with everything going on these days. I’m definitely going back!!",
   "This is by far one of my favorite restaurants in Denver right now.\nDelicious drinks, nice ambiance, great friendly staff and the food! Oh my God the food... Literally everything on the menu is amazing, I will find myself daydreaming about it. The fresh pita that they just keep coming is delicious, plenty of vegetarian options. Every person I bring here is blown away.",
   "Fantastic sharing restaurant! We stuck to hummus, mini, and small plates. Everything was on point. The eggplant was my favorite. The drinks were tasty and the service was good. It was a lovely atmosphere. Definitely a bit pricy, but perfect for a double date or small group.",
   "Five star restaurant! Amazing food and drinks. Set in a fun atmosphere, you can walk around to shop or look at some art while you wait. The mushroom hummus is the best hummus I have ever had. A little steep in prices, but having lots of small plates to eat from fill you up quickly. The waitress was kind enough to mark up a menu to indicate all the vegan options. Bonus points for the killer mint tea!"
  ]
 },
 {
  "name": "ChoLon",
  "address": "1555 Blake St #101, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dbcf10e6-932f-11ea-a42c-14b31f159f22.png",
  "tags": [
   "delicious",
   "family",
   "food",
   "delicious",
   "unique",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=11791511471180185472",
  "source": "GoogleMaps",
  "reviews": [
   "Definitely good food. I highly recommend going there. The food comes out like family style and it's definitely big enough to share. Duncan, our waiter, was fantastic. He shared his recommendations which we personally took in consideration and everything came out absolutely delicious and in a timely manner. They can make things vegetarian as long as you ask. The service here is phenomenal; everyone is very attentive so you're never sitting there with dirty plates or empty dishes. It's the simple things and details that I really appreciated. As far as the dishes go, here's what I recommend: everything. But seriously if I had to pick, the Kaya toast is fantastic as well as the Malaysian noodles.",
   "Delicious for lunch and dinner. The soup dumplings are perfect, Brussels are perfectly cooked and the kefir leaves add a great lemony flavor. Enjoy our meals each time. Definitely recommend sitting at the chef's counter.",
   "We went on a Thursday evening at dinner time and had no issues with getting a table. I called and they said no dress code and no reservations required. I was visiting Denver and had heard amazing things about the food here so I took my friends here to celebrate / close out my week of visiting with them. So glad we did because it is rare that I've been so blown away by unique but so flavorful dishes!! And the presentation!! My favorites were the soup dumplings, the toast (I was NOT expecting to like the toast but the coconut wasn't overpowering at all and it was freaking amazing, get it) and the handmade noodle wok dish. The toast came in big chunks that you then dip into a sauce (go all the way to the bottom w/dip), see pic. Then also the lamb dish and sushi..  you know what, all of it was simply phenomenal. Great attentive waitstaff too. I also love how you order it as a table, and share. It was the perfect special meal. Definitely a must in downtown Denver.",
   "A five-star Gem of a restaurant. We receive excellent service from waiter Jennifer. The food was amazing. You definitely want to buy and try the items on the menu that are suggested by the waitstaff. We enjoyed the dumplings the week of beef the lobster crate in the bone marrow rice cake Korean style stir fry. I think this restaurant Rivals and is better than many of the restaurants I've been to in Washington DC. If you are in Denver living there or visiting this is a must do restaurant.",
   "Very good restaurant. Food was fresh and amazing taste. Definitely give this place a try if you are in the area.\n\nUpdate: came back for the dinner menu... Amazing."
  ]
 },
 {
  "name": "Señor Bear",
  "address": "3301 Tejon St, Denver, CO 80211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dc23e814-932f-11ea-9c9f-14b31f159f22.png",
  "tags": [
   "unique",
   "food",
   "creative",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=10316817263243105253",
  "source": "GoogleMaps",
  "reviews": [
   "Came for brunch had the queso to start, by far the best I've ever had! We all tried different brunch entrees and everyone had a unique taste and flavor that was unmatched by any other Latin infused cuisine. Will definitely be coming back for more!",
   "One our favorite spots in Denver. Been twice with my wife for her birthday. Amazing service and the food is top notch.  I highly recommend ordering the picnic basket.  Definitely worth the price. We'll definitely be back again.",
   "Everything was five stars. Had a four course meal and it was just an awesome place.  We've had more expensive meals that were not nearly as good.  The creativity, portions, service all five stars.  Looking forward to coming back more regularly for happy hour.",
   "Trendy restaurant with Latin American fusion cuisine. Very tasty and rather small plates encourage to order more meals. Menu has just been changed to Spring - Summer much lighter. \nPretty busy, earlier booking recommended.",
   "Came here for dinner and fell in love. Served family-style, It's nice for a group of four to be able to order multiple things and try the menu. The cocktails are creative and really good. The Latin/Argentinian menu is delicious, and the staff was very friendly during our visit. The place isn't too terribly big, so on busy times, it might make sense to make a reservation. I highly recommend this restaurant to anyone in the area."
  ]
 },
 {
  "name": "El Taco De Mexico",
  "address": "714 Santa Fe Dr, Denver, CO 80204, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dc6c483e-932f-11ea-87ab-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food",
   "eat",
   "food",
   "delicious",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6121474667943959612",
  "source": "GoogleMaps",
  "reviews": [
   "Authentic Mexican.  We came at noon on a Saturday and the line went out the door but there were two people taking orders to it didn't take long to receive our food. Definitely coming back!!",
   "This place. Let me tell you about this place.... run by the most wonderful women you can imagine that know their stuff. It is mesmerizing to sit at the counter to eat and watch these women make the food. They truly know what they are doing and this place is so good!! It gets pretty busy so the sooner the better. There is not bad option to choose unless you have food allergies and if that is the case just fill up on the beans, those are great as well.",
   "My hopes were high. I felt a little deflated after my visit. Maybe it's my head spent in ABQ but the atmosphere there me off. It's an open kitchen and you sit are a bar that looks into the kitchen.  I guessed to watch them could why you eat. Hard to communicate with a friend at lunch, when your sitting next to them and have to turn your head, take a bite of food and make small talk oh and watch the ladies cook beans.  The figure was alright nothing to really comment on that stands out.  It was good.  Pricey for express type  menu.  The hot chili was not dragon spot hot but mild at best.",
   "Heads up, this place gets super busy around lunchtime but it’s well worth it. Delicious flavorful tacos; get both the onions/cilantro and the salsa on them when they ask. You won’t regret it.",
   "Fast service and delicious food is the game if the game here. Make sure to get a hearty helping of the green chili (best we had all trip, and backed up by local endorsements and awards!) and menudo to warm the soul on a cold day."
  ]
 },
 {
  "name": "Sassafras American Eatery, Highlands",
  "address": "3927 W 32nd Ave, Denver, CO 80212, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dcacd19a-932f-11ea-ae29-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "eat",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=3807100411073780455",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious food, amazing drinks, great staff and now an even better location for the highlands spot. It's WAY bigger and quicker seating. Had a blast!!",
   "Went here for the first time for a Birthday Brunch. The atmosphere was awesome ...I loved it! I wish they took reservations however on the weekends. Be nice if they did Open Table since we had to wait 45 minutes to be seated. This is sure a cozy comfortable space to enjoy a meal. I was expecting the food to really be phenomenal, however I was a little disappointed. The quality of the food was just so-so, along with the drinks (Mimosa/Bloody Mary). The Bloody Mary had so much ice and so much garnish that it was nearly impossible to drink. The taste of it was pretty good though once I dug though all of the stuff in it. When we got our food, the bacon was terribly under-cooked. The server was nice though and brought us some sausage to replace it, however the sausage was so salty it was hard to eat. I will say though that the remainder of the food was pretty good, especially the Breakfast Mac and Cheese which I really enjoyed! The service as well was pretty good!",
   "A wonderful casual breakfast joint in a more residential part of the city. I think I've had better Southern brunch in other cities, but this place is still okay. The building itself is interesting and we really enjoyed the atmosphere.",
   "Definitely one of the best brunch spots in Denver! The po boys are so good and I love the chicken fried egg. Plus all the drinks are amazing!",
   "Simply delicious!! Sassafras is a Denver institution offering up some of the finest Cajun fair you can get. In this town! The staff are cute polite and very patient. Make sure to partake in some of the delicious cocktails they concoct for your enjoyment!"
  ]
 },
 {
  "name": "Kealoha's BBQ",
  "address": "500 16th Street Mall Space 1 (fronting, H&M, Denver, CO 80202, USA",
  "avg_visitor_review": 5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dcfc9fae-932f-11ea-b9e5-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=1017725185512275040",
  "source": "GoogleMaps",
  "reviews": [
   "Absolutely delicious! And super friendly! We almost went somewhere else and came here instead. We are so happy we decided to try something different. Good price. Fresh made. Authentic and fresh ingredients. Noms",
   "What an amazing surprise to find this new street vendor. Downtown Denver sorely lacks culturally authentic cuisines. This was truly refreshing to find. The owner is amazingly friendly and conversational. The food is of high quality and appropriately priced. I definitely recommend Kealoha's BBQ. I will be returning often myself!",
   "This cart is amazing!! Super friendly service, great prices, and the food is incredible!",
   "I’m currently eating their Loco Moco as I write this! Their food is delicious and their service is awesome. We had a larger group with us so it took a few extra minutes, but they provided us with some snacks while we waited. The snack had their Lilikoi sauce, which tastes amazing! We definitely will be coming back for more. We also got some of their pies as well, can’t wait to take a bite! Recommend them for sure!",
   "The bbq ribs and the bbq chicken was delicious! We could barely talk about how good they were due to not wanting to stop eating. The ribs were SO tender all I had to do was pull the meat off the bone with barely any effort. The salad it comes with was also delicious. And the owners are incredibly friendly, like a true Hawaiian experience!!"
  ]
 },
 {
  "name": "Ultreia",
  "address": "1701 Wynkoop St #125, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dd49f1b0-932f-11ea-ba77-14b31f159f22.png",
  "tags": [
   "food",
   "unique",
   "food"
  ],
  "link": "https://maps.google.com/?cid=7746866555532286441",
  "source": "GoogleMaps",
  "reviews": [
   "The chef’s feast was divine. I highly recommend it. It’s the perfect amount for two and it ends up costing less than what you might order off the regular menu to feed two people. This meal was definitely one to remember. Even the house rosé was delightful. I cannot wait to return to this incredible venue and try more of their tapas and desserts.",
   "Excellent food and service! The attention to detail in both the quality of food as well as staff, decor , and ambiance is not to be missed.",
   "Great spot for tasty Spanish tapas with a very attentive staff. Located within the city’s trendy Union Station, there is plenty to choose from with zero guilt due to their small plate sizes. Bring a group or enjoy some tapas with a loved one.",
   "This is a great place in Union Station to grab some tapas and cocktails. They have a patio and an attractive dining room, but guests are pretty casual. The menu has quite a few unique options ranging from small handhelds, to sandwiches, to fork and knife plates. Reading through the menu doesn't give you an idea of just how excellent some of their tapas are. Thankfully I had an awesome server who gave detailed descriptions and recommendations. The goat cheese stuffed dates and fried eggplants are crowd favorites and both very well- balanced, sweet and savory tapas. The cocktails come in very generous portions as well. I'd recommend ordering the chef's choice if you want to explore a variety of things, as it usually includes the most popular tapas at a better price than ordering them individually. All-around, I have nothing but good things to say about Ultreia!",
   "Great service and amazing food.  The portions are just right to share for 2 people. We especially loved the mushrooms on the cedar plank. Will come back here again."
  ]
 },
 {
  "name": "Stoic & Genuine",
  "address": "1701 Wynkoop St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dd989c00-932f-11ea-97f3-14b31f159f22.png",
  "tags": [
   "delicious",
   "knowledgeable",
   "food",
   "food",
   "knowledgeable"
  ],
  "link": "https://maps.google.com/?cid=15552215111276776528",
  "source": "GoogleMaps",
  "reviews": [
   "Went here for dinner with my mom and we both loved it! It's a smaller space but had a great atmosphere. We shared the cod cakes,they were a little on the salty side so if you don't like much salt just ask for them to not add any and they will accommodate your meal to your liking. I also had the scallops with risotto for my meal and they are the best I've tried so far. Can't wait to come back for another nice dinner.",
   "Super fresh seafood. All of the oysters we've tried there have been delicious with very distinct flavors. The staff are extremely knowledgeable and friendly.",
   "The food here is lovingly prepared. Excellent taste delight for your mouth. I wish I lived here so I could try everything on the menu! And let us not forget how wonderful the staff is here. It really makes it a dining experience, not just a meal!",
   "We We’re going out for a team dinner. It was probably one of the best places I’ve been to dinner in Denver Colorado. I highly recommend the food. It is very much a seafood restaurant however everything was just impeccable. Service was perfect and good banter. They were so professional and kept our glasses topped up which is always a plus haha. I will be visiting again when next in town and simply am a big fan.",
   "Swanky, small venue tucked inside Union Station with great atmosphere! We enjoyed some magical cocktails (average price of $15 each)...I especially enjoyed the mulled wine but loved the creativeness of everything on the cocktail menu. Wide variety of oysters, with a knowledgeable wait team to share the differences of each, were delightful. Also sampled the caviar, which was tasty with creme fresh along side.  This would be a fun place to take out-of-town guests or for a romantic evening for two. Cant wait to go back and stay for dinner."
  ]
 },
 {
  "name": "Dio Mio - Handmade Pasta",
  "address": "3264 Larimer St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/ddecd738-932f-11ea-809c-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "delicious",
   "unique",
   "food",
   "delicious",
   "affordable",
   "walk"
  ],
  "link": "https://maps.google.com/?cid=7406562635768083803",
  "source": "GoogleMaps",
  "reviews": [
   "There is something to be said about restaurants that focus on doing one thing extremely well. Dio Mio handmade pasta extremely well. The atmosphere definitely fun with modern music playing and a relaxed dress code for the employees. The food was absolutely perfect and if I had more time in the RiNo district i would have done my best to try the whole menu. Prices are on par with well-executed food service but they do have happy hour specials if you're looking to cut a bit of cost. If you're looking for a great dinner you should add this to your list of restaurants to try.",
   "Definitely enjoyed this restaurant! Fun atmosphere, nice staff, stylish interior, quick service, and delicious food. The pasta dishes my fiancé and I tried had unique and tastefully created seasoning combinations that were unlike any we've had before. The bread served with the meals was delicious and well made. There were easy to access to-go boxes for the customer to box their own meals too.",
   "My husband and I ordered take-out for a quarantine date night in. The handmade spaghetti with red sauce was so fresh with a little spicy kick to it. Our salad was also fresh and delicious with a flavorful balsamic vinaigrette. And the bread!! It was a wonderful meal and very affordable!",
   "I’ve been going here since they first opened and it just keeps getting better every time! I love how the menu is always changes. Simply da BEST 👌🏻",
   "Wow! This place is incredible. Caccio e Pepe is one of the best I’ve ever had. Did I mention you can get a bottle of wine for $20?!? Total Home run spot for a casual date night.\n\nIt’s order at the counter and first come first serve for seating so be on the lookout for a table or diners wrapping up when you walk in."
  ]
 },
 {
  "name": "Racines Restaurant",
  "address": "650 Sherman St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/de2ef422-932f-11ea-a79c-14b31f159f22.png",
  "tags": [
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=6844126862257464433",
  "source": "GoogleMaps",
  "reviews": [
   "Great atmosphere as the building is clean and very spacious. The waitstaff was very friendly and prompt. The food was good but I wouldn't say amazing. I will come back as it's tough to judge on eggs toast and bacon. Large patio that looks to make for enjoyable outdoor setting. Also a very large bar area for meeting your neighbors",
   "Great brunch spot! Racines is known for their impressive Bloody Mary options alongside other classic boozy brunch beverages. If you're not in the mood for brunch, this place is also great for happy hour and dinner. Their menu and their space is expansive but you can expect a cozy atmosphere. Great place for meeting up with friends while nibbling on American-style eats.",
   "Favorite neighborhood restaurant/bar in Denver. Portions are large & I’ve never had a bad meal. The staff are super friendly, attentive & go out of their way! If only there were MORE Racine’s in this world!",
   "Arguably 1 of the BEST PLACES to eat in DTown!  Every time I have been here it has impressed.  Before a concert, just before heading home from vacay, date night, breakfast before adventure in the mile high, whatever, the place rocks from vibe, food, staff, location, valet parking, excellent bar.  The wall behind the bar, is decked out with awards and rightfully so.  Try their unbelievable mile high nachos as an appetizer.  So good, can split with 4 friends and they themselves will invoke a conversation.  I always promote this place.  Haven't been let down for doing so yet.  Enjoy♡",
   "I have gone to Racines for years. Kind of liked the Bannnock location better with its large windows where you could see the night traffic and late hours. We would often go after the theater and have margaritas and nachos. Still it is a favorite place at the location now."
  ]
 },
 {
  "name": "Odyssey Italian Restaurant",
  "address": "603 E 6th Ave, Denver, CO 80203, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/de7b6636-932f-11ea-9e33-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "family",
   "eat",
   "food",
   "food",
   "walking",
   "knowledgeable",
   "food",
   "walking",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3240118002708463064",
  "source": "GoogleMaps",
  "reviews": [
   "We’ve been here one other time and had a delicious dinner, came back again for our anniversary and had an amazing experience. The ambience is very romantic, rose petals on the table, violinist moving around the restraint. We had a semiprivate booth which was perfect. Our server was super attentive, and honest with her recommendation. The food was fantastic and a great wine selection. We especially loved the mussels in wine sauce and my boyfriend really enjoyed the lobster ravioli. I would definitely recommend, especially for a date night or special occasion!",
   "Wow, what an incredible experience we had at Odyssey. As a family, we rarely eat out at Italian Restaurants and chose Odyssey for our Anniversary meal that wrapped up our 10 day road trip through Colorado. I cannot think of a better meal or experience to have culminated such a magical trip. We were able to be seated outdoors on the patio to make our meal even more delightful. The food was outstanding and the service was even better. Highly recommended.",
   "When I moved to Denver, a friend & I were walking by looking specifically to buy bread for sauce we were making at home. We were greeted warmly by the host, then the owner. We spent time talking about my journey to Denver as a transplant, left with bread, a business card & a great memory. I came back the next week with my entire business team of 15. Before I left Denver, I probably had dinner here 10-15 times. Great hospitality, great food, excellent service. I have very fond memories of this place. Make sure you stop in here.",
   "Amazing place,  on point true tastes of Italy and Sicilian food. Staff are always friendly and knowledgeable with amazing personality.  The house turned restaurant is warm and inviting and feels like you're coming home with all the warmth and love that vines with that.  If ever have a chance to meet the now retired original owner/head chef l, you'll fall in love with his sense if humor and charm. Truly one of our favorite places to unwind, relax with great food and awesome people.  Ther inner thing I do recommend is making reservations and if driving add plenty of extra time to find parking down one of the side streets and walking a block or 2.",
   "Amazing place! My wife and I have been coming here for years, and the food is always so delicious and the staff is always super friendly. Got delivery during the quarantine and the food was just as tasty! They even threw in a couple tea candles for home ambiance. Thank you for all you do!"
  ]
 },
 {
  "name": "FNG",
  "address": "3940 W 32nd Ave, Denver, CO 80212, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dec6ec40-932f-11ea-8123-14b31f159f22.png",
  "tags": [
   "drink",
   "music",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "unique",
   "walk",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14779208114037979896",
  "source": "GoogleMaps",
  "reviews": [
   "Great music themed restaurant. The menus are inside album covers.  We met up with friends here on a Tuesday night for a birthday gathering. There were seven of us in the party and they had no issue seating us. While we waited for everyone to show we sat at the bar. We tried a couple of the daily drink concoctions. They were very tasty.  Once seated the group ordered the Funky Hummus and Smothered Tots.  Both were tasty,  the hummus was surprisingly smoky but it was good touch. For the main course Cathy had the Rotisserie Lamb Dip   and absolutely loved it. I had the Colorado Bison Enchiladas and they were also very good. In all nobody at these table had a bad meal or drink. Highly recommended!!",
   "The food was delicious and I really liked the rock and roll decor! My partner and I got the grilled meatloaf and the lamb dip sandwich. Both were had amazing flavor and was a great size for a lunch. We would definitely come back again in the spring and summer to hang out with the windows open.",
   "One of my favorite places in Denver! Amazing atmosphere, friendly staff and delicious food and drinks. If you go for brunch, get the friend chicken and cakes. For lunch/dinner, I love the meatballs, all sliders, the chicken sandwich, and the chicken fried steak. For cocktails, the almost famous is among my favorite drinks ever. Well done to Troy and team",
   "Brunch here is delicious!!! Chicken sandwich is juicy and tasty. They have unique options for brunch and it was tough to choose. Cool space inside. Definitely wanna come back with a group. Great neighborhood area to go for a small walk after, too.",
   "We enjoyed our time at F&G. We got the smothered tots, 2 sliders (the burger and fried chicken) and the Mac & Cheese. All of the food was great and the burger slider convinced me to get the full size burger next time we go. Our server Brittany also did an awesome job. We will be visiting here again."
  ]
 },
 {
  "name": "Il Posto",
  "address": "2601 Larimer St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.3,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df0f18f8-932f-11ea-97cb-14b31f159f22.png",
  "tags": [
   "delicious",
   "tasting",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2924762371771210627",
  "source": "GoogleMaps",
  "reviews": [
   "Delicious!  Really surprised by the mediocre reviews here because we just had the tasting menu and were blown away!  3 people, 5 stunning courses, 15 different dishes for $65 a piece?  Worth every cent.  One of the best tasting menu experiences I have had.  So good.",
   "The food was very disappointing. Lack of flavor in anything - I had to request salt and pepper but still didn't finish any of the courses.  All three courses were also all room temperature. I couldn't tell if the calamari was supposed to be cold and wished my pasta was at least warm. Staff was friendly and it is a cool spot but that's all I can say good about my dining experience here.",
   "Our expectations were high for our takeout during quarantine. I thought this would be a nice birthday dinner. Needless to say none of our expectations were met. We ordered food for 6 and got food enough for probably 3 people. “Cook at home” didn’t come with all ingredients nor the instructions. For as expensive as this food is, it was not worth it in any way. We expected more food and better service for the expense. Very disappointed.",
   "Delicious food and great atmosphere. I loved that I never felt hurried and we were able to sit and enjoy conversation between courses. This was my 3rd restaurant week restaurant this week and was my absolute favorite. Definitely going to be back.",
   "Everything was good and staff is great but nothing was exceptional. However, with its outdoor seating this is a very popular spot."
  ]
 },
 {
  "name": "La Loma",
  "address": "1801 Broadway, Denver, CO 80202, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df5857f6-932f-11ea-9791-14b31f159f22.png",
  "tags": [
   "food",
   "music",
   "food",
   "food",
   "cheap",
   "eat",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=2162593340058981207",
  "source": "GoogleMaps",
  "reviews": [
   "Great food, and ambiance, nice dark low lighting. The music was classic and not too loud. One of my favorite Mexican Restaurants in the country. They have great appetizers and a good variety on their menu. My first time visiting the new location across from the Brown Palace, the prices are a little higher, probably to cover the new location. It’s a busy area downtown, and parking is limited but fortunately they do have valet parking.",
   "Classic mexican restaurant in downtown Denver.   A well known establishment.  Notorious for great food and great dinning.  Highly recommend.",
   "My wife and I had just arrived in Denver and checked into our hotel. This popped up as a recommended place due to location. We were quickly seated. My wife asked for a comparison of the sangria, and the waitress was extremely helpful. The same was excellent. The food came out quickly, and wad also excellent. I definitely would recommend the chicken and spinach quesadilla, and my wife thoroughly enjoyed her flautas. We may have to come back before this trip is over.",
   "Been eating here for 30 plus yrs. Love the food. Not the new bldg, nor prices tho. Not cheap.  No where to park. You have to pay to park and pay to eat. So there's where it's not worth it. \nWhat we do is order out for pick up. One of us goes in and the other drives around. Save quite a bit. Cause no drinks, and no parking. And we only tip $2. So an 80$ bill goes down to about 45$ for 2 of us.",
   "I highly recommend going here. The food was AMAZING. It came out quick. The service was amazing. Wyatt was our server and he was awesome. He was super nice and efficient in making sure all our needs were met. It was a great experience all around."
  ]
 },
 {
  "name": "Brightmarten Restaurant & Bar",
  "address": "730 S University Blvd, Denver, CO 80209, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/df9f245a-932f-11ea-9faf-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=4023296165625798475",
  "source": "GoogleMaps",
  "reviews": [
   "Great experience! My wife and I came for dinner at this small but bright restaurant. We stayed absolutely satisfied with food and service. I had the salmon with mustard sauce and it was delicious. I would highly recommend!",
   "Loved this little restaurant that's tucked away off University across the street from Bonnie Brae in the Belcaro neighborhood. Our server was fantastic. Extremely attentive and didn't hesitate to be detailed when asked for explanations. My steak was cooked to perfection (medium) and I couldn't get enough of the potatoes either. My lady got the chicken and it was season absolutely perfectly. Highly recommend.",
   "Food was good.  I was a tad off by our waitress, by means she was great at her job, but not a friendly smile or upbeat feel.  We will be back again, but with a different server.  Hamburger was way above average and my chicken fried steak meal was above average.   The rest of the staff seemed very friendly and upbeat.  Will be returning with friends for sure.",
   "Awesome burger and breakfast tacos. From Virginia and stopped here on the way to cherry creek mall and I’m glad I did.... AMAZING FOOD AND SERVICE",
   "Overall good restaurant. Nice bright ambiance. The food was good - not overly large portions, but tasty. I had the avacado toast which was light and with good flavor. I added the house hit sauce which livened it up. I would put this in the above average price range with the food on the lower level of that price range. Would I recommend it? Yes. Are there better priced places for brunch? Yes."
  ]
 },
 {
  "name": "The Capital Grille - Curbside Takeout & Delivery",
  "address": "1450 Larimer St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/dfe7ed66-932f-11ea-a471-14b31f159f22.png",
  "tags": [
   "delicious",
   "eat",
   "food",
   "food",
   "food",
   "delicious",
   "free",
   "food",
   "walking"
  ],
  "link": "https://maps.google.com/?cid=4640010295977264146",
  "source": "GoogleMaps",
  "reviews": [
   "I come here quite often and they honestly never seem to disappoint me. The whole place is spotless from top to bottom, it seems like they have someone cleaning the place 24/7 because it is very tidy and well polished up. The whole decor of the restaurant and aura makes you feel extremely comfortable and like you are eating at a top notch restaurant , which indeed you actually are!  The staff are always extremely caring and make sure they get your order right, as well as whatever else you require and also at an extremely high rate of speed which is reliable and very helpful when I don’t have too much time to sit down and eat. The food that comes out of the kitchen is absolutely mouth watering and probably some of the best food that I have not only had in Colorado but in my whole life, no exaggeration the food is really that fresh and delicious! The prices are very fair considering you get some of the BEST food that you have probably ever tasted in your lifetime. But a small quick little  warning it is a little pricey so do not expect a Denny’s or an Olive Garden pricing or quality, this is a high notch top class restaurant that not only will serve you the some of the (if not the) best food that you have ever tasted and at the fairest price as well!  Also do not even get me started on the desserts wow just wow is all I can say, they are perfect! In every way shape or form the desserts are something that I highly recommend you try if you come here! If you live within the nearby area or love spectacular food and have not been to this restaurant then you are highly missing out! This place is memorable to say the least so I highly encourage anyone who has not come here before to give it a shot because I know for a fact you will love everything about this place! If I had to give this restaurant a serious rating out of 1 through 10 it honestly deserves a 10/10 everything about this place screams “we take care of our customers”, this is the place to go if you wish to enjoy food and good company! I can not wait to come here again and fine dine some delicious food as well as be treated almost like royalty by the waiters!",
   "The Capital Grille is certainly elegant, upscale fine dining! The ambiance is regal with classic sophistication! The food was good! I ordered the wedge salad and shrimp cocktail. I wanted more from the salad, I thought it could’ve been elevated a bit more. Everyone else in the party ordered steaks. The steaks looked beautiful and everyone enjoyed them. The service was absolutely top notch given the large party! Only hiccup was receiving my salad before the appetizer. Overall if you’re looking for an upscale evening this is the place to be.",
   "Have not been able to try it for dinner, but for lunch it's a great spot that is the bustling area that is Larimer Square. Bartender was great as he was the one serving us. Cocktails were tasty, and the options for food were abundant. I ended up going with the special but my colleagues stuck to the menu and non of us were wrong. The calimari however was probably the most enjoyable thing we had. Insiders tip, there is valet right in front because parking is a nightmare.",
   "We have dined in at the capital grill a few times and have never been disappointed. But the real reason for leaving this review it due to corona. With the most delightful service and  gratitude we were greeted with free delivery and an absolutely delicious meal WITH mixed drinks!! Everything arrived at our doorstep with a smile! Dirty martini with blue cheese olives, steaks cooked to perfection, beautiful sides, and great service. Will go back again and again! Thank you!!",
   "Felt like I was walking onto the set of House of Cards with the scene set in downtown Washington DC where all all the politicos set up their behind the scenes deals. All dark oak/mahogany booths with low lighting adding to the atmosphere. Service was excellent and we were well looked after by our waitress. Extremely attentive with some excellent suggestions from the wine list and food menu. I had the lamb chops which were cooked to perfection along with a very generous portion of truffle and parmesan fries."
  ]
 },
 {
  "name": "Restaurant Olivia",
  "address": "290 S Downing St, Denver, CO 80209, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e02b1118-932f-11ea-820e-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "drink",
   "food",
   "delicious",
   "family",
   "food",
   "delicious",
   "drink",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12159536493579866484",
  "source": "GoogleMaps",
  "reviews": [
   "I bought a pan of lasagna to go and it came out AWESOME. After slapping it in the oven for an hour, it was sizzling. Such a great comfort food, you guys knocked it out of the park! The ingredients were fresh and delicious. Can’t wait to order more from this restaurant.",
   "The food was perfect. We ordered the Filet Mignon Oscar and the Snapper. Best food my wife and I have had in a very long time. Everything was cooked to perfection. Service was fantastic. Natalie was amazing. She went out of her way to make a drink for my wife they never had on the drink menu. She was always smiling and very polite. We will be back often.",
   "Oh, my goodness!!  I got takeout tonight and was blown away by how good the food was!  The pasta bolognese was delicious!  The lasagna was like anything I've ever had.  And the focaccia bread with whipped butter incredible.  This was my first time ordering from Restaurant Olivia and I will definitely order again.  We noticed an adorable handwritten \"thank you\" note from the owner's daughter in the bag.  So cute!!\n\nWe went to 5280 online to search up local restaurants and check out different menus.  One of the things that jumped out from Olivia's website is that you can opt to add a $10 donation to your order and they will give a four-person pasta kit to a family in need. Also, if you buy a $100 gift card, they will give you an additional $25 gift card.   I really think it's more important than ever to support our local restaurants and businesses :)",
   "The food is consistently fresh, innovative and delicious!  Be sure to try the cocktails and wine, as both are well curated and crafted.  The only downside is the parking; use the valet, or if you plan to drink much, call an Uber.",
   "Giving it a 4 because of the ambience. Super romantic, beautiful place. Sit on the patio. It's mostly all dates here. You can absolutely dress up. Food is very mediocre and pricey. Service was good."
  ]
 },
 {
  "name": "Linger",
  "address": "2030 W 30th Ave, Denver, CO 80211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e06e34d0-932f-11ea-a66a-14b31f159f22.png",
  "tags": [
   "delicious",
   "art",
   "food",
   "food",
   "free",
   "food"
  ],
  "link": "https://maps.google.com/?cid=17836480053584340068",
  "source": "GoogleMaps",
  "reviews": [
   "Wasn't impressed. Nice ambiance but their brunch was definitely underwhelming. Very basic menu items for inflated prices. Hardly a brunch menu, mostly was like lunch with some eggs & 1 french toast option. Not for me personally. Go elsewhere for brunch. Endless mimosas are poured super heavy though!! And very very tasty!",
   "Only went here for drinks, but it was awesome. Super packed until it started to slow down around 10 or 11pm. I don't know the bartenders name but he was awesome. He created drinks that were amazing art and chemistry. Shoot out to him and his creativity skills! Had a dark chocolate orange, elderflower,  and Andes mint martinis. All were delicious and he shared the story of the owners bigger picture with us.",
   "What an amazing experience! I took my wife for her birthday and man it blew me away honestly! The menu is kind of confusing but everything I’ve tried made my mouth drop in awe. Very clever menu and the best waiter I’ve ever had! Name was Ethan. Never had a waiter so informative and caring. 5 star service and 5 start food. Will definitely be back! Ethan deserves a raise! 🤘🏻",
   "I've been enjoying this establishment for many years, Every time is a new adventure.\nThe atmosphere is perfect for a business lunch or first date.\nFood is exquisite and drinks are as well.\nYou will be paying for the quality no doubt.\nIf you plan to have dinner on at a peak time make reservations for sure..",
   "This was amazing! With a restaurant like this it's as much about the experience as it is the food. Having said that, both here were well above the average. The service was too notch even though it was busy AF!\nWe ordered a couple large and small dishes each. Had a couple drinks. And even ordered dessert. We couldn't finish everything. Didn't hardly touch one of the big dishes except to try it. \nThe worst thing we ate would've been the best at most other restaurants. Even the sweet potato waffle fries with Chipotle ketchup were 👌.\nMost of the large dishes were a little less than $20, smaller dishes $8-15, and there were a couple dishes on the higher prices side (still below $30).\nThey had a lot of vegan, gluten free options as well.\nThis is a place we will definitely go back to!\n\nYou're welcome😁"
  ]
 },
 {
  "name": "The Kitchen American Bistro",
  "address": "1560 Wazee St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e0b242e6-932f-11ea-b099-14b31f159f22.png",
  "tags": [
   "family",
   "food",
   "food",
   "family",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16485457117119492314",
  "source": "GoogleMaps",
  "reviews": [
   "The Kitchen Bistro in Denver was a hit with my family due to its farm to table food. Seafood flown in daily. All quality fresh ingredients; all the food delivered to my table had a stylish presentation and taste. The brick walls give the place a wonderfully warm atmosphere. I expect everything would be good here. The grilled sea bass with beans was exceptional as was the Brussels sprouts. Service was attentive and helpful. Full bar. Good wines by the glass.",
   "Really a very good higher end restaurant in Denver. Got to talk to the assistant manager and had only one issue... Not a complaint!  I won't post it here since I am sure it was a \"one off\" thing with my order. But everything was pretty much spot on!  Definitely give this place a try if you are in the area.",
   "Denver restaurant week was wonderful. We loved all the food. My friend and I were there for 3 hours eating food and chatting. Had a wonderful time.",
   "Simple salad done in best possible way. Nice dressing and right amount of the sour and salt to bring up the fresh veggies flavors. Farm to table, good egg and hash brown.  Mimosa is the only thing I don’t enjoy as much. Too much bubble. Other than that, it’s fantastic.",
   "I came here for a private party and everything was phenomenal. We were served family style courses and the food was top notch. Great atmosphere right in the heart of Denver. Kelsey- our server- went above and beyond. He provided great wine recommendations, and made sure our glasses were never empty. If you're looking to book a private dinner party, this is your place."
  ]
 },
 {
  "name": "SuperMegaBien",
  "address": "1260 25th St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e10ac358-932f-11ea-b795-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food"
  ],
  "link": "https://maps.google.com/?cid=16781023924831915143",
  "source": "GoogleMaps",
  "reviews": [
   "Love the atmosphere and concept. True Dim Sum plates, which come around to be immediately plucked off a tray. It’s great because you get to see all the options. Super fresh, great flavors. Will be back, highly recommend!",
   "This place was the sweetest surprise. \nI’d been wanting to try it out, but hadn’t made plans yet. My girlfriend and I were having drinks at Death & Co next door and needed some food, so we stubbles next door and totally fell in love. Amazing food, lovely staff, delicious drinks and the atmosphere does it all. \nDo yourself a favor and stop in here!",
   "What a great place for a group.   You can try a bit of everything.      All of the food was excellent!   Especially liked the pork entree.   It is loud, but that is what makes the party atmosphere.",
   "Delectable tapas... Every single dish was excellent! We stuffed ourselves. The purple Marg wasn't worth $13 in my opinion, but everything else made up for it, including the incredible wait staff and service! Definitely check out the happy hour... It's a steal!",
   "Super mega good on the interior design and mood - funky, artsy, edgy, Latin inspired with a hint of Chinese influence (just look at the rice-to-go-box reception desk). Cool dim sum concept for Latin American eats, but because of the concept, some dishes could be a bit more fresher..still a very delightful experience!"
  ]
 },
 {
  "name": "Morin",
  "address": "1600 15th St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e156e7ae-932f-11ea-9a9e-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=14587322118670738394",
  "source": "GoogleMaps",
  "reviews": [
   "Incredible experience here! The food is spectacular and the staff is warm and welcoming with exceptional customer service! It's a place you must go and enjoy!!! Everything was wonderful but the smoked beet dish was especially magical!",
   "This place was amazing! The food was spectacular, and the server was very intelligent and he knew what he was doing. The menu offers many different types of food and drink, and the desert menu is amazing! The atmosphere is great, and the overall experience is one you will surely remember. Make sure to find a way to go to this restaurant.",
   "Morin was phenomenal.  New favorite French restaurant in west of the Mississippi.   Get the west and east coast oysters, extra fresh shaved horseradish.  The gnocchi was incredible as was the filet and full fish special.  Excellent wine selection and loved their spin on a Manhattan with the cognac infusion.  You won't be disappointed.",
   "Great oysters.  Beef short ribs were excellent.  The atmosphere is fun and sophisticated.  A bit pricey, but the food was really good.   Service was great.",
   "I absolutely love this place.  I think Morin is my new favorite Denver restaurant.  It's a nice little small space with a friendly casual vibe.  The staff is very friendly and helpful.  What I love most is the food.  The kitchen really seems to know what they are doing.  I've had the duck breast and bavette steak.   Both were cooked to perfection with delicious sauces.  It is a bit pricey, but the portion sizes are quite good.  I will be visiting often."
  ]
 },
 {
  "name": "Ocean Prime",
  "address": "1465 Larimer St, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1a30c18-932f-11ea-a819-14b31f159f22.png",
  "tags": [
   "delicious",
   "drink",
   "eat",
   "food",
   "delicious",
   "food",
   "delicious",
   "food",
   "delicious",
   "drink",
   "food"
  ],
  "link": "https://maps.google.com/?cid=3708060162046751221",
  "source": "GoogleMaps",
  "reviews": [
   "We went for restaurant week and honestly I was super impressed. This place has the perfect vibe, service quality, and delicious food. Our server was awesome and it was exactly the experience you would hope for from an upscale restaurant. I don't eat fish at all and still found plenty to love! Try the berries and bubbles drink - super cool!",
   "The food here is delicious. I gave four stars because I wish the restaurant had been quieter, it was pretty hard to hear and understand my waiter. That is my only complaint, though. Everything I ate here was truly very good. I had the goat cheese ravioli, the chicken entree, and butter cake for dessert. The ravioli was creamy and soft. It was pretty rich. The chicken was cooked perfectly, the skin was crispy and nicely spiced, it paired really well with the sauce. The spinach salad was absolutely fantastic, those homemade croutons were a great touch. And the butter cake was rich and sweet and was amazing with the homemade ice cream and raspberry sauce. The waiter was kind and his support man was very attentive. We didn't want for anything.",
   "Fantastic. Upscale. Worth the money. The drinks were amazing and so was everything we ate. I had the scallops and he got the lamb. We also hot the steak tartar and the cheese fondue. You have to try this place for date night/special occasions.",
   "Made a reservation for a birthday celebration and everything went smooth. Excellent service  from beginning to end. Delicious food and delicious interesting drinks. The calamari appetizer was one of my favorites, great flavor and perfect crispiness.",
   "Everything was wonderful! The servers, the bartender, the atmosphere and the food. Our server Carolyn was so friendly and accommodating, I requested a drink that was not on the menu and the bartender went above and beyond to research the drink and made it deliciously. We ordered the ribeye steak and it was cooked to perfection. The sides were twice baked and black truffle mac n cheese and they were delicious.  Highly recommend this place."
  ]
 },
 {
  "name": "duo Restaurant",
  "address": "2413 W 32nd Ave, Denver, CO 80211, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e1e5e1be-932f-11ea-982d-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "delicious",
   "family",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=12927526099853055559",
  "source": "GoogleMaps",
  "reviews": [
   "I was very impressed with this place. My girlfriend has a nut allergy and they were accommodating with menu items and adjusted them to be allergy safe. The food was delicious! The short ribs fell off the bone and the sweet potatoes were outstanding! Dylan who helped me was very personable and friendly. The chocolate mousse dessert was light but very rich and flavorful. We can’t wait to go back!",
   "Overall a good atmosphere to bring friends, family or your date to. It was a little hot in the building which kind of dampened the overall experience but the food was great. The cheese plate was amazing and everything paired very well together. Their lamb entree was cooked as described and carried some mild flavor as well. The Bison entree was my top recommendation. Cooked super well and plenty of flavor to go around. Salmon was \"delicious\" as well. Nice cozy vibe, not too loud. It would be nice if the AC worked a little better though 😉! Would recommend.",
   "We had a great dinner here during restaurant week. Enjoyed every single item and look forward to coming back.",
   "I had come to Duo a while ago for brunch, loved it and completely forgot about their dinner service until we were thinking to celebrate my dad’s birthday and were looking for an American farm to table restaurant in the neighborhood. We booked Duo and proceeded to have one of the best meals we’ve had in Denver, complete with rich bone marrow complimented by gorgeous pickles, mussels with a complex and delicious broth, 3 amazing  entrees: the chicken, trout, cassoulet. Every single one was full of flavor, fresh and beautifully presented. The service was wonderful, and the server’s suggestions were helpful and they went out of their way to accommodate us. It was so rewarding to see how much this restaurant clearly prides itself on serving delicious food with superb service, and I was super impressed. It’s earned it’s place as one of the best meals I’ve had in Denver, and I will be adding this to my list of places I will be coming back to soon. Thank you for making our night SO special!",
   "Duo is awesome. I go there quite often and it never disappoints!!  They have decreased the number of tables to allow for ‘social distancing’ so I felt quite comfortable. Go and enjoy with NO fear!"
  ]
 },
 {
  "name": "City O' City",
  "address": "206 E 13th Ave, Denver, CO 80203, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e22ada4c-932f-11ea-ac70-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "walk",
   "unique",
   "food",
   "delicious",
   "art",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=4306999251885169469",
  "source": "GoogleMaps",
  "reviews": [
   "A local friend recommended this spot a while back. I finally got around to visiting and I'M IN LOVE!! As someone who is gluten intolerant (and occasionally adopts the vegetarian / vegan lifestyle), City O' City blew me away. Great prices, incredible variety, amazing service, and a cozy atmosphere. The portions were perfect if not generous. I could hype this place up forever! I got the chicken (cauliflower) and waffles and a mocha on the side. Everything tasted out of this world. Nothing left me even close to disappointed. The batter on the cauliflower us just a bomb of flavor. My friend got the burrito and enjoyed it as well, even as someone who does not partake in the vegetarian lifestyle. I can't wait to come back to Denver just to hit up City O' City again! 🙌😍",
   "Awesome restaurant! This was my first time experiencing City O' City. I had high expectations after eating at their other restaurant Watercourse Foods. We waited a few minutes to sit, but the service was wonderful. The food was delicious! We ordered the large sausage and peppers pizza with the vegan cashew ricotta and the fried ravioli. Originally I figure we would have leftovers, but the food was so good we ate it all. Thank you for a wonderful dining experience!",
   "Looks like cauliflower is getting a comeback. Love how they spice everything and add the right flower to these tacos 🌮. So amazing m, one of my favorite vegan places in Denver. Loved to walk to this place when I lived in capital hill. The coffee and the baked good are awesome as well to come and relax. The decorations add a nice ambience.",
   "Amazing vegan food! I was told by every vegan friend who's been to Denver that I must go here and to Watercourse Foods (same owner). They gave me great advice! City O' City is one of the very best vegan restaurants I've been to and I've been to many of them. The great bar selections, the excellent staff, food and wonderfully unique atmosphere are all on-point all-the-way!\nNote: next door is a bakery owned by the same folks with soft serve vegan ice cream too. It's amazing as well!",
   "Great spot. I’m from Jersey, the friends I was with are from Atlanta and it was just a good time.  I loved the food, the chicken and waffles were delicious, the fried ravioli as well. decent coffee and wonderful service. I really enjoyed the art one the walls. They feature an artist every month I believe. Music was good, I’d recommend a visit if you’re in town."
  ]
 },
 {
  "name": "Sushi Ronin Denver - Sushi and Sake Bar",
  "address": "2930 Umatilla St, Denver, CO 80211, USA",
  "avg_visitor_review": 4.4,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e27577d8-932f-11ea-af83-14b31f159f22.png",
  "tags": [
   "food",
   "drink",
   "food",
   "delicious"
  ],
  "link": "https://maps.google.com/?cid=951955383096780487",
  "source": "GoogleMaps",
  "reviews": [
   "Food was really good, but the staff is what makes this place great. You can tell these people enjoy their jobs and as someone who has worked in the industry it is great to see! Thank you for a lovely evening, the recommendations on where to visit after dinner, and laughs! I didn't get our server's name but he had a great smile, hot beard, and super sweet...and to his coworker that had a butt to die for...you're fab! Thanks again guys! Hope to visit again some time soon!",
   "Arrived solo at 5:30 pm on a misting Thursday evening and sat at the sushi bar. Given the early dinner there were only a few other patrons at the cocktail bar, sushi bar and tables combined.\n\nThe ambience was welcoming, with Edison lights and big open windows. I was quickly greeted by one of the sushi chefs with a small cucumber salad before deciding on getting Chirashi ($28).\n\nIt came with miso soup and a salad. The soup was standard miso, and the salad had fresh greens and wonderful vinaigrette. As soon as I was finished the chef, who I watched prepare the Chirashi dish, had it ready and walked me through each piece.\n\nFor Denver, the sushi was fresh, the presentation was superb and I was completely satisfied by the portion size. Well worth the money and immediately a place I want to come back to.\n\nHighly recommend for friends, informal business gatherings and even a casual date spot.",
   "This place is my favorite. I visit a lot of restaurants but to this restaurant I  constantly return again and again. The team is very affectionate and the cuisine they serve is so yummy. I never miss an opportunity to have a decent dinner in this place. I recommend this place with pleasure.",
   "Went for a birthday dinner. We had a great time! Sat at the sushi bar, so it was great to watch everything be made, and see other dishes be made, definitely makes one interested in trying different things. The food was excellent and I was very happy with all the dishes we ordered. Very comfortable setting, not too loud or too quiet. Great list of different Sake and drinks to order. Right next to El Five which is a great place to grab a drink before hand. I will be back in the future!",
   "New favorite place ❤ Great people are here. Delicious Sushi, Great feel and atmosphere & Hot Sake; what else can I say? I had a wonderful time. Located in an exciting area that is fun and lively.  Big Thank You to Jason for the good conversation."
  ]
 },
 {
  "name": "Old Major",
  "address": "3316 Tejon St, Denver, CO 80211, USA",
  "avg_visitor_review": 4.5,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e2b78a36-932f-11ea-9e60-14b31f159f22.png",
  "tags": [
   "delicious",
   "food",
   "food",
   "delicious",
   "food"
  ],
  "link": "https://maps.google.com/?cid=1408703821568641290",
  "source": "GoogleMaps",
  "reviews": [
   "Crowded for brunch, but service is friendly and attentive. Tried their Chicken & Waffle. 2 pieces of dark meat perfectly fried, tender and juicy. Waffle is thin and buttery, meant as a vessel for the chicken more than an equal part of the plate. Main thing that stood out to me is the maple syrup was served in a small warmed container, ensuring it remains easily pourable during your meal. Maple syrup itself was also great quality, brings the plate together well. White gravy was so-so, I'm more of a brown gravy person.",
   "Really great bourbon selection, food is on point and delicious. The neighborhood is adorable with a local butcher shop next door. Loved this brunch!",
   "service, food, drinks, and prices were incredible. I highly recommend this place. I went here for my birthday dinner and I was grinning the whole time because I loved everything about it. HIGHLY RECOMMEND. The staff is super great too. I recommend any meat place but especially the 3 pound pork.",
   "What an experience! So comfortable, yet stylish. Our server was quick, shared his favourites without being asked, and kept us smiling throughout. The ham and biscuits appetizer was perfect, light fluffy biscuits flavored with cheddar surrounding thinly sliced ham that was some of the best I've ever tasted. My wife's hanger steak was cooked perfectly, and seasoned just as well. The \"Nose to Tail\" entree was equally impressive, with a house-made sausage, well rendered belly meat, crispy pig ears, and a rib that made my day. The oysters were easily the best I've had in Denver. A butterscotch pot de creme with the best shortbread cookie ever rounded out our meal. We will be back.",
   "Service was next level and the food was so good. Went for brunch with some friends and had a wonderful time, the server worked with my request for a side salad that wasn't on the menu as a side salad, it was INCREDIBLE and I am so glad he and the kitchen were willing to be flexible. My eggs Benedict was very delicious also. I plan to come back again soon."
  ]
 },
 {
  "name": "Uchi Denver",
  "address": "2500 Lawrence St, Denver, CO 80205, USA",
  "avg_visitor_review": 4.7,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3116a42-932f-11ea-a199-14b31f159f22.png",
  "tags": [
   "knowledgeable",
   "tasting",
   "food",
   "delicious",
   "food",
   "drink",
   "food",
   "eat",
   "food"
  ],
  "link": "https://maps.google.com/?cid=18397140901008652799",
  "source": "GoogleMaps",
  "reviews": [
   "First time out since our daughter was born and it was absolutely the right choice for this night. The server was very knowledgeable and made great sake suggestions along with being able to guide us through the menu. She suggested the chefs tasting menu since it was our first time visiting, and after going through it, I would recommend  anyone else who wants to see what Uchi is about to do the same. The food was beautifully plated, and some of the best fish dishes we have had.",
   "Great food. The service is also very good. Went for my wife’s birthday. We had food from the regular menu as well as the happy hour menu. Everything was was good. Our favorites were the happy hour albacore and the mushroom dish. I am very much a meat eater but the mushroom vegetarian dish was my favorite. We had the fried milk and banana cake dessert. We all loved the banana cake desert. It is very coffee forward but delicious. \n\nThis is my favorite sushi restaurant in the downtown area.",
   "This was one of the most exquisite dining experiences ever. These were the tastiest, most amazing tastes I’ve ever had. So many nuanced flavors. Grazing through the menu is fantastic.  Depend on your server to guide you through. Thank you Andrew and team for making our NYE very special. Your graciousness and excitement about Uchi helped to make an amazing night!",
   "Not sure what all the hype is about. We finally gave this place and try and while the atmosphere was very cool the portions were so small and overpriced! They have a special vegetarian menu which is great, however, many of the things can’t be made vegan so the options are slim. We paid $18 for a small, bite size piece of tofu, and then another $18 for a small bowl of grilled veggies with rice. The sushi pieces themselves were about the size of a quarter in circumference which I have never seen before and I have dined at many higher end sushi restaurant all over Denver. We ended up spending $100 just to to fill up and it was not really worth it. The food itself was very good, but there was not much of it. Could think of many other places we could have gone for that price to have a dinner. This is great place if you want to have a few small plates and a drink, but not a dinner. I hope they can increase their portion sizes somewhat for what they are charging and have a little bit more variety. I don’t think I’ll be returning.",
   "Uchi is phenomenal. The food is incredible - and the milk balls is the best way to end the night. Staff was accommodating for my wife’s birthday, and recommended the perfect mix and amount of food. \n\nI rarely eat fish, but get it every time at Uchi."
  ]
 },
 {
  "name": "Bistro Vendôme",
  "address": "1420 Larimer St UNIT 1705, Denver, CO 80202, USA",
  "avg_visitor_review": 4.6,
  "avg_time_spent": null,
  "photo_location": "../data/GoogleMaps/photos/e3579b14-932f-11ea-a111-14b31f159f22.png",
  "tags": [
   "food",
   "delicious",
   "food",
   "drink",
   "food",
   "food",
   "music"
  ],
  "link": "https://maps.google.com/?cid=2774972840130000270",
  "source": "GoogleMaps",
  "reviews": [
   "Amazing food! Looks and tastes just like a real french bistro!! Give it a try, you won't regret it! (Also, the chocolate souffle will change your life)",
   "Food was delicious!  Service was amazing! And scenery is beautiful! We dined 'outside'between the shops and the restaurant. They painted the ceiling to look like the sky.",
   "An interesting restaurant. While we were a large group, and only ordered from a set menu, the dishes were well liked, and the wine selection was appropriate. I even had a plant based meal made of potatoes in a cilantro based sauce that was tasty. While this is named with French names, don't expect them to speak French.",
   "I love this place. It's a small, unassuming French restaurant off Larimer.  They have a great wine selection, ever changing food menu and quaint feel.\n\nThis is a great place to have a special date or a large party.\n\nYou can also sit at their bar. It's small, so plan ahead, but they have great happy hour specials for food and drink, so it's also a great place to stop in for a drink and quick bite before a show.",
   "Food and atmosphere are incredible! Waitstaff has for the most part been excellent except for our last visit. Our main waiter made us feel invisible.... will be back again to give it another chance because it’s like stepping back to France.  One recommendation would be to have French music playing in the background instead of “today’s hits” or maybe even have live music in the courtyard in good weather?"
  ]
 }
]